[
  {
    "source": "Decrypt",
    "date": "2023-10-27T19:20:38.000Z",
    "title": "Shutterstock Integrates AI Into Its Library of 700 Million Images",
    "url": "https://decrypt.co/203436/ai-generated-stock-photos-shutterstock-700-million-images",
    "description": "Shutterstock joins Getty Images and Canva in introducing creator-friendly AI art generators."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-27T19:17:26.000Z",
    "title": "Chainlink Jumps 6% While Bitcoin and Ethereum Hold Steady",
    "url": "https://decrypt.co/203502/chainlink-jumps-6-while-bitcoin-and-ethereum-hold-steady",
    "description": "The main cause of Bitcoin’s soaring price: Mounting hype and certainty among investors that the SEC will soon approve a spot Bitcoin ETF."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T19:26:40.000Z",
    "title": "Lawyer questions Sam Bankman-Fried on his political donations at trial",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-political-donations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e13a6e6f-7368-4120-b10e-be8d67782e93.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO reportedly said the donations made in his name came from “loans from Alameda Research” as part of efforts to influence U.S. regulations on crypto.</p>\n                    <p><p>Sam “SBF” Bankman-Fried’s defense attorney Mark Cohen heard testimony from the former FTX CEO on his relationship with Caroline Ellison and political donations from the crypto exchange.</p><p>According to reports from the courtroom on Oct. 27, Bankman-Fried <a href=\"https://twitter.com/innercitypress/status/1717968540022534291\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> not to have discussed donations to U.S. politicians with former FTX engineering director Nishad Singh and former FTX Digital Markets co-CEO Ryan Salame. SBF reportedly said the donations made in his name came from “loans from Alameda Research” as part of efforts to influence U.S. government’s policies on regulating crypto. </p><blockquote>“[...] I thought policy was important. Congress and the executive branch… Some were [supportive of] FTX for cryptocurrency lobbying. Some, not most.”</blockquote><p>Cohen also posed more personal questions seemingly unrelated to the allegations SBF was facing in court. The defense lawyer asked Bankman-Fried what led to the end of his relationship with Ellison.</p><p>“She wanted more than I could give,” the former FTX CEO reportedly said, referring to Ellison. “It wasn’t the first time with me.”</p><p>During her testimony, Ellison <a href=\"https://cointelegraph.com/news/caroline-ellison-testifies-sam-bankman-fried-trial\">said the relationship ended</a> as SBF “wasn’t spending much time” with her. Cohen asked the former FTX CEO the reasons behind his style, with SBF replying his hair was the result of him being “lazy” while he found wearing shorts and T-shirts on most occasions “comfortable.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-moves-final-stages\"><strong><em>Sam Bankman-Fried trial moves to final stages</em></strong></a></p><p>In earlier testimony on Oct. 27, the former CEO reportedly <a href=\"https://cointelegraph.com/news/sam-bankman-fried-denies-defrauding-ftx-users\">denied defrauding FTX users</a> by directing efforts at Alameda allowing the firm to use customer funds. Former FTX chief technology officer Gary Wang and others offered testimony claiming SBF had given Alameda the ability to trade more funds than it had available.</p><p>Bankman-Fried's testimony will likely end by early next week following cross-examination by attorneys with the U.S. Department of Justice. Barring addressing any motions or legal hiccups, the court will then likely instruct the jury to deliberate on the seven criminal charges.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T19:20:00.000Z",
    "title": "Audits and rug-pulled projects, a $650B token burn, and major DeFi protocol quits UK: Finance Redefined",
    "url": "http://cointelegraph.com/news/audits-and-rug-pulled-projects-a-650b-token-burn-and-major-defi-protocol-quits-uk-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/dad4d593-ac33-4590-a8ff-61a38f163f18.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Uniswap’s founder burned $650 billion of HayCoin, amounting to 99% of the token’s supply.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in DeFi was filled with bullish resurgences for many projects, but it was the Uniswap founder’s $650 billion HayCoin (HAY) burn — 99% of the token supply — that grabbed headlines. In other news, a new report highlighted that 85% of the rug-pulled DeFi projects in Q3 didn’t report an audit, and the largest DeFi protocol on Solana has shut down its United Kingdom operations due to strict regulations imposed by the Financial Conduct Authority (FCA).</p><p>The top 100 DeFi tokens had a bullish week, with most of the tokens trading in green with double-digit weekly gains. </p><h2>85% of crypto rug pulls in Q3 didn’t report audits: Hacken</h2><p>Cryptocurrency rug pulls are not too difficult to spot by investors, as the majority of such scams usually share distinct and visible features, according to a new report.</p><p>Blockchain security auditor Hacken released its latest security insights report on Oct. 25, aiming to spot the trends in Q3 crypto hacks and evaluate how affected projects approached security.</p><p><a href=\"https://cointelegraph.com/news/rug-pulls-audits-report-hacken\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/rug-pulls-audits-report-hacken/amp\"><strong>Continue reading</strong></a></p><h2>Largest DeFi protocol on Solana reportedly quits U.K. market, citing FCA rule</h2><p>Marinade Finance, the largest DeFi protocol running on the Solana blockchain, has reportedly started blocking users from the United Kingdom. Customers in the U.K. discovered the problem on Oct. 23 while trying to access Marinade’s website from local IP addresses.</p><p>Marinade Finance has around 75,000 users with a total value locked of over $265 million at the time of writing, accounting for 70% of all the funds locked on the Solana blockchain. </p><p><a href=\"https://cointelegraph.com/news/defi-solana-marinade-uk-regulations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-solana-marinade-uk-regulations/amp\"><strong>Continue reading</strong></a></p><h2>Uniswap founder burns $650 billion in HayCoin against speculation</h2><p>Uniswap founder Hayden Adams burned 99% of the HayCoin supply on Oct. 20, according to an announcement on X (formerly Twitter). The majority of the tokens have been removed from circulation due to Adams’ concerns about price speculation over the previous days.</p><p>Adams deployed the HAY token for testing five years ago, before the launch of the decentralized protocol Uniswap. He created a small test liquidity pool with a tiny fraction of the total supply and kept over 99.9% of HAY tokens in his wallet. Just a few weeks ago, the token was trading like a memecoin in the six-figure range.</p><p><a href=\"https://cointelegraph.com/news/uniswap-hayden-adams-burns-650b-haycoin-speculation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uniswap-hayden-adams-burns-650b-haycoin-speculation/amp\"><strong>Continue reading</strong></a></p><h2>Polygon launches POL token contract on Ethereum to eventually replace MATIC</h2><p>Polygon Labs has launched the Ethereum contract for the new Polygon token, POL, according to an Oct. 25 announcement. The new token is intended to replace Polygon’s (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC)</a> token. However, the team said users currently don’t need to exchange their MATIC for POL.</p><p>According to blockchain data, the new token was created on Oct. 25 at 9:06 am UTC. Its full name is the “Polygon Ecosystem Token.” In the announcement, the Polygon team claimed that POL would “power a vast ecosystem of zero knowledge-based Layer 2 chains” by implementing a “re-staking protocol” that allows tokenholders to stake it on multiple chains, performing multiple functions in the process.</p><p><a href=\"https://cointelegraph.com/news/polygon-launches-pol-token-contract-ethereum-eventually-replace-matic\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-launches-pol-token-contract-ethereum-eventually-replace-matic/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green on weekly charts. The total value locked into DeFi protocols jumped nearly $6 billion to $49.16 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/0df95d97-5cd3-45fa-ba76-50d50fbde9b6.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T19:10:47.000Z",
    "title": "Thousands of Coinbase users sign up as potential amicus curiae in legal fight with SEC",
    "url": "https://cryptoslate.com/thousands-of-coinbase-users-sign-up-as-potential-amicus-curiae-in-legal-fight-with-sec/",
    "description": "<p>Around 5,000 Coinbase users have signed up as potential amicus curiae in the legal battle against the U.S. Securities and Exchange Commission (SEC), according to pro-XRP lawyer John Deaton. In an Oct. 27 post on X (formerly Twitter), Deaton revealed that he would file the amicus curiae brief on behalf of these Coinbase users if [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/thousands-of-coinbase-users-sign-up-as-potential-amicus-curiae-in-legal-fight-with-sec/\">Thousands of Coinbase users sign up as potential amicus curiae in legal fight with SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-27T19:30:11.000Z",
    "title": "Dydx Chain Unveils Network Fee Distribution and USDC Trading Fee Allocation",
    "url": "https://news.bitcoin.com/dydx-chain-unveils-network-fee-distribution-and-usdc-trading-fee-allocation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Dydx Chain Unveils Network Fee Distribution and USDC Trading Fee Allocation\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dydx.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Dydx chain, a proof-of-stake blockchain network, has successfully launched its mainnet and introduced dydx as its layer one (L1) token. On October 26, at 1 p.m. EDT, the network’s validators created the first block, signifying the start of a new era for the Dydx chain. The introduction of dydx as the L1 token brings [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T19:31:55.000Z",
    "title": "Indian banks collaborate to promote E-Rupee adoption",
    "url": "https://www.cryptopolitan.com/indian-banks-collaborate-to-promote-e-rupee-adoption/",
    "description": "Several leading banks in India are joining forces to promote the use of the e-rupee, a central bank digital currency introduced by the Reserve Bank of India. In a bid to encourage wider adoption, these banks have introduced various incentives, including cashbacks and rewards, akin to those offered on credit and debit cards. The move ... <a title=\"Indian banks collaborate to promote E-Rupee adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/indian-banks-collaborate-to-promote-e-rupee-adoption/\" aria-label=\"More on Indian banks collaborate to promote E-Rupee adoption\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T19:19:50.000Z",
    "title": "Full Bitcoin Blocks Offer Added Protection Against Cybercriminals, Study Finds",
    "url": "https://www.cryptopolitan.com/full-bitcoin-blocks-against-cybercriminals/",
    "description": "A recent research study conducted by Florida Atlantic University and the University of Mississippi sheds light on the intriguing relationship between the fullness of Bitcoin blocks and the security of the cryptocurrency ecosystem. The study, titled &#8220;Bitcoin Blocksize, Custodial Security, and Price,&#8221; delves into the impact of full blocks on deterring nefarious actors, such as ... <a title=\"Full Bitcoin Blocks Offer Added Protection Against Cybercriminals, Study Finds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/full-bitcoin-blocks-against-cybercriminals/\" aria-label=\"More on Full Bitcoin Blocks Offer Added Protection Against Cybercriminals, Study Finds\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T19:32:48.000Z",
    "title": "Binance adds Memecoin to Launchpool, partners with 9GAG’s Memeland",
    "url": "https://crypto.news/binance-adds-memecoin-to-launchpool-partners-with-9gags-memeland/",
    "description": "Binance introduces Memecoin, a collaboration with 9GAG's Memeland, to its Launchpool platform, offering users a 30-day staking period across multiple pools."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T19:30:47.000Z",
    "title": "Craig Wright wins in U.S. appeals court over multi-billion-dollar Bitcoin dispute",
    "url": "https://crypto.news/craig-wright-wins-in-u-s-appeals-court-over-multi-billion-dollar-bitcoin-dispute/",
    "description": "Craig Wright, claiming to be Bitcoin’s creator, won a notable victory in a U.S. Appeals Court, sparking renewed discussions in the cryptocurrency community."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T19:09:50.000Z",
    "title": "ZachXBT alleges Bitboy $4k indicator is a scam",
    "url": "https://crypto.news/zachxbt-alleges-bitboy-4k-indicator-is-a-scam/",
    "description": "Anonymous blockchain sleuth ZachXBT calls out Bitboy, a crypto influencer and content creator, for selling a $3,999 indicator and paid group called ‘High IQ’ in an Oct. 27 post on X."
  }
]