[
  {
    "source": "CoinDesk",
    "date": "2023-12-04T11:49:20.000Z",
    "title": "Duo Behind $9M Platypus Exploit Acquitted by Paris Court: Report",
    "url": "https://www.coindesk.com/policy/2023/12/04/duo-behind-9m-platypus-exploit-acquitted-by-paris-court-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Charges were dropped after one of the accused argued he was an \"ethical hacker,\" according to French news publication Le Monde."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-04T12:00:55.000Z",
    "title": "Standard Chartered-backed Zodia Custody partners with Ripple institutional network Metaco",
    "url": "https://cryptoslate.com/standard-chartered-backed-zodia-custody-partners-with-ripples-institutional-network-metaco/",
    "description": "<p>Standard Chartered-backed Zodia Custody has integrated with Ripple-owned Metaco to streamline institutional crypto custody services, according to a Dec. 4 statement. The integration allows institutions to access Zodia Custody&#8217;s high-security solutions through Metaco&#8217;s platform. Institutions can leverage both platforms to enhance security measures, risk management, and solvency protection. The announcement stated that institutions connected to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/standard-chartered-backed-zodia-custody-partners-with-ripples-institutional-network-metaco/\">Standard Chartered-backed Zodia Custody partners with Ripple institutional network Metaco</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T11:49:18.000Z",
    "title": "Consulting Giants Harness AI to Accelerate Path to Partnership",
    "url": "https://www.cryptopolitan.com/consulting-giants-harness-ai/",
    "description": "In the dynamic world of professional services, a paradigm shift is underway. Consulting giants and prestigious law firms increasingly turn to artificial intelligence (AI) to expedite the journey from junior staff to the coveted partner position. This technological adoption transforms traditional career trajectories as AI streamlines repetitive tasks, allowing for more rapid advancement to higher ... <a title=\"Consulting Giants Harness AI to Accelerate Path to Partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/consulting-giants-harness-ai/\" aria-label=\"More on Consulting Giants Harness AI to Accelerate Path to Partnership\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T11:45:50.000Z",
    "title": "UK lawmakers push for extended CBDC trial evaluations",
    "url": "https://www.cryptopolitan.com/uk-lawmakers-push-for-extended-cbdc-trial/",
    "description": "In a decisive move, the UK&#8217;s House of Commons Treasury Committee has urged the Bank of England and HM Treasury to conduct comprehensive consultations to assess the viability of introducing a digital pound. This directive emerges amidst substantial costs incurred in the preliminary stages of developing a central bank digital currency (CBDC). Assessing costs and ... <a title=\"UK lawmakers push for extended CBDC trial evaluations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-lawmakers-push-for-extended-cbdc-trial/\" aria-label=\"More on UK lawmakers push for extended CBDC trial evaluations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T11:42:50.000Z",
    "title": "Potential GTA 6 Leak Emerges on Social Media Ahead of Official Trailer",
    "url": "https://www.cryptopolitan.com/potential-gta-6-leak-emerges-on-social-media/",
    "description": "A recent video circulating on TikTok purportedly revealed brief footage from the highly anticipated Grand Theft Auto VI (GTA 6), causing a stir among the gaming community. The leak is believed to have originated from the son of Aaron Garbut, co-studio head and art director at Rockstar North—the development studio behind the GTA series. Unverified ... <a title=\"Potential GTA 6 Leak Emerges on Social Media Ahead of Official Trailer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/potential-gta-6-leak-emerges-on-social-media/\" aria-label=\"More on Potential GTA 6 Leak Emerges on Social Media Ahead of Official Trailer\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-04T11:43:04.000Z",
    "title": "Stargate used voting for a $43k phishing attack",
    "url": "https://crypto.news/stargate-used-voting-for-a-43k-phishing-attack/",
    "description": "An unknown person posted an announcement about a Stargate vote that contained a phishing link. More than 1,000 people became victims of the scammer, experts from the PeckShield platform report. The incident was reported by the moderator of the Discord&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T12:00:38.000Z",
    "title": "Shiba Inu Price Enters Most Crucial Week In 1.5 Years, Here’s Why",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-most-crucial-week-1-5-years/",
    "description": "The Shiba Inu (SHIB) price is entering a week that has the potential to be the most important week in 1.5 years. As explained in previous analyses, SHIB has shown conflicting patterns in the weekly chart: a bullish quadruple bottom and a descending triangle. This week, the situation could be resolved and the bullish chart pattern may be validated. At press time, SHIB traded at $0.00000933. Thus, the Shiba Inu price broke above the descending trendline of the triangle pattern. Why SHIB Enters The Most Crucial Week In 1.5 Years The quadruple bottom pattern has formed over the extended period of 1.5 years, with the price touching the support zone between $0.00000715 and $0.000006 four times, creating an ultra-strong base. Over the last 18 months, it suggested a strong level of support, as SHIB has consistently bounced off this price point, indicating a reluctance to move lower. Related Reading: Shiba Inu Ripple: Massive $300 Billion Transfer Sends Crypto Community Into Speculation The descending triangle, characterized by a flat lower-bound support level at $0.00000715 and a down-sloping upper-bound resistance trendline, has acted as strong resistance. The price has been rejected at the resistance line a total of 10 times since last year. As the price pushed above this trendline, a weekly close above this line could signify the commencement of a bullish reversal. Moreover, the 50-week exponential moving average (EMA &#8211; orange line) also played a crucial role. On the occasions when SHIB was able to break out above the descending trend line of the triangle (on the lower time frames), it never managed to close the week above this indicator. This week, SHIB bulls have a new chance. While SHIB is already trading above the descending trendline of the triangle, the price still has to close above the 50-week EMA at $0.00000973 next Sunday. If it succeeds, this would mark an unprecedented extremely bullish sign. Finally, a breakout above the psychologically important level of $0.00001 could be the last hurdle for a strong move upward. A breakout of this nature could lead to a shift in market sentiment, with the potential to initiate a significant price surge. Related Reading: Shiba Inu L2 Shibarium Crosses 4 Million Transactions As Burn Rate Explodes Notably, the volume does not show an unusual spike yet, which would typically accompany a breakout, suggesting caution. However, the weekly RSI stands at 57.36, indicating the asset is neither overbought nor oversold and potentially allowing room for upward movement if a breakout is confirmed. Short- And Long-Term Shiba Inu Price Targets Looking at the Fibonacci levels, the upcoming key price targets to watch following a successful breakout would be the 0.382 and 0.5 Fibonacci levels, standing at $0.00001051 and $0.00001190, respectively. These levels would be the short-term targets for SHIB, potentially acting as resistance points in the event of an uptrend. In the mid-term, the next crucial price levels are the 0.618 Fibonacci level at $0.00001329, the 0.786 Fibonacci level at $0.00001527 and the August 2022 swing high at $0.00001780. However, traders can also expect notable resistance at $0.000017 which acted as crucial support and resistance in the past. In the long term, the 1.618 Fibonacci extension level at $0.00002509 and the 2.618 Fibonacci extension level at $0.00003690 are some notable price targets. In conclusion, the weekly close firmly holds the market&#8217;s attention. If SHIB&#8217;s price sustains above the descending trendline, it would mark a significant technical pivot point, likely catalyzing a bullish wave due to the culmination of the quadruple bottom support hold and the descending triangle breakout. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-04T12:06:17.000Z",
    "title": "Shiba Inu Surges 21%: Shibarium’s Meteoric Rise and the Quest to Remove a Zero",
    "url": "https://www.crypto-news-flash.com/shiba-inu-surges-21-shibariums-meteoric-rise-and-the-quest-to-remove-a-zero/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-surges-21-shibariums-meteoric-rise-and-the-quest-to-remove-a-zero",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SHIB-Shiba-Inu-Altcoin.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SHIBA INU\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SHIB-Shiba-Inu-Altcoin.jpeg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SHIB-Shiba-Inu-Altcoin-300x169.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SHIB-Shiba-Inu-Altcoin-1024x576.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SHIB-Shiba-Inu-Altcoin-768x432.jpeg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Shiba Inu (SHIB) has witnessed a substantial 21 percent surge in the past two weeks, driven by overall market momentum and positive sentiment surrounding Shibarium. Shibarium&#8217;s surge in daily transactions to 7.84 million and increased gas fees contribute to the positive momentum, potentially acting as catalysts for SHIB&#8217;s price. Shiba Inu has experienced a notable [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-04T12:03:59.000Z",
    "title": "Injective Rallies After OKX Listing and Latest Burn Auction; NuggetRush Becomes Whale Favorite, Bullish Indicator?",
    "url": "https://www.crypto-news-flash.com/injective-rallies-after-okx-listing-and-latest-burn-auction-nuggetrush-becomes-whale-favorite-bullish-indicator/?utm_source=rss&utm_medium=rss&utm_campaign=injective-rallies-after-okx-listing-and-latest-burn-auction-nuggetrush-becomes-whale-favorite-bullish-indicator",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-15.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-15.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-15-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-15-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-15-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-15-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Injective is trading on the upside following its OKX listing on November 30. NuggetRush draws whale attention thanks to its blend of GameFi, P2E, and Impact Gaming. According to experts, there will be a 50x uptick in the price of NuggetRush after launch. Injective (INJ) is in the spotlight once again. This time, the crypto [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-04T12:08:28.000Z",
    "title": "Binance Saga and Future Opportunities",
    "url": "https://www.altcoinbuzz.io/spotlight/binance-saga-and-future-opportunities/",
    "description": "<p>On November 22nd, Binance&#8217;s CEO, Changpeng Zhao (CZ), announced his resignation in the wake of the fine. You can find more research like this one if you subscribe to Altcoin Buzz Alpha Zhao, one of the crypto industry&#8217;s most influential figures, acknowledged making mistakes and emphasized that stepping down was in the company&#8217;s best interest. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/binance-saga-and-future-opportunities/\">Binance Saga and Future Opportunities</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]