[
  {
    "source": "Decrypt",
    "date": "2023-11-13T17:51:22.000Z",
    "title": "Grok Meme Coin Makes Millions Using Same Name as Elon Musk's AI Chatbot",
    "url": "https://decrypt.co/205864/grok-meme-coin-millions-same-name-elon-musk-ai-chatbot",
    "description": "If Elon Musk groks an AI chatbot, the meme coins will come."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-13T17:45:44.000Z",
    "title": "Singaporean VC firm Foresight Ventures buys 80% stake in The Block",
    "url": "https://cryptoslate.com/singaporean-vc-firm-foresight-ventures-buys-80-stake-in-the-block/",
    "description": "<p>Foresight Ventures, a Singapore-based investment firm, has bought a majority stake in crypto media company The Block, purchasing an 80% stake at $60 million. This strategic acquisition comes almost a year after the collapse of FTX and Alameda Research, from the latter of which The Block&#8217;s previous CEO, Mike McCaffrey, had borrowed several million dollars. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/singaporean-vc-firm-foresight-ventures-buys-80-stake-in-the-block/\">Singaporean VC firm Foresight Ventures buys 80% stake in The Block</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T18:05:08.000Z",
    "title": "Navigating the AI Startup Landscape: 5 Steps to Success in 2024",
    "url": "https://www.cryptopolitan.com/navigating-the-ai-startup-landscape/",
    "description": "Renowned AI expert and co-founder of Coursera, Andrew Ng, has recently shared a roadmap for creating successful AI startups in 2024. With his extensive experience, Ng offers valuable insights into the intricacies of the AI startup domain, providing entrepreneurs with a well-tested approach to building their ventures.The five essential steps outlined by Ng to create ... <a title=\"Navigating the AI Startup Landscape: 5 Steps to Success in 2024\" class=\"read-more\" href=\"https://www.cryptopolitan.com/navigating-the-ai-startup-landscape/\" aria-label=\"More on Navigating the AI Startup Landscape: 5 Steps to Success in 2024\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T18:00:11.000Z",
    "title": "Ethereum transaction fee climbs above 219%",
    "url": "https://www.cryptopolitan.com/ethereum-transaction-fee-climbs-above-219/",
    "description": "Over the recent three weeks, the realm of cryptocurrency transactions has witnessed a significant metamorphosis, particularly in the domains of Bitcoin (BTC) and Ethereum (ETH). Transaction costs for both these leading cryptocurrencies have experienced a noticeable surge, introducing a dynamic landscape for users partaking in digital asset transfers. Ethereum transaction fees rise to $6.64 Bitcoin, ... <a title=\"Ethereum transaction fee climbs above 219%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-transaction-fee-climbs-above-219/\" aria-label=\"More on Ethereum transaction fee climbs above 219%\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T17:53:59.000Z",
    "title": "OpenAI’s Board to Determine AGI: Implications for Microsoft and the World",
    "url": "https://www.cryptopolitan.com/openais-board-to-determine-agi/",
    "description": "OpenAI&#8217;s governance structure and the role of its board in determining the achievement of Artificial General Intelligence (AGI) has raised questions about the future of its partnership with Microsoft and the broader impact on the world. The organization&#8217;s complex nonprofit-capped profit structure and the potential conflict between for-profit and nonprofit interests have come under scrutiny. ... <a title=\"OpenAI&#8217;s Board to Determine AGI: Implications for Microsoft and the World\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openais-board-to-determine-agi/\" aria-label=\"More on OpenAI&#8217;s Board to Determine AGI: Implications for Microsoft and the World\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T17:49:06.000Z",
    "title": "WNBA star Jewell Loyd drums support for cryptocurrencies",
    "url": "https://www.cryptopolitan.com/wnba-star-jewell-loyd-support-crypto/",
    "description": "In the world of the Women’s National Basketball Association (WNBA), Jewell Loyd stands out as a scoring powerhouse. Her remarkable achievement of scoring 939 points for the Seattle Storm in the past year not only showcased her on-court prowess but also set a new single-season scoring record for the league. This accomplishment surpassed the previous ... <a title=\"WNBA star Jewell Loyd drums support for cryptocurrencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wnba-star-jewell-loyd-support-crypto/\" aria-label=\"More on WNBA star Jewell Loyd drums support for cryptocurrencies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T17:48:00.000Z",
    "title": "How AI Inspired a New Tartan Design",
    "url": "https://www.cryptopolitan.com/how-ai-inspired-a-new-tartan-design/",
    "description": "In a remarkable fusion of tradition and technology, a kiltmaker has harnessed the power of artificial intelligence (AI) to create a distinctive tartan pattern that pays homage to the world of AI. This innovative design, aptly named the &#8220;AI Tartan,&#8221; has recently been officially accepted onto the Scottish Register, marking a significant milestone in the ... <a title=\"How AI Inspired a New Tartan Design\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-ai-inspired-a-new-tartan-design/\" aria-label=\"More on How AI Inspired a New Tartan Design\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T17:53:16.000Z",
    "title": "Polygon shows ‘consistent growth’ in Q3, Nansen reports",
    "url": "https://crypto.news/polygon-shows-consistent-growth-in-q3-nansen-reports/",
    "description": "According to Nansen's data, Polygon has experienced \"consistent growth\" last quarter."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T18:00:50.000Z",
    "title": "Solana (SOL) Shines 40% Toward $60 As Whales Make Big Moves",
    "url": "https://www.newsbtc.com/news/solana-sol-shines-40-toward-60-as-whales-make-big-moves/",
    "description": "Undoubtedly establishing itself as a standout performer in the expansive altcoin market, Solana has achieved exceptional growth over the course of the past year, marking an impressive surge of nearly 300%. This remarkable ascent underscores Solana&#8217;s resilience and appeal within the cryptocurrency landscape. The cryptocurrency has not merely kept pace but has outpaced many of its counterparts, solidifying its status as a noteworthy investment choice. Presently exchanging hands at approximately $58, Solana exhibits an impressive display of relentless upward momentum, notably experiencing a noteworthy 40% surge in value within the last seven days alone. Source: Coingecko This surge not only reflects the cryptocurrency&#8217;s immediate strength but also contributes to its status as a formidable player in the digital asset arena. Related Reading: Boom! Cronos Unleashes 57% Weekend Explosion, Beating All In The Top 100 Crypto Ranking Solana Price Gets Boost From Whales As of the current moment, Solana proudly holds the prestigious position as the 7th largest cryptocurrency, fortified by a substantial market capitalization that has exceeded the impressive milestone of $24 billion. 🚨 325,222 #SOL (18,666,993 USD) transferred from unknown wallet to #Binancehttps://t.co/ECEpdMJM72 — Whale Alert (@whale_alert) November 11, 2023 Whale Alert revealed two significant Solana trades on November 12th, each worth more than $30 million. Transferring 325,222 SOL—worth more than $18.6 million—to the Binance exchange was the initial transaction. Solana whales have been engaging in a higher volume of huge transactions lately, transferring a considerable portion of the tokens to exchanges. Given this recent behavior, is it feasible that SOL&#8217;s gains would gradually decline? Taking long positions, traders are now witnessing a notable shift in behavior due to Solana&#8217;s highest positive funding rate of the year, reaching 0.07% on November 12. SOL market cap reached $24.2 billion today. Chart: TradingView.com This optimistic outlook reflects their confidence in the continued upward movement of the price. Meanwhile, the surge in Open Interest (OI) signifies a capital influx into Solana, with traders actively opening new positions. Coinglass&#8217; data reveals that Solana&#8217;s OI volume has been on a consistent upward trend since the beginning of November, reaching over $760 million at the time of writing. Source: Coinglass Notably, the last instance of SOL experiencing such a high OI volume was around May 2022. This historical context emphasizes the significance of the current surge in OI and its implications for Solana&#8217;s market dynamics. The rate of SOL is near the resistance on the hourly chart, indicating that buyers have some degree of influence over sellers. By the end of the day, if nothing changes, the growth may go pas the $60 level. Related Reading: Mysterious Wallet Transfers 18 Million MATIC To Coinbase – What’s Going On? According to the weekly chart analysis, the rate of SOL is poised to conclude within the positive zone. Currently, there is a lack of negative indicators. In the event of the bar&#8217;s closure in proximity to the $60 range, it is plausible that an upward movement might ensue, potentially culminating in an examination of the $65 range in the near future. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Pixabay"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-13T17:58:30.000Z",
    "title": "Shiba Inu’s Shibarium: Bringing DeFi to Centralized Exchanges",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-bringing-defi-to-centralized-exchanges/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-bringing-defi-to-centralized-exchanges",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba inu\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu&#8217;s development team is in talks with centralized exchanges to integrate Shibarium, boosting community engagement and market interest. Recent integrations and positive transactional data reflect Shibarium&#8217;s growing adoption and robust performance since its relaunch.  Shiba Inu&#8217;s development team has entered into active discussions with several centralized exchanges to explore the integration of Shibarium, its [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-13T17:55:38.000Z",
    "title": "Russian Court Fines Coinbase and Several US Tech Firms for Refusal To Localize Customer Data: Report",
    "url": "https://dailyhodl.com/2023/11/13/russian-court-fines-coinbase-and-several-us-tech-firms-for-refusal-to-localize-customer-data-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Adds-Popular-DeFi.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest US-based crypto exchange is reportedly being ordered to pay a penalty for violating a directive issued by authorities in Russia.  In May, the Roskomnadzor, which is in charge of monitoring Russian mass media, issued a directive obliging foreign companies to localize citizens&#8217; data starting July 1st. According to local business newspaper Vedomosti, a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/13/russian-court-fines-coinbase-and-several-us-tech-firms-for-refusal-to-localize-customer-data-report/\">Russian Court Fines Coinbase and Several US Tech Firms for Refusal To Localize Customer Data: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]