[
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T23:59:17.000Z",
    "title": " Crypto VC Polychain Capital confirms its founder’s X account is hacked ",
    "url": "https://cointelegraph.com/news/crypto-venture-firm-polychain-capital-confirms-founder-account-hacked",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzI4YjE0ZjYtMzQ5My00MThhLThjMTktOTNjODUzNmE4N2U5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Polychain Capital is urging users to stay away from the X account of its founder, Olaf Carlson-Wee — which is posting phishing links. </p>\n                    <p><p>Crypto venture capital firm Polychain Capital has confirmed the X account of its founder and CEO, Olaf Carlson-Wee, has been compromised, with the hacker posting phishing links disguised a website to claim an airdrop. </p><p>In a Jan. 4 statement, Polychain <a href=\"https://twitter.com/polychain/status/1743019573295894937\" target=\"_blank\" rel=\"noopener nofollow\">urged </a>X users to avoid interacting with Carlson-Wee’s handle until further notice.</p><p>“Register below to participate,” the message added, with a link to a URL purporting to be related to Polychain. </p><p><a href=\"https://cointelegraph.com/news/crypto-venture-firm-polychain-capital-confirms-founder-account-hacked\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T00:00:38.000Z",
    "title": "Realized losses spiked as Bitcoin saw turbulent start to the year",
    "url": "https://cryptoslate.com/realized-losses-spike-as-bitcoin-sees-turbulent-start-to-the-year/",
    "description": "<p>Three days into the new year and Bitcoin has already been through a rather turbulent period. Bitcoin saw its largest one-day price drop since the beginning of December, marking a 4.7% decrease. Bitcoin&#8217;s drop from a high of $45,500 to $42,800 in a single day triggered around $700 million in liquidations, with $170 million of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/realized-losses-spike-as-bitcoin-sees-turbulent-start-to-the-year/\">Realized losses spiked as Bitcoin saw turbulent start to the year</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-04T23:44:51.000Z",
    "title": "Arbitrum TVL tops $10B, token price hits record high",
    "url": "https://cryptobriefing.com/arbitrum-one-leads-charge-tvl-tops-10b-token-price-hits-record-high/?utm_source=feed&utm_medium=rss",
    "description": "The total value locked on Arbitrum One soared above $10 billion on January 3rd, marking a 430% increase year-to-date,"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-04T23:47:00.000Z",
    "title": "Rags to Riches: SOL Trader Makes 56,000% Return on Solana-Based Token",
    "url": "https://www.cryptoglobe.com/latest/2024/01/rags-to-riches-sol-trader-makes-56000-return-on-solana-based-token/",
    "description": "A cryptocurrency has managed to turn just 4 Solana (SOL) tokens into 2,250 SOL woth around $245,000 in just five days to make an impressive gain of over 56,000% after they spotted a meme-inspired cryptocurrency that had just started trading. According to on-chain analysis service Lookonchain, the cryptocurrency trader managed to spot the BORK token […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T23:53:46.000Z",
    "title": "Huobi Korea to shut down as South Korean crypto market tightens",
    "url": "https://www.cryptopolitan.com/huobi-korea-to-shut-down-south-korea/",
    "description": "South Korean cryptocurrency sector Huobi Korea, previously known as the Korean division of the global exchange HTX, has declared its intention to cease operations by January 29. This decision, disclosed in a recent announcement, is attributed to the challenging business environment faced by the exchange. Notably, Huobi Korea severed its association with HTX, formerly Huobi [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T00:00:25.000Z",
    "title": "Bitcoin Price Analysis: Ascending Parallel Channel Pattern Points To $57,000 Target",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-analysis-ascending-parallel-channel-pattern-points-to-57000-target/",
    "description": "As anticipation builds around the potential approval or rejection of spot Bitcoin (BTC) exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC) on January 5, the Bitcoin price has witnessed a notable 2.7% recovery in the past 24 hours.  This development comes amidst growing speculation about the patterns that could drive the Bitcoin price to reclaim the highs lost during the bear market in 2022.  Notably, crypto analyst Ali Martinez has identified an ascending parallel channel as the governing pattern behind the Bitcoin price action since September 2023. Bitcoin Price Faces Crucial Test At $48,000 According to Ali Martinez&#8217;s analysis, Bitcoin prices have exhibited a consistent pattern known as an ascending parallel channel.  This technical formation suggests that the BTC’s price has been trading within the confines of a channel characterized by an upper and lower boundary, as seen in the chart below. BTC could experience further price movement within the defined boundaries if the ascending parallel channel pattern holds.  The price is expected to advance toward the upper boundary, which currently resides around $48,000. However, the Bitcoin price is anticipated to face resistance at this level and retrace towards the lower boundary at approximately $34,000.  Following the retracement, a rebound toward the upper boundary, potentially reaching around $57,000, could be expected. Related Reading: Litecoin Bear Flag Could Cause 41% Crash To This Level, Analyst Explains The upcoming decision by the SEC regarding spot Bitcoin ETF applications adds a layer of significance to Bitcoin&#8217;s price movement. The approval of Bitcoin ETFs has been a subject of great interest within the cryptocurrency community, as it can enhance liquidity and provide greater legitimacy to the cryptocurrency market.  While the outcome of the SEC decision remains uncertain, the ascending parallel channel pattern reveals a compelling technical perspective that could impact Bitcoin&#8217;s price trajectory. Critical Moment For BTC?  Supporting the upside potential of the Bitcoin price in Martinez&#8217;s analysis, crypto analyst Rekt Capital highlights the importance of BTC’s ability to establish a strong support level at $43,900. According to Rekt Capital&#8217;s analysis, Bitcoin is exhibiting promising signs as it strives to reclaim the top of the pattern at $43,900 as a support level.  This level holds importance in determining the cryptocurrency&#8217;s ability to sustain upward momentum. Rekt Capital suggests that a daily candle close above this resistance is essential for Bitcoin to make another attempt at moving higher. Related Reading: XRP Price Gears Up For ‘Significant Upswing Soon’: Crypto Analyst The successful establishment of $43,900 as a support level and a daily candle close above this resistance would signify a positive development for Bitcoin&#8217;s upside potential.  It would indicate a renewed bullish sentiment and potentially pave the way for further price appreciation. However, failure to overcome this resistance level and ending up as an upside wick could hinder Bitcoin&#8217;s ability to sustain upward momentum in the short term. On Wednesday, Bitcoin trades at $44,000, followed by a news-driven dip toward the $40,800 level. Featured image from Shutterstock, chart from TradingView.com "
  }
]