[
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T16:02:30.000Z",
    "title": " Cosmos developers propose reducing ATOM inflation rate ",
    "url": "https://cointelegraph.com/news/cosmos-developers-propose-reducing-atom-inflation-rate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzZmMWRiOGUtMDUxYS00ZGY4LWI2N2ItMzgyMTVhZGM0ZDc1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The minimum inflation rate for ATOM could potentially be reduced to 0% per annum. </p>\n                    <p><p>Developers of inter-blockchain communications (IBC) protocol Cosmos want to further reduce the inflation of its native token, ATOM.</p><p>According to a Jan. 9 <a href=\"https://www.mintscan.io/cosmos/proposals/868\" target=\"_blank\" rel=\"noopener nofollow\">proposal</a> by StakeLab, a staking and relaying hub on the Cosmos ecosystem, developers wish to reduce the minimum inflation of ATOM to 0%. ATOM's current inflation rate is between 7% and 20% and will be reduced to 0% or 20% if the proposal passes. A quorum of 40% of ATOM's outstanding supply and sufficient yes votes are required before Jan. 23 for the proposal to pass. In outlining the rationale for the proposal, StakeLabs wrote:</p><p>StakeLab further explained that the community should consider the viability of transferring protocol revenue from emerging Cosmos consumer chains to ATOM stakers instead of issuing tokens outright. \"It may not make sense to maintain a 7% annual emission rate if the revenue from consumer chains becomes substantial,\" the firm wrote.</p><p><a href=\"https://cointelegraph.com/news/cosmos-developers-propose-reducing-atom-inflation-rate\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T15:45:08.000Z",
    "title": "Exchange flows show short term buyers preparing for volatility while long term hodl",
    "url": "https://cryptoslate.com/exchange-flows-show-sths-preparing-for-volatility-while-lths-hodl/",
    "description": "<p>As the crypto market holds its breath for the U.S. Securities and Exchange Commission&#8217;s (SEC) impending decision on the first spot Bitcoin Exchange-Traded Fund (ETF), a close analysis of Bitcoin&#8217;s on-chain data reveals a market in a state of cautious anticipation. Between Jan. 4 and Jan. 8, 2024, Bitcoin&#8217;s price increased from $44,230 to $46,944 after [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/exchange-flows-show-sths-preparing-for-volatility-while-lths-hodl/\">Exchange flows show short term buyers preparing for volatility while long term hodl</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T16:02:54.000Z",
    "title": "3 Cryptos to Buy Before the Next Bull Market Sparks 10x Gains",
    "url": "https://cryptodaily.co.uk/2024/01/3-cryptos-to-buy-before-the-next-bull-market-sparks-10x-gains",
    "description": "Discover the top three cryptocurrencies poised for explosive growth in the next bull market. Learn which assets could potentially offer 10x gains and why they stand out in the rapidly evolving crypto landscape."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T16:01:00.000Z",
    "title": "Meme Moguls Price Prediction – Solana (SOL) NFT Sales Drop, Ethereum (ETH) Prices Up",
    "url": "https://cryptodaily.co.uk/2024/01/meme-moguls-price-prediction-solana-sol-nft-sales-drop-ethereum-eth-prices-up",
    "description": "Cryptocurrency markets continue to evolve with varying trends, particularly in the case of Meme Moguls, Solana (SOL), and Ethereum (ETH)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T15:44:30.000Z",
    "title": "Pullix (PLX) Defies Market Volatility, Gains 70% In Presale Stage 5 Surge With Stellar (XLM) And Polygon (MATIC)",
    "url": "https://cryptodaily.co.uk/2024/01/pullix-plx-defies-market-volatility-gains-70-in-presale-stage-5-surge-with-stellar-xlm-and-polygon-matic",
    "description": "People across the globe believe that the crypto market will do good in 2024. Hence, they want to invest in cryptocurrencies that can give great returns on investments."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T16:02:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T15:48:42.000Z",
    "title": "Why is the crypto market up today? BTC hovers around $47K",
    "url": "https://www.cryptopolitan.com/why-is-the-crypto-market-up-today-btc-at-47k/",
    "description": "Today&#8217;s surge in the crypto market, with Bitcoin (BTC) hovering around the $47,000 mark, has captivated the attention of investors, enthusiasts, and analysts alike. Several interconnected factors contribute to the volatility and subsequent surges in the crypto market, and today&#8217;s rally is no exception. Here is what&#8217;s happening. Crypto ecosystems pick up pace The rise [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T16:00:13.000Z",
    "title": "Global Mega Bank Standard Chartered Releases Bullish Forecast For Spot Bitcoin ETFs",
    "url": "https://www.newsbtc.com/news/bitcoin/standard-chartered-spot-bitcoin-etf/",
    "description": "Standard Chartered Bank is the latest to give its predictions on the impact Spot Bitcoin ETFs could have on Bitcoin’s price in the long term. The bank took a bullish stance as they predicted that BTC could rise to unprecedented heights by the end of 2025.  Bitcoin Could Hit $200,000 By End Of 2024 According to a report by Standard Chartered shared on the X (formerly Twitter) platform, BTC&#8217;s price could reach $200,000 by end-2025. There is the potential for Bitcoin to hit this price level with $50 to $100 billion flowing into the Spot Bitcoin ETFs, says the bank’s Head of Digital Assets Research Geoff Kendrick and Precious Metal Analyst Suki Cooper. Related Reading: Shiba Inu Breakout To $0.001? Rumored 9.25 Trillion SHIB Token Burn Could Be The Catalyst Their projections stem from the fact that an approval of these Spot Bitcoin ETFs could happen as soon as this week. If that happens, Kendrick and Cooper state that will be a key driver of Bitcoin’s price to the upside, something similar to what happened with Gold ETPs. Interestingly, Standard Chartered predicts that BTC could hit $100,000 before this year runs out.  Elaborating on BTC enjoying similar gains to Gold (when Gold ETPs were approved), the bank expects that such gains will materialize over a shorter period for the flagship crypto token. This is based on their view that the Spot BTC ETF market will develop quicker than the Gold ETPs did.  The amount of inflows that these Spot Bitcoin ETFs could witness has continued to be up for debate. Crypto research firm Galaxy Digital took a more conservative stance as they project that only about $14 billion will flow into these funds in the first year. Meanwhile, VanEck’s advisor, Gabor Gurbacs, is only choosing to look at the long term. BTC reaches new 1-year high &#124; Source: BTCUSD on Tradingview.com “Trillions, Not Billions” In The Long Term Commenting on Standard Chartered’s report, Gurbacs mentioned that he prefers to look at how much could flow into these funds in the longer term rather than now. With that in mind, he projects that trillions of dollars will flow into Spot Bitcoin ETFs in the long term. Specifically, he makes a case for $2.5 trillion flowing into these BTC assets.  Related Reading: Rocket Carrying Physical Dogecoin To The Moon Takes Off, But Why Is Price Struggling? He explained that this could easily happen, considering that there are roughly $500 trillion in assets globally. As such, $2.5 trillion, representing just 0.5% of the global allocation, flowing into the Bitcoin ecosystem shouldn’t be a problem. He also bases his projection on the fact that Bitcoin won’t stop rising in value as fiat currencies continue to weaken. BTC has no top because fiat has no bottom, he says. Gurbacs also expects that Bitcoin will enjoy more acceptance once these Spot Bitcoin ETFs are approved. He says that banks, financial service firms, and regulators will turn from “enemies of Bitcoin to allies of Bitcoin.” This is “immeasurably valuable” as BTC adoption can level, he remarked. Featured image from Premium Times, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T16:00:40.000Z",
    "title": "Analysts’ Price Forecast for Trending Tokens: XRP (XRP), Injective (INJ) and Everlodge (ELDG)",
    "url": "https://www.crypto-news-flash.com/analysts-price-forecast-for-trending-tokens-xrp-xrp-injective-inj-and-everlodge-eldg/?utm_source=rss&utm_medium=rss&utm_campaign=analysts-price-forecast-for-trending-tokens-xrp-xrp-injective-inj-and-everlodge-eldg",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-09T131152.507.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-09T131152.507.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-09T131152.507-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-09T131152.507-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-09T131152.507-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As 2024 gets underway, the crypto market has recorded varying price movements from several crypto coins. Tokens like XRP (XRP) are experiencing a downward price movement while the Injective (INJ) token is showing bullish signs. Meanwhile, Everlodge (ELDG) has drawn the attention of whales, making the token one of the best crypto to buy in [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-09T16:00:00.000Z",
    "title": "CFTC Sounds Alarm on DeFi: Lack of Accountability Poses Serious Risks",
    "url": "https://coinedition.com/cftc-sounds-alarm-on-defi-lack-of-accountability-poses-serious-risks/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/DEFI-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/DEFI-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/DEFI-4-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The US Commodity Futures Trading Commission (CFTC) has issued a stark warning about Decentralized Finance (DeFi), highlighting the urgent need for clear lines of responsibility and accountability. In a report titled &#8220;Decentralized Finance,&#8221;&#160; Commissioner Christy Goldsmith Romero emphasized that DeFi remains at the center of illicit finance risks, cyber hacks, and theft. The report&#8217;s central [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cftc-sounds-alarm-on-defi-lack-of-accountability-poses-serious-risks/\">CFTC Sounds Alarm on DeFi: Lack of Accountability Poses Serious Risks</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]