[
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T08:22:01.000Z",
    "title": "How to use index funds and ETFs for passive crypto income",
    "url": "https://cointelegraph.com/news/how-to-use-index-funds-and-etfs-for-passive-crypto-income",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/80df8781-c3f1-4ef0-92b7-5983010b0eae.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Index funds and ETFs offer attractive options for passive income investing, providing investors with diversified exposure to various crypto assets.</p>\n                    <p><p>The key to gaining financial security and independence is to invest in passive income. Passive income is generated through investments that offer a consistent source of income with little continuing involvement, in contrast to active income, which necessitates constant effort and time. <a href=\"https://cointelegraph.com/news/how-to-earn-passive-crypto-income-with-bitcoin#:~:text=Still%2C%20a%20passive%20income%20enables,returns%2C%20risk%20factors%2C%20etc.\">Passive income</a> is especially valuable because it enables investors to amass wealth and live independently.</p><h2>Passive income investing, explained</h2><p>Investing in index funds and exchange-traded funds (ETFs) is a popular passive income strategy in the traditional financial market. Index funds are passively managed mutual funds that seek to match the performance of a chosen market index, such as the S&amp;P 500. ETFs, on the other hand, are similar to index funds but trade on stock exchanges, like individual stocks.</p><p>ETFs and index funds have a number of benefits for passive income investors. They instantly diversify investments among a variety of securities, lowering the risk involved with holding individual equities. </p><p>They are also economical because of their low expense ratios, which makes them perfect for long-term investing. These funds also give investors the chance to earn income from dividends and capital gains, enabling them to build up their wealth over time.</p><p>An investment fund, such as a mutual fund, index fund or ETF, has expenses that go along with owning and administering it. The expense ratio measures these expenses. It represents the portion of a fund’s assets that go toward paying management fees, overhead, marketing costs and other operational costs.</p><p>The expense ratio affects the returns investors receive because it is often reported as an annual percentage and deducted from the fund’s assets. For investors looking for cost-effective investing options, a lower expense ratio means that a larger portion of the fund’s assets are invested rather than used to pay expenses.</p><h2>Index funds and ETFs in crypto</h2><p>In the cryptocurrency space, <a href=\"https://cointelegraph.com/news/what-is-a-crypto-index-fund-and-how-to-invest-in-it\">index funds are investment funds</a> that aim to replicate the performance of a specific cryptocurrency index or market segment, offering investors diversified exposure to the crypto market. </p><p>On the contrary, <a href=\"https://cointelegraph.com/news/what-is-a-cryptocurrency-etf-and-how-does-it-work\">ETFs are traded on exchanges</a>, tracking the performance of a specific cryptocurrency index or market segment, allowing investors to buy and sell shares throughout the trading day.</p><p>Investors can create a passive income stream that increases over time by investing a portion of their investment portfolio in index funds and ETFs in the cryptocurrency market. However, the key is to select funds that match their time horizon, risk tolerance and investing goals. </p><h2>Similarities and differences between crypto index funds and crypto ETFs</h2><p>Both index funds and ETFs for cryptocurrencies seek to offer diversified exposure to a group of cryptocurrencies or a particular index or market segment. They give investors the chance to passively and conveniently obtain access to the larger crypto market. Crypto exchanges allow for the purchase and sale of both investment choices.</p><p>However, there are significant differences to take into account. For instance, limited trading flexibility is available with crypto index funds, which are bought and sold straight from the fund company and valued at the close of the trading day. However, crypto ETFs continually trade like individual tokens on crypto exchanges, with real-time pricing and more <a href=\"https://cointelegraph.com/learn/how-to-trade-cryptocurrencies-the-ultimate-beginners-guide\">trading options</a>.</p><p>ETFs typically have lower expense ratios than index funds, which typically have higher expense ratios. However, both investment vehicles offer various levels of accessibility and transparency.</p><p>Here’s a summary of the differences between crypto index funds and crypto ETFs:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e405b720-45b9-42b5-8f43-9b0762fcc02c.jpg\"  /></figure><p>Key considerations for starting passive income investing</p><p>Financial security and financial independence can be attained through passive income investing with index funds and ETFs with careful preparation and a disciplined approach. To get started with passive income investing in crypto, particularly focusing on index funds and ETFs, there are various considerations to be informed of:</p><ul><li>Learn more about the cryptocurrency market’s index funds and ETFs.</li><li>Set your risk tolerance and investment goals.</li><li>Select a trustworthy <a href=\"https://cointelegraph.com/explained/crypto-exchanges-explained\">crypto exchange</a>.</li><li>Based on expense ratios, diversity and past performance, pick appropriate index funds or ETFs.</li><li>Create an account on the exchange of your choice and complete the required verification.</li><li>Execute trades to purchase the selected index funds or ETFs. </li><li>Monitor the performance of your investments and consider <a href=\"https://cointelegraph.com/news/new-crypto-index-platform-makes-cryptocurrency-investing-easier-for-novices-and-professionals\">periodic rebalancing</a>.</li><li>Track and record any passive income generated from dividends, staking or other mechanisms.</li><li>Keep abreast of market developments and legislative changes.</li></ul><h2>Strategies for generating passive income with crypto index funds and ETFs </h2><p>There are various ways to use index funds and ETFs in the crypto world to generate passive income, as discussed below:</p><h3>Dividend-paying crypto index funds</h3><p>A few crypto index funds and ETFs provide dividends to investors. These funds invest a portion of their resources in cryptocurrencies that pay dividends or staking rewards on a regular basis. Investors can generate passive income by investing in such funds and receiving these distributions.</p><h3>Staking and yield farming</h3><p>Staking and <a href=\"https://cointelegraph.com/explained/defi-yield-farming-explained\">yield farming</a> are two practices that some cryptocurrency index funds and ETFs engage in. In exchange for rewards, yield farming entails supplying liquidity to <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocols. </p><p><a href=\"https://cointelegraph.com/learn/defi-staking-proof-of-stake-pos-coins\">Staking means holding particular coins</a> while receiving benefits for assisting in network security. Investors can produce passive income from the generated yields or staking rewards by investing in funds that carry out these activities.</p><h3>Tokenized real estate funds</h3><p>Some crypto index funds and ETFs provide exposure to <a href=\"https://cointelegraph.com/learn/what-is-tokenized-real-estate\">tokenized real estate assets</a>. These funds invest in real estate assets and tokenize them so that <a href=\"https://cointelegraph.com/news/how-does-tokenization-help-transform-illiquid-real-estate-ownership-into-a-liquid-one\">investors can benefit from capital growth</a> and rental income. One can earn passive income from the rental returns produced by the underlying real estate assets by investing in these funds.</p><h3>Lending and borrowing</h3><p>Crypto index funds and ETFs that participate in lending and borrowing in the cryptocurrency industry <a href=\"https://cointelegraph.com/news/what-is-crypto-lending-and-how-does-it-work\">lend borrowers cryptocurrency</a> and receive interest on those loans. By investing in these funds, investors can passively profit from the interest that lending activities generate.</p><h3>Rebalancing and portfolio growth</h3><p>To maintain their desired asset allocation, crypto index funds and ETFs often rebalance their portfolios on a regular basis. Assets that have outperformed are sold during rebalancing, and those that have underperformed are purchased. </p><p>Investors might profit from capital gains made during rebalancing if the fund performs better than expected and generates more income than it costs.</p><h3>Utilizing fractional shares and dollar-cost averaging </h3><p>When investing in ETFs and cryptocurrency index funds, using fractional shares and employing the <a href=\"https://cointelegraph.com/news/what-is-dollar-cost-averaging-dca-and-how-does-it-work\">dollar-cost averaging strategy</a> can be optimal strategies. Investors can diversify even with a modest amount of funds by investing in fractional shares, which allow for smaller investments. </p><p>By investing a certain amount on a regular basis, they may minimize the effects of market volatility and eliminate the need to time the market. Moreover, investors can gradually construct their portfolio and possibly gain from the long-term growth of these assets by creating a budget and investing schedule.</p><h2>Risks associated with crypto index funds and crypto ETFs</h2><p>Investing in cryptocurrency index funds and ETFs carries a number of risks that should be considered. The value of these investment alternatives is at risk due to the significant volatility of the cryptocurrency market. To mitigate this, diversification and regular portfolio rebalancing can help spread risk. </p><p>Additionally, the changing regulatory environment creates legal risks; therefore, investors must educate themselves and select compliant funds. Choosing renowned funds with strong security measures is essential because counterparty risk exists when relying on third-party intermediaries and custodians. </p><p>Finally, if a fund has a low <a href=\"https://cointelegraph.com/learn/on-chain-volume-vs-trading-volume-differences-explained\">trading volume</a>, which makes it more difficult to purchase or sell shares at desired prices, liquidity risk may arise. This risk can be reduced by performing extensive research and evaluating a fund’s liquidity before investing. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/how-to-use-index-funds-and-etfs-for-passive-crypto-income&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T08:16:33.000Z",
    "title": "Congressman Torres demands an investigation of the SEC’s deal with Prometheum",
    "url": "https://cointelegraph.com/news/sec-prometheum-congressman-torres-demands-an-investigation-of-the-sec-s-deal-with-prometheum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6d01ab2b-84c8-45b9-95f5-77a904b41fcf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United States Securities Exchange Commission might be investigated for a \"haphazard and heavy-handed approach to digital assets.”</p>\n                    <p><p>The United States Securities Exchange Commission (SEC) could be investigated for a \"haphazard and heavy-handed approach to digital assets,” or, more specifically, for its “sweetheart deal” with crypto platform Prometheum. </p><p>Such requests were filed on July 13 to the SEC's Inspector General Deborah Jeffrey and the Government Accountability Office's Comptroller General Gene Dodaro by Congressman Ritchie Torres. In the letters, <a href=\"https://twitter.com/RepRitchie/status/1679534903661301761/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">published</a> by the congressman on his Twitter, he writes:</p><blockquote>“The SEC refuses to bring even the barest amount of clarity to the application of securities law to digital assets. Its preferred means of communicating is neither rule nor guidance but enforcement”. </blockquote><p>Torres emphasizes the SEC’s May decision to grant a special broker purpose dealer (SPBD) license to Prometheum, a digital assets platform, created in 2017 by two American financial attorneys. According to Torres, “Prometheum appears to be nothing more than a Potemkin platform, operating as a timely talking point for crypto critics rather than a true trading platform for crypto customers.” </p><p>He calls for an examination of both the SEC’s failure to create “a workable process for registering” digital assets platforms and “the unusual backdoor deal” for Prometheum. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/who-is-prometheum-what-testify-congress-about-crypto-sec\"><strong><em>‘Who the hell’ is Prometheum and what did it say to Congress about SEC compliance?</em></strong></a></p><p>Prometheum recently became a public enemy for the crypto industry and Torres’ demand for investigation is not the first one. The company was thrust into the spotlight after a <a href=\"https://cointelegraph.com/news/us-lawmaker-invokes-sec-lawsuits-in-considering-crypto-regulatory-framework\">Congress testimony</a> of its co-founder, Aaron Kaplan in June. The problem seems to be Kaplan’s general support of the SEC’s regulatory strategy under current securities laws. </p><p>Immediately after the hearing, theories about Prometheum <a href=\"https://cointelegraph.com/news/who-is-prometheum-what-testify-congress-about-crypto-sec\">started swirling</a> on Twitter, emphasizing its possible ties to Chinese investors. On June 15, Blockchain Association filed a request with the SEC, <a href=\"https://cointelegraph.com/news/blockchain-association-requests-prometheum-info-from-sec\">seeking information</a> about the company. In July, Six Republican Congressmen <a href=\"https://cointelegraph.com/news/us-lawmakers-allege-ccp-connection-sec-doj-investigation-prometheum\">called on SEC to investigate</a> Prometheum’s “ties to the Chinese Communist Party.”</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/sec-prometheum-congressman-torres-demands-an-investigation-of-the-sec-s-deal-with-prometheum&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T08:12:24.000Z",
    "title": "Google’s Bard overcomes EU hurdles, expands territories and capabilities",
    "url": "https://cointelegraph.com/news/google-s-bard-overcomes-eu-hurdles-expands-territories-and-capabilities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/52e125ad-55fb-4c4d-b085-c1182c2f4ee7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new features include hearing spoken responses, uploading images for prompts and utilizing the AI tool to analyze photos.</p>\n                    <p><p>On July 13, Google said it had launched its Bard chatbot to users in the European Union and Brazil. This launch comes after the tech company overcame regulatory hurdles faced in the EU. The territory expansion also came with the unveiling of new features for the <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligencehttps://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> tool.</p><p>In the company’s blog post, Google <a href=\"https://blog.google/products/bard/google-bard-new-features-update-july-2023/?_ga=2.68725208.818463651.1689312772-420449390.1685775069\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that this AI tool can now generate responses in over 40 languages, including Chinese, Hindi and Spanish. Additionally, new features would be introduced to Bard in specific regions, including the capability to hear spoken responses, upload images for prompts and utilize the AI tool to analyze photos.</p><p>Bard’s expansion marks its most significant growth <a href=\"https://cointelegraph.com/explained/what-is-googles-bard-and-how-does-it-work#:~:text=3.-,When%20was%20Google%20Bard%20released%3F,become%20available%20to%20the%20public.\">since its launch in February</a>. As a result, it now <a href=\"https://cointelegraph.com/learn/googles-bard-vs-open-ais-chatgpt\">competes directly with ChatGPT</a>, a rival supported by Microsoft.</p><p>Bard, which was launched earlier this year in approximately 180 countries, has finally reached the EU, making it available to the remaining part of the world. The delay in its availability in the EU was attributed to concerns<a href=\"https://cointelegraph.com/news/irish-data-watchdog-blocks-google-from-launching-bard-in-the-eu-report\"> regarding compliance with the General Data Protection Regulation</a> (GDPR), according to the company.</p><p>Google's Senior Product Director, Jack Krawczyk, mentioned that the tech company engaged in highly productive discussions with privacy regulators in Europe. He emphasized that ongoing dialogue is anticipated to ensure the incorporation of transparency, choice and control as the development of the product progresses.</p><p>According to Krawczyk, Google will now provide users with explicit notifications regarding the usage and storage of their data and grant them the option to prevent the company's employees from reviewing conversations. Importantly, these control options will be accessible worldwide, extending beyond the boundaries of the European Union.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/meta-releases-commercial-ai-tools-to-rival-google-open-ai\"><strong><em>Report: Meta to release commercial AI tools to rival Google, OpenAI</em></strong></a></p><p>Chat services built on large language models have hit roadblocks in Europe before because of existing data protection laws. OpenAI’s ChatGPT, for example, was t<a href=\"https://cointelegraph.com/news/italy-blocks-chatgpt-investigates-suspected-violations\">emporarily shut down</a> in Italy over related issues.</p><p>Google is currently facing a new <a href=\"https://cointelegraph.com/news/google-hit-with-lawsuit-over-ai-privacy-policy\">class action lawsuit</a> in the United States, accusing the company of utilizing users' personal information inappropriately for the training of its artificial intelligence system.</p><p>However, the allure of novelty may be diminishing as recent web user statistics indicate a <a href=\"https://cointelegraph.com/news/chatgpt-sees-traffic-fall-10-in-june-after-initial-rush-from-users\">decline in monthly traffic and unique visitors</a> to ChatGPT's website in June, marking the first such decrease ever recorded.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/google-s-bard-overcomes-eu-hurdles-expands-territories-and-capabilities&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-07-14T08:30:07.000Z",
    "title": "Bitcoin Volume Of Supply ‘In-Loss’ Transitioned To Profitable Position",
    "url": "https://nulltx.com/bitcoin-volume-of-supply-in-loss-transitioned-to-profitable-position/",
    "description": "The recent correction in the cryptocurrency market, with Bitcoin&#8217;s price dropping to $25,000, has had a significant impact on the supply dynamics and investor sentiment. One way to assess this impact is by examining the volume of supply that transitioned from being &#8216;in-loss&#8217; to &#8216;in-profit&#8217; during this correction.  Over 2.47M BTC Moved Into Profitable Position [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T08:31:01.000Z",
    "title": "Crypto Twitter discusses US XRP ruling, citing possible Binance implications",
    "url": "https://crypto.news/crypto-twitter-discusses-us-xrp-ruling-citing-possible-binance-implications/",
    "description": "Judge Analisa Torres of the US District Court rules XRP is not a security, sparking community debate on implications for the Binance lawsuit. In court, the judge denied the SEC&#8217;s request for summary judgment regarding programmatic sales of XRP and&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T08:18:22.000Z",
    "title": "Reports: Twitter is closer to integrating crypto, dogecoin and digitoads likely to rally",
    "url": "https://crypto.news/reports-twitter-is-closer-to-integrating-crypto-dogecoin-and-digitoads-likely-to-rally/",
    "description": "DigiToads and dogecoin will likely rally with news of Twitter planning to integrate crypto in the future"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T08:12:45.000Z",
    "title": "Coinbase and Kraken Confirm XRP Relisting after Landmark Legal Win",
    "url": "https://www.crypto-news-flash.com/coinbase-and-kraken-confirm-xrp-relisting-after-landmark-legal-win/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-and-kraken-confirm-xrp-relisting-after-landmark-legal-win",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Coinbase and Kraken will relist XRP, allowing trading on the XRP network. Users are advised not to send XRP over other networks to avoid potential loss of funds. Coinbase and Kraken Announce XRP Relisting In a significant move, Coinbase and Kraken have officially announced the relisting of XRP, following a landmark legal victory. This development [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-14T08:13:28.000Z",
    "title": "Top Crypto Altcoins to hold Until 2026",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-crypto-altcoins-to-hold-until-2026/",
    "description": "<p>The bull market will return soon. Honest it will. And look at these 2 charts. A big Layer 1 earned a huge 1924% in the last bull run. But not to be outdone, one of its Layer 2 solutions did EVEN better earning 7200%. Who am I talking about? Ethereum and Polygon. Polygon represents just [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-crypto-altcoins-to-hold-until-2026/\">Top Crypto Altcoins to hold Until 2026</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]