[
  {
    "source": "Decrypt",
    "date": "2023-12-06T00:44:30.000Z",
    "title": "GTA 6 Preview: Everything You Need to Know About the New Grand Theft Auto",
    "url": "https://decrypt.co/154049/grand-theft-auto-6-release-date-rumors-leaks-news",
    "description": "UPDATE: The first Grand Theft Auto 6 trailer is officially live, confirming a number of the GTA leaks and rumors."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T01:00:17.000Z",
    "title": "SEC Insider: Bitcoin ETF Approval Probability Surges Beyond 99% As BTC Hits Fresh Yearly High",
    "url": "https://www.newsbtc.com/bitcoin-news/sec-insider-bitcoin-etf-approval-probability-surges-beyond-99-as-btc-hits-fresh-yearly-high/",
    "description": "In the countdown to the deadline for the long-awaited Bitcoin ETF applications by major asset managers worldwide, predictions regarding the rate of approval have significantly improved.  Inside sources from the US Securities and Exchange Commission (SEC) indicate that Bloomberg&#8217;s initial 90% chance prediction of approval has now surged beyond 99%.  This development has heightened the excitement surrounding this investment vehicle, which has the potential to bring substantial inflows of capital into the Bitcoin market and further amplify its year-to-date gains of over 153%. Market Sentiment Soars As Bitcoin ETF Approval Probability Surpasses 99% Andrew, an SEC insider, shared an update on X (formerly Twitter), stating that the 99% probability of a Spot Bitcoin ETF being approved is no longer deemed high enough.  While acknowledging that nothing is ever certain, the source emphasized that the current likelihood of approval surpasses the 99% estimate from the previous week. The sentiment in the market is clearly reflected in the price movement of Bitcoin, as it continues to establish new yearly highs and display unwavering bullish momentum.  Related Reading: Analyst Says Solana At Risk Of Pullback: Here Is The Target Currently trading at $42,900, Bitcoin recently reached a fresh annual peak of $43,400 on Tuesday. Over the past 24 hours, the largest cryptocurrency has surged by 4%, and it has witnessed a remarkable increase of over 14% in the past seven days. It is worth noting that the prospect of a Bitcoin ETF being approved has captured the attention of investors and industry participants alike. If approved, the ETF would provide a regulated and accessible investment vehicle for institutional and retail investors, potentially bringing significant liquidity to the cryptocurrency market.  The spike in approval forecasts to over 99% has further fueled optimism that this milestone decision is imminent. While nothing can be guaranteed, the growing confidence in Bitcoin ETF approval and the cryptocurrency&#8217;s impressive price performance underscores the potential for a significant positive impact on the market.  As the final deadline approaches, market participants eagerly await the SEC&#8217;s decision, anticipating a potential game-changer for the Bitcoin ecosystem and its ongoing growth. BTC Faces Crucial Range High Resistance Renowned crypto analyst Rekt Capital has shed light on Bitcoin&#8217;s recent price action, emphasizing the significance of key support and resistance levels within a specific price range.  In late November, Rekt Capital identified a range between $36,120 and $43,200, highlighting the importance of the lower boundary for a potential upward move. Related Reading: Shiba Inu Set To Establish A New Era For Shibarium Burns Bitcoin successfully tested and held the range&#8217;s lower boundary as support, resulting in a substantial rally in recent days. The primary objective now, according to Rekt, is to revisit the upper boundary, known as the black $43,900 range high resistance, as seen in the chart below. Rekt Capital underscores the importance of the black Range High resistance as a crucial reference point for Bitcoin&#8217;s price. During the parabolic phase of the 2021 Bull Market, Bitcoin managed to break above this level relatively easily.  On two occasions, the cryptocurrency surged beyond the black level, with the first instance followed by a retest of the level as a new support, leading to further upward momentum.  The second instance occurred later in the year when Bitcoin successfully retested the black level as short-term support before continuing its ascent. However, late in 2021, Bitcoin lost the black level as support (first red circle from the left) and experienced a fake breakout above it, subsequently entering a multi-week downtrend.  Rekt Capital highlights that Bitcoin&#8217;s historical performance suggests the cryptocurrency needs to successfully retest the black $43,900 level as support to pave the way for further upward movement. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-06T01:00:54.000Z",
    "title": "Trader Predicts Massive Solana (SOL) Rally to New All-Time High of $360 – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/12/05/trader-predicts-massive-solana-sol-rally-to-new-all-time-high-of-360-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/sol-rally-time-here.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst thinks Ethereum (ETH) competitor Solana (SOL) could skyrocket to new all-time highs within the next year. The pseudonymous trader known as Inmortal shares a chart with his 202,700 followers on the social media platform X that projects SOL surging to $360 by the beginning of 2025. Inmortal&#8217;s chart predicts the sixth-ranked [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/05/trader-predicts-massive-solana-sol-rally-to-new-all-time-high-of-360-heres-his-timeline/\">Trader Predicts Massive Solana (SOL) Rally to New All-Time High of $360 – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]