[
  {
    "source": "CoinDesk",
    "date": "2023-11-02T05:49:38.000Z",
    "title": "Crypto at the Center of $300M Fraud Case in China",
    "url": "https://www.coindesk.com/policy/2023/11/02/crypto-at-the-center-of-300m-fraud-case-in-china/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "21 people were sentenced in a case involving converting 'dirty' USDT to RMB."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T05:43:36.000Z",
    "title": "Spot ETF-induced Bitcoin rally isn’t guaranteed to stick: Analysts",
    "url": "http://cointelegraph.com/news/spot-etf-bitcoin-rally-may-not-sustain-analysts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/601f629a-f393-49e2-bb70-43b1da8e5b4b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Investors will likely see Bitcoin surge even more when a spot Bitcoin ETF is approved, but other factors are needed for the rally to sustain, warn analysts.</p>\n                    <p><p>While the approval of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) will likely spike the price of Bitcoin, some analysts are concerned it won’t be enough to fully thaw the markets from its winter chill. </p><p>On Oct. 24 Bitcoin staged its largest single day rally in over a year, surging <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-breaks-34000-etf-excitement-grows\">more than 14% on the news</a> that the ticker of BlackRock’s spot Bitcoin ETF — IBTC — <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">had been listed on the</a> Depository Trust &amp; Clearing Corporation (DTCC) website, something markets understood as a positive step forward for the funds’ application. </p><p>The surge turned out to be even stronger than that of oOct. 16, when Cointelegraph’s <a href=\"https://cointelegraph.com/news/clarification-sharing-false-spot-bitcoin-etf-news\">incorrect</a> tweet that suggested a spot Bitcoin ETF had been approved.</p><p>Speaking to Cointelegraph, pseudonymous trader TheFlowHorse — who boasts 184,000 followers on X — said that the two market blips can be seen as a hint of Bitcoin’s price action should a spot Bitcoin ETF be approved.</p><p>Addressing the two developments and its impact on Bitcoin,Horse added that investors could expect to see a move of “the same, if not greater magnitude” if the ETF is approved.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/5007db14-d26b-4370-b1b7-e3f8e1505593.png\"  /><figcaption style=\"text-align: center;\"><em>The price of Bitcoin surged to north of $35k on Oct. 24. Source: TradingView</em></figcaption></figure><p>However, Horse notes that while approval will likely drive prices significantlyupward, it’s also likely it will be followed by an eventual retrace in the mid-term. </p><p>This is because, in Horses’ view, the trade will be crowded heavily by eager investors looking to chase the news. </p><p>“You're going to have a ton of crowding… and that's ultimately an inefficient move. The inefficient moves get refilled and retrace to some degree,” he added.</p><p>Tony Sycamore, an analyst at IG international, told Cointelegraph that he expects to see Bitcoin continue to surge through new yearly highs on the day of the announcement, while Rachel Lucas, a technical analyst at Australian crypto exchange BTC Markets, said the approval of BlackRock’s ETF will act as a catalyst for the rest of the traditional finance sector. </p><blockquote>“This participation not only amplifies institutional capital inflows but also heightens retail curiosity, contributes to supply limitations, and underscores the deflationary aspect of Bitcoin.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Here&#39;s a short clip of <a href=\"https://twitter.com/kaileyleinz?ref_src=twsrc%5Etfw\">@kaileyleinz</a> asking Gensler about <a href=\"https://twitter.com/search?q=%24GBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$GBTC</a> and other spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETFs. Mostly non-answers in my opinion but does talk about the disclosure review team. We&#39;ve had some insight into their process via the amendments from some of these filers in recent days <a href=\"https://t.co/lIWZc74OAi\">pic.twitter.com/lIWZc74OAi</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1714674199795544412?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, while Sycamore said there’s a chance the “rally could stick” — a full-scale trend reversal for Bitcoin seems unlikely given that interest rates remain considerably higher than they were when Bitcoin notched its previous all-time-high. </p><p>Tina Teng, an analyst at CMC markets also believes it would be worthwhile to adopt a more cautious stance, as there’s no guarantee of an all-out trend reversal. </p><blockquote>“Bitcoin still lacks the fundamentals to support a quantitative valuation like shares and does not have the scope of utilization like commodities. Approval by the SEC can not change the nature of it being a speculative asset.”</blockquote><p>“Macro changes will have a major impact on the crypto markets, which usually start building an upside trend during a Fed rate cut cycle,” Teng concluded. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/grayscale-new-spot-bitcoin-etf-nyse\"><strong><em>Grayscale files for new spot Bitcoin ETF on NYSE Arca</em></strong></a></p><p>The certainty and timing of a spot Bitcoin ETF approval is still up for debate. While unlikely, ETF analysts said that SEC Chair Gary Gensler <a href=\"https://cointelegraph.com/news/bitcoin-spot-etf-deny-rug-pull-gary-gensler-sec-bloomberg-analysts\">could be waiting until the very last minute</a> to pull off an “amazingly sadistic” denial of the impending applications.</p><p>While analysts from JP Morgan <a href=\"https://twitter.com/GoingParabolic/status/1715093377727779144\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> in an Oct. 17 investment note that an approval could arrive within the next few months, the general consensus — held by Bloomberg ETF analysts James Seyffart and Eric Balchunas — peg the chances of an approval by Jan. 10 next year at 90%.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I&#39;ve gotten a lot of questions regarding my current view on Spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETFs over the last couple weeks. This is the first section of the note I put out yesterday with <a href=\"https://twitter.com/EricBalchunas?ref_src=twsrc%5Etfw\">@EricBalchunas</a>.<br><br>TLDR: Our view hasn&#39;t changed much <a href=\"https://t.co/dRAm5IsdQf\">https://t.co/dRAm5IsdQf</a> <a href=\"https://t.co/Htsi3n2XxV\">pic.twitter.com/Htsi3n2XxV</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1712900403090559398?ref_src=twsrc%5Etfw\">October 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]