[
  {
    "source": "CoinDesk",
    "date": "2023-10-06T10:00:00.000Z",
    "title": "Sam Bankman-Fried's Lawyers Test the Judge's Patience",
    "url": "https://www.coindesk.com/policy/2023/10/06/sam-bankman-frieds-lawyers-test-the-judges-patience/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "It could take six weeks for prosecutors to make their case against Sam Bankman-Fried. But only three days were needed for the judge overseeing his trial to lose patience with the former crypto chief’s defense team."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T09:44:00.000Z",
    "title": "UK must loosen KYC demands for crypto to outpace US in Web3 — Think tank",
    "url": "https://cointelegraph.com/news/uk-must-loosen-kyc-demands-for-crypto-to-outpace-us-in-web3-think-tank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/6b208552ff0af9704bc5abe784d71fc1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Policy Exchange published its report on Web3 containing 10 proposals for the U.K. government.</p>\n                    <p><p>The United Kingdom has an opportunity to capitalize on the departure of Web3 firms leaving the United States due to regulatory uncertainty. But to achieve that, the U.K. will need to follow its own regulatory path, smoothing the requirements for crypto in some regard, according to a think tank.</p><p>On Oct. 2, the influential conservative think tank Policy Exchange published a <a href=\"https://policyexchange.org.uk/wp-content/uploads/Web3.pdf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">report</a> on Web3 with 10 proposals for the U.K. government, which it claims would help the country improve Web3 regulation.</p><p>One proposal made in the report is limiting the liabilities of individuals who hold tokens in a decentralized autonomous organization (DAO). The report cites a negative example of a <a href=\"https://cointelegraph.com/news/ooki-dao-to-shut-down-after-precedent-setting-court-battle-with-cftc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ooki-dao-to-shut-down-after-precedent-setting-court-battle-with-cftc/amp\">recent ruling in the U.S.</a> that makes any individual American who owns or previously owned tokens in a DAO liable for any violations of the law the DAO commits.</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/uk-digital-securities-sandbox-q1-2024\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-digital-securities-sandbox-q1-2024/amp\">UK to launch Digital Securities Sandbox in Q1 2024</a></strong></em></p><p>The report also suggests the principal U.K. financial regulator, the Financial Conduct Authority (FCA), loosens its current Know Your Customer (KYC) approach, allowing for the use of “alternative and innovative techniques,” such as digital identities and blockchain analytics tools.</p><p>The experts say the U.K. should avoid undermining self-hosted wallets and regulating proof-of-stake services as a financial service. Among other proposals are allowing private stablecoin issuers to place stablecoin reserves in the Bank of England, creating a “tax wrapper” for the crypto exchange and creating a new sandbox under the Department for Science, Innovation and Technology.</p><p>Recently, U.K. regulators have taken a more stringent approach to the digital assets industry. His Majesty’s Treasury is considering <a href=\"https://cointelegraph.com/news/uk-ban-crypto-investment-cold-calls\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-ban-crypto-investment-cold-calls/amp\">banning all cold calls</a> promoting crypto investments, and the FCA has warned local crypto businesses to <a href=\"https://cointelegraph.com/news/uk-fca-unregistered-crypto-firms-final-warning-ads-regime-compliance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-fca-unregistered-crypto-firms-final-warning-ads-regime-compliance/amp\">follow its marketing rules</a> or face consequences.</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-06T10:02:23.000Z",
    "title": "Bill Miller IV Says Valuations of Tech Mega-Cap Stocks Like Apple, Microsoft, and Alphabet Are Hard to Justify in Current Economic Climate",
    "url": "https://www.cryptoglobe.com/latest/2023/10/bill-miller-iv-says-valuations-of-tech-mega-cap-stocks-like-apple-microsoft-and-alphabet-are-hard-to-justify-in-current-economic-climate/",
    "description": "Bill Miller IV, Chairman and Chief Investment Officer of Miller Value Partners, appeared yesterday on CNBC’s “Closing Bell” and talked to Scott Wapner about the current state of the U.S. stock market and investment opportunities. Miller emphasized that despite the market’s recent turbulence, there are numerous investment opportunities available, particularly for value investors. Investment Opportunities […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-06T10:06:14.000Z",
    "title": "VEXT Is Now Available On Gate.io",
    "url": "https://cryptodaily.co.uk/2023/10/vext-is-now-available-on-gateio",
    "description": "VEXT Is Now Available On Gate.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-06T10:05:15.000Z",
    "title": "Bitget UK Tour, London Edition: Empowering the Crypto Community through Education",
    "url": "https://cryptodaily.co.uk/2023/10/bitget-uk-tour-london-edition-empowering-the-crypto-community-through-education",
    "description": "Boasting a turnout of over 200 sign-ups, the Bitget UK Tour was recognized as the second-largest free crypto event in the UK, further cementing its position in the ever-evolving crypto landscape."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T10:01:05.000Z",
    "title": "VEXT Is Now Available On Gate.io",
    "url": "https://www.cryptopolitan.com/vext-is-now-available-on-gate-io/",
    "description": "London, United Kingdom, October 6th, 2023, Chainwire VEXT is now available (10:00AM UTC) on Gate.io, another renowned global centralized exchange. Users can head over to Gate.io now by CLICKING HERE so they don’t miss out on the exclusive rewards and bonuses up for grabs!  This is a defining moment where users have the opportunity to ... <a title=\"VEXT Is Now Available On Gate.io\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vext-is-now-available-on-gate-io/\" aria-label=\"More on VEXT Is Now Available On Gate.io\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T09:49:54.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the blockchain world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T09:46:45.000Z",
    "title": "Discord Introduces Clips Feature for Streamers",
    "url": "https://www.cryptopolitan.com/discord-clips-feature/",
    "description": "Discover Clips, a new Discord feature tailored to gamers and streamers. Learn more about how to enable, create, edit and share Clips with your friends. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T10:00:22.000Z",
    "title": "Trillions In Shiba Inu On The Move: What Lies Ahead For The Meme Coin?",
    "url": "https://www.newsbtc.com/news/trillions-in-shiba-inu-on-the-move-what-lies-ahead-for-the-meme-coin/",
    "description": "Large-scale transactions of Shiba Inu tokens have once again captured the attention of the cryptocurrency community. In a recent announcement by the crypto tracker Whale Alert, a substantial amount of SHIB was observed being transferred from the Amsterdam-based cryptocurrency exchange Bitvavo to an undisclosed blockchain address.  The staggering figure of 4,584,530,677,374 SHIB raises intriguing questions about the continued interest of prominent investors in this meme-based cryptocurrency. The transfer, which took place in the early hours of Oct. 5, was meticulously recorded by the Ethereum (ETH) blockchain explorer Etherscan, adding credibility to the transaction&#8217;s authenticity.  Related Reading: Assessing Cardano’s Struggles: Will Key Support Levels Halt The Decline Above $0.27? Shiba Inu Whale Transaction Details And Suspicious Timing This development comes just one week after the Shiba Inu development team issued a cautionary statement to its community, urging investors to exercise due diligence and remain cautious of suspicious entities claiming to be affiliated with the SHIB ecosystem. 🚨 🚨 4,584,530,677,374 #SHIB (33,132,403 USD) transferred from #Bitvavo to unknown wallethttps://t.co/HrCbR3oavs — Whale Alert (@whale_alert) October 5, 2023 The team emphasized that the mere use of the name &#8220;Shibarium,&#8221; which denotes the ecosystem&#8217;s recently launched layer-2 scaling solution, does not automatically confer legitimacy. Instead, the SHIB team emphasized that all official partnerships and announcements would be exclusively disseminated through the ecosystem&#8217;s Discord channel or official blog. SHIB market cap currently at $4.2 billion. Chart: TradingView.com Over the past 24 hours, the SHIB community has embarked on a noteworthy endeavor to reduce the circulating supply of SHIB tokens. A substantial quantity, totaling 50,430,344 SHIB, has been intentionally transferred to &#8220;dead wallets,&#8221; a strategy that effectively reduces the available supply and supports token value.  The largest single transaction in this recent burn spree amounted to 10,162,798 SHIB, as reported by the Shibburn tracker. HOURLY SHIB UPDATE$SHIB Price: $0.00000723 (1hr 0.16% ▲ &#124; 24hr -0.47% ▼ ) Market Cap: $4,259,485,087 (-0.53% ▼) Total Supply: 589,339,392,895,097 TOKENS BURNT Past hour: 2,671,046 (2 transactions) Past 24Hrs: 50,430,344 (61.06% ▲) Past 7 Days: 426,377,516 (-41.81% ▼) — Shibburn (@shibburn) October 5, 2023 SHIB&#8217;s Resilience And Current Market Performance The ongoing efforts by Shiba Inu enthusiasts to burn SHIB tokens have been highly successful. To date, a remarkable 410 trillion-plus SHIB tokens have been deliberately removed from circulation, signaling a concerted commitment to creating scarcity in the market. Related Reading: Solana Price On Fire: October Red-Hot Prediction – $30 Within Reach? The resurgence in SHIB activity follows a period of rapid growth in the SHIB ecosystem. Despite recent market fluctuations, SHIB is currently valued at $0.00000720 according to CoinGecko, experiencing a slight 0.9% decline over the last 24 hours and a modest 2.2% dip over the past seven days. These developments in the world of Shiba Inu (SHIB) underscore the resilience of meme-based cryptocurrencies and the unwavering enthusiasm of its community, making it a cryptocurrency to watch closely in the coming weeks and months. Featured image from Channel Futures"
  }
]