[
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T08:21:54.000Z",
    "title": "CBDCs will gradually displace private banks, says Russian lawmaker",
    "url": "https://cointelegraph.com/news/cbdc-will-gradually-displace-traditional-banks-says-russian-lawmaker",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/80a733e6-99d7-4453-9c12-9bf49ecfa177.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Some Russian banks have been increasingly concerned about the potential implications of the digital ruble after the first pilots started in August.</p>\n                    <p><p>Central bank digital currencies (CBDC) and blockchain technology are likely to displace traditional banks, according to a lawmaker in Russia.</p><p>Anatoly Aksakov, head of Russia’s parliamentary financial committee and a <a href=\"https://cointelegraph.com/news/bitcoin-bubble-will-pop-sooner-or-later-says-famous-russian-btc-critic\">major skeptic</a> of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), has predicted that the traditional banking system will \"fade away\" with the adoption of the digital ruble, the local news agency RIA <a href=\"https://ria.ru/20230905/tsifra-1894407257.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>.</p><p>“As for the role of banks, I think that their role will decrease in the future with the development of blockchain,” Aksakov said at a meeting of the media forum AIF Media.</p><p>Private banks will have to find a new use and they would be able to participate in the infrastructure of digital financial assets and the digital ruble, Aksakov said, adding:</p><blockquote>“The traditional role that they served will gradually fade away.”</blockquote><p>Aksakov also noted that the Bank of Russia has limited the daily use of digital rubles at 200,000 rubles, or roughly $2,000. “One of the reasons is the separation of the banking system from money, because people from banks will have to move to the central bank’s system,” he added.</p><p>As Russia has been progressing with its CBDC rollout — <a href=\"https://cointelegraph.com/news/russia-cbdc-digital-ruble-trials-banks\">launching first trials</a> in August 2023 — local banks have been growing increasingly concerned about the potential implications of the digital ruble.</p><p>Last month, the Association of Russian Banks reportedly <a href=\"https://www.kommersant.ru/doc/6147368\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> a letter to the Bank of Russia, asking the regulators to clarify whether it would compensate creditors for providing access to the digital ruble platform. The banks also asked the central bank to officially prohibit forcing the citizens to open a digital ruble account.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bank-of-china-digital-yuan-payment-option-must-be-offered-in-retail-scenarios\"><strong><em>Bank of China: Platforms must provide digital yuan retail payment option</em></strong></a></p><p>On Aug. 1, Bank of Russia’s first deputy governor Olga Skorobogatova <a href=\"https://cbr.ru/press/event/?id=16976\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that digital ruble adoption would force banks to offer “more interesting loyalty programs.”</p><p>“In this competition, in any case, the consumer will win, who will be able to use the entire set of non-cash payment tools,” Skorobogatova stated.</p><p>Russian banks aren’t the only ones that are concerned about their future amid the increasing adoption of CBDC and blockchain technology. In mid-August, the central bank of Colombia recommended putting limits on CBDC holdings and spending to <a href=\"https://cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending\">help commercial banks stay relevant</a> in terms of keeping their role as service providers for storing value.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\"><strong><em>Asia Express: China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T08:15:04.000Z",
    "title": "dYdX to launch decentralized order books exchange on Cosmos: KBW 2023",
    "url": "https://cointelegraph.com/news/dydx-to-launch-decentralized-order-books-exchange-on-cosmos-kbw-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/2614e1e4-1207-4a08-a4ea-30952e924981.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>dYdX Foundation CEO Charles d'Haussy said that the dYdX exchange is taking a \"new step forward\" by decentralizing the order book. </p>\n                    <p><p>Decentralized exchange (DEX) platform dYdX is planning to offer a “purely decentralized” order books exchange as they migrate their ecosystem from the Ethereum network to the interchain network Cosmos.</p><p>At the Korea Blockchain Week 2023, Cointelegraph's Andrew Fenton spoke with dYdX Foundation CEO Charles d'Haussy about the DEX’s plans to implement decentralized order books on their exchange and how they plan to shift their ecosystem onto a new blockchain network. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b5d51abc-ca2d-4466-aee6-595d525715a2.jpg\"  /><figcaption style=\"text-align: center;\"><em>Attendees at the Korea Blockchain Week 2023 held in Seoul, South Korea. Source: Cointelegraph</em></figcaption></figure><p>In the interview, d'Haussy told Cointelegraph that one of the issues that decentralized exchanges are facing is the slow performance of on-chain order books. Because of this issue, order books for DEXs had to be taken off-chain to cater to the needs of the users of the trading platform. He explained: </p><blockquote>“If you have like a one-second block time, you still have a one-second latency. And the market of crypto derivatives is a very high-frequency market. So, you cannot offer one-second latency.” </blockquote><p>Because of this, d'Haussy highlighted that the dYdX is taking a “new step forward” in terms of decentralization by making the order book decentralized. According to the executive, the order book will still not be on the dYdX chain because it would still be slow but would be hosted within the validators. </p><p>“So, the architecture choice by dYdX engineers is to decentralize the order book, without adding it on-chain, because it will be too slow. The decision was made to essentially host the order book within the memory of the validators,” d'Haussy added. </p><p>d'Haussy believes that this method is a “new thing within the space.” The executive explained that validators are only usually validating blocks and creating new blocks with a set of transactions. The dYdX Foundation CEO also said that the validators will still do this on the dYdX chain, but they will also have the role of storing order books in their memory. “And that's one solution, which we'll use to essentially offer to the market a purely decentralized order book exchange,” he explained.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/40-of-crypto-trading-platforms-are-decentralized-world-federation-of-exchanges\"><strong><em>40% of crypto trading platforms are decentralized: World Federation of Exchanges</em></strong></a></p><p>Apart from the decentralized order book, d'Haussy also spoke about dYdX’s move to Cosmos. The executive clarified that the platform will be fully transferring its platform. “dYdX is not expanding, dYdX is migrating. So, the Ethereum exchange will close within a few months [...] we are migrating the full ecosystem,” he explained. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">️ v4 Adoption &amp; DYDX Token Migration<br><br>The dYdX community has voted in support of v4 Adoption and a potential DYDX Token Migration❗ <br><br>✅ ~36M DYDX from 392 addresses<br>❌ ~43 DYDX from 4 addresses<a href=\"https://t.co/FBLMZATURn\">https://t.co/FBLMZATURn</a> <a href=\"https://t.co/RwyOaDwpe4\">pic.twitter.com/RwyOaDwpe4</a></p>&mdash; dYdX Foundation  (@dydxfoundation) <a href=\"https://twitter.com/dydxfoundation/status/1698414370512937319?ref_src=twsrc%5Etfw\">September 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to d'Haussy, users will barely notice the change as it would be very smooth. Users will only need to connect their MetaMask wallets to the new dYdX chain, and the executive said that they will “take care of all the heavy lifting.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-viral-moment-cut-the-rope-sandbox-axie-aelph-nitro-nation-review/\"><strong><em>Web3 Gamer: Crypto games need viral moment, Nitro Nation review, Axie’s project Greenlight</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-06T08:36:33.000Z",
    "title": "MetaMask’s New Sell Feature Allows Users To Sell ETH For Fiat",
    "url": "https://cryptodaily.co.uk/2023/09/metamasks-new-sell-feature-allows-users-to-sell-eth-for-fiat",
    "description": "The new feature is part of the MetaMask portfolio and comes a few months after wallet users were allowed to purchase crypto using fiat from bank accounts."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-06T08:24:54.000Z",
    "title": "Crypto.com Launches Its First-ever Game on the Cronos Network",
    "url": "https://cryptodaily.co.uk/2023/09/cryptocom-launches-its-first-ever-game-on-the-cronos-network",
    "description": "Cronos Play’s SDK team and Crypto.com introduces “Loaded Lions: Mane City” with blockchain gaming and NFT utility."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T08:14:25.000Z",
    "title": "Lido Finance on Solana seeks $1.5 million in funding to sustain operations and growth",
    "url": "https://www.cryptopolitan.com/lido-finance-seeks-1-5-million-to-sustain-operations-and-growth/",
    "description": "In a pivotal move, the P2P team managing Lido Finance&#8217;s deployment on Solana has submitted a funding proposal to the Lido DAO community. The team seeks $1.5 million over the next 12 months to sustain and grow the project, thereby avoiding the potential cessation of operations. Lido Finance&#8217;s comprehensive funding proposal The funding proposal outlines ... <a title=\"Lido Finance on Solana seeks $1.5 million in funding to sustain operations and growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lido-finance-seeks-1-5-million-to-sustain-operations-and-growth/\" aria-label=\"More on Lido Finance on Solana seeks $1.5 million in funding to sustain operations and growth\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T08:13:25.000Z",
    "title": "Robotic Pets Bring Comfort to East Sussex Residents with Dementia",
    "url": "https://www.cryptopolitan.com/robotic-pets-bring-comfort-to-east-sussex/",
    "description": "Dementia is a challenging condition that affects thousands of individuals and their families, especially in East Sussex, where nearly 9,500 people were living with dementia in 2019. Coping with the early stages of dementia can be particularly overwhelming, and in response to this, East Sussex County Council has introduced an innovative project called the RoboPets ... <a title=\"Robotic Pets Bring Comfort to East Sussex Residents with Dementia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robotic-pets-bring-comfort-to-east-sussex/\" aria-label=\"More on Robotic Pets Bring Comfort to East Sussex Residents with Dementia\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T08:30:27.000Z",
    "title": "Shiba Inu Latest Dip – A Bullish Opportunity In Disguise?",
    "url": "https://www.newsbtc.com/news/shiba-inu-latest-dip-a-bullish-opportunity-in-disguise/",
    "description": "Shiba Inu (SHIB) has been making headlines once again, but this time for all the wrong reasons. The popular meme token has been under sustained selling pressure, leading to a significant crack in a critical support level.  Despite the recent launch of Shibarium, a blockchain platform aimed at enhancing the SHIB ecosystem, the bearish sentiment seems to have a firm grip on the token&#8217;s price chart, raising concerns about the long-term outlook. The crack in SHIB&#8217;s armor became evident as it breached the crucial $0.00000807 support level, resulting in a 7.3% decline in its price over the past seven days. Currently, SHIB is trading at $0.00000764, as reported by CoinGecko, with a modest 1.5% gain in the last 24 hours. However, these numbers only tell part of the story. Related Reading: Ethereum Bears Gain Upper Hand With Escalating Sell-Off: Impact On ETH Price Shiba Inu’s Bearish Indicators Abound A deeper dive into the technical indicators as revealed in a recent report reveals a grim picture for SHIB. The Chaikin Money Flow (CMF) has seen a substantial decline, resting at the zero mark as of press time. This signifies a lack of buying pressure and strong capital outflows. Moreover, the Relative Strength Index (RSI) remains in a downtrend, hovering just above the oversold zone, highlighting the absence of demand for SHIB. SHIB market cap currently at $4.5 billion on the daily chart: TradingView.com Intriguingly, the report also points out that the levels at which bears could potentially profit might serve as a price reversal zone for bulls, drawing parallels with price action observed in early June. However, the 24-hour liquidation data from Coinglass suggests a muted possibility of a bullish uptick in the near future. Shiba Inu: The Indian Connection Despite the challenging times for SHIB, it continues to make waves on WazirX, one of India&#8217;s leading cryptocurrency exchanges. According to a recent tweet from the exchange, SHIB held its ground among the top three most traded digital currencies in August, alongside giants like Bitcoin and XRP.  Top five traded coins on WazirX in August: 🚀 $USDT 🚀 $BTC 🚀 $SHIB 🚀 $XRP 🚀 $ETH pic.twitter.com/Xes1MlAl95 — WazirX: India Ka Bitcoin Exchange (@WazirXIndia) September 5, 2023 According to a report, this trend mirrors the performance observed in June and July, where these tokens showcased resilience, often trading in tandem with Bitcoin, the market&#8217;s heavyweight. Related Reading: Pepe Coin September Challenge: Can It Reach $0.000001 Again? The lackluster performance of SHIB in the face of the Shibarium launch and the bearish technical indicators raise concerns about its long-term prospects. Meanwhile, a price reversal cannot be ruled out, and SHIB&#8217;s latest dip could be just a bullish opportunity in disguise. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Getty Images"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T08:25:44.000Z",
    "title": "Shiba Inu Unlocking Billion-Dollar Opportunities for Businesses of All Sizes and Individuals as SHIB’s Shibarium Ecosystem Explodes with 1,168,483 Transactions and 1,117,993 Wallets",
    "url": "https://www.crypto-news-flash.com/shiba-inu-unlocking-billion-dollar-opportunities-for-businesses-of-all-sizes-and-individuals-as-shibs-shibarium-ecosystem-explodes-with-1168483-transactions-and-1117993-wallets/",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-03T125023.023.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-03T125023.023.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-03T125023.023-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-03T125023.023-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shibarium&#8217;s rapid growth marks a significant milestone with over 1.1 million transactions and wallet addresses, blowing past mainstream competitors. With soaring staking figures, fast block times, and massive large transaction volumes, Shibarium&#8217;s promise for businesses and individual investors is colossal. Shibarium, Shiba Inu’s Layer-2 scaling solution, has reached a jaw-dropping 1,168,483 transactions. According to the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T08:28:00.000Z",
    "title": "Grayscale Urges SEC to Approve GBTC Conversion to Bitcoin ETFs",
    "url": "https://coinedition.com/grayscale-urges-sec-to-approve-gbtc-conversion-to-bitcoin-etfs/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Thai SEC Launches SEC Crypto Academy, E-Learning Platform\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Thai-SEC-readies-stricter-rules-for-digital-assets-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Grayscale Investments reportedly urged the Securities and Exchange Commission (SEC) to approve the company’s application for the conversion of Grayscale Bitcoin Trust (GBTC) into an exchange-traded fund (ETF), claiming that the regulators hold “no grounds” to reject the request. In an official letter, Grayscale’s legal team asserted that GBTC is ready to operate as a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/grayscale-urges-sec-to-approve-gbtc-conversion-to-bitcoin-etfs/\">Grayscale Urges SEC to Approve GBTC Conversion to Bitcoin ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]