[
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T12:57:09.000Z",
    "title": "ConsenSys exec on MetaMask Snaps security: 'consent is king’ ",
    "url": "https://cointelegraph.com/news/consensys-metamask-snaps-interview-security",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/de5b05c9-015f-4a30-8bc2-2a3438977474.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ConsenSys head of developer community Francesco Andreoli explained that users could get more transaction insights through MetaMask Snaps. </p>\n                    <p><p>As malicious actors <a href=\"https://cointelegraph.com/news/metamask-scam-government-websites-crypto-investors\">continue their attempts to steal</a> users’ crypto assets, wallet provider MetaMask has developed a way to allow users to have more insights into the transactions and interactions within the application. </p><p>In an interview with Cointelegraph, Francesco Andreoli, the head of the developer community at ConsenSys, spoke about how they ensure that the <a href=\"https://cointelegraph.com/news/crypto-wallet-dapp-store-consensys-preps-cross-chain-metamask-snaps\">recently released MetaMask Snaps</a> is secure for users. The executive highlighted the importance of consent and ensuring that users know each step of their journey across various chains and decentralized applications (DApps). </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/789d15f6-07c7-43df-94b0-5a91a8516fee.jpg\"  /><figcaption style=\"text-align: center;\"><em>Francesco Andreoli at his keynote speech at Blockchain Economy Dubai. Source: Cointelegraph</em></figcaption></figure><p>As a wallet that contains various users’ crypto assets, the security of MetaMask Snaps could potentially be a concern for users before trying out the new feature. However, Andreoli noted that user consent is one of their main priorities, and they have designed Snaps to provide full transparency around how each Snap interacts with the MetaMask wallet extension. </p><p>He said the new update shows users more data points to give them more insights into their transactions. “So for security, one big category of our allow list is transaction insights. Basically, what is happening with transaction insights, is you really get more data points on what the extension does today,” Andreoli said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/metamask-snaps-wallets-interact-with-solana-dapps-through-solflare\"><strong><em>MetaMask Snaps to let users interact with Solana DApps through Solflare</em></strong></a></p><p>In his keynote presentation, Andreoli also demonstrated how one snap called Wallet Guard can help protect users from malicious transactions. Speaking with Cointelegraph, the executive further explained that before signing and approving transactions, users would be shown various information about what they are about to perform. He said:</p><blockquote>“Basically, what is happening is that before you’re actually signing and approving a transaction, you will have different data points. Like if you are interacting with a malicious contract or if you have a specific interaction. This happens before you're actually approving the transaction.”</blockquote><p>He stressed users would be “fully conscious” of what is happening. According to Andreoli, this is a function to which they gave added attention as they developed MetaMask Snaps. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/joe-lubin-the-truth-about-eth-founders-split-and-crypto-google/\"><strong><em>Joe Lubin: The truth about ETH founders split and ‘Crypto Google’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-06T13:00:48.000Z",
    "title": "Investors brace for turbulence as Fed shrinks balance sheet below $8 Trillion",
    "url": "https://cryptoslate.com/insights/investors-brace-for-turbulence-as-fed-shrinks-balance-sheet-below-8-trillion/",
    "description": "<p>Quick Take The Federal Reserve’s balance sheet contraction has recently crossed the significant $8 trillion benchmark. The balance sheet peaked at approximately $9 trillion in Q2 2022, signifying around $1 trillion of quantitative tightening over recent months. This contraction aligns chronologically with the Federal Reserve&#8217;s decision to escalate interest rates at the most rapid pace [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/investors-brace-for-turbulence-as-fed-shrinks-balance-sheet-below-8-trillion/\">Investors brace for turbulence as Fed shrinks balance sheet below $8 Trillion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-06T12:51:46.000Z",
    "title": "Sheepy Shapes Up Crypto Processing for iGaming with New Billing Features",
    "url": "https://cryptodaily.co.uk/2023/10/sheepy-shapes-up-crypto-processing-for-igaming-with-new-billing-features",
    "description": "In the dynamic world of iGaming, swift and secure transactions stand as a key pillar for seamless user experiences. Recognizing the unique requirements of this industry, Sheepy is excited to introduce its Deposit Addresses Feature, tailored specifically for the iGaming sector."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-06T12:41:17.000Z",
    "title": "VEXT Is Now Available On Gate.io",
    "url": "https://cryptodaily.co.uk/2023/10/vext-is-now-available-on-gateio",
    "description": "Users can head over to Gate.io now by CLICKING HERE so they don’t miss out on the exclusive rewards and bonuses up for grabs!"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-06T12:43:31.000Z",
    "title": "BTCC Announces Major VIP Program Update with as Low as 0.01% Trading Fees",
    "url": "https://cryptodaily.co.uk/2023/10/btcc-announces-major-vip-program-update-with-as-low-as-001-trading-fees",
    "description": "BTCC, a renowned cryptocurrency exchange with a long-standing presence in the industry, has recently made significant updates to its VIP program, aiming to provide more benefits to its users."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T12:51:53.000Z",
    "title": "Bitso and Bitstamp receive 107M XRP from Ripple wallets",
    "url": "https://www.cryptopolitan.com/bitso-and-bitstamp-receive-107m-xrp-from-ripple-wallets/",
    "description": "In a notable development, Whale Alert, a prominent crypto tracking platform, has reported substantial XRP transactions from wallets associated with Ripple, the San Francisco-based fintech company, to two key exchanges, Bitso and Bitstamp. The October 4 and 5 transactions involved nearly 107 million XRP, valued at just over $56 million. Bitso, a Mexican exchange and ... <a title=\"Bitso and Bitstamp receive 107M XRP from Ripple wallets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitso-and-bitstamp-receive-107m-xrp-from-ripple-wallets/\" aria-label=\"More on Bitso and Bitstamp receive 107M XRP from Ripple wallets\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-06T13:06:28.000Z",
    "title": "Flow proposes bridging to Ethereum via ‘gateway’",
    "url": "https://crypto.news/flow-proposes-bridging-to-ethereum-via-gateway/",
    "description": "Flow could soon support Ethereum dapps if a proposal by Dieter Shirley is approved"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T13:00:58.000Z",
    "title": "XRP Price On The Cusp Of Major Uptick To $1.4: Crypto Analyst",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-on-the-cusp-to-1-4-crypto-analyst/",
    "description": "A new XRP price prediction from notable crypto analyst, EGRAG CRYPTO, has investors buzzing. Based on a multi-timeframe analysis, Egrag believes XRP is showing considerable strength, hinting at a potential surge to $1.4. The analyst elucidated his predictions in a tweet, stating, &#8220;XRP Color Code To $1.4 &#8211; UPDATE: Trying to showcase the sheer strength and achievements of XRP from multiple time frames: Weekly, 3D, 1D, and 4H.&#8221; XRP Price Analysis: 1-Week Chart Delving into the Weekly Chart, Egrag finds an evident optimistic momentum. XRP is on the brink of achieving a notable milestone: sealing a full-body candle beyond the Fib 0.618 retracement level at $0.5119. Egrag notes that the imminent week&#8217;s closure and the definitive form of the candle would serve as a robust affirmation of this trend. Egrag&#8217;s meticulous breakdown pinpoints vital landmarks for the XRP price trajectory in the 1-week chart. The wicking range is demarcated between $0.3875 and $0.4719. Any downward breach below $0.3875 might disrupt the broader chart setup. Related Reading: XRP, Polygon See Month-High Volumes As Investors Show FOMO Meanwhile, the ranging region, where XRP could oscillate without clear directional momentum (and which XRP is currently leaving), is situated between $0.4719 and $0.5119. Eclipsing the $0.5119 boundary in the weekly timeframe propels XRP into a bullish domain, leading up to $0.5738 — in sync with the 50% Fibonacci retracement echelon. The crypto analyst postulates that the breach of this pivotal price level could catalyze a sweeping XRP rally. Venturing past the 50% Fibonacci zone might result in a landscape with scant resistance, potentially allowing XRP to shatter its annual peak at $0.9310. Concluding his extensive analysis, Egrag envisages an audacious endgame: a staggering 250% rally, propelling XRP towards the 1,618 Fibonacci extension at $1.4695. Shorter Time Frames Switching focus to the 3-day chart, XRP displays a body candle close above the Fibonacci 0.618 retracement level, indicating its presence in the bullish zone. Yet, the current shape of the candle is a neutral Harami style, leaving room for interpretation and lacking a decisive forward direction. Related Reading: XRP Price Breakout: This Resistance Level Holds The Key This particular formation, rooted in the Japanese term for &#8220;pregnant,&#8221; represents a potential inflection point in the price movement. Yet, its neutrality necessitates waiting for more concrete signals. Egrag emphasizes that the impending candle, closing today, might shed light on pivotal insights. In the 1-day Chart, the narrative is more assertive. XRP has successfully wrapped up seven consecutive daily candles beyond the Fib 0.618 benchmark in the green area. This trend, as Egrag postulates, radiates a palpable bullish aura. But he also advises vigilance for a potential retest of the lower boundary of the bullish green area, which could solidify this foundation. Lastly, when inspecting the 4-hour chart, a discernible double-top pattern emerges. With XRP exhibiting resistance to surpass the $0.55 mark, there is heightened anticipation of a possible double bottom near $0.50. This movement could pave the way for an assault on the Fib 1.618 zone, around $0.576. The crypto analyst forecasts this as a precursor to a bullish continuation. At press time, XRP traded at $0.52073. The 1-hour chart shows $0.5264 as the current key resistance and $0.5197 as the key support. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-06T12:51:00.000Z",
    "title": "Venture Capitalist Calls Out Binance For No ‘Proper Accounting System’",
    "url": "https://coinedition.com/venture-capitalist-calls-out-binance-for-no-proper-accounting-system/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Binance_Creates_Global_Advisory_Board_to_Tackle_Regulatory_Challenges-696x392-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance CEO Advises Community to Exploit the Current Market Fear\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Binance_Creates_Global_Advisory_Board_to_Tackle_Regulatory_Challenges-696x392-1.jpg 696w, https://coinedition.com/wp-content/uploads/2022/10/Binance_Creates_Global_Advisory_Board_to_Tackle_Regulatory_Challenges-696x392-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Binance_Creates_Global_Advisory_Board_to_Tackle_Regulatory_Challenges-696x392-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Binance_Creates_Global_Advisory_Board_to_Tackle_Regulatory_Challenges-696x392-1-600x338.jpg 600w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>Venture capital fund Cinneamhain Ventures partner Adam Cochran recently called out Binance&#8217;s U.S. subsidiary for the lack of an accounting system, maintaining minimal records, and struggles to effectively generate an audit report for legal proceedings, despite being &#8220;small and regulated.&#8221; This post on X (formerly Twitter) was a reply to a crypto user’s post highlighting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/venture-capitalist-calls-out-binance-for-no-proper-accounting-system/\">Venture Capitalist Calls Out Binance For No ‘Proper Accounting System’</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]