[
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T08:40:32.000Z",
    "title": " Early Mickey Mouse version no longer belongs to Disney, becomes top NFT on OpenSea ",
    "url": "https://cointelegraph.com/news/nft-steamboat-willie-old-mickey-mouse-version-copyright-expires-top-opensea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvY2Q0YjI4MzAtYjgyZC00ZjVkLWE2ZWUtYjdjYzc0ZTcxNzM5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>While the copyright has expired for the older version of the character, Disney reminded the public that modern versions remain unaffected. </p>\n                    <p><p>An earlier version of Walt Disney Company’s Mickey Mouse mascot has become the number 1 trending nonfungible token (NFT) at the OpenSea marketplace after it entered the public domain for the first time. </p><p>On Jan. 1, a version of Mickey featured in the 1928 short film “Steamboat Willie” <a href=\"https://edition.cnn.com/2024/01/01/business/mickey-mouse-early-version-copyright-expired/index.html\" target=\"_blank\" rel=\"noopener nofollow\">became</a> publicly available after its copyright reached its limit. Steamboat Willie <a href=\"https://www.moma.org/collection/works/302797\" target=\"_blank\" rel=\"noopener nofollow\">was</a> the first publicly distributed appearance of Mickey Mouse. After almost a century, Disney’s claim to this version of the character ended because United States law only allows copyright to be held for 95 years.</p><p>Following the copyright expiration, three NFT collections related to the old mascot took the top three spots on OpenSea’s 24-hour trending list. The NFT collection titled “Steamboat Willie Public Domain 2024” has hit the number one spot after getting around $1.2 million in trading volume. Another collection called “Steamboat Willie” took the number two spot on the list, while “Steamboat Willie’s Riverboat” took the third highest ranking. </p><p><a href=\"https://cointelegraph.com/news/nft-steamboat-willie-old-mickey-mouse-version-copyright-expires-top-opensea\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-02T08:40:52.000Z",
    "title": "Tellor’s Bizarre Pump And Dump Sparks Concerns Of Manipulation",
    "url": "https://cryptodaily.co.uk/2024/01/tellors-bizarre-pump-and-dump-sparks-concerns-of-manipulation",
    "description": "The team behind Tellor is facing accusations of market manipulation after the price of the protocol’s TRB token registered a staggering 172% in a single day."
  },
  {
    "source": "NullTX",
    "date": "2024-01-02T09:09:08.000Z",
    "title": "Crypto Funds Record Initial Outflows in 11 Weeks but Analyst Foresees Positive Prospects for Render (RNDR) & Rebel Satoshi ($RBLZ)",
    "url": "https://nulltx.com/crypto-funds-record-initial-outflows-in-11-weeks-but-analyst-foresees-positive-prospects-for-render-rndr-rebel-satoshi-rblz/",
    "description": "In the ever-evolving world of cryptocurrency, recent weeks have witnessed a notable event—the initial outflows from crypto funds in 11 consecutive weeks. This departure from the norm has sparked conversations and raised eyebrows among investors and enthusiasts alike. A digital asset investment firm, CoinShares, reported a substantial capital flight of [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-02T09:07:49.000Z",
    "title": "Breaking New Grounds: NuggetRush and NEAR Protocol Tipped to Outperform Bitcoin Cash in an Unexpected 2024 Upswing",
    "url": "https://nulltx.com/breaking-new-grounds-nuggetrush-and-near-protocol-tipped-to-outperform-bitcoin-cash-in-an-unexpected-2024-upswing/",
    "description": "TLDR: NuggetRush (NUGX) is a promising crypto investment, offering a virtual reality mining experience within a play-to-earn (P2E) gaming framework. The game features challenging quests, battles, and ranked play, providing opportunities to earn money and rewards. NEAR Protocol (NEAR) witnessed a surge in developer interest following its recent Wrapped release, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-02T09:05:47.000Z",
    "title": "Cathie Wood’s Bitcoin (BTC) Bullishness; Hedera (HBAR) and InQubeta (QUBE) Eyeing Bullish Momentum",
    "url": "https://nulltx.com/cathie-woods-bitcoin-btc-bullishness-hedera-hbar-and-inqubeta-qube-eyeing-bullish-momentum/",
    "description": "Cathie Wood, the CEO of Ark Invest, an investment management firm, has expressed confidence that U.S. regulators will finally approve a spot Bitcoin (BTC) exchange-traded fund (ETF) in the coming weeks. The move could help drive the BTC price substantially higher, according to Wood. At the same time, projections have [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T08:55:53.000Z",
    "title": "Bitcoin Price Soars Above $45,500: Top 3 Reasons",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-soars-above-45500-top-3-reasons/",
    "description": "The Bitcoin price has risen to over $45,900 in the last few hours, an increase of 7.5% in the last 24 hours. These are the three main reasons: #1 Massive Bid From CME The recent surge in Bitcoin&#8217;s price was predominantly led by activities on the Chicago Mercantile Exchange (CME). At a point, the Bitcoin price on CME was approximately $1,400 higher than on Coinbase, indicating significant buying pressure on this platform. The CME Group, a renowned exchange for cash settled Bitcoin futures contracts, attracts a substantial institutional investor base, making its price movements particularly noteworthy. Analyst Will Clemente highlighted the unusual trading activity, stating via X, “CME trading at fresh 52-week highs on an illiquid Monday night like someone knows something.” Related Reading: Bitcoin’s 2024 Forecast: From $60,000 To $500,000, Top Experts Share Bold Predictions Supporting this observation, analyst @MacnBTC remarked, &#8220;Something obviously leaking as CME is up +8.5% on the day.&#8221; Bluntz Capital echoed similar sentiments, noting, &#8220;CME tradfi apes are aping, huge premium.&#8221; CME tradfi apes are aping, huge premium pic.twitter.com/dwfW0shLB7 &#8212; Bluntz (@Bluntz_Capital) January 2, 2024 #2 Spot Bitcoin ETF Approval Rumors The approach of the January 10 deadline for the United States Securities and Exchange Commission&#8217;s (SEC) decision on the approval of a spot Bitcoin exchange-traded fund (ETF) has stirred significant market anticipation. As Bitcoinist reported today, the SEC is reportedly doing the last paperwork. Moreover, rumors intensified yesterday that the SEC could approve a batch of spot Bitcoin ETF already today, on January 2. A report from Reuters indicated that the SEC could potentially inform issuers as soon as today, Tuesday or Wednesday, about their authorization to introduce spot Bitcoin ETFs in the subsequent week. This speculation may have sparked a sense of FOMO (Fear of Missing Out) among investors. Related Reading: $47,600 Or $38,600? What Could Be Next For Bitcoin However, this is by no means a done deal. Eleanor Terrett of FOX Business shared insights on X, commenting on the SEC&#8217;s unpredictability. Terrett pointed out, “While the SEC is surely unpredictable, it would surprise me if approvals were to happen [today]. [&#8230;] The SEC still has to review all the changes made to the S-1s filed on Thursday/Friday AND make comments on them.” #3 Strong Technicals On Multiple Time Frames On the technical front, Bitcoin displayed strong bullish signals across various time frames. Renowned crypto analyst Skew focused on the 30-minute chart of BTC/USDT. In a post on X , Skew shared an attached chart and analyzed: BTC 30min: Systematically this has been super clean. Price tested both 4H 200MA &#38; 200EMA then grinded with 4H 200MA before reclaiming 1H 200MA &#38; 200EMA (momentum ignition). Technical flip of previous resistance into running towards the highs. Now we see how much momentum is brewing behind this. On the daily chart, BTC bounced off the lower end of the ascending trend channel and is now trying to overcome the upper resistance. Once again, BTC has respected the trend which started in mid-October and is now starting another breakout attempt. A daily close above $45,500 could be decisive. Then, the 0.618 Fibonacci retracement level at $48,700 could be the next target. At press time, BTC stood at $45,693. Featured image created with DALL·E 3, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T09:06:58.000Z",
    "title": "Bitcoin Price Soars Beyond $45,000 as Investors Await BlackRock’s BTC Spot ETF Greenlight by January 06",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-soars-beyond-45000-as-investors-await-blackrocks-btc-spot-etf-greenlight-by-january-06/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-soars-beyond-45000-as-investors-await-blackrocks-btc-spot-etf-greenlight-by-january-06",
    "description": "<img width=\"1600\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Price eclipses $45,000, buoyed by investor excitement over the potential approval of BlackRock&#8217;s BTC Spot ETF. Rising Bitcoin value aligns with anticipation for the upcoming Bitcoin halving, highlighting market optimism. As the crypto community steps into the new year, there are rumors about the potential approval of a Bitcoin ETF by the U.S. Securities and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T09:00:48.000Z",
    "title": "Shiba Inu (SHIB) Burn Surges; InQubeta (QUBE) Sets Sights on 3,210% Growth by 2024",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-burn-surges-inqubeta-qube-sets-sights-on-3210-growth-by-2024/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-burn-surges-inqubeta-qube-sets-sights-on-3210-growth-by-2024",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-57.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />The crypto landscape is buzzing with the latest developments from Shiba Inu (SHIB) and InQubeta (QUBE), each carving out their unique trajectories in the crypto world. SHIB&#8217;s burn rate has surged dramatically, signaling a strategic move to bolster its market position. Parallelly, InQubeta, a new ICO integrating crypto and AI, is setting its sights on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T08:51:21.000Z",
    "title": "Ripple Devs Spark End-of-Year Frenzy with Memetastic Challenge to Wrap Up 2023",
    "url": "https://www.crypto-news-flash.com/ripple-devs-spark-end-of-year-frenzy-with-memetastic-challenge-to-wrap-up-2023/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-devs-spark-end-of-year-frenzy-with-memetastic-challenge-to-wrap-up-2023",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-logo-on-tablet-with-price-and-charts-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-logo-on-tablet-with-price-and-charts-\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Ripple Developers launched the memetastic challenge to end 2023 in grand style. The challenge complements the growth of the XRP Ledger and broader XRP ecosystem in 2023. As the curtains closed on 2023,  Ripple Labs Inc. and its developer community, RippleX have initiated the #builtonXRPL Challenge, a memetastic endeavor that invites developers and community members [...]"
  }
]