[
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T06:30:00.000Z",
    "title": "Multichain Team’s Deafening Silence Sparks Concern Among Users",
    "url": "https://cryptodaily.co.uk/2023/05/multichain-teams-deafening-silence-sparks-concern-among-users",
    "description": "<p>The silence emanating from Multichain&rsquo;s leadership has amplified rumors, leading to significant unease and uncertainty among protocol users.&nbsp;</p>\n<p>At present, several of Multichain&rsquo;s cross-chain pathways remain down, leading to a major pile-up of transactions on the protocol.&nbsp;</p>\nMultichain&rsquo;s Radio Silence\n<p>The radio silence from the Multichain team has left users searching for answers, with the protocol currently holding $1.5 billion in total value locked (TVL). Multichain face a fifth day of outages and transactions that are in limbo, primarily due to multiple cross-chain pathways that are still offline. These include Polygon zkEVM, Kava, and zkSync. Initially, the team stated that this was caused due to an upgrade that was being patched. However, this explanation was revised, with the cause outlined as an ambiguous explanation of &ldquo;force majeure.&rdquo;&nbsp;</p>\n<p>The uncertainty and radio silence comes against the backdrop of unverified rumors circulating on Twitter that the protocol&rsquo;s core leadership could possibly be under arrest in China. Co-founder of Multichain, DJ Qian, took to Twitter, stating he had asked Multichain CEO Zhaojun and its founding partner Xu Guochang if they could provide any help or explanation.&nbsp;</p>\n\n<p>&ldquo;From yesterday to today, I received a lot of greetings. Many people sent messages asking me if I was okay. Thank you for your concern. Of course, I&rsquo;m fine. At the same time, I also hope that there is nothing serious about multichain. Although I am not ashamed of what Zhaojun did before, after all, I brought Zhaojun and Guochang into the industry. I asked Guochang for some information to see if he could provide technical or other help. Well, the most important thing is the safety of user assets and the safety of people.&rdquo;</p>\n\nLeadership Under Arrest?&nbsp;\n<p>With rumors of the team&rsquo;s arrest circulating on Twitter, Multichain&rsquo;s VP of Strategic Partnerships stated in a Telegram group message that he was not aware if Chinese authorities had actually detained the protocol&rsquo;s leadership. Protocol CEO Zhaojun did not reply to any messages on the group in question nor to direct queries. The project&rsquo;s Discord server and other Telegram groups are dealing with similar uncertainty, with no updates about the project or its future. All community members have been told to wait for any further updates.&nbsp;</p>\nMULTI Token Plummets&nbsp;\n<p>With the uncertainty surrounding the project, the protocol&rsquo;s native MULTI token has continued its downward trajectory. With users complaining that their transactions had been stuck since Sunday, the team assured them that their funds were safe and they were working to resolve the issue. David Who, a community manager with Multichain, had given users an update, stating,&nbsp;</p>\n\n<p>&ldquo;At this stage, we can&rsquo;t be sure when it will be fully fixed. However, our user&rsquo;s funds are safe, and pending transactions would &ldquo;pass through automatically and instantly&rdquo; after resolution.&rdquo;</p>\n\n<p>However, with no resolution, the token&rsquo;s price has continued to drop. Currently, the MULTI token is down over 28% and is trading at $3.80.&nbsp;</p>\nOther Projects React&nbsp;\n<p>Several projects have responded to the situation unfolding at Multichain. Coinflux Network became the latest to respond, stating that it had suspended Multichain&rsquo;s co-mint privileges as a precautionary measure. This would prevent Multichain from minting new tokens on the project&rsquo;s blockchain. Furthermore, Coinflux also added that it would work with users to mitigate any losses that may arise. Crypto Investment firm HashKey Group also revealed that it had moved $250,000 from Multichain to Gate.io. Meanwhile, Tron founder Justin Sun also revealed that he had withdrawn 470,000 of the USDD stablecoin from the protocol.&nbsp;</p>\n<p>Cryptocurrency exchange Binance also swung into action, announcing that it was suspending deposits for 10 bridged tokens following days of transactions being stuck in limbo. This impacted several token pairs, including Polkastarter (POLS), Alpaca Finance (ALPACA), Travala.com (AVA), Spell (SPELL), Fantom (FTM), Alchemy (ACH), Beefy (BIFI), SuperVerse (SUPER), Harvest Finance (FARM) and DeXe (DEXE). Binance&rsquo;s announcement will impact users of bridged tokens on Ethereum, Avalanche, BNB Smart Chain, and Fantom.&nbsp;</p>\n<p>Fantom Foundation also moved to limit its exposure, withdrawing $2.4 million in liquidity of the MULTI token on the SushiSwap DEX. Andre Cronje, Fantom Foundation Director, explained that Fantom had to act due to the uncertainty surrounding Multichain and was withdrawing the funds out of caution. Cronje added,&nbsp;</p>\n\n<p>&ldquo;No point to LP at times of uncertainty. You can see in the wallet the funds haven&rsquo;t been sold. As soon as Multichain is able to release a statement around this and clear it up, we will LP again.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-26T06:22:11.000Z",
    "title": "Bitcoin.com’s VERSE Token Now Available for Trading on Kucoin",
    "url": "https://news.bitcoin.com/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-1536x864.png 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-1520x855.png 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news-1280x720.png 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/kucoin-verse-listing-news.png 2000w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin.com&#x2019;s ecosystem token, VERSE, has been listed on Kucoin, a top-tier cryptocurrency exchange platform known for being the home of crypto gems. Deposits are open now, and trading will commence at 10:00 AM UTC with the initial pair being VERSE/USDT. A milestone moment for Bitcoin.com, this first exchange listing for VERSE is significant because it [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T06:29:10.000Z",
    "title": "Gemini Chooses Dublin as European Headquarters for Crypto Expansion",
    "url": "https://www.cryptopolitan.com/gemini-dublin-european-headquarters-crypto/",
    "description": "Gemini, the US-based cryptocurrency exchange founded by Cameron and Tyler Winklevoss, has announced its selection of Dublin as its European headquarters. The move marks an expansion of Gemini&#8217;s footprint in the continent as it aims to tap into the thriving innovation and technology scene in Ireland.&#160; With its launch in Ireland and 11 other EU ... <a title=\"Gemini Chooses Dublin as European Headquarters for Crypto Expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gemini-dublin-european-headquarters-crypto/\" aria-label=\"More on Gemini Chooses Dublin as European Headquarters for Crypto Expansion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T06:17:42.000Z",
    "title": "Luke Goss Appointed as Ambassador for Europe’s Premier Gaming, Art, and Blockchain Event",
    "url": "https://www.cryptopolitan.com/luke-goss-appointed-as-ambassador-for-europes-premier-gaming-art-and-blockchain-event/",
    "description": "Zaragoza- Open Games is thrilled to announce the appointment of Luke Goss as the Ambassador for Europe&#8217;s most prestigious gaming, art, and blockchain event. This four-day extravaganza, Open Game Con, set to take place in Zaragoza, promises to be a unique celebration that highlights the transformative power of art, technology, and community. With a vision ... <a title=\"Luke Goss Appointed as Ambassador for Europe’s Premier Gaming, Art, and Blockchain Event\" class=\"read-more\" href=\"https://www.cryptopolitan.com/luke-goss-appointed-as-ambassador-for-europes-premier-gaming-art-and-blockchain-event/\" aria-label=\"More on Luke Goss Appointed as Ambassador for Europe’s Premier Gaming, Art, and Blockchain Event\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-26T06:30:06.000Z",
    "title": "Crypto News Today: Crypto Pizza Man Buys HedgeUp (HDUP), Will HedgeUp (HDUP) Shoot Past Shiba Inu (SHIB) & Apecoin (APE)",
    "url": "https://nulltx.com/crypto-news-today-crypto-pizza-man-buys-hedgeup-hdup-will-hedgeup-hdup-shoot-past-shiba-inu-shib-apecoin-ape/",
    "description": "The story of &#8220;Bitcoin Pizza Guy,&#8221; who bought two pizzas for 10,000 Bitcoins in 2010, has become a legendary tale in the crypto world. Today, this same individual has decided to venture back into the cryptocurrency market, this time investing in HedgeUp (HDUP). The move has stirred the crypto community, sparking questions about whether HedgeUp [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-05-26T06:27:24.000Z",
    "title": "HedgeUp (HDUP) Presale Raised Over $1.8m, While Solana (SOL) & Binance Coin (BNB) Drop Off",
    "url": "https://nulltx.com/hedgeup-hdup-presale-raised-over-1-8m-while-solana-sol-binance-coin-bnb-drop-off/",
    "description": "In the constantly evolving world of cryptocurrencies, there is a continuous shift in power dynamics. Coins that were leading yesterday may be overshadowed today by newer, more innovative tokens. This is precisely what we&#8217;re witnessing now as the presale of HedgeUp (HDUP) successfully raised over $1.8 million, while established coins like Solana (SOL) and Binance [&#8230;]"
  }
]