[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-12T23:00:21.000Z",
    "title": "Ethereum’s Vitalik Buterin Proposes Gas Limit Increase",
    "url": "https://news.bitcoin.com/ethereums-vitalik-buterin-proposes-gas-limit-increase/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum&#039;s Vitalik Buterin Advocates for Higher Gas Limit to Improve Network Capacity\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_gas_limi_increase.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Amidst escalating transaction fees, Ethereum&#x2019;s Vitalik Buterin has suggested a substantial gas limit increase, potentially boosting network capacity and reducing user expenses. Ethereum&#x2019;s Vitalik Buterin Advocates for Higher Gas Limit to Improve Network Capacity Ethereum ecosystem co-founder Vitalik Buterin has proposed an increase in the network&#x2019;s gas limit. This adjustment, aimed at augmenting network capacity, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T23:00:17.000Z",
    "title": "Litecoin About To Explode And Outperform Bitcoin? Analyst Is Super Bullish",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-explode-outperform-bitcoin-analyst-bullish/",
    "description": "Litecoin, a cryptocurrency often referred to as the &#8220;silver to Bitcoin&#8217;s gold,&#8221; is gaining traction among analysts who predict its potential to outperform Bitcoin shortly.  Tony &#8220;the Bull,&#8221; a certified chartist and the Head of Research at NewsBTC, took to X on January 12, laying out a bullish outlook for the 18th most valuable cryptocurrency. Citing its monthly candlestick formations, the analyst said what&#8217;s panning out are signs of an imminent breakout that could propel the coin higher in the coming weeks. Related Reading: Cardano’s 2024 Kickoff: First Two Weeks Show Major Updates, Report Litecoin About To Rip Higher? Specifically, Tony &#8220;The Bull&#8221; said what&#8217;s printing out in the monthly chart is &#8220;insanely bullish&#8221; for Litecoin. This outlook is warming for Litecoin Bulls, considering its drab performance in 2023 when prices consolidated before tanking in the second half.  The researcher also shared another chart, predicting that the crypto community is &#8220;close to witnessing something impressive.&#8221; The analyst&#8217;s enthusiasm echoes earlier assessment of Litecoin&#8217;s &#8220;SuperTrend&#8221; indicator, which seems to suggest significant price gains for Litecoin in the coming sessions. Litecoin remains within a bearish formation, consolidating, as evident in the monthly chart. Of note, prices are still trending inside the bear bar of August 2023. Despite general optimism, Litecoin bulls have yet to reverse those losses and remain within a tight, flat-lining range, as evident in the monthly chart.  Still, Litecoin might set a fresh trend depending on the breakout direction. Any upswing above $115 might ignite demand that may lift the coin towards May 2021 highs of around $400. Spot Bitcoin ETF Didn&#8217;t Push BTC Above $50,000 Tony &#8220;The Bull&#8221;&#8216;s bullish sentiment on Litecoin comes as Bitcoin, the world&#8217;s largest cryptocurrency, is trending lower, looking at the performance in the daily chart. Despite the US Securities and Exchange Commission (SEC) approving 11 spot Bitcoin ETFs, Bitcoin prices have failed to break above the $50,000 resistance level.  For now, the crypto community remains bullish. Bitcoin supporters earlier claimed the approval of spot Bitcoin ETFs would trigger billions into the coin and broadly the sphere. The derivative product provides a legal channel for institutions to invest in Bitcoin. Still, the SEC chair Gary Gensler maintained that Bitcoin is a speculative asset despite the agency&#8217;s approval. Related Reading: XRP Burn Hits Major Milestone, Can The Burns Propel Price To $1? In contrast to Bitcoin&#8217;s lackluster performance, Litecoin has shown resilience, maintaining a firm stance amidst market volatility. This development suggests that Litecoin may be poised to outperform Bitcoin in the coming months. The LTCBTC chart shows Litecoin is up 21% versus Bitcoin, rallying from January lows.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-12T23:01:39.000Z",
    "title": "CoinShares International Acquires Valkyrie Funds After Approval of the Firm’s US Spot Bitcoin (BTC) ETF",
    "url": "https://dailyhodl.com/2024/01/12/coinshares-international-acquires-valkyrie-funds-after-approval-of-the-firms-us-spot-bitcoin-btc-etf/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/To-Acquire-Crypto-Asset.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>CoinShares International is purchasing US digital asset management firm Valkyrie Funds after the U.S. Securities and Exchange Commission (SEC) approved the firm’s US spot market Bitcoin (BTC) exchange-traded fund. In a new press release, European digital investment group CoinShares says it&#8217;s venturing into the US by exercising its option to acquire Valkyrie Funds, a move [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/12/coinshares-international-acquires-valkyrie-funds-after-approval-of-the-firms-us-spot-bitcoin-btc-etf/\">CoinShares International Acquires Valkyrie Funds After Approval of the Firm’s US Spot Bitcoin (BTC) ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]