[
  {
    "source": "Decrypt",
    "date": "2023-09-01T00:03:33.000Z",
    "title": "Otherside: Legends of the Mara Open Beta Launching in September",
    "url": "https://decrypt.co/154526/otherside-legends-mara-open-beta-launching-september",
    "description": "The Bored Ape Yacht Club creator's Otherside: Legends of the Mara game experience is about to open up, letting players evolve egg-like NFTs."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-31T23:42:16.000Z",
    "title": "YouTuber Loses $60K Worth of Crypto After Showing Seed Phrases on Stream",
    "url": "https://decrypt.co/154522/youtuber-loses-60k-worth-crypto-after-showing-seed-phrase-stream",
    "description": "The Brazilian YouTuber went on an emotional rollercoaster this week—but there's a mostly happy ending to his tale."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-01T00:04:11.000Z",
    "title": "Coinbase Lists PayPal USD as Binance Cuts BUSD Support",
    "url": "https://cryptobriefing.com/coinbase-lists-paypal-usd-as-binance-cuts-busd-support/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase added PayPal's stablecoin, PYUSD, while Binance decided to stop support for its BUSD due to regulatory challenges."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-31T23:44:15.000Z",
    "title": "SEC Delays Decision on Bitcoin ETFs from BlackRock, Fidelity, and Five Others",
    "url": "https://cryptobriefing.com/sec-delays-decision-on-bitcoin-etfs-from-blackrock-fidelity-and-five-others/?utm_source=feed&utm_medium=rss",
    "description": "The SEC has delayed its decision on seven spot bitcoin exchange-traded fund (ETF) proposals."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T00:00:02.000Z",
    "title": "Base TVL Surges By 76% Amidst New DeFi Protocol Hype",
    "url": "https://www.newsbtc.com/coinbase/base-tvl-surges-by-76-amidst-new-defi-protocol-hype/",
    "description": "Base, an Ethereum layer 2 (L2) network developed by prominent cryptocurrency exchange Coinbase, has seen its total value locked (TVL) soar to new heights on Friday, August 31. This surge was triggered by the recent launch and growing hype around the decentralized exchange (DEX) platform Aerodrome. Total Value Locked on Base Reach $333 Million The total decentralized finance (DeFi) deposits on Base have hit a new all-time high following a nearly 76% spurt in the past 24 hours. According to data from DefiLlama, the network’s TVL currently stands at $346.39 million, jumping from $196.8 million a day ago. Total Value Locked on the Base network &#124; Source: DefiLlama This sharp rise has seen Base leap into the top ten blockchains with the largest TVL, sitting above Solana in ninth position. However, Ethereum remains the dominant network in the decentralized finance space, with a total value of roughly $22.1 billion. 💥 BREAKING: Total Value Locked on @BuildOnBase has surpassed $300M and entered the top 10 blockchains with the largest TVL 🔵🚀 pic.twitter.com/KC7tClvA1g — Base Daily (@BaseDailyTK) August 31, 2023 Related Reading: Ethereum Holds Uptrend Support And Could Aim Fresh Rally To $1,800 Interestingly, this latest feat only underscores the overall progress of Base since opening its doors to the public on August 9, 2023. The Coinbase-incubated network’s TVL has swelled more than 733% since the public mainnet launch.  One of the notable catalysts of the Base’s growth was the short-lived hype of the social media platform Friend.tech. However, activity on the decentralized app has since hit a snag, with trading fees dipping by more than 94%.  Aerodrome Drives An Inflow Of $170 Million To Base As earlier mentioned, the latest resurgence in Base’s DeFi deposits was triggered by the growing interest in the Aerodrome protocol, which recently launched on the blockchain. Aerodrome is a decentralized exchange developed by the team behind Velodrome, a popular DEX on the Optimism chain. The platform rewards users who provide liquidity and participate in protocol governance with its native token, AERO. Related Reading: Coinbase (COIN) And Bitcoin-Related Stocks Soar Following Grayscale’s Victory Thanks to the AERO emissions, which began on August 30, Aerodrome has attracted more than $170 million in value to the Base network. Meanwhile, this has reflected a significant 6,000% rise in the protocol’s TVL in the past 24 hours.  Despite the initial negative sentiment brewing around Base due to the BALD rug pull, and various DeFi protocol exploits, it appears that major cryptocurrency projects are continuing to expand to the layer 2 network.  PancakeSwap, the second-largest decentralized exchange, is one of the protocols to have recently joined the trend. The DeFi platform went live on the Base network on Thursday, 30th of August. The cryptocurrency market cap on the daily timeframe &#124; Source: TOTAL chart on TradingView Featured image from Pexel, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-01T00:00:21.000Z",
    "title": "Crypto Whales and Sharks May Have Front-Run Grayscale’s Victory Over SEC: Santiment Data",
    "url": "https://dailyhodl.com/2023/08/31/crypto-whales-and-sharks-may-have-front-run-grayscales-victory-over-sec-santiment-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/crypto-whales-front-run.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Analytics firm Santiment finds that crypto whales managed to purchase Bitcoin (BTC) in the day leading up to Grayscale&#8217;s court victory over the U.S. Securities and Exchange Commission (SEC). Santiment suggests certain whale and shark addresses &#8220;may have known a thing or two&#8221; about Grayscale&#8217;s legal win before it was announced, noting that wallets holding [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/31/crypto-whales-and-sharks-may-have-front-run-grayscales-victory-over-sec-santiment-data/\">Crypto Whales and Sharks May Have Front-Run Grayscale’s Victory Over SEC: Santiment Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]