[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T08:00:22.000Z",
    "title": "Bitcoin Headed for First Monthly Loss in Six Months",
    "url": "https://www.coindesk.com/markets/2023/05/30/bitcoin-headed-for-first-monthly-loss-since-december/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The liquidate wave from the narrative of lower inflation has now run its course and the market needs a new driver and theme to lift prices higher, one observer said."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T07:51:20.000Z",
    "title": "Bybit Receives “In-Principle” Approval to Operate in Kazakhstan",
    "url": "https://cryptodaily.co.uk/2023/05/bybit-receives-in-principle-approval-to-operate-in-kazakhstan",
    "description": "<p>Crypto exchange Bybit received &ldquo;in-principle&rdquo; approval to operate as a crypto custody service provider in Kazakhstan.</p>\n<p>&nbsp;Cryptocurrency exchange Bybit announced on Monday that it received pre-approval to operate as a crypto custody service provider in Kazakhstan. Bybit was approved by Kazakhstan&rsquo;s Astana Financial Services Authority (AFSA) to serve as a digital asset trading facility and provide custody services at the Astana International Financial Centre (AIFC).</p>\n<p>Bybit&rsquo;s in-principle approval subjects it to pre-conditions leading to permanent authorization upon the exchange&rsquo;s completion of the full application process.</p>\nKazakhstan Established Itself as a Hub for Digital Assets\n<p>Kazakhstan, as a gateway to the Commonwealth of Independent States (CIS), has fast established itself as a hub for cryptocurrencies, crypto mining and blockchain development. In January, Kazakhstan adopted laws regulating crypto mining and exchange. The laws regulate the circulation of crypto within the country while introducing a licensing regime for crypto miners and exchanges.</p>\n<p>Bybit recognized the opportunity to expand its growth in the space. Ben Zhou, co-founder and CEO of Bybit, said:</p>\n\n<p>It has always been our primary objective to operate our business in compliance with relevant rules and regulations. Bybit firmly supports the regulatory objective of establishing a compliant, secure, and transparent cryptocurrency industry to benefit users.</p>\n\n<p>Adding,</p>\n\n<p>We are delighted to receive an in-principle approval from AFSA. We believe in the promising potential of the CIS and are eager to open up our world-class trading platform for crypto enthusiasts in the region.</p>\n<p>We are committed to continuing to improve the cryptocurrency industry&rsquo;s standards and provide a valuable experience to our customers.</p>\n\nBybit Now Offers Lending Services\n<p>The Dubai-based exchange announced earlier that it launched an in-house crypto lending service for its users: Bybit Lending. The newly launched service delivers hourly interest payments from lending pools, and lenders can also deposit and redeem loaned crypto tokens without any lock-up periods.</p>\n<p>The exchange says its new service bridges the gap between lenders and borrowers in the crypto space. Borrowers on the exchange can take out loans to use on the platform&rsquo;s many trading options and must post greater than or equal amounts to their loan to ensure lenders&rsquo; capital is safe.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T08:06:31.000Z",
    "title": "WUBITS Launches New Features for Crypto Enthusiasts Seeking Connection and Innovation",
    "url": "https://www.crypto-news-flash.com/wubits-launches-new-features-for-crypto-enthusiasts-seeking-connection-and-innovation-2/?utm_source=rss&utm_medium=rss&utm_campaign=wubits-launches-new-features-for-crypto-enthusiasts-seeking-connection-and-innovation-2",
    "description": "<p>New York, United States, May 23rd, 2023, Chainwire The crypto community thrives on digital connections and exchanging ideas. The techno-activists Cypherpunks owe their rise to social media platforms, as does the birth of cryptocurrencies and blockchain technology. It&#8217;s no wonder that blockchain-based social networks are popping up left and right, ready to reward users with [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/wubits-launches-new-features-for-crypto-enthusiasts-seeking-connection-and-innovation-2/\">WUBITS Launches New Features for Crypto Enthusiasts Seeking Connection and Innovation</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T07:47:54.000Z",
    "title": "VeChain Launches Innovative Tool to Conquer the Billion-Dollar Market and Ascend as the Leading Blockchain Solution",
    "url": "https://www.crypto-news-flash.com/vechain-launches-innovative-tool-to-conquer-the-billion-dollar-market-and-ascend-as-the-leading-blockchain-solution/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-launches-innovative-tool-to-conquer-the-billion-dollar-market-and-ascend-as-the-leading-blockchain-solution",
    "description": "<p>VeChain launches a new virtual node to enhance high availability. The market sentiment of VET is currently bullish. VeChain (VET) has in its latest blog post introduced a new virtual node to automatically distribute requests to a list of publicly known nodes. This is to ensure that there is high availability and resilience by redirecting [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/vechain-launches-innovative-tool-to-conquer-the-billion-dollar-market-and-ascend-as-the-leading-blockchain-solution/\">VeChain Launches Innovative Tool to Conquer the Billion-Dollar Market and Ascend as the Leading Blockchain Solution</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T08:08:09.000Z",
    "title": "‘HK Crypto Future Uncertain,’ Warns China’s Pioneer BTC Exchange Founder",
    "url": "https://coinedition.com/hk-crypto-future-uncertain-warns-chinas-pioneer-btc-exchange-founder/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/A_China_Crypto_Pioneer_Warns_Hong_Kong_May_Cool_on_Digital_Assets.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent warning to the crypto community, renowned entrepreneur Bobby Lee raised concerns about Hong Kong’s (HK) long-term commitment to crypto, casting doubt on the country’s digital asset ambitions. Lee, who experienced firsthand the disruptive effects of regulatory crackdowns in China, believes his story serves as a cautionary tale for firms lured by Hong [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hk-crypto-future-uncertain-warns-chinas-pioneer-btc-exchange-founder/\">‘HK Crypto Future Uncertain,’ Warns China’s Pioneer BTC Exchange Founder</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]