[
  {
    "source": "NewsBTC",
    "date": "2023-10-29T15:00:19.000Z",
    "title": "FTX And Alameda Addresses Move $80 Million In Crypto Over The Past Week – Details",
    "url": "https://www.newsbtc.com/ftx/ftx-and-alameda-addresses-moved-80-million-in-crypto-over-the-past-week/",
    "description": "According to the latest on-chain data, wallet addresses linked to the now-bankrupt FTX exchange and Alameda Research have transferred substantial amounts in crypto assets over the past week. This series of funds movement was first brought to the limelight by prominent blockchain analytics firm Nansen, who reported that more than $60 million had been moved. However, further on-chain revelation shows that nearly $80 million has been moved from FTX- and Alameda-linked addresses in the previous week. Nansen Uncovers FTX And Alameda&#8217;s $60 Million Transfer On Friday, October 27, Nansen disclosed &#8211; via a series of posts on X (formerly Twitter) &#8211; that FTX has been transferring millions in digital assets, including Chainlink (LINK), Solana (SOL), Ethereum (ETH), Polygon (MATIC), etc, to various exchange addresses.  Related Reading: Bitcoin Bull Market: Crypto Spot Trading Volumes Climb To 8-Month Highs Prior to this development, the analytics firm initially reported that around $8.6 million were moved to a Binance address. According to the latest Nansen data, FTX subsequently moved $24.3 million in various tokens to different addresses on Coinbase and Binance.  Additionally, 943K SOL (just under $32M) has been moved from the FTX Cold Storage wallet This is the address: 9uyDy9VDBw4K7xoSkhmCAm8NAFCwu4pkF6JeHUCtVKcX That means the total funds that have moved from FTX and Alameda wallets this week is currently more than $60M pic.twitter.com/yNgakImsoV — Nansen 🧭 (@nansen_ai) October 27, 2023 The now-defunct exchange would later transfer 943,000 SOL (worth around $32 million) from its cold storage wallet on Friday. Based on Nansen’s data as of October 27, the total funds moved from FTX and Alameda wallets was above $60 million. Has There Been More Transfers? On Saturday, October 28, another blockchain data tracker, Lookonchain, offered an update on the recent transfer activities of the FTX- and Alameda-associated addresses. In a post on the X platform, the analytics platform revealed that FTX and Alameda moved an additional $20 million in crypto assets on Saturday. FTX assets transfer in the past week &#124; Source: Lookonchain/x According to Lookonchain, FTX addresses transferred 309,185 SOL (worth around $10 million), 2 million Band Protocol tokens (equivalent to $3.15 million), 3.82 Perpetual Protocol tokens (worth about $2.3 million), amongst other crypto assets. Using Lookonchain’s data, this brings the total value FTX has moved this week to $78.7 million. Related Reading: Solana Price Could Reach $3,211 By 2030, VanEck Forecasts While the purpose of these transfers is unknown, it remains to be seen whether they are associated with the exchange’s bankruptcy proceedings. And it comes after the FTX estate recently staked $122 million worth of Solana tokens. FTX exchange has been looking to conclude its pending Chapter 11 court case, with a recent proposal offering customers more than 90% of their missing assets toward the end of Q2 2024. Meanwhile, former CEO Sam-Bankman Fried is currently on trial for seven counts of fraud-related offenses. Solana price at $32.30 on the daily timeframe &#124; Source: SOLUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-29T15:01:37.000Z",
    "title": "Cardano Price Prediction: ADA Bearish While $ROE Passes $1.25M Raised",
    "url": "https://www.crypto-news-flash.com/cardano-price-prediction-ada-bearish-while-roe-passes-1-25m-raised/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-price-prediction-ada-bearish-while-roe-passes-1-25m-raised",
    "description": "<img width=\"512\" height=\"319\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113-300x187.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is known for its high volatility with different tokens having ups and downs due to the market sentiment. In this ever-changing play of events, we’ll be exploring two different narratives. On one side of the table, BorroeFinance ($ROE) presale is booming, and Cardano, considered the ‘’ Ethereum Killer’’, is facing significant bearish [...]"
  }
]