[
  {
    "source": "CoinDesk",
    "date": "2023-08-17T16:20:10.000Z",
    "title": "FTX-Linked Farmington State Bank Slapped with Fed Enforcement Action",
    "url": "https://www.coindesk.com/policy/2023/08/17/ftx-linked-farmington-state-bank-slapped-with-fed-enforcement-action/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "TK"
  },
  {
    "source": "Decrypt",
    "date": "2023-08-17T16:36:38.000Z",
    "title": "Bitcoin Plunges Below $28,000 for First Time in Two Months",
    "url": "https://decrypt.co/152809/bitcoin-plunges-below-28000-first-time-two-months",
    "description": "Bitcoin has dropped to its lowest level since mid-June, likely because of investors fed up of the SEC's delay in approving a spot ETF."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T16:25:29.000Z",
    "title": "Why is XRP price down today?",
    "url": "https://cointelegraph.com/news/why-is-xrp-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/9abc65e1-0a72-4890-b286-fdf43790ead5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>XRP price is down today, like other top crypto assets, as traders digest the most recent comments from the Federal Reserve.</p>\n                    <p><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) price is down today, mirroring trends elsewhere in the cryptocurrency market as traders digest the most recent comments from the Federal Reserve.</p><p>XRP’s <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a> token has been facing persistent pressure since July 20, when it hit its highest point since April 2022, driven by optimistic expectations arising from Judge Analisa Torres' ruling that portions of the token sale were not a securities issuance. The judge's decision stated that <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">secondary sales of XRP do not count as an investment contract</a>, a crucial aspect of the U.S. Securities and Exchange Commission's (SEC) accusation.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ad6d86a2-902f-482f-b9d2-f5a682ae1ce8.png\"  /><figcaption style=\"text-align: center;\"><em>XRP token price index in USD, 12-hour chart. Source: TradingView &amp; Cointelegraph</em></figcaption></figure><p>Despite this positive boost, the upward momentum that propelled XRP price to $0.83 quickly reversed. Investors realized that the ruling might eventually be overturned in higher courts. It became apparent that the decision only exempted Ripple and its founders from selling through exchanges or engaging directly with institutional investors.</p><p>Shortly after, on July 31, Judge Jed Rakoff from the Southern District Court of New York <a href=\"https://cointelegraph.com/news/judge-denies-motion-dismiss-terraform-sec-case-reject-ripple-ruling\">rejected Terraform Labs' attempt</a> to dismiss a lawsuit filed by the SEC. This rejection also overturned the prior decision made by U.S. District Judge Analisa Torres, who had ruled that Ripple's sale of XRP tokens on public exchanges did not violate securities laws.</p><p>In the subsequent five days, XRP underwent an 11.3% price correction, dropping to $0.63. This reflected the deteriorating regulatory environment and reduced investor interest in holding XRP. Furthermore, other recent events have intensified investor concerns, causing an additional 6% decline in XRP's price between August 14 and August 16.</p><h2>Potential appeal from the SEC</h2><p>While the SEC has submitted an interlocutory brief to officially express its <a href=\"https://cointelegraph.com/news/crypto-lawyers-express-views-on-ripple-s-case-amid-sec-appeal\">plan to challenge Judge Analisa Torres' decision</a>l, Stuart Alderoty, Ripple's Chief Legal Officer, argued that the SEC is not currently entitled to appeal. This is why they are seeking permission for an appeal, and Ripple is anticipated to provide its response to the Court in the upcoming week.</p><p>During a recent discussion on Tony Edward's Thinking Crypto Podcast, James Seyffart, an exchange-traded fund (ETF) analyst at Bloomberg, <a href=\"https://twitter.com/ThinkingCrypto1/status/1691147512755662866?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> that the listing of XRP futures on the CME, which he believes is unlikely to happen in the near future, would need to occur before a potential ETF launch. Consequently, the analyst dampened expectations for a XRP spot ETF to become a reality. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/xrp-price-fall-40-september-fractal-analysis\">XRP price can fall 40% by September — Fractal analysis</a></em></strong></p><h2>Macroeconomic uncertainty weighs on XRP’s performance</h2><p>Taking a broader view, it could be argued that investors are displaying a higher degree of caution. This shift could be attributed to the outcomes of the U.S. Federal Reserve's strategies aimed at curbing inflation, which are beginning to impact the economy by causing increased financing costs. Notably, investor Kevin O’Leary has <a href=\"https://finance.yahoo.com/news/cracks-starting-show-kevin-oleary-161152429.html\" target=\"_blank\" rel=\"noopener nofollow\">observed</a> a slowdown in lending and a rise in borrowing costs for small businesses. He has also pointed out emerging vulnerabilities in regional banks.</p><p>O'Leary further suggests that the Fed may continue raising interest rates due to the persistent presence of inflationary pressures. He specifically raises questions about the potential impact of the spending associated with the Inflation Reduction Act and the CHIPS Act. O'Leary highlights that a substantial sum of money, nearly a trillion dollars, remains unutilized. \"That money has not been deployed yet, Larry, that’s close to a trillion dollars,\" O’Leary stated.</p><p>Given these circumstances, and considering Ripple and the XRP token are grappling with their own issues in an environment that's not conducive to risk-on assets, the likelihood of further price correction becomes more pronounced. Thus, a retest of the $0.54 level, which acted as resistance in June 2023, appears quite possible.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-17T16:30:44.000Z",
    "title": "Grayscale hiring for its ETF team as markets await SEC decision",
    "url": "https://cryptoslate.com/grayscale-hiring-for-its-etf-team-as-markets-await-sec-decision/",
    "description": "<p>Grayscale, a prominent U.S. crypto asset manager, teased its hiring process for its ETF (exchange-traded fund) team today, signaling an optimistic outlook on its long-pending Bitcoin ETF application. The announcement came via a tweet that has already garnered over half a million views, further underscoring the financial community&#8217;s keen interest in the subject. Long time [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-hiring-for-its-etf-team-as-markets-await-sec-decision/\">Grayscale hiring for its ETF team as markets await SEC decision</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-17T16:20:07.000Z",
    "title": "FTX Navigates Dispute with Genesis, Proposes $176M Settlement",
    "url": "https://cryptobriefing.com/ftx-navigates-dispute-genesis-proposes-176m-settlement/?utm_source=feed&utm_medium=rss",
    "description": "FTX seeks a court-mandated resolution to their ongoing dispute with Genesis entities through a proposed $176 million settlement."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T16:36:34.000Z",
    "title": "Central Bank of Colombia research: implementing CBDC won’t tag significant economic risks",
    "url": "https://crypto.news/central-bank-of-colombia-research-implementing-cbdc-wont-tag-significant-economic-risks/",
    "description": "Colombia's central bank recommends implementing restrictions on CBDC holdings, as its research indicates that CBDC adoption will likely result in limited economic impacts"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T16:14:45.000Z",
    "title": "Billion Dollar BRICS Countries: Ditching USD Starts With Oil and Gas, Bitcoin (BTC), and Ripple (XRP) to Replace",
    "url": "https://www.crypto-news-flash.com/billion-dollar-brics-countries-ditching-usd-starts-with-oil-and-gas-bitcoin-btc-and-ripple-xrp-to-replace/?utm_source=rss&utm_medium=rss&utm_campaign=billion-dollar-brics-countries-ditching-usd-starts-with-oil-and-gas-bitcoin-btc-and-ripple-xrp-to-replace",
    "description": "<img width=\"1920\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920.png 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-300x225.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-1024x768.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-768x576.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-1536x1152.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/bitcoin-g93262a28a_1920-48x36.png 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />BRICS member countries are already conducting international transactions in their local currencies, limiting their dependency on the U.S. dollar. BRICS is expected to launch a new currency or new method of settling international trade in the upcoming summit next week. BRICS member states have expressed their intention to ditch the USD both as a reserve [...]"
  }
]