[
  {
    "source": "CryptoSlate",
    "date": "2024-01-04T00:00:50.000Z",
    "title": "Polymarket ETF odds fell to 70%, BTC saw 8% flash crash amidst Matrixport prediction",
    "url": "https://cryptoslate.com/polymarket-etf-odds-fell-to-70-btc-saw-8-flash-crash-amidst-matrixport-prediction/",
    "description": "<p>Betting odds on Polymarket concerning the approval of pending spot Bitcoin exchange-traded funds (ETFs) briefly fell to 70% on Jan. 3. On whether a spot Bitcoin ETF will be approved by Jan. 15, Polymarket displayed a &#8220;yes&#8221; outcome as priced at $0.70 at 1:30 p.m. UTC on Jan. 3. Polymarket data and various other reports [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/polymarket-etf-odds-fell-to-70-btc-saw-8-flash-crash-amidst-matrixport-prediction/\">Polymarket ETF odds fell to 70%, BTC saw 8% flash crash amidst Matrixport prediction</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T00:00:10.000Z",
    "title": "Bitcoin At A Crossroads? Economist’s Doom Prediction Clashes With Spot ETF Approval Hopes",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-at-a-crossroads-economists-doom-prediction-clashes-with-spot-etf-approval-hopes/",
    "description": "As the world of crypto braces for a potential regulatory nod from the US Securities and Exchange Commission (SEC) in favor of a Bitcoin spot exchange-traded fund (ETF), Peter Schiff, a notable crypto critic, has voiced a dissenting opinion. Schiff projected a grim future for Bitcoin, especially in the event of a spot ETF approval. His comments come at a time when the crypto community is abuzz with expectations of a boost in institutional investor interest in Bitcoin. Related Reading: CryptoQuant Sound Alarm: Spot Bitcoin ETF Approval May Trigger Drop To $32,000, Here’s Why Economist Spells Gloom For Bitcoin In a recent post on X, Schiff expressed his skepticism, suggesting that the speculative buzz around the US.-listed ETF directly investing in Bitcoin has been &#8220;inflating&#8221; the crypto’s value. This view aligns with Bitcoin&#8217;s price trend, which saw an uptick in late last year, following a false report about the approval of BlackRock&#8217;s pending spot ETF application. While crypto enthusiasts view the potential spot ETF approval as a gateway for traditional investors into the crypto market, Schiff’s outlook starkly contrasts this sentiment. Be careful what you wish for. The promise of a U.S. listed spot #BitcoinETF has been supporting the #Bitcoin price and speculative demand for years. Once the ETFs are launched and the highly anticipated institutional and other new investor demand does not show up, look out below! — Peter Schiff (@PeterSchiff) January 2, 2024 Community Clashes With Schiff&#8217;s Pessimism Peter Schiff&#8217;s statements have not gone unchallenged in the crypto community. On X, his posts have attracted critical responses, with users questioning the basis of his bearish predictions. One X user, known as Bloxpert, directly asked Schiff for examples of ETF launches that led to bearish outcomes. Schiff, in response, questioned the necessity of a Bitcoin ETF, arguing that since Bitcoin can be bought and stored independently, an ETF seems redundant. He implicitly downplayed the need for such financial products in the crypto space, concluding: &#8220;You might as well just own a gold ETF.&#8221; Well there is really no need for a Bitcoin ETF, as you can buy and store Bitcoin yourself for free. What&#8217;s the point of owning it in an ETF anyway? You might as well just own a gold ETF. — Peter Schiff (@PeterSchiff) January 2, 2024 Despite Schiff’s bearish outlook, a significant portion of the crypto community and many experts remain optimistic. For instance, James Butterfill, head of research at CoinShares, sees the approval of a spot Bitcoin ETF in the US as a transformative event for the digital asset market. Related Reading: Bitcoin’s 2024 Forecast: From $60,000 To $500,000, Top Experts Share Bold Predictions Butterfill suggests that an investment increase of 20% from current assets under management could push Bitcoin prices to around $80,000. Such predictions stand in stark contrast to Schiff’s views, reflecting the diverse opinions and expectations surrounding Bitcoin&#8217;s future in the wake of potential regulatory changes. Featured image from Unsplash, Chart from TradingView"
  }
]