[
  {
    "source": "CoinDesk",
    "date": "2023-09-14T18:23:29.000Z",
    "title": "Most Important U.S. Senator for Crypto’s Future Tells Regulators to Use Existing Powers",
    "url": "https://www.coindesk.com/policy/2023/09/14/most-important-us-senator-for-cryptos-future-tells-regulators-to-use-existing-powers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. Sen. Sherrod Brown (D-Ohio), whose chairmanship of the Senate Banking Committee gives him power over crypto’s congressional destiny, issued a call to arms to regulators on Thursday, demanding that they use whatever authority they currently have over digital assets to improve market transparency and protect the investors putting their money into the sector."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-14T18:32:25.000Z",
    "title": "Crypto Exchange Updates Marketing and Fees After Hong Kong Regulator Warning",
    "url": "https://decrypt.co/156730/crypto-exchange-updates-marketing-and-fees-after-hong-kong-regulator-warning",
    "description": "Hong Kong requires crypto firms to register with its securities regulator. According to SFC, JPEX never applied for a license."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-14T18:18:50.000Z",
    "title": "Bitcoin Jumps as European Central Bank Signals End to Rate Hikes",
    "url": "https://decrypt.co/156714/bitcoin-jumps-as-european-central-bank-signals-end-to-rate-hikes",
    "description": "The central bank said Thursday its current interest rate level may reign in inflation if \"maintained\" for long enough. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T18:19:52.000Z",
    "title": "House Financial Services Comm. witnesses air multiple anti-CBDC arguments",
    "url": "https://cointelegraph.com/news/house-financial-services-committee-witnesses-air-multiple-anti-cbdc-arguments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9aef06d0-3b60-46ed-87b4-ed681047a571.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The digital assets subcommittee heard from five opponents of a U.S. CBDC without giving supporters equal (or any) time. </p>\n                    <p><p>A chorus of disapproval rang out from the halls of the United States Congress on Sept. 14 as the House of Representatives Financial Services Committee digital assets subcommittee held a hearing on the “digital dollar dilemma.” Five expert witnesses were scheduled to testify at the hearing, and all of them argued against creating a U.S. central bank digital currency (CBDC), otherwise known as a digital dollar.</p><p>The five witnesses <a href=\"https://financialservices.house.gov/calendar/eventsingle.aspx?EventID=408960\" target=\"_blank\" rel=\"noopener nofollow\">slated</a> to speak at the hearing were Digital Asset CEO Yuval Rooz, senior vice president of the advocacy group Bank Policy Institute Paige Paridon, University of Pennsylvania Wharton School's Christina Parajon Skinner, Norbert Michel from the think-tank Cato Institute and Columbia University lecturer Raúl Carrillo. </p><p>The hearing is explicitly dedicated to private sector alternatives to CBDC, but only Rooz was directly affiliated with a business. </p><p>Digital Asset is the creator of the Daml smart contract language and the Canton blockchain, which <a href=\"https://cointelegraph.com/news/microsoft-goldman-sachs-others-partner-in-new-blockchain-network\">is backed by companies</a> such as Microsoft, Goldman Sachs and Deloitte. In his prepared testimony, Rooz urges that any form of digital dollar should leverage existing technologies in the private sector.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/TODAY?src=hash&amp;ref_src=twsrc%5Etfw\">#TODAY</a> @ 2 PM - Subcmte RM <a href=\"https://twitter.com/RepStephenLynch?ref_src=twsrc%5Etfw\">@RepStephenLynch</a> leads Democrats as the Subcmte on Digital Assets, Financial Technology and Inclusion holds a hearing entitled “Digital Dollar Dilemma: The Implications of a Central Bank Digital Currency and Private Sector Alternative”<br><br>:…</p>&mdash; U.S. House Committee on Financial Services (@FSCDems) <a href=\"https://twitter.com/FSCDems/status/1702358178350927955?ref_src=twsrc%5Etfw\">September 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Paridon spoke about claims made by digital dollar supporters with counterarguments. She concentrated on issues that could arise within the banking system. Based on this list of potential risks, she concluded, “A CBDC could undermine the commercial banking system in the United States and severely constrict the availability of credit to the economy.” </p><p>Skinner set CBDC largely in a historical context, beginning with the apparent intentions of the Founding Fathers. She concluded:</p><blockquote>“Introducing CBDC is likely to have certain costs to individual economic liberty by providing the State with more tools – and hence greater temptation – to establish command-and-control style public policy.” </blockquote><p>The Cato Institute <a href=\"https://cointelegraph.com/news/cbdcs-threaten-americans-core-freedoms-cato-institute\">has a well-established record</a> as an opponent of CBDC. Michel addressed technical and political issues and sees no good coming from a U.S. CBDC.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/house-committee-discussions-digital-dollar-hearing\">House committee will reopen discussions on digital dollar in Sept. 14 hearing</a></em></strong></p><p>Carrillo stated his support for a digital dollar and opposition specifically to a CBDC. A major objection put forward by Carrillo to CBDC is the concentration of responsibilities in the Federal Reserve since the Treasury Department has many roles in monetary creation and implementation of financial technology.</p><p>In his analysis, Carrillo stated, “There is a profoundly mistaken assumption that we do not already live in a financial surveillance state.” He continued:</p><blockquote>“Although counterintuitive to some CBDC critics, substantively reigning in government financial surveillance means limiting public-private partnerships, as direct relationships between the government and members of the public are more likely to engender constitutional protections, including protection under the Fourth Amendment.” </blockquote><p>Blockchain technology is not a decisive factor in ensuring privacy, Carrillo argued:</p><blockquote>“Aspirationally, blockchain hides sensitive data about users, but in practice, blockchain systems necessarily interface with the surveilled infrastructure of the rest of the internet.” </blockquote><p>Carrillo endorsed the Electronic Cash and Secured Hardware (ECASH) Act, which was not one of the bills being examined by the subcommittee but was, Carrillo said, being <a href=\"https://lynch.house.gov/_cache/files/5/0/500162f9-7fce-4981-b9b9-16bf22e10ede/83EE032381B9431A65DE22B213D3A10E.rep.-lynch-ecash-act-fact-sheet.pdf\" target=\"_blank\" rel=\"noopener nofollow\">re-introduced</a> on Sept. 14. Carrillo concluded that “DFC [digital fiat currency] discourse in the United States is comparatively impoverished and unimaginative. […] Policymakers should support an array of Digital Dollar pilot programs and develop a steady rhythm of innovation, aiming to build a safe and secure financial system for all.” </p><p>Among the questions that go unanswered in the presentations was that of who precisely the often-mentioned supporters of CBDC are. References <a href=\"https://cointelegraph.com/news/us-treasury-report-encourages-instant-payment-recommends-more-cbdc-research\">were made to CBDC research</a> being conducted by the Fed. Still, in light of the Fed’s well-known mantra of no CBDC without Congressional authorization, that seems like a paper tiger.</p><p><a href=\"https://docs.house.gov/meetings/BA/BA21/20230914/116340/BILLS-118HR3402ih.pdf\" target=\"_blank\" rel=\"noopener nofollow\">H.R. 3402</a>, one of the bills under discussion at the hearing, seeks to make a Congressional mandate for the introduction of a CBDC a legal requirement. <a href=\"https://docs.house.gov/meetings/BA/BA21/20230914/116340/BILLS-118HR3712ih.pdf\" target=\"_blank\" rel=\"noopener nofollow\">H.R. 3712</a>, also under consideration, would largely ban CBDC research. Rep. Tom Emmer’s <a href=\"https://cointelegraph.com/news/tom-emmer-anti-cbdc-bill-reintroduced\">recently re-introduced</a> \"CBDC Anti-Surveillance State Act\" was also on the hearing agenda.  </p><p>Presumably, the Biden administration was seen as supportive, as the president’s March 2022 executive order on digital assets <a href=\"https://cointelegraph.com/news/biden-s-executive-order-promises-great-things-for-the-crypto-industry-eventually\">mandated CBDC research</a>. The advocacy group Digital Dollar Project, co-founded by former U.S. Commodity Futures Trading Commission head Christopher Giancarlo, has also <a href=\"https://cointelegraph.com/news/digital-dollar-project-completes-cbdc-retail-remittance-pilot-with-western-union\">contributed significantly to CBDC research</a>.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/china-digital-yuan-economic-cyberweapon-us-disarming/\">China’s Digital Yuan Is an Economic Cyberweapon, and the US Is Disarming</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T18:37:05.000Z",
    "title": "Bitcoin BSC Crypto ICO Reaches 50% Of Soft Cap After Raising Almost $2 Millions in 10 Days",
    "url": "https://cryptodaily.co.uk/2023/09/bitcoin-bsc-crypto-ico-reaches-50-of-soft-cap-after-raising-almost-2-millions-in-10-days",
    "description": "Bitcoin BSC Crypto ICO Reaches 50% Of Soft Cap After Raising Almost $2 Millions in 10 Days"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T18:38:12.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T18:35:26.000Z",
    "title": "Binance initiates token burn and delisting for BUSD and TUSD pairs",
    "url": "https://www.cryptopolitan.com/binance-initiates-token-burn/",
    "description": "Cryptocurrency exchange giant Binance has taken significant steps in its ongoing process of disengagement from its stablecoin BUSD. The exchange announced a token burn for idle Binance-pegged BUSD tokens across various blockchain networks.  Additionally, Binance will be delisting trading pairs associated with TUSD (TrueUSD), another stablecoin traded on the platform. This move follows a series ... <a title=\"Binance initiates token burn and delisting for BUSD and TUSD pairs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-initiates-token-burn/\" aria-label=\"More on Binance initiates token burn and delisting for BUSD and TUSD pairs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T18:18:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have again lost momentum. BNB prices have dropped by 11.65% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is $212.78 with a 24-hour trading volume of $355,103,550. ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T18:11:59.000Z",
    "title": "Rocket Pool Price Prediction 2023-2032: Is RPL A Good Investment?",
    "url": "https://www.cryptopolitan.com/rocket-pool-price-prediction-2023-2032/",
    "description": "Rocket Pool (RPL) is making waves in the cryptocurrency world, and this is the ideal place to understand its future potential. It&#8217;s crucial to keep a close eye on RPL&#8217;s price trends and predictions because it&#8217;s a prominent name in decentralized finance. In this ever-evolving landscape, staying informed about RPL&#8217;s real-time charts and market insights ... <a title=\"Rocket Pool Price Prediction 2023-2032: Is RPL A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rocket-pool-price-prediction-2023-2032/\" aria-label=\"More on Rocket Pool Price Prediction 2023-2032: Is RPL A Good Investment?\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T18:36:00.000Z",
    "title": "Crypto Firm Sponsoring Messi’s Team Hires Ex-Goldman Executive as CCO",
    "url": "https://coinedition.com/crypto-firm-sponsoring-messis-team-hires-ex-goldman-executive-as-cco/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Firm Sponsoring Messi’s Team Hires Ex-Goldman Executive as CCO\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Deutsche_Banks_Asset_Management_Arm_Eyes_Crypto_Investments-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Javier Rodriguez-Alarcon, a former Goldman Sachs executive, is joining XBTO, a crypto investment firm that sponsors football superstar Lionel Messi&#8217;s new team, Inter Miami, a Bloomberg report reveals. According to the post, he is expected to join fully by the end of next month. Rodriguez-Alarcon, who spent more than a decade at Goldman Sachs, will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-firm-sponsoring-messis-team-hires-ex-goldman-executive-as-cco/\">Crypto Firm Sponsoring Messi’s Team Hires Ex-Goldman Executive as CCO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]