[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-14T12:19:29.000Z",
    "title": "77-Year-Old American Woman Loses $661,000 in Tech Support Scam Involving Crypto",
    "url": "https://www.cryptoglobe.com/latest/2023/10/77-year-old-american-woman-loses-661000-in-tech-support-scam-involving-crypto/",
    "description": "In the spring of 2021, Marjorie Bloom, a 77-year-old widow and retired federal attorney, was reportedly tricked into transferring $661,000 to a scammer who claimed to be a fraud investigator at PNC Bank, where she had been a customer for many years. According to CNBC, the scammer persuaded Bloom to liquidate her assets, including her […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-14T12:29:59.000Z",
    "title": "Ex-ETH advisor Nerayoff highlights Buterin’s praise for XRP over Bitcoin",
    "url": "https://www.cryptopolitan.com/ex-eth-advisor-nerayoff-highlights-buterins-praise-for-xrp-over-bitcoin/",
    "description": "The XRP community spotlighted an old comment made by Ethereum co-founder Vitalik Buterin about XRP. Notably, Buterin&#8217;s praise for XRP was recently returned to the limelight by Steven Nerayoff, a former Ethereum advisor. However, this comment by Buterin had been previously deleted, leaving traces of the statement in the public domain. Moreover, Buterin&#8217;s erased remark ... <a title=\"Ex-ETH advisor Nerayoff highlights Buterin&#8217;s praise for XRP over Bitcoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ex-eth-advisor-nerayoff-highlights-buterins-praise-for-xrp-over-bitcoin/\" aria-label=\"More on Ex-ETH advisor Nerayoff highlights Buterin&#8217;s praise for XRP over Bitcoin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-14T12:28:07.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-14T12:30:40.000Z",
    "title": "Bloomberg Analyst Predicts Likelihood Of A Spot Bitcoin ETF By January 2024",
    "url": "https://www.newsbtc.com/news/bitcoin/bloomberg-spot-bitcoin-etf/",
    "description": "Following notable changes to the ARK 21Shares Spot Bitcoin ETF application, Bloomberg ETF analysts James Seyffart and Eric Balchunas have predicted that the US Securities and Exchange Commission (SEC) could approve a fund as early as next year.   90% Chance Of Approval In a post shared on his X (formerly Twitter) platform, Seyffart highlighted his team’s prediction of the 90% chance that a Spot Bitcoin ETF will be approved by Ark Invest’s January 10 deadline. January 10 is the day the SEC is expected to make a final decision (approval or denial) on ARK Invest’s Spot Bitcoin ETF application.  Related Reading: Crypto Analyst Breaks Down The Factors Behind The Bitcoin Price Decline Their latest prediction comes amid the recent amendment ARK Invest and 21Shares made to their Spot Bitcoin ETF prospectus. These updates include further context to the fund and additional risk disclosures. These analysts believe that this sort of amendment only happens when a fund is on its way to being approved.  These Bloomberg analysts had earlier predicted (following Grayscale’s victory) that there was a 75% chance that the pending Spot Bitcoin ETF applications could be approved this year and that the odds would rise to 95% by the end of next year if these funds weren’t approved by then.  Eric Balchunas noted on his X platform that Invesco Galaxy had also amended its Spot Bitcoin ETF prospectus following the ARK 21Shares amendment. He stated that he expects other applicants to update their applications soon. This suggests that the SEC could approve all applications simultaneously, similar to what it did with the Ethereum futures ETFs. BTC price looking weak &#124; Source: BTCUSD on Tradingview.com Spot Bitcoin ETFs Given Huge Boost Following SEC’s Decision Meanwhile, these Spot Bitcoin ETF applications were given a huge boost following the SEC’s decision not to appeal the court’s ruling in its case against Grayscale. The SEC had until October 13 to appeal the Court of Appeal’s ruling that it had acted arbitrarily and capriciously in disapproving Grayscale’s application to convert its GBTC fund into a Spot Bitcoin ETF. Following its decision not to file an en banc application or appeal to the Supreme Court, Reuters reported that the appeals court is expected to issue a mandate laying out how the SEC could carry out its order, including the Commission reviewing Grayscale’s application again.  Related Reading: US Mega Bank JPMorgan Predicts Harsh Drop In This Bitcoin Metric James Seyffart also noted that dialogue between Grayscale and SEC should begin next week. However, it remains uncertain if or when the SEC will approve these applications, especially considering that it has delayed its decision on all Spot Bitcoin ETFs till next year. Bitcoin has reacted positively to the news of the SEC’s decision not to file an appeal, currently trading at around $26,849.76, up in the last twenty-four hours, according to data from CoinMarketCap.  Featured image from Forbes, chart from Tradingview.com"
  }
]