[
  {
    "source": "CoinDesk",
    "date": "2023-12-12T21:43:54.000Z",
    "title": "Bitcoin Halts at $41K as Traders Eye Fed Rate Decision; AVAX Flips Dogecoin as Altcoins Jump",
    "url": "https://www.coindesk.com/markets/2023/12/12/bitcoin-halts-at-41k-as-traders-eye-fed-rate-decision-avax-flips-dogecoin-as-altcoins-jump/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin remained steady around $41,000 after Monday's dramatic flush."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-12T21:47:35.000Z",
    "title": " Bitcoin derivatives data points to traders&#039; $50K BTC price target ",
    "url": "https://cointelegraph.com/news/bitcoin-derivatives-data-shows-traders-aiming-for",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvM2MxNzgzM2UtZDA3OS00MThkLTk3MDQtYWYxODAyNDIwYTZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin bulls expectations of $50,000 and higher remain feasible according to BTC futures and options markets.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price continues to trade below its 2023 high, a sign that investors may have underestimated the strength of the $44,000 resistance. Even as BTC price trades below $42,000, it doesn't necessarily mean that reaching $50,000 and beyond is no longer possible. In fact, quite the opposite seems more likely to occur. Looking at Bitcoin derivatives metrics, it is clear that traders ignored the 6.9% drop and remained optimistic. However, is this optimism enough to justify further gains?</p><p>The $127 million<a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-today\" > liquidation of leveraged long</a> Bitcoin futures on Dec. 11 may seem significant in absolute terms, but it represents less than 1% of the total open interest – the value of all outstanding contracts. Nevertheless, it's undeniable that the liquidation engine triggered a 7% correction in less than 20 minutes.</p><p>On one hand, one could argue that derivatives markets played a crucial role in the recent negative price movement. However, this analysis overlooks the fact that after hitting a low of $40,200 on Dec. 11, Bitcoin's price increased by 4.2% in the following six trading hours. In essence, the impact of forceful liquidation orders had dissipated long ago, disproving the notion of a crash solely driven by futures markets.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-derivatives-data-shows-traders-aiming-for\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-12T22:04:47.000Z",
    "title": "Cardano unveils new identity wallet, boosting blockchain ease",
    "url": "https://www.cryptopolitan.com/cardano-unveils-new-identity-wallet/",
    "description": "In a significant development for the blockchain industry, the Cardano Foundation has announced the launch of a new W3C-compatible Identity Wallet. This innovative tool enhances user interaction with Cardano’s Decentralized Applications (DApps) and supports various identity and credential standards. With its user-friendly interface, the Identity Wallet ensures the safe management of digital assets and lowers [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-12T21:42:53.000Z",
    "title": "Analyst sees support for Dogecoin at 9 cents",
    "url": "https://crypto.news/analyst-sees-support-for-dogecoin-at-0-9/",
    "description": "Crypto analyst KrissPax believes Dogecoin has found a floor around 9 cents despite retreating from recent highs."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-12T22:00:09.000Z",
    "title": "Shiba Inu News: Shibarium Hits Another Major Milestone",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-news-shibarium-hits-another-major-milestone/",
    "description": "Shibarium, the Ethereum-based layer 2 blockchain solution from the Shiba Inu team, has achieved yet another major milestone, showcasing growing strength within the platform. Shiba Inu Shibarium&#8217;s Latest Important Milestone The Shiba Inu layer 2 platform has recently crossed a significant milestone in terms of total transactions processed as total transactions have increased dramatically over the past few weeks. According to Shibariumscan &#8211; the network tracker, Shibarium has crossed over 90 million transactions performed in the platform since its introduction. Data from the network tracker shows that the number is currently sitting at approximately 90,677,816 as of the time of writing. Related Reading: Shibarium Transactions Sees 4,400% Explosion, Time For SHIB And BONE ATH? It is noteworthy that since December 2, the Shiba Inu blockchain has continuously maintained a whopping average of 7.5 million daily transactions. Currently, the total number of daily transactions revealed by the network&#8217;s tracker is totaled at 7.84 million transactions. The network&#8217;s activity appears to be growing significantly, reaching major milestones over the past few weeks. Earlier this month, the total number of transactions in Shibarium was sitting at 66 million, indicating over 35% increase since this month. Data from Shibariumscan also revealed an uptick in the network&#8217;s total blocks and wallet addresses. Shibarium&#8217;s total number of blocks is approximately 2,077,814, while the total number of wallet addresses is 1,305,042. This kind of surge in transactions means that millions of BONE tokens were spent on transaction fees. As a result of this, it prepares the stage for the much-anticipated Shiba Inu token burn. However, despite the recent surge in transactions, the Shiba Inu burn rate is still down in the past 24 hours. According to Shibburn, the SHIB token burn rate is down by 91% over the past 24 hours. It is worth noting that Shiba Inu recently saw its highest burn rate ever since the initiative was introduced. Last week, the project saw an astounding 7,686,774% increase in burn rate, destroying about 8.35 billion SHIB tokens. Shibarium Migrates To Sepolia Network Last week, Shiba Inu announced that Shibarium will be adopting the Sepolia network. The team pointed out that Shibarium Puppynet will be moved from the Goerli Network to the Sepolia Network. The goal of this adjustment is to be in line with more effective and scalable infrastructures, according to the team. Additionally, the transition will pave the way for more advanced solutions. Related Reading: Shiba Inu Set To Establish A New Era For Shibarium Burns Furthermore, the move is not merely a transition, but an upgrade that will enable a more efficient and user-friendly environment. This is because of the growing demands of the blockchain community, particularly in fields such as NFTs and DeFi. Sepolia provides a testing environment that is more stable and controlled, precisely replicating the Ethereum mainnet&#8217;s features and functionalities. Due to this, developers are guaranteed access to a dependable and consistent platform for testing their dApps and smart contracts. The team asserted that this strategic shift will become live on December 15, 2023. Featured image from iStock, chart from Tradingview.com"
  }
]