[
  {
    "source": "Decrypt",
    "date": "2023-08-28T18:58:20.000Z",
    "title": "This Premium Glow-in-the-Dark Game Boy Plays All the Classics",
    "url": "https://decrypt.co/154023/premium-glow-dark-game-boy-plays-all-classics",
    "description": "Nintendo’s Game Boy gets a modern upgrade with the unofficial Analogue Pocket—now with a spooky vibe in tow."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T19:07:23.000Z",
    "title": "The bright side of Evergrande’s collapse? More crypto volatility",
    "url": "https://cointelegraph.com/news/bright-side-evergrande-collapse-more-crypto-volatility",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e05d6934-c03e-4119-b936-5fe51ab69031.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Evergrande’s ongoing bankruptcy saga has significant macroeconomic implications — including for the global cryptocurrency market.</p>\n                    <p><p>As Evergrande Group, China’s heavily indebted property developer, <a href=\"https://www1.hkexnews.hk/listedco/listconews/sehk/2023/0818/2023081800635.pdf\" target=\"_blank\" rel=\"noopener nofollow\">files</a> for bankruptcy in the United States, many are concerned about how this will <a href=\"https://cointelegraph.com/news/why-did-bitcoin-price-suddenly-drop-analysts-explain\">impact the global economy and cryptocurrencies</a>. The situation represents one of the largest debt faultings in the world and will have sizable ramifications.</p><p>However, it shouldn’t come as too much of a surprise that China’s real estate agent running out of money to cover debt is causing worry within the crypto space. While many fear Evergrande’s collapse will cause a knock-on effect for other tokens and coins already vulnerable in financial markets, the increased crypto volatility could be the silver lining for investors.</p><h2>Market uncertainty and volatility</h2><p>The collapse of a significant financial player like Evergrande could generate uncertainty and volatility across all asset classes, including cryptocurrencies. There’s no denying the crypto market is volatile. In other words, even the slightest hit to the status quo can cause the price of even the biggest cryptocurrencies to go down the dumps or through the roof.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blacks-misguided-crypto-dummies-etf\"><strong><em>BlackRock’s misguided effort to create ‘Crypto for Dummies’</em></strong></a></p><p>This is even the case for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). Cryptocurrencies are falling as concerns around China result in risk off-sentiment. Leading analysts have reported that the downturn in the crypto market is no big deal. However, investors are still in a hurry to liquidate their <a href=\"https://cointelegraph.com/news/how-crypto-funds-shape-the-development-of-the-digital-asset-market\">crypto funds</a>. This is likely due to the fear of China’s crisis disrupting the biggest worldwide financial balance. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Evergrande, one of China’s real estate giants, just filed Chapter 15 bankruptcy.<br><br>Meanwhile, China’s HY real estate index is down a massive 82% in just over 2 years.<br><br>This puts the index back down to 2008-levels.<br><br>All while China just “unexpectedly” cut interest rates.<br><br>Is China… <a href=\"https://t.co/p3yuIqPmxL\">pic.twitter.com/p3yuIqPmxL</a></p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1692518358145520006?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Investors may either flee to cryptocurrencies as a hedge against traditional markets or sell off crypto assets to cover losses elsewhere. Additionally, volatility is being harnessed by professional traders to book profits by selling during recovery and purchasing the dip. Bitcoin miners, then, are holding on to their funds even as it becomes increasingly challenging to mine for the cryptocurrency.</p><h2>Liquidity crunch</h2><p>If Evergrande’s collapse results in tightened credit markets, liquidity could become scarce. Cryptocurrency may be liquidated en masse to cover losses or meet margin calls, causing a temporary price drop. Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) accounts for around half of the market capitalization of stablecoins and is a significant component of crypto market liquidity. </p><p>Tether is quite active in Asia, and there was some concern that some of USDT’s backing would be Evergrande commercial paper. Therefore, the collapse in Evergrande would be poor news for Tether and the market as a whole. While Tether issued a statement recently stating it does not hold any Evergrande paper, that doesn’t mean it is entirely free from Evergrande-related risks. Ultimately, this situation could cause a broader liquidity crisis within the industry.</p><h2>Influence on Chinese cryptocurrency activity</h2><p>There’s no denying the Evergrande collapse is occurring at a delicate time for China’s economy. The fallout from the collapse has affected banks, smaller suppliers, and even worldwide markets exposed to Evergrande’s debt. Considering that Evergrande is a Chinese company, its collapse could have specific implications for crypto markets in China. </p><p>These implications come from concerns about Tether’s holdings and that crypto is vulnerable to downturns in the broader market. Given China’s complex relationship with cryptocurrencies, any financial instability could lead to regulatory shifts that impact crypto adoption or trading within the country. It’s clear Evergrande’s challenges are part of a much larger set of issues within the sale of Chinese equities in global markets.</p><h2>Macroeconomic consideration</h2><p>While the collapse of Evergrande may seem as though it is about nothing more than the company, there is more to it. China is one of the world’s leading economies, and Evergrande is one of the largest companies within the Chinese economy.</p><p>Therefore, the fallout has presented significant macroeconomic implications. If a broader economic downturn is yet to come, cryptocurrencies could benefit as a “safe haven” asset. Due to their limited supply and lack of dependence on national governments, crypto assets can be key in times of crisis.</p><p>Additionally, cryptocurrency prices seem to be less affected by macroeconomic elements than prices of more traditional financial assets. Paradoxically, financial crises often lead to increased innovation and adoption of alternative financial systems.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/privacy-advocates-win-binance-buckles-under-pressure\"><strong><em>Binance caves to pressure over coin listings, scoring a win for privacy</em></strong></a></p><p>In other words, in times of desperation, leaders and developers are encouraged to engage in outside-the-box thinking and devise effective and unique solutions. Bitcoin, for example, was born after a crisis, and the crypto market was developed as an alternative to the traditional economy.</p><p>It’s difficult to say whether events that occur in the broader economy will truly threaten crypto markets. A global economic slowdown ideally shouldn’t materially impact the price of cryptocurrencies, and crypto should be considered a speculative asset.</p><p>Therefore, Evergrande’s collapse could be an opportunity for the crypto market. The collapse of these traditional structures and encouraging a separation between the traditional and crypto economies could accelerate interest in decentralized finance solutions.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Daniele Servadei</strong> Is the 20-year-old founder and CEO of Sellix, an Italian e-commerce platform that has processed more than $75 million in transactions for more than 2.3 million customers worldwide. He's also attending the University of Parma for a degree in computer science.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T19:01:27.000Z",
    "title": "\n                        Stargate Deploys to Kava Chain Unifying Cosmos-Ethereum Liquidity\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/stargate-deploys-to-kava-chain-unifying-cosmos-ethereum-liquidity",
    "description": "\n                        <p>Georgetown, Cayman Islands, August 28th, 2023, Chainwire</p>\n<p>&nbsp;</p>\n<p>Stargate, the leading omnichain liquidity layer, and native asset bridge with over $18 billion in lifetime transaction volume, has now deployed on Kava Chain, the Cosmos-Ethereum interoperable Layer 1. This integration will expand the reach of Tether&rsquo;s Cosmos-native USDt issued exclusively on the Kava Chain, to the Ethereum ecosystem and beyond.</p>\n<p>Stargate's success in connecting Ethereum networks is unmatched, with 300x more TVL than the next most-used bridge. Deploying Stargate on the Kava Chain gives DeFi users the most secure and efficient way to move USDt between the Cosmos and Ethereum ecosystems.</p>\n<p>The integration ensures that users from any of Stargate&rsquo;s chains have access to USDt on Kava Chain and every app-chain on Cosmos&rsquo;s Internet of Blockchains. Ease-of-use features like single-click transfers and swaps, combined with unified liquidity and instant guaranteed finality, make traversing USDt capital efficient and simple. Stargate's native asset transaction capabilities ensure a more direct and efficient connection to the Cosmos ecosystem.</p>\n\n<p>&ldquo;Kava Chain&rsquo;s growth since becoming the exclusive native USDt hub for Tether has been impressive, with 90 million native USDt issued,&rdquo; said Scott Stuart, Kava Chain Co-founder. &ldquo;With Kava Chain now on Stargate, both retail and institutional users who previously had restricted access to certain features on Kava, now have an even broader spectrum of opportunities with USDt.&rdquo;</p>\n\n<p>Stargate's involvement, combined with the Kava Chain's USDt integration, promises to drive growth, increase exposure to liquidity, and open the Kava Chain and Cosmos ecosystems to wider markets, unprecedented usage for the first time.</p>\nAbout the Kava Chain\n<p>The Kava Chain is a secure, lightning-fast Layer-1 blockchain that combines the developer power of Ethereum with the speed and interoperability of Cosmos in a single, scalable network. Committed to fostering innovation and growth, the Kava Chain is a trusted choice for developers and users worldwide.&nbsp;</p>\n<p>For more updates, follow Kava Chain on X (fka Twitter).</p>\nAbout Stargate\n<p>Stargate is a fully composable liquidity transport protocol that lives at the heart of Omnichain DeFi. With Stargate, users &amp; dApps can transfer native assets cross-chain while accessing the protocol&rsquo;s unified liquidity pools with instant guaranteed finality.</p>\nContact\n<p>Media managerguillermo carandiniKavaguillermo.carandini@kava.io</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T19:00:00.000Z",
    "title": "\n                        India Calls for Global Crypto Regulatory Framework at G20\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/india-calls-for-global-crypto-regulatory-framework-at-g20",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">India has yet again called for a global approach to crypto regulation during its G20 presidency.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">During an interview with Business Today, the Prime Minister of India, Narendra Modi, again underscored the need for a global approach to regulating cryptocurrencies and digital assets.&nbsp;</p>\nIndia Maintains its View on a Global Crypto Regulatory Framework\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Ahead of this year&rsquo;s G20 summit, which will take place in Delhi on September 9 and 10, India, which holds this year&rsquo;s presidency, has again reiterated the need for unified crypto regulations. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">During the interview, PM Narendra Modi addressed emerging technologies such as cryptocurrencies and blockchain and noted that these technologies have a global impact. As such, PM Modi said regulating these technologies needs to take a global approach.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The PM noted that India is doing its part to contribute to the framework and said: </p>\n\n<p>&ldquo;India&rsquo;s G20 presidency expanded the crypto conversation beyond financial stability to consider its broader macroeconomic implications, especially for emerging markets and developing economies. Our presidency also hosted enriching seminars and discussions, deepening insights into crypto assets.&rdquo;&nbsp;</p>\n\nModi Supports Including African Union Into G20\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">PM Modi further said he supports the G20 being more inclusive and would favour adding the African Union into the G20 to make them part of the discussion around crypto regulation. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Modi said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;We haven&rsquo;t stopped at ideating on how we should move ahead. We have also come up with tangible details on the way ahead and how quickly we need to move. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">So, our road map is detailed and action-oriented.&rdquo;</p>\n\nIndia Aligns Its Views with the IMF, FSB, and FATF\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">India recently commented on what approach crypto regulation should take and firmly maintains that the G20 should implement coordinated crypto regulations. India&rsquo;s views align with those of the International Monetary Fund (IMF) and the Financial Stability Board (FSB).&nbsp;&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">On several previous occasions, Indian lawmakers and politicians suggested that global consensus is needed to tackle regulation.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T19:08:37.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T19:06:36.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T18:54:32.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T18:53:35.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T18:53:12.000Z",
    "title": "House Financial Services Committee leadership asks Fed to cease undermining stablecoin legislation",
    "url": "https://www.cryptopolitan.com/fed-asked-to-cease-stablecoin-legislation/",
    "description": "House Financial Services Committee leadership have addressed a letter to Jerome Powell, the Chair of the U.S. Federal Reserve, expressing strong criticism of the Fed&#8217;s recent moves on advancing legislation geared towards regulating stablecoins. Representative Patrick McHenry, who holds the position of Chairman of the House Financial Services Committee, has collaborated with French Hill, the ... <a title=\"House Financial Services Committee leadership asks Fed to cease undermining stablecoin legislation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fed-asked-to-cease-stablecoin-legislation/\" aria-label=\"More on House Financial Services Committee leadership asks Fed to cease undermining stablecoin legislation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T18:41:04.000Z",
    "title": "Leveraging Advanced Analytics for Swift Insider Threat Detection",
    "url": "https://www.cryptopolitan.com/analytics-for-swift-insider-threat-detection/",
    "description": "In the rapidly evolving landscape of cybersecurity, the spotlight is shifting towards an often underestimated threat—insider threats originating from within organizations. While external cyber threats often grab headlines, the rise of insider threats has become a significant concern. In 2023, the average cost of a data breach caused by an insider reached a staggering $4.90 ... <a title=\"Leveraging Advanced Analytics for Swift Insider Threat Detection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/analytics-for-swift-insider-threat-detection/\" aria-label=\"More on Leveraging Advanced Analytics for Swift Insider Threat Detection\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T19:00:36.000Z",
    "title": "Binance Will Halt These 39 Liquidity Mining Pools This Week",
    "url": "https://www.newsbtc.com/binance/binance-39-mining-pools/",
    "description": "On Sunday, Binance announced that it will halt 39 liquidity mining pools this week following the latest assessment. As a result of a supposed failure to pass this assessment, these 39 liquidity pools are expected to stop operating on September 1, 2023. Liquidity Pools Stopped By Binance This decision was made due to the platform&#8217;s recent liquidity mining performance. The announcement said Binance Liquid Swap will “periodically review listed liquidity pools to concentrate liquidity for our users and ensure optimized trading experience, price and slippage.” Related Reading: Friend.tech Activity Crashes 94%, Is This The End? As a result of the most recent review, the 39 liquidity pools listed below are expected to cease operation on Friday:  ADA/BNB, ALICE/BTC, APE/BTC, AVA/USDT, AVAX/BNB, BTC/TUSD, CHZ /BNB, CHZ/BTC, CTSI/BNB, DOT/BUSD, ENJ/USDT, FIL/BNB, FRONT/BUSD, GALA/BNB, ICP/BNB, ID /BTC, KDA/USDT, LIT/USDT, MATIC/BNB, NEO/BNB, PAXG/USDT, PEPE/USDT, SANTOS/USDT, SUSHI/BNB, SUSHI/BTC, SXP/BNB, SXP/BTC, THETA/BNB, THETA/BTC, TKO/USDT, TLM/USDT, TRX /BNB, TRX/ETH, WBTC/ETH, XMR/ETH, XMR/USDT, XVS/BTC, XVS/USDT, ZEN/USDT. For now, users will not be able to add liquidity to these liquidity pools from today. However, the liquidity of the liquidity pools listed above will still remain accessible to ensure that users are provided with a trading experience.  Users will also still be able to redeem and withdraw their assets from the respective pairs on Binance Spot before the closing date on September 1, 2023. User deposits in the liquidity pool will be calculated following the current composition of the respective pool and then it will be converted to the user&#8217;s Spot wallet automatically. According to the announcement, the removal of the liquidity pools listed above will not hinder other trading respective pairs on Binance Spot and users will still be able to trade on other liquidity pools that are currently available on Binance Liquid Swap. This marks the second time Binance has eliminated liquidity pools this month. On August 9, 2023, Binance also announced that the exchange would stop about 38 liquidity pools on August 18, 2023. BNB price remains above $215 support &#124; Source: BNBUSD on Tradingview.com  Multiple Charges Hinder Binance’s Business Amid these developments, the Binance crypto exchange continues to deal with regulatory pressures that seem to be affecting its business. Firstly, Visa and Mastercard are slowly cutting their ties with Balance due to the multiple regulatory actions from the US Securities and Exchange Commission (SEC) against the exchange. One of the allegations brought against Binance is that the exchange has been operating under an unregistered business and misled investors about the company&#8217;s risk. Related Reading: Shibarium Launch Proves Positive As Shiba Inu-Based BONE Celebrates New Milestone Also, the US Commodity Futures Trading Commission (CFTC) in May brought multiple charges against the exchange for what it calls a &#8220;willful evasion&#8221; of US law. Among the hurdles the exchange is also facing include allegations that the US Department of Justice is looking into the exchange and is considering charging Binance for fraudulent activities. On August 23, 2023, Binance announced on X (formerly Twitter),  that the exchange&#8217;s card known as the Binance Card will no longer be available to users in Latin America and the Middle East. Featured image from The Information, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T18:44:43.000Z",
    "title": "Stargate Deploys to Kava Chain Unifying Cosmos-Ethereum Liquidity",
    "url": "https://www.crypto-news-flash.com/stargate-deploys-to-kava-chain-unifying-cosmos-ethereum-liquidity/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Stargate_Press_Release_16932404823sTsCBJmGs.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Stargate_Press_Release_16932404823sTsCBJmGs.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Stargate_Press_Release_16932404823sTsCBJmGs-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Stargate_Press_Release_16932404823sTsCBJmGs-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Stargate_Press_Release_16932404823sTsCBJmGs-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Georgetown, Cayman Islands, August 28th, 2023, Chainwire Stargate, the leading omnichain liquidity layer, and native asset bridge with over $18 billion in lifetime transaction volume, has now deployed on Kava Chain, the Cosmos-Ethereum interoperable Layer 1. This integration will expand the reach of Tether’s Cosmos-native USDt issued exclusively on the Kava Chain, to the Ethereum [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-28T18:47:00.000Z",
    "title": "Tron’s +1M Active Addresses: Survey Finds 66.7% of Crypto Users Never Used It",
    "url": "https://coinedition.com/trons-1m-active-addresses-survey-finds-66-7-of-crypto-users-never-used-it/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Total_transfer_Value_on_TRON_has_surpassed_5_trillion_It_is_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tron’s +1M Active Addresses: Survey Finds 66.7% of Crypto Users Never Used It\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Total_transfer_Value_on_TRON_has_surpassed_5_trillion_It_is_the.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Total_transfer_Value_on_TRON_has_surpassed_5_trillion_It_is_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Total_transfer_Value_on_TRON_has_surpassed_5_trillion_It_is_the-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Total_transfer_Value_on_TRON_has_surpassed_5_trillion_It_is_the-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Total_transfer_Value_on_TRON_has_surpassed_5_trillion_It_is_the-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A DeFi researcher surveyed the crypto community on their recent activity on various blockchain networks. 42.8% of respondents reported using Ethereum transactions in the last seven days. However, Tron revealed that 66.7% of respondents had never used it. In a recent tweet, DeFi researcher Ignas posed thought-provoking questions to the crypto community. He inquired about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trons-1m-active-addresses-survey-finds-66-7-of-crypto-users-never-used-it/\">Tron’s +1M Active Addresses: Survey Finds 66.7% of Crypto Users Never Used It</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-28T18:45:35.000Z",
    "title": "Donald Trump’s NFTs Explode in Price After Former President’s Arrest in Atlanta",
    "url": "https://dailyhodl.com/2023/08/28/donald-trumps-nfts-explode-in-price-after-former-presidents-arrest-in-atlanta/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/NFTs-and-Digital-Collectibles.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former President Donald Trump&#8217;s non-fungible token (NFT) series has exploded in price since his arrest in Atlanta, Georgia. Trump turned himself in at the Fulton County jail on allegations that he attempted to conspire to overturn the results of the 2020 presidential election in Georgia. Upon his arrest and Trump posting his mugshot to his [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/28/donald-trumps-nfts-explode-in-price-after-former-presidents-arrest-in-atlanta/\">Donald Trump’s NFTs Explode in Price After Former President’s Arrest in Atlanta</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-28T18:41:24.000Z",
    "title": "Robinhood Revealed As Third Biggest Holder of Bitcoin With Massive $3,066,222,950 BTC Stash: Arkham Intelligence",
    "url": "https://dailyhodl.com/2023/08/28/robinhood-revealed-as-third-biggest-holder-of-bitcoin-with-massive-3066222950-btc-stash-arkham-intelligence/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/bitcoin-slumps-us-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Retail trading giant Robinhood has been identified as the third largest holder of Bitcoin by blockchain intelligence firm Arkham. Arkham, which &#8220;deanonymizes&#8221; blockchains by identifying and labeling addresses through on-chain analysis, has labeled the address beginning with &#8220;bc1ql&#8221; as &#8220;Robinhood: Jump Trading Custody.&#8221; Jump, a Chicago-based trading firm, has been providing crypto services to Robinhood [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/28/robinhood-revealed-as-third-biggest-holder-of-bitcoin-with-massive-3066222950-btc-stash-arkham-intelligence/\">Robinhood Revealed As Third Biggest Holder of Bitcoin With Massive $3,066,222,950 BTC Stash: Arkham Intelligence</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]