[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T19:15:00.000Z",
    "title": "Bitcoin price holds $26K as derivatives data hints at end of volatility spike",
    "url": "https://cointelegraph.com/news/bitcoin-price-holds-26k-as-derivatives-data-hints-at-end-of-volatility-spike",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a917eb24-30f9-49df-94ec-4bbd02aa0500.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC futures and options data show pro traders’ sentiment was not impacted despite last week's 11.4% correction.</p>\n                    <p><p>In the past few months, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) traders had grown used to less volatility, but historically, it's not uncommon for the cryptocurrency to see price swings of 10% in just 2 or 3 days. The recent 11.4% correction from $29,340 to $25,980 between August 15 and August 18, took many by surprise and led to the largest liquidation since the FTX collapse in November 2022. But the question remains: was this correction significant in terms of the market structure?</p><p>Certain experts point to reduced liquidity as the reason for the recent spikes in volatility, but is this truly the case?</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> BTC surged 70%+ in 2023, yet the &quot;Alameda gap&quot; - liquidity dip post FTX and Alameda Research collapse - remains, supported by low volatility.<br><br>Read full analysis here: <a href=\"https://t.co/kVslgLQtpL\">https://t.co/kVslgLQtpL</a> <a href=\"https://t.co/g8Ac7udBl7\">pic.twitter.com/g8Ac7udBl7</a></p>&mdash; Kaiko (@KaikoData) <a href=\"https://twitter.com/KaikoData/status/1692068747874373632?ref_src=twsrc%5Etfw\">August 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As indicated by the Kaiko Data chart, the decline of 2% in the Bitcoin order book depth has mirrored the decrease in volatility. It's possible that market makers adjusted their algorithms to align with the prevailing market conditions. </p><p>Hence, delving into the derivatives market to assess the impact of the drop to $26,000 seems reasonable. This examination aims to determine whether whales and market makers have become bearish or if they're demanding higher premiums for protective hedge positions.</p><p>To begin, traders should identify similar instances in the recent past, and two events stand out:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5fba3a88-3da3-4021-af5f-d3b58057cc82.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin/USD price index, 2023. Source: TradingView</em></figcaption></figure><p>The first decline took place from March 8 to March 10, causing Bitcoin to plummet by 11.4% to $19,600, marking its lowest point in over 7 weeks. This correction followed the <a href=\"https://cointelegraph.com/news/silvergate-capital-corporation-will-voluntarily-liquidate-silvergate-bank\">liquidation of Silvergate Bank</a>, a crucial operational partner for multiple cryptocurrency firms.</p><p>The subsequent significant movement occurred between April 19 and April 21, resulting in a 10.4% drop in Bitcoin's price. It revisited the $27,250 level for the first time in more than 3 weeks after Gary Gensler, the Chair of the U.S. Securities and Exchange Commission (SEC), addressed the House Financial Services Committee. <a href=\"https://cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security\">Gensler's statements provided little reassurance</a> that the agency's enforcement-driven regulatory efforts would cease.</p><h2>Not every 10% Bitcoin price crash is the same</h2><p>Bitcoin quarterly futures generally tend to trade with a slight premium when compared to spot markets. This reflects sellers' inclination to receive additional compensation in return for delaying the settlement. Healthy markets usually display BTC futures contracts being traded with an annualized premium ranging from 5% to 10%. This situation, termed \"contango,\" is not unique to the cryptocurrency domain.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bb5fe907-36f9-45e2-b1f0-1e9ecb71739c.png\"  /><figcaption style=\"text-align: center;\">Bitcoin 3-month futures premium, March/April 2023. Source: Laevitas.ch</figcaption></figure><p>Leading up to the crash on March 8, Bitcoin's futures premium was at 3.5%, indicating a moderate level of comfort. However, when Bitcoin's price dipped below $20,000, there was an intensified sense of pessimism, causing the indicator to shift to a discount of 3.5%. This phenomenon, referred to as \"backwardation,\" is typical of bearish market conditions.</p><p>Conversely, the correction on April 19 had minimal impact on Bitcoin's futures main metric, with the premium remaining around 3.5% as the BTC price revisited $27,250. This could imply that professional traders were either highly confident in the soundness of the market structure or were well-prepared for the 10.4% correction.</p><p>A comparison with the most recent event, the 11.4% BTC crash between August 15 and August 18, reveals distinct dissimilarities from previous instances. The starting point for Bitcoin's futures premium was higher, surpassing the 5% neutral threshold.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5ea790c6-7b5a-42a0-abdd-e6e581b217b2.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 3-month futures premium, August 2023. Source: Laevitas.ch</em></figcaption></figure><p>Notice how rapidly the derivatives market absorbed the shock on August 18. The BTC futures premium swiftly returned to a 6% neutral-to-bullish position. This suggests that the decline to $26,000 did not significantly dampen the optimism of whales and market makers regarding the cryptocurrency.</p><h2>Options markets confirm lack of bearish momentum</h2><p>Traders should also analyze options markets to understand whether the recent correction has caused pro traders to become more risk-averse. In short, if traders anticipate a Bitcoin price drop, the delta skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-today\">Why is the crypto market down today?</a></em></strong></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3b87e8ac-b81c-4c39-8b60-c249b553236b.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>Data indicate excessive demand for call (buy) BTC options ahead of the August 15 crash, with the indicator at -11%. This trend changed over the subsequent five days, though the metric remained within the neutral range and was unable to breach the 7% threshold.</p><p>Ultimately, both Bitcoin options and futures metrics reveal no signs of professional traders adopting a bearish stance. While this doesn't necessarily guarantee a swift return of BTC to the $29,000 support level, it does reduce the likelihood of an extended price correction.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T19:25:08.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T19:13:55.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T19:13:11.000Z",
    "title": "Ripple Joins Forces with BIS: Will XRP’s New Partnership Propel a Rally to $5? Report",
    "url": "https://www.crypto-news-flash.com/ripple-joins-forces-with-bis-will-xrps-new-partnership-propel-a-rally-to-5-report/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-joins-forces-with-bis-will-xrps-new-partnership-propel-a-rally-to-5-report",
    "description": "<img width=\"512\" height=\"279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71-300x163.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple is already working with several global central banks around the world to research and develop respective CBDCs. Crypto experts believe XRP price is preparing for a macro breakout towards new ATH after five-year consolidation. Ripple Labs, a leading blockchain payment company that taps on XRP to facilitate seamless cross-border transactions, has been one of [...]"
  }
]