[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T12:31:29.000Z",
    "title": "Blockchain Life 2024 will gather a record 8000 attendees in Dubai",
    "url": "https://www.cryptopolitan.com/blockchain-life-2024-will-gather-a-record-8000-attendees-in-dubai/",
    "description": "On April 15-16, Blockchain Life 2024 is going to prove its status as one of the main crypto events of the year bringing together over 8,000 crypto enthusiasts and thousands of international companies in the globally recognized crypto capital of Dubai. Learn more and buy a ticket: https://blockchain-life.com/asia/en/ The event unites top crypto players from [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T12:28:39.000Z",
    "title": "Palau’s XRPL CBDC pilot progresses, Ripple exec expresses support",
    "url": "https://www.cryptopolitan.com/palaus-xrpl-cbdc-pilot-progresses/",
    "description": "In a significant development for digital currency, the Republic of Palau has launched the second phase of its central bank digital currency (CBDC) pilot program, leveraging the Ripple XRP Ledger (XRPL). This move follows the successful completion of the first phase, marking a progressive step in the nation&#8217;s journey towards a robust digital economy. Palau [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T12:24:53.000Z",
    "title": "Nintendo Issues Takedown Notice for Link’s Awakening DX HD Fan Remake",
    "url": "https://www.cryptopolitan.com/nintendo-issues-takedown-notice-for-links/",
    "description": "In a move consistent with its staunch protection of intellectual property, Nintendo has issued a takedown notice for the fan-created project, Link’s Awakening DX HD. The reimagining, which boasted high-definition visuals, 120fps scrolling, widescreen support, and an expanded view of Koholint Island, has been targeted by the gaming giant for unauthorized use of its copyrights. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T12:14:42.000Z",
    "title": "Bereaved Chinese Father Uses AI to Digitally Resurrect Son",
    "url": "https://www.cryptopolitan.com/bereaved-father-uses-ai-to-resurrect-son/",
    "description": "AI technology is weaving a new narrative where people are able to commemorate their deceased loved ones in revolutionary ways. Death has long been a definitive curtain call that marks the end of our physical presence in the world, oftentimes leaving only the cherished memories confined to dusty photo albums or faded videotapes.&#160; AI is [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-16T12:22:00.000Z",
    "title": "XRP Loses Key Support Level as Holders Grow Frustrated",
    "url": "https://coinedition.com/xrp-loses-key-support-level-as-holders-grow-frustrated/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/XRP-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/XRP-1-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency analyst EGRAG CRYPTO revealed the results of a poll created on 13 December. In the poll, he asked his followers if they identify XRP’s current price levels as a blessing or if they are frustrated with the cryptocurrency’s price performance. In today’s post, he shared that 56.3% of the 3,000 voters are frustrated [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-loses-key-support-level-as-holders-grow-frustrated/\">XRP Loses Key Support Level as Holders Grow Frustrated</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]