[
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T01:55:23.000Z",
    "title": "Mastercard’s MTN network is groundbreaking, but crypto connection is unclear",
    "url": "https://cryptoslate.com/mastercards-mtn-network-is-groundbreaking-but-crypto-connection-is-unclear/",
    "description": "<p>Mastercard announced its Multi-Token Network (MTN) on June 28. The platform is specifically designed to handle transactions involving blockchain and digital assets, according to the company&#8217;s announcement. Blockchain and bank deposits are a focus Raj Dhamodharan, head of crypto and blockchain at Mastercard, wrote: &#8220;Our vision for MTN is to provide a set of foundational [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mastercards-mtn-network-is-groundbreaking-but-crypto-connection-is-unclear/\">Mastercard&#8217;s MTN network is groundbreaking, but crypto connection is unclear</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-30T01:59:20.000Z",
    "title": "Trump Family’s NFT Endeavors Continue with Melania’s ‘The 1776 Collection’",
    "url": "https://www.cryptoglobe.com/latest/2023/06/trump-familys-nft-endeavors-continue-with-melanias-the-1776-collection/",
    "description": "As Andrew Hayward reported for Decrypt on 29 June 2023, the Trump family is once again making waves in the NFT space. Per the Decrypt report, following former U.S. President Donald Trump’s release of his second set of NFT trading cards two months ago, Melania Trump, his wife, has now unveiled a new set of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T01:44:25.000Z",
    "title": "Will Luna Classic Reach $1 Courtesy of the Most Vibrant Communities in the Crypto Sphere?",
    "url": "https://www.cryptopolitan.com/will-luna-classic-reach-1/",
    "description": "The rollercoaster ride of Luna Classic (LUNC), the legacy token of the Terra ecosystem, has been a thrilling saga in the world of cryptocurrencies. From reaching its zenith at nearly $120 in April 2022 to experience a steep fall to well below $1 within a month, the journey of Luna Classic has been marked by ... <a title=\"Will Luna Classic Reach $1 Courtesy of the Most Vibrant Communities in the Crypto Sphere?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/will-luna-classic-reach-1/\" aria-label=\"More on Will Luna Classic Reach $1 Courtesy of the Most Vibrant Communities in the Crypto Sphere?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T02:00:32.000Z",
    "title": "Ethereum/Bitcoin Futures Ratio Launch Could Threaten ETH Price? Expert Forecasts",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-bitcoin-futures-ratio-launch-could-threaten-eth-price-expert-forecasts/",
    "description": "The two largest cryptocurrencies by market capitalization, Ethereum and Bitcoin, slowed down on their rally. Following a surge above critical resistance, the cryptocurrencies could retrace and return to critical support levels. Related Reading: Cardano Shows Signs of Recovery: When Will it Reach $0.30? As of this writing, Ethereum (ETH) trades at $1,840 with sideways movement in the last 24 hours. Over the past week, ETH has recorded a 2% loss except for Bitcoin (BTC) and Solana (SOL), the crypto top 10 by market cap trades in the red. Trouble Ahead For Ethereum? Earlier today, the Chicago Mercantile Exchange (CME) announced the launch of a new product. The platform will roll out an Ethereum (ETH/USD) to Bitcoin (BTC/USD) ratio futures contract. The financial product will follow the price of these cryptocurrencies and their correlation. In that way, traders can gain exposure to both cryptocurrencies by holding a single futures contract. According to an official announcement, The product aims to create more opportunities for traders in the nascent industry. However, in the short term, the CME launch hints at a potential downside for the two largest assets in the crypto market. CME Product Could Trigger This Effect In the past, whenever the CME rolled out a Bitcoin or Ethereum-based contract, the price of either asset trended to the downside. A pseudonym analyst forecasted issues for ETH and BTC, probably driven by a “buy the rumor, sell the news” effect. Via Twitter, the analyst stated, reacting to the news: If this has an effect similar to the $BTC &#38; $ETH futures back in the day then the release of this instrument could form a pivot for the ETH/BTC pair. Maybe more down into the release and then a reversal around the end of July? Let&#8217;s see. In response to the forecast, another analyst stated that a “buy the rumor, sell the news effect” will cause ETH’s price to rally into the event. Therefore, ETH could profit as the CME prepares to roll out their new contracts and anticipation around the spot Bitcoin Exchange Traded Funds (ETFs) applications continues. Related Reading: Bitcoin Bulls Battle Against Miners’ $128 Million Move: Is The Bull Run In Danger? The analyst stated: Wouldn&#8217;t make more sense a buy the rumor, sell the news event? So we pump before end of July Everything is exhausted right now. If BTC pumps through resistance, maybe ETH could catch up. Cover image from Unsplash, chart from Tradingview"
  }
]