[
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T01:13:43.000Z",
    "title": " FTX’s $400M hack linked to SIM swap attack, feds charge 3 ",
    "url": "https://cointelegraph.com/news/crypto-exchange-ftx-400m-hack-sim-swap-attack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzQ2YTc1ODktNmJlMy00ZjFmLWFhMTYtYjRkMDY0ZTkyMDJmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto exchange FTX was hacked for over $400 million just hours after filing for bankruptcy in 2022. Many initially believed it was an inside job.</p>\n                    <p><p>The $400 million hack of FTX in the hours after its bankruptcy has been linked to three people charged last month by United States prosecutors, alleging they conducted a series of SIM swap attacks that netted them cryptocurrency. </p><p>A Jan. 24 <a href=\"https://www.courtlistener.com/docket/68192231/1/united-states-v-powell/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> in a Washington, D.C. District Court U.S. federal prosecutors charged Robert Powell, Carter Rohn and Emily Hernandez with carrying out SIM swap attacks by stealing the identities of 50 victims and convincing telecom providers to port victims numbers to the trio’s phones.</p><p>A part of the filing details an attack on “Victim Company-1” — where on Nov. 11 and 12, 2022, Hernandez allegedly impersonated an employee at the company and Powell then gained access to their AT&amp;T account, accessed company accounts and “transferred over $400 million in virtual currency” out of the crypto wallets.</p><p><a href=\"https://cointelegraph.com/news/crypto-exchange-ftx-400m-hack-sim-swap-attack\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-02T01:29:00.000Z",
    "title": "XRP Price Falls out of 3-Year Trading Range Following 213 Million Token Theft From Ripple Chairman",
    "url": "https://www.cryptoglobe.com/latest/2024/02/xrp-price-falls-out-of-3-year-trading-range-following-213-million-token-theft-from-ripple-chairman/",
    "description": "The price of the native token of the XRP Ledger, XRP, has dropped down of a three-year consolidation pattern, signaling a potential turning point for investors, after a significant period in which its price oscillated between well-defined trading levels. According to a recent post on the microblogging platform X (formerly known as Twitter) from cryptocurrency […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-02T01:14:05.000Z",
    "title": "Wombat Exchange Releases First Single-Sided Volatile Pool AMM in DeFi",
    "url": "https://cryptodaily.co.uk/2024/02/wombat-exchange-releases-first-single-sided-volatile-pool-amm-in-defi",
    "description": "Wombat Exchange Releases First Single-Sided Volatile Pool AMM in DeFi"
  }
]