[
  {
    "source": "Decrypt",
    "date": "2023-06-08T12:01:02.000Z",
    "title": "Apple Vision Pro vs. Meta Quest Pro: What's the Difference?",
    "url": "https://decrypt.co/143783/apple-vision-pro-vs-meta-quest-pro-whats-difference",
    "description": "It’s the battle of Pro headsets from tech giants. How does Apple’s first effort compare to the market leader’s top-end device?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T11:57:56.000Z",
    "title": "Crypto ads face stricter rules including a referral bonus ban by FCA",
    "url": "https://cointelegraph.com/news/crypto-ads-face-stricter-rules-including-a-referral-bonus-ban-by-fca",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f69241f2-8f6d-40c1-8270-73d836e913e4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto services in the U.K. will face stricter regulations, including a \"cooling-off period\" for first-time investors and a ban on \"refer a friend\" bonuses. </p>\n                    <p><p>The Financial Conduct Authority (FCA) announced today June 8, that starting from October 8, advertisers of crypto services in the United Kingdom will be subjected to stricter regulations.</p><p>The U.K. watchdog has mandated that crypto companies in the U.K. implement a \"cooling-off period\" for first-time investors. Additionally, as part of measures to enhance investor awareness of risks, the FCA has prohibited the use of \"refer a friend\" bonuses by firms in the sector.</p><p>Sheldon Mills, Executive Director of Consumers and Competition, stated in the written statement that while the decision to purchase crypto lies with individuals, research indicates that many express regret over impulsive choices. The implemented rules aim to provide people with sufficient time and appropriate risk warnings to enable an informed decision-making process.</p><p>In the statement, Mills added: </p><blockquote>“The crypto industry needs to prepare now for this significant change. We are working on additional guidance to help them meet our expectations.”</blockquote><p>Under the new regulations, crypto companies are obligated to verify that individuals possess the necessary knowledge and experience to engage in crypto investments. Furthermore, those involved in promoting cryptocurrencies must provide transparent risk warnings and ensure that their advertisements are fair, clear and devoid of any misleading information. </p><p>These rules from the FCA align with government legislation aimed at subjecting crypto promotions to regulatory oversight.</p><p>Against the backdrop of an intense regulatory crackdown in the United States, marked by the U.S. Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments#:~:text=Professionals%20across%20the%20crypto%20sector,for%20allegedly%20offering%20unregistered%20securities.\">filing lawsuits against Binance and Coinbase,</a> the recent development underscores the ongoing scrutiny faced by the crypto industry.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-could-threaten-humanity-in-two-years-says-uk-advisor\"><strong><em>AI could threaten humanity in 2 years, warns UK AI task force adviser</em></strong></a></p><p>In August 2022, the FCA <a href=\"https://cointelegraph.com/news/fca-cracks-down-on-the-ads-of-high-risk-assets-but-not-crypto\">implemented more stringent regulations</a> to address deceptive advertisements concerning high-risk investment products. However, these measures did not encompass cryptocurrencies, as the regulator was awaiting government confirmation to extend its oversight to crypto products.</p><p>In its recent announcement, the FCA stated that the actions taken to address crypto advertisements align with the restrictions implemented last year for promoting high-risk investments. Additionally, the FCA is seeking feedback on additional guidelines outlining obligations for crypto advertisers. Interested parties have until August 10 to provide their input during the consultation process.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\"><strong><em>Home loans using crypto as collateral: Do the risks outweigh the reward?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T11:55:00.000Z",
    "title": "Cosmos-based DeFi lending protocol Nolus joins Cointelegraph Accelerator",
    "url": "https://cointelegraph.com/news/cosmos-based-defi-lending-protocol-nolus-joins-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/f3c62a2cd09948c72578cc3119d0e940.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Nolus’ DeFi lending protocol aims to onboard more people by solving collateralization inefficiencies.</p>\n                    <p><p>Crypto lending has become an essential part of <a href=\"https://cointelegraph.com/learn/how-to-get-started-in-defi-a-guide-on-the-first-steps-in-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/how-to-get-started-in-defi-a-guide-on-the-first-steps-in-decentralized-finance/amp\">decentralized finance (DeFi)</a>, allowing people to lend and borrow digital assets via specifically designed protocols. With <a href=\"https://cointelegraph.com/news/what-is-crypto-lending-and-how-does-it-work\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-is-crypto-lending-and-how-does-it-work/amp\">crypto lending</a>, users can lock their crypto assets as collateral and then borrow a fiat or stablecoin loan. Instead of traditional intermediaries, like banks and credit unions, DeFi lending protocols operate directly on a blockchain. Smart contracts facilitate each loan or borrowing, and on-chain supply and demand decide the interest rates.</p><p>Reports expect a <a href=\"https://cointelegraph.com/news/nft-market-worth-231b-by-2030-report-projects-big-growth-for-sector\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nft-market-worth-231b-by-2030-report-projects-big-growth-for-sector/amp\">$231 billion DeFi market</a> by 2030, with lending protocols being a key element driving the growth. According to a CoinGecko <a href=\"https://www.coingecko.com/research/publications/defi-categories-market-share\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">research report</a>, lending has more than an 11% market share in the DeFi ecosystem, and it stands as one of the five biggest DeFi sectors. Users flock to DeFi lending protocols to avoid directly selling their crypto holdings, which they expect to increase in value.</p><p><img alt=\"DeFi categories’ shares by market cap of tokens. Source: CoinGecko\" src=\"https://s3.cointelegraph.com/storage/uploads/view/b38994e374c33542b78b175756afdb26.png\" title=\"DeFi categories’ shares by market cap of tokens. Source: CoinGecko\"></p><p style=\"text-align: center;\"><em>DeFi categories’ shares by market cap of tokens. Source: <a href=\"http://coingecko.com/research/publications/defi-categories-market-share\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">CoinGecko</a></em></p><p>Despite its growth potential, several factors limit the usability of crypto lending. Primarily, users need to lock up more value in crypto as collateral than what they aim to borrow. This is a common practice, both for centralized and decentralized lenders, to avoid risks related to the liquidation of funds due to sudden drops in collateralized tokens’ value. Platforms tend to provide financing up to 50% to 60% of any deposited collateral.</p><p>The complexity of the lending process is another deterrent for the majority of Web3 users, as DeFi lending solutions need a technical understanding that may confuse even experienced traders.</p><p>After securing $2.5 million in <a href=\"https://cointelegraph.com/press-releases/cosmos-based-defi-protocol-nolus-raises-25m-to-build-the-first-cross-chain-defi-lease\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/press-releases/cosmos-based-defi-protocol-nolus-raises-25m-to-build-the-first-cross-chain-defi-lease/amp\">pre-seed and seed funding</a>, Cosmos-based DeFi protocol <a href=\"https://nolus.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Nolus</a> joined the <a href=\"https://cointelegraph.com/news/cointelegraphs-accelerator-program-launches-and-is-seeking-web3-startups\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cointelegraphs-accelerator-program-launches-and-is-seeking-web3-startups/amp\">Cointelegraph Accelerator</a> program with the goal of making crypto lending available for the average user. Nolus Protocol recently introduced DeFi Lease to address the inefficiencies in the current DeFi lending landscape.</p><p>DeFi Lease provides users financing up to 150% on the initial investment — almost threefold the average crypto lenders’ offer — while leaving the asset ownership with the user. It also keeps the total cost of financing and transactions lower than the market average to help Web3 users secure a larger amount of a desired digital asset than their current equity balance without worrying about technical formulas or complex lending fee structures.</p><div class=\"embed-responsive embed-responsive-16by9\"><center><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/k7QWPR0052g\" width=\"560\"></iframe></p></center></div><p>Aside from DeFi Lease, Nolus operates as a noncustodial financial suite for Web3 that allows users to manage all digital assets and purchase, sell, swap or stake their crypto. In May, Nolus successfully launched its mainnet and expects a fully working protocol live next week.</p><p>The Cointelegraph Accelerator program <a href=\"https://cointelegraph.com/news/cointelegraphs-accelerator-program-launches-and-is-seeking-web3-startups\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cointelegraphs-accelerator-program-launches-and-is-seeking-web3-startups/amp\">took off in 2023</a> to provide Web3 projects assistance in reaching their true potential. By joining the program, Nolus will have the opportunity to present to the broader Web3 ecosystem its innovative approach to crypto lending, attracting users from other blockchains and wallets to its Cosmos-based chain to interact with its DeFi protocol through a simple interface. As a participant in the Cointelegraph Accelerator program, Nolus aims to become the one-stop shop to park all crypto transactions for Web3 users.</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T11:45:32.000Z",
    "title": "Solana leads top-ten losses while BTC maintains $26k: CryptoSlate wMarket Update",
    "url": "https://cryptoslate.com/solana-leads-top-ten-losses-while-btc-maintains-26k-cryptoslate-wmarket-update/",
    "description": "<p>The cryptocurrency market saw mild net outflows of $0.31 billion over the last 24 hours and currently stands at $1.1 trillion — down 0.94 % from $1.11 trillion. During the reporting period, the market caps of Bitcoin (BTC) and Ethereum (ETH) fell 0.69% and 0.88% to $513.31 billion and $221.79 billion, respectively. The top 10 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/solana-leads-top-ten-losses-while-btc-maintains-26k-cryptoslate-wmarket-update/\">Solana leads top-ten losses while BTC maintains $26k: CryptoSlate wMarket Update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T11:55:00.000Z",
    "title": "Mark Cuban Slams SEC Crackdown And Lack Of Support For Companies",
    "url": "https://cryptodaily.co.uk/2023/06/mark-cuban-slams-sec-crackdown-and-lack-of-support-for-companies",
    "description": "<p>Outspoken billionaire investor and entrepreneur Mark Cuban has launched a scathing attack on the SEC and its handling of complaints against cryptocurrency exchanges, especially Coinbase.&nbsp;</p>\n<p>Cuban was highly critical of the lack of support for companies actively looking to comply with securities regulations in the country.&nbsp;</p>\nCuban Frustrated With SEC Approach&nbsp;\n<p>Billionaire Mark Cuban has long advocated for cryptocurrencies and recently expressed his frustration with the United States Securities and Exchange Commission (SEC) and its approach to crypto. Cuban stated that the Securities and Exchange Commission could have adopted a much clearer approach for compliance, and avoided legal disputes altogether. Cuban tweeted,&nbsp;</p>\n\n<p>&ldquo;The SEC could have easily have gone to them and outlined an exact plan to get them to compliance. Then if @coinbase or whoever didn&rsquo;t comply, they sue over whatever legal disagreements they have. Instead, they do what they told one of my companies to do when we called, read these cases and get a lawyer to figure it out for you.&rdquo;</p>\n\nSEC Only Wants To Litigate&nbsp;\n<p>Cuban also stated that the SEC is full of lawyers, and all lawyers want to do is litigate. He added that there would be greater compliance if there were more business people within the SEC.&nbsp;</p>\n<p>&ldquo;They are full of lawyers. Lawyers want to litigate. If you had business people, more like the SBA, there would be more compliance, fewer lawsuits, and better investor education and protections. But if that happened, 2k SEC lawyers would be out of a job.&rdquo;</p>\n<p>The billionaire also suggested that the SEC promotes the cases and wins as metrics instead of keeping track of the number of companies that they help reach compliance.&nbsp;</p>\nNo One Trusts The SEC&nbsp;\n<p>Cuban further argued that the SEC&rsquo;s approach was fermenting a climate of fear and mistrust, leading to companies fearing to engage with the regulator because they are afraid of potential legal ramifications. This would make it harder for companies to achieve compliance, going against the SEC&rsquo;s mandate of protecting investors and maintaining efficient markets.&nbsp;</p>\n\n<p>&ldquo;As it is, no one wants to talk to the SEC because no one trusts them for fear of being in the same situation as Coinbase finds itself. You get what you measure.&rdquo;</p>\n\nRepercussions Of The SEC Crackdown&nbsp;\n<p>The lawsuit against Coinbase came just after a similar complaint was filed against Binance and its CEO, Changpeng Zhao. The crackdown reflects an increasingly hostile regulatory environment for crypto companies in the United States. It has also led to a number of trading pairs being delisted from Binance.US. The SEC has been going after crypto companies following the collapse of FTX under the pretext of protecting consumers.&nbsp;</p>\nCoinbase Pushes Back&nbsp;\n<p>Coinbase has also pushed back against the SEC and has demanded clearer guidance from the chief financial regulator. Brian Armstrong, CEO of Coinbase, stated that the agency needs to clearly define what constitutes a security, leading to greater uncertainty and potentially hindering innovation in the crypto space. The SEC has stated that everything other than Bitcoin is a security. However, Armstrong has contended that the law says differently and that regulators around the globe are taking a different position than that of the SEC. Armstrong stated in an interview that Coinbase also met with the SEC,&nbsp;</p>\n\n<p>&ldquo;We met with the SEC 30 times in the last year. They never gave us a single piece of feedback about what we could be doing better. We just got silence.&rdquo;</p>\n\n<p>The US Court of Appeals for the Third Circuit has ordered the SEC to respond within a week. The SEC had sued Coinbase for allegedly acting as an unregistered broker, as it goes after some of the biggest names in crypto over alleged violations of US securities laws.&nbsp;</p>\n\n<p>&ldquo;Since at least 2019, Coinbase has made billions of dollars unlawfully facilitating the buying and selling of crypto asset securities. Coinbase intertwines the traditional services of an exchange, broker, and clearing agency without having registered any of those functions with the Commission as required by law.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T12:06:22.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T12:01:10.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $18.74 with a 24-hour trading volume of $130,897,839. Solana is down 5.51% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T11:53:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 After a long torrid wave in the cryptocurrency market, most digital coins are beginning to tread the path of recovery &#8211; just as predicted by analysts. BNB, in particular, has made gains of about 30% since the start of January 2023. What does the future hold for Binance Coin? How ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T12:02:30.000Z",
    "title": "Bridging the crypto divide: regulation and AI discussed at Money20/20",
    "url": "https://crypto.news/bridging-the-crypto-divide-regulation-and-ai-discussed-at-money20-20/",
    "description": "In an era marked by rapid digitalization, Tales From the Crypto, a panel at the Money20/20 event held today, offered deep insights into the emerging trends of crypto investments and the regulatory landscape. Steve McNew of FTI Consulting helmed the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T12:00:00.000Z",
    "title": "Fundamental analysis: unpacking the potential of InQubeta and Cardano",
    "url": "https://crypto.news/fundamental-analysis-unpacking-the-potential-of-inqubeta-and-cardano/",
    "description": "This article unpacks the potential of InQubeta and Cardano and how they each use blockchain technology"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T11:53:32.000Z",
    "title": "Steve McNew delves into crypto and NFT security at Money20/20",
    "url": "https://crypto.news/steve-mcnew-delves-into-crypto-and-nft-security-at-money20-20/",
    "description": "Steve McNew, a globally recognized blockchain and digital asset investigator, offers a rare glimpse into the twisted maze of crypto fraud and disputes at Money20/20, the world&#8217;s most prominent fintech event. Cryptocurrencies have always been shrouded in an air of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T11:43:27.000Z",
    "title": "SEC’s Gensler offered to advise Binance in 2019, lawyers claim",
    "url": "https://crypto.news/secs-gensler-offered-to-advise-binance-in-2019-lawyers-claim/",
    "description": "In a surprising twist to the ongoing regulatory battle between the Securities and Exchange Commission (SEC) and Binance, lawyers for the crypto exchange have alleged that SEC Chair Gary Gensler offered to serve as an advisor to Binance&#8217;s parent company&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T11:58:55.000Z",
    "title": "AlgoKit v1.1 and AlgoBuilders Program Inject Optimism Amid ALGO’s 52-Week Low",
    "url": "https://coinedition.com/algokit-v1-1-and-algobuilders-program-inject-optimism-amid-algos-52-week-low/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ALGO_Hits_52_Week_Low_AlgoKit_v1_1_and_AlgoBuilders_Program_Aim-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ALGO_Hits_52_Week_Low_AlgoKit_v1_1_and_AlgoBuilders_Program_Aim-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/ALGO_Hits_52_Week_Low_AlgoKit_v1_1_and_AlgoBuilders_Program_Aim-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ALGO_Hits_52_Week_Low_AlgoKit_v1_1_and_AlgoBuilders_Program_Aim.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The recent release of AlgoKit v1.1 yesterday, accompanied by the exciting announcement of the AlgoBuilders program, hopes to bring a wave of positive impact to the Algorand (ALGO) market. This significant update introduces typed client generation, empowering developers with enhanced capabilities in Python and TypeScript, leading to improved efficiency and streamlined development processes. With the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/algokit-v1-1-and-algobuilders-program-inject-optimism-amid-algos-52-week-low/\">AlgoKit v1.1 and AlgoBuilders Program Inject Optimism Amid ALGO&#8217;s 52-Week Low</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T11:45:49.000Z",
    "title": "$1,280,000,000 in Crypto Yanked Out of Coinbase Amid SEC Lawsuit Against the US Exchange: On-Chain Data",
    "url": "https://dailyhodl.com/2023/06/08/1280000000-in-crypto-yanked-out-of-coinbase-amid-sec-lawsuit-against-the-us-exchange-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/crypto-yanked-us-on.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain data and research firm Nansen says that hundreds of millions of dollars exited the Coinbase group in the wake of a lawsuit filed by the U.S. Securities and Exchange Commission (SEC). According to Nansen, Coinbase and the exchange’s custodial arm recorded negative netflows, the sum of deposits and withdrawals, of approximately $1.28 billion after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/1280000000-in-crypto-yanked-out-of-coinbase-amid-sec-lawsuit-against-the-us-exchange-on-chain-data/\">$1,280,000,000 in Crypto Yanked Out of Coinbase Amid SEC Lawsuit Against the US Exchange: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]