[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T08:13:33.000Z",
    "title": "U.S. Criminal Charges Against Sam Bankman-Fried Don’t Warrant Dismissal, Prosecutors Say",
    "url": "https://www.coindesk.com/policy/2023/05/30/us-criminal-charges-against-sam-bankman-fried-dont-warrant-dismissal-prosecutors-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lawyers for the disgraced exchange executive filed pre-trial motions in early May to dismiss most of the charges on technicalities or procedural issues."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T08:14:36.000Z",
    "title": "FTX Founder’s Legal Battle: Prosecutors Stand Firm as Dismissal Pleas Denied",
    "url": "https://www.cryptopolitan.com/ftx-founders-prosecutors-pleas-denied/",
    "description": "In a Manhattan federal court, prosecutors have strongly advised U.S. District Judge Lewis Kaplan to deny the request made by Sam Bankman-Fried, the founder of FTX, to dismiss criminal charges brought against him. Bankman-Fried, a 31-year-old former cryptocurrency billionaire, stands accused of stealing billions of dollars from customers to offset losses incurred by his hedge ... <a title=\"FTX Founder&#8217;s Legal Battle: Prosecutors Stand Firm as Dismissal Pleas Denied\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-founders-prosecutors-pleas-denied/\" aria-label=\"More on FTX Founder&#8217;s Legal Battle: Prosecutors Stand Firm as Dismissal Pleas Denied\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T08:35:17.000Z",
    "title": "10 best crypto gambling sites to check out in 2023: online bitcoin gambling guide",
    "url": "https://crypto.news/10-best-crypto-gambling-sites-to-check-out-in-2023-online-bitcoin-gambling-guide/",
    "description": "If your gambling checklist consists of large game libraries, bonuses, and instant payouts, then you’re in for a treat at the best crypto gambling sites"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T08:13:30.000Z",
    "title": "Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score",
    "url": "https://www.newsbtc.com/news/pepecoin-drops-to-critical-level/",
    "description": "Pepecoin (PEPE) has recently experienced a significant development as it hits a crucial bullish order block (OB), raising hopes for a potential recovery opportunity. However, the ability to reverse the prevailing downtrend momentum is contingent upon an essential factor that holds the key to the coin&#8217;s future trajectory.  In a market characterized by uncertainty, investors and enthusiasts eagerly await the resolution of this pivotal element to determine whether Pepecoin can regain its lost momentum and chart a new course. Related Reading: Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot? Evaluating Pepecoin Price Potential For A Reversal Since May 24, Pepecoin (PEPE) has exhibited a positive response to the bullish OB. This encouraging price action implies a significant influx of buyers at this level, indicating that the bullish OB could serve as a crucial demand zone capable of triggering a potential price U-turn, especially if Bitcoin makes it past the key $28,000 region.  Nevertheless, PEPE&#8217;s price movement currently faces constraints from both ends. On one side, there is the trendline resistance, while on the other side, the bullish OB acts as a limiting factor. Crypto total market cap unchanged at $1.12 trillion. Chart: TradingView.com Should the bullish sentiment persist and bulls manage to overcome the resistance posed by the trendline, PEPE could endeavor to rally towards the 50% Fibonacci level, which stands at $0.00000160.  PEPE currently finds itself in the grips of a challenging market environment, with its CoinGecko price at a meager $0.00000136. The past 24 hours have witnessed a slight slump of 6.5%, further exacerbating the coin&#8217;s struggles, while the seven-day period has seen a significant decline of 13.6%. Source: Coingecko Understanding PEPE&#8217;s Volatility And Intrinsic Value Pepecoin (PEPE) has consistently exhibited an incredibly volatile movement, a characteristic that is not entirely unexpected. As a cryptocurrency, PEPE falls within the broader category known for its highly volatile nature. However, PEPE&#8217;s status as a meme coin adds an additional layer of complexity to its price fluctuations, as it lacks intrinsic value. In the early stages, PEPE experienced a continuous upward price movement, drawing attention and interest from investors seeking quick gains. However, experts in the field have long predicted that, eventually, PEPE&#8217;s price would spiral downwards. Regrettably, the current situation seems to align with these projections. Impressive DEXT Score For Pepecoin Meanwhile, Pepecoin enjoys an impressive DEXT Score of 99/99 and high liquidity, which is a positive sign for the meme coin. DEXTools&#8217; DEXT Score is an algorithm that takes into account data from the blockchain as well as other sources to determine the reliability of a given project. The higher the score, the better for the crypto. Social data, pair liquidity, transaction volume, token circulation, and contract creation are just some of the metrics that make up the DEXT Score. Source: DEXTools Meme coins, like PEPE, often rely heavily on social media trends, community enthusiasm, and speculative trading. Without a solid foundation of intrinsic value or underlying assets, their prices are particularly vulnerable to sudden shifts in sentiment and market dynamics.  As a result, investors must approach meme coins like PEPE with caution and a thorough understanding of the inherent risks involved. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) -Featured image from Science &#38; Faith"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T08:33:34.000Z",
    "title": "JPMorgan: Institutional Investors to Sell $3 Trillion of Gold to Push Bitcoin Price to $45,000 by Year’s End",
    "url": "https://www.crypto-news-flash.com/jpmorgan-institutional-investors-to-sell-3-trillion-of-gold-to-push-bitcoin-price-to-45000-by-years-end/?utm_source=rss&utm_medium=rss&utm_campaign=jpmorgan-institutional-investors-to-sell-3-trillion-of-gold-to-push-bitcoin-price-to-45000-by-years-end",
    "description": "<p>JPMorgan analysts believe that if Bitcoin starts resembling the investment structure of gold, its price could potentially reach $45,000, representing a surge of 75 percent from current levels. JPMorgan strategists also anticipate the upcoming Bitcoin halving event in mid-2024 to act as a catalyst for driving BTC prices higher in the future. Being one of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/jpmorgan-institutional-investors-to-sell-3-trillion-of-gold-to-push-bitcoin-price-to-45000-by-years-end/\">JPMorgan: Institutional Investors to Sell $3 Trillion of Gold to Push Bitcoin Price to $45,000 by Year&#8217;s End</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T08:30:00.000Z",
    "title": "CFX, DOT, FIL, HT, and OKB May Surge as Chinese Regulation Changes",
    "url": "https://coinedition.com/cfx-dot-fil-ht-and-okb-may-surge-as-chinese-regulation-changes/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Top-5-China-Altcoins-June-2023-NEW-REPORT-LEAKED.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A crypto trader and analyst Luke Martin shared his top altcoin picks in a recent YouTube video. This video follows the release of a regulatory whitepaper compiled by the Chinese Government. The key point mentioned in the regulatory paper is that Hong Kong will allow retail traders to buy and sell Bitcoin (BTC) and other [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cfx-dot-fil-ht-and-okb-may-surge-as-chinese-regulation-changes/\">CFX, DOT, FIL, HT, and OKB May Surge as Chinese Regulation Changes</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]