[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T16:30:11.000Z",
    "title": "Elon Musk’s Twitter Overhaul Could Be Huge for DOGE and Crypto Generally",
    "url": "https://www.coindesk.com/business/2023/07/25/elon-musks-twitter-overhaul-could-be-huge-for-doge-and-crypto-generally/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“Elon clearly has an affinity for DOGE, almost as part of a running joke, but I wouldn’t be surprised if he actually went through with enabling payments via DOGE.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T16:12:01.000Z",
    "title": "Abu Dhabi regulator grants trading firm Rain permission to offer crypto services",
    "url": "https://cointelegraph.com/news/abu-dhabi-regulator-grants-rain-permission-offer-crypto-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/38843e7f-4757-4508-9c02-a954c2e1d722.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The announcement followed crypto exchange Binance receiving similar permission from the Abu Dhabi regulator in November 2022.</p>\n                    <p><p>The Abu Dhabi Global Market Financial Services Regulatory Authority has granted its Financial Services Permission for cryptocurrency firm Rain to offer brokerage and custody services to residents. </p><p>In a July 25 announcement, Rain <a href=\"https://twitter.com/rain/status/1683762713078423553\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the regulatory approval will allow certain United Arab Emirates-based institutional and retail users to “buy, sell, trade, and store virtual assets” through the platform. According to Rain CEO Joseph Dallago, the trading firm has also <a href=\"https://twitter.com/_jayd3e/status/1683774860961497090\" target=\"_blank\" rel=\"noopener nofollow\">partnered</a> with a local bank to facilitate services, under the “supervision of a local regulator and thorough legal framework” for user protection.</p><p>“This is a 5 year effort, as we were one of the first exchanges to enquire about licensure back in 2018, when the ADGM released their virtual asset framework,” said Dallago.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Rain Trading Limited (Rain ADGM) has been granted the first Financial Services Permission (FSP) by Abu Dhabi Global Market’s Financial Services Regulatory Authority to operate a virtual assets brokerage and custody service. <a href=\"https://t.co/EyxCj4HbNy\">pic.twitter.com/EyxCj4HbNy</a></p>&mdash; Rain (@rain) <a href=\"https://twitter.com/rain/status/1683762713078423553?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uae-emerges-as-a-pro-bitcoin-mining-destination-in-the-middle-east\"><strong><em>UAE emerges as a pro-Bitcoin mining destination in the Middle East</em></strong></a></p><p>In November 2022, crypto exchange Binance <a href=\"https://cointelegraph.com/news/abu-dhabi-grants-binance-financial-services-permission-economist-hits-out\">received similar regulatory permission</a> in Abu Dhabi following being <a href=\"https://cointelegraph.com/news/binance-receives-in-principle-approval-to-operate-in-abu-dhabi\">granted in-principle approval</a> from the financial watchdog in April. The green light came amid a major crypto market crash and the collapse of several major firms including FTX. CEO Changpeng Zhao had been attending Abu Dhabi Finance Week at the time of approval.</p><p>According to Rain’s website, the platform focuses primarily on offering crypto services across the Middle East and Turkey, with its headquarters in Bahrain. Though the Abu Dhabi Global Market Financial Services Regulatory Authority has issued approvals to both Rain and Binance, Dubai’s Virtual Assets Regulatory Authority <a href=\"https://cointelegraph.com/news/3ac-founders-run-into-fresh-trouble-in-dubai-over-new-exchange-opnx\">issued notices to executives</a> of digital asset platform Open Exchange in May and <a href=\"https://cointelegraph.com/news/dubai-vara-suspends-bitoasis-exchange-license\">suspended BitOasis’ license</a> in July.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-dubai/\"><strong><em>Crypto City: Guide to Dubai</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T16:17:36.000Z",
    "title": "Xandeum, the L1 with Scalable Storage Layer, Announces Grand Launch on July 30",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xandeum-the-l1-with-scalable-storage-layer-announces-grand-launch-on-july-30/",
    "description": "Las Vegas, Nevada, July 25th, 2023, Chainwire Xandeum, a trailblazing blockchain startup committed to accelerating humanity’s transition to decentralized control, announces its highly anticipated launch on July 30, 2023, at 11:00 am PT. Leveraging the power of blockchain technology, Xandeum’s mission is to empower collective self-determination by creating a scalable, blockchain-based storage layer for smart […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T16:30:00.000Z",
    "title": "CyberKongz Will Mint New Genkai NFTs on Ronin, New Game Is in Development",
    "url": "https://cryptodaily.co.uk/2023/07/cyberkongz-will-mint-new-genkai-nfts-on-ronin-new-game-is-in-development",
    "description": "<p>CyberKongz partners with Axie Infinity&rsquo;s creator Sky Mavis to migrate its existing Play and Kollect NFT game and mint the new Genkai NFT collection on the Ronin chain.</p>\nNew Genkai NFT Collection and Game to Be Launched on Ronin\n<p>According to the press release of July 25, Sky Mavis, creator of the popular crypto game Axie Infinity, starts its new partnership with a growing NFT franchise CyberKongz.&nbsp;</p>\n<p>CyberKongz will mint a part of its new anime-inspired NFT collection called Genkai on Sky Mavis&rsquo; Ronin chain. The Genkai mint will take place on July 27 at 12pm EST, with 4,000 made available on Ronin&rsquo;s Mavis Market and the other 16,000 NFTs minted on the Ethereum Mainnet. The Ethereum NFT holders will have the option to move their tokens to Ronin in the future. The price for Genkai NFTs on the Ethereum blockchain is expected to be 0.25 ETH (about $460) per token.&nbsp;</p>\n<p>The NFT creators have also confirmed that they&rsquo;ll join forces with Ronin to develop a new game featuring Genkai, although no further details have been announced so far.&nbsp;</p>\n\n<p>&ldquo;Genkai is the first non-pixel artwork I have created for CyberKongz and will represent our growth as a project to expand our IP into the Southeast Asian and Japanese markets. Additionally, CyberKongz will be working with Ronin to develop a game featuring Genkai. This ambitious venture will seek to alter the paradigm of web3 IP in a gamified manner.&rdquo; &ndash; shared CyberKongz founder and artist, Myoo.&nbsp;</p>\n\n<p>Besides, it&rsquo;s been reported that the CyberKongz&rsquo; existing NFT minting game called Play and Kollect will be migrated from the Polygon blockchain to Ronin. However, the date for the migration hasn&rsquo;t been set yet.&nbsp;</p>\n<p>To strengthen the connection between Axie Infinity and CyberKongz users, Sky Mavis will give away free Genkai NFTs to each holder of the rare Mystic Axies.&nbsp;</p>\nWhat Does the Partnership Mean for Sky Mavis and CyberKongz?\n<p>There&rsquo;s a reason why CyberKongz chose Sky Mavis for this collaboration. Apparently, there&rsquo;s always been a link between Axie Infinity players and CyberKongz fans.</p>\n<p>CyberKongz council member Henry the Grape explained: </p>\n\n<p>&ldquo;We were really born out of the Axie community. So when the opportunity came with Ronin to be able to continue building our ecosystem on Ronin, it was kind of a no-brainer.&rdquo;</p>\n\n<p>Myoo of CyberKongz also mentioned:</p>\n\n<p>&ldquo;By partnering with Sky Mavis we are embarking on a unique opportunity to accelerate our already established gaming ecosystem, while also enabling an expansion of our holder base.&rdquo;</p>\n\n<p>As for Sky Mavis, it will undoubtedly benefit from the partnership. The Axie Infinity creators are moving towards growing a large blockchain gaming ecosystem. CyberKongz NFTs will become the first profile picture collection minted on Ronin.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T16:36:45.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T16:33:43.000Z",
    "title": "Japan’s crypto vision: Transforming the internet",
    "url": "https://www.cryptopolitan.com/japans-crypto-vision-transforming-internet/",
    "description": "Journey with me as we get into the profound aspirations of the Land of the Rising Sun—Japan—as it decisively marches toward a digital revolution that stands to redefine the core fabric of the internet as we know it. The drive comes from the top, with Prime Minister Fumio Kishida zealously backing the Web3 technology, which ... <a title=\"Japan&#8217;s crypto vision: Transforming the internet\" class=\"read-more\" href=\"https://www.cryptopolitan.com/japans-crypto-vision-transforming-internet/\" aria-label=\"More on Japan&#8217;s crypto vision: Transforming the internet\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T16:30:35.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T16:27:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T16:20:08.000Z",
    "title": "Venom Blockchain Surpasses One Million Registered Wallets in Record Time",
    "url": "https://www.cryptopolitan.com/venom-blockchain-surpasses-one-million-registered-wallets-in-record-time/",
    "description": "Abu Dhabi, UAE, July 25th, 2023, Chainwire Venom Foundation, a pioneering force in the adoption of blockchain technology within regulated markets, has surpassed one-million registered wallets as of July 25. The momentous accomplishment came in a remarkably short span of time since the launch of Venom&#8217;s testnet on April 26th. The substantial growth signifies the ... <a title=\"Venom Blockchain Surpasses One Million Registered Wallets in Record Time\" class=\"read-more\" href=\"https://www.cryptopolitan.com/venom-blockchain-surpasses-one-million-registered-wallets-in-record-time/\" aria-label=\"More on Venom Blockchain Surpasses One Million Registered Wallets in Record Time\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T16:14:43.000Z",
    "title": "Japan’s Prime Minister reiterates commitment to Web3 development amidst anticipation of Binance’s upcoming launch",
    "url": "https://www.cryptopolitan.com/japans-pm-and-binance-focus-on-web3-dev/",
    "description": "Japan&#8217;s Prime Minister has signaled a significant step toward adopting blockchain and decentralized technologies by reiterating the country&#8217;s commitment to Web3.&#160; Additionally, Binance, one of the largest crypto exchanges in the world, has announced that it will soon launch in the country, solidifying the country&#8217;s status as a booming hub for Web3 innovation. Japan PM ... <a title=\"Japan&#8217;s Prime Minister reiterates commitment to Web3 development amidst anticipation of Binance&#8217;s upcoming launch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/japans-pm-and-binance-focus-on-web3-dev/\" aria-label=\"More on Japan&#8217;s Prime Minister reiterates commitment to Web3 development amidst anticipation of Binance&#8217;s upcoming launch\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T16:30:46.000Z",
    "title": "Worldcoin Founder’s Refusal To Answer Token Distribution Question Sparks Controversy",
    "url": "https://www.newsbtc.com/altcoin/worldcoin-founders-token-distribution/",
    "description": "Worldcoin co-founder Alex Blania&#8217;s recent refusal to disclose the token’s distribution model has raised some eyebrows, including that of John Deaton, who has expressed his dismay at his action. Something Fishy With Worldcoin? A video surfaced on Twitter in which Alex Blania, during a recent Bankless interview alongside fellow co-founder Sam Altman, refused to respond to the host’s question on Worldcoin’s token distribution, citing the regulatory uncertainty in the US as why he couldn’t answer the question.  Related Reading: Binance Announces Listing Of Sam Altman’s Worldcoin, Opens Deposits The Twitter user (@Pledditor) posted the video with the caption: “When a crypto founder refuses to answer questions about token distribution🚩🚩🚩” In the video, the host asks Blania to explain the distribution of the WLD token and Blania is quoted as saying: “Look, many of the details we can’t talk about here for the regulatory uncertainty in the United States.”  The video quickly went viral and sparked controversy as to whether Worldcoin was just another ‘ponzinomics’ or, indeed, Alex Blania was honest about why he couldn’t answer the question.  However, renowned crypto lawyer John Deaton, who represents some XRP holders, quickly reacted to the video in a tweet. Deaton’s tweet read: Wtf did this dude just say?  Did he literally say that he can’t talk about how WorldCoin is distributed “because of the regulatory uncertainty” in the United States? 🤦‍♂️  If there was ever a signal to RUN AWAY as fast as you can from a project, HERE IT IS. Is he saying he can’t tell you how to acquire it or what you’re acquiring because he might get sued? 🤷‍♂️  Now that I think of it, is he being smart and just following legal advice or is he a moron. 🤷‍♂️  Deaton stated that Blania’s action was enough reason for investors to run away from the project. However, the SEC and its Chair Gary Gensler weren’t spared from Deaton’s wrath as he also slammed them for their role in creating a state of turmoil regarding the regulatory environment in the crypto space.  “But this is an example of the chaos caused when you have bad faith regulators like @GaryGensler intentionally keeping the regulatory environment as unknowable,” Deaton said. A Bad Start For WLD? This development comes less than 48 hours after the launch of Worldcoin’s highly-anticipated WLD token. There were, however, some positives for the token as leading crypto exchanges like Binance, Gate.io, and KuCoin were quick to list it upon launch.  WLD price recovers above $2.2 &#124; Source: WLDUSD on Tradingview.com Founded by OpenAI’s CEO Altman, Worldcoin aims to solve the problem of differentiating between humans and bot-related projects. This problem has stemmed from the growing use of artificial intelligence in almost all spheres of life. The team plans to resolve this by giving humans unique digital identities to differentiate them from artificial intelligence algorithms.  Related Reading: Elon Musk Incorporates Dogecoin Symbol In Twitter Bio, Triggering 5% Increase In Price The WLD token spiked to as high as $3.30 upon launch. However, it seems the token’s price has negatively reacted to the issue of its token distribution and other privacy concerns as it dumped to as low as $1.66 on Monday, according to data from CoinGeko. WLD is currently trading at around $2.12 at the time of writing, with a 16% decrease in the last 24 hours. Featured image from Altcoin Buzz, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T16:32:40.000Z",
    "title": "UK Watchdog to Make Enquiries into Newly Launched WorldCoin Amidst Growing Concerns",
    "url": "https://www.crypto-news-flash.com/uk-watchdog-to-make-enquiries-into-newly-launched-worldcoin-amidst-growing-concerns/?utm_source=rss&utm_medium=rss&utm_campaign=uk-watchdog-to-make-enquiries-into-newly-launched-worldcoin-amidst-growing-concerns",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uk-g8745692a7_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"UK crypto bill\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uk-g8745692a7_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uk-g8745692a7_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uk-g8745692a7_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uk-g8745692a7_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uk-g8745692a7_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Open AI CEO launches another project called WorldCoin, and records 2 million users from its earlier phase. Interestingly, Britain&#8217;s data watchdog is said to be examining the project for any concerns.  Recently, OpenAI CEO Sam Altman launched a crypto project called WorldCoin. This project got 2 million users from its beta phase, with its core [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T16:30:26.000Z",
    "title": "Chainlink Price Prediction – Experts Say Collateral Network Could Surpass Solana In 2023",
    "url": "https://www.crypto-news-flash.com/chainlink-price-prediction-experts-say-collateral-network-could-surpass-solana-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-price-prediction-experts-say-collateral-network-could-surpass-solana-in-2023",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T102352.777.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T102352.777.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T102352.777-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T102352.777-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Chainlink price predictions are turning positive as the project quickly recovers from a steep price collapse. This market-wide collapse was caused by the SEC’s decision to add 55 new cryptocurrencies to its list of securities, including Solana.  However, Chainlink and Collateral Network have remained outside of this classification, which has caused both to rise in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T16:26:26.000Z",
    "title": "Investors Howl for Shiba Inu (SHIB) As Alex The Doge (ALEX) Presale Take’s Advantage Of The Current Market Conditions",
    "url": "https://www.crypto-news-flash.com/investors-howl-for-shiba-inu-shib-as-alex-the-doge-alex-presale-takes-advantage-of-the-current-market-conditions/?utm_source=rss&utm_medium=rss&utm_campaign=investors-howl-for-shiba-inu-shib-as-alex-the-doge-alex-presale-takes-advantage-of-the-current-market-conditions",
    "description": "<img width=\"1280\" height=\"753\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_18-32-07.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_18-32-07.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_18-32-07-300x176.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_18-32-07-1024x602.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_18-32-07-768x452.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The world of cryptocurrency has been expanding rapidly, with new tokens and protocols being introduced almost every day. A new token that has recently gained significant attention is Alex The Doge (ALEX). ALEX is a token built on the Polygon blockchain, with a focus on Play-To-Earn (P2E) gaming and Social-Fi. In this article, we will [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T16:21:09.000Z",
    "title": "Venom Blockchain Surpasses One Million Registered Wallets in Record Time",
    "url": "https://www.crypto-news-flash.com/venom-blockchain-surpasses-one-million-registered-wallets-in-record-time/?utm_source=rss&utm_medium=rss&utm_campaign=venom-blockchain-surpasses-one-million-registered-wallets-in-record-time",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1m_wallets_hero_1690282114oghIV8JThz.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1m_wallets_hero_1690282114oghIV8JThz.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1m_wallets_hero_1690282114oghIV8JThz-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1m_wallets_hero_1690282114oghIV8JThz-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1m_wallets_hero_1690282114oghIV8JThz-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Abu Dhabi, UAE, July 25th, 2023, Chainwire Venom Foundation, a pioneering force in the adoption of blockchain technology within regulated markets, has surpassed one-million registered wallets as of July 25. The momentous accomplishment came in a remarkably short span of time since the launch of Venom&#8217;s testnet on April 26th. The substantial growth signifies the [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T16:19:13.000Z",
    "title": "Ankr Introduces Ultra Sound Infrastructure To Revolutionize Web 3.0 Connectivity and Performance",
    "url": "https://dailyhodl.com/2023/07/25/ankr-introduces-ultra-sound-infrastructure-to-revolutionize-web-3-0-connectivity-and-performance/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/Ankr-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/Ankr-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2022/03/Ankr-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2022/03/Ankr-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2022/03/Ankr-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2022/03/Ankr-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>San Francisco, California Ankr has created the first version of an infrastructure solution to serve Web 3.0 ecosystems with a globally distributed network of nodes from a diverse range of node provider partners, including Microsoft and Tencent Cloud. The solution, named Ultra Sound Infrastructure, was built to offer the highest quality and most distributed node [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/ankr-introduces-ultra-sound-infrastructure-to-revolutionize-web-3-0-connectivity-and-performance/\">Ankr Introduces Ultra Sound Infrastructure To Revolutionize Web 3.0 Connectivity and Performance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]