[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T15:44:08.000Z",
    "title": "Despite Uproar, Crypto Bounties to Unmask Bad Actors Starts to Get Traction",
    "url": "https://www.coindesk.com/business/2023/07/28/despite-uproar-crypto-bounties-to-unmask-bad-actors-starts-to-get-traction/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Arkham customers are seeking to identify whomever was behind FTX and Wintermute’s huge hacks as well as an alleged meme-coin rug pull."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-28T14:49:14.000Z",
    "title": "Optimism Hits New All-Time High for Daily Transactions Amid Worldcoin Launch",
    "url": "https://decrypt.co/150481/optimism-hits-new-all-time-high-daily-transactions-worldcoin-launch",
    "description": "Data indicates that activity on the layer-2 network has been increasing since Q2 2023, accelerated by the launch of Worldcoin."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-28T14:31:02.000Z",
    "title": "Cannabis and Code: Generative Art Show Takes Over NYC's 'Luxury' Dispensary",
    "url": "https://decrypt.co/150396/cannabis-code-genrative-art-show-takes-over-nyc-luxury-dispensary",
    "description": "Gotham, one of New York City's few cannabis dispensaries, hosted NFT art gallery Bright Moments for a live minting event."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-28T14:14:06.000Z",
    "title": "France and Germany Coordinating on Worldcoin Investigation",
    "url": "https://decrypt.co/150473/france-germany-corrdinate-worldcoin-investigation",
    "description": "On Friday, French privacy watchdog CNIL said the legality of Worldcoin's approach \"seems questionable.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T14:54:13.000Z",
    "title": "BTC price shrugs off strong PCE data as Bitcoin traders eye $28K range",
    "url": "https://cointelegraph.com/news/btc-price-pce-data-bitcoin-traders-28k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/50f7dd12-27ac-40d4-8916-d2880ccc4eef.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin traders expect downside as BTC price offers a muted reaction to the Fed's \"preferred\" inflation metric.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) stayed rangebound at the July 28 Wall Street open despite further United States inflation data beating expectations.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b0023502-b516-4fa3-85e0-382c8eab4389.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Fed's \"preferred\" inflation metric points to waning pressure</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price action getting only a modest boost from the Personal Consumption Expenditures (PCE) Index print.</p><p>This came in below estimates, hinting that U.S. inflation was continuing to subside and copying other data prints from the week.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: US PCE Price Index comes in below expectations<br><br>Expected = 3.1%<br>Actual = 3.0%<br><br>Inflation continues to wane as per this metric <a href=\"https://t.co/61mrcBDON6\">pic.twitter.com/61mrcBDON6</a></p>&mdash; Game of Trades (@GameofTrades_) <a href=\"https://twitter.com/GameofTrades_/status/1684912551149355008?ref_src=twsrc%5Etfw\">July 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Commenting on its implications, financial commentary resource The Kobeissi Letter noted that PCE represented the Federal Reserve’s “preferred” inflation metric, as previously revealed by Chair Jerome Powell.</p><p>“PCE inflation is now at its lowest since April 2021. The Fed may finally have inflation under control,” it suggested in part of social media analysis.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At this week&#39;s Fed&#39;s meeting, they said inflation data over the next 2 months is important.<br><br>PCE inflation is another sign of progress on the fight against inflation.<br><br>Is the Fed&#39;s rate hike cycle finally over?<br><br>Follow us <a href=\"https://twitter.com/KobeissiLetter?ref_src=twsrc%5Etfw\">@KobeissiLetter</a> for real time analysis as this develops/</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1684905272790183936?ref_src=twsrc%5Etfw\">July 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Much like the July 26 Fed interest rate hike and the July 27 U.S. Q2 GDP estimate, however, Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-price-erases-fomc-gains-us-dollar-gdp\">refused to turn on volatility</a>, sticking between $29,000 and $29,500.</p><h2>Bitcoin stays below bulls' resistance target</h2><p>Among traders, there was still appetite for BTC price downside, with $30,000 resistance now in place for over a week.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/market-releases/bitcoin-price-volatility-10k-btc-exchanges\">Bitcoin price risks ‘major volatility’ as 10K BTC hits exchanges</a></em></strong></p><p>Popular trader Crypto Tony confirmed that he remained short BTC below $29,600.</p><p>“I expect continuation down to $28,000 in time, but for sure we could range here for a little while before the drop,” he <a href=\"https://twitter.com/CryptoTony__/status/1684820734290317312\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers on the day.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/31b2e451-58c6-4ce1-92f5-6c03652055f2.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Crypto Tony/Twitter</em></figcaption></figure><p>Fellow trader Daan Crypto Trades likewise placed emphasis on the loss of the local range focused on the $30,000 mark.</p><p>“With Bitcoin Rejecting from the previous range, I think it makes sense to prepare for low $28Ks,” he <a href=\"https://twitter.com/DaanCrypto/status/1684631011731374080\" target=\"_blank\" rel=\"noopener nofollow\">argued</a>. </p><blockquote>“Invalidation upon retaking $29.5K but there seems to be a lot of supply at that level and little spot bid to bring it up. Likely a choppy road on the way there.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/17515d5a-44c6-4835-b0df-5c736706ac48.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/Twitter</em></figcaption></figure><p>Michaël van de Poppe, founder and CEO of trading firm Eight, meanwhile spied what he called “deviation” on the daily BTC/USD chart — something previously occurring in February and which was followed by an upward rebound.</p><blockquote class=\"twitter-tweet\"><p lang=\"fr\" dir=\"ltr\">Deviation. <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/AlX9dHOCCt\">pic.twitter.com/AlX9dHOCCt</a></p>&mdash; Michaël van de Poppe (@CryptoMichNL) <a href=\"https://twitter.com/CryptoMichNL/status/1684910242927202304?ref_src=twsrc%5Etfw\">July 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Van de Poppe <a href=\"https://twitter.com/CryptoMichNL/status/1684832402521075712/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">additionally queried</a> whether the weekend, with its thinner liquidity and more options for volatile movement, could produce a \"classic\" comeback.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\">Should you ‘orange pill’ children? The case for Bitcoin kids books</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T16:00:48.000Z",
    "title": "Valkyrie Bitcoin miners ETF leads 2023’s high-performing ETFs",
    "url": "https://cryptoslate.com/insights/valkyrie-bitcoin-miners-etf-leads-2023s-high-performing-etfs/",
    "description": "<p>Quick Take Valkyrie Bitcoin Miners ETF: The Year&#8217;s Star Performer According to Athanasios Psarofagis, the Valkyrie Bitcoin Miners ETF has distinguished itself as the top-performing ETF of 2023. As of July 27 data, the fund has a staggering $24 million in assets under management and has yielded an impressive return of 261% this year. Crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/valkyrie-bitcoin-miners-etf-leads-2023s-high-performing-etfs/\">Valkyrie Bitcoin miners ETF leads 2023&#8217;s high-performing ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T15:45:07.000Z",
    "title": "Crypto.com gains Netherlands approval after Binance exit",
    "url": "https://cryptoslate.com/crypto-com-gains-netherlands-approval-following-binance-exit/",
    "description": "<p>Crypto.com announced on July 28 it has secured registration approval from De Nederlandsche Bank (DNB) to provide crypto services in the Netherlands. This approval follows Binance&#8217;s unsuccessful attempt to secure a similar license earlier this year, with Dutch investors advised to move funds before July 17. Crypto.com granted registration. The granted registration, which came after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-com-gains-netherlands-approval-following-binance-exit/\">Crypto.com gains Netherlands approval after Binance exit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-28T15:28:24.000Z",
    "title": "Worldcoin Launch Causes Optimism To Surpass Arbitrum in Daily Transactions",
    "url": "https://cryptobriefing.com/optimism-surpasses-arbitrum-daily-transactions/?utm_source=feed&utm_medium=rss",
    "description": "A considerable shift has been observed in Ethereum&#8217;s Layer 2 scaling solutions landscape. As of July 27, Optimism recorded 944,668 daily transactions, surpassing Arbitrum, which logged 658,013 transactions. This surge..."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-28T14:32:04.000Z",
    "title": "US House Committee Moves Forward on Legislation Covering Stablecoins, Digital Assets and More",
    "url": "https://cryptobriefing.com/us-house-committee-moves-forward-on-legislation/?utm_source=feed&utm_medium=rss",
    "description": "The House Financial Services Committee has approved seven pieces of legislation, signaling a major revamp in how digital assets, ESG impacts and small business lending data collection are regulated in..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T15:59:40.000Z",
    "title": "Crypto.com Receives Registration in the Netherlands",
    "url": "https://cryptodaily.co.uk/2023/07/cryptocom-receives-registration-in-the-netherlands",
    "description": "<p>Singapore-based crypto exchange Crypto.com announced it obtained registration with the central bank of the Netherlands, De Nederlandsche Bank (DNB). </p>\n<p>Cryptocurrency exchange, Crypto.com announced today that it had been approved for registration with the Dutch central bank.</p>\n\n<p dir=\"ltr\" lang=\"en\">We're excited to share that https://t.co/vCNztATSCO has been approved for registration in the Netherlands🇳🇱 as a provider of crypto services. This registration confirmation follows a comprehensive review of https://t.co/vCNztATSCO&rsquo;s business and compliance practices.Learn&hellip; pic.twitter.com/MSiRJJ9KDy</p>\n&mdash; Crypto.com (@cryptocom) July 28, 2023\n<p>\n\n</p>\nCrypto.com Expands European Reach\n<p>The exchange&rsquo;s registration comes after a &ldquo;comprehensive review&rdquo; of its business and compliance under the Netherlands&rsquo; Money Laundering and Terrorist Financing (Prevention) Act, also known as Wwft.</p>\n<p>According to its public register, the Dutch central bank has approved 36 crypto exchanges to offer their services in the country.</p>\n<p>Kris Marszalek, Crypto.com&rsquo;s CEO, said:</p>\n\n<p>&ldquo;Collaborating with regulators to responsibly advance the crypto and blockchain industry is of paramount importance to Crypto.com.&rdquo;</p>\n\n<p>Adding,</p>\n\n<p>&ldquo;This registration approval from De Nederlandsche Bank is a significant milestone for our business and the latest testament to our commitment to compliance. We look forward to continuing to work with DNB and other regulators around the world.&rdquo;</p>\n\n<p>Crypto.com&rsquo;s most recent registration furthers its regulatory approval momentum. The exchange received registration as a Virtual Asset Services Provider (VASP) from the Bank of Spain. VASP registration allows the exchange to offer its products and services to customers in Spain.</p>\n<p>The exchange has been authorised to offer its services in several other regions, including Singapore- its home base, France, the United Kingdom, Dubai, South Korea, Australia, Italy, and Greece, among others.</p>\n<p>Following the fallout from the SEC&rsquo;s regulatory enforcement against Binance and Coinbase, Crypto.com decided to shut down its institutional exchange services for its US customers.</p>\nBinance Exits The Dutch Market\n<p>Crypto.com&rsquo;s registration in the Netherlands comes soon after its rival exchange, Binance, left the Netherlands after failing to secure registration.</p>\n<p>The exchange announced it was leaving the Dutch market immediately and said it would no longer accept new users from the Netherlands after July 17.</p>\n<p>Binance said:</p>\n\n<p>&ldquo;Existing Dutch resident users are being sent an email with comprehensive information about what this means for their accounts and any assets they currently have on the Binance platform, alongside any steps they will need to take.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T15:15:00.000Z",
    "title": "Bitcoin Price Analysis:  29320 Again Tested - 29 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-29320-again-tested-29-july-2023",
    "description": "<p>BTC/USD Again Tests 29320 Technicals:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 29 July 2023</p>\n<p>Bitcoin (BTC/USD) was confined to a relatively tight range early in the Asian session as the pair ceded gains after reaching the 29320.14 level, representing another test of the upside price objective related to buying pressure around the 28850 and 28981.16 levels.&nbsp; Traders are monitoring the recent depreciating range from 31862.21 to 28850 with upside retracement levels around the 30000, 30356, 30711, 31151, and 31217 areas.&nbsp; Stops were recently elected above the 29462.90 area, an upside price objective associated with buying pressure around the 28850 and 28981 levels. &nbsp;&nbsp;Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp;</p>\n<p>Below the market, downside price objectives include the 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp; &nbsp;Also, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp;&nbsp; Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 200-bar MA (hourly) and above the 100-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29560.93 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29316.47.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T14:10:00.000Z",
    "title": "Grayscale Appeals To SEC For Equal Treatment For Spot BTC ETFs",
    "url": "https://cryptodaily.co.uk/2023/07/grayscale-appeals-to-sec-for-equal-treatment-for-spot-btc-etfs",
    "description": "<p>In a letter addressed to the U.S. Securities and Exchange Commission (SEC), Grayscale Investments has appealed for the equal treatment of all spot Bitcoin exchange-traded funds (ETFs).&nbsp;</p>\nCall For Equal Treatment\n<p>Joseph A. Hall from the law firm Davis Polk &amp; Wardwell, representing Grayscale Investments, has penned a letter directly addressing the SEC Secretary Vanessa Countryman. In the letter, Mr. Hall, who is acting as spokesperson for the investment firm, has expressed concerns about the SEC's differential treatment towards commodity-based exchange-traded products (ETPs) that hold Bitcoin while requesting the regulatory body to reconsider its stance on spot Bitcoin ETPs.</p>\n<p>In June 2022, the SEC disapproved a proposed rule change by NYSE Arca to list and trade shares of the Grayscale Bitcoin Trust. Grayscale has since sought a review of the SEC's decision by the U.S. Court of Appeals for the District of Columbia Circuit.</p>\nCall For Investor Protection\n<p>Grayscale had discussed the viability of surveillance-sharing agreements with the SEC in 2019. The company contends that the SEC already possesses the means to approve spot Bitcoin ETPs based on its previously articulated standard.</p>\n<p>(Spot Bitcoin ETPs and Bitcoin futures ETPs are the two categories of commodity-based ETPs designed to hold Bitcoin. The former holds actual Bitcoin, while the latter involves Bitcoin futures contracts traded on the Chicago Mercantile Exchange.)</p>\n<p>Although the SEC has approved Rule 19b-4 filings for Bitcoin futures ETPs, it has not done the same for spot Bitcoin ETPs. The former is attributed to their surveillance-sharing agreements with the CME.&nbsp;</p>\n<p>An excerpt from the letter reads,&nbsp;</p>\n\n<p>&ldquo;An approval that promotes investor protection and fairness for issuers should therefore be made simultaneously with approval of all proposed spot bitcoin ETPs, including those such as the Trust whose Rule 19b-4 filings were previously disapproved after lengthy Commission consideration,&rdquo;</p>\n\nGrayscale-SEC Legal Saga\n<p>Grayscale argues that approving only specific spot Bitcoin ETP proposals would grant an unfair first-mover advantage and implies discriminatory treatment. The investment firm insists that the approval process should prioritize the interests of all investors and simultaneously approve all proposed spot Bitcoin ETPs.</p>\n<p>With over $18 billion in assets, the Grayscale Bitcoin Trust (GBTC) provides investors with exposure to the original cryptocurrency. However, the firm has encountered multiple rejections from the SEC regarding its efforts to transform its flagship Bitcoin fund into a spot Bitcoin ETF.</p>\n<p>A spot Bitcoin ETF is highly anticipated within the crypto community as it would allow institutions to gain Bitcoin exposure without the need to actually possess the digital asset. Such an ETF is considered a significant milestone in the path toward widespread Bitcoin adoption and would validate cryptocurrencies as a legitimate asset class.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T15:37:28.000Z",
    "title": "Biggest Movers: SHIB Surges to 2-Week High on Friday, Whilst TRX Extends Gains",
    "url": "https://news.bitcoin.com/biggest-movers-shib-surges-to-2-week-high-on-friday-whilst-trx-extends-gains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SHIB Surges to 2-Week High on Friday, Whilst TRX Extends Gains\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2058154703-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shiba inu was a notable gainer on Friday, climbing to a two-week high during today&#x2019;s session in the process. The move came as the meme coin rose by as much as 6%, despite the global crypto market cap mostly consolidating. Tron rose for a fourth straight session today. Shiba Inu (SHIB) Shiba inu (SHIB) rallied [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:57:28.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:55:25.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:54:30.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:39:34.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:38:01.000Z",
    "title": "PancakeSwap expands to zkSync era, enhancing DeFi scalability",
    "url": "https://www.cryptopolitan.com/pancakeswap-expands-to-zksync-era-enhancing-defi-scalability/",
    "description": "In a significant development for the DeFi sector, PancakeSwap, the leading decentralized exchange (DEX) on the Binance Chain, has announced its launch on zkSync Era, an Ethereum Layer 2 network. This move is set to enhance the scalability and efficiency of the DEX, offering users reduced gas costs and faster transaction times. PancakeSwap v3 currently ... <a title=\"PancakeSwap expands to zkSync era, enhancing DeFi scalability\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pancakeswap-expands-to-zksync-era-enhancing-defi-scalability/\" aria-label=\"More on PancakeSwap expands to zkSync era, enhancing DeFi scalability\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:26:28.000Z",
    "title": "Indian Supreme Court questions Union government on crypto regulation delays",
    "url": "https://www.cryptopolitan.com/indian-court-questions-crypto-regulation/",
    "description": "The Indian Supreme Court (SC) has ordered the government to clarify whether it intends to create a specialized federal body to investigate cryptocurrency-related criminal activity cases. The concerned court pointed out the lack of legislation for digital currencies and a qualified agency to manage such issues. Supreme Court asks Union government to clarify crypto regulation ... <a title=\"Indian Supreme Court questions Union government on crypto regulation delays\" class=\"read-more\" href=\"https://www.cryptopolitan.com/indian-court-questions-crypto-regulation/\" aria-label=\"More on Indian Supreme Court questions Union government on crypto regulation delays\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:19:16.000Z",
    "title": "Grayscale urges SEC to treat all Bitcoin ETF applications fairly",
    "url": "https://www.cryptopolitan.com/grayscale-urges-sec-etf-applications-fairly/",
    "description": "The U.S. Securities and Exchange Commission (SEC) finds itself at a crossroads as it contemplates the approval of spot Bitcoin Exchange-Traded Fund (ETF) applications. Grayscale Investments, a prominent player in the cryptocurrency investment space, has urged the SEC to grant equal treatment to all applicants if it approves any of the proposals. The company believes ... <a title=\"Grayscale urges SEC to treat all Bitcoin ETF applications fairly\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-urges-sec-etf-applications-fairly/\" aria-label=\"More on Grayscale urges SEC to treat all Bitcoin ETF applications fairly\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T15:02:14.000Z",
    "title": "US Congressman involved in a fraudulent crypto scheme",
    "url": "https://www.cryptopolitan.com/us-congressman-in-fraudulent-crypto-scheme/",
    "description": "US Congressman George Santos, a first-term member of the House of Representatives, is currently facing indictment for thirteen felonies, including alleged embezzlement of contributions, fraudulent collection of unemployment checks, and providing false disclosures to the House. Among the array of charges, one of his more peculiar schemes involved cryptocurrency and seemed to be reminiscent of ... <a title=\"US Congressman involved in a fraudulent crypto scheme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-congressman-in-fraudulent-crypto-scheme/\" aria-label=\"More on US Congressman involved in a fraudulent crypto scheme\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T14:50:14.000Z",
    "title": "AI Breathes Life into Ancient Text to Unlock the Secrets of the Akkadian Cuneiform",
    "url": "https://www.cryptopolitan.com/ai-breathes-life-into-ancient-text-cuneiform/",
    "description": "In a world filled with concerns about AI&#8217;s impact on job markets and apocalyptic scenarios, it&#8217;s essential to recognize the positive potential of artificial intelligence. One such remarkable application comes from a master&#8217;s thesis at Tel Aviv University, where Gai Gutherz and Professor Shai Gordin collaborated to accelerate the translation of ancient texts into modern ... <a title=\"AI Breathes Life into Ancient Text to Unlock the Secrets of the Akkadian Cuneiform\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-breathes-life-into-ancient-text-cuneiform/\" aria-label=\"More on AI Breathes Life into Ancient Text to Unlock the Secrets of the Akkadian Cuneiform\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T14:47:54.000Z",
    "title": "France raises concerns over Worldcoin – Why?",
    "url": "https://www.cryptopolitan.com/france-raises-concerns-over-worldcoin-why/",
    "description": "Controversy is stirring in the realm of cryptocurrency as France&#8217;s privacy watchdog, CNIL, takes a critical stance against the biometric data collection practices of Sam Altman&#8217;s Worldcoin project. Having signed up 2.1 million users in a trial phase spanning two years, Worldcoin has sparked an investigation into the legality of its method for acquiring digital ... <a title=\"France raises concerns over Worldcoin &#8211; Why?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/france-raises-concerns-over-worldcoin-why/\" aria-label=\"More on France raises concerns over Worldcoin &#8211; Why?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T16:07:12.000Z",
    "title": "Borroe ($ROE) Presale Attracts Investors while Polygon (MATIC) and Chainlink (LINK) Falter",
    "url": "https://nulltx.com/borroe-roe-presale-attracts-investors-while-polygon-matic-and-chainlink-link-falter/",
    "description": "Borroe (ROE) is an exciting new project, and is captivating investors with its innovative approach to financing and visionary leadership. While established tokens like Polygon (MATIC) and Chainlink (LINK) face challenges, Borroe&#8217;s presale is drawing attention for all the right reasons. Let’s  explore the reasons behind the allure of Borroe&#8217;s presale and its potential to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T16:04:58.000Z",
    "title": "DigiToads Netting More Crypto Investors Looking For Big Profits Ahead of August Launch",
    "url": "https://nulltx.com/digitoads-netting-more-crypto-investors-looking-for-big-profits-ahead-of-august-launch/",
    "description": "The fast-paced and ever-changing crypto landscape is a breeding ground for new and innovative cryptocurrencies. This leads to fierce competition, with investors constantly seeking out projects with the potential for significant returns. DigiToads is among the latest contenders, with investors scrambling to participate in its presale ahead of its August launch, which promises big profits. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T16:02:45.000Z",
    "title": "MATIC 2.0 Ignites Crypto Market, While DigiToads (TOADS) Presale Bulls Run Wild!",
    "url": "https://nulltx.com/matic-2-0-ignites-crypto-market-while-digitoads-toads-presale-bulls-run-wild/",
    "description": "As the crypto market heats up, Polygon (MATIC) takes center stage with its highly anticipated launch of Polygon 2.0, propelling excitement among investors and enthusiasts alike. The latest upgrade brings a revolutionary transformation to the MATIC blockchain, introducing enhanced security, scalability, and interoperability features. As the crypto bulls charge forward, another player steals the spotlight [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T15:59:52.000Z",
    "title": "Uniswap (UNI) Token Surges, Investors Capitalize on InQubeta (QUBE) for AI Momentum-Driven Returns",
    "url": "https://nulltx.com/uniswap-uni-token-surges-investors-capitalize-on-inqubeta-qube-for-ai-momentum-driven-returns/",
    "description": "As the crypto market continues to evolve, there are new projects with massive prospects for investors who want to expand their gains. Since the commencement of its presale rally, InQubeta (QUBE) has continued to prove that it is a worthy crypto investment with promising growth. The AI-focused cryptocurrency is changing the crypto landscape by introducing [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T15:56:54.000Z",
    "title": "Is It Too Late to Buy Ripple? XRP Price Doubles in 7 Days, InQubeta Raises Over $1.7 Million and counting",
    "url": "https://nulltx.com/is-it-too-late-to-buy-ripple-xrp-price-doubles-in-7-days-inqubeta-raises-over-1-7-million-and-counting/",
    "description": "The decentralized finance (DeFi) market is an ever-evolving space that witnesses the constant development of the best DeFi cryptocurrencies. A notable example of these cryptocurrencies is Ripple (XRP), which recently won in its prolonged legal battle against the Securities and Exchange Commission (SEC). This led to the price of its native token doubling in just [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T15:49:46.000Z",
    "title": "Dogecoin and Floki slide, DigiToads pumping on meme coin frenzy",
    "url": "https://crypto.news/dogecoin-and-floki-slide-digitoads-pumping-on-meme-coin-frenzy/",
    "description": "DigiToads appears to be thriving in the current market conditions as Dogecoin and Floki rapidly drop from their peaks. TOADS presale is ongoing"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T15:44:26.000Z",
    "title": "Crypto trader makes $200k profit on Chainlink in month",
    "url": "https://crypto.news/crypto-trader-makes-200k-profit-on-chainlink-in-month/",
    "description": "A savvy crypto trader has turned an initial investment of 81.158k Chainlink (LINK) into 641k USDC within a month, resulting in a $200k profit. According to a tweet by Spot on Chain, a trader has consistently demonstrated an ability to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T14:55:34.000Z",
    "title": "Immutable X (IMX) price rises amid Upbit listing ",
    "url": "https://crypto.news/immutable-x-imx-price-rises-amid-upbit-listing/",
    "description": "Immutable X (IMX), a layer-2 scaling solution on Ethereum, has risen by more than 15% after being listed on the South Korean exchange Upbit. Immutable X (IMX) experienced a remarkable price surge, with its token price leaping above $0.83, the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T14:23:45.000Z",
    "title": "Ramp launches in Brazil to drive crypto adoption in Latin America",
    "url": "https://crypto.news/ramp-brazil-crypto-adoption-latin-america/",
    "description": "Ramp, a fintech company, announced its expansion into Brazil to accelerate crypto adoption across Latin America"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T14:17:18.000Z",
    "title": "Crypto.com gets registration approval in the Netherlands",
    "url": "https://crypto.news/crypto-com-gets-registration-approval-in-the-netherlands/",
    "description": "Crypto.com revealed that the crypto exchange had been registered with the Netherlands&#8217; central bank to offer cryptocurrency services to Dutch customers.  Crypto.com revealed the news in a blog post on July 28. The company obtained registration approval with De Nederlandsche&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T14:10:03.000Z",
    "title": "Sequoia Capital cuts its crypto fund by 65%",
    "url": "https://crypto.news/sequoia-capital-cuts-its-crypto-fund-by-65/",
    "description": "VC firm Sequoia Capital has reportedly downsized its crypto fund from $585 million to $200 million amid a liquidity crunch and focus on smaller crypto players."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T16:00:52.000Z",
    "title": "Ripple Attorney Withdraws From SEC Lawsuit, Will It Affect XRP?",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-attorney-withdraws-from-sec-lawsuit/",
    "description": "A recent development in the ongoing showdown between the United States Securities and Exchange Commission (SEC) has seen the withdrawal of another Ripple attorney from the lawsuit, recent court filings reveal. This comes after a motion was filed earlier in the month for Anna R. Gressel to withdraw as attorney of defendant Ripple Labs. This recent withdrawal has cast a shadow of uncertainty as holders of XRP ponder on the likely impact of this development. Ripple Remains Upbeat Despite Attorney’s Withdrawal According to details in the filing made at the District Court for the Southern District of New York on July 27, Ripple is asking for the leave of the court to withdraw Lisa R. Zornberg as an attorney to the defendants in the ongoing XRP vs. SEC lawsuit.  Related Reading: VC Firm Sequoia Capital Slashes Crypto Fund By 65% Amid Bear Market Ripple is appealing to the court to grant Lisa R. Zornberg of the popular Debevoise &#38; Plimpton LLP permission to withdraw as an attorney in the lawsuit. This is in light of the fact that Lisa R. Zornberg will no longer be working with the law firm from July 31.  The foremost federal prosecutor was appointed by New York City Mayor Eric Adams as City Hall&#8217;s Chief Counsel earlier this week. However, this move does not in any way affect Ripple’s relationship with Debevoise &#38; Plimpton LLP as other attorneys of the firm will continue representing Ripple Labs in the case.  Ripple has also reiterated that the withdrawal of Lisa R. Zornberg does not in any way affect its interests, including those of CEO Brad Garlinghouse and co-founder Chris Larsen. It’s also important to note that the court had previously approved withdrawal motions for three attorneys Kylie Chiseul Kim, Clayton J. Masterman, and Anna R. Gressel to exit the lawsuit.   Attorney Withdraws As Case Grinds to a Close The withdrawal of Lisa R. Zornbergs comes in the wake of Judge Analisa Torres&#8217; referral of the lawsuit to Magistrate Judge Sarah Netburn. Magistrate Judge Netburn instructed the SEC and Ripple to reach an agreement on three mutually suitable dates to hold a settlement conference on issues like institutional sales of XRP. Related Reading: Bitcoin Set To Accelerate As A Store Of Value In Wake Of Bank Collapses, Cathie Wood XRP’s price witnessed a surge in the wake of the summary judgment entered in favor of Ripple. The plans unveiled by Ripple have also helped in bolstering investor confidence as the demand for XRP among institutional investors continues to surge. XRP is currently trading at $0.071, down 0.5% in the last 24 hours according to data from CoinGecko. However, its current price puts it 33% higher than its July opening price of $0.47. XRP price is 33% higher compared to July lows &#124; Source: XRPUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T15:00:16.000Z",
    "title": "Bitcoin Rally May Not Resume Until This Happens",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-may-not-resume-until-this-happens/",
    "description": "Bitcoin has continued to stagnate recently as another recovery move has failed to prosper. So here&#8217;s an indicator that may hint when a break could happen. Bitcoin Rally May Not Resume Until The Stablecoin Market Cap Goes Up Around the start of this week, Bitcoin observed a sharp plunge that had taken the asset&#8217;s price from the $30,000 level down to the $29,000 mark. A couple of days back, however, the coin had started surging again and had reclaimed the $26,600 level. This uplift in the price had come as the US Fed had announced a 25 bps interest rate hike, but before long, the recovery efforts had run out of steam, and now, the cryptocurrency has already retraced its gains from the rally. BTC has gone back towards the $29,000 level recently &#124; Source: BTCUSD on TradingView Earlier, Bitcoin had been stuck in a phase of stagnation above the $30,000 level for more than a month, but with the plunge in the price, this streak had been broken. Related Reading: PEPE Whales Load Up Their Bags As Memecoin Jumps 13% The asset now sticking near the $29,000 level may mean, however, that volatility hasn&#8217;t truly returned for the asset yet, as it still continues to consolidate, just around a different level. When a true break away from this stagnation may happen and the rally would return could possibly depend on the total supply of all the stablecoins. As explained by an analyst in a CryptoQuant post, range-breaking price rises in Bitcoin this year have generally only come whenever the stablecoin supply has registered an increase. The value of the metric seems to have been heading down in recent days &#124; Source: CryptoQuant As the quant has marked in the chart, the major price increases in the past few months have generally preceded a sharp local increase in the supply of the stablecoins. Usually, an increase in the stablecoin supply can suggest two things. First, there may be a fresh injection of capital happening into the market, as investors ask for more of these fiat-tied tokens to be minted. And second, some holders of other coins like Bitcoin may be selling their coins to seek the relative safety that the stablecoins offer. Either way, such investors who hold their capital in the form of stables do so because they eventually plan to dip (back) into the volatile side of the market. Due to this reason, the total stablecoin supply may be looked at as a store of buying pressure that can be deployed into assets like Bitcoin. From the chart, it&#8217;s visible that it hasn&#8217;t exactly been the increase in the stablecoin supply that has fueled the price surges this year, but rather the decline in the metric that followed shortly after. Related Reading: Bitcoin At Decision Point As Investors Hold Neutral Sentiment These decreases in the supply suggested a transfer of capital into Bitcoin and others, which is why their prices observed a bullish boost. It&#8217;s also visible in the graph, however, that the stablecoin supply has been on a net decline in this period, meaning that the dry powder tied up in these tokens has been constantly running out. Based on this trend, if the stablecoin supply doesn&#8217;t see another major cash injection in the coming days, then the Bitcoin rally may not be able to resume. At the time of writing, Bitcoin is trading around $29,200, down 1% in the last 24 hours. Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T16:00:12.000Z",
    "title": "Crypto Bulls Charge Ahead: Litecoin (LTC), Filecoin (FIL) And DigiToads (TOADS) For 100X Returns",
    "url": "https://www.crypto-news-flash.com/crypto-bulls-charge-ahead-litecoin-ltc-filecoin-fil-and-digitoads-toads-for-100x-returns/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-bulls-charge-ahead-litecoin-ltc-filecoin-fil-and-digitoads-toads-for-100x-returns",
    "description": "<img width=\"512\" height=\"219\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T164631.965.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T164631.965.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T164631.965-300x128.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />From the pioneers like Bitcoin and Ethereum to an array of altcoins, the crypto space has witnessed staggering growth over the past decade. However, recent times have brought about a remarkable surge in the value of some lesser-known tokens, propelling them to the forefront of the crypto world. This article delves into the remarkable ascent [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T15:21:38.000Z",
    "title": "Ukraine Receives $225M In Crypto Donations, But Trend Slowing According To Recent Report",
    "url": "https://www.crypto-news-flash.com/ukraine-receives-225m-in-crypto-donations-but-trend-slowing-according-to-recent-report/?utm_source=rss&utm_medium=rss&utm_campaign=ukraine-receives-225m-in-crypto-donations-but-trend-slowing-according-to-recent-report",
    "description": "<img width=\"1920\" height=\"1255\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920.png 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-300x196.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-1024x669.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-768x502.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-1536x1004.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-104x69.png 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-214x140.png 214w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-24x16.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-36x24.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/ukraine-g7ecec2c6b_1920-48x31.png 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Ukraine amasses $225M in global crypto donations, but a concerning slowdown is reported. Crypto is crucial for war efforts and funding supplies. Monthly contributions have been consistent but stagnant, not exceeding $10M since May 2022. In a remarkable display of solidarity, Ukraine recently witnessed an overwhelming surge in crypto donations, amassing an unprecedented $225 million [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T15:02:18.000Z",
    "title": "BNB Chain Leads Ethereum in Total Verified Smart Contracts as Web3 Numbers Grow in Q2 – Report",
    "url": "https://www.crypto-news-flash.com/bnb-chain-leads-ethereum-in-total-verified-smart-contracts-as-web3-numbers-grow-in-q2-report/?utm_source=rss&utm_medium=rss&utm_campaign=bnb-chain-leads-ethereum-in-total-verified-smart-contracts-as-web3-numbers-grow-in-q2-report",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-104x69.jpg 104w\" sizes=\"(max-width: 800px) 100vw, 800px\" />A new report from BNB Chain shows deep insight into key smart contract-based protocols. With BNB Chain and Ethereum leading the pack, the developer ecosystem has remained positive over the past year. A recently published BNB Chain report has confirmed continuous development commitment in the smart contract ecosystem. Markedly, the report gave an in-depth analysis [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T14:30:17.000Z",
    "title": "Crypto Strategist Michaël van de Poppe Says One Catalyst Could Trigger Continuation of Bitcoin Bull Cycle",
    "url": "https://dailyhodl.com/2023/07/28/crypto-strategist-michael-van-de-poppe-says-one-catalyst-could-trigger-continuation-of-bitcoin-bull-cycle/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Trigger-Continuation-of-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is predicting that one catalyst would ignite the continuation of a Bitcoin (BTC) bull cycle. In a new video strategy session, crypto analyst Michaël van de Poppe tells his 162,000 YouTube subscribers that Bitcoin is liking coming to the end of its market correction. According to the trader, financial markets [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/crypto-strategist-michael-van-de-poppe-says-one-catalyst-could-trigger-continuation-of-bitcoin-bull-cycle/\">Crypto Strategist Michaël van de Poppe Says One Catalyst Could Trigger Continuation of Bitcoin Bull Cycle</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]