[
  {
    "source": "CoinDesk",
    "date": "2024-01-11T03:35:03.000Z",
    "title": "Bitcoin ETFs: What to Expect on Day One",
    "url": "https://www.coindesk.com/policy/2024/01/11/bitcoin-etfs-what-to-expect-on-day-one/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Spot bitcoin ETFs are launching in the U.S. on Thursday. Here's what the issuers and exchanges behind these products have to say."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T03:37:09.000Z",
    "title": " Ethereum co-founder Vitalik Buterin calls for 33% increase in gas limit  ",
    "url": "https://cointelegraph.com/news/ethereum-co-founder-vitalik-buterin-calls-for-33-increase-in-gas-limit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzlmZDdlNjEtMzM2Ny00MWI3LWFjNGEtZTBjNWQ0YWQxNDkwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>During an Ask-Me-Anything (AMA) on Reddit, Vitalik Buterin suggested raising the Ethereum gas limit to 40 million to improve network throughput. </p>\n                    <p><p>Ethereum co-founder Vitalik Buterin has advocated for a “modest” gas limit increase to potentially improve network throughput.</p><p>During a Reddit “ask-me-anything” organized by the Ethereum Foundation's Research Team on Jan. 10, Buterin <a href=\"https://www.reddit.com/r/ethereum/comments/191kke6/comment/kh7ekx3/\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> that the gas limit has not been increased for nearly three years, the longest time ever in the protocol’s history.</p><p>“Honestly, I think doing a modest gas limit increase even today is reasonable,” said Buterin during the research team's 11th AMA.</p><p><a href=\"https://cointelegraph.com/news/ethereum-co-founder-vitalik-buterin-calls-for-33-increase-in-gas-limit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-11T03:15:29.000Z",
    "title": "Twitter confirms SEC X account was compromised and didn’t have 2FA enabled",
    "url": "https://cryptobriefing.com/twitter-confirms-sec-x-account-was-compromised-and-didnt-have-2fa-enabled/?utm_source=feed&utm_medium=rss",
    "description": "A fake tweet from the compromised SEC X account caused Bitcoin price turbulence."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-11T03:11:00.000Z",
    "title": "MicroStrategy’s Bitcoin Treasury Surpasses $500 Million in Unrealized Gains So Far This Year",
    "url": "https://www.cryptoglobe.com/latest/2024/01/microstrategys-bitcoin-treasury-surpasses-500-million-in-unrealized-gains-so-far-this-year/",
    "description": "Nasdaq-listed business intelligence firm MicroStrategy has seen the value of its significant Bitcoin ($BTC) holdings increase to the point that the firm is now sitting on over $500 million of unrealized gains on the cryptocurrency in its treasury just this year. According to data from BitcoinTreasuries the company, which is the world’s largest corporate Bitcoin […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T03:38:59.000Z",
    "title": "Hong Kong Researchers Propose AI and Robotics Curriculum for Young Students",
    "url": "https://www.cryptopolitan.com/hong-kong-ai-and-robotics-curriculum/",
    "description": "In a groundbreaking move, a group of Hong Kong-based researchers has spearheaded an initiative to revolutionize education by introducing a comprehensive framework centered around the realms of artificial intelligence (AI) and robotics.&#160; The AI4K12 initiative aims to familiarize young students with the rapidly evolving landscape of these emerging technologies, tailoring its approach to K-12 education. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T03:11:54.000Z",
    "title": "McAfee’s Project Mockingbird Claims 90% Accuracy in Detecting AI-Generated Audio Deepfakes",
    "url": "https://www.cryptopolitan.com/mcafees-mockingbird-90-accuracy-deep-fake/",
    "description": "In a digital era where discerning truth from fiction becomes increasingly challenging, McAfee, a renowned cybersecurity solutions provider, claims to have found a solution to combat the surge in AI-generated audio deepfakes. &#160;As technology allows for the rapid creation of convincing deepfakes, McAfee introduces Project Mockingbird, a cutting-edge tool aimed at identifying and thwarting cybercriminals [&#8230;]"
  }
]