[
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T12:49:52.000Z",
    "title": " Gamma attempts to negotiate with hacker after $3.4M exploit ",
    "url": "https://cointelegraph.com/news/gamma-attempts-to-negotiate-with-hacker-after-3-4m-exploit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZTM3ZjMyNDMtM2Q4ZC00NDMxLWFiN2QtMDkzMjExNzNjYzhjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Blockchain security firm PeckShield confirmed that the amount stolen from Gamma Strategies reached $3.4 million.</p>\n                    <p><p data-ct-non-breakable=\"true\">Gamma Strategies, an Ethereum-based liquidity management protocol, has sent a message asking to negotiate a bounty with the attacker who stole $3.4 million in digital assets in an attempt to recover the funds lost in the exploit. </p><p>On Jan. 4, blockchain security firm PeckShield detected an exploit within Gamma’s vaults. Initial <a href=\"https://cointelegraph.com/news/gamma-protocol-investigates-attack-drained-ether\">estimates showed that the losses drained</a> around 211.9 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth approximately $469,000. However, PeckShield later confirmed that the losses reached $3.4 million and that the exploiter had already transferred $2.2 million to the crypto mixer Tornado Cash. </p><p data-ct-non-breakable=\"true\">In response to the attack, Gamma <a href=\"https://twitter.com/GammaStrategies/status/1742839968240980408\" target=\"_blank\" rel=\"noopener nofollow\">shut</a> down its vault deposits, allowing only withdrawals. The protocol has also sent a message to the exploiter’s wallet address, hoping to start negotiations for a bounty for returning the crypto assets. </p><p><a href=\"https://cointelegraph.com/news/gamma-attempts-to-negotiate-with-hacker-after-3-4m-exploit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-04T13:07:12.000Z",
    "title": "Visa unveils web3 loyalty platform allowing brands to create custom branded crypto wallets",
    "url": "https://cryptoslate.com/visa-unveils-web3-loyalty-platform-allowing-brands-to-create-custom-branded-crypto-wallets/",
    "description": "<p>Visa has revealed a new web3 loyalty engagement solution designed to meet modern consumers&#8217; evolving digital needs, offering immersive experiences like gamified rewards, augmented reality treasure hunts, and novel ways to utilize loyalty points. The promotional video for the service states that &#8220;traditional loyalty programs are simply an exchange of spend and reward, but consumers [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/visa-unveils-web3-loyalty-platform-allowing-brands-to-create-custom-branded-crypto-wallets/\">Visa unveils web3 loyalty platform allowing brands to create custom branded crypto wallets</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-04T12:45:59.000Z",
    "title": "Bitcoin’s slide reveals short-term investors transferring $1 billion in losses",
    "url": "https://cryptoslate.com/insights/bitcoins-slide-reveals-short-term-investors-transferring-1-billion-in-losses/",
    "description": "<p>Quick Take A recent dip in Bitcoin&#8217;s price has unveiled the activities of short-term holders, defined as those holding Bitcoin for fewer than 155 days. Upon investigation, it has been found that these holders transferred roughly $1 billion of coins to exchanges while at a loss. In the past year, this recorded activity marks the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-slide-reveals-short-term-investors-transferring-1-billion-in-losses/\">Bitcoin&#8217;s slide reveals short-term investors transferring $1 billion in losses</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-04T12:51:39.000Z",
    "title": "Bitcoin (BTC), Ethereum (ETH), and Solana (SOL): Bracing for the Possibility of a Bitcoin ETF Rejection",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-btc-ethereum-eth-and-solana-sol-bracing-for-the-possibility-of-a-bitcoin-etf-rejection",
    "description": "Explore how the potential denial of a Bitcoin ETF could impact the cryptocurrency market in 2024. Understand the implications for major players like Bitcoin (BTC), Ethereum (ETH), and Solana (SOL) amidst evolving regulations and technological advancements. Delve into our analysis of Bitcoin's price forecast and Ethereum's roadmap, while keeping an eye on Solana's strategic moves."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T13:04:42.000Z",
    "title": "Nigeria shifts stance on crypto with new regulatory framework",
    "url": "https://www.cryptopolitan.com/nigeria-shifts-stance-on-crypto/",
    "description": "The Central Bank of Nigeria (CBN) has recently announced a significant shift in its stance on cryptocurrencies, moving from a complete ban to introducing a structured regulatory framework for virtual asset service providers. This development comes as an effort to keep pace with the global blockchain and digital asset trends. The CBN has outlined strict [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T13:00:18.000Z",
    "title": "Bitcoin dominates as crypto fund inflows surge to $2.2 billion in 2023: CoinShares",
    "url": "https://www.cryptopolitan.com/bitcoin-inflows-2-2-billion-2023-coinshares/",
    "description": "The cryptocurrency market experienced a significant resurgence in 2023, as detailed in a recent report by CoinShares, a leading digital asset investment firm. The year marked a remarkable turnaround from the previous year&#8217;s performance, with total inflows into cryptocurrency investment products reaching $2.2 billion. This figure represents a substantial increase from 2022 and indicates growing [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T13:00:32.000Z",
    "title": "Shibarium Transactions Crash Almost 50%, Shiba Inu Price Wobbles",
    "url": "https://www.newsbtc.com/shiba-inu/shibarium-shiba-inu-price-wobbles/",
    "description": "The Shiba Inu layer-2 network Shibarium enjoyed significant success at the end of 2023, crossing several milestones in the process. However, the network looks to be experiencing a cooling-off period following a significant drop in the number of transactions. Shiba Inu (SHIB) also looks to be affected by this development following a notable decline in its price.  Daily Transactions On Shibarium Drop By Almost 50% Data from the Shibarium explorer shows that daily transactions on the network have significantly dropped since the new year began. Only just over 4 million transactions were processed on both January 2 and 3. This decline is notable because Shibarium was averaging over 7 million transactions for most of December last year.  Related Reading: Crypto Pundit Says Cardano Rivals XRP Community, But Why Is ADA Price Struggling? December 29 was the last time that Shibarium saw over 7 million daily transactions. Since then, it has been on a downward slope, dropping to 6 million and 5 million on December 30 and 31, respectively.  It looked like things were going to pick back up as daily transactions on the network rose back to over 6 million on January 1. However, that was not the case, as the downtrend continued the next day.  The number of daily transactions on the layer-2 network has become more significant since Shibarium’s role in SHIB’s growth became apparent. The Shibarium team has committed to converting some of the transaction fees made from the network to SHIB and burning those tokens. As such, more transactions on the network translates to more SHIB burns.  These SHIB burns have the potential to positively impact SHIB’s price since the crypto token’s value is likely to increase as more of it gets out of circulation. So far, over 410 trillion SHIB has been sent to Shiba Inu’s burn wallet, with Shibarium contributing a huge chunk to that figure.  SHIB price at $0.000009 &#124; Source: SHIBUSD On Tradingview.com More Attention To BONE Than Shiba Inu? Meanwhile, recent development suggests that the Shiba Inu team may be looking to increase BONE’s utility. For some time now, the SHIB token has so far been the center of attention in the Shiba Inu ecosystem. However, the BONE token looks to be joining the mix as Shiba Inu’s Marketing Lead, Lucie, has recently turned her attention to promoting the Dog coin.  Related Reading: Crypto Analyst Blasts $20,000 XRP Price Target, Reveals Why It’s Impossible In an X (formerly Twitter) post, Lucie mentioned several projects that were set to launch on the layer-2 network and noted how users would need the Dog coin to access these projects. BONE, which was initially created as the native token for ShibaSwap has gone on to enjoy greater utility since Shibarium launched.  BONE happens to be the gas token for the layer-2 network. Notably, an increase in BONE’s price could also affect the SHIB burns since the team gets to acquire and burn more of the meme coin. At the time of writing, SHIB is trading at around $0.000009574, down over 9% in the last 24 hours, according to data from CoinMarketCap.  Featured image from Watcher Guru, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-04T13:00:15.000Z",
    "title": "3 Reasons Why Solana (SOL) and Retik Finance (RETIK) Are Very Important to the Crypto Ecosystem",
    "url": "https://www.crypto-news-flash.com/3-reasons-why-solana-sol-and-retik-finance-retik-are-very-important-to-the-crypto-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=3-reasons-why-solana-sol-and-retik-finance-retik-are-very-important-to-the-crypto-ecosystem",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T135154.977.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T135154.977.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T135154.977-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T135154.977-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T135154.977-450x253.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency landscape is dynamic and ever-evolving, marked by the emergence of new projects and the adaptation of established ones to remain pertinent. In this environment, certain platforms and tokens have caught attention for their potential to significantly influence the future of finance.Solana (SOL) and Retik Finance (RETIK) are two such projects that are generating [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-04T12:51:59.000Z",
    "title": "Canaan Strikes Gold: 17,000+ Bitcoin Mining Rigs Deal with Cipher and Stronghold",
    "url": "https://www.crypto-news-flash.com/canaan-strikes-gold-17000-bitcoin-mining-rigs-deal-with-cipher-and-stronghold/?utm_source=rss&utm_medium=rss&utm_campaign=canaan-strikes-gold-17000-bitcoin-mining-rigs-deal-with-cipher-and-stronghold",
    "description": "<img width=\"1798\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-gold-coin-pile\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile.jpg 1798w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-1536x1025.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gold-coin-pile-1200x801.jpg 1200w\" sizes=\"(max-width: 1798px) 100vw, 1798px\" />Bitcoin mining hardware maker Canaan Inc. has secured new orders from Cipher Mining and Stronghold Digital. Bitcoin mining firms jostle to bolster their position ahead of the next halving event. Canaan Inc., a prominent high-performance computing solutions provider, has recently secured follow-on purchase orders from Cipher Mining Inc., and Stronghold Digital Mining Inc., totaling over [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-04T12:45:14.000Z",
    "title": "Trader Says Ethereum-Based Blue Chip Altcoin Could Explode Over 100%, Updates Outlook on Bitcoin and Chainlink",
    "url": "https://dailyhodl.com/2024/01/04/trader-says-ethereum-based-blue-chip-altcoin-could-explode-over-100-updates-outlook-on-bitcoin-and-chainlink/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/01/Based-Blue-Chip-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto trader and analyst Ali Martinez is expressing a bullish outlook on a top-20 Ethereum (ETH) altcoin. Martinez tells his 39,200 followers on the X social media platform that the Ethereum layer-2 network Polygon (MATIC) could appreciate by up to 115% from the current level. According to Martinez, Polygon is forming a symmetrical triangle pattern [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/04/trader-says-ethereum-based-blue-chip-altcoin-could-explode-over-100-updates-outlook-on-bitcoin-and-chainlink/\">Trader Says Ethereum-Based Blue Chip Altcoin Could Explode Over 100%, Updates Outlook on Bitcoin and Chainlink</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]