[
  {
    "source": "Bitcoin.com",
    "date": "2024-02-21T05:00:37.000Z",
    "title": "Cryptocurrency Exchange Bitget Eyes Latam Expansion",
    "url": "https://news.bitcoin.com/cryptocurrency-exchange-bitget-eyes-latam-expansion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cryptocurrency Exchange Bitget Eyes Latam Expansion\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/56a9ca83-0859-49ed-a929-d31710424ec6.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitget, a top 15 cryptocurrency exchange, is seeking to expand its operations in Latin America, a market traditionally dominated by incumbents like Binance and Bitso. Maximiliano Hinz, Bitget&#8217;s growth director for Latam, believes that the exchange can differentiate by focusing on serving beginner investors with tools like its copy-trading feature. Bitget Aims to Gain Traction [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T05:07:47.000Z",
    "title": "Avalanche’s AVAX tanks before $365M token unlock – What went wrong?",
    "url": "https://www.cryptopolitan.com/avalanche-tanks-before-365m-token-unlock/",
    "description": "Avalanche&#8217;s native cryptocurrency, AVAX, has experienced underperformance in the market leading up to a significant event: the unlocking of $365 million worth of tokens. This unlocking event has garnered attention due to its potential impact on AVAX&#8217;s price and market dynamics.&#160; Historically, such large unlocking events in the crypto space often coincide with price declines, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T04:58:38.000Z",
    "title": "Tron Price Prediction: TRX Silently Grinds Higher, $0.18 Next?",
    "url": "https://www.newsbtc.com/analysis/trx/tron-price-prediction-trx-grinds-higher-0-18/",
    "description": "Tron price is gaining pace above the $0.120 resistance against the US Dollar. TRX is outperforming Bitcoin and could rise further above $0.140. Tron is moving higher above the $0.122 resistance level against the US dollar. The price is trading above $0.1350 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support at $0.1382 on the 4-hour chart of the TRX/USD pair (data source from Kraken). The pair could continue to climb higher toward $0.165 or even $0.180. Tron Price Regains Strength Recently, Bitcoin and Ethereum saw a decent increase and moved into a positive zone. Tron price also remained well-bid and it slowly moved higher above the $0.120 resistance zone. There was a steady increase above the $0.128 and $0.132 resistance levels. Finally, TRX traded to a new multi-week high at $0.1400 and is currently consolidating gains. It is trading above the 23.6% Fib retracement level of the upward move from the $0.1309 swing low to the $0.1400 high. Tron price is now trading above $0.1350 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support at $0.1382 on the 4-hour chart of the TRX/USD pair. Source: TRXUSD on TradingView.com On the upside, an initial resistance is near the $0.1400 level. The first major resistance is near $0.1420, above which the price could accelerate higher. The next resistance is near $0.1650. A close above the $0.1650 resistance might send TRX further higher toward $0.1720. The next major resistance is near the $0.180 level, above which the bulls are likely to aim for a larger increase toward $0.20. Are Dips Supported in TRX? If TRX price fails to clear the $0.140 resistance, it could start a downside correction. Initial support on the downside is near the $0.1380 zone and the trend line. The first major support is near the $0.1350 level or the 50% Fib retracement level of the upward move from the $0.1309 swing low to the $0.1400 high, below which it could test $0.1320. Any more losses might send Tron toward the $0.1250 support in the coming sessions. Technical Indicators 4 hours MACD – The MACD for TRX/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for TRX/USD is currently above the 50 level. Major Support Levels – $0.1380, $0.1350, and $0.1320. Major Resistance Levels – $0.140, $0.1650, and $0.180."
  }
]