[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T04:32:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T04:30:04.000Z",
    "title": "Bitcoin Addresses In Loss Soar To One-Month High Amid Mixed Market Indicators",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-addresses-in-loss-soar-to-one-month-high/",
    "description": "Bitcoin, the pioneering cryptocurrency, is currently exhibiting mixed market signals, according to the latest data from Glassnode. The analytics firm points out that Bitcoin addresses in loss have reached a one-month high, even as the count of addresses holding smaller balances of the coin marks a record high.  The contrasting trends paint an intriguing picture of the current state of the Bitcoin market, further spurring dialogues on the future trajectory of this digital asset. Related Reading: Bitcoin Price Forecast: Dark Days Ahead As $29,200 Support Fails BTC Addresses In Loss Reaches New Heights Glassnode&#8217;s report reveals earlier today that the number of Bitcoin addresses in loss (seven-day Moving Average) has peaked at roughly 14.043 billion, marking a new one-month high. This supersedes the previous peak of 14.041 billion recorded on July 31, 2023.  Such a trend points towards a section of investors who bought BTC at higher price points and are now in the red due to the recent price fluctuations. However, it&#8217;s important to note that these losses are only &#8216;unrealized&#8217; and turn &#8216;real&#8217; only when the Bitcoin is sold. While a high number of addresses in loss might initially signal negativity, they can also indicate potential price recovery as these addresses might be waiting for prices to bounce back. Bitcoin Addresses With Smaller Holdings On The Rise In contrast to the increasing number of addresses in loss, Glassnode reports that the number of Bitcoin addresses with 0.01+ coins has attained a new all-time high (ATH) of 12.2 million. This suggests a broadening distribution of Bitcoin among retail investors, perhaps indicative of an increasing acceptance and adoption of the cryptocurrency. Adding another dimension to the market&#8217;s mixed signals, the number of non-zero Bitcoin addresses has also reached an all-time high of 47.9 million. This growth underscores the expanding base of Bitcoin holders, reflecting the coin&#8217;s widespread global adoption. Related Reading: Why This Billionaire Continues To Advocate For Bitcoin Amid Surging US Debt? While these trends unravel, BTC’s price has found itself in a rebound after a decline of nearly 5% in the past month. Particularly, the asset has seen a slight increase of 0.2% in the past 24 hours bringing its current price to trade at $29,375 after trading below the $29,000 mark earlier today.  BTC&#8217;s market capitalization has also recorded more than $6 billion in loss in just the past week. The asset market cap has plunged from a high of $575 billion earlier last week to a current cap of $568 billion. Interestingly, Bitcoin&#8217;s trading volume has traced quite a contrasting path over the same period. Instead of following the trend of the recent falling BTC price, trading volume has been on a slight uptrend. Last week, the trading volume was stuck at $10 billion. However, in stark contrast to the price trend, this volume experienced a surge, peaking at $13 billion in just the past 24 hours. This suggests a heightened market activity, despite the dwindling Bitcoin price. Featured image from iStock, Chart from TradingView"
  }
]