[
  {
    "source": "Cointelegraph",
    "date": "2024-01-12T21:53:29.000Z",
    "title": " Venezuela’s unlucky petro coin to shut down Jan. 15 after six years: Report ",
    "url": "https://cointelegraph.com/news/venezuela-petro-coin-shut-down-jan-15-after-six-years-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZTgxYzViZmQtMjQwMy00NzQ2LTljYzAtYzQxMzc3NWQzNTI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto, intended as a blow against U.S. sanctions, was never accepted at home or abroad and was crippled by scandal.</p>\n                    <p><p>The Venezuelan petro national cryptocurrency will cease to operate on Jan. 15, according to press <a href=\"https://www.barrons.com/news/venezuela-kills-off-petro-cryptocurrency-1e2b0317\" target=\"_blank\" rel=\"noopener nofollow\">reports</a>. The coin was created in 2018 to help the country evade United States sanctions, but was never widely used.</p><p>The shutdown of the Petro (PTR) was reportedly <a href=\"https://www.petro.gob.ve/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on the government-run website devoted to the coin, but that website was not accessible at the time of writing. The administrative portion of the Venezuelan Patria website, reportedly the only place where the Petro <a href=\"https://www.patria.org.ve/\" target=\"_blank\" rel=\"noopener nofollow\">traded</a>, is accessible only by password.</p><p> The state-run, oil-backed crypto <a href=\"https://cointelegraph.com/news/facing-hyperinflation-venezuela-to-issue-oil-backed-cryptocurrency\">was launched after the fiat bolivar</a> declined sharply under pressure from United States sanctions and after Bitcoin <a href=\"https://cointelegraph.com/news/first-bitcoinization-of-a-sovereign-state-is-happening-now\">had already gained a firm foothold</a> in the country. The issuance of the petro was ordered by the strongman president Nicolas Maduro, but <a href=\"https://cointelegraph.com/news/venezuela-parliament-calls-presidents-59-bln-petro-cryptocurrency-new-fraud\">opposed by the parliament</a>. </p><p><a href=\"https://cointelegraph.com/news/venezuela-petro-coin-shut-down-jan-15-after-six-years-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-12T21:48:32.000Z",
    "title": " Wise Lending drained of $440K worth of crypto in apparent flash loan exploit ",
    "url": "https://cointelegraph.com/news/wise-lending-drained-440k-crypto-apparent-flash-loan-exploit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOWJmNmQ5OGYtMTNlMi00M2RmLThkMTQtNWFjNzM2YTBiOTAwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The attacker used an unverified contract to borrow 1,100 Lido Staked Ether, which may have been used to manipulate prices and drain funds from the protocol.</p>\n                    <p><p>Web3 lending app and yield aggregator Wise Lending was drained of 170 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth $440,000 at current prices, in an apparent exploit on Jan. 12, according to multiple security experts. The exploiter may have manipulated an oracle price through a flash loan in order to carry out the exploit.</p><p>Blockchain data shows that the attack <a href=\"https://etherscan.io/tx/0x04e16a79ff928db2fa88619cdd045cdfc7979a61d836c9c9e585b3d6f6d8bc31\" target=\"_blank\" rel=\"noopener nofollow\">took</a> place at 07:29 pm UTC. The attacker used an unverified contract with an address ending in d82c to drain the funds. Multiple tokens were <a href=\"https://etherscan.io/address/0x91c49cc7fbfe8f70aceeb075952cd64817f9d82c#tokentxns\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> into this contract, including $9,000 worth of USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>), $2,000 worth of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), $5,000 worth of DAI, 18.51 Wrapped Ether (WETH) ($47.694), and numerous Pendle Finance associated tokens.</p><p>The attacker borrowed 1,110 Lido Staked Ether (stETH) tokens ($2.9 million) from AAVE lending protocol as part of the exploit. Exploiters often use flash loans to manipulate oracle prices.</p><p><a href=\"https://cointelegraph.com/news/wise-lending-drained-440k-crypto-apparent-flash-loan-exploit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T21:50:07.000Z",
    "title": "Filecoin Price Prediction 2024-2033: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2024-2033 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $5.80, with a 24-hour trading volume of $101,148,403. Filecoin decreased by 2.32% in the last 24 hours. The current CoinMarketCap ranking is #30, with a market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and the max. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T22:00:01.000Z",
    "title": "Bitcoin’s Rollercoaster: Surges Then Faces Sudden Dip As Options Expiry Looms",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoins-rollercoaster-surges-then-faces-sudden-dip-as-options-expiry-looms/",
    "description": "According to Crypto trader Mags, Bitcoin, the flagship cryptocurrency, has recently demonstrated a notable +55% surge, breaking out from a smaller broadening wedge pattern. Mags shared insights on this significant price movement, observing Bitcoin’s breakout and suggesting a mid-term target at the &#8220;upper trendline resistance of a larger broadening wedge.&#8221; This surge notably results from several catalysts in play, such as the surging interest of institutional investors and the US approval of spot Bitcoin Exchange-Traded Funds (ETFs). Related Reading: Bitcoin Price Struggles Below $48K, Why BTC Could Correct Lower Upcoming Options Expiry Impact&#8217;s Bitcoin Price However, Bitcoin has seen a slight downturn following its recent surge over the past 24 hours. Despite being significantly up over the past month, the asset has declined by nearly 10% in the past day, with its current trading volume slightly decreasing to $44 billion from over $50 billion yesterday. This sudden dip can largely be attributed to the imminent expiration of options. According to the options trading platform Greeks.live, a substantial 36,000 BTC options are set to expire soon, featuring a Put Call Ratio of 0.9. Notably, the &#8216;Put Call Ratio&#8217; serves as a sentiment indicator, assessing the market mood by comparing the volume of put options to call options. It is calculated by dividing the number of traded put options by the number of traded call options. Put options grant the holder the right (but not the obligation) to sell a specified amount of an underlying asset at a predetermined price within a specific timeframe. Conversely, call options allow the holder the right (but not the obligation) to buy a specified amount of an underlying asset at a set price within a specific timeframe. The Put Call Ratio is interpreted in two ways: a high ratio (greater than 1) and a low ratio (less than 1). A low ratio suggests more call options are being bought than put options, indicating bullish market sentiment as more traders expect the market to rise. Conversely, a high ratio indicates that more put options are being bought than call options, suggesting bearish market sentiment as more traders anticipate a market decline. Jan12 Options Data 36,000 BTC options are about to expire with a Put Call Ratio of 0.9, a Maxpain point of $45,000 and a notional value of $1.68 billion. 262,000 ETH options are due to expire with a Put Call Ratio of 0.64, a Maxpain point of $2,400 and a notional value of $680… pic.twitter.com/LSKNGKVjrH — Greeks.live (@GreeksLive) January 12, 2024 With Bitcoin&#8217;s Put Call Ratio currently at 0.9, as reported by Greeks.live, it implies that traders are leaning towards a bearish move for Bitcoin. This anticipated decline may contribute to Bitcoin&#8217;s current dip, despite the recent commencement of spot Bitcoin ETF trading in the US. Bitcoin&#8217;s Bullish Potential Despite the current dip, market analysts suggest this downturn might be short-lived. As highlighted by crypto trader Mags, the breakout from a smaller broadening wedge pattern signifies a bullish sentiment in the short term. The +55% surge marks a recovery from previous lows and prepares the stage for a potential ascent toward the upper trendline of a larger broadening wedge. Such a pattern hints that Bitcoin could be primed for further substantial price movements shortly. Additionally, the &#8216;Max Pain&#8217; point, as identified by Greeks.live, is currently pegged at $45,000 for Bitcoin, holding a total notional value of $1.68 billion. This point, where option holders face the most financial loss, is a critical indicator of the market&#8217;s potential direction. Related Reading: PlanB’s Triple Bitcoin Forecast: A Pre-Halving Surge, Post-ETF Rally, And Monumental Peak Ahead According to Greeks.live’s analysis, the nearing expiry of 36,000 BTC options implies that the market is poised for significant movements. In anticipation of these dynamics, Greeks.live reported a shift in trading strategies has been observed, with a growing emphasis on &#8216;LONG GAMMA&#8217; approaches. Featured image from Unsplash, Chart from TradingView"
  }
]