[
  {
    "source": "Decrypt",
    "date": "2023-08-21T14:26:09.000Z",
    "title": "ETH Linked to Ethereum ICO Participant, Vitalik Buterin Are on the Move",
    "url": "https://decrypt.co/153184/eth-linked-ethereum-ico-participant-vitalik-buterin-are-move",
    "description": "Roughly $1.3 million in Ethereum between an eight-year-old address and Vitalik Buterin has bought up altcoins or been sent to Coinbase."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T14:15:54.000Z",
    "title": "Bitcoin speculators are underwater on 88% of their BTC bags — Research",
    "url": "https://cointelegraph.com/news/bitcoin-speculators-underwater-btc-bags-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/51ec7c88-b18f-49d8-84b3-c17da5a18441.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A tale of two types of Bitcoin investor emerges, as BTC price action separates \"sensitive\" speculators from seasoned hodlers.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) holdings owned by speculators are nearly 90% in the red after the “flash crash” to $26,000, new research says.</p><p>In the latest edition of its weekly newsletter, “<a href=\"https://insights.glassnode.com/the-week-onchain-week-34-2023/\" target=\"_blank\" rel=\"noopener nofollow\">The Week On-Chain</a>,” analytics firm Glassnode reveals the true cost of last week’s BTC price dip to newcomers.</p><h2>Short-term holders \"increasingly sensitive\" to BTC price</h2><p>While only totalling around 10%, the drop on BTC/USD seen toward the end of last week upended market sentiment.</p><p>As BTC price predictions <a href=\"https://cointelegraph.com/news/how-low-can-the-bitcoin-price-go\">focus on $25,000 and even lower</a>, the dust is settling on a trading environment accustomed to months of sideways behavior.</p><p>Arguably nowhere is this more visible than among short-term holders (STHs) — the more speculative end of the hodler spectrum.</p><p>Glassnode defines an STH as an entity holding onto BTC for 155 days or less. Its counterpart is the long-term holder (LTH), more widely referred to as a classic “hodler.”</p><p>“Out of the 2.56M BTC held by STHs, only 300k BTC (11.7%) is still in profit,” the research states.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/54cb3ef5-5689-4b52-b3fd-2e783c7fa778.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin STH supply profit and loss chart (screenshot). Source: Glassnode</em></figcaption></figure><p>As Cointelegraph reported, the overall share of the BTC supply <a href=\"https://cointelegraph.com/news/bitcoin-speculators-btc-since-69k-all-time-highs\">in the hands of STHs is at multi-year lows</a>. That said, the past week has dramatically reshaped profitability among the cohort, which <a href=\"https://cointelegraph.com/news/btc-price-metric-warns-bitcoin-sell-33k\">previously functioned as a framework</a> for the BTC trading range.</p><p>The STH aggregate breakeven point, known as realized price, currently sits above $28,500.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/363e1aa8-7c11-492b-9733-77e179c6e57c.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin STH/LTH cost basis (realized price) chart. Source: Glassnode</em></figcaption></figure><p>Analyzing the proportion of exchange inflows originating from STH entities in profit and loss, respectively, Glassnode predictably warns that the cohort was becoming increasingly “sensitive” to market movements.</p><p>“We can see a steady decline in profit dominance as the 2023 rally progressed, as more STHs acquired coins with an increasingly elevated cost basis,” it reveals. </p><blockquote>“This week we saw the largest loss dominance reading since the March sell-off to $19.8k. This suggests that the STH cohort are both largely underwater on their holdings, and increasingly price sensitive.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/12723123-b390-4a3b-b5fb-f7091b323f44.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin STH volume to exchanges bias ratio chart (screenshot). Source: Glassnode</em></figcaption></figure><h2>Seasoned hodlers' BTC supply share hits new peak</h2><p>By contrast, the LTH investor base has yet to exhibit any marked reaction to the return to $26,000 and below.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/btc-price-fear-svb-5-things-bitcoin-this-week\">Most fear since SVB collapse — 5 things to know in Bitcoin this week</a></em></strong></p><p>“If we look to the response by Long-Term Holders (LTHs), we can see that there is almost no response,” Glassnode confirms. </p><blockquote>“The LTH cohort did not meaningfully increase volume sent to exchanges, and their aggregate balance actually ticked up to a new ATH this week.”</blockquote><p>An accompanying chart showing LTH exchange inflows describes these as “negligible.”</p><p>“Long-Term Holders remain largely unfazed and unresponsive, which is a typical behavior pattern of this cohort during bear market hangover periods,” “The Week On-Chain” concludes. </p><blockquote>“Short-Term Holders however are of greater interest, with 88.3% of their held supply (2.26M BTC) now held at an unrealized loss. This is compounded by an acceleration in STH realized losses being sent to exchanges, as well as the loss of key technical moving average support, putting the bulls on the back-foot.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ecac7c99-0cee-4f70-86af-67309c8ef7f2.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin % LTH balance sent to exchanges chart (screenshot). Source: Glassnode</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T14:12:36.000Z",
    "title": "PayPal’s new PYUSD stablecoin faces legal headwinds and ‘less functionality’ ",
    "url": "https://cointelegraph.com/news/paypal-new-stablecoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/73e98a3d-be03-49bb-8449-acb5aea58429.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Industry experts explain the benefits and disadvantages of PayPal’s PYUSD stablecoin. </p>\n                    <p><p>Although a clear regulatory framework for digital assets has yet to be established in the United States, PayPal — one of America’s largest financial technology companies — announced on Aug. 7 its U.S. dollar-pegged payment stablecoin, <a href=\"https://cointelegraph.com/explained/what-is-paypal-usd-and-how-does-it-work\">PayPal USD (PYUSD)</a>. </p><p>A PayPal spokesperson told Cointelegraph that PYUSD is important because mainstream adoption of future digital experiences will require a stable digital instrument that is crypto-native and easily connected to fiat. Despite the unclear regulatory environment for digital assets in the U.S., the spokesperson said:</p><blockquote>“Our experience tells us that the time is ripe to modernize and upgrade the technological infrastructure of the financial system — and we want to help businesses and consumers adapt and engage. That is why we are launching a PayPal stablecoin, which is designed to eliminate price volatility found in other digital currencies while enabling confident payments.”</blockquote><p>The case for PayPal’s ability to affect stablecoin adoption with its new project is strong, as recent statistics <a href=\"https://fortunly.com/statistics/paypal-statistics/\" target=\"_blank\" rel=\"noopener nofollow\">show</a> that over 426 million PayPal accounts are currently actively used. The company also has a market share of just over 50% of the global online payment processing arena.</p><h2>Understanding the potential impact of PYUSD</h2><p>While it’s certainly notable that PayPal has launched PYUSD, there are several considerations to keep in mind.</p><p>Alex Tapscott, the co-founder of the Blockchain Research Institute and a business author, told Cointelegraph that PayPal clearly understands that stablecoins will be foundational to the future of financial services and payments in particular. He said stablecoins have already proven incredibly lucrative as a business:</p><blockquote>“It’s no surprise why <a href=\"https://fortune.com/company/paypal-holdings/\" target=\"_blank\" rel=\"noopener nofollow\">PayPal</a> and others might want to enter the market. PayPal is currently facing stiffer competition in its legacy payments business and is looking for ways to diversify into higher-margin areas. Stablecoins are a logical fit, and potentially a lucrative one at a time when Tether’s recent earnings report suggests that it’s poised to post a bigger profit than <a href=\"https://fortune.com/company/starbucks/\" target=\"_blank\" rel=\"noopener nofollow\">Starbucks</a>, BlackRock — and even PayPal itself.”</blockquote><p>However, there are both advantages and disadvantages that will likely arise with PYUSD. One of the most obvious benefits is that PYUSD may <a href=\"https://cointelegraph.com/news/paypal-stablecoin-crypto-adoption\">help onboard mainstream users to the Web3 space</a>.</p><p>“The biggest advantage of PYUSD is that it is more likely to get integrated into our digital economy as a payments tool that everyday people can use,” said Tapscott. </p><p>To put this in perspective, Pegah Soltani, head of payments products at Ripple, told Cointelegraph that stablecoins serve as a mechanism to tokenize fiat currencies, like the U.S. dollar. </p><p>“By tokenizing a real-world asset — in this instance, fiat — stablecoins serve to expand the crypto ecosystem because these assets allow the trades or payments in the crypto economy to tie back to fiat,” she said.</p><p>However, Soltani noted that PayPal being a closed payments ecosystem may only improve efficiencies for itself: “This may not be groundbreaking for consumers who already experience relatively low fees and fast transaction times when transacting within the PayPal ecosystem of applications.” </p><p>On the flip side, Soltani said that if PayPal incentivizes its users to use PYUSD outside of its own ecosystem, it’s possible that the stablecoin will gain more market share relatively quickly. Although PYUSD just recently launched, some global cryptocurrency exchanges, <a href=\"https://cointelegraph.com/press-releases/paypal-usd-pyusd-will-soon-be-available-on-changelly\">like Changelly</a>, have stated that they will list it.</p><p>It’s also important to note that millions of users trust PayPal for financial transactions. Soltani mentioned that one of the potential pitfalls of a stablecoin is that it’s not a trustless system. </p><p>“It requires the purchaser to trust the issuer to ensure that their money is actually being backed 1:1. Because PayPal is a well-known brand name, there’s potential for more perceived trust for those who are entering this space for the first time,” she explained. </p><p>While all these aspects are noteworthy, it shouldn’t come as a surprise that one of the biggest concerns surrounding PYUSD is the lack of regulatory clarity for digital assets in the United States.</p><p>“PayPal chose a very interesting time to launch a stablecoin, given the lack of regulatory clarity around crypto and the challenges that presents for the entire crypto space,” said Soltani.</p><p>The issuance and custody of PYUSD are handled by Paxos, a qualified custodian regulated by the New York State Department of Financial Services. Margaret Rosenfeld, chief legal officer at Cube Exchange — a digital asset exchange set to launch in Australia — told Cointelegraph this means the assets are required to be held in a bankruptcy-remote trust, in fully segregated accounts. “Paxos, not PayPal, is holding the assets backing the stablecoin,” she said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we’re unveiling a new stablecoin, PayPal USD (PYUSD). It’s designed for payments and is backed by highly liquid and secure assets. Starting today and rolling out in the next few weeks, you’ll be able to buy, sell, hold and transfer PYUSD. Learn more <a href=\"https://t.co/53RRBhmNHx\">https://t.co/53RRBhmNHx</a> <a href=\"https://t.co/53ur2KmjU7\">pic.twitter.com/53ur2KmjU7</a></p>&mdash; PayPal (@PayPal) <a href=\"https://twitter.com/PayPal/status/1688552795278872576?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Rosenfeld further said that while Paxos <a href=\"https://cointelegraph.com/news/paxos-is-engaged-in-constructive-discussions-with-sec-report\">received a Wells notice</a> from the U.S. Securities and Exchange Commission in February 2023 in relation to the Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>) stablecoin, it’s notable that a veteran fintech firm like PayPal still has a partnership with Paxos. </p><p>“This demonstrates the strong headwinds of traditional finance adoption of digital assets in the United States. This becomes important as U.S. banks continue to be pressured by federal regulators about avoiding the so-called risks of digital assets,” she remarked.</p><p>Regulations aside, Tapscott believes that PayPal faces an additional disadvantage with PYUSD due to other stablecoins that launched much earlier. “Initially, PYUSD will have lower liquidity and less functionality than more established peers. Tether and Circle together control nearly 100% of the market, and Tether, in particular, is dominant at nearly 80%,” he said.</p><p>Moreover, the fact that PYUSD is based on the <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency\">Ethereum network</a> for transactions may also be concerning.</p><p>Mark Heynen, vice president of business development at the Stellar Development Foundation, told Cointelegraph that while incredibly popular, Ethereum is not fundamentally a network built for payments. </p><p>“Cost and scalability could end up being distractions in PayPal’s quest toward adoption,” he said.</p><p>Given this, Soltani remarked that it would be interesting for PayPal to issue its stablecoin on multiple chains moving forward.</p><h2>PayPal bullish on blockchain technology and digital assets</h2><p>While it’s too soon to fully understand the impact PYUSD will have on the Web3 ecosystem, one thing remains certain: PayPal will continue to innovate. The company’s spokesperson said:</p><blockquote>“We will continue to deliver the products and services necessary to improve financial health and expand economic opportunity in the new digital era. This includes the new capabilities enabled by digital assets using blockchain technology, including digital currencies and stablecoins.”</blockquote><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T14:18:43.000Z",
    "title": "\n                        ApeCoin and VeChain Whales Are Switching to Pomerdoge After 17x Spike Prediction\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/apecoin-and-vechain-whales-are-switching-to-pomerdoge-after-17x-spike-prediction",
    "description": "\n                        <p class=\"s4\">Investors and traders are consistently on the lookout for high-growth cryptocurrencies. Whale movements typically indicate that an altcoin could potentially get a significant level of attention or spike in value in the future. Recently, whales behind the ApeCoin (APE) and VeChain (VET) cryptocurrencies began accumulating Pomerdoge (POMD)..</p>\nSummary\n● ApeCoin decreased in value by 69.6% during the year\n● VeChain is down 9.3% in the past 30 days\n● Pomerdoge (POMD) attracts whale attention with potential 17x spike\n<p>Click Here To Find Out More About The Pomerdoge (POMD) Presale</p>\nApeCoin (APE) Price Movement\n<p class=\"s4\">As of August 14, 2023, the ApeCoin (APE) cryptocurrency traded at a value of $2.08. During the past week, its low point was at $1.79, with its high point at $2.10.</p>\n<p class=\"s4\">Moreover, the ApeCoin crypto had a market cap of $769,172,736 and a 24-hour trading volume of $143,182,381. In the past week, its price increased by 12.1%.</p>\n<p class=\"s4\">However, during the past year, the ApeCoin price decreased by 69.6%, and this worried investors. As a result, many whales began diversifying from the cryptocurrency. In any case, according to the ApeCoin price prediction, it is expected to reach $2.32 by the end of the year.</p>\nVeChain (VET) Price Prediction\n<p class=\"s4\">Then there's VeChain (VET), a competing project that was also initially accumulated by whales. As of August 14, 2023, It trades at $0.01834331. In addition, during the past week, the low point for VeChian was at $0.01740241, while the high point was at $0.01834902.</p>\n<p class=\"s4\">The overall VeChain crypto market cap was at $1,333,631,743, with its 24-hour trading volume at $34,511,656. As of recently, it showcased a bearish performance, as in the past 30 days, it's down 8.3%.</p>\n<p class=\"s4\">It did attempt to recover in the past week with a 3.1% increase, but its decrease has been higher. According to the VeChain price prediction, it can reach $0.023 by the end of the year.</p>\nPomerdoge (POMD) to Spike 17x\n<p class=\"s4\">With the recent bearish performance behind ApeCoin and VeChain, whales began to diversify. The main cryptocurrency they've switched to is Pomerdoge (POMD). It's a unique ecosystem that combines the best elements of meme-coins and the Play-to-Earn (P2E) sector to provide an innovative experience.</p>\n<p class=\"s4\">There are three main components behind it, including Pomergame, Pomerplace, and an NFT collection. Pomergame is a virtual world where players can explore and finish objectives in order to get virtual rewards or items of value. They are rewarded for their time committed to the game. Each player has a character called a Pomer.</p>\n<p class=\"s4\">Once a Pomer reaches gold status, it can then enable them to enter the Pomerplace. This is the dedicated marketplace in which anyone can buy, sell or trade valuables. However, it also features an Arena where players can compete. Subsequently, there's a 7,777 NFT collection, where anyone who holds the POMD token can buy each NFT for 0.2 ETH.</p>\n<p class=\"s4\">During the early presale period, Pomerdoge (POMD) trades at just $0.008. However, analysts are bullish on its future and predict that it can spike in value by 17x at launch. &nbsp;</p>\n<p class=\"s15\">Find out more about the Pomerdoge (POMD) Presale Today</p>\n<p class=\"s15\">Website: https://pomerdoge.com/</p>\n<p class=\"s15\">Telegram Community: https://t.me/pomerdoge</p>\n<p class=\"s15\">&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T14:13:00.000Z",
    "title": "\n                        Digital Art and NFT Platform o-mee Public Sale is live on GemPad\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/digital-art-and-nft-platform-o-mee-public-sale-is-live-on-gempad",
    "description": "\n                        <p dir=\"ltr\">The public sale of o-mee is live exclusively on GemPad since 21st August 2023 at 10:00 UTC, and will end on 25th August 2023, 23:59 UTC.</p>\n<p dir=\"ltr\">The Polygon based cutting edge creator friendly NFT marketplace is dedicated to creating real life initiatives for artists. The goal of the platform is to provide a marketplace that drives sociability and creativity for artists, designers, influencers and content providers who can upload, create, share and sell their artwork, all in one place.</p>\n<p dir=\"ltr\">The following details can guide community members and cryptocurrency investors to participate in the initial dex offering for o-mee.&nbsp;</p>\n<p dir=\"ltr\">Launch Price: $0.05c&nbsp;</p>\n<p dir=\"ltr\">Initial Market Cap: $800,000</p>\n<p dir=\"ltr\">*calculated excluding liquidity pool&nbsp;</p>\n<p dir=\"ltr\">Click here to participate in GemPad&rsquo;s special sale for o-mee&nbsp;</p>\n\n<p dir=\"ltr\">o-mee co-founder Jared Walker said o-mee&rsquo;s public sale on GemPad was &ldquo;yet another successful milestone&rdquo; for the company, and another step towards &ldquo;mass adoption and seamless integration of blockchain technology in real life&rdquo;</p>\n\n<p dir=\"ltr\">The o-mee token fuels the entire platform and its ecosystem, with utilities ranging from buying and selling, advertising, staking, gifting, lottery tickets, NFT booster packs, and future developments such as direct staking to creators&rsquo; profiles. o-mee empowers users and enhances their experiences within the platform.&nbsp;</p>\n<p dir=\"ltr\">After a successful private sale, the announcement on GemPad seemed to excite a lot of investors as it being one of the premier launchpads and incubators within the Web3 and blockchain ecosystem. Web3 launchpads and incubators are focused on empowering innovators and developers through funding, partnerships and ecosystem growth to help bring companies to its community and to the mass market.&nbsp;</p>\n\n<p>&nbsp;</p>\n<p dir=\"ltr\">&ldquo;We firmly believe in giving creators the control over their own creations. This is an exciting step in our journey, the token launch. It will open a network of possibilities for our community, ones that we have been working so much for,&rdquo; said Jared Walker, CEO and Co-founder of o-eee in a statement. &ldquo;We&rsquo;re thrilled to continue offering artists and communities with opportunities that bridge the gaps between Web2 and Web3 ecosystems&rdquo; continued Jared.</p>\n\n<p>&nbsp;</p>\n<p dir=\"ltr\">The company aims to establish a space that not only democratises access to the Web3 landscape but also enhances the intrinsic social and economic value that creators bring to the table. In the spirit of innovation and exclusivity, o-mee is challenging conventional norms in the secondary market by redefining the archaic percentage-based commission structure. Jared and the o-mee team commented on the company&rsquo;s future launch with progressive development such as the o-mee blockchain network, NFT trading views, gamifications and more!</p>\n<p dir=\"ltr\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-21T14:30:31.000Z",
    "title": "As Ordinal Transaction Dominance Soars, NFT Advocates Question Bitcoin’s Reported Downturn",
    "url": "https://news.bitcoin.com/as-ordinal-transaction-dominance-soars-nft-advocates-question-bitcoins-reported-downturn/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"As Ordinal Transaction Dominance Soars, NFT Advocates Question Bitcoin’s Reported Downturn\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ffffddd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Metrics reveal a significant day for the Bitcoin blockchain as 411,511 Ordinal inscriptions were minted Sunday, clinching the title of the second most prolific day for inscriptions ever. Additionally, over the past seven days, Ordinal inscriptions represented a hefty 53.9% of all transaction activity on the Bitcoin network. Ordinals&#x2019; Unprecedented Impact: 53% of Bitcoin&#x2019;s Weekly [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-21T14:30:13.000Z",
    "title": "Binance support hints at euro transfer and withdrawal issues",
    "url": "https://crypto.news/binance-support-hints-at-euro-transfer-and-withdrawal-issues/",
    "description": "Binance Support account repeatedly claimed on X that the company had suspended EUR transfers until further notice. In an Aug. 21 tweet, Binance&#8217;s customer support wrote that direct bank transfer for EUR currency is in maintenance. Still, card-based deposits and&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T14:10:00.000Z",
    "title": "Vitalik Buterin Sends 600 ETH To Coinbase Amid Market Sell-off",
    "url": "https://coinedition.com/vitalik-buterin-sends-600-eth-to-coinbase-amid-market-sell-off/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Vitalik_Buterins_600_ETH_Transfer_to_Coinbase_Sparks_Sell_Off-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Vitalik Buterin, the CEO of the world’s second-largest blockchain, recently deposited 600 ETH to crypto exchange Coinbase. Buterin’s $1 million transfer came amid a sell-off in the crypto market that prompted ETH’s price to decline by nearly 10% over the past week. The crypto community expressed concerns, given that such transactions are likely followed by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/vitalik-buterin-sends-600-eth-to-coinbase-amid-market-sell-off/\">Vitalik Buterin Sends 600 ETH To Coinbase Amid Market Sell-off</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T14:30:31.000Z",
    "title": "US Banking Industry Could Take Massive Hit To Stock Prices in Coming Months, Says Macro Guru Hugh Hendry",
    "url": "https://dailyhodl.com/2023/08/21/us-banking-industry-could-take-massive-hit-to-stock-prices-in-coming-months-says-macro-guru-hugh-hendry/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-deposit-flight-returns.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The US banking industry could see its stock prices plummet within the next 16 months, according to macro guru Hugh Hendry. In a new interview with Kitco News, the former chief investment officer of hedge fund Eclectica Asset Management says that US banking stocks could witness a deep devaluation if the economy goes through a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/us-banking-industry-could-take-massive-hit-to-stock-prices-in-coming-months-says-macro-guru-hugh-hendry/\">US Banking Industry Could Take Massive Hit To Stock Prices in Coming Months, Says Macro Guru Hugh Hendry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]