[
  {
    "source": "CoinDesk",
    "date": "2023-11-09T14:17:09.000Z",
    "title": "First Mover Americas: Bitcoin Climbs to Almost $37K",
    "url": "https://www.coindesk.com/markets/2023/11/09/first-mover-americas-bitcoin-climbs-to-almost-37k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Nov. 9, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T14:30:00.000Z",
    "title": "Train AI models to sell as NFTs, LLMs are Large Lying Machines: AI Eye",
    "url": "https://cointelegraph.com/magazine/train-kickass-ai-model-sell-nfts-llms-are-largely-lying-machines-ai-eye/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-AI-Eye-3008-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Train up kickass AI models to sell them as NFTs in AI Arena, how often GPT-4 lies to you, and fake AI pics in the Israel/Gaza war: AI Eye.</p>\n                    <p><h2 class=\"wp-block-heading\" id=\"h-ai-arena\">AI Arena</h2><p>AI Eye chatted with Framework Ventures Vance Spencer recently and he raved about the possibilities offered by an upcoming game his fund invested in called AI Arena in which players train AI models how to battle each other in an arena.<br><br>Framework Ventures was an early investor in Chainlink and Synthetix and <a href=\"https://cointelegraph.com/magazine/passed-peak-corporation-already-michael-anderson-framework-ventures/\" target=\"_blank\" rel=\"nofollow\" >three years ahead of NBA Top Shots</a> with a similar NFL platform, so when they get excited about the future prospects, its worth looking into.</p><p>Also backed by Paradigm, AI Arena is like a cross between Super Smash Brothers and Axie Infinity. The AI models are tokenized as NFTs, meaning players can train them up and flip them for profit or rent them to noobs. While this is a gamified version, there are endless possibilities involved with crowdsourcing user-trained models for specific purposes and then selling them as tokens in a blockchain-based marketplace.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/AI-arena.jpg\" alt=\"AI Arena\" class=\"wp-image-25336\" width=\"726\" height=\"411\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/AI-arena.jpg 998w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/AI-arena-300x170.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/AI-arena-770x436.jpg 770w\" sizes=\"(max-width: 726px) 100vw, 726px\" /><figcaption class=\"wp-element-caption\"><em>Screenshot from AI Arena </em></figcaption></figure><p>Probably some of the most valuable assets on-chain will be tokenized AI models; thats my theory at least, <a href=\"https://cointelegraph.com/magazine/ai-eye-real-ai-usecases-crypto-gemini-gpt-4-rival-roblox-assistant-ai-cheating/\" target=\"_blank\" rel=\"nofollow\" >Spencer predicts</a>.</p><p>AI Arena chief operating officer Wei Xi explains that his cofounders, Brandon Da Silva and Dylan Pereira, had been toying with creating games for years, and when NFTs and later AI came out, Da Silva had the brainwave to put all three elements together. </p><p>“Part of the idea was, well, if we can tokenize an AI model, we can actually build a game around AI, says Xi, who worked alongside Da Silva in TradFi. The core loop of the game actually helps to reveal the process of AI research.”</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/crypto-folk-are-obsessed-with-life-extension-heres-why/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Crypto leaders are obsessed with life extension. Here’s why</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/tokenomics-manipulation-incentives-surprises/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Tokenomics not Ponzi-nomics: Influencing behavior, making money</p>                        </a>                    </div></div></div><p>There are three elements to training a model in AI Arena. The first is demonstrating what needs to be done  like a parent showing a kid how to kick a ball. The second element is calibrating and providing context for the model  telling it when to pass and when to shoot for goal. The final element is seeing how the AI plays and diagnosing where the model needs improvement.   </p><blockquote class=\"wp-block-quote\"><p>“So the overall game loop is like iterating, iterating through those three steps, and you’re kind of progressively refining your AI to become this more and more well balanced and well rounded fighter.”</p></blockquote><p>The game uses a custom-built feed forward neural network and the AIs are constrained and lightweight, meaning the winner wont just be whoevers able to throw the most computing resources at the model.</p><p>“We want to see ingenuity, creativity to be the discerning factor,” Xie says. </p><p>Currently in closed beta testing, AI Arena is targeting the first quarter of next year for mainnet launch on Ethereum scaling solution Arbitrum. There are two versions of the game: One is a browser-based game that anyone can log into with a Google or Twitter account and start playing for fun, while the other is blockchain-based for competitive players, the “esports version of the game.”<br><br><strong>Also read: <em><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\" target=\"_blank\" rel=\"nofollow\" >Exclusive  2 years after John McAfees death, widow Janice is broke and needs answers</a></em></strong></p><p>This being crypto, there is a token of course, which will be distributed to players who compete in the launch tournament and later be used to pay entry fees for subsequent competitions. Xie envisages a big future for the tech, saying it can be used in a first-person shooter game and a soccer game, and expanded into a crowdsourced marketplace for AI models that are trained for specific business tasks.</p><p>“What somebody has to do is frame it into a problem and then we allow the best minds in the AI space to compete on it. Its just a better model.”</p><figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube\"><div class=\"wp-block-embed__wrapper\"><iframe loading=\"lazy\" title=\"AI Arena Gameplay Teaser\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/uDkSUNgbM1Y?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div></figure><h2 class=\"wp-block-heading\" id=\"h-chatbots-can-t-be-trusted\"><strong>Chatbots cant be trusted</strong></h2><p>A new analysis from AI startup Vectara shows that the output from large language models like ChatGPT or Claude simply <a href=\"https://www.nytimes.com/2023/11/06/technology/chatbots-hallucination-rates.html\" target=\"_blank\" rel=\"nofollow\" >can’t be relied upon</a> for accuracy.<br><br>Everyone knew that already, but until now there was no way to quantify the precise amount of bullshit each model is generating. It turns out that GPT-4 is the most accurate, inventing fake information around just 3% of the time. Metas Llama models make up nonsense 5% of the time while Anthropics Claude 2 system produced 8% bullshit.</p><p>Googles PaLM hallucinated an astonishing 27% of its answers.</p><p>Palm 2 is one of the <a href=\"https://www.theverge.com/2023/5/10/23717120/google-search-ai-results-generated-experience-io\" target=\"_blank\" rel=\"nofollow\" >components</a> incorporated into Googles Search Generative Experience, which highlights useful snippets of information in response to common search queries. Its also unreliable.<br><br>For months now, if you ask Google for an African country beginning with the letter K, it shows the following snippet of totally wrong information: </p><p>“While there are 54 recognized countries in Africa, none of them begin with the letter ‘K’. The closest is Kenya, which starts with a ‘K’ sound, but is actually spelled with a ‘K’ sound.”</p><p>It turns out Googles AI got this from a ChatGPT answer, which in turn traces back to a Reddit post, which was just a gag set up for this response:</p><p>“Kenya suck on deez nuts lmaooo.”</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/deeznutz-1024x505.jpg\" alt=\"Deez nuts\" class=\"wp-image-25337\" width=\"758\" height=\"374\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/deeznutz-1024x505.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/deeznutz-300x148.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/deeznutz-770x380.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/deeznutz-1536x757.jpg 1536w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/deeznutz.jpg 1769w\" sizes=\"(max-width: 758px) 100vw, 758px\" /><figcaption class=\"wp-element-caption\"><em>Screenshot from r/teenagers subreddit (Spreekaway Twitter)</em></figcaption></figure><p>Google rolled out the experimental AI feature earlier this year, and recently users started reported it was shrinking and even disappearing from many searches.<br><br>Google may have just been refining it though, as this week the feature rolled out to 120 new countries and four new languages, with the ability to ask follow-up questions right on the page. </p><h2 class=\"wp-block-heading\" id=\"h-ai-images-in-the-israel-gaza-war\"><strong>AI images in the Israel-Gaza war</strong></h2><p>While journalists have done their best to hype up<a href=\"https://www.rollingstone.com/politics/politics-features/israel-hamas-misinformation-fueled-ai-images-1234863586/\" target=\"_blank\" rel=\"nofollow\" > the issue</a>, AI-generated images havent played a huge role in the war, as the real footage of Hamas atrocities and dead kids in Gaza is affecting enough.<br><br>There are examples, though: 67,000 people saw an AI-generated image of a toddler staring at a missile attack with the caption This is what children in Gaza wake up to.”  Another pic of three dust-covered but grimly determined kids in the rubble of Gaza holding a Palestinian flag was shared by Tunisian journalist Muhammad al-Hachimi al-Hamidi.<br></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is what children in Gaza wake up to  <a href=\"https://t.co/P7afsikqxR\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/P7afsikqxR</a></p><p> Palestine Culture (@PalestineCultu1) <a href=\"https://twitter.com/PalestineCultu1/status/1712305841154449683?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >October 12, 2023</a></p></blockquote><p>And for some reason, a clearly AI-generated pic of an Israeli refugee camp with an enormous Star of David on the side of each tent was shared multiple times on Arabic news outlets in Yemen and Dubai.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Israeli-refugees.jpg\" alt=\"Israeli refugees\" class=\"wp-image-25339\" width=\"355\" height=\"495\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Israeli-refugees.jpg 575w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Israeli-refugees-215x300.jpg 215w\" sizes=\"(max-width: 355px) 100vw, 355px\" /><figcaption class=\"wp-element-caption\"><em>AI-generated pic picked up by news sites (Twitter)</em></figcaption></figure><p>Aussie politics blog Crikey.com <a href=\"https://www.crikey.com.au/2023/11/01/israel-gaza-adobe-artificial-intelligence-images-fake-news/\" target=\"_blank\" rel=\"nofollow\" >reported</a> that Adobe is selling AI-generated images of the war through its stock image service, and an AI pic of a missile strike was run as if it were real by media outlets including Sky and the Daily Star.<br><br>But the real impact of AI-generated fakes is providing partisans with a convenient way to discredit real pics. There was a major controversy over a bunch of pics of Hamass leadership living it up in luxury, which users claimed were AI fakes. <br><br>But the <a href=\"https://www.ynetnews.com/articles/0,7340,L-4548202,00.html\" target=\"_blank\" rel=\"nofollow\" >images date back to 2014 </a>and were just poorly upscaled using AI. AI company Acrete also reports that social media accounts associated with Hamas have regularly claimed that genuine footage and pictures of atrocities are AI-generated to cast doubt on them.<br><br>In some good timing, Google has just announced it’s rolling out tools that can help users spot fakes. Click on the three dots on the top right of an image and select About This Image to see how old the image is, and where its been used. An upcoming feature will include fields showing whether the image is AI generated, with Google AI, Facebook, Microsoft, Nikon and Leica all adding symbols or watermarks to AI imagery.</p><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\">Dear Palestinians, </p><p>While the leaders of Hamas are living luxurious lives enjoying good lives, they ask you to sacrifice yourselves and your children. <br />Hamas doesn’t care for the Palestinians. Hamas is the enemy of the Palestinian people.</p><p> <br />     <a href=\"https://t.co/l30I0CDLcw\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/l30I0CDLcw</a></p><p> Hananya Naftali (@HananyaNaftali) <a href=\"https://twitter.com/HananyaNaftali/status/1715416552047059366?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >October 20, 2023</a></p></blockquote><h2 class=\"wp-block-heading\" id=\"h-openai-dev-conference\"><strong>OpenAI dev conference</strong></h2><p>ChatGPT this week unveiled GPT-4 Turbo, which is much faster and can accept long text inputs like books of up to 300 pages. The model has been trained on data up to April this year and can generate captions or descriptions of visual input. For devs, the new model will be one-third the cost to access.<br><br>OpenAI is also releasing its version of the App Store, called the GPT <a href=\"https://www.cnet.com/tech/computing/openai-looks-for-its-iphone-moment-with-custom-gpt-chatbot-apps/\" target=\"_blank\" rel=\"nofollow\" >Store</a>. Anyone can now dream up a custom GPT, define the parameters and upload some bespoke information to GPT-4, which can then build it for you and pop it on the store, with revenue split between creators and OpenAI.</p><p>CEO Sam Altman demonstrated this onstage by whipping up a program called Startup Mentor that gives advice to budding entrepreneurs. <a href=\"https://x.com/LinusEkenstam/status/1721754808036766145?s=20\" target=\"_blank\" rel=\"nofollow\" >Users</a> soon followed, dreaming up everything from an AI that does the commentary for sporting events to a roast my website GPT. ChatGPT went down for 90 minutes this week, possibly as a result of too many users trying out the new features. <br><br>Not everyone was impressed, however. Abacus.ai CEO <a href=\"https://twitter.com/bindureddy/status/1721685944846450937?s=20\" target=\"_blank\" rel=\"nofollow\" >Bindu Reddy</a> said it was disappointing that GPT-5 had not been announced, suggesting that OpenAI tried to train a new model earlier this year but found it didn’t run as efficiently and therefore had to scrap it.” There are rumors that OpenAI is training a new candidate for GPT-5 called Gobi, Reddy said, but she suspects it won’t be unveiled until next year. </p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/sweden-cashless-society/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Can Crypto be Swedens Savior?</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/forget-2022-how-metaverse-bounce-back-2023/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>How to resurrect the ‘Metaverse dream’ in 2023</p>                        </a>                    </div></div></div><h2 class=\"wp-block-heading\" id=\"h-x-unveils-grok\"><strong>X unveils Grok</strong></h2><p>Elon Musk brought freedom back to Twitter  mainly by freeing lots of people from spending any time there  and hes on a mission to do the same with AI.</p><p>The beta version of Grok AI was thrown together in just two months, and while it’s not nearly as good as GPT-4, it is up to date due to being trained on tweets, which means it can tell you what Joe Rogan was wearing on his last podcast. Thats the sort of information GPT-4 simply wont tell you.</p><p>There are fewer guardrails on the answers than ChatGPT, although if you ask it how to make cocaine it will snarkily tell you to Obtain a chemistry degree and a DEA license.</p><p>The threshold for what it will tell you, if pushed, is what is available on the internet via reasonable browser search, which is a lot  says <a href=\"https://www.theaustralian.com.au/business/the-wall-street-journal/elon-musk-unveils-grok-an-ai-bot-that-combines-snark-and-lofty-ambitions/news-story/08ae7f3c4a53f766e3d89416ea2f8424\" target=\"_blank\" rel=\"nofollow\" >Musk</a>.</p><p>Within a few days, more than <a href=\"https://fortune.com/crypto/2023/11/06/elon-musk-crypto-tokens-grok-xai-openai-chatgpt/\" target=\"_blank\" rel=\"nofollow\" >400 cryptocurrencies </a>linked to GROK had been launched. One amassed a $10 million market cap, and at least ten others rugpulled. </p><h2 class=\"wp-block-heading\" id=\"h-all-killer-no-filler-ai-news\"><strong>All Killer No Filler AI News</strong></h2><p> Samsung has introduced a new generative artificial intelligence model called <a href=\"https://www.cnbc.com/2023/11/08/samsung-launches-generative-ai-model-made-for-devices.html\" target=\"_blank\" rel=\"nofollow\" >Gauss </a>that it suggests will be added to its phones and devices soon.</p><p> <a href=\"https://support.google.com/youtube/thread/242690316/testing-new-experimental-generative-ai-features\" target=\"_blank\" rel=\"nofollow\" >YouTube</a> has rolled out some new AI features to premium subscribers including a chatbot that summarizes videos and answers questions about them, and another that categorizes the comments to help creators understand the feedback. </p><p> Google DeepMind has released an <a href=\"https://arxiv.org/pdf/2311.02462.pdf\" target=\"_blank\" rel=\"nofollow\" >AGI tier list </a>that starts at the No AI level of Amazon’s Mechanical Turk and moves on to Emerging AGI, where ChatGPT, Bard and LLama2 are listed. The other tiers are Competent, Expert, Virtuoso and Artificial Superintelligence, none of which have been achieved yet. </p><p> <a href=\"https://www.reuters.com/technology/amazon-sets-new-team-trains-ambitious-ai-model-codenamed-olympus-sources-2023-11-08/\" target=\"_blank\" rel=\"nofollow\" >Amazon</a> is investing millions in a new GPT-4 rival called Olympus that is twice the size at 2 trillion parameters. It has also been testing out its new humanoid robot called Digit at trade shows. This <a href=\"https://www.youtube.com/shorts/6Kp5qrCExps\" target=\"_blank\" rel=\"nofollow\" >one fell over</a>.</p><h2 class=\"wp-block-heading\" id=\"h-pics-of-the-week\">Pics of the week</h2><p>An oldie but a goodie, Alvaro Cintas has spent his weekend coming up with AI pun pictures under the heading “Wonders of the World, Misspelled by AI”.<br></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Fun weekend experiment with DALLE 3.</p><p>Wonders of the World, misspelled by AI</p><p>1: The Great Wall of China  The Great Mall of China <a href=\"https://t.co/bmQOFB8bQS\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/bmQOFB8bQS</a></p><p> Alvaro Cintas (@dr_cintas) <a href=\"https://twitter.com/dr_cintas/status/1718647248412705182?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >October 29, 2023</a></p></blockquote><figure class=\"wp-block-gallery has-nested-images columns-default is-cropped wp-block-gallery-1 is-layout-flex\"><figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"1024\" data-id=\"25331\"  src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Loch-Ness-Monster-Energy-Drink.jpg\" alt=\"Loch Ness Monster Energy Drink\" class=\"wp-image-25331\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Loch-Ness-Monster-Energy-Drink.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Loch-Ness-Monster-Energy-Drink-300x300.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Loch-Ness-Monster-Energy-Drink-100x100.jpg 100w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Loch-Ness-Monster-Energy-Drink-770x770.jpg 770w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\"><em><mark style=\"color:#fcfcfc\" class=\"has-inline-color\">Loch Ness Monster Energy Drink (Alvaro Cintas Twitter)</mark></em></figcaption></figure><figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"1024\" data-id=\"25329\"  src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Eiffel-Towel.jpg\" alt=\"Eiffel Towel\" class=\"wp-image-25329\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Eiffel-Towel.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Eiffel-Towel-300x300.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Eiffel-Towel-100x100.jpg 100w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Eiffel-Towel-770x770.jpg 770w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\"><em><mark style=\"color:#f8f8f8\" class=\"has-inline-color\">Eiffel Towel (Alvaro Cintas Twitter)</mark></em></figcaption></figure><figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"1024\" data-id=\"25330\"  src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Machu-Pickachu.jpg\" alt=\"Machu Pikachu\" class=\"wp-image-25330\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Machu-Pickachu.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Machu-Pickachu-300x300.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Machu-Pickachu-100x100.jpg 100w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Machu-Pickachu-770x770.jpg 770w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\"><em><mark style=\"color:#fcfbfa\" class=\"has-inline-color\">Machu Pikachu  (Alvaro Cintas Twitter)</mark></em></figcaption></figure></figure><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T14:12:20.000Z",
    "title": "Laos military says country's crypto operators owe $20M in unpaid taxes ",
    "url": "http://cointelegraph.com/news/laos-military-says-crypto-operators-owe-20-million-unpaid-taxes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9efc0dc0-90d3-4354-921e-47a373aa7f82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The government says the tax debt will be slashed by 50% in response to a pro-rated drop in cryptocurrency prices after the obligations were set. </p>\n                    <p><p>In an effort to boost state revenues, Laos appears to be turning its attention to the country's crypto sector.</p><p>According to a Nov. 9 <a href=\"https://english.news.cn/20231109/a3f24356c5e546509589acb3eac82c11/c.html\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by China's state news agency Xinhua News, citing a report from Laos People's Army News, cryptocurrency operators in the Southeast Asian country owes $20 million in taxes and licensing fees. To expand government revenue streams, Laos previously authorized 15 blockchain companies to mine crypto or operate as exchanges.</p><p>However, as detailed by Laos' Prime Minister Sonexay Siphandone, two companies in the novel initiative \"made no progress\" whatsoever. Others, meanwhile, fell behind on their payment obligations to the state. Sonexay also noted that since the government fixed the tax obligations, the price of cryptocurrencies has plummeted 50% overall. Therefore, the Laos government will reduce the balance owing by crypto companies by 50% as well.</p><p>With that decision, the companies began paying their fees, and it is expected that all the fees will be fully settled by the end of the year, said Sonexay. However, he also warned that companies falling behind on t progress will have their operations suspended, fined, or license revoked.</p><p>Laos' government faced a crisis this year with an extended drought lasting between January and June. The disaster, among many casualties, <a href=\"https://cointelegraph.com/news/laos-halts-crypto-mining-electricity-amid-drought\">forced the state-owned</a> electricity distribution company Électricité du Laos to suspend electricity supply to the country's crypto-mining operations. In May, the Laos government <a href=\"https://cointelegraph.com/news/laos-government-reportedly-prioritizes-blockchain-technology-for-digital-transformation\">outlined several key tenets</a> for its digital transformation, among which is the use of digital technology to generate new fiscal revenue, bolster foreign exchange reserves, curb inflation, and foster sustainable economic growth. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Blockchain 4.0 is revolutionizing <a href=\"https://twitter.com/hashtag/Laos?src=hash&amp;ref_src=twsrc%5Etfw\">#Laos</a>. It&#39;s driving financial inclusion, fostering transparency, and enhancing security in transactions. Smart contracts and decentralized finance are opening new avenues for growth. Truly, a game-changer for the nation&#39;s economy. <a href=\"https://twitter.com/hashtag/MetaBankLaos?src=hash&amp;ref_src=twsrc%5Etfw\">#MetaBankLaos</a>… <a href=\"https://t.co/oyaAKzFNjk\">pic.twitter.com/oyaAKzFNjk</a></p>&mdash; MetaBank (@MetaBankSG) <a href=\"https://twitter.com/MetaBankSG/status/1662377836311900161?ref_src=twsrc%5Etfw\">May 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-11-09T14:30:00.000Z",
    "title": "Train AI models to sell as NFTs, LLMs are Large Lying Machines: AI Eye",
    "url": "https://cointelegraph.com/magazine/train-kickass-ai-model-sell-nfts-llms-are-largely-lying-machines-ai-eye/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-AI-Eye-3008-scaled.jpg\"></p><p>Train up kickass AI models to sell them as NFTs in AI Arena, how often GPT-4 lies to you, and fake AI pics in the Israel/Gaza war: AI Eye.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T14:25:42.000Z",
    "title": "A Big Surge in Centralized Exchange Crypto Trading Volumes in October Suggests a Bullish Turn for the Market",
    "url": "https://www.cryptoglobe.com/latest/2023/11/a-big-surge-in-centralized-exchange-crypto-trading-volumes-in-october-suggests-a-bullish-turn-for-the-market/",
    "description": "CCData, a benchmark administrator sanctioned by the Financial Conduct Authority (FCA), stands at the forefront of digital asset information, delivering top-tier data and indices for settlement purposes. The firm excels in compiling and interpreting tick data from internationally recognized trading platforms, offering a detailed and extensive view of the digital asset market. This view encompasses […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-09T14:30:33.000Z",
    "title": "Bitcoin Hits 18-Month High as Market ‘Greed’ Takes Hold, Igniting Short Squeeze Frenzy",
    "url": "https://news.bitcoin.com/bitcoin-hits-18-month-high-as-market-greed-takes-hold-igniting-short-squeeze-frenzy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Hits 18-Month High as Market ‘Greed’ Takes Hold, Igniting Short Squeeze Frenzy\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc2290.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Crypto Fear and Greed Index (CFGI) currently reveals a mood of &#x201C;greed&#x201D; within the cryptocurrency market, scoring a 69 out of 100. As of November 9, 2023, at 5:20 a.m. Eastern Time, the price of bitcoin peaked above $37K &#x2014; a peak not observed since the first week of May 2022, stretching over a [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T14:36:00.000Z",
    "title": "BONK’s Price Jumps Over 65% In 24H, Rewards Trader’s Bold Decision",
    "url": "https://coinedition.com/bonks-price-jumps-over-65-in-24h-rewards-traders-bold-decision/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BONK Rewards Popular Trader’s Decision to Purchase at Resistance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Bonk-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst KALEO on X revealed today that he purchased Bonk (BONK) when the cryptocurrency was approaching a resistance level. Traders often avoid purchasing a cryptocurrency at a high, but the trader’s exception with BONK seems to have worked out.&#160; At press time, CoinMarketCap indicated that the altcoin’s price surged more than [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bonks-price-jumps-over-65-in-24h-rewards-traders-bold-decision/\">BONK’s Price Jumps Over 65% In 24H, Rewards Trader’s Bold Decision</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]