[
  {
    "source": "Cointelegraph",
    "date": "2023-08-13T02:48:02.000Z",
    "title": "Using courts for every crypto issuance will squash innovation: Grayscale CEO",
    "url": "https://cointelegraph.com/news/court-crypto-issuance-innovation-grayscale-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a584ff6b-b2dc-48aa-84bf-b37136a3ebbc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Grayscale CEO Michael Sonnenshein emphasized the need for a balanced regulatory approach to cryptocurrency to avoid hindering innovation in the United States.   </p>\n                    <p><p>Grayscale Investments CEO, Michael Sonnenshein, highlighted a potential negative outcome for United States economy if the Securities and Exchange Commission (SEC) continues to take a one-by-one approach to regulating the cryptocurrency industry.</p><p>During a recent <a href=\"https://www.foxbusiness.com/video/6332580760112\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with Fox Business, Sonnenshein expressed that the SEC could drive crypto firms out of the country by constantly resorting to enforcement actions against the industry.</p><p>“If every crypto issued needs to go to a court of law, then we are squashing the innovation taking place here,” Sonnenshein stated.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/79e1b0e6-e8a6-4fdc-8fca-c5d9710d852f.png\"  /><figcaption style=\"text-align: center;\"><em>Grayscale CEO Michael Sonnenshein on Fox Business 'The Claman Countdown'. Source: <a href=\"https://www.foxbusiness.com/video/6332580760112\" target=\"_blank\" rel=\"noopener nofollow\">Fox Business</a></em></figcaption></figure><p>Likewise, Ripple CEO Brad Garlinghouse echoed similar comments prior to the partial victory of Ripple, which <a href=\"https://cointelegraph.com/news/xrp-holders-celebrate-ripple-win-victory-sec-case\">was decided</a> on July 13.</p><p>Garlinghouse <a href=\"https://cointelegraph.com/news/ripple-ceo-brad-garlinghouse-fight-for-clarity\">expressed that the SEC</a> is “looking to kill” innovation and the cryptocurrency in the U.S.</p><p>However, Sonnenshein holds a positive outlook regarding the ongoing developments Congress is taking to provide regulatory clarity for the industry.</p><p>“A lot of this legislation that this congress could very well pass, could give the industry the actual clarity it needs to move forward in a way that embraces crypto” Sonnenshein stated.</p><p>On July 31, Cointelegraph<a href=\"https://cointelegraph.com/news/first-major-success-in-us-congress-for-two-crypto-bills-law-decoded-24-31-july\"> reported that the House</a> Financial Services Committee (FSC) approved the Financial Innovation and Technology for the 21st Century Act with a 35-15 vote.</p><p>The act aims to establish registration rules for crypto firms under the jurisdiction of either the Commodity Futures Trading Commission (CFTC) or the SEC.</p><p>Sonnenshein pointed out that the SEC is assessing the wrong criteria when determining which Bitcoin ETF should be introduced to the market.</p><blockquote>“When I think about the process that the SEC should be untaking here, it’s really not to pick winners and losers, it is to ensure that all the right disclosures are put out there for investors.”</blockquote><p>Sonnenshein further explained during the interview that there is room for several spot Bitcoin products on the market.</p><p>“We’ve been ready for a world where there are multiple spot Bitcoin products, where there are multiple bitcoin future products on the market\" Sonnenshein stated.</p><p>He argued that the SEC’s previous approval of the Bitcoin Futures ETF implies it does in fact have an adequate oversight of the Bitcoin market.</p><blockquote>“They do not believe there is sufficient surveillance in the underlying Bitcoin market[...]The SEC already has the tools to approve spot Bitcoin ETFs.\"</blockquote><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sec-decision-bitcoin-etfs-wont-leave-out-wall-street-giants\"><strong>SEC decision on Bitcoin ETFs won’t leave out Wall Street giants</strong></a></p><p>On Aug. 11, the SEC <a href=\"https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments\">delayed its decision</a> on the outcome of the spot Bitcoin ETF proposed by ARK Investment Management.</p><p>After its publication in the Federal Register, the SEC initiated a public comment period for the ARK 21Shares Bitcoin ETF.</p><p>This marks the most recent postponement in the regulatory decision-making process regarding the approval or disapproval of a spot crypto ETF in the U.S.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sbf-ordered-to-jail-bitcoin-etf-delayed-and-sec-to-appeal-ripple-case-hodlers-digest-aug-6-12/\"><strong><em>SBF ordered to jail, Bitcoin ETF delayed and SEC to appeal Ripple case: Hodler’s Digest, Aug. 6-12</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-13T03:00:41.000Z",
    "title": "NFT tool Sketch launched by Access Protocol pumps ACS amid sector downturn",
    "url": "https://cryptoslate.com/nft-tool-sketch-launched-by-access-protocol-pumps-acs-amid-sector-downturn/",
    "description": "<p>Solana-based (SOL) web3 platform Access Protocol (ACS) has launched Sketch, an NFT discovery, and no-code minting tool. Access protocol stated that creators who use Sketch would get access to cutting-edge technologies for their NFT collections, allowing them to mint digital assets at lower prices. Additionally, the tool would also allow them to mint multiple NFTs [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nft-tool-sketch-launched-by-access-protocol-pumps-acs-amid-sector-downturn/\">NFT tool Sketch launched by Access Protocol pumps ACS amid sector downturn</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-13T03:08:33.000Z",
    "title": "Wells Fargo and 10 Firms Face $549,000,000 Fine Over Illegal Use of WhatsApp, Signal and iMessage",
    "url": "https://dailyhodl.com/2023/08/12/wells-fargo-and-10-firms-face-549000000-fine-over-illegal-use-of-whatsapp-signal-and-imessage/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/fine-wells-finance.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US regulators just hit Wells Fargo and 10 additional firms with a half-billion dollar fine for a widespread record-keeping failure. The U.S. Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) have announced a total of $549 million worth of charges against Wells Fargo, the Bank of Montreal, BMO Capital Markets Corp, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/12/wells-fargo-and-10-firms-face-549000000-fine-over-illegal-use-of-whatsapp-signal-and-imessage/\">Wells Fargo and 10 Firms Face $549,000,000 Fine Over Illegal Use of WhatsApp, Signal and iMessage</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]