[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T21:55:00.000Z",
    "title": "Sam Bankman-Fried will get one day in court to meet with lawyers",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-one-day-in-court-meet-with-lawyers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6ba4dbe4-63aa-44c0-af40-aeb80c9067cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to a judge's order, SBF will be allowed access to one laptop and \"WiFi device” for roughly 6.5 hours while meeting with counsel in a courthouse cell block attorney room.</p>\n                    <p><p>A federal judge overseeing former FTX CEO Sam Bankman-Fried’s criminal case has issued an order allowing Sam Bankman-Fried to meet with his legal team outside of jail for roughly seven hours.</p><p>In an Aug. 21 filing in United States District Court for the Southern District of New York, Judge Lewis Kaplan ruled that Sam Bankman-Fried, who also goes by SBF, will be allowed to meet with his counsel in the cell block attorney room at the courthouse on Aug. 22 around one of his scheduled hearings. Kaplan <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">ordered SBF’s bail revoked</a> on Aug. 11, sending the former FTX CEO to the Metropolitan Detention Center in Brooklyn likely until the conclusion of his criminal trials.</p><p>According to the order, SBF will be allowed access to “one Internet-enabled laptop and one WiFi device” from roughly 8:30 AM EST until 3:00 PM while meeting with counsel. His lawyers had <a href=\"https://cointelegraph.com/news/sam-bankman-fried-requests-weekday-freedom-for-legal-defense-work\">petitioned the court</a> to release SBF for five days every week through his trials in order for him to prepare for the case. However, Kaplan’s order suggested only a one-time release within the confines of the courthouse on Aug. 22, with another decision likely pending based on a response from the Department of Justice.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sam-bankman-fried-in-notorious-brooklyn-jail\">Sam Bankman-Fried spends 3rd night in notorious New York jail</a></em></strong></p><p>Bankman-Fried’s first of two trials is scheduled to begin on Oct. 2, when he will face seven charges related to fraud at FTX. The latest superseding indictment <a href=\"https://cointelegraph.com/news/sam-bankman-fried-superseding-indictment-includes-campaign-finance-allegations\">filed by prosecutors</a> on Aug. 14 said they will consider SBF’s alleged violations campaign finance scheme as part of a wire fraud charge. He will face five other charges at his other trial scheduled for March 2024.</p><p>Before his $250-million bail was revoked, Bankman-Fried was largely confined to his parents’ home in California. He has pleaded not guilty to all charges.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T21:44:34.000Z",
    "title": "Coinbase takes equity stake in Circle as USDC Centre Consortium shuts down",
    "url": "https://cointelegraph.com/news/coinbase-takes-equity-stake-circle-usdc-centre-consortium-shuts-down",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2c6c806f-10cd-4739-9877-654351af4031.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Circle will take on full operational and governance responsibility after five years, thanks to increased regulatory clarity.</p>\n                    <p><p>Coinbase and Circle have redefined their relationship, according to identical announcements on the <a href=\"https://www.coinbase.com/blog/ushering-in-the-next-chapter-for-usdc\" target=\"_blank\" rel=\"noopener nofollow\">Coinbase</a>and <a href=\"https://www.circle.com/blog/ushering-in-the-next-chapter-for-usdc\" target=\"_blank\" rel=\"noopener nofollow\">Circle</a> blogs on Aug. 21. The two organizations jointly launched the USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) stablecoin and have until now governed the token through the Centre Consortium.</p><p>The Centre Consortium “will no longer exist as a stand-alone entity,” the blog past said, and governance and operations will be handled in-house. Circle will have enhanced responsibilities, including holding smart contract keys and regulatory compliance.  </p><p>The crypto firms attributed the move to increased regulatory clarity:</p><blockquote>“Circle and Coinbase […] Have agreed that with growing regulatory clarity for stablecoins in the U.S. and around the world, the requirement of a separate governance body like Centre, is no longer needed.”</blockquote><p>Circle co-founder and CEO Jeremy Allaire said in an X (formerly Twitter) thread that Circle and Coinbase “are extending and deepening our commercial relationship, with Coinbase taking an equity stake in Circle.” No value was stated for the Coinbase share. </p><p>The new arrangement will increase the firms’ strategic and economic alignment, the blog posts noted. Interest revenue will continue to be shared between them based on their holdings of the stablecoin. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/circle-ceo-usdc-adoption-emerging-developing-markets\">Circle CEO: 70% of USDC adoption comes from outside the US</a></em></strong></p><p>Circle and Coinbase <a href=\"https://cointelegraph.com/news/coinbase-and-circle-launch-usdc-stablecoin-with-purported-full-backing-in-us-dollars\">launched USDC together</a> in 2018. According to CoinGecko, USDC is the <a href=\"https://www.coingecko.com/en/categories/stablecoins\" target=\"_blank\" rel=\"noopener nofollow\">second</a> largest stablecoin by market cap, at $26 billion, with Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) ahead of it with a market cap of $83 billion. Circle <a href=\"https://cointelegraph.com/news/circle-preps-1b-war-chest-to-deal-with-market-threats-from-paypal-and-others\">has been bracing for the introduction</a> of PayPal’s new stablecoin, PYUSD, which was launched on Aug. 7. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Some major news from <a href=\"https://twitter.com/circle?ref_src=twsrc%5Etfw\">@circle</a> and <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> on the future of <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> in this joint blog post from <a href=\"https://twitter.com/brian_armstrong?ref_src=twsrc%5Etfw\">@brian_armstrong</a> and I (<a href=\"https://twitter.com/jerallaire?ref_src=twsrc%5Etfw\">@jerallaire</a>).   <a href=\"https://t.co/uHuxeRJtiI\">https://t.co/uHuxeRJtiI</a></p>&mdash; Jeremy Allaire (@jerallaire) <a href=\"https://twitter.com/jerallaire/status/1693719963565969654?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The blog posts also announced that USDC will launch on six new blockchains in September and October. It did not specify the new blockchains, but USDC’s expansion onto Polkadot, Optimism, Near, Arbitrum and Cosmos <a href=\"https://cointelegraph.com/news/circle-product-vp-usdc-chain-expansion-part-of-multichain-vision\">was announced in September</a>.  </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-21T22:00:11.000Z",
    "title": "Bitcoin, Binance Coin correlation hits record 98%; speaks to wider market trends",
    "url": "https://cryptoslate.com/insights/bitcoin-binance-coin-correlation-hits-record-98-speaks-to-wider-market-trends/",
    "description": "<p>Quick Take An intriguing observation from the crypto world highlights the significant correlation among prominent cryptocurrencies: Bitcoin and Binance Coin (BNB) have registered a striking correlation of 98% over the past year — an all-time high. As Bitcoin, the market-leading cryptocurrency, saw its value dip below the $26,000 mark, a corresponding decline was observed in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-binance-coin-correlation-hits-record-98-speaks-to-wider-market-trends/\">Bitcoin, Binance Coin correlation hits record 98%; speaks to wider market trends</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-21T22:00:39.000Z",
    "title": "Federal Reserve CBDC Would Threaten Privacy and Freedom, Report Warns",
    "url": "https://news.bitcoin.com/federal-reserve-cbdc-would-threaten-privacy-and-freedom-report-warns/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Federal Reserve CBDC Would Threaten Privacy and Freedom, Report Warns\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/cbdcccc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The America First Policy Institute (AFPI) recently sounded the alarm on the potential dangers of transitioning to a central bank digital currency (CBDC). This revelation, in a report penned by Michael Faulkender and David Vasquez, highlights the probable perils associated with the Federal Reserve&#8217;s direct issuance of a digital dollar. AFPI: A CBDC &#8216;Would Represent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T22:07:48.000Z",
    "title": "Eye Scan Could Detect Parkinson’s Disease Up to Seven Years Before Diagnosis",
    "url": "https://www.cryptopolitan.com/eye-scan-could-detect-parkinsons-disease/",
    "description": "Researchers from University College Hospital and Moorfields Eye Hospital have developed an AI-powered eye scan that has the potential to detect Parkinson&#8217;s disease up to seven years before conventional diagnosis methods. This innovative approach utilizes artificial intelligence to identify specific markers of Parkinson&#8217;s disease within eye scans. This method, applied to retinal imaging, marks the ... <a title=\"Eye Scan Could Detect Parkinson&#8217;s Disease Up to Seven Years Before Diagnosis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eye-scan-could-detect-parkinsons-disease/\" aria-label=\"More on Eye Scan Could Detect Parkinson&#8217;s Disease Up to Seven Years Before Diagnosis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T21:53:51.000Z",
    "title": "Today’s crypto wrap-up: Key events that occurred",
    "url": "https://www.cryptopolitan.com/crypto-wrap-up-key-events-that-occurred/",
    "description": "The crypto landscape is nothing if not dynamic. As one traces the daily footprints of this evolving world, two major narratives surface: Binance&#8217;s continuous run-ins with challenges and the rise (and potential fall?) of the decentralized social media app, Friend.tech. Binance&#8217;s Euro Troubles and Legal Battles Binance, the leading crypto exchange, has found itself in ... <a title=\"Today&#8217;s crypto wrap-up: Key events that occurred\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-wrap-up-key-events-that-occurred/\" aria-label=\"More on Today&#8217;s crypto wrap-up: Key events that occurred\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T21:40:14.000Z",
    "title": "U.S., South Korea and Japan gang up on China",
    "url": "https://www.cryptopolitan.com/us-south-korea-and-japan-gang-up-on-china/",
    "description": "A display of strengthened unity and alignment was evident at Camp David, as the U.S. President Joe Biden convened with Asian allies, South Korean President Yoon Suk Yeol and Japanese Prime Minister Fumio Kishida. The key aim? To mount a formidable front against China&#8217;s increasing dominance in the South China Sea and nuclear intimidations from ... <a title=\"U.S., South Korea and Japan gang up on China\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-south-korea-and-japan-gang-up-on-china/\" aria-label=\"More on U.S., South Korea and Japan gang up on China\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T22:00:23.000Z",
    "title": "Glassnode Co-Founder’s Prediction: DXY Set To Peak, Fueling Potential Bitcoin Rally To $37,000",
    "url": "https://www.newsbtc.com/bitcoin-news/glassnode-co-founders-prediction-dxy-set-to-peak-fueling-potential-bitcoin-rally-to-37000/",
    "description": "The largest cryptocurrency by market cap, Bitcoin (BTC), dropped after a prolonged period of consolidation around the $29,000 mark. The failure to sustain this level has resulted in a decline to $26,000. Interestingly, Bitcoin&#8217;s recent reversal has coincided with speculations of an imminent bull run, with many believing that the cryptocurrency winter is over and that lower price levels will not be revisited.  Nonetheless, this sentiment shifted on July 14th when the US Dollar Index (DXY) initiated a robust rally, surging from 99 points to its current level of 103. As the DXY began its ascent, Bitcoin&#8217;s trajectory turned downward, leading to a downtrend that caused the cryptocurrency to relinquish a significant portion of its 2023 gains. Conversely, before July, BTC experienced a surge to its yearly high of $31,800, while the DXY declined. Despite this development, Glassnode co-founder Yan Allemann suggests that in the coming months, it will be Bitcoin&#8217;s turn to reclaim the spotlight and assert its dominance once again. BTC’s Last Consolidation Phase? Glassnode co-founder Yan Allemann has shared insights on the current market conditions and predicts an imminent surge in Bitcoin&#8217;s value as the autumn approaches. Allemann&#8217;s analysis suggests that the US Dollar is expected to reach a peak level of 106, which will catalyze a prime environment for Bitcoin.  Historically, the inverse correlation between the Dollar and Bitcoin has been observed, where a stronger Dollar tends to put downward pressure on the cryptocurrency&#8217;s price. Conversely, a peak in the Dollar often coincides with a favorable environment for Bitcoin to thrive. Related Reading: Dogecoin Proof Of Stake Discussion Heats Up As Lead Dev Chimes In This said, Allemann believes that Bitcoin is projected to reach the $37,000 level before embarking on a significant upward movement during the autumn season.  This anticipated surge in value aligns with the patterns observed in previous market cycles, where Bitcoin has experienced notable price rallies during the latter part of the year. It remains to be seen how this narrative unfolds, but one thing is clear: the dynamics between Bitcoin and the US dollar continue to shape the cryptocurrency landscape.  Historical Data Reveals September Struggles For Bitcoin According to data by CoinGlass, August, and September have historically presented challenges for Bitcoin, making them notorious months for the cryptocurrency&#8217;s performance.  With 10 days remaining until the monthly close, August has already proven to be a difficult month for Bitcoin, experiencing a 12% decline over the past 30 days. However, this downtrend may not come to a halt just yet, as historical data indicates that September could pose additional obstacles to Bitcoin&#8217;s price trajectory. Examining the chart above, it becomes evident that September has historically been a challenging period for Bitcoin.  In some instances, the cryptocurrency has witnessed substantial price drops, reaching as high as 19%. This suggests that the coming month could potentially be characterized by further downward pressure on Bitcoin&#8217;s price. However, it is important to note that historical trends also indicate the possibility of more modest declines. In 2013, for example, Bitcoin&#8217;s price only decreased by 1% during September, defying the broader negative sentiment associated with the month.  This demonstrates that while September has a historical reputation for difficulty, it does not guarantee a significant downturn for Bitcoin in every instance. Related Reading: Gemini Hits Back At SEC Lawsuit With Dismissal Filing While Bitcoin has faced headwinds in August and historically in September, it is worth remembering that the cryptocurrency has demonstrated resilience and the ability to recover from downturns in the past.  Market conditions, macroeconomic factors, and regulatory developments can all contribute to the price fluctuations of Bitcoin and other cryptocurrencies. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T22:05:00.000Z",
    "title": "Recur Closes, Yuga Labs Battles with Open Sea: Is the NFT Market Dying?",
    "url": "https://coinedition.com/recur-closes-yuga-labs-battles-with-open-sea-is-the-nft-market-dying/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Recur_Becomes_Latest_NFT_Company_to_Call_It_Quits_as_Market_Slumps-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to recent reports, Recur, the NFT marketplace, announced that it was shutting down its operations due to harsh market conditions. “As we announced on August 18th, the RECUR platform will be deprecated over the coming months,” said the platform’s representatives in a recent blog post. The team detailed the following updates on their blog [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/recur-closes-yuga-labs-battles-with-open-sea-is-the-nft-market-dying/\">Recur Closes, Yuga Labs Battles with Open Sea: Is the NFT Market Dying?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T22:01:09.000Z",
    "title": "Vitalik Buterin Sends 600 Ethereum (ETH) Worth Over $1,000,000 to Coinbase As Crypto Markets Continue To Bleed",
    "url": "https://dailyhodl.com/2023/08/21/vitalik-buterin-sends-600-ethereum-eth-worth-over-1000000-to-coinbase-as-crypto-markets-continue-to-bleed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/ETH-Still-Has-Room-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) founder Vitalik Buterin has been spotted sending hundreds of ETH to a major US-based digital asset exchange. According to Ethereum blockchain tracker Etherscan, a wallet owned by Buterin shifted 600 ETH worth over $1 million to Coinbase, where it could potentially be sold on the open market. According to Etherscan, Buterin paid less than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/vitalik-buterin-sends-600-ethereum-eth-worth-over-1000000-to-coinbase-as-crypto-markets-continue-to-bleed/\">Vitalik Buterin Sends 600 Ethereum (ETH) Worth Over $1,000,000 to Coinbase As Crypto Markets Continue To Bleed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]