[
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T17:42:14.000Z",
    "title": "First Republican presidential debate to feature pro-crypto candidates",
    "url": "https://cointelegraph.com/news/first-republican-presidential-debate-feature-pro-crypto-candidates",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9199bb2c-5711-4578-8352-0b39120f7d86.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Florida Governor Ron DeSantis and Vivek Ramaswamy will be in attendance at the political debate on Aug. 23, but not Miami Mayor Francis Suarez, despite earlier claims.</p>\n                    <p><p>Candidates for the Republican nomination for the 2024 United States presidential election who have publicly expressed their support or disdain for certain crypto-related policies will be meeting for a debate for the first time.</p><p>At the time of publication, eight presidential candidates with the Republican Party are expected to appear in Milwaukee on Aug. 23 in the party’s first debate ahead of the 2024 election season. Former U.S. Presidential Donald Trump, the party frontrunner currently facing multiple criminal indictments related to his alleged role in attempting to overturn the results of the 2020 election and other crimes, has publicly stated he will not be appearing with the other candidates.</p><p>The Aug. 23 event will be the first time many of the Republican candidates have been in the same room amid political campaigns which may have targeted their rivals. Though it’s unclear if cryptocurrencies and blockchain will be mentioned at the debate, some of the candidates have explicitly mentioned plans to include the technology in policies should they win the party nomination and the presidential election.</p><p>Florida Governor Ron DeSantis, who is trailing in the double digits behind Trump according to several polls, will be the leading candidate among the eight contenders. In July, the Florida Governor <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\">promised to ban central bank digital currencies</a> (CBDC) in the U.S. should he be elected president, citing concerns with giving the government authority over consumer payments. He previously <a href=\"https://cointelegraph.com/news/florida-governor-signs-cbdc-bill-into-law-restricting-some-uses-of-us-and-foreign-cbdcs\">signed a bill</a> aimed at largely prohibiting the use of a federally-issued digital dollar in Florida.</p><p>Vivek Ramaswamy, who at 38 years old is the youngest candidate in the running, has advocated for the 2024 election to be a “referendum on fiat currency”. He spoke at the Bitcoin 2023 in Miami to announce his campaign would be accepting Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) donations, later <a href=\"https://cointelegraph.com/news/elon-musk-endorses-pro-crypto-presidential-republican-candidate\">receiving praise from X CEO Elon Musk</a> as a “promising” candidate.</p><p>Miami Mayor <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/francis-suarez\">Francis Suarez</a>, who gained popularity in the space for promoting pro-crypto policies in his city, <a href=\"https://cointelegraph.com/news/miami-mayor-pro-bitcoin-francis-suarez-enters-presidential-race\">entered the presidential race</a> in June. During his time as mayor, he announced he would accept certain paychecks in BTC and was involved in the MiamiCoin token project for Miami residents. </p><p>Suarez <a href=\"https://twitter.com/FrancisSuarez/status/1692552018739544565\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a now-deleted X on Aug. 18 he had qualified to appear at the Republican debate. However, this claim was <a href=\"https://www.gop.com/press-release/rnc-announces-participants-for-first-debate-in-milwaukee/\" target=\"_blank\" rel=\"noopener nofollow\">contradicted</a> by GOP officials on Aug. 21 following an announcement regarding the debate participant list — eight names, with Suarez not among them.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/34a5f9e9-451c-4f94-8f1d-f29a6ee74347.png\"  /><figcaption style=\"text-align: center;\"><em>A now-deleted X from Miami Mayor Francis Suarez on Aug. 18 claiming he had qualified for the first Republican debate. Source: X.</em></figcaption></figure><p>Other candidates appearing on Aug. 23 will include North Dakota Governor Doug Burgum, South Carolina Senator Tim Scott, former United Nations ambassador Nikki Haley, former U.S. Vice President Mike Pence, former New Jersey Governor Chris Christie, and former Arkansas Governor Asa Hutchinson. Robert F. Kennedy Jr., another presidential candidate who has <a href=\"https://cointelegraph.com/news/presidential-candidate-rfk-jr-purchased-bitcoin-for-his-children\">expressed pro-crypto views</a> and purchased BTC for his children, is running as a Democrat and will not speak in Milwaukee.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/democrats-crypto-war-alienate-youth-voters-winklevoss\"><strong><em>Democrats’ ‘war on crypto’ will lose its key voters — Winklevoss twins</em></strong></a></p><p>The 2024 elections in the United States could change the way the government addresses digital asset policies, with a party shakeup possible in the House of Representatives, Senate, and White House. Republicans currently hold a majority in the House, but all 435 seats will be up for election in November 2024. In the Senate, where Democrats have a slim majority, 33 seats out of 100 will be up for grabs.</p><p>In July, Republican lawmakers with the House Financial Services Committee passed through two bills <a href=\"https://cointelegraph.com/news/crypto-regulatory-framework-bill-pass-house-congressional-committee\">aimed at establishing regulatory clarity</a> for crypto firms. The legislation has not been scheduled for a full House vote at the time of publication, but partisan delays could push the bills into the next session of Congress.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T17:55:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T17:52:52.000Z",
    "title": "U.S. commerce secretary gears up for crucial China visit",
    "url": "https://www.cryptopolitan.com/us-commerce-secretary-crucial-china-visit/",
    "description": "Amid a myriad of international tensions and fragile relations, U.S. Commerce Secretary Gina Raimondo is charting a course straight to China&#8217;s heartland. Scheduled for the end of August, Raimondo’s trip marks a strategic move in international diplomacy between the two global giants. Navigating Choppy Diplomatic Waters Gina Raimondo isn’t just making a cursory visit. Her ... <a title=\"U.S. commerce secretary gears up for crucial China visit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-commerce-secretary-crucial-china-visit/\" aria-label=\"More on U.S. commerce secretary gears up for crucial China visit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T17:43:28.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T17:40:27.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T18:00:02.000Z",
    "title": "Shiba Inu Price Challenge: Gunning For $0.00001 After Shibarium Snag",
    "url": "https://www.newsbtc.com/all/shib-challenge-gunning-for-0-00001/",
    "description": "Shiba Inu (SHIB) has recently witnessed a tumultuous journey marked by a sharp reversal from its peak at $0.00001136.  This reversal, known as a V-top, has raised significant concerns within the crypto community and the trading floors. But what exactly does this term mean, and what implications does it hold for SHIB investors and enthusiasts? A V-top reversal is a distinctive price pattern observed in technical analysis. It occurs when a cryptocurrency&#8217;s value experiences a rapid ascent to a peak, followed by an equally swift decline.   Related Reading: Polygon (MATIC) At June Lows Again – Prospects For Bullish Recovery? In SHIB&#8217;s case, this sharp reversal saw its value plummet from $0.00001136, a striking deviation from its recent surge. This downward spiral has caused the current price to stand at $0.00000789 according to CoinGecko data, reflecting a 4.5% drop within 24 hours and a staggering 23.1% slump over the past seven days. Shiba Inu: The Intersection Of FUD And Network Activity The timing of this massive price slump coincides with a period of uncertainty and anxiety within the SHIB community, centered around the Shibarium Layer 2 launch. The emergence of fear, uncertainty, and doubt (FUD) has cast shadows over the project, leading to heightened caution among SHIB holders.  Similar to Polygon, Ethereum, and other blockchains, Shibarium is open for anyone to build on. Regrettably, this also provides an avenue for bad actors to develop scam dApps and rug-pull tokens, among other things. The mere incorporation of the term &#8220;Shibarium&#8221; or &#8220;Shib&#8221; in… pic.twitter.com/AiNqORi7J2 — 𝐋𝐔𝐂𝐈𝐄 &#124; Summer of Shibarium (@LucieSHIB) August 16, 2023 Lucie Shib, a prominent figure in the Shiba Inu executive team, further accentuated these concerns by issuing warnings about potential risks of exploitation. As a result of these apprehensions, SHIB holders have noticeably scaled back their transactional engagement over the past week. A closer look at CryptoQuant data highlights a stark contrast: on August 12, the SHIB Transaction Count exceeded 16,500, pushing the price to a four-month peak.  Source: CryptoQuant However, this number dropped drastically to a mere 5,601 transactions on August 21, signifying a substantial 66% decline in network activity. This trend has been fueled not only by Shibarium FUD but also by the broader downtrend sweeping through the crypto market. Related Reading: XRP About-Face Sparks Another Descent – What Lies Ahead? Shiba Inu (SHIB) is currently trading at $0.00000795. Chart: TradingView.com A Glimpse At SHIB Demand And Potential Recovery Meanwhile, recent trading data from multiple cryptocurrency exchanges indicates that Shiba Inu enthusiasts are actively placing purchase orders, indicating their optimism for a positive market shift. This reflects their confidence in a potential bullish reversal and their active engagement in shaping Shiba Inu&#8217;s future. Source: IntoTheBlock Optimistic investors have initiated live purchase requests for nearly 2 trillion SHIB tokens, marking a rise of 400 billion compared to the 1.5 trillion SHIB orders registered the previous week. In contrast, the quantity of sell orders has maintained its position at 1.2 trillion SHIB tokens, showing little movement. Related Reading: XRP About-Face Sparks Another Descent – What Lies Ahead? This intriguing observation suggests that, despite prevailing uncertainties, market demand for SHIB remains strong, as investors potentially await the clearance of FUD clouds. Looking ahead, the resolution of challenges surrounding the Shibarium L2 network could pave the way for SHIB to regain momentum and reclaim the $0.000011 threshold.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Sniper Country"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T18:00:50.000Z",
    "title": "Polkadot Price Prediction: DOT Price Surge and DigiToads’ Promising NFT Game Launch Keeps Crypto Market Abuzz",
    "url": "https://www.crypto-news-flash.com/polkadot-price-prediction-dot-price-surge-and-digitoads-promising-nft-game-launch-keeps-crypto-market-abuzz/?utm_source=rss&utm_medium=rss&utm_campaign=polkadot-price-prediction-dot-price-surge-and-digitoads-promising-nft-game-launch-keeps-crypto-market-abuzz",
    "description": "<img width=\"512\" height=\"289\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-69.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-69.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-69-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Only a few projects have garnered as much attention and excitement as Polkadot (DOT) in cryptocurrency. With its intricate ecosystem of parachains and its innovative approach to interoperability, Polkadot has continued to pull in investors. As Q3 ends, Polkadot&#8217;s development and price movement hint at a potential price surge. A 76% surge early in the [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-22T18:05:36.000Z",
    "title": "Things Are About to Get Worse for Bitcoin and Ethereum, Says Crypto Analyst Nicholas Merten – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/08/22/things-are-about-to-get-worse-for-bitcoin-and-ethereum-says-crypto-analyst-nicholas-merten-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Commission-Free-Bitcoin-eth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says things are not looking good for the top two crypto assets by market cap. Crypto analyst Nicholas Mertens tells his 511,000 DataDash subscribers that Bitcoin (BTC) and Ethereum (ETH) bulls haven&#8217;t come through, and therefore the markets are set to tumble further. &#8220;The bulls did not show up as expected, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/22/things-are-about-to-get-worse-for-bitcoin-and-ethereum-says-crypto-analyst-nicholas-merten-heres-his-outlook/\">Things Are About to Get Worse for Bitcoin and Ethereum, Says Crypto Analyst Nicholas Merten – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]