[
  {
    "source": "CoinDesk",
    "date": "2024-01-24T22:43:47.000Z",
    "title": "Bitwise Becomes First Spot Bitcoin ETF Provider to Provide Wallet Address",
    "url": "https://www.coindesk.com/markets/2024/01/24/bitwise-becomes-first-spot-bitcoin-etf-provider-to-provide-wallet-address/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto asset manager Bitwise on Wednesday became the first of the ten spot bitcoin exchange-traded fund (ETF) issuers to share its digital wallet address with the public."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-24T23:00:02.000Z",
    "title": "Bitcoin ETFs Are Pulling in Billions—But Crypto Stocks Are Taking a Beating",
    "url": "https://decrypt.co/214144/bitcoin-etfs-pulling-billions-crypto-stocks-taking-beating",
    "description": "Bitcoin-related stocks like Coinbase and MicroStrategy are down as the price of the biggest cryptocurrency takes a heavy hit this month."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-24T22:48:44.000Z",
    "title": " SEC pushes decision on BlackRock’s spot Ethereum ETF to March ",
    "url": "https://cointelegraph.com/news/sec-delay-decision-blackrock-spot-ethereum-etf-to-march",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYWQxNzIzMDAtNDYxNC00NjZlLWIwYzEtYjQwYTE0OTM1MDFhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ETF analysts expect spot Ether ETF applications to be “sporadically” delayed until May, when the first of many final decision deadlines are due. </p>\n                    <p><p>The United States securities regulator has pushed back its decision on BlackRock’s proposed spot Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> exchange-traded fund (ETF) a day ahead of the deadline, citing the need for more time to review the proposed rule change.</p><p>“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change,” the Securities and Exchange Commission’s assistant secretary, Sherry Haywood, <a href=\"https://www.sec.gov/files/rules/sro/nasdaq/2024/34-99419.pdf\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> in a Jan. 24 filing.</p><p>The SEC made the delay one day ahead of the Jan. 25 deadline. It is the first of several delays the SEC can exercise across a 240-day period. This first deadline comes nearly 45 days after Nasdaq filed for an iShares Ethereum Trust (on BlackRock’s behalf) on Dec. 11.</p><p><a href=\"https://cointelegraph.com/news/sec-delay-decision-blackrock-spot-ethereum-etf-to-march\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-24T22:44:11.000Z",
    "title": "New FTX probe should be limited in cost and duration: bankruptcy judge",
    "url": "https://cryptoslate.com/new-ftx-probe-should-be-limited-in-cost-and-duration-bankruptcy-judge/",
    "description": "<p>A new investigation into FTX should have a limited impact on the company&#8217;s bankruptcy case, Bloomberg reported on Jan. 24. The investigation results from a recent order from a Philadelphia court of appeals that requires the appointment of an examiner. Judge John Dorsey emphasized the potential cost of such an examination, commenting in a hearing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/new-ftx-probe-should-be-limited-in-cost-and-duration-bankruptcy-judge/\">New FTX probe should be limited in cost and duration: bankruptcy judge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T22:47:23.000Z",
    "title": "South Africa sees continued drop in consumer inflation",
    "url": "https://www.cryptopolitan.com/south-africa-sees-continued-drop-inflation/",
    "description": "South Africa reported a decrease in consumer inflation for the second consecutive month in December. The figures, released by Statistics South Africa, indicate a drop to 5.1% year-on-year from November&#8217;s 5.5%. This move edges the inflation rate closer to the central bank’s target range midpoint of 4.5%. Inflation trends and central bank&#8217;s stance The decrease [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T23:00:33.000Z",
    "title": "Bitcoin Fear & Greed Index Reaches Lowest Level In Three Months, Is The Bleed Over?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-fear-greed-index-lowest/",
    "description": "Amid the current market turmoil, the Bitcoin Fear &#38; Greed Index has continued on a sharp decline. This decline has seen the index fall to its lowest level in over three months as crypto investors become more fearful and hold their investments from the market. Bitcoin Fear &#38; Greed Index Takes A Nosedive In the months leading up to the end of the year 2023, the Bitcoin Fear &#38; Greed Index climbed steadily until it reached high greed levels. Now, this index takes a number of factors into consideration to place investor sentiment across a number of categories ranging from Extreme Fear, Fear, Neutral, Greed, and Extreme Greed. Related Reading: Valkyrie Exec Expects SEC To Approve XRP ETF, Can This Push Price To $100? The Fear &#38; Greed Index represents investor sentiment using scores between 1 and 100, with the lower end of the score representing fear levels and the higher ends representing greed. A score between 1 and 25 puts investor sentiment in Extreme Fear, 26-46 is Fear, 47-52 is Neutral, 53-75 is Greed, and 76-100 is Extreme Greed. In 2023, the score climbed as high as 74 as Bitcoin rallied toward $50,000. However, as the market has retraced, so has investor sentiment, which is currently trending toward fear. At the time of writing, the Bitcoin Fear &#38; Greed Index is showing a score of 58, which puts it in Neutral territory. It is also two scores down from the previous day’s figures of 50 which means that investor sentiment is trending more toward fear than greed. Source: alternative.me The current figure is the lowest that the index has been since October 2023. The last time the Bitcoin Fear &#38; Greed Index fell below 48 was on October 17 2023. In cases like these, it shows that investors are less inclined to put money into the market. This causes demand to fall, and as a result, prices of assets across the space suffer for it. BTC price begins to show strength &#124; Source: BTCUSD On Tradingview.com When Will The Bleed Stop? So far, the decline in the Bitcoin price has been triggered by massive outflows from the Grayscale Bitcoin Trust (GBTC) as investors redeemed their shares. Over $2 billion in BTC has flowed out from the fund, and this has put a lot of selling pressure on the asset. Related Reading: Coinbase Expects A Repeat Of 2018-2022 Bitcoin Cycle, What This Means For Crypto However, as the week progresses, the outflows are expected to slow down as investors stop selling. In such a case, the demand would be all to catch up with the supply being dumped on the market, thereby giving Bitcoin and other assets a chance to recover. At the time of writing, the Bitcoin price is still trending around $40,000 after a bounce back from a dip to $38,500. The price is up 2.6% in the last week, according to data from Coinmarketcap. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Bitcoin News, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-24T23:04:00.000Z",
    "title": "China’s Central Bank Set to Cut Bank’s RRR Next Month to Boost Economy",
    "url": "https://coinedition.com/chinas-central-bank-to-cut-banks-rrr-in-early-february/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/China_floats_idea_of_Asian_yuan_to_reduce_reliance_on_US_dollar.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"China’s Central Bank Set to Cut Bank’s RRR Next Month to Boost Economy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/China_floats_idea_of_Asian_yuan_to_reduce_reliance_on_US_dollar.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/China_floats_idea_of_Asian_yuan_to_reduce_reliance_on_US_dollar-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/China_floats_idea_of_Asian_yuan_to_reduce_reliance_on_US_dollar-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/China_floats_idea_of_Asian_yuan_to_reduce_reliance_on_US_dollar-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/China_floats_idea_of_Asian_yuan_to_reduce_reliance_on_US_dollar-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The People’s Bank of China announced on Wednesday plans to cut the reserve requirement ratio (RRR) for banks to release more money and boost the economy, a Bloomberg report details, quoting the Central Bank’s Governor Pan Gongsheng. According to that report, the Central Bank&#8217;s planned RRR reduction will come in early February and is slated [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/chinas-central-bank-to-cut-banks-rrr-in-early-february/\">China’s Central Bank Set to Cut Bank’s RRR Next Month to Boost Economy</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-24T23:01:04.000Z",
    "title": "FINRA Says 70% of All Crypto Communications Contain Regulatory Violations",
    "url": "https://dailyhodl.com/2024/01/24/finra-says-70-of-all-crypto-communications-contain-regulatory-violations/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Regulators-in-New-York.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A US regulatory organization says that 70% of all crypto communications potentially contain violations of current regulations. In a new press release, the Financial Industry Regulatory Authority (FINRA), which creates and enforces rules for registered brokers and brokerage firms, says that they found violations in up to 70% of crypto communications after conducting an investigation. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/24/finra-says-70-of-all-crypto-communications-contain-regulatory-violations/\">FINRA Says 70% of All Crypto Communications Contain Regulatory Violations</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]