[
  {
    "source": "Decrypt",
    "date": "2024-03-02T00:33:39.000Z",
    "title": "SEC's Hester Peirce Says Regulator's Approach to Crypto Has Been ’Strange’",
    "url": "https://decrypt.co/219959/sec-hester-peirce-regulation-by-enforcement-strange-eth-denver",
    "description": "Peirce expressed frustration over delayed action on Bitcoin ETFs—but remained mum on the prospects of an Ethereum equivalent."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T00:26:27.000Z",
    "title": "Wall Street Journal faces defamation lawsuit for Tether-Bitfinex coverage",
    "url": "https://www.cryptopolitan.com/wall-street-journal-faces-defamation-lawsuit-for-tether-bitfinex-coverage/",
    "description": "Christopher Harborne, owner of the Thailand-based aviation fuel broker AML Global Ltd., has filed a lawsuit against The Wall Street Journal (WSJ), accusing the publication of defamation.&#160; The legal action, initiated in a Delaware state court on Feb. 28, targets allegations made in a WSJ article from March 2023, which Harborne claims falsely accused him [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-02T00:30:59.000Z",
    "title": "Cardano’s Price Performance In The Current Bull Run – Is ADA Lagging Behind?",
    "url": "https://www.newsbtc.com/news/cardano/cardanos-price-performance-current-bull-run-is-ada/",
    "description": "As Bitcoin (BTC) is currently in a bull run, eclipsing the $60,000 mark once again, the spotlight has turned to ADA performance in comparison. With a history that mirrors Ethereum&#8217;s (ETH) early days, ADA&#8217;s journey through the market&#8217;s ups and downs has prompted a closer examination of its potential trajectory. The eighth-largest cryptocurrency by market cap, ADA has seen its fair share of highs and lows, with a recent uptick in price sparking both interest and speculation about its future. Particularly, Cardano&#8217;s current trading level, lingering below the highs of the March-April 2021 bull run, has raised eyebrows, especially when juxtaposed with Bitcoin&#8217;s bullish momentum. Related Reading: Bullish Forecast: Analyst Predicts Surge To $88,000 As Bitcoin Hits Highest Level In Two Years During the last peak period when BTC hit $60,000, ADA traded above $1. Yet, as Bitcoin revisits its former glory, ADA&#8217;s valuation stands around $0.6, presenting a curious case for analysis. Dan Gambardello, a crypto analyst have drawn parallels between ADA&#8217;s price action and Ethereum&#8217;s historical performance, suggesting that ADA may be on the cusp of a &#8220;significant breakout&#8221;, akin to ETH&#8217;s journey post-2017. CARDANO Bull Indicator Almost ACTIVATED! (Truth Behind ADA Price!) Intro 00:00 Cardano price concern 00:50 Is Cardano price lagging this cycle? 1:30 Ethereum offers helpful context 2:30 Cardano is within a normal move 8:00 Cardano bull indicator almost triggered! 9:25 pic.twitter.com/8tRlwEj8AO — Dan Gambardello (@cryptorecruitr) March 1, 2024 ADA Historical Echoes With Ethereum Dan Gambardello&#8217;s comparison of ADA to Ethereum&#8217;s past trajectory sheds light on the developmental parallels and market behavior between the two cryptocurrencies. Gambardello points out that ADA&#8217;s entry into the market towards the tail end of the 2017 bull run placed it in a different starting position than ETH. Despite this, both currencies achieved notable highs during that period. The subsequent bear market phases for both ADA and ETH were marked by substantial corrections and periods of foundational development, crucial for their long-term viability, according to Gambardello. The analyst added that the emergence of Decentralized Finance (DeFi) projects on both platforms, with Uniswap for ETH and SundaeSwap for ADA, underscores the parallel paths of &#8220;innovation and growth.&#8221; This historical perspective suggests that ADA&#8217;s current position and 78% dip from its peak might not be as dire as it appears. Instead, it could indicate a maturing phase that precedes significant growth, much like Ethereum experienced after its initial setbacks. Related Reading: ADA Price Breakout: Analyst Predicts New All-Time High As Cardano Surges by 30% The comparison offers a hopeful outlook for ADA, positioning it as a digital asset with the potential to recover and surpass its previous highs as it follows in Ethereum&#8217;s footsteps. Cardano&#8217;s Potential Unfolding Crypto analysts Trend Rider and Ali&#8217;s recent analysis has also amplified the optimism surrounding Cardano&#8217;s future. Trend Rider&#8217;s alert on a potential new all-time high for ADA, backed by a significant increase in the Trend Strength Indicator, echoes the sentiment of a pending rally reminiscent of ADA&#8217;s climb to $3.6. 🚨 $ADA Bull Run loading. Both our Moving Average Ribbon and our Money flow oscillator are bullish again after 200 Weeks! These are undenieable macro facts. Enjoy the ride, I will monitor the chart each week in case there are warning signals PS: Free trading course… pic.twitter.com/sC3fhRZGl0 — Trend Rider (@TrendRidersTR) February 29, 2024 Furthermore, Ali&#8217;s projection of ADA hitting $8 in the upcoming bull run, based on a breakout pattern in the weekly price charts, adds to the growing consensus of Cardano&#8217;s untapped potential. The #Cardano breakout may come earlier than expected! Still, if history repeats itself, we are anticipating $ADA to rise to $0.80, retrace to $0.60, and then enter a bull run toward $8 by January 2025! pic.twitter.com/HuVAxFEg9Y — Ali (@ali_charts) February 15, 2024 Featured image from Unpslah, Chart from TradingView"
  }
]