[
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T01:00:19.000Z",
    "title": "Arkham announces $5K bounty payout as Terra-related address are identified",
    "url": "https://cryptoslate.com/arkham-announces-5k-bounty-payout-as-terra-related-address-are-identified/",
    "description": "<p>Arkham Intelligence said in a tweet dated July 24 that the first of its crypto wallet identification bounties has now been paid out. The relevant bounty was awarded to an on-chain sleuth with the handle ErgoBTC and a second, anonymous individual. The two discovered evidence of addresses owned by Terraform Labs and its founder and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/arkham-announces-5k-bounty-payout-as-terra-related-address-are-identified/\">Arkham announces $5K bounty payout as Terra-related address are identified</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T01:03:24.000Z",
    "title": "From blue bird to X: Twitter’s rebranding sparks crypto frenzy",
    "url": "https://crypto.news/from-blue-bird-to-x-twitters-rebranding-sparks-crypto-frenzy/",
    "description": "Multiple tokens adorned with the label &#8216;X&#8217; emerged on various decentralized exchanges as Twitter, under the leadership of Elon Musk, initiated a transition from its recognizable blue bird emblem to an &#8216;X&#8217; insignia. The first indication of this imminent shift&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T01:00:51.000Z",
    "title": "Over $41 Million in Bitcoin Long Positions Liquidated as BTC Crashes Toward $29K",
    "url": "https://www.newsbtc.com/bitcoin-news/over-41-million-bitcoin-liquidated-btc-crashes-29k/",
    "description": "On July 24, 2023, Coinglass data revealed that over $41 million worth of Bitcoin long and short leveraged positions were liquidated as the BTC prices unexpectedly crashed below a consolidation level of around $29,500, shrinking by over 4%. The drop below the primary support is heaping pressure on the coin. It may draw more selling pressure in upcoming sessions, pushing prices toward immediate reaction lines, the next being at about $28,300.  Bitcoin Drops, Over $41 Million Of Longs Liquidated In crypto trading, liquidation happens the facilitating exchange, for example, OKX or Binance, forcibly takes over the collateral securing the leverage position whenever prices move against the trader&#8217;s prognosis. In this case, the recent liquidation was triggered by the rapid sell-off in Bitcoin, leading to a more than 4% price decline within a few hours during the New York Session on July 24. Binance, the world&#8217;s largest crypto exchange and a platform facilitating trading crypto derivatives, liquidated most levered positions. Significant liquidation amounts were also observed in ByBit and OKX. Related Reading: Binance Announces Listing Of Sam Altman’s Worldcoin, Opens Deposits A big chunk of liquidated positions were &#8220;longs,&#8221; meaning traders expected prices to rise in the days ahead. Coinglass said over $41 million of cumulative long positions were closed. Meanwhile, only $2.5 million of short positions were closed despite Bitcoin plunging, moving along the traders&#8217; price prediction. Despite Bitcoin remaining in a bullish formation, prices have been moving inside a consolidation, failing to breach the $31,800 level recorded in mid-July 2023. Coinciding with this expansion, a United States judge had ruled to favor Ripple Labs, saying XRP was not a security, in their case against the Securities and Exchange Commission (SEC). Following this declaration, the broader crypto market edged higher, only to cool off days later. Bitcoin has been no exception, as current price action reveals. Will ETF Applications Support Prices? Still, the collapse comes a few days after the SEC accepted applications from major financial institutions, including BlackRock, a prominent Wall Street giant, to launch Bitcoin exchange-traded funds (ETFs). News of BlackRock applying for a Bitcoin ETF previously triggered a bull run, pumping prices to 2023 highs.  Bitcoin remains bullish as prices remain within the leg-up established from June 15 to July 13. Even though fundamental factors could support prices, BTC may edge lower should bulls fail to prop up prices and push them within the consolidation of the better half of July 2023.  Related Reading: Ethereum Whale Transfers To Exchanges Suggest More Selling Pressure For ETH Technically, a close above $31,800 and July 13 highs may drive the coin towards the $36,000 zone and later $43,000 in a buy trend continuation formation. These are critical levels from the Fibonacci extension levels anchored on the recent leg-up from mid-June to mid-July. Feature image from Canva, chart from TradingView"
  }
]