[
  {
    "source": "Cointelegraph",
    "date": "2024-01-12T22:15:00.000Z",
    "title": " Bitcoin price sells-off after ETF approval — Have investors turned bearish? ",
    "url": "https://cointelegraph.com/news/bitcoin-price-sells-off-after-etf-approval-have-investors-turned-bearish",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzhmMDllNzItNzJkMi00ZDNjLWJlNGItZWVkOGIwYTY1OTFlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price dropped by nearly 7% just 2 days after the spot ETF approvals. Cointelegraph investigates why BTC price is correcting. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price dropped by 6.8% between Jan. 11 and Jan. 12, confirming bears' theory of a sell-the-news style event occurring after the <a href=\"https://cointelegraph.com/news/spot-bitcoin-etfs-record-notable-volume-on-day-1-btc-price-nearly-hits-49k\">approval of a spot BTC exchange-traded fund</a>. The much-anticipated event ensued after a 75% rally in the 90 days leading to the initial trading on Jan. 11. This partially explains the lack of excitement and the subsequent price correction down to $43,180.</p><p>Traders are now questioning whether investors are becoming bearish after multiple failed attempts to break above $47,000 in the last week. On one side, there is some rationale behind the fear, meaning market makers and whales that tried to front-run the spot ETF issuers by buying ahead of the launch might be forced to sell at a loss – if this hypothesis is valid. Furthermore, Bitcoin miners might feel pressured to sell some of their holdings given that the <a href=\"https://cointelegraph.com/news/bitcoin-halving-2024-miners-predict-potential-outcomes-of-reduced-btc-rewards\">halving is less than 100 days away</a>.</p><p>Regardless of how profitable a Bitcoin mining operation is, a 50% cut in the block subsidy will significantly affect margins. According to Bitcoin News, miners' outflow hit a six-year high as $1 billion worth of BTC was sent to exchanges.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-sells-off-after-etf-approval-have-investors-turned-bearish\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-12T22:20:38.000Z",
    "title": "JPMorgan analyst predicts 50% chance of spot Ethereum ETF in May",
    "url": "https://cryptoslate.com/jpmorgan-analyst-predicts-50-chance-of-spot-ethereum-etf-in-may/",
    "description": "<p>A JPMorgan executive suggested on Jan. 12 that securities regulators are equally likely to approve or disapprove a spot Ethereum ETF in the coming months. Nikolaos Panigirtzoglou, a Managing Director for JPMorgan, told The Block: &#8220;In our opinion, for the [U.S. Securities and Exchange Commission] to approve spot Ethereum ETFs in May, it would need [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/jpmorgan-analyst-predicts-50-chance-of-spot-ethereum-etf-in-may/\">JPMorgan analyst predicts 50% chance of spot Ethereum ETF in May</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]