[
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T05:03:54.000Z",
    "title": " Spot Bitcoin ETFs suffer third straight day of net outflows, $261M bled ",
    "url": "https://cointelegraph.com/news/bitcoin-etfs-post-third-outflow-day-261-million",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMWQ1MzdjYjQtYTEwYS00MGUxLTgzMTEtYWI4MjZjM2E1MjA2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>United States-listed spot Bitcoin ETFs have now bled around $742 million in just three trading days. </p>\n                    <p><p>United States spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) have now marked their third straight day of total net outflows, with $261.5 million leaving the ten approved funds on March 20.</p><p>It brings three-day net outflows to $742 million as March 18 and 19 saw respective net outflows of $154.3 million and $326.2 million, per Farside Investors <a href=\"https://farside.co.uk/?p=997\" target=\"_blank\" rel=\"noopener nofollow\">data</a>.</p><p>The outflow was due mainly to another solid day of outflow from the Grayscale Bitcoin Trust (GBTC), which bled $386.6 million, while Invesco Galaxy Bitcoin ETF (BTCO) also saw $10.2 million exit the fund. Both came to eclipse the trickle of inflows from the eight other approved ETFs. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-etfs-post-third-outflow-day-261-million\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-21T05:00:35.000Z",
    "title": "Ethereum Foundation Under Investigation From Unnamed Govt Agency",
    "url": "https://cryptodaily.co.uk/2024/03/ethereum-foundation-under-investigation-from-unnamed-govt-agency",
    "description": "Reports claim a Swiss regulator may have served the document request to the foundation in collaboration with the Securities and Exchange Commission."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T04:58:50.000Z",
    "title": "Danish AI Algorithm Predicts Life Trajectories, Including Death Forecasts",
    "url": "https://www.cryptopolitan.com/danish-ai-algorithm-predicts-life-death/",
    "description": "In a realm where technology continues to reshape our understanding of human existence, Danish researchers have stepped into the forefront with a groundbreaking AI algorithm. This innovative system, dubbed life2vec, endeavors to unravel the mysteries of life&#8217;s trajectory, from its earliest stages to the final breath.&#160; Harnessing the power of artificial intelligence and drawing upon [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-21T05:08:41.000Z",
    "title": "Crypto Whales Seize Opportunity Amid ETHFI’s 37% Price Drop",
    "url": "https://nulltx.com/crypto-whales-seize-opportunity-amid-ethfis-37-price-drop/",
    "description": "The cryptocurrency market witnessed a significant event as the recently listed token ETHFI experienced a sharp decline of 37% in its price. However, amidst this market turmoil, two prominent crypto whales strategically seized the opportunity to acquire ETHFI tokens. According to on-chain reports, following the 37% price drop post-Binance listing, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-21T05:01:47.000Z",
    "title": "Whale Returns To Solana Memecoin Market Despite Previous Losses",
    "url": "https://nulltx.com/whale-returns-to-solana-memecoin-market-despite-previous-losses/",
    "description": "In a bold move indicative of the ever-changing landscape of the cryptocurrency market, a significant whale investor has reentered the Solana memecoin arena after facing setbacks in previous endeavors. Having incurred losses totaling $1.48 million in a pursuit to capitalize on the volatile nature of meme tokens, this formidable investor [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T04:58:41.000Z",
    "title": "Dogecoin Price Holds Crucial Support But Can DOGE Clear This Hurdle?",
    "url": "https://www.newsbtc.com/analysis/doge/dogecoin-price-support-0-1220/",
    "description": "Dogecoin is recovering higher from $0.1220 against the US Dollar. DOGE must clear the $0.1650 resistance to start another increase toward $0.200. DOGE declined heavily and tested the $0.1220 support against the US dollar. The price is trading below the $0.1650 level and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance at $0.1310 on the 4-hour chart of the DOGE/USD pair (data source from Kraken). The price could gain bullish momentum if it clears the $0.1600 and $0.1650 resistance levels. Dogecoin Price Recovers Over 15% After a strong decline, Dogecoin price found support near the $0.1220 zone. A low was formed at $0.1228 and DOGE recently started a decent recovery wave, like Bitcoin and Ethereum. There was a steady increase above the $0.1320 and $0.1350 resistance levels. The price cleared the 23.6% Fib retracement level of the downward move from the $0.1927 swing high to the $0.1228 low. There was also a break above a key bearish trend line with resistance at $0.1310 on the 4-hour chart of the DOGE/USD pair. Dogecoin is still trading below the $0.160 level and the 100 simple moving average (4 hours). On the upside, the price is facing resistance near the $0.1580 level or the 50% Fib retracement level of the downward move from the $0.1927 swing high to the $0.1228 low. Source: DOGEUSD on TradingView.com The next major resistance is near the $0.1650 level. A close above the $0.1650 resistance might send the price toward the $0.1850 resistance. The next major resistance is near $0.200. Any more gains might send the price toward the $0.220 level. Another Decline in DOGE? If DOGE’s price fails to gain pace above the $0.160 level, it could start another decline. Initial support on the downside is near the $0.1450 level. The next major support is near the $0.130 level. If there is a downside break below the $0.130 support, the price could decline further. In the stated case, the price might decline toward the $0.1150 level. Technical Indicators 4 Hours MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. 4 Hours RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1450, $0.130 and $0.1150. Major Resistance Levels – $0.1580, $0.160, and $0.1650."
  }
]