[
  {
    "source": "Cointelegraph",
    "date": "2023-11-11T06:20:57.000Z",
    "title": "Demand for Bitcoin could grow by up to 10X within 12 months: Michael Saylor ",
    "url": "http://cointelegraph.com/news/demand-for-bitcoin-grow-by-10-x-michael-saylor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/eee1db19-d4b3-4efb-8546-21027b364da8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The MicroStrategy co-founder emphasized that demand for Bitcoin will significantly ramp up following the halving next year.  </p>\n                    <p><p>With the<a href=\"https://cointelegraph.com/news/bitcoin-halving-months-away-may-time-risk-on\"> Bitcoin halving</a> just months away, MicroStrategy co-founder and Bitcoin bull Michael Saylor thinks that demand for BTC could grow by as much as 10X by the end of 2024. </p><p>During a speech at the 2023 Australia Crypto Convention on Nov. 10, Saylor was <a href=\"https://auscryptocon.com/\" target=\"_blank\" rel=\"noopener nofollow\">asked</a> to give his outlook for Bitcoin and its ecosystem over the next four to five years.</p><p>In response, Saylor initially gave a rundown on the period between 2020 and 2024, noting that Bitcoin went from being seen as a “offshore unregulated asset” to an “institutionalized mainstream app.”</p><p>Honing in on the near term, Saylor said that BTC will become a “adolescent mainstream asset by the end of 2024,” as he highlighted key dynamics <a href=\"https://cointelegraph.com/news/bitcoin-halving-months-away-may-time-risk-on\">surrounding supply and demand </a>that will soon come into play: </p><blockquote>“I think that this next 12 months is going to be a big. Because demand [on a monthly basis] should double or triple or maybe go up by a factor of 10, anywhere from two to 10. [...] and the supply available for sale will be cut in half in April.”</blockquote><p>“So instead of a billion dollars of Bitcoin available for miners each month, it will be half a billion. It's pretty unprecedented that you would go from a supply and demand balance of maybe $15 billion of organic demand and $12 billion of organic supply. What happens when one doubles, and the other one cuts in half ? the price is going to adjust up,” he added. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/cb9fa399-d85f-4760-90e9-690321d4fe09.png\"  /><figcaption style=\"text-align: center;\"><em>Speakers at the Melbourne-based event. Source: Australian Crypto Convention</em></figcaption></figure><p>Saylor went on to describe the next 12 months for Bitcoin as its “coming out party” as the asset graduates from “college” and heads out into the real world. </p><p>Looking at 2024 to 2028, Saylor predicted that Bitcoin will continue to be in a high-growth stage as adoption spreads across the big tech industry and mega banks worldwide, with both sectors integrating Bitcoin into their products and services.  </p><p>Saylor also said he expects to see a lot of competition among companies like Apple and Meta (Facebook) to get their hands on BTC to eventually sell for major profits. </p><blockquote>“You're going to have ferocious competition and will among Wall Streeters to get the most asset share and you're going to have crypto exchanges competing and you're going to have other tech companies getting involved. [...] That’ll be one check.”</blockquote><p>“The other check will be when the big mega banks or Bitcoin custodians with JP Morgan, Morgan Stanley, Goldman Sachs, Bank of America, Deutsche Bank, and, you know [...] when they're making loans and giving mortgages and customising it and buying and selling it. I think that'll be the second check,” he added. </p><p>Looking even further into the future, at around 25 years, Saylor outlined some lofty predictions for the future of Bitcoin, as he emphasized that BTC will blow any other high-quality asset out of the water. </p><p>“When it hits that terminal growth rate, maybe 20 years out, maybe 25 years, or it'll be growing twice as fast or compounding twice as fast as the S&amp;P 500 Index, or any other diversified high quality portfolio of assets you could buy,” he said, adding: </p><blockquote>“So if you think about it like that, you just say, well [...] now we're going to double we're going to double again, we're going to double again, and we're going to double again, that coin is going to continue to progress to a million dollars a coin, $2 million a coin, $5 million a coin, $10 million a coin.” </blockquote><p>MicroStrategy <a href=\"https://cointelegraph.com/news/microstrategy-bitcoin-play-up-nearly-a-billion-amid-btc-price-surge\">currently holds around 158,400 BTC</a>, and the firm was up around $900 million on its investment as of Nov. 2. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-11T06:25:27.000Z",
    "title": "Exploring the Potential and Pitfalls of AI-Based Decision Making in Warfare",
    "url": "https://www.cryptopolitan.com/ai-based-decision-making-in-warfare/",
    "description": "In a world where artificial intelligence permeates our daily lives, its application in the realm of armed conflict raises crucial questions about the future of warfare. The real news on the horizon is the imminent integration of AI-based decision-making platforms in defense operations. From claims of enhanced situational awareness to faster decision-making cycles, these tools ... <a title=\"Exploring the Potential and Pitfalls of AI-Based Decision Making in Warfare\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-based-decision-making-in-warfare/\" aria-label=\"More on Exploring the Potential and Pitfalls of AI-Based Decision Making in Warfare\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-11T06:15:51.000Z",
    "title": "Memecoin Dogecoin Poised for Breakout, While Cardano and Uniswap Show Mixed Signals",
    "url": "https://www.crypto-news-flash.com/memecoin-dogecoin-poised-for-breakout-while-cardano-and-uniswap-show-mixed-signals/?utm_source=rss&utm_medium=rss&utm_campaign=memecoin-dogecoin-poised-for-breakout-while-cardano-and-uniswap-show-mixed-signals",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26-336x200.jpg 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto trader Ali Martinez forecasts a potential 13% surge for Dogecoin if it surpasses the $0.076 resistance, while predicting bearish trends for Cardano. Uniswap shows bullish patterns, indicating a possible rise to around $6. Dogecoin: On the Verge of an Upward Breakout The cryptocurrency market is abuzz with speculation, particularly surrounding Dogecoin (DOGE), the largest [...]"
  }
]