[
  {
    "source": "Decrypt",
    "date": "2023-09-20T23:35:29.000Z",
    "title": "A Developer Asked AI to Name and Launch a Memecoin—It Raked In $12 Million In One Day",
    "url": "https://decrypt.co/198069/astropepex-memecoin-token-ai-name-code",
    "description": "The name of the first coin, AstroPepeX, was suggested by ChatGPT after it analyzed other successful token names."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T23:17:00.000Z",
    "title": "OnlyFans, Patreon models turn to Web3 amid payment and censorship fears",
    "url": "https://cointelegraph.com/news/onlyfans-patreon-models-turn-to-web3-payment-censorship-fears",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/35f2070e-96a1-4192-8408-b1593b0476f0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Patreon creators had difficulties getting paid in August, while OnlyFans once tried to ban porn on the platform, forcing creators to look at alternatives, including Web3. </p>\n                    <p><p>Adult content creators have continued to shift towards decentralized versions of OnlyFans and Patreon, after recent payment difficulties and the ever-present threat of being de-platformed. </p><p>Leon Lee, founder and CEO of Only1 — a decentralized version of OnlyFans — tells Cointelegraph there has been a recent power shift from intermediaries to content creators, thanks to Web3. </p><p>“The role of intermediaries are diminishing while the role and earnings of creators are increasing,” said Lee.</p><p>In August, creators on Patreon reported having difficulties withdrawing their earnings from the platform as payments were being flagged as fraudulent by banks. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I told the credit card company the charge was valid, fine. Patreon sent an email saying &quot;click here to update your payment&quot; and that link goes to a 404 error. My list of supported creators is gone, I have to try to remember who I was supporting - there is nothing on the site 2/</p>&mdash; Jason Pargin, author of John Dies at the End, etc (@JasonKPargin) <a href=\"https://twitter.com/JasonKPargin/status/1686783937111015424?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Many content creators also haven’t likely forgotten when OnlyFans tried to ban sexually explicit content in 2021, only to reverse the decision days later. </p><p>Speaking to this, Lee argues that creators will always be at risk of being deplatformed as long as they stay on centralized platforms using traditional payment rails. </p><blockquote>“Creators are still at risk of being deplatformed and are not realizing their full earning potential.”</blockquote><p>Only1 was launched on the Solana blockchain in March 2023 — backed by Animoca Brands. However, the platform is just one out of many startups looking to capture the magic of adult subscription platforms with a decentralized crypto twist.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/  Introducing the Creator Economy 4.0<br><br>Traditional creator subscription platforms fell short when it comes to payments, incentives and censorship. This is all about to change, starting here on <a href=\"https://twitter.com/solana?ref_src=twsrc%5Etfw\">@solana</a>.<br><br>Read on  <a href=\"https://t.co/TABSvzO1HX\">pic.twitter.com/TABSvzO1HX</a></p>&mdash; Only1 (@JoinOnly1) <a href=\"https://twitter.com/JoinOnly1/status/1694050716493693032?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In 2022, OnlyFans model Allie Rae created a crypto-powered adult content platform WetSpace, as an alternative to OnlyFans. </p><p>Rae told Cointelegraph in December 2022 that she created the platform to circumvent the <a href=\"https://cointelegraph.com/news/the-agenda-podcast-chats-crypto-and-sex-work-with-wetspace-ceo-allie-rae\">payment pressures</a> that creators on platforms like OnlyFans were receiving from banks:</p><blockquote>“I started to figure out that the banks really were largely in part the driving force behind some of those decisions that platforms were having to make. And so that naturally led to me: How do you get rid of the banks? And crypto came out like a knight in shining armor.”</blockquote><p>More recently, creators on OnlyFans started flocking to Friend.tech, a new decentralized social media platform built on Coinbase’s layer-2 network Base. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">gm web3. im shaking rn  officially 1 / 292 FT girl<a href=\"https://twitter.com/friendtech?ref_src=twsrc%5Etfw\">@friendtech</a> when merch? i&#39;ll rock it. <a href=\"https://t.co/Qm84AajCWt\">pic.twitter.com/Qm84AajCWt</a></p>&mdash; gracie♡ (@ilovegraciexo) <a href=\"https://twitter.com/ilovegraciexo/status/1698798617153421593?ref_src=twsrc%5Etfw\">September 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Lee believes a mass migration event will happen when more creators realize they don’t want to be shackled by censorship rules imposed by a centralized intermediary.</p><p>“Creators are already waking up to the fact and are becoming less dependent on intermediaries to monetize,” Lee said. </p><p>He acknowledged that TV producers, advertisers and brands will maintain a market share in the creator economy, but said a true peer-to-peer payment infrastructure like blockchain is the “next logical step” for creators:</p><p>“By removing the dependency on traditional payment processors, a web3 platform and its community can have full autonomy over the types of content allowed,” he said, adding: </p><blockquote>Since the OnlyFans adult content censorship, creators have been creating ‘backup accounts’ on different platforms due to such deplatform risk.”</blockquote><p>Proof of Peach, SEXN and Keyhole are three other adult entertainment platforms working in the Web3 space.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/press-releases/ducksquad-first-decentralized-venture-capital-nft-launches-on-only1\"><strong><em>DuckSquad — First decentralized venture capital NFT launches on Only1 </em></strong></a></p><p>Lee believes more creators will eventually flock to decentralized platforms that provide them with “full autonomy” over their content and full ownership rights to the money they make:</p><blockquote>“It is an inevitable future where there will no longer be any intermediaries between fans and creators — this is an obvious but unrealized potential of blockchain technology.” </blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/coldie-snoop-dogg-piece-vitalik-buterin-john-mcafee/\"><strong><em>NFT Creator: ‘Holy shit, I’ve seen that!’ — Coldie’s Snoop Dogg, Vitalik and McAfee NFTs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T23:11:46.000Z",
    "title": "Ottochain Homage to EVMOS and Ethereum Layer 2",
    "url": "https://cryptodaily.co.uk/2023/09/ottochain-homage-to-evmos-and-ethereum-layer-2",
    "description": "Ottochain is excited to announce its open invitation to the EVMOS and Eth L2 communities, extending a hand of collaboration and showcasing its commitment to innovation, community participation, and interoperability."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T23:13:19.000Z",
    "title": "dYdX v4 Enables 1-Click Onboarding With Squid & Axelar",
    "url": "https://cryptodaily.co.uk/2023/09/dydx-v4-enables-1-click-onboarding-with-squid-axelar",
    "description": "Decentralized financial derivatives marketplace dYdX has implemented a solution built on cross-chain infrastructure provided by Axelar, the leading Web3 interoperability platform, to support single-click onboarding and offboarding to dYdX v4."
  }
]