[
  {
    "source": "Decrypt",
    "date": "2024-01-02T01:58:46.000Z",
    "title": "Bitcoin Greets 2024 With a Peek Over $45,000",
    "url": "https://decrypt.co/208683/bitcoin-btc-45k-crypto-market-etf",
    "description": "The eyes of the crypto world remain on the SEC as bullish traders eagerly await the regulator’s decision on a Bitcoin spot ETF."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T01:41:10.000Z",
    "title": " Crypto stocks tumbling at year-end was a ‘healthy’ pullback: Analyst ",
    "url": "https://cointelegraph.com/news/crypto-mining-stocks-stumble-last-day-trading-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzI3YjhmYWQtMGQzYy00NGU1LThiNjAtZmJkZTMyOTAxZjg5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mitchell Askew of Blockware Solutions said investors cashed in some profits during the end-of-December holiday period after a strong month.</p>\n                    <p><p><em>Disclaimer: A previous version of this story inaccurately stated the stocks tumbled on the first day of trading in 2024, instead of the last trading day of 2023. </em></p><p>Major crypto and Bitcoin mining-related stocks, which tumbled as much as 17% on the last day of trading in 2023, were simply part of a “healthy pull back,” says a Bitcoin analyst.</p><p>According to Google Finance, Bitcoin mining firms were hit the hardest during the day. Shares in Marathon Digital Holdings (MARA) tumbled 16.6% to $23.5 on Dec. 29 while Riot Platforms (RIOT) fell 12.1% to $15.5.</p><p><a href=\"https://cointelegraph.com/news/crypto-mining-stocks-stumble-last-day-trading-2023\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T02:00:44.000Z",
    "title": "Bitcoin developer Jimmy Song likens Ordinals to pump and dump altcoin scams",
    "url": "https://cryptoslate.com/bitcoin-developer-jimmy-song-likens-ordinals-to-pump-and-dump-altcoin-scams/",
    "description": "<p>Bitcoin developer Jimmy Song, known for his maximalist views, expressed skepticism toward the Ordinals protocol, likening it to a run-of-the-mill altcoin scam. Song&#8217;s comments come amid growing discussions in the Bitcoin community about the Ordinals protocol, which was introduced in early 2023 and has since sparked debate over its impact on the Bitcoin network. Leveraging [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-developer-jimmy-song-likens-ordinals-to-pump-and-dump-altcoin-scams/\">Bitcoin developer Jimmy Song likens Ordinals to pump and dump altcoin scams</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T01:46:23.000Z",
    "title": "Dominant AVAX Wallets for Your DeFi Voyage in January 2024",
    "url": "https://www.cryptopolitan.com/dominant-avax-wallets-for-your-defi-voyage-in-january-2024/",
    "description": "Crypto has reawakened, bringing dormant users back to life and new users flooding in. The incentives for actively trading, lending, and borrowing digital assets are now higher, prompting a resurgence in DeFi activity. It pays to be busy during a bull market, particularly when there are new tokens to acquire and greater yields to collect [&#8230;]"
  }
]