[
  {
    "source": "Cointelegraph",
    "date": "2023-12-23T21:25:20.000Z",
    "title": " Turkey’s Erdogan picks crypto professor for central bank board: Report ",
    "url": "https://cointelegraph.com/news/turkey-erdogan-picks-crypto-professor-central-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZjM2YzU0ODAtMGMyMC00Yjk4LTk3MDktZDRmMjkyNjQ5ZmMxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Fatma Ozkul has been a lecturer at Marmara University in Istanbul since 2012, with an academic focus on accounting, finance, auditing, blockchain and digital assets. </p>\n                    <p><p>Turkey’s President Recep Tayyip Erdoğan has reportedly <a href=\"https://www.bloomberg.com/news/articles/2023-12-23/erdogan-hires-a-crypto-asset-lecturer-to-the-central-bank-s-rate-setting-board\" target=\"_blank\" rel=\"noopener nofollow\">appointed</a> professor Fatma Ozkul, an expert in crypto assets and blockchain technology, to the central bank’s monetary body.</p><p>According to Bloomberg, a decree nominating Ozkul was released on Dec. 22. She has been a lecturer at Marmara University in Istanbul since 2012, with an academic focus on accounting, finance, and auditing. Her research area extends to blockchain technology and digital assets, having authored a book on crypto asset accounting in 2022,<a href=\"https://avesis.marmara.edu.tr/14730\" target=\"_blank\" rel=\"noopener nofollow\"> notes</a> her university profile.</p><p>Ozkul is the newest member of Turkey’s central bank Monetary Policy Committee, whose primary duty is to set the benchmark interest rate to control inflation. The Committee<a href=\"https://apnews.com/article/turkey-central-bank-interest-rate-8a50f4656a073abf4c3c61630fcc71e1\" target=\"_blank\" rel=\"noopener nofollow\"> raised</a> the country's interest rate by 2.5 percentage points to 42.5% on Dec. 21, after Turkey’s inflation rate topped 61.98% in November.</p><p><a href=\"https://cointelegraph.com/news/turkey-erdogan-picks-crypto-professor-central-bank\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-23T21:30:06.000Z",
    "title": "Nigerian Central Bank Lifts February 2021 Crypto Prohibition Order",
    "url": "https://news.bitcoin.com/nigerian-central-bank-lifts-february-2021-crypto-prohibition-order/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nigerian Central Bank Lifts Its February 2021 Crypto Prohibition Order\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2083613065.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Nigerian central bank has reversed its Feb. 5 order which barred banks and financial institutions from extending their services to crypto entities. The central bank said new guidelines align with the Financial Action Task Force&#8217;s updated recommendation 15, which calls for the regulation of virtual asset service providers. Guidelines Align With FATF&#8217;s Recommendation On [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T21:23:51.000Z",
    "title": "Key takeaways from Kaiko’s latest research report",
    "url": "https://www.cryptopolitan.com/takeaways-from-kaikos-latest-research-report/",
    "description": "Kaiko&#8217;s recent research has been nothing short of a rollercoaster ride through the cryptosphere. In a year marked by unpredictability and seismic shifts, Kaiko’s more than 800 charts have provided a detailed roadmap of the digital currency landscape. From Bitcoin&#8217;s unexpected rallies to the fluctuating fortunes of Binance, their 2023 report is a treasure trove [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-23T21:30:13.000Z",
    "title": "Bitcoin Whales Sell 50,000 BTC Worth $2.2 Billion, Is The Rally Over?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-whales-sell-50000-btc/",
    "description": "The flagship cryptocurrency, Bitcoin, seems to be cooling off following months of experiencing a resurgence on the back of the Spot Bitcoin ETF potential approval rumors. This has led to concerns that the rally might be over, a theory that is boosted by the recent action of the largest holders of the crypto token. Bitcoin Whales Offload Some BTC Holdings In a post on his X (formerly Twitter) platform, crypto analyst Ali Martinez highlighted a report from the market intelligence platform Santiment, which showed that Bitcoin whales had sold around 50,000 BTC over the past week. This has raised eyebrows as many speculate why these whales are offloading some of their Bitcoin holdings. Related Reading: Former Director Says Ripple Can Burn 40 Billion XRP In Escrow, How Will This Affect Price? Coincidentally, these sales follow a similar trend from institutional investors as CoinShares&#8217; latest weekly report noted that there were minor outflows from digital asset funds last week. These funds are said to have seen an outflow totaling $16 million. However, if the asset manager’s report is anything to go by, then there should be no cause for concern.  CoinShares mentioned that the outflows seen from the digital asset investment funds are more likely to be related to profit-taking rather than a swing in sentiment. As such, one could also assume that this is the sentiment among the whales that made this recent Bitcoin sell-off. This is also very plausible, considering that Santiment recently reported that 89% of BTC’s total supply is in profit.  Meanwhile, BTC is seeing an inflow of investors, as Santiment reported that the amount of non-zero Bitcoin addresses is up to 916.8 million. Many seem to be looking to get in on the flagship cryptocurrency as approval of a Spot Bitcoin ETF looms, and the BTC Halving draws near.  BTC price at $43,600 &#124; Source: BTCUSD on Tradingview.com BTC To Rise Above $50,000 By End Of January While BTC seems to be cooling off, there is reason to believe that the rally isn’t over, as it could rise above $50,000 by the end of January 2024. Crypto financial services firm Matrixport predicts that this will happen on the back of the SEC approving the pending Spot Bitcoin ETF applications.  Related Reading: Solana Flips BNB To Become 4th-Largest Crypto, Is Ethereum Next Matrixport noted that they drew parallels to historical instances while making this price prediction. One of these instances is the CME Group’s Bitcoin futures launch in 2017. Bitcoin is said to have risen by 196% in a six-to-seven-week window dating to when the launch happened. They expect something similar to happen again.  The firm also expects that Bitcoin will still break out before the year ends. This prediction is also based on historical patterns, as they noted that btc historically sees a price increase between Christmas and the New Year. Matrixport had previously predicted that Bitcoin would hit $45,000 between November this year and April 2024.  At the time of writing, Bitcoin is trading at around $43,600, according to data from CoinMarketCap.  Featured image from CNET, chart from Tradingview.com"
  }
]