[
  {
    "source": "NewsBTC",
    "date": "2023-06-13T04:06:41.000Z",
    "title": "Ethereum Price Could See Recovery If It’s Able to Clear $1,800",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-recovery-1800/",
    "description": "Ethereum price is attempting a recovery wave above the $1,740 level against the US Dollar. ETH could rise steadily if there is a move above the $1,780 resistance. Ethereum is still below the $1,780 and $1,800 resistance levels. The price is trading below $1,780 and the 100-hourly Simple Moving Average. There was a break above a major bearish trend line with resistance near $1,740 on the hourly chart of ETH/USD (data feed via Kraken). The pair could recover if there is a move above the $1,780 and $1,800 levels. Ethereum Price Forms Support Base Ethereum’s price settled below the $1,775 and $1,780 resistance levels. ETH tested the $1,720 zone and is currently forming a support base, similar to Bitcoin. A low is formed near $1,718 and the price is attempting a recovery wave. The price is slowly moving higher above the $1,740 level. There was a break above a major bearish trend line with resistance near $1,740 on the hourly chart of ETH/USD. Ether is now testing the 23.6% Fib retracement level of the main drop from the $1,854 swing high to the $1,718 low. However, it is still trading below $1,780 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,770 zone and the 100-hourly Simple Moving Average. The next major resistance is near the $1,785 level. It is close to the 50% Fib retracement level of the main drop from the $1,854 swing high to the $1,718 low. Source: ETHUSD on TradingView.com A proper move above the $1,770 and $1,785 resistance levels might send Ether toward $1,820. The next resistance sits near $1,850, above which Ethereum could rise toward the $1,880 level. Any more gains above the $1,880 resistance zone might send the price toward the $1,920 resistance. Another Drop in ETH? If Ethereum fails to clear the $1,770 resistance, it could start another decline. Initial support on the downside is near the $1,730 level. The next major support is near the $1,720 level. If there is a break and close below the $1,720 support, the price could gain bearish momentum toward the $1,640 support. Any more losses may perhaps send the price toward the $1,600 zone. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,720 Major Resistance Level – $1,780"
  }
]