[
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T13:15:19.000Z",
    "title": "Blockchain companies are creating AI chatbots to help developers",
    "url": "https://cointelegraph.com/news/blockchain-ai-chatbots-developers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7fb86e01-ad98-4864-a8f0-d44b6f4c4680.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain companies are building AI chatbots to help developers, yet challenges may hamper adoption.</p>\n                    <p><p>The artificial intelligence (AI) market is becoming one of the fastest-growing industries in the world. <a href=\"https://www.nextmsc.com/report/artificial-intelligence-market\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to market research firm Next Move Strategy Consulting, the current AI market is valued at nearly $100 billion and is projected to grow exponentially. </p><p>Given this, it comes as no surprise that chatbots using AI are also on the rise. Recent findings from Precedence Research <a href=\"https://www.precedenceresearch.com/chatbot-market#:~:text=The%20global%20chatbot%20market%20size,19.29%25%20from%202023%20to%202032.\" target=\"_blank\" rel=\"noopener nofollow\">show</a> that the global chatbot market size reached $840 million in 2022.</p><h2>AI chatbots for Web3 developers in the works</h2><p>As opportunities around AI and chatbots flourish within various industries, the Web3 sector has also <a href=\"https://cointelegraph.com/innovation-circle/google-bard-vs-chatgpt-vs-ernie-the-ai-chatbot-race-and-web3\">started to capitalize on this trend</a>, with blockchain companies creating AI chatbots to help developers build applications faster and more efficiently. </p><p>Aanchal Malhotra, head of RippleX Research — an organization within Ripple focused on the development and growth of the XRP Ledger — told Cointelegraph that RippleX is currently working on building an AI chatbot to which developers of the XRP Ledger can pose queries:</p><blockquote>“Rather than rambling through all of the documentation and client libraries, developers will be able to direct their questions to the AI chatbot to get instant answers. This will make the life of developers much easier as it will shorten the time for ideas to become applications.” </blockquote><p>Skale Labs — the team behind the Skale blockchain network — is also building an AI-powered chatbot. Jack O’Holleran, co-founder and CEO of Skale Labs, told Cointelegraph that the Skale network has built-in AI and machine learning capabilities that enable developers to run pre-trained AI models within a smart contract. </p><p>“AI-driven smart contracts fire without human intervention in a very high volume manner. This allows developers to build fast and effectively,” he said. </p><p>O’Holleran shared that Skale’s AI chatbot will soon be released publicly, stating that one of the primary use cases for AI is engineering development support. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\">Ethereum restaking: Blockchain innovation or dangerous house of cards?</a></em></strong></p><p>“Devs are now building with record efficiency and productivity thanks to the support of AI. One of the key areas of support is instant access to knowledge of technical and coding documentation,” he said. </p><p>Echoing this, Matthew Van Niekerk, CEO and co-founder at SettleMint — a blockchain programming tool — told Cointelegraph that AI tools are becoming essential for developers. </p><p>Van Niekerk explained that SettleMint recently added an AI Genie engineering assistant to its platform for rapid smart contract development and quality assurance testing and debugging. </p><p>“Our AI Genie is built to help organizations get their blockchain applications to production faster so that they can tap into the $3.1 trillion opportunity enabled through blockchain,” explained Van Niekerk.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/FBzlqD0biww\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><figcaption style=\"text-align: center;\"><em>SingularityNET CEO Ben Goertzel spoke to Cointelegraph about the possible intersections of blockchain and AI back in 2017.</em></figcaption><p>Van Niekerk further pointed out that SettleMint’s AI Genie is built to support humans, not replace them. This is important to highlight, as there are looming <a href=\"https://www.washingtonpost.com/technology/2023/06/02/ai-taking-jobs/\" target=\"_blank\" rel=\"noopener nofollow\">concerns</a> that AI-powered assistants may eventually replace human workers. </p><p>“The tool itself is positioned as an engineering assistant, not an engineer. It is built to abstract away mundane processes and complexities that prevent developers and engineers from focusing on building innovative solutions that will bring a clear return on investment for their businesses,” explained Van Niekerk.</p><p>To put this in perspective, William Baxter, chief technology officer and co-founder of tokenization platform Vertalo, told Cointelegraph his firm currently uses chatbots to summarize and present data to internal and external audiences. Baxter believes that assisted learning is one of the most promising general applications for chatbots:</p><blockquote>“Instead of searching for topics and combing through the results or relying on a curator, a chatbot lets you consume in summary from huge volumes of information. Paired with web access and using prompts that encourage the inclusion of links to primary sources, this dramatically expands the scope of online research. When learning a new programming language, blockchain, or application, feedback from a chatbot is enormously valuable, even if not entirely correct.”</blockquote><h2>Challenges may lead to delayed implementation</h2><p>Although AI-powered chatbots have the potential to help Web3 developers build better, a number of challenges may slow adoption. </p><p>For example, while O’Holleran is aware that AI-driven smart contracts may expedite technical development, he pointed out that these applications often require throughput for on-chain execution with predictable and automated spend. </p><p>“This could be problematic in a network that has high gas fees and variable fees, as the expected spend could vary dramatically and could accidentally get expensive fast,” he said. </p><p>In order to combat this, O’Holleran explained that the Skale network has on-chain fees rather than gas fees, making the total fees lower and certifiably predictable.</p><p>Lydia Mark, director of communications at Magma AI — a project building an AI chatbot that provides users with a virtual Web3 technology learning assistant — told Cointelegraph that ethical bias can also be problematic with AI chatbots. </p><p>“It becomes really easy for AI systems like Magma to inherit the biases imputed during data training, which in turn could negatively impact an entire ecosystem,” she said. To combat this, Mark shared that Magma AI uses bias detection and mitigation techniques. </p><p>Yet, one of the biggest challenges associated with AI chatbots is data privacy and security. Van Niekerk explained that companies building or using AI assistants need to consider internal business policies and government regulations pertaining to privacy. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/blockchain-charity-transparency-adoption\">Blockchain improves charity transparency — But is it right for everyone?</a></em></strong></p><p>“Large enterprises may have restrictions on the use of generative AI technologies due to risks of breaches in data privacy. SettleMint’s AI Genie is intentionally built as an optional tool within the platform so that enterprises only opt in when and if needed,” he said. </p><p>Challenges aside, Van Niekerk stated that, overall, AI chatbots are helping ensure that Web3 is more inclusive and accessible to a wide range of developers. </p><p>“Knowledge and expertise is now there to instantly support new devs entering the space. Web2 devs can speed up their Web3 learning and skill curve by order of magnitude thanks to AI developer support technology,” he remarked. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T13:38:02.000Z",
    "title": "The Evolution of Video Games Through Generative AI",
    "url": "https://www.cryptopolitan.com/the-evolution-of-video-games-through-gen-ai/",
    "description": "Generative Artificial Intelligence (AI) is poised to usher in a new era in the world of video games, transforming non-playable characters (NPCs), open-world experiences, and even game development itself. AI, which has been a part of gaming since the 1950s, is now making substantial strides, offering gamers more immersive and dynamic experiences. This article explores ... <a title=\"The Evolution of Video Games Through Generative AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-evolution-of-video-games-through-gen-ai/\" aria-label=\"More on The Evolution of Video Games Through Generative AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T13:31:41.000Z",
    "title": "The Visual Revolution in Gaming Over the Past Decade",
    "url": "https://www.cryptopolitan.com/the-visual-revolution-in-gaming/",
    "description": "The gaming industry has undergone a remarkable transformation over the past decade, with advancements in technology, monetization strategies, and gaming experiences taking center stage. This article explores the key developments in the world of gaming, from realistic graphics to innovative monetization strategies and the integration of AI, all contributing to a more immersive and inclusive ... <a title=\"The Visual Revolution in Gaming Over the Past Decade\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-visual-revolution-in-gaming/\" aria-label=\"More on The Visual Revolution in Gaming Over the Past Decade\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T13:23:04.000Z",
    "title": "IBM and AWS Deepen AI Partnership, Setting Sights on Enterprise Transformation",
    "url": "https://www.cryptopolitan.com/ibm-aws-ai-partnership-transformation/",
    "description": "In a strategic maneuver, IBM Consulting and Amazon Web Services (AWS) have announced an expansion of their artificial intelligence partnership, aiming to revolutionize the landscape of enterprise AI. The collaboration focuses on leveraging AWS&#8217; generative AI capabilities to enhance IBM&#8217;s enterprise AI and data platform, watsonx, and empowering IBM consultants with expertise in AWS generative ... <a title=\"IBM and AWS Deepen AI Partnership, Setting Sights on Enterprise Transformation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ibm-aws-ai-partnership-transformation/\" aria-label=\"More on IBM and AWS Deepen AI Partnership, Setting Sights on Enterprise Transformation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T13:21:33.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T13:20:44.000Z",
    "title": "Lawyers see slim 14% SEC victory chance in Ripple lawsuit",
    "url": "https://www.cryptopolitan.com/lawyers-see-slim-14-sec-victory-chance-in-ripple-lawsuit/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has retreated from its extensive legal confrontation with Ripple. This decision marks a significant shift in a lawsuit over three turbulent years. Ripple faced severe setbacks in its operations, with critical partnerships at stake, as leading crypto exchanges ceased listing XRP, profoundly impacting the firm&#8217;s market presence. The ... <a title=\"Lawyers see slim 14% SEC victory chance in Ripple lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lawyers-see-slim-14-sec-victory-chance-in-ripple-lawsuit/\" aria-label=\"More on Lawyers see slim 14% SEC victory chance in Ripple lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T13:18:04.000Z",
    "title": "Top 10+ Online Games in the World – A Global Phenomenon",
    "url": "https://www.cryptopolitan.com/top-10-online-games-in-the-world/",
    "description": "Online gaming has witnessed an unprecedented surge in popularity in recent years, drawing millions of players into the virtual realms of multiplayer online battle arena (MOBA) games, massively multiplayer online role-playing games (MMORPGs), first-person shooters, and battle royales. With millions of gamers competing, collaborating, and communicating in these virtual worlds, online gaming has not only ... <a title=\"Top 10+ Online Games in the World &#8211; A Global Phenomenon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-10-online-games-in-the-world/\" aria-label=\"More on Top 10+ Online Games in the World &#8211; A Global Phenomenon\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-23T13:33:23.000Z",
    "title": "Thailand delays $15b crypto giveaway citing security concerns",
    "url": "https://crypto.news/thailand-delays-15b-crypto-giveaway-citing-security-concerns/",
    "description": "According to Thailand’s Deputy Minister of Finance Julapun Amornvivat, the giveaway will not be launched on Feb. 1, as planned. Thailand will not launch the long-awaited &#8220;airdrop&#8221; on time as the government needs more time to develop &#8220;a safe system,&#8221;&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-23T13:24:19.000Z",
    "title": "Whale moves 1.6m worth of Solana as asset hits top trending list",
    "url": "https://crypto.news/whale-moves-1-6m-worth-of-solana-as-asset-hits-top-trending-list/",
    "description": "A Solana (SOL) whale recently moved 1.6 million tokens as the asset slips into the list of trending crypto assets amid a massive 52% increase over the past 30 days. According to whale-tracking platform Whale Alert, the funds were worth&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-23T13:15:25.000Z",
    "title": "Hyperinflation fuels Bitcoin’s rise in Turkey and Lebanon, experts say",
    "url": "https://crypto.news/hyperinflation-fuels-bitcoins-rise-in-turkey-and-lebanon-experts-say/",
    "description": "During a panel at the Plan B Forum 2023, a speaker discussed Bitcoin's utility in the hyperinflated economies of Turkey and Lebanon."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T13:36:31.000Z",
    "title": "ETH’s Double Bottom Breakout: Will $2,000 Be Next?",
    "url": "https://www.crypto-news-flash.com/eths-double-bottom-breakout-will-2000-be-next/?utm_source=rss&utm_medium=rss&utm_campaign=eths-double-bottom-breakout-will-2000-be-next",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Ethereum technical chart set up with double bottom formation hints at trend reversal and strong buying interest. On-chain data reveals a surge in buying interest for Ethereum among US-based crypto whales trading on Coinbase Pro, reaching a 100-day high. Over the last few days, the world&#8217;s second-largest cryptocurrency Ethereum (ETH) has been trying to regain [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T13:23:03.000Z",
    "title": "Crypto Sports Betting Sites Are Raising The Profile Of Digital Money",
    "url": "https://www.crypto-news-flash.com/crypto-sports-betting-sites-are-raising-the-profile-of-digital-money/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-sports-betting-sites-are-raising-the-profile-of-digital-money",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-62.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-62.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-62-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-62-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />If you&#8217;re looking for a specific industry where you can say cryptocurrency has achieved mainstream adoption, look no further than the world of online gambling, where digital assets have emerged as a true force to be reckoned with. Crypto gambling has taken off and become a key segment within an online gambling industry that recorded [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T13:21:20.000Z",
    "title": "Bitcoin Hits 3-Month Highs at $30,775 in Asia Trading Surge",
    "url": "https://www.crypto-news-flash.com/bitcoin-hits-3-month-highs-at-30775-in-asia-trading-surge/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-hits-3-month-highs-at-30775-in-asia-trading-surge",
    "description": "<img width=\"1280\" height=\"890\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-300x209.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-1024x712.png 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Bitcoin makes a weekly 10 percent surge to approach the $31k price zone as buyers make aggressive purchases in anticipation of the upcoming halving. Several altcoins join the move as they break crucial resistance levels to make an incredible surge.  Bitcoin (BTC) just retested its three-month high price of $30,775 before pulling back slightly to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T13:15:29.000Z",
    "title": "Bitcoin’s Bright Horizon: A Rally Backed by History and Expert Insight",
    "url": "https://www.crypto-news-flash.com/bitcoins-bright-horizon-a-rally-backed-by-history-and-expert-insight/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-bright-horizon-a-rally-backed-by-history-and-expert-insight",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin’s price has surpassed the $30,000 mark, fueled by institutional demand and historical data, with analysts forecasting further upward momentum. The potential approval of a Bitcoin ETF by the U.S. SEC is anticipated to attract even more institutional players, reinforcing Bitcoin&#8217;s position in the market. Bitcoin has confidently exceeded the $30,000 mark, fueled by speculation [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-23T13:16:52.000Z",
    "title": "DOP Offers Selective Transparency",
    "url": "https://www.altcoinbuzz.io/reviews/altcoin-projects/dop-offers-selective-transparency/",
    "description": "<p>Privacy in crypto is a hot topic. Blockchains are transparent and at the same time pseudonymous. In other words, transactions are publicly available. However, you can&#8217;t easily connect a wallet to an identity. On the other hand, privacy should be a given right for each person. Now, in the crypto space, that may clash with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/altcoin-projects/dop-offers-selective-transparency/\">DOP Offers Selective Transparency</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-23T13:27:20.000Z",
    "title": "Uniswap (UNI) Price Prediction 2023-2030: Will UNI Price reach $10 Soon?",
    "url": "https://coinedition.com/uniswap-uni-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Uniswap-UNI.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap (UNI) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Uniswap-UNI.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Uniswap-UNI-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Uniswap-UNI-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Uniswap-UNI-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Uniswap-UNI-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Uniswap (UNI)? A well-liked decentralized trading system called Uniswap is well-known for enabling the automatic trading of tokens related to decentralized finance (DeFi). Uniswap, an automated market maker (AMM) example, debuted in November 2018 but has experienced significant growth this year as a result of the DeFi phenomenon and the ensuing spike in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uniswap-uni-price-prediction/\">Uniswap (UNI) Price Prediction 2023-2030: Will UNI Price reach $10 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-23T13:26:00.000Z",
    "title": "FTM, SOL, DOT, DYDX, and BTC-Related Tokens on Analyst’s Watchlist",
    "url": "https://coinedition.com/ftm-sol-dot-dydx-and-btc-related-tokens-on-analysts-watchlist/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Market Anticipates Dip In February: Santiment On Trader Skepticism\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Market-Anticipates-Dip-In-February-Santiment-On-Trader-Skepticism-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A prominent crypto analyst named “The DeFi Investor” on the X (formerly Twitter) platform has released a crypto watchlist for the upcoming weeks. In his view, the list embodies tokens expected to make substantial gains in the coming weeks. First on the list is Fantom (FTM), the filthy seventh-ranked crypto project in the market, according [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftm-sol-dot-dydx-and-btc-related-tokens-on-analysts-watchlist/\">FTM, SOL, DOT, DYDX, and BTC-Related Tokens on Analyst&#8217;s Watchlist</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]