[
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T05:26:14.000Z",
    "title": "5 lowlights of Gary Gensler's evasive testimony before Congress",
    "url": "https://cointelegraph.com/news/gary-gensler-sec-testimony-congressional-hearing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5ae0903a-e3ff-4b0c-aa3f-2c7ed372fd70.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United States Securities and Exchange Commission chief was asked whether the purchase of Pokemon trading cards is a security transaction and whether Bitcoin is a commodity. </p>\n                    <p><p>Blamed for “kneecapping” the U.S. capital markets and slammed for dodging questions around Bitcoin and Pokemon cards, Gary Gensler appears to have had one hell of a grilling from Congress this week. </p><p>On Sept. 27, the United States Securities and Exchange Commission chief again found himself in front of lawmakers in a scheduled hearing to discuss his agency’s oversight of the markets. </p><p>Here are some of the highlights and lowlights of the hearing. </p><h3>“You are the Tonya Harding of securities regulations.” </h3><p>One of the more colorful analogies came from United States Representative Andy Barr, who accused Gensler of “kneecapping” the U.S. capital markets with regulatory red tape. </p><p>Barr referred to an old testimony from Gensler, where Gensler argued that the U.S. is the largest, most sophisticated and innovative capital market in the world and that it shouldn’t be taken for granted as “even gold medalists must keep training.”</p><p>“With all due respect Mr. Chairman, if the U.S. capital markets are a gold medalist, you are the Tonya Harding of securities regulations,” said Barr. </p><blockquote>“You are kneecapping the U.S. capital markets with the avalanche of red tape coming out of your Commission.”</blockquote><p>Barr is presumably referring to a scandal where U.S. ice skater Tonya Harding hired an assailant to attack her rival, Nancy Kerrigan, in the lead-up to the 1994 United States Figure Skating Championships and the Winter Olympics. Kerrigan ended up not competing in the U.S. championships. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Mr. Barr to Gensler:<br><br>“If the US capital markets are a gold medalist, you are the Tonya Harding of securities regulation because you are kneecapping the US capital markets…”<br><br> <a href=\"https://t.co/D9VOxtXAGC\">pic.twitter.com/D9VOxtXAGC</a></p>&mdash; John Dickens (@johnLdickens) <a href=\"https://twitter.com/johnLdickens/status/1707060721442517239?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>“I wish the Biden administration would say you're fired.”</h3><p>Meanwhile, U.S. Representative Warren Davidson also ripped into Gensler, saying he hoped that the Biden administration would fire him.</p><p>“I wish the Biden administration would say you're fired,” said Davidson. </p><p>Davidson accused Gensler of pushing a “woke” political and social agenda and abusing his role as the SEC’s Chair. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Gary Gensler’s tenure at the SEC highlights two key problems. <br><br>1) <a href=\"https://twitter.com/GaryGensler?ref_src=twsrc%5Etfw\">@GaryGensler</a> problem <br>2) <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a> structural problem <br><br>That’s why I introduced the SEC Stabilization Act to <a href=\"https://twitter.com/hashtag/FireGaryGensler?src=hash&amp;ref_src=twsrc%5Etfw\">#FireGaryGensler</a> and restructure the SEC. <a href=\"https://t.co/Ud3giejKfZ\">pic.twitter.com/Ud3giejKfZ</a></p>&mdash; Warren Davidson  (@WarrenDavidson) <a href=\"https://twitter.com/WarrenDavidson/status/1707084708998226409?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The U.S. representative added that he hopes the SEC Stabilization Act he introduced with U.S. Representative Tom Emmer could make that happen. </p><p>“You’re making the case for this bill [SEC Stabilization Act] every day you’re acting as the Chairman,” he concluded.</p><p>Gensler wasn’t given the chance to respond.</p><h3>Gensler reiterates Bitcoin isn’t a security</h3><p>Asked by U.S. House Committee on Financial Services chair Patrick McHenry whether Bitcoin is a security, Gensler eventually relented, stating that Bitcoin didn’t meet the Howey Test. </p><p>“It does not meet the Howey test which is the law of the land,” Gensler said, implying that Bitcoin isn't a security.</p><p>McHenry then suggested Bitcoin must be a commodity, which Gensler avoided answering, saying the test for that is outside the scope of U.S. securities laws.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Gary Gensler says that <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is NOT a security, but he refuses to say that it’s a commodity. <br><br>He’s running out of time. When a powerhouse like BlackRock asks for a Bitcoin ETF you MUST deliver. <a href=\"https://t.co/yhKcMzfzx6\">pic.twitter.com/yhKcMzfzx6</a></p>&mdash; The ₿itcoin Therapist (@TheBTCTherapist) <a href=\"https://twitter.com/TheBTCTherapist/status/1707062349209756017?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Henry also suggested Gensler tried to “choke off the digital asset ecosystem” and refused to be transparent with Congress about the SEC’s connections with FTX and its former CEO Sam Bankman-Fried.</p><p>Gensler also wasn’t given the chance to respond to the claims made by McHenry.</p><h3>Are Pokemon trading cards securities? It depends. </h3><p>U.S. Representative Ritchie Torres used his time to quiz Gensler about his interpretation of what constitutes an investment contract. </p><p>Torres put Gensler to the test by asking whether purchasing a physical Pokemon trading card constitutes a securities transaction.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I cross-examined <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a> Chair Gary Gensler about the term &#39;investment contract&#39;, which is key to determining his authority over crypto. <br><br>Gensler struggled to answer basic questions like whether an investment contract requires a contract. His evasions are deafening and damning. <a href=\"https://t.co/EJcZEHiKGL\">pic.twitter.com/EJcZEHiKGL</a></p>&mdash; Rep. Ritchie Torres (@RepRitchie) <a href=\"https://twitter.com/RepRitchie/status/1707117291349885103?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Suppose I was to purchase a Pokemon card. Would doing so constitute a security transaction?”</p><p>Gensler responded — “I don’t know what the context is” — before eventually concluding it isn’t a security if it is purchased in a store. Torres then asked:</p><p>“If I were to purchase a tokenized Pokemon card on a digital exchange via a blockchain, is that a security transaction?”</p><p>“I’d have to know more,” replied Gensler. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-voters-oppose-anti-crypto-president-poll-crypto-exchange-coinbase\"><strong><em>Coinbase crypto lobbying campaign to focus on 4 swing states </em></strong></a></p><p>Gensler then explained that it’s when the investing public can anticipate profits based upon the efforts of others — that’s the core of the Howey Test. Representative Torres called Gensler's \"evasions\" as \"deafening and damning.\"</p><h3>A sign of defiance</h3><p>Meanwhile, among the back-and-forth cross-examinations between Gensler and U.S. Representatives, eagle-eyed observers noticed a Coinbase “Stand With Crypto” logo behind the SEC Chair.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: Coinbase Stand with Crypto logo displayed at Gary Gensler hearing <a href=\"https://t.co/IAwqyDEQea\">pic.twitter.com/IAwqyDEQea</a></p>&mdash; Miss Teen Crypto (@missteencrypto) <a href=\"https://twitter.com/missteencrypto/status/1707040715769839797?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Coinbase-led initiative is a 14-month-long campaign that launched in August. It aims to push for cryptocurrency legislation in the U.S.</p><p>Coinbase also ran a “Stand with Crypto Day,” which took place in Washington, D.C. on Sept. 27 to advocate for<a href=\"https://cointelegraph.com/news/coinbase-national-ad-campaign-crypto\"> better cryptocurrency innovation and policy</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binance-coinbase-head-to-court-and-the-sec-labels-67-crypto-securities-hodlers-digest-june-4-10/\"><strong><em>Binance, Coinbase head to court, and the SEC labels 67 crypto-securities: Hodler’s Digest, June 4-10</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T05:21:37.000Z",
    "title": "Tech Leaders to Explore Generative AI at Technology & Innovation APAC 2023",
    "url": "https://www.cryptopolitan.com/generative-ai-at-tech-innov-apac-2023/",
    "description": "Sydney, Australia – Forrester (Nasdaq: FORR), a leading research and advisory firm, has unveiled the full conference agenda for Technology &#38; Innovation APAC 2023, scheduled to take place both in-person and digitally from October 31 to November 1, 2023. This eagerly anticipated event aims to equip technology leaders with the tools and knowledge needed to ... <a title=\"Tech Leaders to Explore Generative AI at Technology &#38; Innovation APAC 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-at-tech-innov-apac-2023/\" aria-label=\"More on Tech Leaders to Explore Generative AI at Technology &#38; Innovation APAC 2023\">Read more</a>"
  }
]