[
  {
    "source": "Decrypt",
    "date": "2023-10-23T21:18:31.000Z",
    "title": "What Are the Odds Sam Bankman-Fried Testifies in His Trial?",
    "url": "https://decrypt.co/202863/what-are-the-odds-sam-bankman-fried-testifies-in-his-trial",
    "description": "The formal crypto mogul has remained silent in court so far. But that could change as his trial progresses."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-23T21:29:03.000Z",
    "title": "Supra and Google Partner to Bring Fast Price Feeds to Financial Markets",
    "url": "https://cryptodaily.co.uk/2023/10/supra-and-google-partner-to-bring-fast-price-feeds-to-financial-markets",
    "description": "Supra, a leading provider of secure, scalable oracles for decentralized applications (dApps), today announced a partnership with Google Cloud to bring fast and reliable price feeds to Web2 and Web3 financial markets."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T21:24:44.000Z",
    "title": "Innovative MPC wallet by Bitget elevates crypto security with majority key authorization",
    "url": "https://www.cryptopolitan.com/innovative-mpc-wallet-by-bitget-elevates/",
    "description": "Cryptocurrency exchange Bitget has introduced a Multiparty Computation (MPC) wallet, featuring advanced security measures and a user-friendly approach to asset management. In a bid to bolster the security and key management for its users, Bitget, a prominent cryptocurrency exchange and derivatives platform, has unveiled a new wallet service employing Multiparty Computation (MPC) technology. This innovative ... <a title=\"Innovative MPC wallet by Bitget elevates crypto security with majority key authorization\" class=\"read-more\" href=\"https://www.cryptopolitan.com/innovative-mpc-wallet-by-bitget-elevates/\" aria-label=\"More on Innovative MPC wallet by Bitget elevates crypto security with majority key authorization\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T21:24:04.000Z",
    "title": "Week 3 of SBF trial: Inside the courtroom’s wildest moments",
    "url": "https://www.cryptopolitan.com/week-3-sbf-trial-courtrooms-wildest-moments/",
    "description": "The courtroom buzzes with anticipation as SBF&#8217;s high-profile criminal trial enters its third week. Eager eyes are locked on, and the whispers of the masses have found their way outside the four walls of justice. While the prosecution gears up to wind down its side, the defense seizes a momentary reprieve to prepare for what&#8217;s ... <a title=\"Week 3 of SBF trial: Inside the courtroom&#8217;s wildest moments\" class=\"read-more\" href=\"https://www.cryptopolitan.com/week-3-sbf-trial-courtrooms-wildest-moments/\" aria-label=\"More on Week 3 of SBF trial: Inside the courtroom&#8217;s wildest moments\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T21:15:45.000Z",
    "title": "This is crypto’s secret weapon against Wall Street",
    "url": "https://www.cryptopolitan.com/cryptos-secret-weapon-against-wall-street/",
    "description": "Cryptocurrencies are finding themselves at a crucial crossroads. As Wall Street&#8217;s behemoths stampede into the digital finance arena, the crypto domain needs more than cutting-edge tech to survive this critical phase. They need an arsenal that traditional finance respects: treasury management. So, what&#8217;s this all about? The Rise and Stumble of Crypto Titans Cryptocurrency&#8217;s journey ... <a title=\"This is crypto&#8217;s secret weapon against Wall Street\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptos-secret-weapon-against-wall-street/\" aria-label=\"More on This is crypto&#8217;s secret weapon against Wall Street\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-23T21:30:26.000Z",
    "title": "Bitcoin Mania: EY Insider Reveals Demand From Wall Street Titans, $40,000 Soon?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-insider-reveals-demand-from-wall-street-titans/",
    "description": "Paul Brody, a prominent figure in the blockchain community and the Global Blockchain Leader at Ernst &#38; Young (EY), recently shed light on the burgeoning demand for crypto, with Bitcoin taking the limelight. Earlier today, during a CNBC interview, Brody emphasized the heightened interest, particularly from family offices. Family Offices Lead The Charge According to Brody, family offices, which typically manage the vast wealth of affluent families, are increasingly diversifying their portfolios with cryptocurrencies. This is not entirely surprising, given the meteoric rise of Bitcoin and its potential as a hedge against inflation and economic uncertainty. Related Reading: Bitcoin’s Next Move: Is $30,000 Just Around The Corner? Glassnode Founder Predicts However, while family offices are diving headfirst into the crypto pool, institutional investors are more cautious. Brody mentions that these larger entities, controlling over 200 trillion dollars in assets, are awaiting regulatory clarity, such as the approval of a Bitcoin ETF by the US Securities and Exchange Commission, before committing significant resources. Bitcoin, despite comparisons, is distinctly different from traditional assets like gold. Brody highlights a unique trait of Bitcoin: its price does not result in increased issuance. Instead, the issuance of new Bitcoin reduces over time due to halving events. This property makes its price more &#8220;rigid,&#8221; especially compared to other assets traditionally used as inflation hedges. Moreover, the purpose behind acquiring Bitcoin varies among its buyers. Brody points out: If you look at people who are buying Bitcoin, they are buying it as an asset. They are not buying it as a payment tool. Brody further notes that Ethereum, another major cryptocurrency, is mostly acquired for its utility as a computing platform, particularly for business transactions and decentralized finance (DeFi) solutions. Bitcoin To $40,000? So far, Bitcoin has showcased a bullish trend, witnessing a near 10% increase over the past week and a 4.7% uptick in the last 24 hours. This surge has propelled Bitcoin to trade beyond the $31,000 mark, reaching $31,824 recently. Observing the asset&#8217;s chart in the 1-day timeframe, BTC seems poised for even higher gains. As shown below, the asset has recently tapped into an order block and could continue its reversal to the upside, reaching a notable high. Additionally, considering the strong institutional demand for BTC, as revealed by Brody, coupled with the potential approval of a spot BTC ETF, a rally to the $40,000 mark seems to be on the horizon. Furthermore, peering into the future of the financial landscape, Brody believes that traditional fiat currencies will continue to hold their ground. However, with the ongoing discussions around Central Bank Digital Currencies (CBDCs) and the growing adoption of payment stablecoins, the crypto realm may be poised for evolution.  Related Reading: Binance Traders Go Bearish On Bitcoin, But Here’s Why They Might Regret It With global political developments unfolding and pivotal elections on the horizon, Brody foresees Bitcoin and the broader crypto space experiencing accelerated growth in adoption and recognition. Featured image from iStock, Chart from TradingView"
  }
]