[
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T18:21:10.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Grayscale Investments has announced a shake-up in its board of directors, with the firm's CEO and president both stepping down. Meanwhile, Tether Treasury minted another one billion “authorized but not issued” USDT on Christmas Day, triggering some skepticism from the community. Elsewhere, there are emerging reports that creditors of the defunct crypto exchange Mt. Gox have started to receive some repayments in fiat.</p><p>Crypto investment firm Grayscale Investments has <a href=\"https://cointelegraph.com/news/grayscale-barry-silbert-resigns-board\">announced the resignation</a> of two prominent executives from its board of directors — and the addition of three new people effective Jan. 1, 2024. </p><p>According to a Dec. 26 filing with the United States Securities and Exchange Commission (SEC), Grayscale confirmed that Digital Currency Group CEO Barry Silbert and president Mark Murphy will exit the board. New members Mark Shifke, Matthew Kummell and Edward McGee were announced as their replacements.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-26T18:36:49.000Z",
    "title": "Japan considers tax relief for domestic firms holding crypto",
    "url": "https://cryptobriefing.com/japan-considers-tax-relief-domestic-firms-holding-crypto/?utm_source=feed&utm_medium=rss",
    "description": "If approved, these reforms to Japan's Corporate Tax Law are slated to take effect in the 2024 fiscal year."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-26T18:23:06.000Z",
    "title": "While Bitcoin Stumbles, Get Ready for Polygon (MATIC), Avalanche (AVAX) and Aave (AAVE) as 2024's Top Altcoins",
    "url": "https://cryptodaily.co.uk/2023/12/while-bitcoin-stumbles-get-ready-for-polygon-matic-avalanche-avax-and-aave-aave-as-2024s-top-altcoins",
    "description": "Embark on the dramatic shift in the crypto landscape as 2023 ends. Find out how Bitcoin's dominance is fading and making way for rising stars like Polygon (MATIC), Avalanche (AVAX), and Aave (AAVE). Dive into our article to see how these altcoins are redefining the market with groundbreaking technology and what this means for the future of cryptocurrency. Don't miss out on the thrilling evolution of the crypto world!"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T18:21:21.000Z",
    "title": "FTX saga: what happened to FTX and Sam Bankman-Fried in 2023",
    "url": "https://crypto.news/ftx-saga-what-happened-to-ftx/",
    "description": "Explore the comprehensive breakdown of what happened to FTX in 2023: from Sam Bankman-Fried going to jail to his ex-girlfriend&#8217;s confessions. The crypto industry has always been filled with captivating stories of massive success, overnight failures, notorious scams, and overwhelming&#8230;"
  }
]