[
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T22:55:49.000Z",
    "title": "Elizabeth Warren criticizes upcoming closed-door AI summit between senators, tech leaders",
    "url": "https://cryptoslate.com/elizabeth-warren-criticizes-u-s-senators-upcoming-closed-door-ai-summit/",
    "description": "<p>Senator Elizabeth Warren criticized a series of upcoming meetings with AI industry leaders in a conversation with NBC on Sept. 12. There, Warren commented on the closed nature of proceedings, stating: &#8220;These tech billionaires want to lobby Congress behind closed doors with no questions asked. That’s just plain wrong &#8230; They [want to] shape regulation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elizabeth-warren-criticizes-u-s-senators-upcoming-closed-door-ai-summit/\">Elizabeth Warren criticizes upcoming closed-door AI summit between senators, tech leaders</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-12T22:47:00.000Z",
    "title": "$XRP Investment Products Outshine Other Cryptocurrencies Amid Outflows",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xrp-investment-products-outshine-other-cryptocurrencies-amid-outflows/",
    "description": "Cryptocurrency investment products have seen a total of $59 million of outflows, marking the fourth consecutive week of outflows that has brought the total of this run to $294 million. Despite these outflows, $XRP-focused investment products saw $700,000 of inflows. According to CoinShares’ latest Digital Asset Fund Flows Weekly report, the $294 million outflows represent 0.9% of the […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T23:00:22.000Z",
    "title": "Institutional Investors Flee Ethereum Amid Plunge Toward $1,500",
    "url": "https://www.newsbtc.com/news/ethereum/institutional-investors-ethereum/",
    "description": "Institution crypto investors have been pulling out of the market for the better part of this year, especially as the bear market has taken hold. However, Ethereum has suffered way more than other assets in this regard with outflows dragging total assets under management (AuM) down. This comes as Ethereum has struggled after falling below the $1,600 support. Institutional Investors Pull Out Of Ethereum In the latest iteration of its Digital Asset Fund Flows Weekly Report, alternative asset manager CoinShares has revealed a growing aversion from institutional investors toward Ethereum. Related Reading: Analysts Are Bullish On ADA But Price Keeps Tanking, What’s Going On? This is characterized by a tremendous amount of outflows spanning months that has caused its asset under management to decline faster than any other crypto asset. The outflow trend also continued into last week as a total of $4.8 million flowed out of Ethereum funds. According to CoinShares, this brings the total year-to-date outflows for the digital asset to $108 million. This figure also represents 1.6% of Ethereum’s total assets under management, the largest percentage of outflows of any asset. This trend points to a waning interest in Ethereum from institutional investors. It is even more glaring given that altcoins such as XRP saw inflows of $0.7 million as investors pulled out of Ethereum. The asset manager put forward that this means that Ethereum is “the least loved digital asset amongst ETP investors this year.” ETH price struggles below $1,600 &#124; Source: ETHUSD on Tradingview.com Bitcoin Not Left Out While Ethereum has undoubtedly not been a favorite of institutional investors, it was not the only large cryptocurrency plagued by outflows last week. Bitcoin, once again, saw the largest outflow volumes for the week with $69 million leaving Bitcoin funds. This is in contrast to short Bitcoin which saw a 5-month high weekly inflow of $15 million. Blockchain equities also suffered from another week of outflows totaling $10.8 million this time around. In total, the current run of outflows has seen $294 million leave crypto and blockchain-related funds, accounting for 0.9% of the total assets under management. Related Reading: Ethereum Whales Send $486 Million To Coinbase, Time To Exit? This bearish sentiment among institutional investors is also highlighted by the fact that trading volumes saw a massive decline. The asset manager reported that volumes were just $754 million for last week, a 73% drop from the previous week’s figures. Despite last week’s negative sentiment, this week seems to be working out better for the top assets with Bitcoin and Ethereum seeing trading volumes on crypto exchanges jump 96.28% and 41.16%, respectively. This could be signaling a coming reversal after a rocky weekend. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]