[
  {
    "source": "CoinDesk",
    "date": "2023-11-24T17:42:37.000Z",
    "title": "Tether, Bitfinex to Drop Opposition to New York Freedom of Information Law Request",
    "url": "https://www.coindesk.com/business/2023/11/24/tether-bitfinex-to-drop-opposition-to-new-york-freedom-of-information-law-request/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firms said opposition doesn't mean a \"wholesale release\" of all documents."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-24T17:54:47.000Z",
    "title": "Axie Infinity Starts Giving NFT Owners Commercial Rights as Official Merch Drops",
    "url": "https://decrypt.co/207402/axie-infinity-starts-giving-nft-owners-commercial-rights-official-merch-drops",
    "description": "Sky Mavis has launched a merch store for its Axie Infinity game IP, and is also allowing a small portion of its NFTs to be used commercially by owners."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T17:58:12.000Z",
    "title": "Price analysis 11/24: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, LINK, AVAX ",
    "url": "http://cointelegraph.com/news/price-analysis-11-24-btc-eth-bnb-xrp-sol-ada-doge-ton-link-avax",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5ffc06a1-5365-4936-a33d-327eac0c92dd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin has risen above $38,000, clearing the path for a rally higher. Will altcoins follow?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) broke above the overhead resistance of $38,000 on Nov. 24, indicating that the sentiment is positive and bulls have kept up the pressure. Independent Reserve CEO Adrian Przelozny told Cointelegraph that the “next two years are going to be good,” and <a href=\"https://cointelegraph.com/news/bull-market-just-getting-started-exchange-execs\">market activity is likely to pick up</a> in early 2024.</p><p>The major catalysts for next year is the Bitcoin halving in April and applications for a spot Bitcoin exchange-traded fund, some of which have a <a href=\"https://cointelegraph.com/news/cathie-wood-ark-spot-bitcoin-etf-amend\">deadline for a decision in January</a>. With two main events on the horizon, Bitcoin is likely to find buyers on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4f34340b-dd61-4e81-8b4f-8cf0a5eee4f3.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p><a href=\"https://cointelegraph.com/news/bitcoin-buyer-btc-price-past-38k-traders-key-breakout\">Analysts expect a retracement from $40,000</a> in the near term. That could be one of the reasons why Cathie Wood’s investment firm, ARK Invest, <a href=\"https://cointelegraph.com/news/cathie-wood-ark-dumps-700k-gbtc-month\">has been gradually selling into strength</a>. The firm sold about 700,000 shares of the Grayscale Bitcoin Trust (GBTC) over the past month, but it is worth noting that ARK still holds more than 4.3 million GBTC shares.</p><p>Could crypto traders bulldoze their way through the overhead resistance levels in Bitcoin and major altcoins? What are the important levels to watch out for?</p><p>Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin pierced the stiff resistance of $37,980 on Nov. 24, but the bulls are struggling to sustain the breakout. This suggests that the bears are vigorously guarding the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f2e98578-d59a-4bac-b725-e58c08063e4f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Both moving averages are sloping up, and the relative strength index (RSI) is above 61, indicating that the path of least resistance is to the upside. If buyers maintain the price above $37,980, the BTC/USDT pair could reach $40,000. </p><p>This level may again witness a tough battle between the bulls and the bears, but if the buyers prevail, the pair could skyrocket to $48,000. Time is running out for the bears. If they want to weaken the momentum, they will have to sink the price below the 20-day EMA. The short-term trend will turn negative below $34,800.</p><h2>Ether price analysis</h2><p>The bulls pushed Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) above the resistance line on Nov. 22, suggesting the start of the next leg of the up-move. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ce3cf681-a305-4913-ad2c-e90151502711.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears tried to pull the price back below the resistance line on Nov. 23, but the bulls held their ground. This suggests that the bulls are trying to flip the resistance line into support. If they succeed, the ETH/USDT pair could start a northward march toward $2,200. </p><p>This level may again act as a formidable resistance, but if bulls overcome it, the pair will complete a large ascending triangle pattern. That could open the gates for a potential rally to the pattern target of $3,400.</p><p>This bullish view will be invalidated in the near term if the price turns down and plummets below the vital support at $1,900.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) jumped above $235 on Nov. 22, but the bulls could not overcome the obstacle at the 20-day EMA ($239). This suggests that bears are trying to take control.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a4c6800a-06bd-46a9-98ab-adae5539a405.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA has started to turn down, and the RSI is just below the midpoint, indicating a minor advantage to the bears. The short-term trend will turn negative on a break and close below the crucial support at $223. That could clear the path for a fall to $203.</p><p>If bulls want to prevent the downside, they will have to push and sustain the price above the 20-day EMA. The BNB/USDT pair may then spend some more time inside the large range between $223 and $265.</p><h2>XRP price analysis</h2><p>The bulls are trying to shove XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) above the 20-day EMA ($0.62), which suggests strong buying at lower levels. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/2622de0e-b1cb-4d6e-8a5f-8d41fa96cb36.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA has flattened out, and the RSI is near the midpoint, indicating range-bound action in the short term. The XRP/USDT pair may swing between $0.56 and $0.74 for a few days.</p><p>If the price rises and sustains above the 20-day EMA, the pair could gradually climb to $0.67 and thereafter to $0.74. Buyers will have to overcome this hurdle to indicate the start of a new up-move. </p><p>Conversely, if the price turns down from the current level and breaks below $0.56, it will signal the start of a sharper correction to $0.46. </p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been trying to break above the $59 resistance for the past two days, but the bears have held their ground. A minor positive in favor of the bulls is that they have not ceded ground to the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7dfbc290-1c64-4f92-8859-3944bf9fc9a7.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The rising 20-day EMA ($52.80) and the RSI in the positive territory suggest that bulls have the upper hand. That enhances the prospects of a rally above the overhead resistance. If that happens, the SOL/USDT pair could ascend to $68.</p><p>Contrary to this assumption, if the price turns down from the current level, the bears will strive to tug the pair below the 20-day EMA. If they can pull it off, the pair may drop to $48, where buyers are likely to step in.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) has been swinging above and below the $0.38 level for the past few days. This shows uncertainty about the next directional move between the bulls and the bears .</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/5cbd5f62-99a1-47e9-82ec-9185fd09949c.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The upsloping moving averages and the RSI in the positive territory indicate that the bulls have a slight edge. If the price rises above $0.40, it will signal the start of a new up-move to $0.42 and later to $0.46.</p><p>If bears want to trap the aggressive bulls, they will have to yank the price below $0.34. That may result in a fall to the 50-day SMA ($0.31). The ADA/USDT pair may then oscillate between $0.24 and $0.38 for a while longer.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been maintaining above the 20-day EMA ($0.08) for the past two days, but the rise lacks momentum. This indicates that bulls are cautious at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/8a94271f-9d88-4c30-9dde-082a7be4c0f0.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Buyers will have to propel the price above $0.08 to signal strength. The DOGE/USDT pair could then surge toward the target objective of $0.10. This level may again witness a tough battle between the bulls and the bears.</p><p>If the price turns down from $0.08, it will suggest that bears remain active at higher levels. The pair may then drop to the immediate support at $0.07. The flattish 20-day EMA and the RSI just above the midpoint do not give a clear advantage either to the bulls or the bears. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/enjoy-sub-40k-bitcoin-plan-b-100k-average-btc-price-2024\"><strong><em>‘Enjoy sub-$40K Bitcoin’ — PlanB stresses $100K average BTC price from 2024</em></strong></a></p><h2>Toncoin price analysis</h2><p>Buyers are trying to push Toncoin (TON) to the overhead resistance of $2.59. The repeated retest of a resistance level tends to weaken it. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/2370122b-3d25-41b7-bb5e-3de044e1f9e6.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If bulls drive and sustain the price above the $2.59 to $2.77 resistance zone, it will complete a cup-and-handle pattern. That could start a new uptrend to $3.28 and thereafter to the pattern target of $4.03. </p><p>Alternatively, if the TON/USDT pair turns down from the overhead resistance, it will suggest that bears are fiercely protecting the level. That could result in a move down to the 50-day SMA ($2.20). A slide below this level will open the doors for a fall to $2 and subsequently to $1.89.</p><h2>Chainlink price analysis</h2><p>Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) is facing selling at the downtrend line, as seen from the long wick on the Nov. 23 candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fe014aa5-eca5-43fd-ae14-33b49d284040.png\"  /><figcaption style=\"text-align: center;\"><em>LINK/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AlinkUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>However, the bulls have not given up and have again pushed the price to the downtrend line. The price is stuck between the downtrend line and the 61.8% Fibonacci retracement level of $12.83. This has resulted in a squeeze, likely resolving with a sharp move on either side.</p><p>If the price surges above the downtrend line, the LINK/USDT pair may climb to $16.60 and then to $18.30. Instead, if the price turns down and plunges below $12.83, the decline could extend to the 50-day SMA ($11.21).</p><h2>Avalanche price analysis</h2><p>Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) has reached the overhead resistance at $22, which is an important level to watch out for. The bears are expected to defend this level with vigor. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/13b36b0a-c561-495b-9e10-8bf53e4bd51d.png\"  /><figcaption style=\"text-align: center;\"><em>AVAX/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AavaxUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>However, if bulls do not give up much ground from the current level, it will increase the likelihood of a break above $22. The pair may then climb to $25 where the bears are likely to mount a strong defense.</p><p>On the downside, the 20-day EMA ($18.40) remains the key level to keep an eye on. If the price turns down and slips below this level, it will suggest the start of a deeper correction to $16. Such a move will indicate that the AVAX/USDT pair may spend some more time inside the large range between $10.50 and $22.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-24T17:54:24.000Z",
    "title": "Argentina’s Central Bank Shutdown is Non-Negotiable Says Pro-Bitcoin Government",
    "url": "https://cryptobriefing.com/argentina-central-bank-shutdown-non-negotiable/?utm_source=feed&utm_medium=rss",
    "description": "Argentina's new president Javier Milei reaffirms his pledge to shut down the central bank, seeking to return money creation to the private sector."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T18:00:19.000Z",
    "title": "Market Watch: These 5 Altcoins Are Poised For Breakouts, Says Crypto Expert",
    "url": "https://www.newsbtc.com/altcoin/market-watch-these-5-altcoins-are-poised-for-breakouts/",
    "description": "A recent analysis by a Crypto Banter pinpointed new notable price levels for prominent altcoins such as  XRP, Solana (SOL), Chainlink (LINK), Fantom (FTM), and Polygon (MATIC). These insights provide a fresh perspective on potential entry points for bullish positions in the current market. Related Reading: Whale Alert: Big Players Scoop Up These 4 Altcoins, On-Chain Data Indicates Altcoins At Crossroads: Key Price Levels To Watch In this analysis, Crypto Banter singles out Solana (SOL) and notes that $48 is an &#8220;intriguing&#8221; level to watch for any pullback. Additionally, historical data consolidating around this price point on the SOL/USD weekly chart indicates it could be an &#8220;optimal&#8221; buying zone should prices drop to this mark. In the case of Chainlink (LINK), Crypto Banter identifies $13.3 down to $12.2 as a &#8220;hot zone.&#8221; A drop below this range might shift focus to the $9 level as a critical reversal point. Polygon (MATIC) also comes under scrutiny, with the analyst observing a break in the 200-day moving average on its weekly chart timeframe. According to the host, this development suggests a potential bounce back at the $0.68 zone, possibly preluding a rally. For clarity, &#8220;moving average,&#8221; or MA, is a widely used indicator in technical analysis that helps unravel price data by creating a constantly updated average price. This average is typically calculated over a specific period, like 10 days, 20 minutes, 30 weeks; in the case of the Crypto Banter analysis, they based their analysis on the 200-day MA. Fantom&#8217;s Surge And XRP&#8217;s Pivotal Turnaround On the other hand, Fantom (FTM), Crypto Banter, revealed that the altcoin has shown a significant pump of over 50% since late October. Yet, the analyst suggests a possible retraction towards the 200-day moving average, making the $0.25 region attractive, particularly for those employing a dollar-cost averaging (DCA) strategy. XRP is not left out of this analytical purview. The host points out that XRP is nearing a critical juncture from a technical standpoint. The analyst reveals that the 12-hour chart for XRP shows a recent rebound off the 50-day MA. A turnaround around the $0.54 price region could occur if the ongoing pattern along the downward trendline persists. The analyst further disclosed that this level gains importance due to the convergence of key moving averages that form a support zone around it. Related Reading: 3 Altcoins Set To Skyrocket In Next Crypto Bull Run, According To Analyst Interestingly, among the altcoins highlighted by Crypto Banter as primed for a breakout, SOL and FTM stand out with significant gains. Over the past two weeks, Solana has seen a 13.8% increase, while FTM has climbed by 8.3%. Contrastingly, XRP, LINK, and MATIC  have experienced declines during the same period. XRP&#8217;s price fell by 5.5%, LINK by 5.6%, and MATIC by 6.6%, signaling a diverse performance landscape among these notable altcoins. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T17:51:03.000Z",
    "title": "TeddySwap: The Game-Changer for Cardano DeFi Ecosystem",
    "url": "https://www.crypto-news-flash.com/teddyswap-the-game-changer-for-cardano-defi-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=teddyswap-the-game-changer-for-cardano-defi-ecosystem",
    "description": "<img width=\"1000\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />TeddySwap, the latest addition to the Cardano DeFi ecosystem, has garnered significant liquidity, attracting 502,000 ADA (approximately $196,000) shortly after its initial launch. TeddySwap&#8217;s launch coincides with Cardano&#8217;s notable growth in the DeFi sector, surpassing Bitcoin in total value locked (TVL) and reaching a new all-time high in ADA terms. The Cardano DeFi landscape has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T17:42:44.000Z",
    "title": "JPMorgan Warns of $2.7 Billion Exodus as Grayscale Bitcoin Trust Eyes ETF Conversion",
    "url": "https://www.crypto-news-flash.com/jpmorgan-warns-of-2-7-billion-exodus-as-grayscale-bitcoin-trust-eyes-etf-conversion/?utm_source=rss&utm_medium=rss&utm_campaign=jpmorgan-warns-of-2-7-billion-exodus-as-grayscale-bitcoin-trust-eyes-etf-conversion",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/jp-morgan1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/jp-morgan1.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/jp-morgan1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/jp-morgan1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/jp-morgan1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/jp-morgan1-1536x864.jpg 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />According to JP Morgan, a staggering $2.7 billion could exit the cryptocurrency market as Graysacle attempts to make a product conversion.  Grayscale is reportedly looking to convert its Grayscale Bitcoin Trust (GBTC) to a Bitcoin Spot ETF. In the light of recent developments, JP Morgan is making bold predictions about the potential choices that Bitcoin [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T18:00:00.000Z",
    "title": "Paytience Unveils All-Inclusive Trading Suite and Membership",
    "url": "https://coinedition.com/paytience-unveils-all-inclusive-trading-suite-and-membership/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Paytience-Unveils-All-Inclusive-Trading-Suite-and-Membership-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Paytience is set to launch an all-inclusive trading indicator suite and membership on November 24. Developed with custom-built and proprietary algorithms, this suite aims to provide traders with analytical insights to enhance their market understanding. The Paytience memberships offer access to current and future trading indicators, along with other exclusive benefits. Paytience’s announcement claimed that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/paytience-unveils-all-inclusive-trading-suite-and-membership/\">Paytience Unveils All-Inclusive Trading Suite and Membership</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T18:04:29.000Z",
    "title": "$18,745,000 To Be Handed Out With No Strings Attached As New Guaranteed Income Programs Launch in Four States",
    "url": "https://dailyhodl.com/2023/11/24/18745000-to-be-handed-out-with-no-strings-attached-as-new-guaranteed-income-programs-launch-in-four-states/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-guaranteed-income.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New guaranteed income programs are launching in four states across the US. A total of $18.745 million will be handed out to people and families with no strings attached in Georgia, Florida, Maryland and California. The city of San Jose, California is rolling out a guaranteed income program geared toward addressing youth homelessness. Organized by the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/18745000-to-be-handed-out-with-no-strings-attached-as-new-guaranteed-income-programs-launch-in-four-states/\">$18,745,000 To Be Handed Out With No Strings Attached As New Guaranteed Income Programs Launch in Four States</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T17:59:08.000Z",
    "title": "Binance Labs and BNB Chain Open New Founder-Focused Track To Incubate 100 Early-Stage Projects",
    "url": "https://dailyhodl.com/2023/11/24/binance-labs-and-bnb-chain-open-new-founder-focused-track-to-incubate-100-early-stage-projects/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BNB-Smart-Chain-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>November 24, 2023 – Dubai, United Arab Emirates Binance Labs, in partnership with BNB Chain and CMC Labs, has introduced a new &#8216;founder track&#8217; to the MVB (Most Valuable Builder) accelerator program. MVB, now in its seventh season, is an accelerator program jointly organized by Binance Labs and BNB Chain. The program was launched in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/binance-labs-and-bnb-chain-open-new-founder-focused-track-to-incubate-100-early-stage-projects/\">Binance Labs and BNB Chain Open New Founder-Focused Track To Incubate 100 Early-Stage Projects</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T17:55:44.000Z",
    "title": "Mt. Gox Trustee Says Processing of Payments To Start Before the End of This Year, To Continue in 2024",
    "url": "https://dailyhodl.com/2023/11/24/mt-gox-trustee-says-processing-of-payments-to-start-before-the-end-of-this-year-to-continue-in-2024/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/dispels-gox-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The rehabilitation trustee for crypto exchange Mt.Gox has sent out emails announcing the commencement of payments to creditors of the now-defunct platform. According to the email shared on social media, Nobuaki Kobayashi plans to start distributing payouts before the end of the year. “The Rehabilitation Trustee plans to commence repayment to creditors shortly. The Rehabilitation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/mt-gox-trustee-says-processing-of-payments-to-start-before-the-end-of-this-year-to-continue-in-2024/\">Mt. Gox Trustee Says Processing of Payments To Start Before the End of This Year, To Continue in 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]