[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T14:00:00.000Z",
    "title": "Italy’s Central Bank Taps Polygon, Fireblocks DeFi Project to Help Institutions Dabble With Tokenized Assets",
    "url": "https://www.coindesk.com/business/2023/07/26/italys-central-bank-taps-polygon-fireblocks-defi-project-to-help-institutions-dabble-with-tokenized-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The initiative aims to help Italian banks, asset managers and financial institutions, including the $1 trillion banking group Intesa Sanpaolo, experiment with decentralized  finance and security tokens."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T14:01:02.000Z",
    "title": "Italian Central Bank-Backed Hub Taps Polygon, Others to Bring TradFi Deeper Into DeFi",
    "url": "https://decrypt.co/150169/italian-central-bank-backed-hub-partners-polygon-others-bring-tradfi-deeper-defi",
    "description": "The aim is to create an environment where more TradFi institutions can get involved in DeFi minus the risks facing retail investors. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T14:00:55.000Z",
    "title": "Negative adjustment in Bitcoin difficulty",
    "url": "https://cryptoslate.com/insights/negative-adjustment-in-bitcoin-difficulty/",
    "description": "<p>Quick Take Bitcoin difficulty has seen a downward adjustment of 3% today. Remarkably, this marks the ninth negative adjustment in difficulty over the last year. Impacts of Texas Heatwave on Hash Rate The recent negative trend in difficulty adjustments can be partly attributed to the intense summer heatwave experienced in Texas. This weather phenomenon has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/negative-adjustment-in-bitcoin-difficulty/\">Negative adjustment in Bitcoin difficulty</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T13:55:29.000Z",
    "title": "Singapore High Court declares cryptocurrency as property, rules in favor of ByBit in trust case",
    "url": "https://cryptoslate.com/singapore-high-court-declares-cryptocurrency-as-property-rules-in-favor-of-bybit-in-trust-case/",
    "description": "<p>A Singaporean High Court has ruled that cryptocurrency is a property capable of being held in trust, according to a July 25 ruling. ByBit vs. Miss Ho The court reached this decision in a case involving Seychelles-based crypto exchange ByBit which alleged that a contractor Miss Ho Kai Xin, breached the terms of her employment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/singapore-high-court-declares-cryptocurrency-as-property-rules-in-favor-of-bybit-in-trust-case/\">Singapore High Court declares cryptocurrency as property, rules in favor of ByBit in trust case</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-26T13:58:34.000Z",
    "title": "Avalanche Foundation Commits $50M Initiative for Asset Tokenization",
    "url": "https://cryptobriefing.com/avalanche-foundation-commits-50m/?utm_source=feed&utm_medium=rss",
    "description": "The Avalanche Foundation is set to start up to $50M to acquire tokenized assets minted on its own blockchain. The initiative, Avalanche Vista, expands the use of tokenization, the process..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-26T13:55:03.000Z",
    "title": "Ripple Shines in Fortune’s 2023 List of Top Workplaces for Millennials",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ripple-shines-in-fortunes-2023-list-of-top-workplaces-for-millennials/",
    "description": "Californian FinTech firm Ripple has been honored by Fortune Magazine as one of the top workplaces for millennials in 2023. This recognition places Ripple in the spotlight, highlighting its commitment to creating an engaging and inclusive work environment. Ripple’s excitement was palpable as they took to Twitter to share the news, expressing their gratitude for […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T14:04:00.000Z",
    "title": "Deloitte, Chainalysis Partner Up To Achieve Crypto Compliance",
    "url": "https://cryptodaily.co.uk/2023/07/deloitte-chainalysis-partner-up-to-achieve-crypto-compliance",
    "description": "<p>Deloitte and Chainalysis have joined forces in a strategic alliance to tackle compliance challenges within the digital asset ecosystem.&nbsp;</p>\nPartnership To Assist Law Enforcement\n<p>Deloitte and Chainalysis are stepping up to meet the increasing demand for risk management technology solutions and services. By combining Chainalysis' blockchain dataset and cutting-edge analytics software and training program with Deloitte's services, both firms aim to help their mutual clients navigate the complexities of compliance, forensic investigations, and risk management.</p>\n<p>The partnership comes at a crucial time when regulators are clarifying their expectations surrounding digital assets, law enforcement agencies are enhancing their blockchain tracing capabilities, and financial institutions are formulating their strategies for dealing with digital assets.&nbsp;</p>\nChainalysis: Partnership In Works For Years\n<p>Blockchain data platform, Chainalysis operates globally, providing data, software, and services to various organizations, including government agencies, financial institutions, and cybersecurity companies. Their expertise in investigation, compliance, and market intelligence software has been instrumental in solving significant criminal cases and promoting safe cryptocurrency usage.</p>\n<p>Thomas Stanley, President and Chief Revenue Officer of Chainalysis, expressed his enthusiasm for the alliance, stating,&nbsp;</p>\n\n<p>\"For law enforcement agencies, regulators, and financial ecosystem players across the nation, the alliance offers new, collaborative solutions that help identify transformation gaps, accelerate mission success at enterprise scale, and mitigate risk while increasing revenue.\"</p>\n\nMeeting Market Demand For Risk Management Technology\n<p>Through this collaboration, both companies will assist their clients in implementing state-of-the-art forensic, investigative, and compliance programs. Chainalysis will work closely with Deloitte's blockchain and digital assets practice, offering expertise in cryptocurrency and digital asset risk, analytics, investigation, anti-money laundering/know your customer (AML/KYC), and regulatory compliance.&nbsp;</p>\n<p>Deloitte, a prominent firm offering audit, consulting, tax, and advisory services to renowned brands and private companies worldwide, will expand its pool of practitioners trained and certified in using Chainalysis products for blockchain analytics and investigations.</p>\n<p>Tim Davis, Deloitte's Advisory Blockchain and Digital Asset practice lead, highlighted the importance of their commitment to providing clients with cutting-edge solutions in the ever-evolving landscape of digital assets.&nbsp;</p>\n<p>He said,&nbsp;</p>\n\n<p>\"As digital asset adoption and proliferation continues, Deloitte is committed to advising our clients on leading thinking and approaches to risk management, analytics use, and regulatory compliance. Our new alliance with Chainalysis is another demonstration of Deloitte's investment in its digital asset innovation ecosystem for the benefit of our clients.\"</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T13:54:27.000Z",
    "title": "Hip-Hop Culture or AI Innovations? Thug Life and Shiba Memu’s Coin Strategies",
    "url": "https://www.cryptopolitan.com/hip-hop-culture-or-ai-innovations-thug-life-and-shiba-memus-coin-strategies/",
    "description": "The meme coin market is more than a playful escape; it’s a barking symphony composed of various breeds of culture, technology, and finance. Shiba Memu (SHMU) and Thug Life (THUG) are two canine contenders in this space, each dancing to a unique beat. Whether it&#8217;s the AI-driven innovations of Shiba Memu or the hip-hop inspired ... <a title=\"Hip-Hop Culture or AI Innovations? Thug Life and Shiba Memu&#8217;s Coin Strategies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hip-hop-culture-or-ai-innovations-thug-life-and-shiba-memus-coin-strategies/\" aria-label=\"More on Hip-Hop Culture or AI Innovations? Thug Life and Shiba Memu&#8217;s Coin Strategies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T13:52:14.000Z",
    "title": "Bitcoin Price Predictions: Implications for Gamblers and Casinos",
    "url": "https://www.cryptopolitan.com/bitcoin-price-predictions-implications-for-gamblers-and-casinos/",
    "description": "It took less than three years since Bitcoin hit the scene for the first online casinos powered by this cryptocurrency to get rolling. Bitcoin revolutionized online casino gambling by bringing faster transaction speeds, greater anonymity when gambling, and, most recently, provably fair gaming.&#160; However, not everything is sunshine and rainbows with Bitcoin. BTC&#8217;s volatility has ... <a title=\"Bitcoin Price Predictions: Implications for Gamblers and Casinos\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-predictions-implications-for-gamblers-and-casinos/\" aria-label=\"More on Bitcoin Price Predictions: Implications for Gamblers and Casinos\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T13:48:23.000Z",
    "title": "How Much You Need to Pay for Your Casino Winnings When Using Crypto?",
    "url": "https://www.cryptopolitan.com/how-much-you-need-to-pay-for-your-casino-winnings-when-using-crypto/",
    "description": "Cryptocurrency has drastically changed the landscape of the online economy, and this digital revolution has not left the gambling industry untouched. The allure of fast, secure transactions and the potential for anonymity has resulted in an increasing number of online gamblers switching to cryptocurrencies like Bitcoin, Ethereum, and many others for their betting activities. This ... <a title=\"How Much You Need to Pay for Your Casino Winnings When Using Crypto?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-much-you-need-to-pay-for-your-casino-winnings-when-using-crypto/\" aria-label=\"More on How Much You Need to Pay for Your Casino Winnings When Using Crypto?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T14:00:41.000Z",
    "title": "LayerZero Crosses This Significant Milestone, But Is An Airdrop Coming?",
    "url": "https://www.newsbtc.com/news/blockchain/layerzero-significant-milestone-airdrop/",
    "description": "Cross-Chain communication protocol platform LayerZero has crossed 50 million cross-chain messages, as revealed by the platform on Tuesday, July 25. This significant milestone proves the massive trading activity and cross-chain token swaps that happen across several chains daily. LayerZero’s Impressive Growth The ‘50-million cross-chain messages’ is undoubtedly a testament to how much LayerZero has achieved in the space. Due to the project’s disruptive vision, it has received enormous backing from some of the ecosystem&#8217;s biggest Venture Capitalists (VC).  Related Reading: Fundstrat Predicts Bitcoin Will Reach $180,000 In 2024, But What’s The Catalyst? Three months ago, LayerZero raised $120 million from prominent backers like auction company Christie&#8217;s, renowned VC firms Sequoia Capital and Andreessen Horowitz, Capital market company Samsung Next, OpenSea Ventures, and Circle Ventures. What is more impressive is that LayerZero was valued at $3 billion during this Series B funding round, almost three times its $135 million valuation during the funding round held back in 2022.  This remarkable feat has also come during the lingering crypto bear market when many have felt that the outlook in the industry will be negative. That is why it is easy to share the sentiments of the CEO of LayerZero Labs when he stated: LayerZero is to blockchains what the internet was to computing clusters. LayerZero allows chains not only to build bridges (to transfer assets/value between them) but send and execute arbitrary data just like a packet on the internet. What this means is that you can now build applications that are orders of magnitude more complex than existing applications and do so with a completely seamless experience between chains. Blockchain interoperability remains the foremost issue in the Web3 space. Furthermore, this has greatly hindered some from venturing into the space, and it is well-known that if crypto is to enjoy mainstream adoption, this issue needs to be dealt with. That is why interoperability protocols like LayerZero are key in the blockchain ecosystem.  It is common knowledge that the interoperability issue stems from how blockchains have different protocols and standards that make them incompatible. However, platforms like LayerZero bridge this gap by facilitating seamless and direct communication between different blockchain networks, making it easy for users on networks like Ethereum, Aptos, Solana, and SUI to move their digital assets across these chains. “Wen Airdrop?” The question of if LayerZero will carry out an airdrop has been on the lips of many members of the LayerZero community. Although the team has been tight-lipped over whether or not there will indeed be an airdrop to users, the signs are becoming more glaring that one may, in fact, be on the horizon. Related Reading: Worldcoin Founder’s Refusal To Answer Token Distribution Question Sparks Controversy With so much success in the last year and so much money raised, it is possible that LayerZero is already working on its native token. If the platform was looking to reward the users who have supported it all this time, then an airdrop would be the most likely avenue to do so. However, with no talk of even a token launch, it is hard to determine if LayerZero will conduct an airdrop. Total market cap resumes recovery trend &#124; Source: Crypto Total Market Cap on TradingView.com Featured image from Mirror.xyz, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T14:00:45.000Z",
    "title": "Cronos (CRO) and Quant (QNT) Holders Buy Into the Pomerdoge (POMD) Presale. Likely to be the Best Crypto Meme Of 2023",
    "url": "https://www.crypto-news-flash.com/cronos-cro-and-quant-qnt-holders-buy-into-the-pomerdoge-pomd-presale-likely-to-be-the-best-crypto-meme-of-2023/?utm_source=rss&utm_medium=rss&utm_campaign=cronos-cro-and-quant-qnt-holders-buy-into-the-pomerdoge-pomd-presale-likely-to-be-the-best-crypto-meme-of-2023",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114629.999.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114629.999.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114629.999-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114629.999-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cronos (CRO) and Quant (QNT) have been struggling with their negative price movement for a while. Therefore, investors started searching for more favorable options which would maintain their gains.  Fortunately, there is a new project that comes with amazing perks, such as weekly giveaways and revenue percentages. This amazing project is Pomerdoge. It even comes [...]"
  }
]