[
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T05:16:59.000Z",
    "title": "Singapore central bank to trial live wholesale CBDC for settlements",
    "url": "http://cointelegraph.com/news/singapore-central-bank-trial-live-wholesale-cbdc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/157b91e7-efb0-462b-ac75-625267bf2957.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Monetary Authority of Singapore has unveiled its plan to launch a live wholesale CBDC used for settlements by local banks. </p>\n                    <p><p>A pilot program for a live Singapore dollar-based central bank digital currency (CBDC) was unveiled by Singapore’s central bank with a wholesale CBDC to be used by local banks for settlements.</p><p> “I am pleased to announce that MAS will pilot the ‘live’ issuance of wholesale CBDCs to instantaneously settle payments across commercial banks,” MAS Managing Director Ravi Menon said on Nov. 16 at the Singapore Fintech Festival.</p><p>The MAS had previously <a href=\"https://cointelegraph.com/news/singapore-s-mas-says-no-urgent-case-for-retail-cbdc-but-launches-4-fast-trials-of-it\">only simulated the issuance of a CBDC</a> in test environments, Menon said the central bank would soon partner with Singaporean banks to test using a CBDC as a settlement asset for domestic payments. </p><p>As part of the test program, Menon explained banks will issue tokenized liabilities that represent claims on their balance sheets. Retail customers could use those tokenized liabilities to transact with merchants, which would be settled via an automatic transfer of a wholesale CBDC. </p><p>The MAS had previously <a href=\"https://cointelegraph.com/news/singapore-s-mas-says-no-urgent-case-for-retail-cbdc-but-launches-4-fast-trials-of-it\">only simulated the issuance of a CBDC</a> in test environments, Menon said the central bank would soon partner with Singaporean banks to test using a CBDC as a settlement asset for domestic payments. </p><p>“Clearing and settlement thus occur in a single step, on the same infrastructure, unlike the current system in which clearing and settlement take place on different systems, and settlement occurs with a lag,” he said.</p><p>A wholesale CBDC is primarily used by central and commercial banks and other large financial institutions to settle payments. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paxos-singapore-issue-usd-stablecoin-after-license-approval\"><strong><em>Paxos to issue USD stablecoin in Singapore, wins initial approval</em></strong></a></p><p>On Nov. 15, the MAS <a href=\"https://cointelegraph.com/news/singapore-five-pilots-test-asset-tokenization\">introduced five additional industry pilots</a> to its financial infrastructure test program — dubbed Project Guardian — to assess various use cases around asset tokenization. </p><p>The new partnerships saw the project expand from 12 to 17 members, now including major financial institutions such as BNY Mellon, HSBC, and Citi Group. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/cf3c0a38-cb97-4764-ba2f-d04b4c119799.jpg\"  /><figcaption style=\"text-align: center;\"><em>Project Guardian members include big banks Citi, HSBC and BNY Mellon. Source: mas.gov.sg</em></figcaption></figure><p>On May. 1, the MAS and the New York Federal Reserve <a href=\"https://cointelegraph.com/news/ny-fed-and-mas-publish-joint-cbdc-cross-border-payment-project-results\">published the results</a> of a six-year-long trial program of a CBDC’s utility in cross-border payment, dubbed Project Ubin. The results showed that CBDCs were potentially useful in making cross-border payments more efficient and cost-effective. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-incredible-rags-riches-tale-polygon-sandeep-nailwal/\"><strong><em>Slumdog billionaire — Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T05:18:49.000Z",
    "title": "AVAX Price Prediction: Avalanche Bulls Are Just Getting Started",
    "url": "https://www.newsbtc.com/analysis/avax/avax-price-prediction-avalanche-bulls-aim-30/",
    "description": "AVAX price rallied over 50% and climbed above $22.50. The price might correct lower but there could be more upsides above $25. AVAX price is showing a few positive signs above the $20 level against the US dollar. The price is trading above $22 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $20.50 on the 4-hour chart of the AVAX/USD pair (data source from Kraken). The pair could continue to rise if there is a clear move above the $24.50 and $25.00 resistance levels. AVAX Price Doubles In Value In Few Days After forming a base above the $10.00 level, Avalanche’s AVAX started a major rally, outperforming Bitcoin and Ethereum. There was a clear move above the $15 and $20 resistance levels. The price gained over 50% in the past few days and even cleared the $22.50 resistance. A new multi-week high was formed near $24.70 and the price is now consolidating gains. There was a minor decline below the $22.50 level. The price declined below the 23.6% Fib retracement level of the upward move from the $15.59 swing low to the $24.70 high. However, the bulls were active above $20.00. AVAX price is now trading above $22.00 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $20.50 on the 4-hour chart of the AVAX/USD pair. On the upside, an immediate resistance is near the $24.50 zone. Source: AVAXUSD on TradingView.com The next major resistance is forming near the $25.00 zone. If there is an upside break above the $24.50 and $25.00 levels, the price could surge over 20%. In the stated case, the price could rise steadily towards the $30 level. Dips Limited in Avalanche? If AVAX price fails to continue higher above the $24.50 or $25.00 levels, it could start a downside correction. Immediate support on the downside is near the $22.50 level. The main support is near the $20.50 zone. A downside break below the $20.50 level could open the doors for a fresh decline towards $18. The next major support is near the $15.50 level. Technical Indicators 4 hours MACD – The MACD for AVAX/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for AVAX/USD is now above the 50 level. Major Support Levels – $22.50 and $20.50. Major Resistance Levels – $24.50, $25.00, and $30.00."
  }
]