[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T04:00:34.000Z",
    "title": "Iris Energy Boosts Mining Capacity With $19.6M Acquisition of Bitmain’s S21 Antminers",
    "url": "https://news.bitcoin.com/iris-energy-boosts-mining-capacity-with-19-6m-acquisition-of-bitmains-s21-antminers/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Iris Energy Boosts Mining Capacity With $19.6M Acquisition of Bitmain&#039;s S21 Antminers\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/main-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/main.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Nasdaq-listed bitcoin mining company Iris Energy has announced its acquisition of 1.4 exahash per second (EH/s) of Bitmain&#8217;s latest S21 Antminers. This acquisition will increase the company&#8217;s self-mining capacity by 25%, from 5.6 EH/s to 7 EH/s. Nasdaq-Listed Iris Energy Bolsters Mining Arsenal with Latest Next-Gen Mining Rig Purchase Just over two weeks ago, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T04:00:34.000Z",
    "title": "History’s Warning: Is Ethereum Set For A Huge Plunge? Here Is What This Analyst Predicts",
    "url": "https://www.newsbtc.com/news/ethereum/history-warning-is-ethereum-set-for-a-huge-plunge/",
    "description": "Ethereum (ETH) has maintained its spot as a leading altcoin. However, a recent analysis from Benjamin Cowen indicates that its journey, at least in comparison to Bitcoin (BTC), could have followed a better trajectory.  In a space where past trends can sometimes indicate future outcomes, ETH’s price behavior, when viewed against BTC, offers a tale of potential concern. Related Reading: Is Ethereum’s Staking Boom A Ticking Time Bomb? JPMorgan Weighs In Ethereum Stumbling Blocks In 2023 A leading voice in the crypto analytical community, Benjamin Cowen, expressed his lack of enthusiasm for ETH&#8217;s performance in 2023 during a YouTube video. The ETH / BTC valuation, a critical metric for gauging relative performance, is the bedrock for his statements. According to his observations from monthly charts, Cowen&#8217;s analysis primarily orbits around the ETH / Bitcoin valuation, which has trended downwards. The analyst cites patterns from 2019, a pre-halving year, where ETH&#8217;s value relative to BTC fell significantly. That year alone, the ETH / BTC valuation declined by about 49%. According to the analyst, fast forward to 2023, and ETH&#8217;s comparative valuation has already plummeted by 20.56%. If Cowen&#8217;s prediction and the patterns from 2019 hold any water, Ethereum could be staring down a deeper abyss. Yet, it&#8217;s not all bleak. Cowen remains measured, as he acknowledges the change the nature of &#8220;The Merge&#8221; brought on Ethereum’s ecosystem, believing it is a &#8220;game changer.&#8221; While Cowen wasn&#8217;t overly optimistic, the analyst refrained from forecasting ETH’s next moves, primarily due to the unpredictable ripple effects of The Merge. The Merge: A Game-Changing Variable? The Merge, a much-anticipated Ethereum upgrade, has already marked its influence on the ETH / BTC valuation. Ethereum&#8217;s weekly charts have been in a continuous downtrend following its implementation, creating further lows. Cowen recognizes that The Merge, with its deflationary component, could mean ETH might not toe its historical line. This deflationary aspect could be Ethereum&#8217;s wild card, making its trajectory even more elusive. Notably, while many parallels might be drawn between 2019 and 2023, such updates as The Merge means that Ethereum&#8217;s journey this year might still hold a few surprises. Related Reading: Here’s Why The Ethereum Price Fell Toward $1,500 Meanwhile, the Ethereum price against the US dollar has seen quite a bearish trend, particularly over the past week. The second largest crypto by market capitalization has plunged nearly 5% in the past 7 days, bringing its price to fall below $1,600 with a current trading price of $1,569. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T03:52:25.000Z",
    "title": "Shiba Inu’s Mastermind Shytoshi Kusama Drops Bombshell on Shibarium Future",
    "url": "https://www.crypto-news-flash.com/shiba-inus-mastermind-shytoshi-kusama-drops-bombshell-on-shibarium-future/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-mastermind-shytoshi-kusama-drops-bombshell-on-shibarium-future",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"shibarium\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shibarium lead developer Shytoshi Kusama has hinted what the future of the protocol looks like. Focus is on boosting scalability, security and overall functionality. Shiba Inu&#8217;s lead developer Shytoshi Kusama has hinted at some future plans for Shibarium, the Ethereum-based layer-2 scaling solution.  With the recent increase in validator&#8217;s rewards on the platform, the L2 [...]"
  }
]