[
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T20:36:57.000Z",
    "title": "Elon Musk’s Twitter-to-Doge logo switch raised as evidence in lawsuit",
    "url": "https://cryptoslate.com/elon-musks-twitter-to-doge-logo-switch-raised-as-evidence-in-class-action-suit/",
    "description": "<p>New facts and evidence concerning Elon Musk&#8217;s crypto trading and promotional activity were highlighted in an amended legal case on May 31. The latest filing brings forward new evidence of Musk&#8217;s alleged market manipulation. Twitter logo stunt highlighted Plaintiffs note in the filing that Musk briefly replaced Twitter&#8217;s bird logo with the Dogecoin logo. This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elon-musks-twitter-to-doge-logo-switch-raised-as-evidence-in-class-action-suit/\">Elon Musk&#8217;s Twitter-to-Doge logo switch raised as evidence in lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T20:12:10.000Z",
    "title": "OKX Proposes Industry-First BRC-30 Token Standard to Enable Bitcoin and BRC-20 Token Staking",
    "url": "https://cryptodaily.co.uk/2023/06/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking",
    "description": "<p>SAN FRANCISCO, UNITED STATES, June 1st, 2023, Chainwire</p><ul><li>With BRC-30, OKX Wallet users will soon be able to stake BRC-20 tokens and Bitcoin to earn passive income on their digital assets</li></ul><p>OKX, a leading Web3 company, today introduced its proposal for a new, open-source BRC-30 protocol that enables staking of BRC-20 tokens and Bitcoin in order to earn BRC-30 tokens. The protocol is open-source and available for all developers to build upon.</p><p>OKX Wallet will add support for the BRC-30 standard according to the protocol, enabling users to earn passive income by staking BRC-20 tokens or Bitcoin on Web3 Earn without actively trading. This complements the existing range of curated DeFi earning products already available through the platform.</p><p>The introduction of BRC-30 and its staking functionalities is driven by OKX's goal to provide users with additional opportunities to participate in the Bitcoin ecosystem and earn passive income.</p>OKX Chief Innovation Officer Jason Lau said: \"We're thrilled to have proposed and pioneered the BRC-30 standard to enable Bitcoin and BRC-20 token staking. With the OKX Wallet soon to incorporate BRC-30 support, users will be able to access Bitcoin staking and earn opportunities across multiple-chains. With the Bitcoin ecosystem seeing an explosion of new development, we're proud to work with developers and projects across the community to contribute to the growth of the wider ecosystem.\"<p>OKX is a longstanding supporter of Bitcoin, having integrated the Lightning Network to its centralized exchange over two years ago. OKX Wallet is also the first multi-chain wallet to support BRC-20 trading with the launch of its Ordinals Marketplace, as well as the viewing and transfer of Bitcoin Ordinals.</p><p>About OKX</p><p>A leading global technology company driving the future of Web3, OKX provides a comprehensive suite of products to meet the needs of beginners and experts alike, including the OKX Wallet, NFT Marketplace, DEX and Web3 Earn.</p><p>OKX partners with a number of the world's top brands and athletes, including: English Premier League champions Manchester City F.C., McLaren Formula 1, The Tribeca Festival, golfer Ian Poulter, Olympian Scotty James, and F1 driver Daniel Ricciardo.</p><p>As a leader building innovative technology products, OKX believes in challenging the status quo. The company recently launched a global brand campaign entitled, The System Needs a Rewrite, which advocates for a new paradigm led by Web3 self-managed technology to replace existing centralized systems.</p><p>To learn more about OKX, download our app or visit: okx.com</p><p>Disclaimer</p><p>THIS ANNOUNCEMENT IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE, SELL, OR HOLD DIGITAL ASSETS. DIGITAL ASSETS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. OKX IS NOT REGULATED BY THE FCA, THUS, PROTECTIONS SUCH AS THE FINANCIAL OMBUDSMAN SERVICE OR FINANCIAL SERVICES COMPENSATION SCHEME WILL NOT BE AVAILABLE. YOU SHOULD CONSIDER WHETHER YOU UNDERSTAND HOW CRYPTO WORKS AND WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. THE VALUE OF YOUR DIGITAL ASSETS, INCLUDING STABLECOINS, CAN INCREASE OR DECREASE AND PROFITS MAY BE SUBJECT TO CAPITAL GAINS TAX. PAST PERFORMANCE DOES NOT INDICATE FUTURE RESULTS. OKX IS NOT ASSOCIATED WITH ANY PARTICULAR DEFI PROTOCOL, MAKES NO WARRANTIES, REPRESENTATIONS OR UNDERTAKINGS RELATING TO ANY DEFI PROTOCOL&rsquo;S OFFERINGS, AND IS NOT RESPONSIBLE OR LIABLE FOR ANY DIRECT OR INDIRECT LOSS OR OTHER DAMAGE ARISING FROM YOUR USE OF ANY DEFI PROTOCOL. OKX WALLET IS AN AGGREGATOR; ALL DISPLAYED ESTIMATED RETURN RATES ARE PROVIDED BY THE DEFI PROTOCOL, AND ARE NOT GUARANTEED NOR INDICATIVE OF FUTURE RETURNS. PLEASE CONDUCT YOUR OWN DUE DILIGENCE BEFORE INVESTING IN ANY DEFI PROTOCOL. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES.</p>ContactOKXmedia@okx.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T20:13:23.000Z",
    "title": "OKX Proposes Industry-First BRC-30 Token Standard to Enable Bitcoin and BRC-20 Token Staking",
    "url": "https://www.crypto-news-flash.com/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking/?utm_source=rss&utm_medium=rss&utm_campaign=okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking",
    "description": "<p>SAN FRANCISCO, UNITED STATES, June 1st, 2023, Chainwire With BRC-30, OKX Wallet users will soon be able to stake BRC-20 tokens and Bitcoin to earn passive income on their digital assets OKX, a leading Web3 company, today introduced its proposal for a new, open-source BRC-30 protocol that enables staking of BRC-20 tokens and Bitcoin in [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking/\">OKX Proposes Industry-First BRC-30 Token Standard to Enable Bitcoin and BRC-20 Token Staking</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]