[
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T07:43:00.000Z",
    "title": "DoJ Moves Over 9000 BTC Seized From Silk Road",
    "url": "https://cryptodaily.co.uk/2023/07/doj-moves-over-9000-btc-seized-from-silk-road",
    "description": "<p>The bitcoins were seized from the Silk Road hacker. The government has plans to sell the remaining BTC in batches over the year.</p>\n<p>It looks like the U.S. Department of Justice(DoJ) is finally moving the BTC reserves it seized from the Silk Road. The notorious online marketplace, which was predominantly used for illicit activities and operated using Bitcoin for transactions, was taken down by U.S. authorities in October 2013. Here is what Wu Blockchain tweeted:</p>\n\n<p>\"Breaking: The Silk Road BTC-related addresses which are suspected to be seized by the US Department of Justice, are transferring more than 9k BTC.&nbsp; https://oklink.com/btc/address/bc1qmxjefnuy06v345v6vhwpwt05dztztmx4g3y7wp?tab=commonTxThe U.S. government previously sold 9,800 BTC on March 14 and said it plans to sell another 41,500 BTC related to Silk Road in four batches within a year.\"</p>\n\n<p>In November 2022, the US DoJ seized &gt;50,000 bitcoins from James Zhong &ndash; the infamous Silk Road hacker. The transfer was noted across two addresses linked with the DoJ, while the remaining portion of the Bitcoin haul remained untouched. As per Wu Blockchain, the U.S. government plans to sell the remaining bitcoins over the year.</p>\nTransactions facing confirmations delays\n<p>These transactions faced confirmation delays mainly due to the low transaction fees allocated by the DoJ. The DoJ has made two transactions with a combined $8 in transaction fees. The last time they sold the government sold the seized BTC, they paid over $215,000 in transaction fees, as per court filings. Interestingly, many have noted that by liquidating bitcoin instead of holding on to it, the government has missed out on $5.6 billion. As the practice of seizing cryptocurrencies from illegal activities becomes more common, the financial implications of how and when to sell these assets will become increasingly significant.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-13T07:47:30.000Z",
    "title": "Bitcoin Market Response To US CPI Report",
    "url": "https://nulltx.com/bitcoin-market-response-to-us-cpi-report/",
    "description": "The recent inflation report in the US indicates that inflation rose only by 0.2% in June, which can be seen as positive news for owners of equities, gold, and silver. Surprisingly, the impact of this Consumer Price Index (CPI) report on the cryptocurrency market, particularly Bitcoin, has been minimal so far. However, there has been [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-13T07:55:52.000Z",
    "title": "XRP faltering as digitoads and dogecoin meme coins gain traction",
    "url": "https://crypto.news/xrp-faltering-as-digitoads-and-dogecoin-meme-coins-gain-traction/",
    "description": "The SEC-Ripple lawsuit is a fight for sustainability. However, the market is constantly seeing promising projects emerge. One such platform is DigiToads, which is showing great potential"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-13T08:00:57.000Z",
    "title": "Why Is Bitcoin And Crypto Down Today?",
    "url": "https://www.newsbtc.com/news/why-is-bitcoin-and-crypto-down-today/",
    "description": "Within the last 24 hours, Bitcoin and the entire crypto market are experiencing a slight downturn, leaving investors wondering about the reasons behind this dip. Bitcoin briefly rose to $31,009 before falling to 30,254 within a few hours. Ether (ETH) rose to over $1,900, only to drop back to $1,868. CPI Data And The Anticipation Of A Rate Hike One crucial piece of the puzzle lies in the recent Consumer Price Index (CPI) data. Yesterday&#8217;s CPI data for June was a positive surprise as the headline CPI year-over-year (YoY) fell to 3.0%, coming in below expectations of 3.1%. Even more encouraging was core CPI YoY which dropped to 4.8%, surpassing market expectations of 5.0%. Related Reading: CPI Data For June Is A Bullish Surprise For Bitcoin And Crypto However, this didn&#8217;t significantly alter the market&#8217;s view on the upcoming rate hike decision by the Federal Reserve at the end of the month. According to the CME FedWatch Tool, the market still expects a 25 bps hike by the Fed at the next meeting on July 25-26 with a 93% probability. Renowned macro analyst Ted (@tedtalksmacro) is in the minority that believes there won&#8217;t be another rate hike. Ted shared the chart below and wrote: 3m annualized core CPI now running at October 2021 levels. The trend is the Fed&#8217;s friend. Hard to see another hike this month. Other analysts, however, believe that the core Personal Consumption Expenditures Price Index (PCE) is more important for the Fed. In the most recent release of FOMC minutes, PCE is mentioned ten times compared vs. three mentions of CPI. The Fed&#8217;s favored inflation gauge for June will not be released until 28 July. US Government Selling Bitcoin However, it is important to note that following the positive inflation data, traditional markets were setting new highs. The S&#38;P500 rose by 0.74% yesterday and recorded its highest level since April 2022. Meanwhile, Bitcoin still could&#8217;t sustainably break $31,000 in its 6th attempt. Related Reading: Silk Road’s Ghosts Haunt Bitcoin Market As US Government Moves 9,800 BTC The reason was likely the news that the US government is moving 9,800 BTC linked to the infamous Silk Road marketplace. The news broke shortly after the release of the CPI and drastically dampened sentiment. In the past, news that the US government is moving and possibly selling some of its Bitcoin always triggered severe price drops. Yesterday&#8217;s drop can still be considered moderate and an indicator of market strength. So far, there is only speculation about the US government&#8217;s plans. It is known that the US intends to liquidate the seized BTC holdings. The last time this happened was in March. Back then, 9,861 Bitcoin were sold. However, the transfers could also only be used to restructure the BTC holdings. Probably the reason #Bitcoin couldn’t rally despite the positive CPI surprise (SPX +0.83%). 👇 https://t.co/93iiWlHNvm — Jake Simmons (@realJakeSimmons) July 12, 2023 BTC Stuck In Range Additionally, the market activity itself is playing a significant role. Traders actively engage in strategies such as longing at the bottom and shorting at the top of the current Bitcoin range. As analyst Skew aptly puts it, &#8220;Most are playing the range well, hedging near range highs &#38; flipping long around range lows.&#8221; This trading behavior creates a dynamic environment where short-term price movements can be influenced by the actions of traders seeking to capitalize on market volatility. Skew added: BTC Aggregate CVDs &#38; Delta still a very derivative driven market with lack of spot participation yet = chop chop. Decent long sweep around $30.2K + demand between current price &#38; $30K. Could see a take profit or short covering bounce some time later today. At press time, the BTC price was at $30,431 and remained comfortably in the trading range between $29,800 and $31,300. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T07:59:43.000Z",
    "title": "Compound Coin Price Volume Suffers, Tradecurve Aims for a Piece of a $632T Market",
    "url": "https://www.crypto-news-flash.com/compound-coin-price-volume-suffers-tradecurve-aims-for-a-piece-of-a-632t-market/?utm_source=rss&utm_medium=rss&utm_campaign=compound-coin-price-volume-suffers-tradecurve-aims-for-a-piece-of-a-632t-market",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T095335.161.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T095335.161.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T095335.161-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is going towards a rough phase for some altcoins. Compound has seen a significant decrease in its trading volume, leading many to be bearish on its future price performance.  In contrast, Tradecurve is an upcoming project that is dominating the charts. It enables entry into the $632 trillion global OTC derivatives market [...]"
  }
]