[
  {
    "source": "CoinDesk",
    "date": "2023-09-07T15:18:21.000Z",
    "title": "UK Crypto Firms Can Apply for 3-Month Reprieve to Comply With Tough New Ad Rules",
    "url": "https://www.coindesk.com/policy/2023/09/07/uk-crypto-firms-can-apply-for-3-month-reprieve-to-comply-with-tough-new-ad-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bans on aggressive marketing were set to take effect in October, but companies can apply to delay some aspects until January."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-07T15:11:07.000Z",
    "title": "Crypto Exchange Kraken's UK Derivatives Unit Looking to Expands Its Service: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/09/07/crypto-exchange-krakens-uk-derivatives-unit-looking-to-expands-its-service-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm is looking move into a void in the crypto derivatives market left when FTX collapsed last November."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T15:26:33.000Z",
    "title": "Binance to reimburse users $1M for Cyber Earn incident",
    "url": "https://cointelegraph.com/news/binance-reimburses-users-1-million-tether-cyber-earn-incident",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5245b06b-85c5-4e6d-9378-932bbd1e73e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Users were prevented from withdrawing their CYBER Earn assets on the exchange due to a cross-chain bridging issue. </p>\n                    <p><p>Crypto exchange Binance is refunding users 1 million Tether ($1 million) over its handling of the CyberConnect (CYBER) token incident.</p><p>As <a href=\"https://www.binance.com/en/support/announcement/notice-regarding-cyber-simple-earn-flexible-products-3b2317d533e848958499ba0043653364\" target=\"_blank\" rel=\"noopener nofollow\">narrated</a> by the exchange on Sept. 7, a price discrepancy on listed CYBER tokens occurred the week prior due to a liquidity crunch constricting CYBER cross-chain bridges on Korean cryptocurrency exchange Upbit. This led to arbitrageurs borrowing CYBER from Binance to profit from the differential. In turn, Binance users who staked CYBER in its Flexible Earn Program were barred from redemptions as the staked assets had been borrowed, reaching the loan limit. The exchange stated:</p><blockquote>\"Other than Proof-of-Stake (PoS) based products, a large part of crypto flexible financial products generate income by lending out subscribed assets to other users via Margin or collateralized loans. Under extreme conditions, borrowers may not be able to repay their loans in time, or the redemptions of subscribed assets may experience some delays. This was the case on 2023-08-31.\"</blockquote><p>Moving forward, Binance said it will take action to increase interest rates on staked assets to deter lending during periods of high token volatility. </p><p>For remedies, the exchange offered 800,000 Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) to 887 impacted users who could not redeem their CYBER products during the incident, along with 871 CYBER in accrued staking rewards. Another 200,000 USDT worth of vouchers, sponsored by the CyberConnect Foundation, will be distributed to all users who staked CYBER via Binance Flexible Earn during the incident, regardless of whether they chose to redeem their tokens. The firm also wrote:</p><blockquote>\"Binance reserves the right in its sole discretion to amend or cancel this announcement at any time and for any reasons without prior notice.\"</blockquote><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-creates-smart-contract-refund-users-affected-rug-pull\">Binance creates smart contract to refund users affected by $3M rug pull</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T15:15:27.000Z",
    "title": "Palau to discontinue dollar-based stablecoin two months after launch",
    "url": "https://cryptoslate.com/palau-to-discontinue-dollar-based-stablecoin-two-months-after-launch/",
    "description": "<p>Palau will end the pilot program of its U.S. Dollar-backed stablecoin efforts later this month, according to a Sept. 7 post on X by Jay Hunter, the country&#8217;s head of digital residency. Hunter revealed that the distribution of the Palau Stablecoin (PSC) will cease by this Friday, Sept. 8. He advised holders of the asset [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/palau-to-discontinue-dollar-based-stablecoin-two-months-after-launch/\">Palau to discontinue dollar-based stablecoin two months after launch</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-07T15:25:25.000Z",
    "title": "Top 3 Cryptos for Long-Term Growth – Solana, Chainlink and Everlodge",
    "url": "https://cryptodaily.co.uk/2023/09/top-3-cryptos-for-long-term-growth-solana-chainlink-and-everlodge",
    "description": "Those looking for high-growth altcoins will typically follow analysts and experts to see which ones can provide them with massive long-term returns."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-07T15:18:48.000Z",
    "title": "Which Meme Coin Will Dominate in September – Shiba Inu, Pepe, or Pomerdoge?",
    "url": "https://cryptodaily.co.uk/2023/09/which-meme-coin-will-dominate-in-september-shiba-inu-pepe-or-pomerdoge",
    "description": "The meme coin industry has seen the emergence of different tokens in recent years with notable mentions being Shiba Inu (SHIB) and Pepe (PEPE)."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T15:33:20.000Z",
    "title": "Top Companies Using AI to Transform the Healthcare Industry",
    "url": "https://www.cryptopolitan.com/companies-using-ai-to-transform-healthcare/",
    "description": "The healthcare industry is one of the major sectors where artificial intelligence is being explored and applied the most. Several organisations and medical practitioners are increasingly harnessing technology to transform the healthcare industry, improve patient care, reduce costs, and streamline administrative processes. In February, WSJ reported about doctors who are using AI technology to help ... <a title=\"Top Companies Using AI to Transform the Healthcare Industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/companies-using-ai-to-transform-healthcare/\" aria-label=\"More on Top Companies Using AI to Transform the Healthcare Industry\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T15:28:18.000Z",
    "title": "FASB implements new accounting rules for cryptocurrencies",
    "url": "https://www.cryptopolitan.com/fasb-accounting-rules-for-cryptocurrencies/",
    "description": "The Financial Accounting Standards Board (FASB) has unanimously voted to implement changes in how companies account for and disclose their holdings of cryptocurrencies like Bitcoin and other digital assets. These new rules are set to take effect starting in 2025, with the primary goal of providing investors and financial statement users with greater transparency concerning ... <a title=\"FASB implements new accounting rules for cryptocurrencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fasb-accounting-rules-for-cryptocurrencies/\" aria-label=\"More on FASB implements new accounting rules for cryptocurrencies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T15:10:55.000Z",
    "title": "What Are The Immediate Regulatory Actions For A Safer And Innovative Crypto Market Future?",
    "url": "https://www.cryptopolitan.com/regulatory-actions-for-crypto-market-future/",
    "description": "The cryptocurrency market is a double-edged sword. On the one hand, it offers unprecedented financial freedom, lower transaction costs, and a level of anonymity that traditional financial systems can&#8217;t match. On the other hand, it&#8217;s a breeding ground for fraud, money laundering, and a host of other illegal activities. The question is no longer whether ... <a title=\"What Are The Immediate Regulatory Actions For A Safer And Innovative Crypto Market Future?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/regulatory-actions-for-crypto-market-future/\" aria-label=\"More on What Are The Immediate Regulatory Actions For A Safer And Innovative Crypto Market Future?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T15:10:15.000Z",
    "title": "Manilla Finance Unveils Highly Anticipated ICO to Revolutionize the Web 3.0 Landscape",
    "url": "https://www.cryptopolitan.com/manilla-finance-unveils-highly-anticipated-ico-to-revolutionize-the-web-3-0-landscape/",
    "description": "Manilla Technologies, a groundbreaking Web 3.0 company, is excited to announce the Initial Coin Offering (ICO) for its foremost product; Manilla Finance, set to launch on September 1st, 2023 is now live and running. The ICO represents a significant milestone for the company and the financial industry as a whole, promising to reshape the way ... <a title=\"Manilla Finance Unveils Highly Anticipated ICO to Revolutionize the Web 3.0 Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/manilla-finance-unveils-highly-anticipated-ico-to-revolutionize-the-web-3-0-landscape/\" aria-label=\"More on Manilla Finance Unveils Highly Anticipated ICO to Revolutionize the Web 3.0 Landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T15:10:12.000Z",
    "title": "Maker (MKR) Gains 10% In A Week, VC Spectra (SPCT) Is Set for A 32% Surge",
    "url": "https://www.cryptopolitan.com/maker-mkr-gains-10-in-a-week-vc-spectra-spct-is-set-for-a-32-surge/",
    "description": "In recent days, the cryptocurrency market has shown signs of a long-awaited recovery, with several top altcoins regaining their upward momentum. Among these, Maker (MKR) stands out, experiencing a notable surge following the CEO&#8217;s revealing of a strategic plan. Yet, VC Spectra (SPCT) is poised to make an even more significant impact, potentially overshadowing MKR&#8217;s ... <a title=\"Maker (MKR) Gains 10% In A Week, VC Spectra (SPCT) Is Set for A 32% Surge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/maker-mkr-gains-10-in-a-week-vc-spectra-spct-is-set-for-a-32-surge/\" aria-label=\"More on Maker (MKR) Gains 10% In A Week, VC Spectra (SPCT) Is Set for A 32% Surge\">Read more</a>"
  }
]