[
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T11:33:02.000Z",
    "title": " Ex-UK Chancellor faces scrutiny over lobbying allegations ",
    "url": "https://cointelegraph.com/news/ex-uk-chancellor-scrutiny-lobbying-allegations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTczYjNhYmUtNjZhOC00NTMwLWJiN2YtNWI2Yjk2OGFhOWMyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Lord Philip Hammond, a vocal crypto advocate who served as the United Kingdom’s Chancellor of the Exchequer from 2016 to 2019, may have breached lobbying rules for former ministers. </p>\n                    <p><p>Lord Philip Hammond, a vocal crypto advocate serving as the United Kingdom’s Chancellor of the Exchequer from 2016 to 2019, might have breached the lobbying rules for former ministers. </p><p>As <a href=\"https://www.ft.com/content/53ea6108-a9dc-4437-ac0e-8f215d78867b\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> by the Financial Times on Feb. 9, in March 2021, Hammond played a role in the communication between then Economic Secretary for the Treasury, John Glen and the unnamed Treasury officials on one side, and the CEO of crypto firm Copper, Dmitry Tokarev, on the other. The claim is based on the Treasury documents obtained through a Freedom of Information Act request.</p><p>In March 2021, Hammond played a role in the communication between the then Economic Secretary for the Treasury, John Glen and the unnamed Treasury officials on one side, and the CEO of crypto firm Copper, Dmitry Tokarev, on the other. The claim, <a href=\"https://www.ft.com/content/cfe191c8-fc88-4455-aa1c-27e14e749c11\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> the Financial Times on Feb. 9, is based on Treasury documents obtained through a Freedom of Information Act request.</p><p><a href=\"https://cointelegraph.com/news/ex-uk-chancellor-scrutiny-lobbying-allegations\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T11:24:08.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Spot Bitcoin exchange-traded funds in the United States racked up $403 million on Feb. 8, recording the third-largest daily inflow. BlackRock and Fidelity's spot Bitcoin ETFs have scooped up more assets in a month than any other newly launched ETF in 30 years in the United States. Meanwhile, cryptocurrency exchange Kraken has secured regulatory approval to operate in the Netherlands.</p><p>On Feb. 8, spot Bitcoin exchange-traded funds (ETFs) experienced their third-largest influx, totaling $403 million. The large inflows came despite over $100 million exiting the Grayscale Bitcoin Trust (GBTC).</p><p>The total inflow into spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs has already exceeded $2.1 billion since their launch on Jan. 11, indicating a strong demand for BTC in the market. The third-largest inflow day for spot BTC ETFs came as BTC price crossed $46,000 to record a new multiweek high just $2,000 short of new yearly highs.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-09T11:26:38.000Z",
    "title": "Ethereum restaking protocol Eigenlayer TVL surges amid rising ETH staking",
    "url": "https://cryptoslate.com/ethereum-restaking-protocol-eigenlayer-tvl-surges-amid-rising-eth-staking/",
    "description": "<p>EigenLayer, an Ethereum-based restaking protocol, has surged past Uniswap, the foremost decentralized exchange (DEX) on the Ethereum network, regarding total locked value (TVL). Data from DeFillama shows that EigenLayer has emerged as the top-performing decentralized finance (DeFi) protocol over the past month. Its TVL skyrocketed by 171% in the last seven days alone, reaching $5.67 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-restaking-protocol-eigenlayer-tvl-surges-amid-rising-eth-staking/\">Ethereum restaking protocol Eigenlayer TVL surges amid rising ETH staking</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-09T11:20:05.000Z",
    "title": "Shiba Inu Burn Rate Spikes By Nearly 200% As Price Recovers",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-spikes-by-nearly-200-as-price-recovers/",
    "description": "Shiba Inu (SHIB), also known as &#8220;Doge Killer&#8221; within the cryptocurrency space, has experienced a notable increase in its burn rate, with millions of coins taken out of circulation. Shiba Inu Burn Rate Is On Fire According to Shibburn, the platform that tracks Shiba Inu&#8217;s burn, the burn rate has increased significantly in the past day. Data from the tracking platform shows that the burn has risen by almost 200% in the past 24 hours. Related Reading: Shiba Inu Burn Rate Surges Over 1,400%, As Price Recovers Shibburn revealed that over 7 million SHIB tokens have been burnt in the last 24 hours. As of the time of writing, the number of SHIB destroyed is sitting at 7,648,382, resulting in the burn rate soaring by 191.69%. The increase in burn rate today was triggered by two burn transactions. In less than 1 hour, a total of 7,621,237 Shiba Inu tokens were incinerated by the two transactions, according to Shibburn. In the first transaction, the unknown wallet address 0xa9d1e08c7793af6&#8230;7fb81d3e43 burned approximately 3.60 million SHIB over 8 hours ago. An hour later, a separate wallet address delivered about 4.01 million SHIB to the burn wallet. Shiba Inu burn initiative aims at reducing the quantity of SHIB tokens in circulation, hence decreasing the token&#8217;s total supply. As a result, the crypto asset becomes more scarce and potentially increases the value of Shiba Inu. Currently, data from Shibburn shows that Shiba Inu has burned about 410.70 trillion SHIB out of the total supply. The digital asset now boasts a circulating supply of 581.35 trillion SHIB from its initial supply of 999.98 trillion SHIB.  Billions Of SHIB Withdrawn From Coinbase A recent report has revealed a massive shift in SHIB tokens, leaving the community to ponder on the reason behind the transfer. According to Etherscan, an unidentified wallet address 0xe44755&#8230;.240090257 moved a whopping 225 billion SHIB from the decentralized exchange Coinbase. Related Reading: Shiba Inu Whale Accumulates Massive Holdings, Amid Price Recovery Etherscan shows that the withdrawal was carried out over the course of two days in two transactions. 132.22 billion SHIB tokens were transferred from Coinbase in the first transaction, and another 92.83 billion SHIB were sent from the platform on the next day. So far, the unidentified wallet address now solely holds about 225,057,952,422 SHIB valued at $2.10 million. This event has piqued the interest of traders and investors in the crypto market, which further coincided with the recent rise in the price of SHIB. SHIB&#8217;s price is up by over 3% in the past 7 days, presently situated at $0.00000936. Meanwhile, its market cap is up by 2%, and its trading volume is down by over 16% in the past day. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-09T11:13:55.000Z",
    "title": "Hidden Crypto Gems: Top 3 Altcoins Under $1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hidden-crypto-gems-top-3-altcoins-under-1/",
    "description": "<p>Good crypto coins don&#8217;t have to be expensive. There are plenty of solid or promising projects that have tokens or coins under $1. Once they pick up the pace, it&#8217;s quite possible that their price will go over $1.  However, price is not the only criterion to look at. There are plenty of other aspects [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hidden-crypto-gems-top-3-altcoins-under-1/\">Hidden Crypto Gems: Top 3 Altcoins Under $1</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-09T11:18:00.000Z",
    "title": "AVAX Eyes a Return Above $40: Is the Token Undervalued?",
    "url": "https://coinedition.com/avax-eyes-a-return-above-40-is-the-token-undervalued/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/avax21.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/avax21.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/avax21-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/avax21-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/avax21-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/avax21-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/avax21-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/avax21-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/avax21-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/avax21-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/avax21-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/avax21-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/avax21-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/avax21-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/avax21-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/avax21-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/avax21-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After dropping below $30 on January 23, the price of Avalanche (AVAX) has now risen above the level while trading at $36 at press time. According to CoinMarketCap, AVAX was able to rise past the level after a 4.63% increase in the last seven days. But the cryptocurrency, ranked number 9 in market value had [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/avax-eyes-a-return-above-40-is-the-token-undervalued/\">AVAX Eyes a Return Above $40: Is the Token Undervalued?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]