[
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T02:07:25.000Z",
    "title": "Mastercard creates tech to tokenize CBDCs on multiple blockchains",
    "url": "https://cryptoslate.com/mastercard-creates-tech-to-tokenize-cbdcs-on-multiple-blockchains/",
    "description": "<p>Mastercard announced the successful demonstration of a central bank digital currency (CBDC) technology designed to integrate CBDCs with multiple blockchain networks, according to a press release. The technology aims to facilitate the tokenization, or &#8220;wrapping,&#8221; of CBDCs onto different blockchain networks to enhance consumer convenience and transactional security. Australian CBDC pilot Mastercard&#8217;s new solution was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mastercard-creates-tech-to-tokenize-cbdcs-on-multiple-blockchains/\">Mastercard creates tech to tokenize CBDCs on multiple blockchains</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T02:00:13.000Z",
    "title": "Trader Loses $107,000 To MEV Bot Panic Selling Obscure Stablecoin",
    "url": "https://www.newsbtc.com/stablecoin/trader-loses-107000-to-mev-bot-panic-selling-obscure-stablecoin/",
    "description": "Lookonchain, a blockchain tracking platform, now reveals that one stablecoin holder lost over $100,000 after panic selling USDR, a stablecoin issued on the Polygon network, for zero USDC after it depegged on October 11. The stablecoin holder swapped 131,350 USDR for zero USDC, allowing an MEV bot to swoop in and claim $107,000 in profit.  The USDR Depegging, Stablecoin Falls To $0.50 The stablecoin is issued by Tangible protocol, a decentralized finance (DeFi) protocol that claims to be tokenizing housing and other real-world assets. Due to the immutable nature of the Polygon network, the USDR holder is now at a loss.  All on-chain transactions cannot be reversed unless there is a network rollback, which will unwind other transactions as a result should validators choose to do so. However, considering how public ledgers operate, it is improbable that a rollback will be done to recover funds.  Related Reading: Buy LINK Now? Chainlink Touted As ‘Safest Bet’ For This Mega Trend There has yet to be any feedback from the MEV bot operator on whether they can refund the affected user. Since the error was on the swapper&#8217;s side and not the hack, the community&#8217;s response to this mistake remains largely muted. Real USD, USDR, is a stablecoin backed by a blend of other crypto assets and real estate. Considering the stablecoin&#8217;s construction, USDT is interest-bearing, meaning holders receive rewards. It was meant to track the USD but lost its peg on October 11 after a wave of redemptions drained the project&#8217;s treasury of its liquid assets, including DAI.  By the close of October 11, USDR was trading versus the USD at around $0.53, a near 50% drop, triggering panic. Moments after the rapid withdrawal of DAI and liquid assets from its treasury, the team explained that USDR fell to as low as $0.50 before recovering.  Tangible Finance Working On A Recovery Plan Despite the depegging, the USDR issuer said it is working on making holders whole, saying the crisis is mainly &#8220;liquidity related.&#8221; It also attempted to assuage holders, assuring that &#8220;the real estate and digital assets backing USDR still exist and will be used to support redemptions.&#8221; Related Reading: Bitcoin Doom Signal Warns Of 50% Crypto Collapse Updating the community on X, the issuer said it is not &#8220;going anywhere&#8221; and is working on a &#8220;plan&#8221;: Tangible isn’t going anywhere. We have a flywheel that works and plans to continue building within that. A critical part of our shared future success is maintaining the trust we’ve established with our users over the past year, which we hope to maintain through the plan below. Beyond the panic selling and one holder losing over $100,000 to an MEV bot, the extent of the USDR depeg has not been fully quantified. As of October 12, Polyscan data shows over 2,400 USDR holders. In total, they cumulatively control slightly over 45.5 million of the stablecoin. Feature image from Canva, chart from TradingView"
  }
]