[
  {
    "source": "CoinDesk",
    "date": "2023-08-25T07:44:14.000Z",
    "title": "FTX, BlockFi's Customer Data Compromised in Kroll Hack",
    "url": "https://www.coindesk.com/policy/2023/08/25/ftx-blockfis-customer-data-compromised-in-kroll-hack/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A ‘cybersecurity incident’ affected Kroll, which gathers customer claim data on behalf of bankrupt companies."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-25T04:02:02.000Z",
    "title": "Earl Sweatshirt Drops Surprise Album via Gala Music",
    "url": "https://decrypt.co/153674/earl-sweatshirt-drops-surprise-album-via-gala-music",
    "description": "The rapper debuted a long-rumored collaboration with The Alchemist via NFTs, capping off a week of scavenger hunts and frenzied speculation."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-24T22:56:52.000Z",
    "title": "NFL Rivals Game Now Lets You Buy NFTs on iOS and Android",
    "url": "https://decrypt.co/153662/nfl-rivals-game-now-lets-you-buy-nfts-ios-android",
    "description": "Mythical Games rolled out the first wave of marketplace functionality Thursday, enabling NFT purchases within the mobile game."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-24T21:05:31.000Z",
    "title": "AI Researchers Are Teaching Robots to Mimic Human Dexterity",
    "url": "https://decrypt.co/153646/ai-researchers-are-teaching-robots-to-mimic-human-dexterity",
    "description": "From MIT to Stanford, researchers have been using artificial intelligence to improve robotic dexterity and tactile sensing."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T07:20:23.000Z",
    "title": "FTX crypto exchange reports data breach involving claims agent Kroll",
    "url": "https://cointelegraph.com/news/ftx-crypto-exchange-reports-data-breach-involving-claims-agent-kroll",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/891715dc-099b-4a2b-8575-58323654110a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The breach has resulted in the exposure of non-sensitive customer data from specific claimants linked to the ongoing bankruptcy case.</p>\n                    <p><p>Defunct crypto exchange FTX has announced a cybersecurity breach involving its bankruptcy case claims agent, Kroll, in which limited, non-sensitive customer data of specific claimants was exposed. FTX said it is actively overseeing the situation, assuring that account passwords, systems and funds remain unaffected.</p><p>The struggling crypto exchange <a href=\"https://twitter.com/zachxbt/status/1694938997531738511\" target=\"_blank\" rel=\"noopener nofollow\">utilized</a> the X platform on Aug. 25 to notify its customers, creditors and the public about a cybersecurity breach involving its claims agent Kroll. The breach has resulted in the exposure of non-sensitive customer data from specific claimants linked to the ongoing bankruptcy case.</p><p>FTX has stated that Kroll is presently informing the individuals impacted by the cybersecurity event about the steps they can take for their protection. The crypto exchange in bankruptcy clarified that its account passwords and systems remain secure.</p><blockquote>“The incident occurred at Kroll, and Kroll is notifying affected individuals directly with measures that customers can take to protect themselves. FTX account passwords were not maintained by Kroll, and FTX’s own systems were not affected.”</blockquote><p>Furthermore, the FTX Debtors have initiated communication with Kroll and are diligently overseeing the unfolding situation. Kroll has informed the debtors that they have swiftly controlled and addressed the incident. Customers are advised to exercise vigilance against potential fraudulent and scam emails posing as entities involved in bankruptcy proceedings.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A friend just received a phishing email to the email associated with their FTX account. <a href=\"https://t.co/cWy3ykN4B3\">pic.twitter.com/cWy3ykN4B3</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1694938997531738511?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Meanwhile, blockchain investigator ZachXBT <a href=\"https://twitter.com/zachxbt/status/1694938997531738511\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that FTX clients are already receiving fraudulent emails, and the personal information of customers has been compromised.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-can-meet-with-lawyers-outside-of-jail-with-48-hours-notice-says-judge\"><strong><em>Sam Bankman-Fried can meet with lawyers outside of jail with 48 hours’ notice, says judge</em></strong></a></p><p>Celsius Network, a crypto lending platform facing bankruptcy, <a href=\"https://cointelegraph.com/news/celsius-network-s-bungling-shows-why-centralization-can-t-protect-privacy\">experienced a data breach </a>resulting in the exposure of their email records. This breach has had a notable impact on the ongoing bankruptcy reorganization process.</p><p>In the meantime, FTX has enlisted Galaxy Digital, led by Mike Novogratz,<a href=\"https://cointelegraph.com/news/ftx-files-for-galaxy-digital-to-manage-recovered-crypto-holdings\"> to assist in managing its selling, staking and hedging endeavors</a>. This partnership aims to bolster FTX's efforts to mitigate risks linked to market volatility and optimize the returns from its Bitcoin holdings.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T07:12:53.000Z",
    "title": "Mastercard and Binance end crypto card partnership in Latin America: Report",
    "url": "https://cointelegraph.com/news/binance-mastercard-and-binance-end-crypto-card-partnership-in-latin-america",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/77413abf-f5aa-4e4c-87a5-0649ce656005.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Visa also reportedly stopped issuing new co-branded cryptocurrency cards with Binance in Europe as of July.</p>\n                    <p><p>Global payment giant Mastercard is reportedly ending its cryptocurrency card partnership with Binance crypto exchange next month, according to a Bloomberg report. The report didn't divulge the reason for the change, but implied it might be due to increased regulatory scrutiny of the beleaguered crypto exchange.</p><p>Mastercard and Binance will end their four crypto card programmes in Argentina, Brazil, Colombia starting Sept. 22, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-08-24/mastercard-to-end-its-binance-co-branded-card-partnership\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Aug. 24.</p><p>The decision to end the program will not impact any of Mastercard's other crypto card programmes, the firm reportedly said. The wind-down period will allow cardholders to convert any holdings in their Binance wallets, it added.</p><p>The Mastercard and Binance’s prepaid crypto card allows users to make payments in local fiat currencies, funded by their crypto holdings on the exchange.</p><p>The end of the collaboration comes about one year after <a href=\"https://cointelegraph.com/news/binance-and-mastercard-will-launch-prepaid-crypto-cards-in-argentina\">Binance and Mastercard first partnered</a> last August to launch a prepaid card for the residents of Argentina. In early 2023, the firms expanded the partnership with <a href=\"https://cointelegraph.com/news/mastercard-binance-to-launch-their-second-prepaid-crypto-card-in-latin-america\">another prepaid crypto card</a> in Latin America.</p><p>The report hints that the end of the partnership comes in response to renewed regulatory issues of Binance worldwide.</p><p>As previously reported, Binance and its CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao#:~:text=Changpeng%20Zhao%2C%20better%20known%20as,station%20to%20support%20his%20family.\">Changpeng “CZ” Zhao</a> were sued by the United States Securities and Exchange Commission for <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">allegedly violating local securities laws</a>. The U.S. Commodity Futures Trading Commission also filed a lawsuit against Binance for <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">not properly registering with the derivatives regulator</a>.</p><p>Binance has also reportedly been under an investigation by the U.S. Department of Justice for <a href=\"https://cointelegraph.com/news/us-justice-department-investigating-binance-for-violating-russian-sanctions-report\">allowing Russians to use the exchange</a> in violation of U.S. sanctions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-dubs-barred-russian-banks-on-its-platform-as-yellow-and-green-cards\"><strong><em>Binance dubs barred Russian banks on its platform as ‘Yellow’ and ‘Green’ cards</em></strong></a></p><p>According to the new report, Mastercard isn’t the only firm that has been distancing itself from Binance amid its regulatory issues worldwide. Visa also stopped issuing new co-branded cards with Binance in Europe as of July, Binance reportedly said.</p><p>Mastercard, Visa and Binance did not immediately respond to Cointelegraph’s request for comment.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/binance-mastercard-and-binance-end-crypto-card-partnership-in-latin-america&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T06:32:36.000Z",
    "title": "A third of US investors are open to trusting AI financial advice: Survey",
    "url": "https://cointelegraph.com/news/third-us-investors-trust-ai-financial-advice",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b1c6d2f0-d634-457a-a37a-e0f7c7e6fc39.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a recent survey from the Certified Financial Planner Board, 31% of investors said they would be fine to follow AI financial advice without verifying the information.</p>\n                    <p><p>Around one in three United States investors would be open to following AI-generated financial advice without verifying it with another source, according to a recent survey.</p><p>On Aug. 22, the Certified Financial Planner Board of Standards <a href=\"https://www.cfp.net/news/2023/08/cfp-board-survey-investors-trust-ai-more-than-social-media--but-advice-still\" target=\"_blank\" rel=\"noopener nofollow\">released</a> the results of a poll that surveyed over 1,100 adults in early July. </p><p>Only 31% of the respondents had actually received financial planning advice from AI, with  80% recorded some level of satisfaction with the experience. Older respondents were more likely to be satisfied with the experience compared to those under 45 years of age. </p><p>However, nearly a third of all surveyed respondents, whether they have tried it or not, indicated they’d be comfortable taking advice without verifying it.</p><p>Before the wave of AI chatbots, such as OpenAI’s ChatGPT and Google’s Bard, it had been noted that more investors were <a href=\"https://cointelegraph.com/news/gen-z-crypto-social-trading-bitget-report\">beginning to rely on friends, influencers, and social media</a> for investment advice.</p><p>Interestingly, the most recent survey found generative AI tools have beat out social media across all ages, with investors surveyed saying they were comparatively more comfortable using <a href=\"https://cointelegraph.com/explained/how-is-artificial-intelligence-revolutionizing-financial-services\">AI financial advice</a> without verifying the information, compared to social media.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6433d44d-72b7-4e99-841f-b200e3869613.png\"  /><figcaption style=\"text-align: center;\"><em>26% cited comfort in using unverified financial advice from social media, compared to 31% citing the same from a generative AI tool. Source: CFP Board</em></figcaption></figure><p>The CFP Board claimed, however, that investors of all ages cited being more comfortable with AI-generated and social media-derived financial advice if it was verified by a financial advisor.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/openai-gets-lukewarm-response-to-customized-ai-offering\"><strong><em>OpenAI gets lukewarm response to customized AI offering</em></strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6ac110a3-329f-4333-972c-6ae954e2060c.png\"  /><figcaption style=\"text-align: center;\"><em>Experience using AI for financial advice was low but was largely satisfying for those who had. Source: CFP Board</em></figcaption></figure><p>The findings, however, found that only 52% of the respondents were interested in receiving AI-created financial advice in the future. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/third-us-investors-trust-ai-financial-advice&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-blockchain-control-robots-incentivise-humans/\"><strong><em>How to control the AIs and incentivize the humans with crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T05:55:28.000Z",
    "title": "Atari founder, Animoca sees Web3 games as vital for virtual ownership and education",
    "url": "https://cointelegraph.com/news/animoca-yat-siu-nolan-bushnell-atari-praise-ownership-web3-gaming",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c3c7f190-f5fc-447a-860c-d58d589e302d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"I was gobsmacked\" — Nolan Bushnell said his conversation with Yat Siu on Web3 games changed his brain. </p>\n                    <p><p>Nolan Bushnell, the founder of Atari and inventor of Pong — one of the first commercially successful video games — has shared optimism for the future of Web3 games, particularly as it comes to bringing ownership to virtual worlds. </p><p>During the Digital Entertainment Leadership Forum in Hong Kong on Aug. 25, Bushnell <a href=\"https://delf.cyberport.hk/en/index\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> alongside Animoca Brands co-founder Yat Siu, discussing the past, present and future of gaming. It was moderated by Sean Hung, the managing partner of Chiron Group.</p><p>Bushnell, whom Siu acknowledged as the “grandfather of gaming,” praised Web3 games for their ability to extend the concept of ownership into the digital landscape. </p><blockquote>“Games will increasingly imitate all factors of life. Web3 with blockchain suddenly transmits ownership into the virtual world.”</blockquote><p>The Atari founder currently serves as the chief knowledge officer at Web3 gaming company Moxy — and kicked off the panel by sharing the topline details of a conversation he’d had with Siu in the days prior:</p><p>“I was just gobsmacked. I mean, we had you know, every once in a while you can have a conversation that changes your brain. We had one of those.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I'm excited to be speaking at the DELF event. We've chosen Hong Kong for <a href=\"https://t.co/GNemkV0YDf\">https://t.co/GNemkV0YDf</a>'s entrance to the Asian Market <a href=\"https://t.co/phUuANd9LB\">https://t.co/phUuANd9LB</a></p>— Nolan K Bushnell (@NolanBushnell) <a href=\"https://twitter.com/NolanBushnell/status/1691249357507678208?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While Bushnell launched into his prediction of a world in the not too distant future, where the inside of self-driving cars could become a mobile gaming studio, Siu pointed to the potential of <a href=\"https://cointelegraph.com/news/play-to-earn-has-fatal-flaws-how-can-web3-gaming-be-more-sustainable\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/play-to-earn-has-fatal-flaws-how-can-web3-gaming-be-more-sustainable/amp\">Web3 games to help economically monetize gameplay</a> as games become a more ubiquitous part of everyday life. </p><p>“The impact that Web3 gaming has already had…is that you can start earning money with the engagement of the time that you spend in these games.”</p><p>Siu said that despite games originally taking the form of “player versus environment” systems, where gamers play against the non-player characters (NPCs), the world of gaming — as seen through the rise of Minecraft and Roblox — has evolved to become a multiplayer ecosystem. </p><p>“You don't go to Fortnite to play against yourself or an environment. You go online to play against others, meaning that we, the players, are the content, but the difference is that we haven't really been compensated for it,” Siu explained.</p><p>When asked what he saw as the biggest promise provided by Web3 games, Bushnell said that the combination of “KYC and the immutability of blockchain” were the best ways to ensure that players in online games were not bots or bad actors. </p><p>Additionally, Bushnell predicted that games would soon become an essential part of the classroom, with students learning best by way of “story and simulation.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/play-to-earn-has-fatal-flaws-how-can-web3-gaming-be-more-sustainable\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/play-to-earn-has-fatal-flaws-how-can-web3-gaming-be-more-sustainable/amp\"><strong><em>Play-to-earn has fatal flaws: How can Web3 gaming be more sustainable?</em></strong></a></p><p>While the positives of Web3 games were readily espoused, Yat Siu noted some of the issues that had arisen alongside the proliferation of blockchain gaming. </p><p>“When you introduce Web3 and blockchain to any system, including games, you're introducing capitalism. And so the problems we have seen in the last 12 to 18 months comes from the fact that these games have become not just capitalist to the studio that produced it, but to every participant,” Siu said. </p><p>Despite the many flaws introduced by the financialization of games — many of which became readily <a href=\"https://cointelegraph.com/news/axie-infinity-is-toxic-for-crypto-gaming\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/axie-infinity-is-toxic-for-crypto-gaming/amp\">apparent in the “toxicity” of play-to-earn games</a> like Axie Infinity — Siu said that the inherently capitalist element would aid young gamers in gaining a financial education. </p><p>“If the world becomes more financially literate because of Web3 gaming — because they understand something about value — then I think the world will become safer.”</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/animoca-yat-siu-nolan-bushnell-atari-praise-ownership-web3-gaming&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/animoca-yat-siu-nolan-bushnell-atari-praise-ownership-web3-gaming&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T04:43:36.000Z",
    "title": "WinRAR patches zero-day bug that targeted stock and crypto traders",
    "url": "https://cointelegraph.com/news/winrar-patches-zero-day-bug-targeted-crypto-traders",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/965b04ad-714a-46ba-a4df-fa5b2bb8795b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to cybersecurity firm Group-IB, weaponized ZIP file archives were being shared on crypto trading forums, with each one containing a nasty surprise. </p>\n                    <p><p>The developers behind file compression software WinRAR have patched a zero-day vulnerability that allowed hackers to install malware onto unsuspecting victims' computers, enabling them to hack into their crypto and stock trading accounts.</p><p>On Aug. 23, Singapore-based cybersecurity firm Group-IB reported a zero-day vulnerability in the processing of the ZIP file format by WinRAR.</p><p>The zero-day vulnerability tracked as CVE-2023-38831 was exploited for approximately four months, allowing hackers to install <a href=\"https://cointelegraph.com/tags/malware\">malware</a> when a victim clicked on files in an archive. The malware would then allow hackers to breach online crypto and stock trading accounts, according to the <a href=\"https://www.group-ib.com/blog/cve-2023-38831-winrar-zero-day/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>. </p><p>Using the exploit, the threat actors were able to create malicious RAR and ZIP archives that displayed seemingly innocent files such as JPG images or PDF text documents. These weaponized ZIP archives were then distributed on trading forums targeting crypto traders, offering strategies such as “best Personal Strategy to trade with Bitcoin.”</p><blockquote>“Once extracted and executed, the malware allows threat actors to withdraw money from broker accounts. This vulnerability has been exploited since April 2023.”</blockquote><p>The report confirmed that the malicious archives found their way onto at least eight public trading forums infecting at least 130 devices, however, the victim's financial losses were unknown.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5865db93-4a13-4b59-962c-d1f29ce0b8a2.jpg\"  /><figcaption style=\"text-align: center;\"><em>WinRar exploit infection chain. Source: Group-IB</em></figcaption></figure><p>On execution, the script launches a self-extracting (SFX) archive that infects the target computer with various malware strains, such as the DarkMe, GuLoader and Remcos RAT.</p><p>These provide the attacker with remote access privileges on the infected computer. DarkMe malware has previously been used in crypto and financially motivated attacks.</p><p>The researchers notified RARLABS which patched the zero-day vulnerability in WinRAR version 6.23, released on Aug. 2.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-investors-under-attack-by-two-new-malware-reveals-cisco-talos\"><strong><em>Crypto investors under attack by new malware, reveals Cisco Talos</em></strong></a></p><p>In August, smartphone giant BlackBerry <a href=\"https://cointelegraph.com/news/blackberry-top-crypto-malware-cyberthreats\">identified</a> several malware families that actively aimed to hijack computers to mine or steal cryptocurrencies.</p><p>The same month also revealed a newly discovered remote access tool called HVNC (Hidden Virtual Network Computer) that can enable hackers to compromise Apple operating systems was found on sale on the dark web.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/winrar-patches-zero-day-bug-targeted-crypto-traders&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T02:58:50.000Z",
    "title": "Dropbox ditches unlimited storage offering, blaming crypto cloud miners",
    "url": "https://cointelegraph.com/news/dropbox-scraps-unlimited-storage-advanced-plan-crypto-mining",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a3bdcacb-71dc-421f-ba20-6704c3045b7c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The storage platform turned to metered storage after discovering its Advanced plan was being used by some for crypto mining and other resource-intensive tasks.</p>\n                    <p><p>The online storage platform Dropbox has binned its unlimited storage plan after discovering some of its users were using the service for resource-intensive purposes like <a href=\"https://cointelegraph.com/news/how-to-build-a-passive-income-stream-from-cloud-mining\">mining crypto</a>.</p><p>In an Aug. 24 blog post, Dropbox <a href=\"https://blog.dropbox.com/topics/product/updates-to-our-storage-policy-on-dropbox-advanced\" target=\"_blank\" rel=\"noopener nofollow\">said</a> its unlimited Advanced plan has instead moved to a metered storage plan with new users getting 15 terabytes of storage — apparently enough to house 100 million documents.</p><p>It added it knew its “all the space you need” plan would result in uneven usage levels but in recent months it had seen a surge in some users consuming “thousands of times more storage than our genuine business customers.”</p><blockquote>“A growing number of customers were buying Advanced subscriptions not to run a business or organization, but instead for purposes like crypto and Chia mining.”</blockquote><p>Dropbox said other high-resource uses included some reselling its storage or multiple individuals pooling storage for personal use.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/888d821f-eca0-4cda-9a98-7382adec038a.png\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of previous plan showing storage as \"As much space as needed.\" Source: CBackup</em></figcaption></figure><p>Dropbox cited the increased unintended usage growth following “other services making similar policy changes.” Microsoft and Google have also <a href=\"https://cointelegraph.com/news/microsoft-bans-cryptocurrency-mining-on-cloud-services\">scrapped their unlimited storage</a> plans in recent months.</p><p>The company said it understands the move is “disappointing” but added it would be unsustainable and difficult to enforce a list of unacceptable use cases.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/future-btc-mining-and-the-bitcoin-halving\"><strong><em>The future of BTC mining and the Bitcoin halving</em></strong></a></p><p>In the past, hackers have used <a href=\"https://cointelegraph.com/learn/what-is-cryptojacking-a-beginners-guide-to-crypto-mining-malware\">cryptojacking</a> malware that’s inserted into a victim's internet-connected device or cloud-storage account.</p><p>The malicious program uses the resources of the device or cloud service <a href=\"https://cointelegraph.com/news/google-cloud-to-detect-crypto-mining-malware-on-virtual-machines\">to create a virtual machine</a> that mines cryptocurrencies.</p><p>In 2021, Google said some attackers targeting its storage platform users could compromise an account and install mining software <a href=\"https://cointelegraph.com/news/hackers-can-use-compromised-google-cloud-accounts-to-install-mining-software-in-under-30-seconds-report\">within 22 seconds</a>.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/dropbox-scraps-unlimited-storage-advanced-plan-crypto-mining&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-banters-ran-neuner-says-xrp-is-despicable-tips-hat-to-zachxbt-hall-of-flame/\"><strong><em>Hall of Flame: Crypto Banter’s Ran Neuner says Ripple is ‘despicable,’ tips hat to ZachXBT</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T02:02:07.000Z",
    "title": "VeChain and SingularityNET team up on AI to fight climate change",
    "url": "https://cointelegraph.com/news/vechain-and-singularitynet-team-up-on-ai-to-fight-climate-change",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1b451809-326b-4251-a5c7-9a43ea69d0c4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SingularityNET CEO Ben Goertzel says that AI and blockchain have the potential to solve problems that traditional mechanisms have “consistently, miserably failed.”</p>\n                    <p><p>Artificial intelligence firm SingularityNET and blockchain firm VeChain have become the latest firms to marry blockchain with artificial intelligence — this time, with the aim of cutting down carbon emissions. </p><p>Over the last year, the crypto industry has seen an increasing amount of collaboration between blockchain and AI technology. </p><p>On Aug. 24, <a href=\"https://cointelegraph.com/news/what-is-vechain-vet-and-how-does-it-work\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-is-vechain-vet-and-how-does-it-work/amp\">VeChain</a> — a smart contract-compatible blockchain used for supply-chain tracking — announced a strategic collaboration with the decentralized AI services-sharing platform SingularityNET.</p><p>In a joint statement, the firms said the partnership will merge VeChain’s enterprise data with SingularityNET's advanced AI algorithms to enhance automation of manual processes and provide real-time data. </p><p>SingularityNET founder and CEO Ben Goertzel told Cointelegraph that blockchain and AI go hand-in-hand and can solve problems where traditional approaches often fail.</p><p>“The last few years have taught the world that when the right AI algorithms meet the right data on sufficient processing power, magic can happen,” said Goertzel.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Dr Ben Goertzel says an AGI deployed across millions of nodes around the world can't be taken over by hostile, centralized forces: \"Blockchain solves that problem better than it solves the problem of money,” he says.  <a href=\"https://t.co/jPlp5BrSUY\">https://t.co/jPlp5BrSUY</a></p>— Cointelegraph Magazine (@CointelegraphZN) <a href=\"https://twitter.com/CointelegraphZN/status/1653395344091168770?ref_src=twsrc%5Etfw\">May 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Goertzel explained the partnership could, for example, allow AI to identify new ways to use VeChain’s blockchain data to optimize <a href=\"https://cointelegraph.com/news/dogecoin-carbon-emissions-down-by-25-following-elon-musk-collaboration\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/dogecoin-carbon-emissions-down-by-25-following-elon-musk-collaboration/amp\">carbon emission</a> output and minimize pollution.</p><p>“Achieving a sustainable and environmentally positive economy is an extremely complex problem involving coordination of a large number of different economic players,” he added. </p><blockquote>“It's a problem at which traditional economic mechanisms have consistently, miserably failed.”</blockquote><p>Meanwhile, VeChain Chief Technology Officer Antonio Senatore added: “Blockchain and AI offer game-changing capabilities for industries and enterprises and are opening new avenues of operation.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/heres-how-blockchain-and-ai-combine-to-redefine-data-security\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/heres-how-blockchain-and-ai-combine-to-redefine-data-security/amp\"><strong><em>Here’s how blockchain and AI combine to redefine data security</em></strong></a></p><p>In July, Bitcoin Miner Hive Blockchain changed its name and business strategy as part of its foray into the emerging field of AI. <a href=\"https://cointelegraph.com/news/hive-digital-ceo-sees-blockchain-ai-despite-pivot\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hive-digital-ceo-sees-blockchain-ai-despite-pivot/amp\">Hive Digital Technologies CEO Aydin Kilic</a> told Cointelegraph in August that blockchain and AI are “both pillars of Web3.”</p><p>In June, <a href=\"https://cointelegraph.com/ethereum-price\">Ethereum</a> layer-2 scaling network Polygon <a href=\"https://polygon.technology/blog/introducing-copilot-your-ai-powered-guide-to-polygon-and-web3\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its integration of AI technology. The AI interface called Polygon Copilot will help developers obtain analytics and insights for Dapps on the network.</p><p>Dr. Daoyuan Wu, an AI researcher from the Nanyang Technological University in Singapore and MetaTrust affiliate, told Cointelegraph that the “inherent autonomy of AI aligns seamlessly with the decentralized and autonomous characteristics of blockchain and smart contracts,” adding: </p><blockquote>“It holds the potential to shift the current centralized governance prevalent in the blockchain ecosystem to a truly decentralized and self-governing paradigm.”</blockquote><p>MetaTrust Labs is working on a project called GPTScan which works as a tool that combines Generative Pre-training Transformer (<a href=\"https://cointelegraph.com/news/open-ai-launches-official-chat-gpt-app-android\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/open-ai-launches-official-chat-gpt-app-android/amp\">GPT</a>) and static analysis to detect logic vulnerabilities in smart contracts.</p><p>“GPTScan is the first tool of its kind that utilizes GPT to match candidate vulnerable functions based on code-level scenarios and properties,\" added Dr. Daoyuan in an interview with Cointelegraph. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/vechain-and-singularitynet-team-up-on-ai-to-fight-climate-change&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/vechain-and-singularitynet-team-up-on-ai-to-fight-climate-change&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-to-prevent-ai-from-annihilating-humanity-using-blockchain/\"><strong><em>How to prevent AI from ‘annihilating humanity’ using blockchain</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T01:54:58.000Z",
    "title": "Australian exchange enlists PayPal as banks ‘close ranks’ against crypto",
    "url": "https://cointelegraph.com/news/crypto-exchange-independent-reserve-partner-paypal-banking-block",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8ace5629-dc5f-45de-ae39-2c0f2bbe6e13.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A new partnership between Independent Reserve and PayPal offers investors extra choice and “mitigates the risks” of Australian crypto banking blocks, says CEO Adrian Przelozny.</p>\n                    <p><p>The CEO of Australian crypto exchange Independent Reserve says it has turned to payments giant PayPal to hedge against increasing bank restrictions against crypto exchange payments.</p><p>The exchange has partnered with PayPal to enable an on-ramp that will give Independent Reserve’s customers the ability to fund their crypto accounts directly with fiat from their PayPal wallet as well as using PayPal to withdraw funds from the crypto exchange.</p><p>Speaking to Cointelegraph, Independent Reserve CEO Adrian Przelozny said the new partnership offered Australian crypto investors extra choice, and also mitigates the future risks if the “rest of the banks really decide to close ranks against industry.”</p><p>As of today, at least five major Australian Banking institutions — <a href=\"https://cointelegraph.com/news/bendigo-bank-crypto-blocks-pushes-australians-offshore-chainalysis\">Bendigo Bank</a>, <a href=\"https://cointelegraph.com/news/commonwealth-bank-decline-limit-payments-to-high-risk-crypto-exchanges\">Commonwealth Bank</a>, <a href=\"https://cointelegraph.com/news/crypto-national-australia-bank-joins-crypto-exchange-boycott-cites-scams\">National Australia Bank</a> (NAB), <a href=\"https://cointelegraph.com/news/australian-big-4-bank-begins-trial-for-cryptocurrency-payment-blocks\">Westpac</a> and ANZ — have introduced a series of limitations and blocks on customers looking to deposit and withdraw crypto from digital asset exchanges. </p><p>Commonwealth’s Banks restrictions are among the most stringent in the Australian landscape, with the institution imposing a $10,000 per month limit on all deposits to crypto exchanges. The other restrictions include blocking certain “high-risk” payments and the removal of instant deposits from crypto exchanges. </p><p>Przelozny noted that this was the first example of a partnership between PayPal and a cryptocurrency exchange in the APAC region and praised the payments firm for choosing to approach the crypto sector from a positive standpoint.</p><p>“It’s really good to see a company like PayPal go against the grain and see the opportunity in the crypto industry — as opposed to what all the other banks are doing which views the industry solely as a risk,” he said.</p><blockquote>“It’s a glass half empty versus a glass half full approach.”</blockquote><p>Przelozny noted that there was a $5,000 deposit limit per day for funds sent to the exchange via PayPal or credit card, a far more generous limit than those imposed by some of the major banks. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/australian-banks-claim-40-percent-scams-touch-crypto\"><strong><em>Australian banks claim 40% of scams ‘touch’ crypto as it defends restrictions</em></strong></a></p><p>Peter Cowan, the managing director of PayPal Australia, said in a statement that the partnership would help decrease the limitations and complexity associated with moving funds to and from digital asset exchanges for crypto investors in Australia. </p><p>“By integrating PayPal wallet for deposits and the PayPal platform for card processing, Independent Reserve and Bitcoin.com.au are making cryptocurrency easier for investors to access, while withdrawals to the PayPal wallet can take place in real time.”</p><p>Cowan also imparted his own bullish statements on digital currencies.</p><p>“At PayPal, we believe that money will become digital — it’s a matter of when, not if. Digital currencies have the potential to drive innovation in financial technology and, as a flow on, to improve economic opportunities and financial inclusion.”</p><p>On Aug. 7, PayPal <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">announced the launch</a> of its own U.S. dollar-pegged stablecoin, PYUSD.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-exchange-independent-reserve-partner-paypal-banking-block&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Deposit risk: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T01:30:00.000Z",
    "title": "DEA gets duped: Agency loses $55K in address poisoning scam",
    "url": "https://cointelegraph.com/news/dea-loses-tether-in-address-poisoning-scam",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/373446bf-5aa5-4f19-a0a8-0ef278e4b325.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United States Drug Enforcement Administration has yet to find those responsible for the attack but has enlisted the help of the FBI. </p>\n                    <p><p>The United States Drug Enforcement Administration — the agency tasked with enforcing the country’s drug laws — lost $55,000 in seized Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) earlier this year at the hands of a scammer.</p><p>Forbes <a href=\"https://www.forbes.com/sites/thomasbrewster/2023/08/24/dea-accidentally-sends-50000-in-drug-proceeds-to-crypto-scammer/?sh=71f845d53d12\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Aug. 24 that in May, the agency seized over $500,000 worth of USDT from two Binance accounts it suspected of laundering money from drug sales as part of a multi-year investigation.</p><p>The funds were put in DEA-controlled Trezor crypto wallets and stored securely, according to a search warrant seen by Forbes. As part of standard forfeiture processing the DEA sent a test amount of just over $45 worth of USDT to the U.S. Marshals Service.</p><p>An on-chain sleuth picked up on the transaction and then quickly set up a crypto wallet with the same first five and last four characters of the Marshals account — a <a href=\"https://cointelegraph.com/news/etherscan-hides-zero-value-token-transfers-to-deter-address-poisoning-attacks\">scam tactic</a> known as “address poisoning.”</p><p>The scammer airdropped a token to the DEA’s wallet so that the spoofed address would appear as a recent transaction, thus tricking the owner into accidentally transferring funds to the wrong address. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I almost got hit by an address poisoning scam.<br><br>Sent a second tx to someone just after the first, and was lazy and just copy pasted his address from my transaction history.<br><br>Yup, copy pasted the poison tx address.<br><br>Just before confirming, <a href=\"https://twitter.com/Rabby_io?ref_src=twsrc%5Etfw\">@Rabby_io</a> informed me that I had never… <a href=\"https://t.co/XlHPTs8PZy\">pic.twitter.com/XlHPTs8PZy</a></p>&mdash; N̴̡̩̠̻̩͜͝a̴͍͙̫̹̅u̶̼̠̭͐̂͘h̷͇̻̭̚c̴͉͈̎̂̅͗̉̈́̆͑̍̀ (@nauhcner) <a href=\"https://twitter.com/nauhcner/status/1648229154054352897?ref_src=twsrc%5Etfw\">April 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The tactic worked against the DEA agent, who sent over $55,000 to the scammer. </p><p>By the time the Marshals noticed and alerted the DEA, who in turn asked Tether to <a href=\"https://cointelegraph.com/news/bitcoin-crypto-fbi-flags-6-bitcoin-wallets-linked-to-north-korea\">freeze the fund</a>s, it was too late.</p><p>The USDT had already been swapped for Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and then <a href=\"https://cointelegraph.com/news/criminals-prefer-stablecoins-over-bitcoin-for-illicit-use\">shifted to different crypto wallets</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-charges-former-corrections-officer-for-role-bizarre-crypto-scam\"><strong><em>SEC charges former corrections officer with role in bizarre crypto scam</em></strong></a></p><p>The DEA alongside the FBI is investigating the incident and is yet to find whose behind the attack. All they’ve found so far are two Binance accounts that paid for the attacker's wallet gas fees, which used two Gmail email addresses to sign up.</p><p>It's hoped Google has some information that can be used to nab the owner of the Gmail accounts.</p><p>The DEA did not immediately respond to a request for comment.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/dea-loses-tether-in-address-poisoning-scam&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T23:57:44.000Z",
    "title": "PEPE plunges 15% as strange token movements spark fears of rug pull",
    "url": "https://cointelegraph.com/news/pepe-token-plunges-strange-token-transfers-fears-rug-pull",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/de80d887-18b8-4101-a58c-1d1e3e35b95e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The price of Pepe has plummeted 15% after developers sent nearly 4% of the memecoin’s total supply to exchanges without warning.</p>\n                    <p><p>The price of the frog-themed memecoin Pepe (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>) has plunged nearly 15% after recent changes to a multisig wallet and new token transfers ignited fears of a “rug pull” by its developers. </p><p>The <a href=\"https://twitter.com/wizardofsoho/status/1694817350741025201\" target=\"_blank\" rel=\"noopener nofollow\">allegations</a> — as well as the negative price action — came as $16 million worth of Pepe tokens were sent from the developers’ multisig wallet to various crypto exchanges on Aug. 24.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/4<br><br>1 hour ago, the Pepe multisig wallet, changed the amount of signatures required on their multisig from a 5/8 to 2/8. This comes after sending $15.7 million worth of <a href=\"https://twitter.com/search?q=%24PEPE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PEPE</a> to exchanges.<br><br>A breakdown of what we know: <a href=\"https://t.co/bxBxp6Nzqz\">pic.twitter.com/bxBxp6Nzqz</a></p>&mdash; ASXN (@asxn_r) <a href=\"https://twitter.com/asxn_r/status/1694827857694924924?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to <a href=\"https://app.safe.global/transactions/history?safe=eth:0x5BdEA820293689B77FA8e83b1E3D58B27B5ce9BA\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from blockchain custody app Safe Global, the wallet address transferred 16 trillion Pepe tokens — approximately 3.8% of the total supply — to three exchanges and an unverified wallet address.</p><p>Data shows $8.2 million worth of Pepe was sent to OKX, $6.5 million to Binance and $434,000 to Bybit, while an additional $400,000 was transferred to an unknown wallet.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d7d627af-c1a6-430c-a6f3-f40de29a5570.png\"  /><figcaption style=\"text-align: center;\"><em>Owners of the Pepe multisig wallet transferred 16 Trillion PEPE. Source: Safe Global</em></figcaption></figure><p>Following the transfer of the 16 trillion Pepe tokens to exchanges, the developers made a curious change to the team’s multisig wallet, which at the time of publication still contains $10 million worth of Pepe. </p><p>Data from Etherscan <a href=\"https://etherscan.io/tx/0xdae4224f5290a505aa61aee022f892650c171594bbf347ce1dcf2c86c8879676#eventlog\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that the wallet now only requires two out of eight signatures — formerly five out eight — to sign off on whether or not the wallet should make transfers. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5202f0c2-c605-49b1-ae65-a8845b066238.png\"  /><figcaption style=\"text-align: center;\"><em>The change in number of signatures required to approve transactions from the multisig wallet. Source: Etherscan</em></figcaption></figure><p>Notably, the transfer of funds marked the first time that Pepe tokens had ever been sent from the project's multisig wallet to exchanges. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/is-the-25-drop-in-pepe-shib-and-ape-a-sign-of-a-deepening-crypto-bear-market\"><strong><em>Is the 25% drop in PEPE, SHIB and APE a sign of a deepening crypto bear market?</em></strong></a></p><p>Many memecoin investors heralded Pepe as the next major memecoin, with some suggesting that — come the next bull run — the frog-themed meme token was <a href=\"https://cointelegraph.com/news/pepecoin-pepe-vs-dogecoin-doge-is-a-flippening-on-the-horizon\">capable of “flipping” the original memecoin</a>, Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>).</p><p>The movements of funds out of the multisig could throw this thesis, for some, into question. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/pepe-token-plunges-strange-token-transfers-fears-rug-pull&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T23:45:22.000Z",
    "title": "ARK Invest, 21Shares join queue to offer Ethereum futures ETF",
    "url": "https://cointelegraph.com/news/ark-invest-21-shares-file-ethereum-futures-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/076c38c1-602b-4961-9e6b-a3c667cca577.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The co-filing comes just a week after reports emerged that the Securities and Exchange Commission is likely to greenlight Ethereum ETF applications.</p>\n                    <p><p>Investment firms ARK Invest and 21Shares have teamed up to apply for two Ethereum futures exchange-traded funds after reports emerged last week that the United States securities regulator could soon begin approving applications. </p><p>The two proposed Ethereum futures ETFs are “ARK 21Shares Active Ethereum Futures ETF” (ARKZ) and the “ARK 21Shares Active Bitcoin Ethereum Strategy ETF” (ARKY), <a href=\"https://www.sec.gov/Archives/edgar/data/1592900/000182912623005634/easeries_485apos.htm#b_001\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an Aug. 24 filing to the Securities and Exchange Commission.</p><p>The filing states that ARKZ would invest at least 25% of its total assets in cash-settled Ethereum futures contracts, such as those traded on the Chicago Mercantile Exchange (CME). </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b228dc73-39ed-46f1-9a64-f8bde189097c.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>ARK 21Share has filed two more Bitcoin/ Ethereum ETF applications to the SEC. Source: Securities and Exchange Commission</em></figcaption></figure><p>ARKY, on the other hand, will consist of both Bitcoin and Ethereum futures contracts.</p><p>Empowered Funds has been assigned as investment advisor for the two Ethereum products.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq/amp\"><strong><em>BlackRock applies for spot Bitcoin ETF — a US first if approved </em></strong></a></p><p>Ark Invest and 21Shares first partnered to launch a spot Bitcoin ETF in 2021.</p><p>The SEC knocked back its first two attempts <a href=\"https://cointelegraph.com/news/sec-rejects-ark-21shares-spot-bitcoin-etf-application\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-rejects-ark-21shares-spot-bitcoin-etf-application/amp\">in March 2022</a> and in January. Its most recent Bitcoin spot ETF <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf/amp\">application was filed in April</a> — about two months before $10 trillion firm BlackRock put in its own application.</p><p>However, the SEC recently labeled many of the Bitcoin spot ETF applications as inadequate, which prompted ARK 21Shares and other applicants to add in a <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application/amp\">surveillance sharing agreement </a>to their applications.</p><p>The investment firms are also awaiting the outcomes of Ark 21Shares Active Bitcoin Futures ETF (ARKA) and Ark 21Shares Active On-Chain Bitcoin Strategy ETF (ARKC),</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-is-woefully-undervalued-but-growing-more-powerful-defi-dad-hall-of-flame/\"><strong><em>DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T23:06:41.000Z",
    "title": "Bitcoin miner gets life in prison, China offers bounties for crypto firms: Asia Express",
    "url": "https://cointelegraph.com/magazine/bitcoin-miner-gets-life-in-prison-china-offers-bounties-for-crypto-firms-asia-express/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/01/magazine-Asia-Express-Jan-20-scaled.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Retail crypto trading is only days away in Hong Kong, but a mainland crackdown sees bounties offered for crypto firms and miners imprisoned.</p>\n                    <p><p><em>Our weekly roundup of news from East Asia curates the industrys most important developments.</em></p><h2 class=\"wp-block-heading\" id=\"h-hashkey-hong-kong-to-commence-retail-trading\">HashKey Hong Kong to commence retail trading </h2><p>Crypto exchange HashKey, the first licensed virtual asset provider in Hong Kong, will open its doors to residents for retail trading on Aug. 28.</p><p><a href=\"https://cn.investing.com/analysis/article-200479915\" target=\"_blank\" rel=\"nofollow\" >According</a> to local news reports, investors will only be allowed to invest up to 30% of their net worth into cryptocurrencies when using the platform. A risk control warning will be displayed if the limit is exceeded. However, Xiaoqi Weng, chief operating officer of HashKey, mentioned that the exchange “cannot validate users net worth,” and the limit is largely based on self-verification” of assets.</p><p>Weng also disclosed that the exchange will assess users’ investment background based on information submitted during Know Your Customer verification. “Beginners are limited in what they can purchase,” said Weng.</p><p>At its debut, users can only trade Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\" target=\"_blank\" rel=\"nofollow\" >BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\" target=\"_blank\" rel=\"nofollow\" >ETH</a>) on HashKey Hong Kong. The Hong Kong Securities and Futures Commission has not yet allowed the margin trading of crypto products or crypto derivatives on regulated exchanges, Weng noted.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><h2 class=\"wp-block-heading\" id=\"h-dark-side-of-china-s-crypto-crackdown\">Dark side of Chinas crypto crackdown</h2><p>It appears China no longer wants any private blockchain firms operating within its borders and is on the warpath to get rid of them, no matter the consequences. The move comes amid an increase in using crypto as a means of capital flight in an economic downturn.</p><p>Local media <a href=\"https://www.odaily.news/post/5189260\" target=\"_blank\" rel=\"nofollow\" >reports</a> suggest that, legitimate or not, blockchain projects in China have literal bounties on their heads. First, third-party tracking firms tip off the police on undercover crypto projects in the country; if the report leads to arrest and asset forfeiture, the tracking firm stands to make millions of dollars in commission  if not hundreds of millions of dollars for <a href=\"https://cointelegraph.com/magazine/real-reason-chinas-war-on-crypto-3ac-judges-embarrassing-mistake-asia-express/\" target=\"_blank\" rel=\"nofollow\" >large-scale projects such as Multichain</a>.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Screenshot-2023-08-25-004741.png\" alt=\"An recent tip-off lead to a 400 billion Yuan ($55 billion) crypto money laundering bust by Chinese police. \" class=\"wp-image-23199\" width=\"507\" height=\"748\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Screenshot-2023-08-25-004741.png 357w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Screenshot-2023-08-25-004741-203x300.png 203w\" sizes=\"(max-width: 507px) 100vw, 507px\" /><figcaption class=\"wp-element-caption\"><em>A recent tip-off led to a 400 billion yuan ($55 billion) crypto money laundering bust by Chinese police. (DouYin)</em></figcaption></figure><p>Then, after arrest, crypto executives are reportedly <a href=\"https://www.panewslab.com/zh/articledetails/2jb9x645.html\" target=\"_blank\" rel=\"nofollow\" >intimidated</a> into handing over the projects private keys and access to servers. Police then allegedly get third-party payment processors to “dump” the coins and tokens over-the-counter in exchange for Chinese yuan.</p><p>Crypto executives are then charged with operating a “multilevel marketing scheme,” “pyramid scheme,” or “money laundering.” If convicted, the charges result in the seizure of all protocol-related assets by the state.</p><p>Sources <a href=\"https://cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges\" target=\"_blank\" rel=\"nofollow\" >claim</a> that a portion of the funds goes into law enforcement agency revenue. Zhengyao Liu, a senior lawyer at the Shanghai Mankuen Law Firm, wrote: </p><blockquote class=\"wp-block-quote\"><p>“In fact, in the past two years, the profit-seeking law enforcement in crypto-related criminal cases, especially in crypto-related MLM cases, has been the main reason people do not trust the case-handling agencies. For example, the ‘contribution’ of crypto-related criminal cases to financial fines and confiscation revenues is more than 50% higher than in previous years in the Jiangsu Province.”</p></blockquote><p>The crackdown has led to the termination of several protocols this year, with little recourse for non-Chinese users with funds stuck on these platforms. Unsurprisingly, it has sparked a wave of emigration among Chinese Web3 founders and overseas law enforcement efforts to try and recover the “stuck” funds.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"675\" height=\"627\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Screenshot-2023-08-25-003800.png\" alt=\"\" class=\"wp-image-23197\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Screenshot-2023-08-25-003800.png 675w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Screenshot-2023-08-25-003800-300x279.png 300w\" sizes=\"(max-width: 675px) 100vw, 675px\" /><figcaption class=\"wp-element-caption\"><em>The last message sent by Chinese exchange BKEX before its entire platform shut down and its staff disappeared. (BKEX)</em></figcaption></figure><h2 class=\"wp-block-heading\" id=\"h-digital-yuan-green-bonds-debut\">Digital yuan green bonds debut</h2><p>Despite the draconian crackdown on private crypto activities, government-led blockchain efforts in China are <a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\" target=\"_blank\" rel=\"nofollow\" >doing quite well</a>. </p><p>On August 18, the first digital yuan central bank digital currency green bond was <a href=\"https://news.cnstock.com/news,bwkx-202308-5108477.htm\" target=\"_blank\" rel=\"nofollow\" >issued</a> with a principal amount of 100 million Chinese yuan ($14 million), a term of two years, and a coupon rate of 2.6% per annum.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/ai-blockchain-control-robots-incentivise-humans/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>How to control the AIs and incentivize the humans with crypto</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/defi-security-audits-bug-bounties-broken-heres-how-fix/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Crypto audits and bug bounties are broken: Heres how to fix them</p>                        </a>                    </div></div></div><p>Facilitated by the Bank of Ningbo, the loans will be used to finance a 1.4 gigawatt and a 1.0 GW solar panel facility expansion project in Wuxi.</p><p>The digital yuan CBDC has been repeatedly “shilled” for much of this year as a means of stimulating domestic spending amid a financial crisis within the country. In the city of Tianjin alone, digital yuan transaction volumes have surpassed $17.5 billion in the first half of 2023, with over 302,000 merchants accepting the CBDC as a means of payment.</p><h2 class=\"wp-block-heading\" id=\"h-fbi-tracks-41-million-in-north-korean-crypto\">FBI tracks $41 million in North Korean crypto</h2><p>On Aug. 22, the U.S. Federal Bureau of Investigation <a href=\"https://www.fbi.gov/news/press-releases/fbi-identifies-cryptocurrency-funds-stolen-by-dprk\" target=\"_blank\" rel=\"nofollow\" >announced</a> the identification of 1,580 BTC ($41 million) stolen from various projects by North Korean hackers. The six displayed wallets include funds stolen from the $60 million Alphapo hack in June, $37 million stolen from CoinsPaid in June, and $100 million stolen from Atomic Wallet in June. The FBI wrote:</p><blockquote class=\"wp-block-quote\"><p>“Private sector entities should examine the blockchain data associated with these addresses and be vigilant in guarding against transactions directly with, or derived from, the addresses. The FBI will continue to expose and combat the DPRK’s use of illicit activities  including cybercrime and virtual currency theft  to generate revenue for the regime.”</p></blockquote><p>The agency said it believes North Korea will attempt to cash out the stolen funds. Criminal investigations into North Korean hackers role in the Harmonys Horizon Bridge and Sky Mavis Ronin Bridge exploits last year are still ongoing.</p><h2 class=\"wp-block-heading\" id=\"h-chinese-bitcoin-mining-magnate-sentenced-to-life-in-prison\">Chinese Bitcoin mining magnate sentenced to life in prison</h2><p>Yi Xiao, a former vice chairman of the Jiangxi Provincial Political Consultative Conference Party Group, has reportedly been sentenced to life in prison by the Hangzhou Intermediate Peoples Court for unrelated charges of corruption and abuse of power in a Bitcoin mining enterprise.</p><p>According to local news <a href=\"https://www.workercn.cn/c/2023-08-22/7954854.shtml\" target=\"_blank\" rel=\"nofollow\" >reports</a> on August 22, Yi Xiao operated a 2.4 billion Chinese yuan ($329 million) Bitcoin mining enterprise under the corporate name Jiumu Group Genesis Technology from 2017 to 2021. Despite knowing about a ban on cryptocurrencies, Xiao amassed over 160,000 Bitcoin miners with other corporate executives and, at one time, 10% of the city of Fuzhous entire electricity consumption.</p><p>Xiao was convicted of using his public office to secure preferential subsidies, capital, and electricity supply for the Jiamu Group. The former official also used his position to fabricate statistical reports to conceal the operations true nature. </p><p>Starting this year, China has been <a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/\" target=\"_blank\" rel=\"nofollow\" >cracking down harshly</a> on crypto activities amid a spree of data theft and money laundering incidences involving digital assets. Earlier this month, a Chinese national <a href=\"https://cointelegraph.com/news/chinese-man-sentenced-9-months-prison-buying-13-thousand-in-tether-usdt\" target=\"_blank\" rel=\"nofollow\" >was sentenced</a> to nine months in prison for purchasing $13,067 worth of Tether (<a href=\"https://cointelegraph.com/tether-price-index\" target=\"_blank\" rel=\"nofollow\" >USDT</a>) for an acquaintance.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/1470893_4096x10000.jpeg\" alt=\"Yi Xiao awaiting sentencing on charges of corruption and abuse of power (Hangzhou Intermediate People's Court)\" class=\"wp-image-23198\" width=\"840\" height=\"561\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/1470893_4096x10000.jpeg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/1470893_4096x10000-300x200.jpeg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/1470893_4096x10000-770x514.jpeg 770w\" sizes=\"(max-width: 840px) 100vw, 840px\" /><figcaption class=\"wp-element-caption\"><em>Yi Xiao, awaiting sentencing on charges of corruption and abuse of power (Hangzhou Intermediate People’s Court)</em></figcaption></figure><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T22:22:08.000Z",
    "title": "Num Finance launches Colombian peso stablecoin on Polygon",
    "url": "https://cointelegraph.com/news/num-finance-colombian-peso-stablecoin-on-polygon",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/36a016f1-97b8-47ce-a99c-96c9f57e97f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Num Finance received $1.5 million in a pre-seed funding round in May and is now issuing stablecoins in the local currencies of Argentina, Peru and Colombia.</p>\n                    <p><p>Argentina-based Num Finance has gone live with a stablecoin pegged to the Colombian peso, the company announced Aug. 24 in an X post. </p><p>The stablecoin — called nCOP — is an overcollateralized, Polygon-based stablecoin and is aimed at the remittance market. </p><p>Colombia receives over $6.5 billion a year in remittances, Num <a href=\"https://num.finance/blog/num-finance-launches-ncop/\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> in a blog post. Remittances <a href=\"https://cointelegraph.com/news/the-driving-forces-behind-crypto-adoption-in-latin-america-in-2022\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/the-driving-forces-behind-crypto-adoption-in-latin-america-in-2022/amp\">are one of the key use cases</a> for stablecoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8b42272e-2d7d-4a8d-9a39-cb5b3f1e3c97.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>The nCOP logo. Source: Num Finance</em></figcaption></figure><p>The nCOP incorporates the “Num yield feature,” which allows user rewards to be paid in nCOP. Num Finance CEO Agustín Liserra said:</p><blockquote>“In Colombia, there exists a unique opportunity to ‘tokenize’ remittances and offer them a yield in nCOP, based on regulated financial products. Currently, Colombia is one of the main recipients of remittances in Latin America.”</blockquote><p>This is the third stablecoin the company has produced — after the nARS pegged to the Argentinian peso and the nPEN pegged to the Peruvian sol.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending/amp\">Colombia’s central bank recommends limiting CBDC holdings and spending</a></em></strong></p><p>Num <a href=\"https://twitter.com/Num_Finance/status/1661016451069927424\" target=\"_blank\" rel=\"noopener nofollow\">received</a> $1.5 million in pre-seed funding led by Reserve protocol in May. It said at the time that over $2.5 million worth of nARS and nPEN were in circulation, and was looking at launching stablecoins pegged to the Brazilian real, Colombian peso and Mexican peso. </p><p>The Colombian central bank <a href=\"https://cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending/amp\">is considering issuing a central bank digital currency</a> — another potential vehicle for remittances — and has determined that it should place holding and transaction limits on a future CBDC to safeguard the local financial system.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Introducing nCOP, the new Num Stablecoin and the leading stablecoin for Colombia!  <a href=\"https://t.co/u16SOFqTl8\">pic.twitter.com/u16SOFqTl8</a></p>— Num Finance (@Num_Finance) <a href=\"https://twitter.com/Num_Finance/status/1694771810682748961?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Also on Aug. 24, it was disclosed that Mastercard will stop supporting Binance crypto debit cards in Latin American countries, including Colombia.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/the-invisible-man-of-the-visible-world-how-blockchain-could-offer-new-hope-to-stateless-rohingya/\">The Invisible Man of the Visible World: How Blockchain Could Offer New Hope to Stateless Rohingya</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T21:55:00.000Z",
    "title": "Multichain wallet Exodus posts $12.4M revenue, $1.9M net income in Q2 ",
    "url": "https://cointelegraph.com/news/multichain-wallet-exodus-posts-12-million-revenue-net-income-q2",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1a6176c2-a2c5-4b5c-be3a-3bdf028fff72.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the quarter ended June 30, Exodus' revenue declined by 4% year-over-year, but its results were boosted by 6% cost reductions. </p>\n                    <p><p>Multichain wallet Exodus has released its financial results for the second quarter of 2023, disclosing revenue of $12.4 million, a 4% decrease year-over-year. Net income amounted to $1.9 million.</p><p>According to Exodus, its exchange aggregation business accounted for the majority of total revenue in the quarter, totaling $11.6 million. Fiat onboarding revenue rose 220% from 2022 to $561,000. The volume of exchange provider transactions in Q2 was $591.5 million, down 12% from Q2 2022. Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Tether (<a href=\"https://cointelegraph.com/usdc-price-index\">USDT</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) were the top assets traded in the quarter, at 27%,16% and 12% of volume, respectively. </p><p>Exodus generates revenue from API integration fees charged to third parties. Monthly active users, however, decreased 6% to 772,839 in the second quarter, from 817,972 last year.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/08618efd-2d8f-4246-99e9-a9da6026aec5.png\"  /><figcaption style=\"text-align: center;\"><em>Exodus cash and digital assets holdings. Source: Exodus</em></figcaption></figure><p>Despite the decline in revenue, Exodus' results were strengthened by cost reductions of 6% year-over-year, to $7.1 million in the second quarter. A reduction in headcount and cloud infrastructure expenditures contributed to the lower expenses, the company said, adding that ”the Exodus team stood at approximately 195 full time equivalents as of June 30, 2023, a decrease from 290 as of June 30, 2022.”</p><p>Amid the bear market, Exodus also slashed its administrative and marketing allocations by 65% in the quarter, resulting in expenses of $4 million. Total general and administrative expenses represented 32.2% of company revenue, a significant decrease from 87.1% in the second quarter of 2022. </p><p>As of June 30, Exodus held $55 million in cash, cash equivalents, and U.S. Treasury bills, as well as $46.2 million worth of Bitcoin, making it one of a few public companies holding over 1,000 Bitcoin in its corporate treasury. </p><p>Among major developments in the quarter, the company rolled out an integration with Robinhood Connect, allowing users to purchase and hold cryptocurrencies in Exodus through Robinhood's cash and so-called buying power. Exodus also added full support for Arbitrum and Optimism, along with Matic staking.</p><p>“Accordingly, the next step for Exodus is to provide our technology to other companies, often called Wallet-as-a-Service or Infrastructure-as-a-Service,\" said JP Richardson, the CEO and co-founder of Exodus.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T20:42:02.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The Pepe (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>) memecoin took a sharp dive in price after strange token movements sparked fears of the beginning of a rug pull. Meanwhile, the Base and Optimism networks have reached a new agreement on revenue and governance sharing and Binance has renamed sanctioned Russian banks on its platforms “Yellow” and “Green” cards, despite denying relationships with any banks. </p><h3>PEPE plunges as strange token movements spark fears of rug pull</h3><p>The price of the frog-themed memecoin Pepe plunged nearly 15% after changes to a multisig wallet and token transfers ignited fears of a “rug pull” by its developers. </p><p>The <a href=\"https://twitter.com/wizardofsoho/status/1694817350741025201\" target=\"_blank\" rel=\"noopener nofollow\">allegations</a> — as well as the negative price action — came as $16 million worth of Pepe tokens were sent from the developers’ multisig wallet to various crypto exchanges on Aug. 24.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24PEPE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PEPE</a> Dev Wallet Sends $15M to Binance, OKX, and Bybit.<br><br>Only hours ago the PEPE Multi-Sig wallet undergoes unusual changes and transactions. Many fear a potential &quot;rug pull.&quot;<br><br>The PEPE multi-sig wallet sent over $15M worth of PEPE to three major centralized exchanges and one… <a href=\"https://t.co/xgGjhROILE\">pic.twitter.com/xgGjhROILE</a></p>&mdash; MANDO CT (@XMaximist) <a href=\"https://twitter.com/XMaximist/status/1694941539896607014?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to <a href=\"https://app.safe.global/transactions/history?safe=eth:0x5BdEA820293689B77FA8e83b1E3D58B27B5ce9BA\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from blockchain custody app Safe Global, the wallet address transferred 16 trillion Pepe tokens — approximately 3.8% of the total supply — to three exchanges and an unverified wallet address.</p><p>Following the transfer of the 16 trillion Pepe tokens to exchanges, the developers made a curious change to the team’s multisig wallet, which at the time of publication still contains $10 million worth of Pepe.</p><p>Data from Etherscan <a href=\"https://etherscan.io/tx/0xdae4224f5290a505aa61aee022f892650c171594bbf347ce1dcf2c86c8879676#eventlog\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that the wallet now only requires two out of eight signatures — formerly five out eight — to sign off on whether or not the wallet should make transfers.</p><blockquote class=\"twitter-tweet\"><p lang=\"fr\" dir=\"ltr\">PEPE le plunge <a href=\"https://t.co/rdwYKgORkP\">pic.twitter.com/rdwYKgORkP</a></p>&mdash; Messari (@MessariCrypto) <a href=\"https://twitter.com/MessariCrypto/status/1694836361533005961?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Notably, the transfer of funds marked the first time that Pepe tokens had ever been sent from the project's multisig wallet to exchanges.</p><h3>Base, Optimism reach revenue-sharing agreement</h3><p>The Base and Optimism networks have <a href=\"https://cointelegraph.com/news/base-optimism-unveil-shared-governance-revenue-sharing-framework\">reached a new agreement</a> on revenue and governance sharing — a move developers say will enhance both ecosystems.</p><p>Under the agreement, Base will pay 2.5% of its revenue or 15% of its profits to the Optimism Collective, whichever is greater. In return, Base will receive up to 118 million Optimism (OP) tokens, thereby giving the network a voice within Optimism’s protocol.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This month marked a momentous first for Ethereum: a publicly listed US company incubated and launched an OP Chain powered by Optimism.<br><br>But <a href=\"https://twitter.com/BuildOnBase?ref_src=twsrc%5Etfw\">@BuildOnBase</a> represents so much more than just technological validation of the OP Stack.<a href=\"https://t.co/E1Pow0LIlk\">https://t.co/E1Pow0LIlk</a></p>&mdash; Optimism (✨_✨) (@optimismFND) <a href=\"https://twitter.com/optimismFND/status/1694744215408783858?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase, Base’s parent company, also published a “principles of neutrality” list that, when implemented, will prevent Base from becoming centralized. Base’s principal creator, Jesse Pollak, wrote that Base’s decentralization pledge mirrors Vitalik Buterin’s concept of “stage 2” decentralization for layer-2 networks. </p><p>Both organizations have also vowed to create a “security council” to safeguard the ecosystem. </p><p>Base and Optimism have been met favorably by the Ethereum community, who believe that the networks could <a href=\"https://cointelegraph.com/news/coinbase-new-blockchain-seen-as-massive-confidence-vote-for-ethereum\">onboard new users</a> to the developer ecosystem. </p><h3>Binance dubs barred Russian banks on its platform as \"Yellow” and “Green” cards</h3><p>Binance’s peer-to-peer (P2P) cryptocurrency exchange in Russia has continued facilitating transactions through sanctioned banks like Rosbank after denying relationships with “any banks.”</p><p>On Aug. 23, multiple local news sources reported that Binance P2P has renamed some of its troubled payment options for withdrawals and deposits, namely the sanctioned Russian banks like Tinkoff and Rosbank.</p><p>The P2P exchange replaced the banks’ names “Tinkoff” and “Rosbank” with terms like “Yellow” and “Green” cards, Cointelegraph has confirmed.</p><p>At the time of writing, Binance P2P offers customers the use of “local cards” to convert cryptocurrencies like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) to Russian rubles and receive them on sanctioned Tinkoff or Rosbank.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2f0a701c-a71d-4bac-86e8-2ac8f15b3755.png\"  /><figcaption style=\"text-align: center;\"><em>Binance P2P interface in Russia. Source: Binance</em></figcaption></figure><p>The new naming apparently came shortly after The Wall Street Journal on Aug. 22 reported that Binance offered Russian clients at least five sanctioned Russian banks, including Rosbank and Tinkoff, as options for processing payments.</p><p>In the WSJ report, Binance executives denied any relationships with “any banks whatsoever, in Russia or elsewhere,” in relation to its P2P platform. “Binance follows the global sanctions rules and enforces sanctions on people, organizations, entities, and countries that have been blacklisted by the international community, denying such actors access to the Binance platform,” the company said.</p><p>The news came a few days after Binance services in Russia were promoted on a YouTube channel of a major Russian YouTuber, Yuri Dud. A recent video on his <em>vDud</em> YouTube channel — which has 10.3 million subscribers — featured an advertisement for Binance services, offering 5 USDT in exchange for signing up on the platform.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3d6b8021-6480-48a8-ae67-b56fbd3db2dd.png\"  /><figcaption style=\"text-align: center;\"><em>Yuri Dud's YouTube channel </em>vDud<em>. Source: YouTube</em></figcaption></figure><p>In the video, Dud also promoted Binance Earn, which allows users to earn passive income on crypto through a variety of products like flexible savings, locked savings, staking and liquidity mining.</p><p>It appears to be unclear how the latest news aligns with the Western sanctions against Russia. In February 2023, the European Council sanctioned Russian banks like Tinkoff and Rosbank as part of its 10th package of sanctions for Russia’s war against Ukraine. The United States also put sanctions on Tinkoff in May 2023.</p><p>The news comes months after the security division of the U.S. Department of Justice reportedly launched an investigation of Binance for allowing Russians to use the exchange in violation of U.S. sanctions.</p><p>Binance has not been the sole cryptocurrency exchange that has been facilitating such transactions in Russia, though. Other major P2P crypto exchanges, including Huobi and OKX, also allow transfers with Tinkoff, Rosbank and Sberbank at the time of writing. Huobi and OKX didn’t immediately respond to Cointelegraph’s request to comment.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T04:00:44.000Z",
    "title": "China’s real estate wealth meets financial storm while Western markets see mortgage rate spike",
    "url": "https://cryptoslate.com/insights/chinas-real-estate-wealth-meets-financial-storm-while-western-markets-see-mortgage-rate-spike/",
    "description": "<p>Quick Take As one of the largest global wealth sources, the real estate sector continues to demonstrate tremendous growth. According to Statista, it&#8217;s projected to hit a whopping $613 trillion in 2023 and potentially reach $700 trillion by 2027. Much of this wealth is concentrated in China, the world&#8217;s largest real estate asset class, with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/chinas-real-estate-wealth-meets-financial-storm-while-western-markets-see-mortgage-rate-spike/\">China&#8217;s real estate wealth meets financial storm while Western markets see mortgage rate spike</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T01:00:35.000Z",
    "title": "Bitcoin’s most active supply hits 8-year low",
    "url": "https://cryptoslate.com/bitcoins-most-active-supply-hits-8-year-low/",
    "description": "<p>Bitcoin’s supply last active less than a month ago has plummeted to an 8-year low. This often overlooked metric provides essential insights into the market’s current dynamics and is useful when analyzing historical trends. Bitcoin’s supply dynamics are helpful when analyzing the market, as they provide a window into the trading behavior of its vast [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-most-active-supply-hits-8-year-low/\">Bitcoin’s most active supply hits 8-year low</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T22:10:52.000Z",
    "title": "Prime Trust lost $8M after Terra collapsed; bought $76M ETH in unrelated wallet loss",
    "url": "https://cryptoslate.com/prime-trust-lost-8m-after-terra-collapsed-bought-76m-eth-in-unrelated-wallet-loss/",
    "description": "<p>Failed crypto custodian Prime Trust revealed new details about its past financial shortfalls in a filing submitted to bankruptcy courts on Aug. 24. That filing indicates that Prime Trust&#8217;s investment in the TerraUSD (USTC) stablecoin resulted in millions of dollars of losses for the company. Specifically, the company&#8217;s investment in the now-failed stablecoin led to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/prime-trust-lost-8m-after-terra-collapsed-bought-76m-eth-in-unrelated-wallet-loss/\">Prime Trust lost $8M after Terra collapsed; bought $76M ETH in unrelated wallet loss</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T22:00:29.000Z",
    "title": "Bitcoin faces crucial resistance as submerged cohorts of hodlers affect market sentiment",
    "url": "https://cryptoslate.com/insights/bitcoin-faces-crucial-resistance-as-submerged-cohorts-of-hodlers-affect-market-sentiment/",
    "description": "<p>Quick Take Information drawn from recent data analysis underscores the significant resistance that Bitcoin is encountering, with a price range from $26,419 up to $26,773. This resistance is critical because three different cohorts of average withdrawal prices are currently tagged as underwater, meaning that the current price is below the average price at which the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-faces-crucial-resistance-as-submerged-cohorts-of-hodlers-affect-market-sentiment/\">Bitcoin faces crucial resistance as submerged cohorts of hodlers affect market sentiment</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T20:50:36.000Z",
    "title": "Meta releases AI developer assistant ‘Code Llama’",
    "url": "https://cryptoslate.com/meta-releases-ai-assistant-code-llama/",
    "description": "<p>Facebook parent Meta announced on Aug. 24 that it is releasing Code Llama, a large language model (LLM) for use by coders and developers. The company said that Code Llama can generate and discuss code, improve workflow speeds, and reduce barriers to entry for new coders. Meta added that the new product is a code-specialized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/meta-releases-ai-assistant-code-llama/\">Meta releases AI developer assistant ‘Code Llama’</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-24T23:13:17.000Z",
    "title": "PEPE Developer Wallet Sends $15M to Binance, OKX, and Bybit",
    "url": "https://cryptobriefing.com/pepe-developer-wallet-sent-15m-to-binance-okx-and-bybit/?utm_source=feed&utm_medium=rss",
    "description": "PEPE developers sent over $15 million worth of PEPE to centralized exchanges and changed Initially, the project's multi-sig requirement from 5/8 to 2/8."
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-24T23:06:41.000Z",
    "title": "Bitcoin miner gets life in prison, China offers bounties for crypto firms: Asia Express",
    "url": "https://cointelegraph.com/magazine/bitcoin-miner-gets-life-in-prison-china-offers-bounties-for-crypto-firms-asia-express/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/01/magazine-Asia-Express-Jan-20-scaled.jpeg\"></p><p>Retail crypto trading is only days away in Hong Kong, but a mainland crackdown sees bounties offered for crypto firms and miners imprisoned.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-25T01:00:00.000Z",
    "title": "Top Game Dapp Iskra to Launch Clashmon During Base Mainnet Onchain Summer Roll Out",
    "url": "https://www.cryptoglobe.com/latest/2023/08/top-game-dapp-iskra-to-launch-clashmon-during-base-mainnet-onchain-summer-roll-out/",
    "description": "August 25, 2023 – Base opened mainnet for everyone on August 9 with their on-chain Summer campaign, featuring over 50 leading brands to connect users with the best on-chain art, music, and games daily throughout August. Top-ranking game Dapp Iskra will be one of the gaming category’s features, releasing its latest Free to Play game, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T08:00:33.000Z",
    "title": "\n                        PEPE Price Registers Drop As Large Transfers Spook Markets\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/pepe-price-registers-drop-as-large-transfers-spook-markets",
    "description": "\n                        <p dir=\"ltr\">The PEPE token registered a sharp decline in price after millions worth of the meme token flooded prominent crypto exchanges such as Binance, Bybit, and OKX.&nbsp;</p>\n<p dir=\"ltr\">The PEPE token is the third largest meme coin by market capitalization and has been the best-performing crypto asset of the ongoing year.&nbsp;</p>\nTroubling Multisig Changes And FUD\n<p dir=\"ltr\">According to the information available, around 16 trillion PEPE tokens flowed out of the PEPE multisig wallet on Thursday. The tokens were transferred to several addresses associated with OKX, Bybit, and Binance. The transfer came shortly after a user flagged troubling changes to the Pepe multisig wallet. The user pointed out that Pepe&rsquo;s multisig wallet had changed its threshold to 2/8 signatures. The initial requirement for the multisig wallet was ⅝ signatures.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Any reason why the PEPE multisig wallet changed the threshold to just 2/8 signatures? Seems weird. This isn&rsquo;t standard, right? Also, seems that some has been sent to exchanges.&rdquo;</p>\n\n<p dir=\"ltr\">The massive flow of PEPE tokens saw a wave of Fear, Uncertainty, and Doubt (FUD), leading to the value of the token drop by nearly 15% in minutes. This has been the first time the wallet, which holds a majority of the token supply, has sent out such a large quantity of the meme coin to exchanges. Users are also worried about the fact that the last tweet from the PEPE X account was over two weeks ago, leaving users worried if they should be worried about a rug pull.&nbsp;</p>\n<p dir=\"ltr\">However, other users pushed back against the fear-mongering, stating that there was a minimal chance of a rug pull in the case of PEPE.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Quick reminder to everyone - The only holders of more than 2.5% of PEPE are OKX and Binance, and of the top six holders, five are exchanges. Also, circulating supply = maximum supply. So there&rsquo;s a minimal risk for traditional &ldquo;rug&rdquo; here. The token belongs to the community.&rdquo;</p>\n\nWhat Next For PEPE?&nbsp;\n<p dir=\"ltr\">The PEPE token&rsquo;s price has dropped over the past 24 hours. The token was already in a bearish trend but has now dropped from $0.0000012 to around $0.0000008. Assuming the latest warnings about changes to Pepe&rsquo;s multisig wallet are all FUD, the token&rsquo;s underlying fundamentals look strong. According to data from Etherscan, the token is closing in on 140,000 token holders. This figure has seen a considerable increase over the past few months despite there being no major price pump.&nbsp;</p>\n<p dir=\"ltr\">This continued growth suggests that PEPE&rsquo;s adoption as a crypto asset continues to grow, which bodes well for the future.&nbsp;</p>\nNew PEPE Memecoin On BNB Chain&nbsp;\n<p dir=\"ltr\">In June, the Pepe team had announced the launch of a new PEPE memecoin. The announcement came shortly after the launch of a similar token on Ethereum. The new token was issued as a BEP20 token on the BNB chain and has several unique mechanisms programmed into its tokenomics. The market capitalization for the PEPE token that debuted on Ethereum exceeded $1 billion by the 5th of May. The team behind the PEPE BNB token plans to launch multiple projects, with 13 launches scheduled for 2023.&nbsp;</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T07:00:00.000Z",
    "title": "\n                        Bitstamp To End ETH Staking for US Customers Come September 25\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bitstamp-to-end-eth-staking-for-us-customers-come-september-25",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">Cryptocurrency exchange Bitstamp announced it would end Ethereum (ETH) staking services to its US customers as of September 25. The exchange cited the US regulatory environment as a deciding factor.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Luxembourg-based cryptocurrency exchange Bitstamp announced it would end ETH staking services to its US customers on September 25. The exchange told Blockworks it would shutter staking services due to the US regulatory environment.&nbsp;&nbsp;</p>\nBitstamp Cites Uncertain US Regulatory Environment \n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In a statement, Bitstamp US CEO Bobby Zagotta said: </p>\n\n<p>&ldquo;As a result, US customers will stop receiving staking rewards. All other Bitstamp services will remain unaffected.&rdquo;&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">He continued to say, </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Customers will continue earning staking rewards up until September 25, 2023, and after that, all staked assets will be unstaked. Rewards, along with the principal, will be credited to users&rsquo; main Bitstamp account balances. Typically, this process takes a few days but could be extended depending on network conditions.&rdquo;&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Zagotta explained the uncertain regulatory environment in the US motivated the exchange&rsquo;s decision to discontinue staking services. He noted that &ldquo;as one of the most regulated and trusted exchanges in the world, we have a comprehensive framework in place to continuously evaluate the services we support, taking into account the evolving regulatory environment in all jurisdictions in which we operate.&rdquo;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Further stating: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Considering current regulatory dynamics in the US, we&rsquo;ve made the decision to discontinue staking for customers residing in the United States.&rdquo;&nbsp;</p>\n\nStaking Controversy Continues\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Staking services in the US have been a topic of considerable controversy recently. The US Securities and Exchange (SEC) came down on Kraken in February when it alleged the exchange failed to register its staking service as an unregistered offering. The SEC argued Kraken&rsquo;s staking program was an unlawful offer and sale of securities. In a settlement, Kraken agreed to shutter its staking program.&nbsp;&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The securities agency famously sued Coinbase in June, alleging it offered and sold unregistered securities through its staking service.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Under intensified pressure from the SEC, Bitstamp recently announced that it would suspend trading for several cryptocurrencies that the SEC identified as securities in its lawsuit against Coinbase and Binance. Bitstamp said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Update for our US users Starting August 29: AXS, CHZ, MANA, MATIC, NEAR, SAND, and SOL trading will be halted after evaluating recent market developments. Execute any open trades. Holding and withdrawing tokens afterwards will be unaffected.&rdquo;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T06:30:40.000Z",
    "title": "\n                        Binance Pay Launches in Brazil\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/binance-pay-launches-in-brazil",
    "description": "\n                        <p class=\"md-end-block md-p\">Binance, the renowned global crypto exchange, has expanded its footprint by introducing its payment solution, Binance Pay, to the Brazilian market.</p>\n<p class=\"md-end-block md-p\">According to a press release from the firm, the project's launch aims to revolutionize how Brazil-based merchants process transactions by offering a viable crypto payment alternative.</p>\n<p class=\"md-end-block md-p\">The surge in the adoption of cryptocurrencies in Brazil has been notable, with a growing number of consumers and businesses exploring digital assets for both investments and everyday transactions. Recognizing this trend, Binance's strategic move is anticipated to further fuel the integration of cryptocurrencies into the country's mainstream commerce.</p>\nBrazil's Push for Crypto Adoption\n<p class=\"md-end-block md-p md-focus\">Binance Pay promises merchants a plethora of advantages, most notably the benefit of low transaction fees. This feature can significantly enhance the profitability of businesses, especially those operating with thin margins. Additionally, the platform boasts real-time processing, which could drastically reduce the waiting times traditionally associated with financial transactions. This expedited processing can lead to swifter business operations and improved customer satisfaction.</p>\n<p class=\"md-end-block md-p\">While the global acceptance of cryptocurrencies is still a topic of debate, there's no denying their transformative potential in specific markets. Brazil, with its dynamic economy and tech-savvy population, appears to be a ripe environment for such innovations. The country has also passed its crypto bill sometime in late 2022, with the country's own CBDC (central bank digital currency) already a work in progress. Binance Pay's launch in Brazil not only underscores the company's commitment to global expansion but also reflects its belief in the long-term viability of cryptocurrencies as a standard payment medium.</p>\nUse and Integration\n<p class=\"md-end-block md-p\">To use Binance Pay for purchases in Brazil, consumers follow a procedure akin to the fiat payment system, Pix. Merchants can incorporate Binance Pay into their payment process. Payments can be made via web checkout or the Binance App by scanning a QR code. At each transaction, customers choose which cryptocurrency in their wallet to use. Merchants interested in using the service can access Binance Pay directly.</p>\n<p class=\"md-end-block md-p\">With Binance Pay making its services available in Brazil, local merchants in the country now have access to an advanced payment solution that can potentially reshape the commercial landscape by enabling a crypto-based payment platform to connect with their customers and clients.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T06:10:00.000Z",
    "title": "\n                        Web3 Social Network Farcaster Migrates to OP Mainnet\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/web3-social-network-farcaster-migrates-to-op-mainnet",
    "description": "\n                        <p class=\"md-end-block md-p md-focus\">The decentralized social media protocol is migrating to OP Mainnet according to a post by Farcaster co-founder Dan Romero today August 23.</p>\n<p class=\"md-end-block md-p\">Romero has also noted that many of Farcaster&rsquo;s users and developers &ldquo;are building on the OP Stack across OP Mainnet, Base &amp; Zora.&rdquo; Once the cursory steps for the migration are done, the next step will be the enabling of permission-less sign-ups which will finally open up Farcaster to the broader world. This is a big step for Farcaster, especially with OP Mainnet picking up steam and the recent increase of interest in social dApps.</p>\n<p class=\"md-end-block md-p\">At present, Farcaster is still on Ethereum, with a big chunk of its data stored offchain in servers. But the recent growth and developments in Ethereum&rsquo;s layer 2 ecosystem have given developers a wide range of tools and options. OP Mainnet, as mentioned, is currently picking up steam with its recent &lsquo;Bedrock&rsquo; update that became the first step in its goal of creating a &ldquo;superchain&rdquo;. The update paved the way for higher transaction throughput but with lower gas fees.</p>\n<p class=\"md-end-block md-p\">This migration is considered strategic, especially given how Ethereum L2s have been rapidly evolving and are now processing nearly five times as many transactions per second (TPS) as the primary Ethereum network. Projects that operate in the Ethereum ecosystem, like Farcaster, are recognizing the advantages of Layer 2 solutions and are subsequently shifting their focus.</p>\n<p class=\"md-end-block md-p\">Farcaster's migration move is indicative of a broader trend in the world of Web3, where platforms are seeking to leverage the enhanced transaction throughput and reduced fees of Layer 2 and 3 solutions. For instance, Lens, another decentralized social media protocol developed by Aave, operates on a specialized Layer 3 appchain.</p>\n<p class=\"md-end-block md-p\">With layer 2 protocols optimizing their transaction throughputs, the potential for decentralized social apps like Farcaster could be endless, especially with OP Mainnet&rsquo;s collaborative vision as manifested in its goal of a superchain.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T06:30:46.000Z",
    "title": "Ministry of Economic Development of Russia Pessimistic About Quickly Advancing BRICS Common Currency Proposal",
    "url": "https://news.bitcoin.com/ministry-of-economic-development-of-russia-pessimistic-about-quickly-advancing-brics-common-currency-proposal/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ministry of Economic Development of Rusia Is Pessimistic About Advancing a BRICS Common Currency Proposal\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2350944517.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Ministry of Economic Development of Russia does not expect the rapid development of a common currency for the BRICS bloc. Deputy Economic Development Minister Vladimir Ilyichev stated that &#8220;quick breakthroughs&#8221; on this issue are unlikely to happen during the ongoing BRICS summit, citing the process the European Union underwent to create the euro. Ministry [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T04:30:40.000Z",
    "title": "BRICS States Should Tackle AI Risks Together, Xi Jinping Says",
    "url": "https://news.bitcoin.com/brics-states-should-tackle-ai-risks-together-xi-jinping-says/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRICS States Should Tackle AI Risks Together, Xi Jinping Says\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-1024x578.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1342197665.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />BRICS nations should address the risks related to artificial intelligence (AI), Chinese President Xi Jinping said during the group’s summit in South Africa. China’s leader is also convinced that the members of the economic bloc must work to standardize the technology. BRICS Should Strive for AI Standardization, Chinese President Suggests BRICS members should resist the [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T03:00:11.000Z",
    "title": "Cypher Says Token Offering Part of Steps to Make Users Whole",
    "url": "https://news.bitcoin.com/cypher-says-token-offering-part-of-steps-to-make-users-whole/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cypher Says Token Offering Part of Steps to Make Users Whole\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gcdrt67.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Solana-based digital asset exchange announced on Aug. 23 that it is planning the &#8220;most fair&#8221; token launch in the history of Solana. According to Cypher, part of the funds raised via the initial decentralized offering will be used &#8220;to sustain protocol development, pay for audits to relaunch the protocol, and initiate a treasury for [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T01:30:01.000Z",
    "title": "BRICS Leaders Declare Importance of Using Local Currencies in International Trade",
    "url": "https://news.bitcoin.com/brics-leaders-declare-importance-of-using-local-currencies-in-international-trade/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRICS Leaders Declare Importance of Using Local Currencies in International Trade\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/brics-summit-declaration.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The BRICS leaders stress “the importance of encouraging the use of local currencies in international trade and financial transactions&#8221; in their declaration released at the conclusion of their 15th annual summit. In addition, the BRICS nations have tasked their finance ministers and central bank governors to &#8220;consider the issue of local currencies, payment instruments, and [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T00:00:55.000Z",
    "title": "BRICS Invites 6 Countries to Join, Including Saudi Arabia, UAE, Iran",
    "url": "https://news.bitcoin.com/brics-invites-6-countries-to-join-including-saudi-arabia-uae-iran/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRICS Invites 6 Countries to Join, Including Saudi Arabia, UAE, Iran\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/6-nations-to-join-brics.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The BRICS economic bloc has invited six countries to become new members: Argentina, Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates. The BRICS leaders wrapped up their 15th annual summit on Thursday. “We have reached agreement on the guiding principles, standards, criteria, and procedures of the BRICS expansion process,” said South Africa’s president. [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-24T22:30:12.000Z",
    "title": "SEC Charges Former US Correctional Officer With Fraudulent Crypto Token Sale",
    "url": "https://news.bitcoin.com/sec-charges-former-us-correctional-officer-with-fraudulent-crypto-token-sale/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Charges Former US Correctional Officer With Fraudulent Crypto Token Sale\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2223168237.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission said on Aug. 23 that it had charged a former New Jersey correctional officer &#8220;with fraudulently raising funds through the unregistered offering of the blazar token.&#8221; The Commission said the correctional officer&#8217;s scam was primarily targeted at law enforcement agents and first responders. Replacing the State Pension System With [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-24T21:00:08.000Z",
    "title": "Founders of Crypto Mixer Tornado Cash Accused of Laundering $1 Billion",
    "url": "https://news.bitcoin.com/founders-of-crypto-mixer-tornado-cash-accused-of-laundering-1-billion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Founders of Crypto Mixer Tornado Cash Accused of Laundering $1 Billion\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/tc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The founders of the cryptocurrency mixing service Tornado Cash were charged Thursday with allegedly helping to launder more than $1 billion in digital currency, including funds taken by North Korean hackers. Department of Justice: ‘You Can’t Hide From Us Behind a Keyboard — Whether You’re a Hacker or Facilitator’ Roman Storm and Roman Semenov were [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T07:41:49.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $20.60 with a 24-hour trading volume of $618,897,839. Solana is down 3.33% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $9,473,881,101. It has a circulating supply of 418,890,490 SOL coins, and the maximum supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T07:33:48.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1014, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.02% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T07:08:37.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $64.4. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 0.74% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T07:05:40.000Z",
    "title": "Concerns Raised by Kevin Sorbo and Sam Sorbo Over Use of AI in Hollywood",
    "url": "https://www.cryptopolitan.com/concerns-raised-by-kevin-sorbo-and-sam-sorbo-over-use-of-ai-in-hollywood/",
    "description": "Actors Kevin Sorbo and his wife Sam Sorbo, known for their roles in &#8220;Hercules: The Legendary Journeys,&#8221; have expressed apprehension regarding the growing utilization of artificial intelligence (AI) in the entertainment industry. The couple, who run Sorbo Studios, a production company specializing in family-friendly, faith-based content, shared their concerns during an interview with Fox News ... <a title=\"Concerns Raised by Kevin Sorbo and Sam Sorbo Over Use of AI in Hollywood\" class=\"read-more\" href=\"https://www.cryptopolitan.com/concerns-raised-by-kevin-sorbo-and-sam-sorbo-over-use-of-ai-in-hollywood/\" aria-label=\"More on Concerns Raised by Kevin Sorbo and Sam Sorbo Over Use of AI in Hollywood\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T06:55:44.000Z",
    "title": "C3.ai Stock Faces Setback as AI Hype Wanes, Shares Plummet 11%",
    "url": "https://www.cryptopolitan.com/c3-ai-stock-faces-setback-as-ai-hype-wanes/",
    "description": "In a stark reversal, C3.ai (NYSE: AI) witnessed a sharp decline in its stock price, with a plunge of over 11% on Thursday. This dip has pushed the shares to a low of $28.18, marking the lowest level since May 25th. The broader picture reveals a significant drop of more than 41% from its peak ... <a title=\"C3.ai Stock Faces Setback as AI Hype Wanes, Shares Plummet 11%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/c3-ai-stock-faces-setback-as-ai-hype-wanes/\" aria-label=\"More on C3.ai Stock Faces Setback as AI Hype Wanes, Shares Plummet 11%\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T06:50:42.000Z",
    "title": "Malaysia, Indonesia, and Thailand promote domestic currency use in bilateral transactions",
    "url": "https://www.cryptopolitan.com/malaysia-indonesia-thai-domestic-currency/",
    "description": "Bank Negara Malaysia (BNM), Bank Indonesia (BI), and Bank of Thailand (BOT) have collectively entered into three bilateral Memorandum of Understanding (MoUs) aimed at enhancing collaboration in advancing the utilization of domestic currencies in bilateral transactions. In a combined statement, the central banks highlighted that these MoUs constitute the establishment of a Framework for Cooperation ... <a title=\"Malaysia, Indonesia, and Thailand promote domestic currency use in bilateral transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/malaysia-indonesia-thai-domestic-currency/\" aria-label=\"More on Malaysia, Indonesia, and Thailand promote domestic currency use in bilateral transactions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T06:30:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T06:22:59.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.539. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced a decrease of 1.5% in ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T06:21:29.000Z",
    "title": "China requests banks to restrict certain outflows via Connect bond",
    "url": "https://www.cryptopolitan.com/china-requests-banks-to-restrict-bonds/",
    "description": "China&#8217;s central bank has instructed several local banks to reduce their external investments utilizing the Bond Connect scheme. The People&#8217;s Bank of China (PBOC) has reportedly issued these instructions to curb the flow of the yuan into Hong Kong. The action is intended to limit the availability of yuan in offshore markets. China controlling offshore ... <a title=\"China requests banks to restrict certain outflows via Connect bond\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-requests-banks-to-restrict-bonds/\" aria-label=\"More on China requests banks to restrict certain outflows via Connect bond\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T06:20:45.000Z",
    "title": "Composable Function-Preserving Transformations Enhance Transformer Training Efficiency",
    "url": "https://www.cryptopolitan.com/composable-function-transformations/",
    "description": "Explore the groundbreaking research collaboration between Google DeepMind and University of Toulouse. Learn about innovative parameter expansion transformations enhancing Transformer model capabilities while maintaining core functions. Explore the six function-preserving transformations revolutionizing AI model training efficiency and opening new horizons for future applications."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-24T21:58:55.000Z",
    "title": "Bots amass over $2 million in profits on Friend.tech",
    "url": "https://crypto.news/bots-amass-over-2-million-in-profits-on-friend-tech/",
    "description": "Recent data from 21Co's research analyst Tom Wan, obtained more than 21,800 Keys in the past two weeks, shares Friend.tech resulted in a profitable yield of $2.1 million"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-24T21:42:00.000Z",
    "title": "Mastercard and Binance to terminate partnership in September",
    "url": "https://crypto.news/mastercard-and-binance-to-terminate-partnership-in-september/",
    "description": "The joint effort between Mastercard and Binance to offer crypto card services in Argentina, Brazil, Colombia, and Bahrain will end on Sep. 22"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T07:22:26.000Z",
    "title": "Apecoin Weakens Grip In Last 30 Days – Should Investors Get Worried?",
    "url": "https://www.newsbtc.com/news/apecoin-weakens-grip-in-last-30-days-should-investors-get-worried/",
    "description": "Apecoin (APE) finds itself in turbulent waters as the once-promising gaming token experiences a precipitous decline, marking a 30% drop in the last 30 days, despite the efforts of bullish investors to shore up its value, APE has plummeted well below the $1.70 support level, raising concerns of a potential free-fall that could see its value revisit the abyss of $1. Currently trading at $1.41, according to CoinGecko, APE has faced a 6% decline in the past 24 hours and a 7.2% loss over the last seven days.  APE price action today. Source: Coingecko This pivot may be contingent on Bitcoin&#8217;s performance, particularly its ability to reclaim the price range between $28,000 and $30,000 in the long term. Related Reading: Algorand Stuck At Bearish Price Level – Can Bulls Reverse Path? Challenges Ahead: Bearish Momentum Grips Apecoin Without a swift change in sentiment, Apecoin holders might find themselves trapped in a downward spiral with no visible bottom. The Relative Strength Index (RSI), a key indicator of market momentum, recently attempted a reversal but was quickly thwarted, driving the index back into the oversold zone. This retreat underscored the persistent selling pressure that has hindered APE&#8217;s attempts at a price recovery. Since April 2023, the market has been dominated by bears, as each attempt by buyers to establish a support level has been met with subsequent losses. The sustained downward pressure has curtailed any bullish initiatives, leaving APE&#8217;s future uncertain. APEUSD trading at $1.41 today. Chart: TradingView.com Whale Activity Raises Questions Amid Bleak Outlook Amid the prevailing bearish sentiment, a notable development has emerged in the Apecoin (APE) ecosystem. A report citing data from LookOnChain reveals substantial activity from a significant APE whale, Machi Big Brother, starting from August. The whale, making purchases totaling 1.51 million APE tokens, equivalent to a staggering $3.09 million, executed these transactions on Binance. Machi Big Brother&#8217;s substantial investments might indicate confidence in Apecoin&#8217;s future prospects. However, the larger sentiment surrounding APE tells a different story. As of August 17, prevailing sentiment remains bearish, with analysts projecting a potential decline in APE&#8217;s value to $1.36 by September. Apecoin MVRV down for the month. Source: Santiment Meanwhile, Santiment&#8217;s data revealed an interesting statistic. Apecoin investors have suffered significant losses, with the Market Value to Realized Value (MVRV) ratio falling by -15.90% and -25.49% for monthly and quarterly holders, respectively. Apecoin finds itself at a critical juncture, grappling with intense bearish pressures that have led to a significant erosion of its value. As market sentiment remains uncertain, all eyes are on both Bitcoin&#8217;s performance and APE&#8217;s ability to shake off the shackles of bear dominance and regain its foothold in the volatile cryptocurrency landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from UnSplash"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T04:48:27.000Z",
    "title": "ADA Price Dips Worth Buying? What Key Market Indicators Suggest",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-dips-0-252/",
    "description": "Cardano’s price started a fresh decline below $0.280. ADA is struggling and key indicators suggest high chances of more downsides below $0.252. ADA price is gaining bearish momentum below the $0.285 level against the US dollar. The price is trading above $0.280 and the 100 simple moving average (4 hours). There is a major bearish trend line forming with resistance near $0.274 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could start a recovery wave if there is a close above the $0.280 resistance. Cardano’s ADA Price Faces Uphill Task In the past few days, Cardano’s price saw a fresh decline from well above $0.288. The price traded below the $0.285 and $0.280 support levels to move into a bearish zone, similar to Bitcoin and Ethereum. The price even declined below $0.265 and tested the $0.245 support. A low is formed near $0.2455 and the price is now consolidating losses. There was a minor increase above the 23.6% Fib retracement level of the downward move from the $0.3018 swing high to the $0.2455 low. However, the bears are active near the $0.270 zone. ADA price is now trading below $0.280 and the 100 simple moving average (4 hours). There is also a major bearish trend line forming with resistance near $0.274 on the 4-hour chart of the ADA/USD pair. On the upside, immediate resistance is near the $0.270 zone. The first major resistance is forming near the $0.274 zone and the trend line. It is close to the 50% Fib retracement level of the downward move from the $0.3018 swing high to the $0.2455 low. Source: ADAUSD on TradingView.com The next key resistance might be $0.280. If there is a close above the $0.280 resistance, the price could start a decent increase. In the stated case, the price could rise toward the $0.300 resistance zone. More Losses? If Cardano’s price fails to climb above the $0.274 resistance level, it could start another decline. Immediate support on the downside is near the $0.252 level. The next major support is near the $0.2455 level. A downside break below the $0.2455 level could open the doors for a sharp fresh decline toward $0.220. The next major support is near the $0.200 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is gaining momentum in the bearish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.252, $0.2455, and $0.220. Major Resistance Levels – $0.270, $0.274, and $0.280."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T04:06:12.000Z",
    "title": "Ethereum Whales Accumulate – Can Price Start Recovery Now?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-whales-accumulate-1620/",
    "description": "Ethereum price is struggling to rise above $1,700 against the US Dollar. ETH whales seem to accumulate, and the $1,620 support could be the key. Ethereum is struggling to rise above the $1,680 and $1,700 levels. The price is trading below $1,670 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $1,665 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a decent increase above the $1,670 and $1,700 resistance levels. Ethereum Price Holds Support Ethereum’s price started a short-term upside correction above the $1,650 level. ETH even climbed above the $1,670 level but the bears were active near the $1,700 zone, like Bitcoin. The price traded as high as $1,698 and is currently moving lower. There was a drop below the $1,670 level. The price even tested the 50% Fib retracement level of the upward move from the $1,580 swing low to the $1,698 high. Ether is now trading below $1,670 and the 100-hourly Simple Moving Average. There is also a connecting bearish trend line forming with resistance near $1,665 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, the price might face resistance near the $1,670 level and the trend line zone. The next resistance is near the $1,700 zone. To start a decent recovery wave, the price must settle above the $1,700 zone. The next major resistance is near the $1,780 level, above which the price could rise toward the $1,820 level. Any more gains might send the price toward the $1,920 resistance. More Losses in ETH? If Ethereum fails to clear the $1,700 resistance, it could continue to move down. Initial support on the downside is near the $1,640 level. The first major support is near the $1,620 zone or the 61.8% Fib retracement level of the upward move from the $1,580 swing low to the $1,698 high. The next key support is close to $1,600. If there is a downside break below $1,600, there could be more losses. The next major support is near the $1,520 support level. Any more losses might send the price toward the $1,440 level or even $1,320. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,620 Major Resistance Level – $1,700"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T03:14:47.000Z",
    "title": "Bitcoin Price Could Range Trade Before The Next Big Move",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-range-26000/",
    "description": "Bitcoin price is consolidating above the $25,500 level. BTC could start a decent increase if there is a close above the $27,000 resistance. Bitcoin is struggling to clear the $26,500 resistance zone. The price is trading near $26,100 and the 100 hourly Simple moving average. There was a break below a connecting bullish trend line with support near $26,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to trade in a range before the next major move. Bitcoin Price Slides Again Bitcoin price started a recovery wave above the $26,250 resistance level. BTC even cleared the $26,500 level but the bears were active near the $26,750 zone. A high was formed near $26,779 and the price started a fresh decline. There was a move below the $26,500 level. The price declined below the 50% Fib retracement level of the recovery move from the $25,360 swing low to the $26,779 high. Besides, there was a break below a connecting bullish trend line with support near $26,400 on the hourly chart of the BTC/USD pair. The pair tested the 61.8% Fib retracement level of the recovery move from the $25,360 swing low to the $26,779 high. Bitcoin is trading near $26,100 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $26,400 level. The first major resistance is now near the $26,780 level, above which the price might rise toward the $27,000 resistance. Source: BTCUSD on TradingView.com To start a strong increase, the price must settle above the $27,000 resistance. In the stated case, the price could test the $27,800 level. Any more gains might set the pace for a larger increase toward $28,200. More Losses In BTC? If Bitcoin fails to clear the $26,400 resistance, it could continue to move down. Immediate support on the downside is near the $25,900 zone. The next major support is near the $25,400 level. A downside break below the $25,400 level might push the price again into a bearish zone. In the stated case, the price could drop toward $24,800. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $25,900, followed by $25,400. Major Resistance Levels – $26,400, $26,780, and $27,000."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T02:00:57.000Z",
    "title": "Ethereum Records Massive Whale Activity Amidst ETH Price Drop: Santiment",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-records-massive-whale-activity-amidst-eth-price-drop-santiment/",
    "description": "Over the last week, Ethereum (ETH) has seen its price take a slight hit following the general market crash due to reports of a massive Bitcoin sell-off. According to data from CoinMarketCap, ETH is down by 5.01% in the last seven days, bringing its total price loss in the previous month to 10.80%.  Albeit, despite Ethereum&#8217;s negative performance, the on-chain analytics platform, Santiment, has noted some positive developments in terms of whale activity. Related Reading: Here’s Why This Crypto Expert Believes Ethereum Is The ‘Biggest Block’ Against Bitcoin Adoption Ethereum Experiences Highest Whale Activity In 4 Months On Thursday, August 24, Santiment posted a report on X (formerly Twitter) stating that Ethereum has recorded its largest level of whale transactions in the last 16 weeks.  According to the blockchain intelligence firm, there has been a notable increase in transactions by addresses with large ETH holdings following the token’s fall beneath the 1,650 price mark last week. 🐳 #Ethereum&#8216;s network has picked up in large address activity during this drop below $1,650 and its highly volatile price conditions. The amount of wallets holding between 10 and 10,000 $ETH has risen back up to 355K, and $100K+ transactions have surged. https://t.co/X137U93ZYu pic.twitter.com/J9lyMoeBmf — Santiment (@santimentfeed) August 24, 2023 Sentiment reported that Ethereum experienced 23,073 ETH whale transactions in the past week, marking the network’s highest since May 4.   In addition, the report also stated that the number of wallets with 10-10,000 ETH had surged by 1,788 since the start of June, returning this metric to the previous high of 355,000.  Related Reading: Ethereum Price Could See “Liftoff” if It’s Able to Clear One Crucial Level Could The ETH Market Experience A Boost Soon? Based on Santiment’s report, it can be inferred that the decline in ETH’s price has led to a buying spree by large investors anticipating a price surge, thus taking advantage of the current market dip.  Providing more insight into this trend, Lookonchain, another market intelligence firm, has also reported on the ongoing accumulation of ETH.  Via an X post on Thursday, Lookonchain stated that four whales have collectively purchased 56,100 ETH, valued at $94 million, in the last seven days.  Following such heavy investments, it appears that ETH major investors are banking on the prominent altcoin to begin a market rebound soon.  However, data from Coincodex states that general market sentiments around ETH remain bearish. At the same time, the Fear &#38; Greed Index is set at 41, indicating that many other investors are still skeptical about the token’s potential gains. ETH is trading at $1,652.06 at the time of writing, with a 1.861% loss on the last day. In tandem, the token’s trading volume is also down by 31.07%, valued at $5.67 billion.  Notwithstanding, with a market cap value of $198.36 billion, Ethereum remains the second-largest cryptocurrency.  ETH trading at $1,652.4 on the weekly chart &#124; Source: ETHUSD chart on Tradingview.com Featured image from BBC Wildlife Magazine, chart from Tradingview."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T01:00:02.000Z",
    "title": "CZ Breaks Silence, Refutes Binance’s Bitcoin Dumping Allegations To Safeguard BNB",
    "url": "https://www.newsbtc.com/bitcoin-news/cz-breaks-silence-refutes-binances-bitcoin-dumping-allegations-to-safeguard-bnb/",
    "description": "In response to mounting speculation and accusations circulating within the crypto community, Binance CEO Changpeng Zhao (CZ) has addressed allegations of a significant sell-off of Bitcoin (BTC) by Binance. These allegations have been linked to a 7% BTC price drop.  CZ took to Twitter to respond, reposting a thread by a user named ZkHopium, who provided a detailed analysis debunking the claims and highlighting the fundamental basis of the situation. Related Reading: Shiba Inu Burn Tracker Unveils SHIB Association, What Is It About? CZ Debunks Allegations Of Bitcoin Dumping The thread by ZkHopium sheds light on the events surrounding the Binance Coin (BNB) liquidation on Venus Protocol. It explains that the exploit occurred on October 6th, 2022, on the Binance Smart Chain (BSC), creating 2 million BNB.  Of this amount, 900,000 BNB were deposited on Venus Protocol to borrow approximately $150 million worth of USDT and USDC. In response, the BNB chain burned more than 2 million BNB, equivalent to around $550 million at the time, effectively removing these tokens from circulation. To facilitate the liquidation process, Venus Protocol passed a governance proposal, designating BNB Chain as the sole liquidator for the loan. BNB Chain then funded the liquidator&#8217;s wallet with 30 million BUSD in December 2022, an additional 30 million USDT in June 2023, and another 30 million USDT on August 21, 2023. The liquidation mechanism of Venus Protocol involves a collateral factor or liquidation threshold. When triggered, liquidators can gradually liquidate up to 50% of the collateral, receiving an additional 10% worth of liquidated collateral as fees.  ZkHopium&#8217;s analysis highlights several significant factors that make this case unique. Firstly, only one liquidator is not incentivized to engage in market dumping. Secondly, the liquidations are performed manually, without the involvement of bots front-running the process.  Lastly, given the substantial loan size, the liquidation tranches are expected to be much lower than the 50% threshold. Addressing the allegations, CZ expressed his appreciation for the detailed research presented by ZkHopium and emphasized the “insignificance” of a $30 million liquidation&#8217;s impact on Bitcoin’s price.  CZ stated that Binance does not issue BTC and that most rewards are given in BNB. He highlighted that the alleged fear of a significant BTC price impact is unfounded, as $30 million represents less than 0.001% of BTC&#8217;s daily trading volume. At the time of writing, BNB is trading at $217, as the chart above indicates. However, it has experienced a marginal decline of 0.2% over the past 24 hours. BTC Hovers Around $26,000 Amid Minor Dip The largest cryptocurrency in the market by market cap, Bitcoin, currently valued at $26,000, has remained relatively stagnant, experiencing a decline of 2.4% after briefly touching the $26,700 mark.  Despite the current low levels of volatility, Keith Alan, co-founder of the research and analysis firm Material Indicators, has noted the following regarding the market situation:  Economic reports released this morning did not significantly impact volatility; however, they will contribute to the narrative influenced by Jerome Powell&#8217;s upcoming speech at Jackson Hole on Friday. As anticipation builds for Federal Reserve Chairman Jerome Powell&#8217;s comments at the Jackson Hole Symposium, the Bitcoin market is beginning to show signs of increased activity. Keith Alan suggests that the economic reports, although not immediately affecting volatility, will shape Powell&#8217;s narrative during his speech.  Related Reading: Algorand Stuck At Bearish Price Level – Can Bulls Reverse Path? This anticipation will likely lead to heightened volatility as the BTC market approaches the weekend. Traders and investors are bracing themselves for potential market fluctuations as Powell&#8217;s speech unfolds, with the expectation that his statements could significantly impact the cryptocurrency market. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T00:00:10.000Z",
    "title": "1inch Launches DEX Aggregation Protocol On Base Network",
    "url": "https://www.newsbtc.com/news/defi/1inch-launches-dex-aggregator-on-base-network/",
    "description": "Decentralized exchange (DEX) aggregator 1inch Network has announced the expansion of its operations to Coinbase’s Ethereum layer 2 (L2) network, Base.  1inch&#8217;s Aggregation And Limit Order Protocols Go Live On Base In a blog post published on Thursday, August 24, 1inch disclosed the deployment of its aggregation protocol and limit order protocol on the Coinbase-incubated Base network.  The project&#8217;s team stated that this action is in line with their goal to expand in the decentralized finance (DeFi) industry.  1inch will begin its operation by aggregating liquidity across 15 decentralized exchanges on the Base network. These DEXs, including Uniswap and SushiSwap, also recently launched on Base. Related Reading: Base TVL Surges 900% In 2 Weeks, What’s Driving The Growth? Serg ej Kunz, co-founder of 1inch Network, stated the following regarding this development: We are happy to expand to Base. The Base network is a very promising L2 solution, plus it’s incubated by such a major player as Coinbase. In addition, we totally share Base’s philosophy aimed at bringing the next billion users to blockchain. Before this latest development, 1inch had already been deployed on various networks, including Ethereum, BNB chain, Avalanche, Polygon, Arbitrum, etc. Moreover, it is one of the leading DEX aggregators, with a trading volume of over $1 billion in the past week.  A Testament To Growing Interest In Base? The Base network has enjoyed significant interest and growth since opening its doors to the public on the 9th of August. As inferred earlier, 1inch is just one of the numerous prominent decentralized finance protocols launched on the layer 2 network over the past few weeks.  Notably, the increasing popularity of decentralized social media platform Friend.tech has primarily contributed to Base’s rising network activity in the last few days.  Due to the platform&#8217;s growing traction, Base’s daily transaction-per-second (TPS) peaked at 15.88 on Monday, August 21, surpassing Ethereum and other layer 2 networks within the same day. Related Reading: BALD Deployer Moves Proceeds Of The Rug From Base To Ethereum According to L2Beat data, Base currently sits third on the L2 network activity ranking, with a TPS of 8.6. Overall, this reflects a 73.74% increase in the past seven days.  Following the BALD meme coin rug pull and other issues, it seemed like Base’s growth would be deterred by an unfavorable reputation. However, with the recent DeFi activity surge, the network appears to rise above every negative sentiment surrounding it. 1INCH price on a downward trend on the daily timeframe &#124; Source: 1INCHUSDT chart on TradingView Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T23:00:15.000Z",
    "title": "Ethereum Whales Ready For Next Leg-Up After Buying 56,000 ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whales-ready/",
    "description": "Following the crypto market crash last week, Ethereum whales look to be gearing up for a recovery as they accumulate ETH. This accumulation trend is very telling of what these large investors expect the market to do next, which could serve as an indication of what’s to come. Ethereum Whales Buy Over 56,000 ETH On Thursday, the on-chain data tracker Lookonchain took to X (formerly Twitter) to reveal the activities of Ethereum whales over the last week. The post shed light on the sentiment among these large holders and showed their expectations for the digital asset. Related Reading: Which Top Meme Coins Have Held Their Value Best Amid The Crypto Market Crash? According to the screenshots posted by the tracker, four Ethereum whales went on an impressive buying that saw their balances jump significantly. Between them, they bought a total of 56,100 ETH, worth $94 million, in the last week alone. These whales identified as smartestmoney.eth, 0x3CEE, 0X5bA3, and 0x3478 bought 18,300 ETH ($30.6 million), 18,000 ETH ($30 million), 17,900 ETH ($30 million), and 2,000 ETH ($3.4 million), respectively, during this seven-day timeframe. Whales are accumulating $ETH from the bottom! 4 whales accumulated 56.1K $ETH ($94M) in the past 7 days. &#8211; 0x3CEE accumulated 18K $ETH($30M); &#8211; 0x3478 accumulated 2K $ETH($3.4M); &#8211; 0x5bA3 accumulated 17.9K $ETH($30M); &#8211; smartestmoney.eth accumulated 18.2K $ETH($30.6M). pic.twitter.com/M93Mhkpn6p — Lookonchain (@lookonchain) August 24, 2023 All of the whales acquired this stash over multiple transactions, withdrawing large amounts of ETH from crypto exchanges Binance and OKX. Even more interesting is the fact that these accumulations began after the market crash that saw ETH fall to $1,500, suggesting these whales are trying to catch the bottom. Is An ETH Recovery Imminent? Ethereum’s fall to $1,600 pushed the assets below critical levels for maintaining its bullish momentum. These include the 100-day and 200-day moving averages. However, it is not all bad for the digital asset going forward. As the Crypto Fear &#38; Greed Index shows, investor sentiment has been slowly but surely recovering over the last few days. This suggests that faith is returning for investors and they are beginning to put money back into the market. If this continues, then the influx could see the price of Bitcoin continue to recover, dragging the likes of Ethereum along with it. Related Reading: SHIB Burn Rate Jump 1,100% Amid Expectations Of Shibarium Relaunch Right now, the most important level for ETH to beat remains the resistance at $1,700. But if bulls are able to successfully retake this level and turn it into support, then the recovery is expected to be long-lived. Otherwise, the price of the altcoin could fall back toward $1,500. At the time of writing, ETH is changing hands at $1,664, meaning the whale investors are already sitting in profit. ETH whales reclaim support above $1,600 &#124; Source: ETHUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T22:00:07.000Z",
    "title": "PancakeSwap V3 Takes The Stage On Ethereum’s Layer 2 Linea Mainnet",
    "url": "https://www.newsbtc.com/analysis/cake/pancakeswap-v3-takes-the-stage-on-ethereums-layer-2-linea-mainnet/",
    "description": "PancakeSwap, a leading decentralized finance (DeFi) platform, has officially launched its anticipated Version 3 (V3) on the Linea Mainnet.  According to the announcement, the collaboration between PancakeSwap and Linea aims to provide a seamless trading experience with lower fees, increased liquidity provider returns, and enhanced capital efficiency. Related Reading: Here’s Why Arthur Hayes Is Not In Support Of A BlackRock Spot Bitcoin ETF PancakeSwap V3 On Linea Linea, formerly known as ConsenSys zkEVM, stands as Layer 2 scaling solution powered by ConsenSys. Linea achieves faster transaction speeds and reduced gas costs while ensuring security by utilizing zero-knowledge proofs and maintaining full Ethereum Virtual Machine (EVM) equivalence. Developers can seamlessly create or migrate Ethereum apps without code modification or smart contract rewriting. With native integrations of popular tools like MetaMask and Truffle, Linea empowers developers with flexibility and scalability on the zkEVM. The collaboration has provided PancakeSwap users with insights into Layer 2 scaling solutions and the Linea platform, contributing to the development and adoption of decentralized financial solutions. Per the announcement, PancakeSwap v3 on Linea introduces two key features: advanced Swap and Liquidity Provision functionalities. These features enable users to trade tokens and participate in liquidity provision directly on the platform.  The core principle of PancakeSwap v3 is maximizing capital efficiency, allowing liquidity providers to concentrate their capital within specific price ranges where most trading occurs.  By optimizing asset utilization, liquidity providers can enhance their earnings. PancakeSwap v3 enables liquidity providers to achieve a capital multiplier of up to 4000x compared to its predecessor, v2, thus maximizing returns. Related Reading: Algorand Stuck At Bearish Price Level – Can Bulls Reverse Path? While the provision of Linea incentives to PancakeSwap has not been communicated at this point, if they are provided, PancakeSwap intends to share them with various stakeholders, including the CAKE community, CAKE stakers, projects contributing to PancakeSwap&#8217;s development, and ecosystem contributors. The protocol’s “Chefs” concluded the announcement by stating:  We anticipate the exciting opportunities ahead as PancakeSwap v3 takes its momentous leap onto Linea. We are thrilled to work hand in hand with other projects, developers, builders, and our vibrant community as we continue to push the boundaries of Multichain DeFi. Together, we can foster innovation, drive adoption, and shape the future of decentralized finance. We invite you all to join us on this remarkable journey as we unlock new realms of possibility and create a thriving ecosystem that benefits everyone involved. Currently priced at $1.28, PancakeSwap&#8217;s token (CAKE) has experienced a slight downward movement in the past 24 hours, with a decrease of 0.02%.  Over 7 days, it has seen a decline of 7.89%, and over 30 days, a decrease of 13.85%. Looking at a longer timeframe, PancakeSwap has encountered significant volatility, with a decline of 68.79% over the past 180 days. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T21:00:37.000Z",
    "title": "Why Nvidia’s 20% Rise Ignited Rally In Crypto AI Tokens",
    "url": "https://www.newsbtc.com/news/why-nvidias-20-rise-ignited-rally-in-crypto-ai-tokens/",
    "description": "Crypto tokens with Artificial Intelligence (AI) applications have outperformed other assets as chipmaker Nvidia reached an all-time high. The legacy company&#8217;s stock price saw important gains as its bet on the AI sector paid off. Related Reading: SOL Tallies 5% Gains In One Day After Shopify Integrates Solana Pay As of this writing, crypto market tracker Coingecko data records double-digit gains for AI-based cryptocurrencies. Render (RNDR) and Akash Network performed best in the last 24 hours and the previous week, respectively, with the former recording a 6% profit and a 10% gain. Nvidia Fuels AI Crypto Rally, But It’s the Trend Sustainable? According to a report from Sarson Funds, the correlation between crypto AI tokens and Nvidia is “strong.” The chipmaker has spearheaded the AI trend in the legacy financial sector and sparked interest in this technology. As a result, and under current market conditions, AI crypto tokens are moving with Nvidia&#8217;s (NVDA) stock price. Sarson Funds stated the following regarding NVDA’s rally and its impact on the crypto sector: AI-powered cryptocurrencies are reacting positively to Nvidia&#8217;s stellar Q2 earnings! The connection between #crypto and AI is stronger than ever as Nvidia ($NVDA) exceeds estimates with $13.51B in sales and $2.70 EPS, outperforming predictions. Notably, Render Network +8%, Singularity NET +9.9%, &#38; Fetch +8.7% upon the announcement. In that sense, the fate of crypto tokens is highly linked to NVDA’s future performance. The stock’s gains were tied to better-than-expected results in its quarterly report and are likely to continue in the coming months. According to the company’s recent report, AI chip sales will only accelerate, boosting Nvidia’s revenue and potentially spilling into the crypto sector. In addition, other tech giants are jumping on the AI fever, reinforcing the thesis that the new technology will unlock further gains. Nvidia’s CFO Colette Kress told investors this regarding their expectations for the coming months: There is tremendous demand for Nvidia accelerated computing and AI platforms. Our supply partners have been exceptional in ramping capacity to support our needs. We expect supply to increase each quarter through next year. By geography, data center growth was strongest in the U.S. as customers direct their capital investments to AI and accelerated computing. In the meantime, crypto traders might use NVDA’s as a proxy for AI crypto tokens performance. If the forecasts are accurate, NVDA will likely double its current stock price by the end of the year; how will crypto AI tokens stand by then? Related Reading: Here’s Why This Crypto Expert Believes Ethereum Is The ‘Biggest Block’ Against Bitcoin Adoption Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T07:56:38.000Z",
    "title": "Top 3 High-Growth Altcoins with 10x Potential Immune to SEC’s Crackdown",
    "url": "https://www.crypto-news-flash.com/top-3-high-growth-altcoins-with-10x-potential-immune-to-secs-crackdown/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-127.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-127.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-127-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-127-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-127-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-127-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The top altcoins for 2023 are here. Each one brings unique features and innovative solutions. InQubeta (QUBE) offers fractional investment in AI startups and DigiToads (TOADS) provides a platform for gamers and trending NFTs enthusiasts. Borroe ($ROE) allows businesses and creators to convert potential earnings, such as royalties or subscriptions, into tradable NFTs. These new [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T07:32:22.000Z",
    "title": "Ripple (XRP) Aims to Drive Trillions in Global Asset Tokenization via Extensive Partnerships and Cutting-Edge Tech – Is a $20 Price Attainable? Exclusive Report",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-aims-to-drive-trillions-in-global-asset-tokenization-via-extensive-partnerships-and-cutting-edge-tech-is-a-20-price-attainable-exclusive-report/",
    "description": "<img width=\"2344\" height=\"1154\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42.png 2344w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42-300x148.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42-1024x504.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42-768x378.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42-1536x756.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-25-at-09.28.42-2048x1008.png 2048w\" sizes=\"(max-width: 2344px) 100vw, 2344px\" />Real-world asset tokenization is expected to shape a $16 trillion industry by 2030, offering unprecedented liquidity and market accessibility. A staggering 80% of respondents in Ripple’s 2023 New Value report believe tokenization will drastically impact trading of assets, real estate, and carbon markets. In a groundbreaking revelation by Team Ripple in conjunction with their &#8220;Tokenization [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T07:02:41.000Z",
    "title": "Which Crypto Has the Best Price Potential for 2023: Cardano or Pomerdoge",
    "url": "https://www.crypto-news-flash.com/which-crypto-has-the-best-price-potential-for-2023-cardano-or-pomerdoge/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-126.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-126.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-126-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-126-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />One of the most attractive attributes of the cryptocurrency market is its potential to yield great returns. In this article, we will compare the price potential of two prominent cryptocurrencies for 2023: Cardano (ADA) and Pomerdoge (POMD). By examining their unique qualities and market trends, we aim to determine which one may offer the best [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T06:46:19.000Z",
    "title": "Ripple (XRP) Partner Nium Teams Up With OZ Câmbio (Brazil) To Help Move Money to China, Hong Kong, U.S. and Beyond",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-partner-nium-teams-up-with-oz-cambio-brazil-to-help-move-money-to-china-hong-kong-u-s-and-beyond/",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Nium partners with OZ Câmbio to enable instant payments for Brazilian businesses to global markets.  This collaboration supports SMEs and enhances transparency and compliance.  Nium, a worldwide payment solutions provider, has joined forces with OZ Câmbio to introduce an instant payment system aimed at helping Brazilian enterprises send money to key international markets. Using Nium&#8217;s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T05:09:33.000Z",
    "title": "Web3 Revolution Unleashed: Ethereum’s Scaling Symphony and Chainlink’s Oracle Power Unite",
    "url": "https://www.crypto-news-flash.com/web3-revolution-unleashed-ethereums-scaling-symphony-and-chainlinks-oracle-power-unite/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink celebrates the first anniversary of Chainlink Economics 2.0.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Chainlink, a key player, supports Ethereum&#8217;s vision by providing secure external data and off-chain computation. The collaboration advances Ethereum&#8217;s goal of scaling, enabling more apps and a sustainable Web3 future. Heralded as a transformative force, blockchain technology is reshaping how societies exchange value. While decentralized and trust-minimized, the technology grapples with throughput limitations. Ethereum, a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T07:23:06.000Z",
    "title": "Shimza, Enzo Siffredi to Headline AFTER 2049, the Largest Formula One Grand Prix Pre-Weekend Party",
    "url": "https://coinedition.com/shimza-enzo-siffredi-to-headline-after-2049-the-largest-formula-one-grand-prix-pre-weekend-party/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shimza_Enzo_Siffredi_to_Headline_AFTER_2049_the_Largest_Formula-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>TOKEN2049, Asia’s premier Web3 and crypto conference, announced an international DJ line-up for AFTER 2049, the official closing event of its upcoming Singapore edition. Headlined by award-winning DJ and producer Shimza, house icon Enzo Siffredi and Hong Kong’s Leon, Milam and Mo-Shi, AFTER 2049 takes place on Friday, 15 September as the largest Formula 1 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shimza-enzo-siffredi-to-headline-after-2049-the-largest-formula-one-grand-prix-pre-weekend-party/\">Shimza, Enzo Siffredi to Headline AFTER 2049, the Largest Formula One Grand Prix Pre-Weekend Party</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T00:50:00.000Z",
    "title": "Australia’s Central Bank Unveils ETH-Based CBDC Pilot Program",
    "url": "https://coinedition.com/australias-central-bank-unveils-eth-based-cbdc-pilot-program/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/CBDC-61.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/CBDC-61.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/CBDC-61-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Australian Central Bank recently announced a central bank digital currency (CBDC) pilot program based on the Ethereum blockchain. The new CBDC being tested by the Reserve Bank of Australia boasts features like direct control, programmability, atomic settlement, etc. The central bank collaborated with the Digital Finance Cooperative Research Centre (DFCRC) on the blockchain research [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/australias-central-bank-unveils-eth-based-cbdc-pilot-program/\">Australia’s Central Bank Unveils ETH-Based CBDC Pilot Program</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T00:02:00.000Z",
    "title": "OpenSea Ranks First in the Top 10 NFT Marketplaces by Number of Traders",
    "url": "https://coinedition.com/opensea-ranks-first-in-the-top-10-nft-marketplaces-by-number-of-traders/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/OpenSea_Implements_New_Anti_Theft_Policy_to_Combat_NFT_Thievery-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto Rank, a crypto market insights and analytics platform, shared on August 24 the top 10 NFT marketplaces based on 30 days of active traders. On top of the list stands OpenSea, with a high number of 229,000 30-day traders, followed by Axie Marketplace and Blur. OpenSea is considered one of the largest NFT marketplaces. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/opensea-ranks-first-in-the-top-10-nft-marketplaces-by-number-of-traders/\">OpenSea Ranks First in the Top 10 NFT Marketplaces by Number of Traders</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T23:23:00.000Z",
    "title": "Can Republican Presidential Candidate Vivek Ramaswamy Save Crypto?",
    "url": "https://coinedition.com/can-republican-presidential-candidate-vivek-ramaswamy-save-crypto/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Kraken CLO and Former CFTC Chairman Set to Testify on Crypto Regulation\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Kraken-CLO-and-Former-CFTC-Chairman-Set-to-Testify-on-Crypto-Regulation-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Among the Republican candidates that have entered the U.S. presidential race, Vivek Ramaswamy is a rising contender, partly for his conservative views on family and energy policies, but mostly for his farsighted perspectives on financial innovations. For one, he’s an ardent supporter of crypto and divulged that he didn&#8217;t think BTC was a security at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/can-republican-presidential-candidate-vivek-ramaswamy-save-crypto/\">Can Republican Presidential Candidate Vivek Ramaswamy Save Crypto?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T22:30:00.000Z",
    "title": "Phishing Attack Threat Puts Bearish Pressure on LUNC Price",
    "url": "https://coinedition.com/phishing-attack-threat-puts-bearish-pressure-on-lunc-price/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Terra-Classic-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Terra (LUNA) identified a potential phishing attack on its website and advised users to take precautionary measures not to fall victim to the scam. Posting on X (Twitter), the terra_money official handle spotted a hostile entity using the terra(dot)money identity to carry out phishing attempts and asked users to avoid using the site. Following the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/phishing-attack-threat-puts-bearish-pressure-on-lunc-price/\">Phishing Attack Threat Puts Bearish Pressure on LUNC Price</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T21:30:00.000Z",
    "title": "Nothing Unveils OS 2.0 for Blockchain Phone, Launches Next Week",
    "url": "https://coinedition.com/nothing-unveils-os-2-0-for-blockchain-phone-launches-next-week/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The startup company, Nothing Phone, backed by Polygon (MATIC), is set to release its new operating system, Nothing OS 2.0. This update is for its blockchain mobile phone, Nothing Phone (1). The announcement has generated significant buzz in the tech community, as it promises to bring the latest Android 13-based features to the users of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/nothing-unveils-os-2-0-for-blockchain-phone-launches-next-week/\">Nothing Unveils OS 2.0 for Blockchain Phone, Launches Next Week</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T20:44:00.000Z",
    "title": "BTC Could Reach $32.6K if It Breaks $28.9K, Predicts Analyst",
    "url": "https://coinedition.com/btc-could-reach-32-6k-if-it-breaks-28-9k-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Has the Most Opportunity\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin-Has-the-Most-Opportunity-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Analyst Kyledoops from Crypto Banter predicted that the price of Bitcoin (BTC) could rise to $32,600 if it is able to break above $28,900 in his latest analysis. In the video, he also highlighted the 50 and 100 EMA lines on the 4-hour chart as important levels to watch in the coming few days. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-could-reach-32-6k-if-it-breaks-28-9k-predicts-analyst/\">BTC Could Reach $32.6K if It Breaks $28.9K, Predicts Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T07:04:25.000Z",
    "title": "Crypto Trader Who Caught 2023 Bitcoin Breakout Details Plan to Reaccumulate BTC – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/08/25/crypto-trader-who-caught-2023-bitcoin-breakout-details-plan-to-reaccumulate-btc-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Breakout-Details-Plan.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto trader who rode the Bitcoin (BTC) rally from the November 2022 low all the way to the 2023 high is detailing a market re-entry strategy. Pseudonymous analyst DonAlt tells 52,900 subscribers of the TechnicalRoundup YouTube channel that the potential approval or rejection of a spot Bitcoin exchange-traded fund (ETF) in the US will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/crypto-trader-who-caught-2023-bitcoin-breakout-details-plan-to-reaccumulate-btc-here-are-his-targets/\">Crypto Trader Who Caught 2023 Bitcoin Breakout Details Plan to Reaccumulate BTC – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T03:40:25.000Z",
    "title": "Exploring the Value of Bitcoin",
    "url": "https://dailyhodl.com/2023/08/24/exploring-the-value-of-bitcoin",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/McGlone-Very-Bullish-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A common argument against Bitcoin’s long-term viability is that it doesn’t have any real value. This response is reasonable when you consider that Bitcoin is a technology that is so innovative, it feels unfamiliar to most people when they first encounter it. It’s not like fiat currency, which is issued by a central bank associated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/24/exploring-the-value-of-bitcoin\">Exploring the Value of Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T00:00:04.000Z",
    "title": "Over $200,000,000 Withdrawn From Balancer (BAL) Pools After Project Announces ‘Critical Vulnerability’",
    "url": "https://dailyhodl.com/2023/08/24/over-200000000-withdrawn-from-balancer-bal-pools-after-project-announces-critical-vulnerability/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/withdrawn-bal-pool-critical.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The total value locked (TVL) on Balancer (BAL) dropped by more than $200 million over a period of 24 hours after the decentralized finance (DeFi) protocol advised users to withdraw liquidity as a precautionary measure. In a post on social media platform X, the Balancer team says it discovered a critical vulnerability in a number [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/24/over-200000000-withdrawn-from-balancer-bal-pools-after-project-announces-critical-vulnerability/\">Over $200,000,000 Withdrawn From Balancer (BAL) Pools After Project Announces ‘Critical Vulnerability’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-24T22:01:54.000Z",
    "title": "Defense Lawyers for Former FTX CEO Sam Bankman-Fried Granted Unlimited Prison Visitation",
    "url": "https://dailyhodl.com/2023/08/24/defense-lawyers-for-former-ftx-ceo-sam-bankman-fried-granted-unlimited-prison-visitation/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/ftx-debacle-top-level.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The defense attorneys for disgraced former FTX chief executive Sam Bankman-Fried are being granted unlimited access to their client in prison. In a recent filing, Judge Lewis A. Kaplan says he is granting Bankman-Fried’s lawyers limitless access to meet with him while he’s in jail awaiting his trial in October as long as a 48-hour [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/24/defense-lawyers-for-former-ftx-ceo-sam-bankman-fried-granted-unlimited-prison-visitation/\">Defense Lawyers for Former FTX CEO Sam Bankman-Fried Granted Unlimited Prison Visitation</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]