[
  {
    "source": "Crypto Daily",
    "date": "2024-03-03T16:22:10.000Z",
    "title": "Major Solana Players Pivot to ScapesMania: Decoding the Hype",
    "url": "https://cryptodaily.co.uk/2024/03/major-solana-players-pivot-to-scapesmania-decoding-the-hype",
    "description": "Solana (SOL) is on fire with its price soaring past $135! Discover how the launch of the YBX stablecoin by Marginfi and the thriving DeFi ecosystem are fueling this explosive growth. Don't miss out on why experts believe SOL could rally to $200 soon, and how the latest developments in the ecosystem are making it a hot topic in the crypto world."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-03T16:34:10.000Z",
    "title": "Nvidia and Palantir Lead the Pack as Unstoppable AI Stocks Surge Over 200%",
    "url": "https://www.cryptopolitan.com/nvidia-and-palantir-ai-stocks-surge-over-200/",
    "description": "Nvidia and Palantir Technologies, two prominent players in the investment world, have seen remarkable growth, each surging over 200% in the past year. This surge is attributed to the exponential growth of Artificial Intelligence (AI) stocks, as AI reshapes various industries from healthcare to gaming.&#160; With AI driving a technological revolution, investors keenly observe lucrative [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-03T16:30:08.000Z",
    "title": "Bitcoin Profitability Reaches 97% For The First Time In Over 2 Years",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-profitability-reaches-97-for-the-first-time-in-over-2-years/",
    "description": "Bitcoin has had an eventful few weeks in terms of price action. The world&#8217;s largest crypto is currently at a 19% increase in the past seven days and a 43% increase in the past 30 days, its highest percentage gain in over a year. As a result, a huge number of BTC addresses have been pushed into the profitability zone. For the first time in over two years, 97% of all Bitcoin addresses are now in profit. Related Reading: Shiba Inu Just Ballooned To 124% – What’s Pushing The Price Up? Number Of Bitcoin Addresses In Profit Skyrockets As Prices Surge According to crypto on-chain analytics platform IntoTheBlock, 50.62 million Bitcoin addresses are currently in profit at the current price level. This huge figure represents over 97% of the total wallet addresses. Notably, the last time holders saw this much profitability was in November 2021 when the price of Bitcoin was around $69,000, nearing its all-time high. Notably, market playout has seen Bitcoin continue its massive gains over the past few months. Just last month, 91% of addresses were in profit. Despite some sporadic sell-offs and profit-taking from some investors attempting to break even, the percentage of addresses in profit continues to grow as the huge profitability means selling pressure no longer has a significant effect. &#160; How Long Can Bitcoin Sustain This Upward Momentum? Bitcoin prices have skyrocketed over the past several months, recently topping $60,000 again. The top crypto is currently trading at $62,233 at the time of this writing, and 1.28 million addresses, which account for 2.46% of the total addresses, are at a break-even point.  Bitcoin is now trading at $62,233. Chart: TradingView.com The price surge can be attributed to increased mainstream adoption in the traditional investing world spearheaded by Spot Bitcoin ETFs. This in turn has ushered in a new wave of holding mentality. In February, 69,244 BTC worth over $3.6 billion were withdrawn from crypto exchanges. Notably, those who have profited the most are those who have been holding Bitcoin long-term. According to IntoTheBlock, 13.6 million Bitcoins are in the possession of investors who have held onto their assets for over a year. However, new investors can still look forward to a continued price surge, as Bitcoin faces virtually little to no resistance in its path. Only 0.37% of addresses (193,000) are still waiting to make a profit at the current price.  Related Reading: Solana Meme Coin Dogwifhat (WIF) Hits New ATH, Market Cap Breaks $1.6 Billion Most experts remain optimistic about Bitcoin’s price potential for the rest of 2024 and beyond. With the bull run in full swing, many traders and crypto analysts think Bitcoin will continue setting new all-time highs in 2024. Price targets for the end of the year range from $100,000 up to $300,000 per Bitcoin.  Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-03T16:09:46.000Z",
    "title": "Bank of America Report: Investors Favor Tech Stocks and Crypto with Significant Cash Inflows",
    "url": "https://www.crypto-news-flash.com/bank-of-america-report-investors-favor-tech-stocks-and-crypto-with-significant-cash-inflows/?utm_source=rss&utm_medium=rss&utm_campaign=bank-of-america-report-investors-favor-tech-stocks-and-crypto-with-significant-cash-inflows",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t.png 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t-1200x686.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t-768x439.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t-1536x878.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-10-12.54.11-An-image-illustrating-the-optimistic-market-sentiment-in-the-cryptocurrency-sector-with-a-focus-on-a-Bitcoin-ETF.-The-image-should-feature-a-bullish-t-450x257.png 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />BofA report shows that crypto inflows surged to $2.4 billion this week, doubling from the previous week, fueled by increased interest in Bitcoin ETFs. Genesis obtained approval to sell 35 million GBTC shares worth $1.3 billion, which, along with substantial trading volumes on March 1. On Friday, March 1, Bank of America Global Research published [...]"
  }
]