[
  {
    "source": "CoinDesk",
    "date": "2023-10-03T16:19:13.000Z",
    "title": "Sam Bankman-Fried Sues His Insurer as Legal Bills Mount",
    "url": "https://www.coindesk.com/policy/2023/10/03/sam-bankman-fried-sues-his-insurer-as-legal-bills-mount/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The FTX founder is protesting CNA’s insurance policy as his legal woes cost him serious money."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-03T16:15:57.000Z",
    "title": "Protocol Village: Nomic's 'nBTC Interchain Upgrade' Brings Bitcoin Into Cosmos Ecosystem",
    "url": "https://www.coindesk.com/tech/2023/10/02/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 2-8, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-03T16:27:36.000Z",
    "title": "Your Kids Are Going to Work Three Days a Week Thanks to AI, Says Jamie Dimon",
    "url": "https://decrypt.co/199913/your-kids-are-going-work-three-days-week-thanks-ai-says-jamie-dimon",
    "description": "It might just be a virtual assistant, or artificial intelligence could also “replace humans,” said JP Morgan’s Jamie Dimon."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T16:15:00.000Z",
    "title": "As trial begins, Sam Bankman-Fried's lawyers push to exclude testimony from FTX users",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-exclude-testimony-ftx-customers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8081a93f-9641-4e75-a6ea-83bfca23000d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried's legal team has requested the court block certain witnesses offering testimony on how they thought FTX would protect their assets.</p>\n                    <p><p>The criminal trial of former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF) is currently underway in New York, and his legal team has filed motions aiming to ban testimony from users and investors in the exchange.</p><p>In separate Oct. 2 filings in United States District Court for the Southern District of New York, SBF’s lawyers <a href=\"https://www.courtlistener.com/docket/66631291/309/united-states-v-bankman-fried/\" target=\"_blank\" rel=\"noopener nofollow\">opposed</a> pre-trial motions from prosecutors requesting FTX customers and investors testify regarding how they believed the cryptocurrency exchange would handle assets. They also sought to block the testimony of a former FTX user — an unnamed Ukrainian national — using a “live two-way video” partly on Sixth Amendment grounds.</p><p>“Decisions on specific testimony from specific witnesses relating to their individual understanding of specific statements or aspects of their relationship with FTX or Mr. Bankman-Fried cannot be decided in the abstract,” said the filing on FTX user testimony.</p><p>According to SBF’s legal team, prosecutors were trying to “have it both ways” by <a href=\"https://cointelegraph.com/news/doj-bars-sbf-s-expert-witnesses\">blocking similar witnesses</a> proposed by the defense as to what they understood about how FTX would handle their funds. Defense lawyers described the motion as \"premature\", arguing the subject was a matter for the jury to evaluate.</p><blockquote>“[T]he Government seemingly wants evidence regarding how customers (and other putative victims) understood the relationship they chose to enter with FTX to be admissible only if offered by the Government but excluded if offered by the defense.”</blockquote><p>Lawyers also argued <a href=\"https://www.courtlistener.com/docket/66631291/308/united-states-v-bankman-fried/\" target=\"_blank\" rel=\"noopener nofollow\">allowing</a> the Ukrainian witness’ testimony “would apparently reference hardships and individual circumstances created by the Russian invasion of Ukraine” and “elicit the jury’s sympathy and outrage”. The Russian military invaded Ukraine in February 2022 and many areas of the country have faced the constant threat of attack since that time, making international travel difficult. </p><p>“Courts routinely exclude relevant evidence that might elicit sympathy among jurors unrelated to the facts of the case,” said the lawyers. “[T]he circumstances under which [the Ukrainian user] would testify and the reason for his absence from the courtroom would themselves be prejudicial [...] Jurors would inevitably speculate about why a Ukrainian national (and no other witness) is testifying by video, and the most obvious answers would almost certainly provoke ‘sympathies having no bearing on the merits of the case.’”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/doj-readies-witnesses-in-bankman-fried-trial-spotlight-on-ftx-assets\"><strong><em>DOJ readies witnesses in Bankman-Fried trial, highlights FTX asset management</em></strong></a></p><p>The motions were filed hours before jury selection for Bankman-Fried’s criminal trial was scheduled to begin in New York City. At the time of publication, Judge Lewis Kaplan was questioning potential jurors on any conflicts they may have which prevent them from serving in the trial, <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-criminal-trial-schedule\">expected to last</a> through November. </p><p>Since Kaplan revoked Bankman-Fried's bail in August, the former FTX CEO has been largely confined to jail despite <a href=\"https://cointelegraph.com/news/judges-weigh-early-release-sam-bankman-fried-lawyers-push-first-amendment\">several unsuccessful attempts</a> by his lawyers for temporary release. He will face two criminal trials in October 2023 and March 2024, for which he has pleaded not guilty to all 12 criminal charges related to alleged fraud at FTX and Alameda Research.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T16:34:28.000Z",
    "title": "IMF Unveils C-RAM: A New Approach to Assess Crypto Risks",
    "url": "https://www.cryptopolitan.com/imf-unveils-c-ram-to-assess-crypto-risks/",
    "description": "The International Monetary Fund (IMF) has unveiled a pioneering three-step approach called the Crypto-Risk Assessment Matrix (C-RAM) to comprehensively evaluate the macro-financial risks associated with cryptocurrencies within individual countries. This innovative initiative comes at a time when the global financial landscape is rapidly evolving due to the proliferation of digital currencies and their potential impact ... <a title=\"IMF Unveils C-RAM: A New Approach to Assess Crypto Risks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/imf-unveils-c-ram-to-assess-crypto-risks/\" aria-label=\"More on IMF Unveils C-RAM: A New Approach to Assess Crypto Risks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T16:16:41.000Z",
    "title": "Halving 2024: Market Boom and Unique Opportunity to Double Your Portfolio with Cannafarm Ltd",
    "url": "https://www.cryptopolitan.com/halving-2024-market-boom-and-unique-opportunity-to-double-your-portfolio-with-cannafarm-ltd/",
    "description": "Bitcoin is a technically complex ecosystem that self-manages according to predefined algorithms. Its anonymous creator embedded several principles and rules to maintain the network&#8217;s functionality without external interference, simultaneously increasing the value of the cryptocurrency. One of these principles is halving, which significantly impacts the market situation. What is Halving? One of the important algorithms ... <a title=\"Halving 2024: Market Boom and Unique Opportunity to Double Your Portfolio with Cannafarm Ltd\" class=\"read-more\" href=\"https://www.cryptopolitan.com/halving-2024-market-boom-and-unique-opportunity-to-double-your-portfolio-with-cannafarm-ltd/\" aria-label=\"More on Halving 2024: Market Boom and Unique Opportunity to Double Your Portfolio with Cannafarm Ltd\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T16:14:57.000Z",
    "title": "Chainalysis to Lay Off 150 Employees Amid Crypto Winter",
    "url": "https://www.cryptopolitan.com/chainalysis-to-lay-off-150-employees/",
    "description": "Cryptocurrency analytics firm, Chainalysis, is set to lay off approximately 150 employees, constituting more than 15% of its workforce of 900, as the company pivots away from the commercial sector to focus on government contracts. This strategic shift comes as the cryptocurrency market experiences a prolonged downturn, resulting in reduced demand for Chainalysis products. This ... <a title=\"Chainalysis to Lay Off 150 Employees Amid Crypto Winter\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainalysis-to-lay-off-150-employees/\" aria-label=\"More on Chainalysis to Lay Off 150 Employees Amid Crypto Winter\">Read more</a>"
  }
]