[
  {
    "source": "Cointelegraph",
    "date": "2023-12-01T05:02:59.000Z",
    "title": " United Nations agency to upskill thousands of staff in blockchain tech ",
    "url": "https://cointelegraph.com/news/united-nations-agency-undp-blockchain-academy-algorand",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOTU4ZWFlMGQtY2YxZS00YmQ5LWIzNjEtOGY0NDA4Nzc3NTZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The United Nations Development Programme (UNDP), which is tasked with eliminating poverty in over 170 countries, wants to educate its 22,000 staff on distributed ledger technology. </p>\n                    <p><p>A United Nations agency tasked with helping countries eliminate poverty is set to upskill its 22,000 staff in blockchain technology, with the ultimate goal of helping countries achieve “sustainable development” growth. </p><p>According to a Nov. 30 statement, the United Nations Development Programme (UNDP) has <a href=\"https://www.prnewswire.com/news-releases/united-nations-development-programme-partners-with-algorand-to-launch-a-blockchain-academy-302001081.html\" target=\"_blank\" rel=\"noopener nofollow\">partnered</a> with the Algorand Foundation to launch a blockchain academy in 2024. </p><p>The academy will serve the UNDP's 22,000 staff members across 170 countries, educating them about distributed ledger technology and blockchain, including how it could be used for financial inclusion, supply chain transparency, real-world asset tokenization, and digital identity applications.</p><p>During the Algorand Impact Summit in New Delhi, UNDP’s expert for alternative finance and low carbon development, Robert Pasicko, told the audience the partnership will enable the organization to “upskill, empower, and inspire UN practitioners around the world.”</p><p>The curriculum will include lectures, workshops, and hands-on assignments and will be “instrumental in equipping our team with the tools needed to address complex global challenges using blockchain technology,” said Pasicko.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Breaking news from <a href=\"https://twitter.com/hashtag/AlgoImpactSummit?src=hash&amp;ref_src=twsrc%5Etfw\">#AlgoImpactSummit</a>  <br><br>The <a href=\"https://twitter.com/UNDP?ref_src=twsrc%5Etfw\">@UNDP</a> partners with the Algorand Foundation to launch the Algorand Blockchain Academy.<br><br>The academy will be made available to over 22,000 United Nations staff in 170+ countries.<br><br> <a href=\"https://t.co/wfWBaFOW0E\">https://t.co/wfWBaFOW0E</a><br><br> <a href=\"https://t.co/lCqNEQonrV\">pic.twitter.com/lCqNEQonrV</a></p>&mdash; Algorand Foundation (@AlgoFoundation) <a href=\"https://twitter.com/AlgoFoundation/status/1730307579656675677?ref_src=twsrc%5Etfw\">November 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>Head of education and inclusion at the Algorand Foundation, Doro Unger-Lee, added that education was a “critical first step toward identifying and delivering actionable, on-the-ground use cases of blockchain to help achieve the Sustainable Development Goals in a number of areas.”</p><p><a href=\"https://cointelegraph.com/news/united-nations-agency-undp-blockchain-academy-algorand\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-01T04:58:40.000Z",
    "title": "DOT Price (Polkadot) Spikes 5% and Primed To Surge Toward $6",
    "url": "https://www.newsbtc.com/analysis/dot/dot-price-polkadot-spikes-primed-6/",
    "description": "Polkadot (DOT) is gaining pace above the $5.25 resistance against the US Dollar. The price could surge further toward the $5.85 and $6.00 levels. DOT is gaining pace above the $5.25 resistance zone against the US Dollar. The price is trading above the $5.30 zone and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $5.55 on the 4-hour chart of the DOT/USD pair (data source from Kraken). The pair could gain bullish momentum if there is a close above $5.55 and $5.60. Polkadot Price Regains Strength After consolidating above the $5.00 support, DOT price started a decent increase. The price was able to clear the $5.20 and $5.25 resistance levels to move into a positive zone, like Bitcoin and Ethereum. Polkadot cleared the 100 simple moving average (4 hours) and tested the $5.60 resistance. A high is formed near $5.58 and the price is now consolidating gains. It is up nearly 5% and shows signs of more gains in the coming sessions. DOT price is now trading above the $5.30 zone and the 100 simple moving average (4 hours). Immediate resistance is near the $5.55 level. There is also a key bearish trend line forming with resistance near $5.55 on the 4-hour chart of the DOT/USD pair. Source: DOTUSD on TradingView.com The next major resistance is near $5.60. A successful break above $5.60 could start another strong rally. In the stated case, the price could easily rally toward $5.85 in the near term. The next major resistance is seen near the $6.00 zone. Are Dips Supported in DOT? If DOT price fails to continue higher above $5.55 or $5.60, it could start a downside correction. The first key support is near the $5.35 level. The next major support is near the $5.30 level or the 61.8% Fib retracement level of the upward move from the $5.11 swing low to the $5.58 high, below which the price might decline to $5.10. Any more losses may perhaps open the doors for a move toward the $5.00 support zone. Technical Indicators 4-Hours MACD – The MACD for DOT/USD is now gaining momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for DOT/USD is now above the 50 level. Major Support Levels – $5.30, $5.10 and $5.00. Major Resistance Levels – $5.55, $5.60, and $6.00."
  }
]