[
  {
    "source": "Decrypt",
    "date": "2024-01-25T12:08:04.000Z",
    "title": "Judge Blocks CZ Travel to UAE, Despite Offer to Use $4.5B Binance Equity as Security",
    "url": "https://decrypt.co/214169/judge-blocks-cz-travel-to-uae-despite-offer-to-use-4-5b-binance-equity-as-security",
    "description": "The Binance founder had requested to travel to the UAE to be present for the “hospitalization and surgery” of an unnamed individual."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-25T12:01:02.000Z",
    "title": "All the Donald Trump, Joe Biden and U.S. Election-Themed Crypto Projects",
    "url": "https://decrypt.co/214170/biggest-donald-trump-joe-biden-us-election-crypto-projects",
    "description": "From meme coins to NFTs, here are all the biggest and zaniest crypto projects tied to U.S. elections."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T11:45:49.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Asset management firm Bitwise received numerous Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) donations and inscriptions soon after making its wallet address public. Grayscale Bitcoin Trust recorded $429 million in outflows on Jan. 24, the lowest amount since launch day on Jan. 11. Meanwhile, the United States Securities and Exchange Commission has pursued a large amount of crypto enforcement action under Chair Gary Gensler, according to a recent report.</p><p>Soon after asset management firm Bitwise made the Bitcoin address of its spot BTC exchange-traded fund (ETF) public on Jan. 24, investors and well-wishers started sending tips and donations to the address. </p><p data-ct-non-breakable=\"true\">“Chair Gensler has noted that ‘enforcement is a tool, not the destination,’ and the number of SEC enforcement actions brought in the crypto space has ramped up over the last two years,” said Cornerstone’s Simona Mola.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-25T11:59:16.000Z",
    "title": "Over $5.8 billion in Bitcoin and Ethereum options set to expire, market volatility anticipated",
    "url": "https://cryptoslate.com/insights/over-5-8-billion-in-bitcoin-and-ethereum-options-set-to-expire-market-volatility-anticipated/",
    "description": "<p>Quick Take Tomorrow, Jan. 26, is the expiration of a staggering $5.82 billion worth of Bitcoin and Ethereum options, a potentially influential event for both Bitcoin (BTC) and Ethereum (ETH) markets. The options, divided into $3.75 billion for BTC and $2.08 billion for ETH, depict an interesting dynamic for both leading digital assets. For BTC, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/over-5-8-billion-in-bitcoin-and-ethereum-options-set-to-expire-market-volatility-anticipated/\">Over $5.8 billion in Bitcoin and Ethereum options set to expire, market volatility anticipated</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-25T11:49:51.000Z",
    "title": "Lido DAO chooses Wormhole and Axelar to bridge wstETH on BNB",
    "url": "https://cryptobriefing.com/lido-dao-chooses-wormhole-axelar-bridge-wsteth-on-bnb/?utm_source=feed&utm_medium=rss",
    "description": "The rival proposal received over81% of votesin a recent poll, whereas LayerZero's proposal garnered just 5% support."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-25T12:00:39.000Z",
    "title": "LABEL Foundation’s Tracks Launches Web3 Music dApp on LG Smart TVs",
    "url": "https://news.bitcoin.com/label-foundations-tracks-launches-web3-music-dapp-on-lg-smart-tvs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/img_9261.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Tracks, the innovative Web3 music streaming dApp created by LABEL Foundation and built on the BNB Chain, is now available on LG Smart TVs running webOS 22 and webOs 23, globally. This pioneering launch introduces the first-ever Web3 music app on an LG smart TV platform, transforming how users engage with music streaming. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T11:54:02.000Z",
    "title": "Uncover Hidden Secrets in Baldur’s Gate 3: Speak With Dead on Corpse Beds",
    "url": "https://www.cryptopolitan.com/uncover-hidden-secrets-in-baldurs-gate-3/",
    "description": "Baldur&#8217;s Gate 3, the highly acclaimed role-playing video game by Larian Studios, is known for its intricate world and myriad of possibilities. In the second act of the game, players have the opportunity to explore the Gauntlet of Shar and come across a rather peculiar scene involving a hulking infernal named Orthon Yurgir.&#160; A surprising [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T11:50:38.000Z",
    "title": "Pokémon Company Initiates Investigation into Palworld Over Alleged Plagiarism",
    "url": "https://www.cryptopolitan.com/pokemon-investigation-palworld-plagiarism/",
    "description": "In a surprising turn of events, The Pokémon Company has announced its decision to investigate Palworld, a recently released survival title, following accusations of plagiarism. Despite initial assumptions that Pokémon would overlook competitors, the company has now taken a firm stance on protecting its intellectual property. The Pokémon Company, through a statement on its corporate [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T11:49:37.000Z",
    "title": "Google Chrome Enhances Web Browsing Experience with AI-Powered Features",
    "url": "https://www.cryptopolitan.com/browsing-experience-with-ai-powered-features/",
    "description": "To revolutionize the web browsing experience, Google is set to introduce a range of AI-powered features to its popular web browser, Google Chrome, in its upcoming release next month.&#160; These innovative additions aim to boost users&#8217; confidence in writing online content and streamline web navigation, making Chrome a more user-friendly and efficient tool for its [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-25T12:00:24.000Z",
    "title": "RippleX Announces Major Update For XRP Ledger EVM Sidechain, Can This Trigger A Price Recovery",
    "url": "https://www.newsbtc.com/analysis/xrp/ripplex-xrp-ledger-evm-sidechain/",
    "description": "The XRP Ledger ecosystem is currently buzzing with new exciting developments that could potentially propel the price of XRP to new heights. RippleX, an extension of Ripple and an open developer platform has announced new updates for the upcoming XRP Ledger Ethereum Virtual Machine (EVM) sidechain.  XRPL EVM Sidechain Signals Hope For XRP Price Resurgence On Tuesday, RippleX released the latest developments and progress on the XRPL EVM Sidechain via an X (formerly Twitter) post. This significant update was shared by Peersyst Technology, a blockchain technology firm and an XRPL EVM developer.  Peersyst revealed on its official X handle that the XRPL ecosystem is getting closer to launching its highly anticipated sidechain. This advanced EVM sidechain is designed to bridge Web3 applications to XRPL and improve the functionality and scalability capabilities of the ledger.  Related Reading: Analysts Reveal Next Steps As Solana Corrects Hard After 1000% Rally Various XRP enthusiasts, including Patrick L. Riley, the Chief Executive Officer (CEO) of Reaper Financial, remain optimistic about the launch and integration of the EVM sidechain into the XRP Ledger. In a December 2023 interview with crypto market analyst Zach Rector, Riley predicted that “XRP will surpass Bitcoin as the number one cryptocurrency.”  According to Peersyst, the RippleX developer team has officially published the XChainBridge public amendment. This revision is currently open for voting and has already garnered seven validator votes out of 28, marking a crucial step in the launch of the XRPL EVM sidechain.  The blockchain company also announced a second update on the XRPL EVM, stating that the sidechain has successfully undergone stringent audit procedures by Bishop Fox, a leading provider of security solutions. Another audit has also been conducted with a prominent supplier, with details disclosed soon.  In addition, the blockchain firm has shared updates on the EVM sidechain’s progress to Cosmos, a blockchain network utilizing the support of Evmos, a scalable high throughput Proof of Stake (PoS) blockchain. Peersyst disclosed that a new version of the bridge is set to launch, allowing users to automatically connect any existing token in the EVM sidechain to the XRP Ledger.  Other updates on the EVM sidechain include the introduction of a new User Interface (UI) and the implementation of a Software Development Kit (SDK) for developers. Additionally, a better version of the Blockscout explorer is being developed, promising quicker inspections and explorations of transactions within the XRPL EVM blockchain.  XRP sees small rise to $0.51 &#124; Source: XRPUSD on Tradingview.com Can This Trigger A Price Recovery? The XRPL EVM emerges as a potential game changer for the price of XRP, introducing new updates that will enhance transparency, security, and speed within the XRP Ledger. Since this is a positive development, it could lead to renewed interest in the underlying XRP token. Related Reading: Bitcoin Repayments: Mt Gox Starts Verifying Addresses For 200,000 BTC In Payouts If this interest is sustained and eventually leads to more demand for the token, it could trigger a price rally. At this point, the bulls will be looking to break the resistance, which bears have mounted at $0.55 to signal a resumption of the rally. While other altcoins have been witnessing price surges, XRP has been struggling to rally. It is currently trading at $0.51, with a 9.63% loss in the last seven days, according to data from Coinmarketcap. Featured image from Crypto News Flash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-25T12:08:46.000Z",
    "title": "Ripple’s XRP Ledger’s Game-Changing Upgrade: Turn XRP into Passive Income with AMM",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-ledgers-game-changing-upgrade-turn-xrp-into-passive-income-with-amm/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-ledgers-game-changing-upgrade-turn-xrp-into-passive-income-with-amm",
    "description": "<img width=\"1876\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-silver-coins-with-a-gray-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background.jpg 1876w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-768x491.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-1536x983.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-150x96.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-450x288.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-with-a-gray-background-1200x768.jpg 1200w\" sizes=\"(max-width: 1876px) 100vw, 1876px\" />Ripple&#8217;s XRP Ledger introduces an Automated Market Maker (AMM) amendment, enhancing its functionality and integration with the existing decentralized exchange. XRP holders can now generate passive income through the new AMM feature by providing liquidity and voting on trading fees. The recent amendment to the XRP Ledger, known as the Automated Market Maker (AMM) Amendment, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-25T12:00:43.000Z",
    "title": "Mark Yusko Predicts Delay in Spot Ethereum ETF Launch; Cardano and Borroe Finance Become Magnets for Investment Influx",
    "url": "https://www.crypto-news-flash.com/mark-yusko-predicts-delay-in-spot-ethereum-etf-launch-cardano-and-borroe-finance-become-magnets-for-investment-influx/?utm_source=rss&utm_medium=rss&utm_campaign=mark-yusko-predicts-delay-in-spot-ethereum-etf-launch-cardano-and-borroe-finance-become-magnets-for-investment-influx",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-25T093807.841.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-25T093807.841.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-25T093807.841-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-25T093807.841-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-25T093807.841-450x253.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Mark Yusko of Morgan Creek Capital throws us a curveball. He&#8217;s predicting a delay in the much-anticipated launch of a spot Ethereum ETF. But don&#8217;t let that dampen your spirits! There&#8217;s still plenty of action in the crypto world, with Cardano and Borroe Finance ($ROE) attracting investors like bees to honey. Let’s unpack this latest [...]"
  }
]