[
  {
    "source": "Decrypt",
    "date": "2023-09-29T21:46:39.000Z",
    "title": "Galaxy and Invesco Join Growing Ethereum ETF Race",
    "url": "https://decrypt.co/199379/galaxy-invesco-join-growing-ethereum-etf-race",
    "description": "Galaxy and Invesco added their names to the Ethereum spot ETF field on Friday, even as worry of a government shutdown and SEC delays loom."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T22:00:31.000Z",
    "title": "Avalanche – Proof of stake smart contracts platform",
    "url": "https://cryptoslate.com/project-reports/avalanche-proof-of-stake-smart-contracts-platform/",
    "description": "<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/project-reports/avalanche-proof-of-stake-smart-contracts-platform/\">Avalanche &#8211; Proof of stake smart contracts platform</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T21:40:16.000Z",
    "title": "Terra’s Do Kwon and Daniel Shin conspired to falsify transactions, chat logs show",
    "url": "https://cryptoslate.com/terras-do-kwon-and-daniel-shin-conspired-to-falsify-transactions-chat-logs-show/",
    "description": "<p>According to a Sept. 22 filing, the co-founders of the now-defunct Terra blockchain project are alleged to have planned to create fraudulent transactions during the project&#8217;s development. There, the Securities and Exchange Commission (SEC) noted that Terraform Labs partnered with a payments app called Chai, supposedly so that the latter app could settle transactions on-chain. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/terras-do-kwon-and-daniel-shin-conspired-to-falsify-transactions-chat-logs-show/\">Terra&#8217;s Do Kwon and Daniel Shin conspired to falsify transactions, chat logs show</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-29T22:00:27.000Z",
    "title": "Bitcoin Traders Eye Bullish Silver Lining in Looming US Government Shutdown, Says Analyst ",
    "url": "https://news.bitcoin.com/bitcoin-traders-eye-bullish-silver-lining-in-looming-us-government-shutdown-says-analyst/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Traders Eye Bullish Silver Lining in Looming US Government Shutdown, Says Analyst \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutdown.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Numerous reports foretell an imminent U.S. government shutdown, given the anticipated failure of a spending bill to secure passage by Saturday evening &#x2014; a measure meant to sustain operations till mid-November. On the cusp of this shutdown, bitcoin (BTC) has been on an ascent, catching the eye of many. Coinshares analyst Luke Nolan notes a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T22:00:00.000Z",
    "title": "Cosmos Has A Grand Plan For 2024: Will It Crush Ethereum?",
    "url": "https://www.newsbtc.com/cosmos-atom/cosmos-has-a-grand-plan-for-2024-will-it-crush-ethereum/",
    "description": "Cosmos, a blockchain where developers can create custom chains that interconnect and communicate, has revealed its roadmap for 2024. According to an X post on September 25, the roadmap centers on increasing modularity, improving the developer experience, addressing &#8220;technical debt,&#8221; and driving user adoption. With this, Cosmos developers plan to take on the more established platform, Ethereum. Related Reading: Bitcoin Eyes Turnaround: Could A New All-Time High Be On The Horizon? Analyst Predicts At the heart of Cosmos are features such as Tendermint, a consensus system that anchors blockchains such as the BNB Chain; Cosmos SDK, a software developer kit that allows coders to build fluid and custom blockchains; and the Inter-Blockchain Communication (IBC), from where all deployed custom Cosmos chains can connect and communicate, effectively driving interoperability. Cosmos Wants To Repay The Technical Debt And Make Its SDK More Modular In 2024, reading from the roadmap, Cosmos aims to solidify its position by attracting developers from competing platforms as they repay the &#8220;technical debt.&#8221; In app development, technical debt leads to extra work and can be caused by resource constraints and shifting code requirements.  Cosmos will expand its developer base to repay this debt and make the Cosmos SDK more modular. Although the team claims the SDK has been modular in theory, swapping and modifications have made practical implementation more challenging. Therefore, to tackle these challenges, the work already done on Cosmos SDK will continue into 2024. Then, the goal will be to make the kit more modular at the core. This will make it more adaptable and flexible, meeting developer requirements. Ethereum Is Still Dominant It is yet to be seen whether this will be achievable in 2024 and whether Cosmos will grow as dominant as Ethereum. Currently, Ethereum is the leading smart contract platform, based on its market cap and the total value locked (TVL) in decentralized finance (DeFi). Additionally, its ecosystem of layer-2s has been increasing, with more protocols and blockchains connecting to Ethereum to take advantage of the network&#8217;s pioneering activity. Related Reading: MATIC Price Rally Threatened As Whales Deposit Millions Of Tokens To Exchanges DeFiLlama data on September 29 shows that all the top 10 bridges are connected to Ethereum. To illustrate, Stargate&#8211;by Cosmos, is connected to Ethereum and multiple blockchains, including Avalanche and the BNB Chain.  Besides Stargate, other bridges are Ethereum Virtual Machine (EVM) compatible and predominantly connect to Ethereum layer-2s and Polygon, the sidechain. For example, the zkSync Era, Base, Arbitrum, Polygon, and the Optimism Gateway, are plugged into Ethereum. Cumulatively, these bridges move millions of dollars worth of tokens to and from Ethereum at any instance. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-29T22:01:58.000Z",
    "title": "3AC Co-Founder Zhu Su Arrested at Airport, Receives Four Month Jail Sentence for Contempt of Court: Report",
    "url": "https://dailyhodl.com/2023/09/29/3ac-co-founder-zhu-su-arrested-at-airport-receives-four-month-jail-sentence-for-contempt-of-court-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-exploit-arrested.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of the co-founders of bankrupt crypto hedge fund Three Arrows Capital (3AC) has reportedly been arrested in an airport in Singapore. According to a new report by The Business Times, 3AC co-founder Su Zhu has been apprehended at the Changi airport as he attempted to leave Singapore. Zhu has received a four-month jail sentence [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/29/3ac-co-founder-zhu-su-arrested-at-airport-receives-four-month-jail-sentence-for-contempt-of-court-report/\">3AC Co-Founder Zhu Su Arrested at Airport, Receives Four Month Jail Sentence for Contempt of Court: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]