[
  {
    "source": "CoinDesk",
    "date": "2023-09-25T14:54:08.000Z",
    "title": "Crypto Exchange HTX Lost $8M of Ether Due to a Hack, Justin Sun Says",
    "url": "https://www.coindesk.com/business/2023/09/25/crypto-exchange-htx-lost-8m-of-ether-due-to-a-hack-justin-sun-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "HTX, formerly Huobi, has been hacked with the total loss totaling 500 ether (ETH) worth around $8 million, according to HTX advisor and Tron founder Justin Sun."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-25T14:43:16.000Z",
    "title": "Digital Euro at Least 2 Years Away, ECB’s Lagarde Says",
    "url": "https://www.coindesk.com/policy/2023/09/25/digital-euro-at-least-two-years-away-ecbs-lagarde-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The central banker said she wanted to address “conspiracy theories” about government snooping"
  },
  {
    "source": "Decrypt",
    "date": "2023-09-25T14:42:40.000Z",
    "title": "Solana Friend.tech Fork Friendzy Volume Edges Towards $1M After Just One Week",
    "url": "https://decrypt.co/198603/solana-friend-tech-fork-friendzy-volume-edges-towards-1m-after-just-one-week",
    "description": "A Friend.tech clone has emerged on Solana, generating nearly half the weekly trading volume of the leading incumbent."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T14:48:39.000Z",
    "title": "Huobi Global hacked for $7.9M: Report",
    "url": "https://cointelegraph.com/news/huobi-global-crypto-exchange-hacked-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/0cabdd06-7a62-4fed-b7ff-f4a660db5016.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>HTX crypto exchange has been hacked, but it claims to know the identity of the attacker.</p>\n                    <p><p>Huobi Global’s HTX crypto exchange was hacked on Sept. 24, according to a report from blockchain analytics platform Cyvers. A total of $7.9 million of crypto has been drained in the attack.</p><p>A known Huobi hot wallet posted a message to the attacker in Chinese. According to the message, the exchange knows the identity of the attacker and has offered to let them keep 5% of the drained funds as a “white-hat bonus,” but only if the attacker returns the remaining 95%.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Red CodeYesterday, our ML-powered system detected a suspicious transaction involving <a href=\"https://twitter.com/HuobiGlobal?ref_src=twsrc%5Etfw\">@HuobiGlobal</a> and <a href=\"https://twitter.com/HTX_Global?ref_src=twsrc%5Etfw\">@HTX_Global</a>.<br>Despite our attempts to reach out, we received no response. An EOA received 5K <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>  $7.9M from <a href=\"https://twitter.com/HuobiGlobal?ref_src=twsrc%5Etfw\">@HuobiGlobal</a>&#39;s hot wallet.<br><br> This morning, we spotted… <a href=\"https://t.co/3oqHhAVi8P\">pic.twitter.com/3oqHhAVi8P</a></p>&mdash;  Cyvers Alerts  (@CyversAlerts) <a href=\"https://twitter.com/CyversAlerts/status/1706301345223897506?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Sept. 24 at 10:00 am UTC, the suspected Huobi hot wallet 0x2Abc22eb9A09EbBE7b41737CCde147F586EfeB6A sent 4,999 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth approximately $7.9 million, to an address which had no previous history. The following morning, a separate wallet belonging to Huobi <a href=\"https://etherscan.io/tx/0x87f216527e8552c94e1f2c7b6bba167712585a7fbd385781aa5d61ba0b7f863b\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> a message to the attacker in Chinese. It stated (according to a Google translation):</p><blockquote>We have confirmed your true identity. Please return funds to 0x18709E89BD403F470088aBDAcEbE86CC60dda12e. We will provide you with a 5% white hat bonus. This offer is valid for 7 days and ends on October 2, 2023. If you do not return the funds by the deadline, we will request judicial intervention.</blockquote><p>Cyvers reported the attack on Sept. 25. The wallet that sent the message is identified as a Huobi hot wallet by blockchain analytics platform Arkham Intelligence. According to Cyvers, the wallet that sent the message is listed on a Huobi support page as belonging to the exchange.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-25T15:00:50.000Z",
    "title": "Number Of Ethereum Addresses Losing Money Just Reached A New All-Time High",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-addresses-losing-money/",
    "description": "Ethereum holders have been subject to uncertainty over the last few months as bulls and bears have struggled for control. With the bears winning at a much higher rate than the bulls, Ethereum holders have found their holdings have continued to lose value. This time around, the plunge has sent the number of investors losing money to a new all-time high. Number Of Ethereum Addresses In Loss At ATH On-chain data tracker Glassnode Alerts on X (formerly Twitter) has revealed a shocking development regarding Ethereum addresses. According to the tracker, the number of addresses seeing losses on a 7-day moving average (MA) has jumped to its highest level ever. Related Reading: Ethereum Founder Vitalik Buterin Reveals The Challenges Of The Network This metric takes note of the price at which the ETH coins being held on addresses were last moved. Then it is compared to the current price of the altcoin to figure out if the addresses are seeing gains or losses. The metric had been rapidly climbing in 2023 due to the bear market, culminating in a new all-time high. According to Glassnode’s report, the total number of addresses in loss is now sitting at 49,939,211.006, rising from its previous all-time high of 49,921,736.464 that was reached on September 15. If the price of ETH continues to drop, then this figure will likely hit another all-time high soon. Number of addresses in loss hit new all-time high  Source: Glassnode Other ETH Metrics Flashing Bearish Ethereum&#8217;s open interest in perpetual futures contracts had also taken a hit with the price struggles. It dropped to a one-month low $445,789,354, just weeks after hitting a previous one-month low of $450,965,900 on September 13. Accumulation also seems to be dropping among mid-sized investors in the meantime. Glassnode also reports that the number of addresses holding at least 10 ETH had plunged to a 3-month low of 347,825. This suggests that these investors may be offloading their holdings to prevent more losses. Small investors are also not left out of this trend. Another metric that tracks the number of Ethereum addresses holding at least 0.1 ETH also showed a decline in recent months. This has led to a 5-month low for the metric, with only 5,120,950 addresses holding 0.1+ ETH. Related Reading: Bitwise Withdraws Application, A Big Blow To Ethereum ETFs? These declines come as no surprise as the ETH price had lost support above $1,600. With the bears dragging the price below $1,600, the losses for holders had climbed rapidly as the altcoin’s price fell to two-week lows. Founder Vitalik Buterin had also made transactions carrying a significant amount of ETH toward centralized exchanges. This has sparked speculations that the founder is selling, which in turn could influence investors to sell as well. ETH bears take control of price &#124; Source: ETHUSD on Tradingview.com Featured image from Blockchair, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T15:06:03.000Z",
    "title": "Reviving the Peg: Terra Classic’s Plan to Bring USTC Back to $1",
    "url": "https://www.crypto-news-flash.com/reviving-the-peg-terra-classics-plan-to-bring-ustc-back-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=reviving-the-peg-terra-classics-plan-to-bring-ustc-back-to-1",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-25.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra Classic\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-25.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-25-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Terra Luna Classic community votes to stop minting USTC tokens to fix its value after Terra&#8217;s 2022 crash. Due to oversupply issues, the community aims to speed up the burning of LUNA tokens to boost their worth. In a significant development within the Terra Luna Classic (LUNC) community, a decisive vote with nearly 60% in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T15:00:22.000Z",
    "title": "Pikamoon Might Enter Into Top 50 Cryptocurrencies Soon, Displacing Algorand and AAVE",
    "url": "https://www.crypto-news-flash.com/pikamoon-might-enter-into-top-50-cryptocurrencies-soon-displacing-algorand-and-aave/?utm_source=rss&utm_medium=rss&utm_campaign=pikamoon-might-enter-into-top-50-cryptocurrencies-soon-displacing-algorand-and-aave",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-140.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-140.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-140-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-140-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The growth of the crypto market into the trillion-dollar industry it is today can be heavily linked to how competitive the space is. There&#8217;s always that new project ready to upset the odds, hit a meteoric rise, and displace existing market leaders. In this case, Algorand and AAVE must now constantly look over their shoulders [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T15:00:16.000Z",
    "title": "Harnessing the Ripple Effect: Your Path to Becoming an XRP Millionaire",
    "url": "https://www.crypto-news-flash.com/harnessing-the-ripple-effect-your-path-to-becoming-an-xrp-millionaire/?utm_source=rss&utm_medium=rss&utm_campaign=harnessing-the-ripple-effect-your-path-to-becoming-an-xrp-millionaire",
    "description": "<img width=\"1280\" height=\"783\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-300x184.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-1024x626.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-768x470.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Current trade of Ripple’s XRP stands at 85% below its 2018 peak, presenting a potential growth catalyst. • An investment of approximately $150,000 in XRP at current prices could pave the way to millionaire status in the next bullish cycle. Cryptocurrency aficionados have been closely monitoring the legal tête-à-tête between Ripple and the US Securities [...]"
  }
]