[
  {
    "source": "CoinDesk",
    "date": "2023-12-08T01:47:18.000Z",
    "title": "Binance Founder Changpeng 'CZ' Zhao Stuck in U.S. Until Sentencing",
    "url": "https://www.coindesk.com/policy/2023/12/08/binance-founder-changpeng-cz-zhao-stuck-in-us-until-sentencing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance founder and former CEO Changpeng Zhao must remain in the U.S. until he is sentenced next February, a federal judge ruled Thursday."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-08T01:45:56.000Z",
    "title": "Protocol Village: SKALE Community Approves Chain Pricing",
    "url": "https://www.coindesk.com/tech/2023/12/06/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Dec 7-Dec. 13, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-08T02:06:08.000Z",
    "title": "Microsoft May Be Working On an AI Edition of Windows",
    "url": "https://decrypt.co/209025/microsoft-ai-windows-2024-germanium-copilot",
    "description": "The 2024 Windows release is rumored to have AI in everything from its graphical user interface to its command line."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-08T01:43:00.000Z",
    "title": "Cardano (ADA) Price Soars 14% in a Week, Signals ‘Historically Bullish’ Trend",
    "url": "https://www.cryptoglobe.com/latest/2023/12/cardano-ada-price-soars-14-in-a-week-signals-historically-bullish-trend/",
    "description": "As the price of the smart contract platform Cardano (ADA) surgs by more than 14% over the past week, the cryptocurrency’s network has been seeing a “historically bullish” signal as the total number of ADA addresses drops. According to on-chain analytics firm Santiment, the total number of ADA addresses dropping is a “good sign,” as […]\n"
  },
  {
    "source": "NullTX",
    "date": "2023-12-08T01:50:54.000Z",
    "title": "$CIRUS Achieves 7-Month High At $0.05707 Following Innovative Partnership",
    "url": "https://nulltx.com/cirus-achieves-7-month-high-at-0-05707-following-innovative-partnership/",
    "description": "The Cirus Foundation, a Web3 initiative based on blockchain technology, has joined forces with Shift Markets, a prominent crypto exchange infrastructure provider. This will be inorder to spearhead the creation of non-custodial wallets seamlessly integrated with a global centralized exchange network. 🤝 We’re excited to announce our partnership with @shiftmarkets! [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T02:00:27.000Z",
    "title": "BLUR Is Down 30%, And Whales Are To Blame–Here’s Why",
    "url": "https://www.newsbtc.com/nft-market/blur-down-30-whales-to-blame/",
    "description": "Blur, a decentralized non-fungible token (NFT) marketplace, and OpenSea competitor is under pressure, tumbling by over 30% from its November peaks. While BLUR retreats, on-chain data reveals that BLUR whales have been moving their tokens to leading crypto exchanges, possibly to liquidate. Whales On A Possible Selling Spree According to Lookonchain data on December 7, several whales have been offloading large amounts of BLUR. To illustrate, 16.85 million BLUR, worth roughly $8.43 million, were deposited to exchanges in the past 24 hours.  Notably, one whale deposited 2.54 million BLUR, worth $1.26 million, received from the airdrop to Binance. At the same time, Mandala Capital transferred 2.76 million BLUR, worth $1.4 million, to OKX.  The deluge continued as another whale, only marked by the associated &#8220;0x68b5&#8221; address, withdrew 3.31 million BLUR worth $1.79 million from Binance between November 25 and 29 before moving them to the same exchange on December 1. The token had fallen, meaning the whale was down by roughly $65,000. Related Reading: Can Bitcoin Spot ETFs Attract Enough Capital? Experts On What Will Lead To ATH It is unclear whether the same addresses are sold for USDT or other tokens. However, what&#8217;s known is that any whale transfers to a centralized exchange is associated with liquidation. Accordingly, sentiment is impacted when whales move coins in large batches to exchanges, and retailers could interpret their transfers as incoming selling pressure. BLUR Is Up 220% From October Lows Thus far, looking at price action, buyers have the lead from a top-down preview. The coin is already up 220% from October lows. Most importantly, buyers have the upper hand, looking at the candlestick arrangement in the daily chart.  Even though the token is down 30% from November peaks, the failure of bears to force the coin below the 20-day moving average (MA) in the daily chart suggests that the uptrend is still valid. Losses below $0.46, or the base of the current bull flag, might trigger a sell-off. Conversely, any upswing above $0.58 and even $0.69&#8211;or November highs, could drive more demand, lifting BLUR to $0.84 or higher in the coming sessions. Related Reading: Binance CEO Disputes JPMorgan Chief’s Critique Of Crypto Whether the uptrend will resume also remains to be seen. What&#8217;s clear, though, is that the broader community is closely monitoring the NFT scene and Blur, the marketplace. The recent upswing was due to the activation of Season 2 Airdrop, which ended on November 20. Ahead of this, the token was already up 150%, only to extend gains briefly before cooling off in the first week of December. Feature image from Canva, chart from TradingView"
  }
]