[
  {
    "source": "Cointelegraph",
    "date": "2023-11-26T10:50:49.000Z",
    "title": "XRP price bull flag hints at 20% rally by New Year's",
    "url": "http://cointelegraph.com/news/xrp-price-bull-flag-20-rally-new-year-eve",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6cefa3cf-1658-4822-b7f5-410649893468.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>XRP may need to undergo a short selloff period before confirming the upside continuation setup as whales demonstrate bullishness.</p>\n                    <p><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) price may rally over 20% in the coming weeks thanks to a classic bullish continuation setup.</p><h2>XRP price enters bull flag breakout stage</h2><p>The so-called <a href=\"https://cointelegraph.com/news/what-is-a-bull-flag-chart-pattern-and-how-to-spot-it\">bull flag pattern</a> develops when the price consolidates inside a parallel channel after a strong uptrend. It resolves after the price breaks above the upper trendline with convincing volumes and rises by as much as the previous uptrend's height.</p><p>As of Nov. 26, XRP was trading above its bull flag's upper trendline, albeit accompanying weaker volumes. That technically indicates a weaker conviction among traders about XRP's bullish continuation. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/39cf94a6-b546-498c-ac7c-e39c06b7bef1.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD daily price chart. Source: TradingView</em></figcaption></figure><p>The duration of traders' indecisiveness could have XRP price test the flag's upper trendline as support. That means a decline toward $0.59, coinciding with a historical support level and the 50-day exponential moving average (50-day EMA; the red wave), by November. </p><p>This level is also around <a href=\"https://cointelegraph.com/news/xrp-price-faces-q4-rout-and-20-drop\">XRP's downside target</a> on the weekly timeframe chart.  </p><p>XRP may then climb toward $0.75 in December, up over 20% from current price levels, if the bull flag scenario holds, and is characterized by a high-volume rebound from the upper trendline. </p><p>Conversely, breaking below the flag's upper trendline would delay the bullish continuation setup, bringing the lower trendline near $0.54, coinciding with the 200-day EMA (the blue wave), into play as the next downside target.</p><h2>On-chain data shows XRP accumulation</h2><p>XRP's on-chain data looks tilted toward bulls thanks to strong accumulation among its richest addresses.</p><p>Notably, the cryptocurrency's correction period has coincided with an increase in its supply among addresses with a balance between 100,000 and 10 million tokens. In total, these so-called \"whales\" have purchased $6.82 million worth of XRP tokens over the past week.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Ripple?src=hash&amp;ref_src=twsrc%5Etfw\">#Ripple</a> | On-chain data shows that <a href=\"https://twitter.com/hashtag/XRP?src=hash&amp;ref_src=twsrc%5Etfw\">#XRP</a> whales have purchased around 11 million <a href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$XRP</a> over the past week, worth roughly $6.82 million! <a href=\"https://t.co/VnWpaMoOYR\">pic.twitter.com/VnWpaMoOYR</a></p>&mdash; Ali (@ali_charts) <a href=\"https://twitter.com/ali_charts/status/1728517545408217420?ref_src=twsrc%5Etfw\">November 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In other words, these whales are buying XRP at the likely local lows, indicating their conviction about a price rise in December, which corresponds with the bull flag setup presented above.</p><h2>SEC vs. Ripple decision looms</h2><p>XRP's price has soared nearly 85% so far in 2023, with Ripple's partial win against the U.S. Securities and Exchange Commission (SEC) serving as the primary bullish catalyst. However, the court must still decide whether Ripple's XRP sales to institutional investors broke U.S. securities laws. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ripple-gary-gensler-speech-sec-community\">Ripple lawyer urges fact-check of Gary Gensler’s speech, says SEC actions seen as ‘shady’</a></em></strong></p><p>The trial between Ripple and the SEC will reportedly resume on April 23, 2024, with legal experts <a href=\"https://cointelegraph.com/news/crypto-lawyer-says-20m-settlement-is-win-for-ripple\">seeing</a> a huge likelihood of a settlement. John Deaton, a crypto attorney, notes that any settlement below $20 million will be a 99.99% win for Ripple.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-26T11:06:16.000Z",
    "title": "The Complex Dynamics of AI and Human Control",
    "url": "https://www.cryptopolitan.com/the-complex-dynamics-of-ai-and-human-control/",
    "description": "In recent weeks, the world witnessed a dramatic spectacle surrounding the leadership of OpenAI, the renowned tech company behind the popular chatbot ChatGPT. The saga involving the appointment and reappointment of CEO Sam Altman drew global attention, shining a light on the internal dynamics of one of the most influential organizations in the tech industry. ... <a title=\"The Complex Dynamics of AI and Human Control\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-complex-dynamics-of-ai-and-human-control/\" aria-label=\"More on The Complex Dynamics of AI and Human Control\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-26T10:39:36.000Z",
    "title": "Nigeria’s central bank tightens policy to fight inflation",
    "url": "https://www.cryptopolitan.com/nigeria-central-bank-tightens-policy/",
    "description": "Amidst soaring inflation rates, Nigeria’s central bank is taking bold steps under the leadership of its new governor, Olayemi Cardoso. Nigeria, facing an economic crossroads, will witness tightened monetary policies over the coming quarters. This strategic pivot aims not just to combat the rampant inflation, which recently hit a staggering 27.33% — a peak not ... <a title=\"Nigeria&#8217;s central bank tightens policy to fight inflation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nigeria-central-bank-tightens-policy/\" aria-label=\"More on Nigeria&#8217;s central bank tightens policy to fight inflation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-26T10:43:10.000Z",
    "title": "Is Apecoin On Your Radar? APE Soars By 30% In 48 Hours, Signaling A Potential Bull Run",
    "url": "https://www.newsbtc.com/ape/is-apecoin-on-your-radar-ape-soars-by-30-in-48-hours-signaling-a-potential-bull-run/",
    "description": "In a month marked by heightened volatility, Apecoin (APE) has been a battleground for bulls striving to prevent a dip below the crucial $1 mark. This tug-of-war between bulls and potential downward pressure underscores the intense market dynamics surrounding Apecoin, leaving investors on the edge as they monitor the crypto&#8217;s price movements in this volatile November landscape. The latest data from the spot market reveals a resolute stance from bullish traders, as orders for more than 11 million APE tokens have beern strategically placed around the current price. Related Reading: Bitcoin Price Rockets Past $38,000, Hits Highest Peak Since May 2022 – Details APE has increased by 30% to surpass $1.70 following a decline to a weekly low of $1.30 on November 21. On-chain data projects long-term Apecoin investors&#8217; resilience might reenergize APE price possibilities. APE Total Order Books. Source:  IntoTheBlock Apecoin Price Rebounds From All-Time Low On October 9, the price of Apecoin plunged to an all-time low and narrowly avoided breaking below the $1 support level. However, the APE token has now increased by 40%, and as of November 24, the meme coin was trading at about $1.45. The market situation that APE is now operating in is difficult. The recent price increases of the token are at risk due to bearish on-chain indicators. Over the last few months, the amount of APE coins available on exchanges has almost doubled to a little over 50 million, which may signal an increase in buyer demand. The combination of a decrease in active addresses and an increase in supply on exchanges indicates a pessimistic deviation, which may indicate an impending decline in the price of the meme currency. Two notable corrections have occurred in APE during its current surge. The 61.8% Fibonacci level marked the first retracement, and 50% marked the second corrective. Total crypto market cap is currently at $1.4 trillion. Chart: TradingView.com These retracements are getting thinner, which is a bullish indication of increasing momentum and more buyer conviction. Taking this into consideration, investors may use the 38.2% and 50% Fibonacci levels as a helpful guide when placing stop-loss orders, acting as a buffer against any market volatility. Apecoin&#8217;s price is now bouncing between $1.063 and $1.506, indicating that it is in a volatile market. There are some indications of stability from the 10-Days Moving Average at $1.410 and the 100-Days Moving Average at $1.303. Nonetheless, it&#8217;s important to keep an eye on the resistance levels at $1.695 and $2.139 and the support levels at $0.365 and $0.808. These levels will be crucial in influencing the short-term price movements of APE. APE addresses by time held. Source: IntoTheBlock Shift In Address Dynamics Meanwhile, as reported by IntoTheBlock, a positive trend divergence is evident between the long-term and short-term holder addresses for APE. Illustrated in the Addresses by Time Held chart, the count of long-term addresses has surged by 6,060 wallets since the beginning of November. Concurrently, the Apecoin network has experienced a decrease of 3,800 in the number of trader/short-term wallets over the same period, highlighting a noteworthy shift in address dynamics. Related Reading: Coinbase COIN Hits 18-Month High To Rally Near $117 – Is $150 On The Cards? The forthcoming week holds significant importance for investors in APE, as it will serve as a crucial assessment of the durability of this meme coin and its prospects for more upward movements. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Pexels"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-26T10:44:00.000Z",
    "title": "SuperVerse (SUPER) Token Surged 230% in The Past 7 Days",
    "url": "https://coinedition.com/superverse-super-token-surged-230-in-the-past-7-days/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SuperVerse Token Surged\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Lookonchain, the smartmoney on-chain platform, the price of SuperVerse (SUPER) has increased by approximately 230% in the past seven days. Superverse is a blockchain solution focused on building and delivering Web3 products that empower crypto natives with next-generation NFT functionality. In a recent post on X (formerly Twitter), the smartmoney platform noted that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/superverse-super-token-surged-230-in-the-past-7-days/\">SuperVerse (SUPER) Token Surged 230% in The Past 7 Days</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]