[
  {
    "source": "Decrypt",
    "date": "2023-12-18T22:46:46.000Z",
    "title": "UK Builds Digital Securities Sandbox to Test New Technolgies",
    "url": "https://decrypt.co/210202/uk-builds-digital-securities-sandbox-to-test-new-technolgies",
    "description": "The setup aims to house controlled testing of blockchain and other emerging infrastructure technologies before wider deployment."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T23:00:00.000Z",
    "title": " A closer look at Unstoppable Domains’ .com integration ",
    "url": "https://cointelegraph.com/news/unstoppable-domains-com-integration-closer-look",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZWRiMzY1MmQtYjFhMS00NWRhLTkwYmItYzU2Mzk0ODcwN2RjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Unstoppable Domains recently integrated .com domains into its platform. What implications could this move have?</p>\n                    <p><p data-ct-non-breakable=\"true\">Unstoppable Domains — a prominent provider of Web3 domains — recently expanded its offerings by incorporating traditional “.com” addresses. </p><p>This move marks the first instance of merging conventional Web2 domains with the evolving Web3 domain space. This integration aims to seamlessly connect the existing web infrastructure with the new, allowing users to engage with both types of domains on a single platform.</p><p>Integrating .com domains with blockchain technology goes beyond a technical achievement; it’s an effort to enhance user adoption and streamline the overall user experience. </p><p><a href=\"https://cointelegraph.com/news/unstoppable-domains-com-integration-closer-look\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-18T23:00:12.000Z",
    "title": "Mysterious 2015 Whale Transfers 2,101 BTC, Stirring $88M in Bitcoin",
    "url": "https://news.bitcoin.com/mysterious-2015-whale-transfers-2101-btc-stirring-88m-in-bitcoin/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Mysterious 2015 Whale Transfers 2,101 BTC, Stirring $88M in Bitcoin\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/whaler.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Dec. 18, 2023, a colossal cache of dormant bitcoins stirred after remaining inactive for eight years and ten months. The whale transferred 2,101 bitcoins, originating from 2015, now valued at $88.55 million, utilizing the prevailing BTC exchange rates. $88M Worth of Bitcoin Moved by Long-Dormant Whale On Feb. 17, 2015, a substantial accumulation of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T23:00:49.000Z",
    "title": "Machine Learning Algorithm Predicts When Cardano Price Will Hit New $6.5 ATH",
    "url": "https://www.newsbtc.com/news/cardano/cardano-price-6-5-ath/",
    "description": "The machine learning algorithm at CoinCodex has predicted when the Cardano price will reach a new all-time high. The coin which has been performing quite well in the last few weeks is still miles away from its current all-time high of $3.1. However, the machine learning algorithm has revealed when it will cross this level once more. Cardano Price Will Hit $6.5 According to the CoinCodex machine learning algorithm, the Cardano price may be locked into years of performing below its 2021 all-time high prices before finally revisiting It around five years from now. Apparently, while the next few years will see the price jump another 200% from its current price, breaking above $3.1 will remain elusive. Related Reading: Shiba Inu Faces Make Or A Point As Analyst Identifies Critical Trading Pattern The year 2024 which is expected to be the start of another crypto bull market will reportedly see ADA only rise as high as $2.98, falling just short of its previous all-time high. Then in the years 2025 and 2026, its max performance is pegged even lower with $2.42 in 2025 and $0.8 in 2026. The year 2027 is expected to follow the same trend as 2026 with a min value of $0.5 and a maximum value of $0.86. However, in 2028, this is expected to completely change to the point where the ADA price will reach a brand-new all-time high. Cardano’s max price for the year 2028 is said to be $6.52 by the machine learning algorithm with a minimum price of $0.73. Then in the following year of 2029, it expects a minimum value of $1.1 and a max value of $4.99. Finally, the year 2030 is placed at a minimum of $0.65 and a maximum of $1.36. ADA price recovers from dip &#124; Source: ADAUSD on Tradingview.com ADA Sees Bullishness Across The Board Contrary to the CoinCodex machine learning algorithm saying that the Cardano price will not reach a new all-time high until the year 2028, crypto analysts have come forward with their own bullish predictions. One analyst Psyclops expects the price to climb to $10 amid the rapid growth that is being recorded in the Cardano ecosystem. Related Reading: Terra Classic Validator Presents ‘Legally Absolved Route’ To Burn 800 Million USTC Another crypto analyst known as Crypto Crow says that they expect the price to reach $32. The time frame from this analyst is that they expect this to happen in the next bull market and since the next bull market is expected to take place between 2024 and 2025, it gives it a two-year timeframe. Finally, crypto analyst Dan Gambardello has predicted that the Cardano price will reach $11. His reasoning lies with the past performance of the digital asset which has performed very well in each bull market. Gambardello expects that if ADA sticks to historical performance, then the market cap of the altcoin will climb to $400 billion by the year 2025. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from The Daily Hodl, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T23:01:40.000Z",
    "title": "Under-the-Radar Altcoin Surges 60% in 24 Hours Amid Network Expansion and Explosive Demand for Solana Smartphone",
    "url": "https://dailyhodl.com/2023/12/18/under-the-radar-altcoin-surges-60-in-24-hours-amid-network-expansion-and-explosive-demand-for-solana-smartphone/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A decentralized wireless network altcoin on the Solana (SOL) blockchain is soaring amid two big consumer-driven events. The decentralized finance (DeFi) telecommunications project Helium Mobile (MOBILE) is up 60% in the past 24 hours, going from Sunday’s low of $0.0042 to $0.0067 at time of writing. The sudden surge comes as the Helium Mobile project [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/under-the-radar-altcoin-surges-60-in-24-hours-amid-network-expansion-and-explosive-demand-for-solana-smartphone/\">Under-the-Radar Altcoin Surges 60% in 24 Hours Amid Network Expansion and Explosive Demand for Solana Smartphone</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]