[
  {
    "source": "CoinDesk",
    "date": "2023-11-07T08:43:35.000Z",
    "title": "Crypto Tax Platform Blockpit Buys Rival Accointing From Glassnode",
    "url": "https://www.coindesk.com/business/2023/11/07/crypto-tax-platform-blockpit-buys-rival-accointing-from-glassnode/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The \"multi-million dollar\" acquisition gives Austria-based Blockpit a footprint in the U.K."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T09:00:00.000Z",
    "title": "BNB Smart Chain scam losses dropped 75% in Q3: Report",
    "url": "http://cointelegraph.com/news/bsc-losses-down-75-percent-q3-report-avengerdao",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ba100e9e-27df-47a0-ab1c-4b5a59acc77a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Security firm HashDit says the lower amount lost to scams on BSC could be due to an uptrend in security products addressing the threat. </p>\n                    <p><p>Scams facilitated on BNB Smart Chain (BSC) decreased from $55.4 million in the second quarter of 2023 to $13.6 million in the third quarter, according to an AvengerDAO report contributed to by security firm HashDit. This represents a 75% drop in the amount lost to scams.</p><p>According to the security firm’s analysis, the drop can be attributed to various factors, including an increase in overall awareness among community members, an uptrend in security products flagging malicious websites and activities, and community members identifying scams early and giving warnings before the scammers can succeed. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/18307be3-c496-4775-ad95-4ec468b50f02.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Amount lost to BSC scams in 2023. Source: HashDit</em></figcaption></figure><p>Despite the drop, rug pulls represented 67% of total losses on the blockchain in the third quarter. According to HashDit, this remains BSC’s most common attack vector. With rug pulls, maliciously acting projects entice investors with marketing efforts but don’t deliver their promised products, and the founders run away with investor funds. </p><p>Reserves and price manipulation were also prevalent on BSC in Q3 2023. According to the report, this is because hackers are exploiting “poorly designed smart contracts.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/exploits-hacks-and-scams-stole-almost-1b-in-2023-report\"><strong><em>Exploits, hacks and scams stole almost $1B in 2023: Report</em></strong></a></p><p>On Oct. 20, various security experts highlighted that <a href=\"https://cointelegraph.com/news/ether-hiding-why-hackers-prefer-binance-bnb-smart-chain\">malicious actors may prefer BSC</a><a href=\"https://cointelegraph.com/news/ether-hiding-why-hackers-prefer-binance-bnb-smart-chain\"></a> because it’s cheaper and is perceived as having lower security than the Ethereum blockchain. According to CertiK security researcher Joe Green, fees on BSC are much lower than Ethereum, but the network’s stability and speed are the same. The researcher believes that because of this, hackers face “no financial pressure” when using BSC. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-incredible-rags-riches-tale-polygon-sandeep-nailwal/\"><strong><em>Slumdog billionaire: Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T08:56:11.000Z",
    "title": "Kenyan lawmakers ask local Blockchain Association to come up with crypto bill",
    "url": "http://cointelegraph.com/news/kenyan-lawmakers-blockchain-association-crypto-bill",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/d2657988-ac30-4be0-89cb-51f8bedbe377.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Kenya might become the first country in the world where the industry’s representatives would develop the regulatory framework for crypto.</p>\n                    <p><p>Kenya might become the first country in the world where the industry’s representatives would develop the regulatory framework for crypto. According to the Blockchain Association of Kenya (BAK), The National Assembly’s Departmental Committee on Finance and National Planning has <a href=\"https://twitter.com/BlockchainKenya/status/1721464312332460054\" target=\"_blank\" rel=\"noopener nofollow\">directed</a> it to prepare the first draft of “what could become a virtual asset service provider’s bill.”</p><p>On Oct. 31, the Committee on Finance and National Planning invited the BAK representatives to discuss the digital assets regulation. BAK’s legal and policy director, Allan Kakai, shared the details behind the meeting with the local media: </p><blockquote>“Basically, we are telling [the] parliament: ‘Look, Kenya has always branded itself as the Silicon Savannah; we are top three for digital assets [volume in Africa], and if we do not develop a clear licensing and regulatory framework, Nigeria, South Africa, Botswana, Namibia, Mauritius would take the lead, and the capital flow that would have come to Kenya would have flocked elsewhere.”</blockquote><p>In response, the Committee gave the BAK two months to draft the crypto bill. The message in the Committee’s official X (former Twitter) account <a href=\"https://twitter.com/NACommitteeKE/status/1719343112969937373\" target=\"_blank\" rel=\"noopener nofollow\">notes</a> only that it “urged the Association to undertake robust public education on cryptocurrency trade to demystify it.”</p><p><strong><em><u>Headline: </u></em></strong><a href=\"https://cointelegraph.com/news/kenya-digital-ids-by-year-end\"><strong><em>Kenya to introduce digital IDs for citizens by year-end</em></strong></a></p><p>In September 2023, Kenya introduced the Financial Act 2023, featuring the requirement for cryptocurrency exchanges to withhold 3% “of the transfer or exchange value of the digital asset.” The BAK, whose members haven’t gotten to dissuade the lawmakers from passing this crypto tax at the meeting in May, <a href=\"https://techcabal.com/2023/09/01/bak-moved-to-court-to-block-crypo-taxes/\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a complaint against it to the High Court of Kenya. </p><p>Kenyan authorities <a href=\"https://cointelegraph.com/news/kenya-parliamentary-committee-shutdown-worldcoin\">took a harsh stance against</a> the controversial digital ID crypto project Worldcoin, co-founded by Sam Altman, the CEO of OpenAI. A parliamentary committee in Kenya’s government recommended that regulators shut down the project’s operations in the country, citing the personal data harvesting concerns. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/6-questions-for-lugui-tillier-about-bitcoin-ordinals-and-the-future-of-crypto/\"><strong><em>6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-07T08:47:09.000Z",
    "title": "Aave (AAVE) Price Analysis: AAVE Rises Despite Reports Of A Feature Issue",
    "url": "https://cryptodaily.co.uk/2023/11/aave-aave-price-analysis-aave-rises-despite-reports-of-a-feature-issue",
    "description": "Decentralized finance (DeFi) platform Aave paused several markets on the 4th of November after users reported an issue affecting a specific feature on the platform, according to a post on X."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T08:58:46.000Z",
    "title": "Meta Restricts Use of Generative AI Tools in Political Adverts",
    "url": "https://www.cryptopolitan.com/meta-restrict-use-of-ai-in-political-adverts/",
    "description": "In a significant move to address concerns over the potential misuse of artificial intelligence (AI) in political advertising, Meta, the parent company of Facebook, has announced a new policy barring political advertisers from utilizing its generative AI advertising products. This decision comes in response to mounting fears that AI-powered tools could amplify the spread of ... <a title=\"Meta Restricts Use of Generative AI Tools in Political Adverts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-restrict-use-of-ai-in-political-adverts/\" aria-label=\"More on Meta Restricts Use of Generative AI Tools in Political Adverts\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T08:58:32.000Z",
    "title": "Coinbase Director Uncovers Lost Ethereum Wallet with $474 Million Belonging to Estonian LHV Bank Founder",
    "url": "https://www.crypto-news-flash.com/coinbase-director-uncovers-lost-ethereum-wallet-with-474-million-belonging-to-estonian-lhv-bank-founder/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-director-uncovers-lost-ethereum-wallet-with-474-million-belonging-to-estonian-lhv-bank-founder",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />An Ethereum wallet with 250,000 ETH, valued at nearly $474 million, is linked to Rain Lohmus, the founder of Estonia&#8217;s LHV Bank. The wallet, inactive since the 2014 Ethereum ICO, has received significant value from airdrops, now seeking assistance to recover the lost access keys Blockchain Detective Work Identifies Likely Owner of a Lucrative Ethereum [...]"
  }
]