[
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T14:02:37.000Z",
    "title": "US law protects institutions and exposes retail investors — Rep. Torres",
    "url": "https://cointelegraph.com/news/us-law-exposes-retail-investors-rep-torres",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d0c0db16-a706-4f72-bc1a-de58fbb68283.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>New York Representative Ritchie Torres had an exclusive interview with Cointelegraph to discuss why retail investors are still at risk following the XRP court ruling. </p>\n                    <p><p>On July 13, 2023, United States District Court Judge Analisa Torres ruled that Ripple’s XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">should not be considered a security</a> when sold on retail digital asset exchanges.</p><p>Stuart Alderoty, chief legal officer at Ripple, told Cointelegraph that last week’s ruling makes it clear that the U.S. Securities and Exchange Commission’s (SEC) theory that a token can be an investment contract and, therefore, a security, no longer has support in the law.</p><p>He said of the ruling: “That is not only a huge win for Ripple, but it’s a win for all of crypto in the United States. The SEC can no longer tout their record in crypto, which was, up till now, by and large, settlements with players that didn’t have the resources to fight back.”</p><p>While this may be, New York Representative Ritchie Torres told Cointelegraph that the Ripple decision reveals a cruel irony in securities law. He said: </p><blockquote>“It protects institutional investors while leaving retail customers exposed, even though the latter arguably requires more protection than the former. For me, the lack of protection for retail investors underscores the fierce urgency around passing a market structure bill to protect the average American consumer.” </blockquote><p>Torres elaborated on this remark, commenting on his plan to help ensure the passing of a <a href=\"https://cointelegraph.com/news/us-lawmaker-calls-for-info-from-treasury-and-sec-on-crypto-market-structure-bill\">crypto market structure bill</a>, and his support for blockchain technology and cryptocurrency innovation. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Crypto regulation by enforcement had a dreadful day in court.  <br><br>In light of the SDNY’s landmark decision in the Ripple case, <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a> must reassess its reckless regulatory assault on the crypto industry.  <br><br>My letter to Chair Gensler: <a href=\"https://t.co/Mrk63N4KhH\">pic.twitter.com/Mrk63N4KhH</a></p>&mdash; Rep. Ritchie Torres (@RepRitchie) <a href=\"https://twitter.com/RepRitchie/status/1681336088873279488?ref_src=twsrc%5Etfw\">July 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong>Cointelegraph: Can you please explain the meaning behind the recent XRP court ruling?</strong></p><p><strong>Torres:</strong> The Southern District of New York’s decision makes two critical distinctions. First, it draws a distinction between securities and assets that are part of investment contracts, which qualify as securities under the Howey test. The decision establishes what I describe as the “Torres Rule,” which holds that digital assets are not in themselves securities that can be sold as investment contracts that qualify as securities under the Howey test.</p><p>Secondly, it distinguishes between institutional buyers and retail buyers. If you are an institutional buyer that purchases a crypto token directly from an issuer or promoter, then that transaction is a security offering. But, if you are a retail customer purchasing a crypto token on an exchange, that transaction is different from an investment contract and falls outside the scope of securities law.</p><p><strong>CT:</strong> <strong>You mentioned that the lack of protection for retail investors underscores the fierce urgency around passing a market structure bill to protect the average American consumer. Please explain.</strong></p><p><strong>RT:</strong> The U.S. House Financial Services Committee is presently considering two bills. <a href=\"https://cointelegraph.com/news/us-house-committee-releases-new-stablecoin-bill-draft\">One is about stablecoins</a>, and the other is <a href=\"https://cointelegraph.com/news/republican-crypto-bill-10x-improvement-messari-ceo\">about market structure</a>. The combination of the Ripple decision and the market structure bill would create a rigorous yet workable framework for regulating digital assets. </p><p>The Ripple decision protects the crypto industry from arbitrary enforcement action and from Gary Gensler’s practice of regulation by enforcement, but a crypto market structure bill would protect retail investors from bonafide bad actors. </p><p><strong>CT: What are you doing to help ensure the passing of a crypto market structure bill? </strong></p><p><strong>RT:</strong> I have been actively negotiating with the Republicans in the House Financial Services Committee to get the crypto market structure bill right. There is no substitute for legislation, and Gary Gensler’s strategy for regulation has put retail customers at risk.</p><p>However, I think that both Congress and the SEC should strive to be merit neutral with respect to cryptocurrency. The role of policymakers is not to determine the utility of blockchain technology for society. Rather, our role is to create a framework for regulating digital assets and protecting investors and consumers. That’s our mandate regardless of personal feelings about the utility of crypto. </p><p><strong>CT: What are your thoughts on cryptocurrency and blockchain technology?</strong></p><p><strong>RT:</strong> I personally believe that blockchain technology and cryptocurrency have the potential to create a better, cheaper and faster payment system, while enabling a new layer of the internet commonly known as Web3. But in order for crypto and blockchain to have a fighting chance of succeeding, a regulatory framework and clarity is required. Clarity is the cornerstone of compliance. </p><p><strong>CT: Final thoughts?</strong></p><p><strong>RT: </strong>Even after the Ripple case, the status quo remains unacceptable because retail customers are exposed. Therefore, I have two objectives. The first objective is to protect crypto innovators from enforcement by regulation, which the Ripple decision accomplishes. The second objective, and most importantly, is to protect retail customers. That is where the need for legislation now comes into play. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T14:00:00.000Z",
    "title": "Liquid staking claims top spot in DeFi: Binance report",
    "url": "https://cointelegraph.com/news/liquid-staking-claims-top-spot-in-defi-binance-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4bbfd06e-e5df-41e2-8467-c55cb27d8813.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Binance spokesperson highlighted that there are things to be wary of when liquid staking, including smart contract vulnerabilities, slashing risks and price fluctuations.</p>\n                    <p><p>Liquid staking is a <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> subsector that lets users earn yield by staking their tokens without losing their liquidity. It has become the biggest DeFi sector in terms of total value locked (TVL), according to crypto exchange Binance’s Half-Year Report 2023. </p><p>Within the report, the crypto exchange highlighted that liquid staking had dethroned <a href=\"https://cointelegraph.com/learn/what-are-decentralized-exchanges-and-how-do-dexs-work\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-are-decentralized-exchanges-and-how-do-dexs-work/amp\">decentralized exchanges (DEXs)</a> as the top-ranking DeFi category by TVL as of April 2023. </p><p>The staking mechanism was a crucial part of staking Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) before the <a href=\"https://cointelegraph.com/explained/ethereum-shanghai-upgrade-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/ethereum-shanghai-upgrade-explained/amp\">Ethereum Shanghai upgrade</a> when users were unable to freely unstake their ETH. By then, liquid staking tokens (LSTs) provided users with liquidity while they earned yield with their ETH.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5f6cae47-b456-4d58-9003-882d2ad146d8.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Liquid staking commands 37.1% of the ETH staking market. Source: Binance</em></figcaption></figure><p>On April 13, the Shanghai update went <a href=\"https://cointelegraph.com/news/ethereum-shapella-upgrade-community-celebrates-as-update-goes-live-on-mainnet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-shapella-upgrade-community-celebrates-as-update-goes-live-on-mainnet/amp\">live on the Ethereum mainnet</a>, allowing users to withdraw their staked ETH. Despite this, the report said that liquid staking still continued to grow. “Interestingly, growth continues to be extremely strong post-Shanghai, with liquid staking being the most common way for users to stake ETH,” Binance wrote.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rapid-growth-in-defi-focused-ethereum-liquid-staking-derivatives-platforms-raises-eyebrows\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/rapid-growth-in-defi-focused-ethereum-liquid-staking-derivatives-platforms-raises-eyebrows/amp\"><strong><em>Rapid growth in DeFi-focused Ethereum liquid staking derivatives platforms raises eyebrows</em></strong></a></p><p>In addition, the Binance report also noted the emergence of the term “LSTfi,” which is also sometimes called “LSDfi.“ The term combines liquid staking and DeFi, with projects like yield-trading protocols, indexing services, and projects allowing users to mint stablecoins using LSTs as collateral categorized as LSTfi protocols. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0623dac7-5a73-4729-8d89-021ccf73d9ed.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>LSTfi protocols’ TVL has grown by 67% throughout June 2023. Source: Binance</em></figcaption></figure><p>According to the report, the market is relatively concentrated on the top protocols during its early stages. However, Binance predicted this will change as more new projects emerge under this category in the near future. </p><p>While liquid staking has become popular of late, users still need to be mindful of some aspects. In a statement, a Binance spokesperson told Cointelegraph that users need to be wary of some risks associated with liquid staking. This includes exposure to smart contract vulnerabilities, slashing risks and price risks. They explained: </p><blockquote>“Liquid staking involves users interacting with an additional layer of smart contract, which might expose them to the potential of bugs in the smart contracts used by liquid staking protocols. Therefore, it is important that users do their own research.”</blockquote><p>In addition, the Binance spokesperson said that validators who fail to perform their duties get penalized by having some of their staked assets “slashed.” This means that users must be wary and make sure that they don’t stake through a penalized validator. This will help them avoid losses. “It’s important for users to choose protocols that diversify staked assets across a range of reputable node operators,” they said. </p><p>Lastly, users must be wary of price risks. According to Binance, users can potentially get a mismatch between the LST and the underlying token due to market price fluctuation. This could also happen due to various reasons, including smart contract issues. </p><p>Despite the positive growth of the liquid staking subsector, the DeFi sector generally performed worse than the global crypto market. According to the report, even though DeFi unlocked new use cases, the space’s dominance saw a 0.5% decline against the broader crypto space. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/liquid-staking-claims-top-spot-in-defi-binance-report&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/liquid-staking-claims-top-spot-in-defi-binance-report&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins: 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T13:40:52.000Z",
    "title": "Op-ed: US banks launch 24/7 Instant Payments – does FedNow reduce risk of CBDCs?",
    "url": "https://cryptoslate.com/op-ed-us-banks-launch-24-7-instant-payments-does-fednow-reduce-risk-of-cbdcs/",
    "description": "<p>The U.S. Federal Reserve&#8217;s (Fed) long-awaited instant payment service, FedNow, is set to launch imminently, promising a significant development in the country&#8217;s payment system. As reported by Reuters on July 20, with this service, everyday Americans will soon be able to send and receive funds in real-time, 24/7, a revolutionary stride in the U.S. financial [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-us-banks-launch-24-7-instant-payments-does-fednow-reduce-risk-of-cbdcs/\">Op-ed: US banks launch 24/7 Instant Payments &#8211; does FedNow reduce risk of CBDCs?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T13:57:00.000Z",
    "title": "US Senators Introduce DeFi Regulations",
    "url": "https://cryptodaily.co.uk/2023/07/us-senators-introduce-defi-regulations",
    "description": "<p>A bipartisan group of United States Senators has introduced the CANSEE Act to regulate DeFi platforms in order to curb money laundering and other financial transgressions.&nbsp;</p>\nSenators Against DeFi\n<p>U.S. Senators are taking a strong stance against money laundering and crypto-facilitated crime by introducing new legislation aimed at regulating decentralized finance (DeFi) services. The Crypto-Asset National Security Enhancement and Enforcement (CANSEE) Act requires DeFi platforms to comply with the same anti-money laundering (AML) and economic sanctions obligations as traditional financial companies.&nbsp;</p>\n<p>The bipartisan team of senators behind the CANSEE Act includes Jack Reed (D-RI), Mike Rounds (R-SD), Mark Warner (D-VA), and Mitt Romney (R-UT).&nbsp;</p>\nDeFi To Get More Centralized\n<p>The CANSEE Act will introduce tighter regulations and laws to DeFi, on par with the governance experienced by centralized institutions like banks, securities brokers, casinos, and centralized crypto trading platforms. Consequently, DeFi services will have to establish AML programs, conduct due diligence on customers, and report suspicious transactions to the Treasury Department's Financial Crimes Enforcement Network (FinCEN).</p>\n<p>Senator Warner noted,&nbsp;</p>\n\n<p>&ldquo;I believe these focused measures will help maintain the robust AML and sanctions enforcement we need to protect our national security, while allowing participants who play by the rules to continue to take advantage of the potential of distributed ledger technologies.&rdquo;</p>\n\n<p>The legislation will also extend to all individuals and entities who facilitate the use of DeFi platforms by sanctioned individuals. The regulations under the act also will hold accountable any investor putting in more than $25 million in a DeFi project without a clear in charge.&nbsp;</p>\nCrypto ATMs In Trouble\n<p>The CANSEE Act is also extended its reach over crypto ATMs, claiming their higher propensity to be used in money laundering activities. As a result of the legislation, operators of crypto ATMs across the country will need to conduct identity checks for all participants involved in any single transaction.&nbsp;</p>\n<p>Senator Reed stated,&nbsp;</p>\n\n<p>&ldquo;Our bill will also ensure that law enforcement has access to better information about cryptocurrency transactions, which they need to fight crimes like cross-border drug trafficking, weapons proliferation, and ransomware attacks.&rdquo;</p>\n\nIndustry Criticizes DeFi Bill\n<p>The bill has been highly condemned by crypto Twitter, with experts deeming it an \"existential threat to DeFi.&rdquo; There have also been questions about the bill&rsquo;s imposition of control responsibilities, claiming it would discourage VCs from DeFi investments.&nbsp;</p>\n<p>The Crypto Council for Innovation stated that the proposal lacks specific guidance on how decentralized protocols can comply with Bank Secrecy Act (BSA) reporting requirements. They advocate for an alternative approach that involves distinguishing elements within the DeFi technology stack and using blockchain transparency and programmability to establish compliance measures tailored to the crypto ecosystem.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-20T13:45:56.000Z",
    "title": "Moonland Inches Closer to NFT Airdrop Following Early Access Announcement",
    "url": "https://news.bitcoin.com/moonland-inches-closer-to-nft-airdrop-following-early-access-announcement/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ef182e5d-cba9-4ff9-9bcd-5100e0d5a489.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. MoonLand, the groundbreaking social multiplayer metaverse game, is set to redefine the gaming industry with its revolutionary play-to-earn mechanism and immersive gameplay experience. By blending blockchain technology, web 3.0 principles, and the economy model of the metaverse, MoonLand aims to captivate a global audience of gaming enthusiasts. Unlock Early Access with MoonLand&#8217;s NFT [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T13:44:50.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T13:39:45.000Z",
    "title": "Bitget expands its horizons and enters the Middle East with a Dubai office to foster crypto adoption",
    "url": "https://www.cryptopolitan.com/bitget-sets-shop-in-dubai-middle-east-growth/",
    "description": "Bitget, a renowned global crypto exchange, has launched an office in Dubai, a daring move that reflects the region&#8217;s rising importance in the industry. The exchange has its sights set on the expanding market in the area, where it hopes to become a dominant force in the bitcoin sector. Established firms like Bitget are paying ... <a title=\"Bitget expands its horizons and enters the Middle East with a Dubai office to foster crypto adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitget-sets-shop-in-dubai-middle-east-growth/\" aria-label=\"More on Bitget expands its horizons and enters the Middle East with a Dubai office to foster crypto adoption\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T13:59:41.000Z",
    "title": "Tesla maintains $184m BTC holdings amidst record revenue",
    "url": "https://crypto.news/tesla-maintains-184m-btc-holdings-amidst-record-revenue/",
    "description": "Tesla maintains its digital asset holdings at $184 million worth of Bitcoin for the fourth consecutive quarter, with no sales or additions reported."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T14:00:13.000Z",
    "title": "Arkansas Senator Calls For Reversal Of Controversial New Crypto Mining Law",
    "url": "https://www.newsbtc.com/news/arkansas-senator-calls-for-reversal-of-controversial-new-crypto-mining-law/",
    "description": "In April 2023, Arkansas made history by becoming the first state to pass the &#8216;Right to Mine&#8217; Bitcoin bill in both the House and Senate. However, the &#8220;Right to Mine&#8221; law in Arkansas is encountering increasing opposition as it relaxes regulations on commercial crypto mining. Reports have suggested that loosening restrictions on commercial cryptocurrency mining has raised concerns. This is because after enacting the new law, large electricity-intensive crypto mines entered Arkansas. The legislation has sparked controversy by limiting the authority of city governments to regulate crypto mines. This has effectively stripped them of their ability to enforce local ordinances concerning such operations. During the 2023 legislative session, Arkansas Senator Bryan King (R) from District 28 expressed criticism of the bill&#8217;s introduction. And Senator King is reportedly planning to introduce another bill aimed at repealing the controversial &#8220;Right to Mine&#8221; law. Related Reading: Solana (SOL) Continues To Shine With Over 20% Surge – What’s Next? Reports indicate that residents have raised numerous concerns, including excessive noise, substantial power grid usage, and the fact that Green Digital LLC., the company behind the proposed crypto mines in their cities, is a subsidiary partially owned by the Chinese Communist Party. Some Towns Have Rejected Proposed Crypto-Mining Facilities Arkansas Senator Bryan King has taken proactive steps by drafting a bill aimed at repealing the controversial law related to crypto-mining. One of the major worries is the strain on the local power grid caused by the electricity-intensive nature of crypto-mining operations. Reports have surfaced that some areas are already facing warnings of potential brownouts or blackouts. This is because of the increased energy consumption from these facilities. As of the current moment, local reports indicate that Arkansas is home to approximately 10 crypto mines. Vilonia and Harrison, two towns in Arkansas, have prevented attempts to establish proposed crypto-mining facilities within their respective city limits. Related Reading: Stellar Makes Surprise 70% Rally – Start Of Something Big For XLM? Senator Bryan King has further contended that crypto mines do not serve as economic boons to the communities where they establish their operations. He specifically highlighted that facilities like those proposed by Green Digital only employ a limited number of people. As such, the mines fail to provide substantial job opportunities or significant economic growth to the areas they operate. Advocacy For The Mining Bill Senator Joshua Bryant (R) who sponsored the bill explained and supported that the bill aims to protect property rights and stop the unfair treatment of crypto entrepreneurs. He said that crypto miners are people living in Arkansas who invest money in the state&#8217;s infrastructure, help keep utility costs stable, and boost the local economy. Bryant points out that if crypto-mining facilities are treated similarly to other data centers, the law allows local governments to create their own regulations. Furthermore, he clarified, that regarding noise ordinances, local governments are free to regulate commercial facilities as they deem appropriate. Related Reading: XRP Maintains Bullish Run With Nearly 80% Rally – Is $1 Within Reach? However, the bill specifically focuses on home mining operations. In this regard, it suggests adhering to existing federal and state laws related to nuisances. It also includes the US EPA Noise Act or standard statutory language outlined in the Disturbance Act. Nevertheless, the Arkansas &#8220;Right to Mine&#8221; law is set to take effect next month. Featured image from UnSplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T14:05:18.000Z",
    "title": "Binance’s Half-Year Report Shows Strong Growth and Adoption in the Crypto Industry",
    "url": "https://www.crypto-news-flash.com/binance-half-year-report-shows-strong-growth-and-adoption-in-the-crypto-industry/?utm_source=rss&utm_medium=rss&utm_campaign=binance-half-year-report-shows-strong-growth-and-adoption-in-the-crypto-industry",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Binance has released its report for H1 covering the most important offshoot of the industry. With the impressive growth in DeFi, VCs and more, the exchange has a better outlook for the second half. Binance, one of the world’s leading crypto exchanges has recently unveiled its highly anticipated half-year report for 2023, providing a comprehensive [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T14:05:09.000Z",
    "title": "Behind the Scenes of XRP: An Exploration of the Robust XRPL Network",
    "url": "https://www.crypto-news-flash.com/behind-the-scenes-of-xrp-an-exploration-of-the-robust-xrpl-network/?utm_source=rss&utm_medium=rss&utm_campaign=behind-the-scenes-of-xrp-an-exploration-of-the-robust-xrpl-network",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T170320.149.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T170320.149.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T170320.149-300x150.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple&#8217;s Unforeseen Triumph: A Catalyst for Change The recent legal victory of Ripple Labs against the SEC is a tale of triumph against adversity. This significant win has spurred an upturn in XRP&#8217;s price, breaking its previous period of dormancy. Yet, as XPMarket&#8217;s data insightfully highlights, this achievement only scratches the surface. There&#8217;s a larger [...]"
  }
]