[
  {
    "source": "CoinDesk",
    "date": "2023-06-07T11:27:21.000Z",
    "title": "Research Shows Majority of Pepe Investors Caught in High-Stakes Game of Musical Chairs",
    "url": "https://www.coindesk.com/markets/2023/06/07/research-shows-majority-of-pepe-investors-caught-in-high-stakes-game-of-musical-chairs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The majority of investors did not stand to gain from Pepecoin's herculean rise, indicating a limited window for potential gains."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T11:30:45.000Z",
    "title": "Woo: “Binance customers don’t care” about SEC enforcement action",
    "url": "https://cryptoslate.com/woo-binance-customers-dont-care-about-sec-enforcement-action/",
    "description": "<p>On-chain Analyst Willy Woo has said, &#8220;Binance customers don&#8217;t care&#8221; about recent enforcement actions by the Securities Exchange Commission (SEC). Woo made the comments regarding Bitcoin holders on the main global platform. However, further analysis showed Binance.US altcoin holders are withdrawing significant funds. Binance Bitcoin balance holds steady On June 6, the SEC filed a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/woo-binance-customers-dont-care-about-sec-enforcement-action/\">Woo: &#8220;Binance customers don’t care&#8221; about SEC enforcement action</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-07T11:30:18.000Z",
    "title": "Former Minnesota Vikings Co-Owner Slapped With 75 Month Jail Term for Processing $750M Worth of Crypto Transactions",
    "url": "https://news.bitcoin.com/former-minnesota-vikings-co-owner-slapped-with-75-month-jail-term-for-processing-750m-worth-of-crypto-transactions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Former Minnesota Vikings Co-Owner Slapped With 75 Month Jail Term for Processing $750M Worth of Crypto Transactions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/fow.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Attorney&#8217;s Office for the Southern District of New York announced on June 5 that the former co-owner of Minnesota Vikings, Reginald Fowler, has been sentenced to 75 months in prison for processing more than $700 million of unregulated transactions on behalf of crypto exchanges. Folwer was also ordered to pay a &#8220;forfeiture of $740,249,140.52 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T11:20:34.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T11:10:32.000Z",
    "title": "USDC issuer Circle secures Major Payment Institution (MPI) license in Singapore",
    "url": "https://www.cryptopolitan.com/circle-secures-major-payment-institution-license/",
    "description": "Circle Singapore, an affiliate of Circle Internet Financial, has announced the successful acquisition of its Major Payment Institution (MPI) license for digital payment token services in Singapore. The Monetary Authority of Singapore (MAS) granted the license, allowing Circle Singapore to provide various financial services, including digital payment token services and cross-border and domestic money transfers ... <a title=\"USDC issuer Circle secures Major Payment Institution (MPI) license in Singapore\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-secures-major-payment-institution-license/\" aria-label=\"More on USDC issuer Circle secures Major Payment Institution (MPI) license in Singapore\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T11:34:38.000Z",
    "title": "Pepe whales accumulate more coins, data shows ",
    "url": "https://crypto.news/pepe-whales-accumulate-more-coins-data-shows/",
    "description": "Pepe enthusiasts have taken advantage of the widespread market corrections to accumulate millions of dollars worth of the meme coin. The price of PEPE has increased by over 14% in the last 24 hours as bitcoin (BTC) and altcoins rebound.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T11:24:37.000Z",
    "title": "Aave submits proposal to launch GHO stablecoin on Ethereum",
    "url": "https://crypto.news/aave-submits-proposal-to-launch-gho-stablecoin-on-ethereum/",
    "description": "Aave has submitted a proposal to launch the GHO stablecoin on the Ethereum mainnet, marking a significant milestone for the DeFi protocol. Following rigorous testing and governance procedures, Aave aims to establish GHO as its native token. Chinese crypto reporter&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T11:30:17.000Z",
    "title": "Chainlink Bulls Must Uphold This Critical Support Line For Potential 8% Rally",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-bulls-must-uphold-this-critical-support-line-for-potential-8-rally/",
    "description": "At present, Chainlink (LINK) continues to witness further losses, with the altcoin experiencing a decline of nearly 7% in the past 24 hours. This depreciation has led LINK to touch its lowest point in several months, primarily driven by the overall weakness observed in the broader market. On the weekly chart, LINK has lost approximately 4% of its value. Although there has been a slight recovery from the nearest support, the technical analysis of LINK still suggests a bearish outlook. Demand and accumulation indicators have also declined on the chart. As Bitcoin begins to recover, moving back into the $26,000 range after a drop into the $25,000 zone, altcoins have also initiated their respective recovery processes. However, the sustainability of this recovery relies on the return of demand and buying confidence in the market. Related Reading: Ethereum Price Regains Strength But Key Downtrend Resistance Intact For LINK to experience significant price growth, it needs to surpass its overhead resistance level. Since encountering strong resistance at the critical level of $8.70, bears have dominated the market, resulting in intensified selling pressure and the breaking of significant support levels. Currently, the market capitalization of LINK remains low, indicating a lack of buyers in the market at the time of writing. Chainlink Price Analysis: One-Day Chart At the time of writing, Chainlink (LINK) was trading at $6.17. As Bitcoin rebounded to the $26,000 level, LINK also experienced a bounce from its support level of $6. The immediate overhead resistance for the altcoin was $6.36. If this resistance level is surpassed, Chainlink could potentially reach $6.70, leading to a significant rally of 8%. However, it&#8217;s worth noting that prevailing market weakness could still cause LINK to depreciate further at the time of writing. In such a scenario, a drop from the current price level would bring the coin to $6, followed by $5.60. If the bulls manage to defend the price at $5.60, it could pave the way for LINK to rise above the $7 level. The volume of LINK traded in the last session was in the red, indicating a lack of strong buying strength in the market. Technical Analysis Due to the prevailing low buying confidence, demand for Chainlink (LINK) has remained low. This is evident as the Relative Strength Index (RSI) is below the half-line, indicating that sellers are dominating the market at the time of writing. Moreover, LINK has fallen below the 20-Simple Moving Average (SMA) line, signaling a downtrend and sellers are driving the price momentum, further reinforcing the bearish sentiment in the market. In addition to other technical indicators, Chainlink (LINK) has displayed sell signals on the chart. The Moving Average Convergence Divergence (MACD) indicator, which indicates price momentum and changes, formed red histograms associated with sell signals for the altcoin. This suggests a bearish outlook for LINK. Related Reading: Aave Extends Losses But Here Are The Short Selling Targets The Directional Movement Index (DMI) also supports the downtrend, with the -DI line (orange) positioned above the +DI line (blue). Furthermore, the Average Directional Index (ADX), represented in red, moved above the 20-mark, indicating that the price trend is gaining strength. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T11:30:13.000Z",
    "title": "Avalanche (AVAX), Polkadot (DOT) and Collateral Network (COLT) – the best tokens to hold in 2023",
    "url": "https://www.crypto-news-flash.com/avalanche-avax-polkadot-dot-and-collateral-network-colt-the-best-tokens-to-hold-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=avalanche-avax-polkadot-dot-and-collateral-network-colt-the-best-tokens-to-hold-in-2023",
    "description": "<p>The crypto sphere presents a plethora of opportunities to make smart investment decisions. Avalanche (AVAX), Polkadot (DOT), and the promising newcomer, Collateral Network (COLT), are leading the pack with unique value propositions and potential for significant returns.  &#62;&#62;BUY COLT TOKENS NOW&#60;&#60; Avalanche: A Tidal Wave of Potential in DeFi and Stablecoins Within the dynamic cryptocurrency [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/avalanche-avax-polkadot-dot-and-collateral-network-colt-the-best-tokens-to-hold-in-2023/\">Avalanche (AVAX), Polkadot (DOT) and Collateral Network (COLT) &#8211; the best tokens to hold in 2023</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T11:16:26.000Z",
    "title": "Cardano Foundation Asserts ADA’s Non-Security Status, Vigorously Defends Position to SEC Chair Gary Gensler",
    "url": "https://www.crypto-news-flash.com/cardano-foundation-asserts-adas-non-security-status-vigorously-defends-position-to-sec-chair-gary-gensler/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-foundation-asserts-adas-non-security-status-vigorously-defends-position-to-sec-chair-gary-gensler",
    "description": "<p>According to Gary Gensler, the SEC chair, the agency considers &#8220;everything other than Bitcoin&#8221; as security within its jurisdiction. In a tweet, Cardano said it holds a differing perspective regarding the recent categorization of ADA as a security under the jurisdiction of U.S. law. The Securities and Exchange Commission has claimed in a lawsuit against [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cardano-foundation-asserts-adas-non-security-status-vigorously-defends-position-to-sec-chair-gary-gensler/\">Cardano Foundation Asserts ADA&#8217;s Non-Security Status, Vigorously Defends Position to SEC Chair Gary Gensler</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T11:24:00.000Z",
    "title": "Analyst Identifies Unusual COIN Trade, Hoskinson Warns Crypto Community",
    "url": "https://coinedition.com/analyst-identifies-unusual-coin-trade-hoskinson-warns-crypto-community/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Remember-that-we-all-need-to-be-protected-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Remember-that-we-all-need-to-be-protected-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Remember-that-we-all-need-to-be-protected-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Remember-that-we-all-need-to-be-protected.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The American entrepreneur and CEO of the blockchain platform Cardano, Charles Hoskinson took to Twitter earlier today to warn his 977.1k followers about “unusual trading,” in response to the crypto alert Twitter account “unusual whales.” Unusual whales shed light on a recent “unusual” trade of Coinbase’s token COIN, in which a whale newly opened weekly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-identifies-unusual-coin-trade-hoskinson-warns-crypto-community/\">Analyst Identifies Unusual COIN Trade, Hoskinson Warns Crypto Community</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]