[
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T07:41:56.000Z",
    "title": "Cathie Wood’s ARK sells 135k Coinbase shares as COIN hits $90",
    "url": "https://cointelegraph.com/news/coinbase-ark-invest-cathie-wood-sells-135k-coinbase-shares-as-coin-hits-90",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/f8fc3411-c088-4304-af78-a5ae5f9c087b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cathie Wood is taking profits from ARK Invest's Coinbase holdings by selling a small portion of its COIN stash.</p>\n                    <p><p>Pro-Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Investment veteran <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood]\">Cathie Wood</a> is taking some profits from ARK Invest's large Coinbase (COIN) holdings by selling a small portion of its COIN stash.</p><p>On July 11, Wood’s investment firm ARK offloaded 135,152 Coinbase shares ($12 million) from one of its major exchange-traded funds, the ARK Innovation ETF (ARKK). According to the trade notification seen by Cointelegraph, the amount that was sold made up 0.14% of the total holdings of the fund.</p><p>The sale comes as the Coinbase stock price has been seeing a sharp increase. On July 11, COIN briefly <a href=\"https://www.tradingview.com/symbols/NASDAQ-COIN/\" target=\"_blank\" rel=\"noopener nofollow\">surpassed</a> $90, surging from around $82 to as high as $90.9, according to data from TradingView. Following Wood’s sale, the stock closed at $89 on Tuesday.</p><p>According to TradingView data, Coinbase stock is up more than 60% over the past month, while the year-to-date increase is more than 140%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2a85ce58-dd70-44aa-b307-6eed58de4503.png\"  /><figcaption style=\"text-align: center;\"><em>Coinbase (COIN) 7-day price chart. Source: TradingView</em></figcaption></figure><p>The new COIN sale by ARK is the second time Wood has taken profits from Coinbase shares this year. On March 21, <a href=\"https://cointelegraph.com/news/cathie-wood-s-ark-sells-coinbase-stock-for-the-first-time-in-2023\">ARK sold 160,887 Coinbase shares</a> from its ARK Fintech Innovation ETF (ARKF) for $13.5 million, or at roughly $84 per share.</p><p>Before taking the fresh profits from ARK’s COIN holdings, Wood has been actively accumulating Coinbase stock in multiple ARK’s funds. In June alone, <a href=\"https://cointelegraph.com/news/cathie-wood-ark-invest-buys-block-inc-shares-etf\">ARK purchased about $40 million</a> in Coinbase shares. Previously, the investment firm bought around $33 million in Coinbase shares in May and April, as well as $117 million worth of Coinbase shares in March.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-was-aware-of-securities-law-violations-the-sec-claims\"><strong><em>Coinbase was aware of securities law violations, SEC claims in letter</em></strong></a></p><p>Multiple Coinbase executives, including CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/brian-armstrong\">Brian Armstrong</a>, have been selling their shares as Coinbase shares rallied over the past months. On July 6, Armstrong and several other senior Coinbase execs <a href=\"https://cointelegraph.com/news/coinbase-shares-up-50-since-sec-sued-exchange\">sold a combined total of 88,058 shares</a> worth about $6.9 million at the time. Previously, Coinbase chief accounting officer Jennifer Jones also offloaded 74,375 Coinbase shares on June 29, netting $5.2 million.</p><p>The rise of Coinbase stock comes despite the exchange facing a securities violation lawsuit from the United States Securities and Exchange Commission. The growth is apparently largely attributed to the fear of missing out (FOMO) around the <a href=\"https://cointelegraph.com/news/blackrock-etf-validates-bitcoin-grayscale-ceo-sonnenshein\">BlackRock Bitcoin ETF</a>, which <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">named Coinbase</a> as “surveillance-sharing” partner.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/coinbase-ark-invest-cathie-wood-sells-135k-coinbase-shares-as-coin-hits-90&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong><strong><em></em></strong><strong><em></em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T07:41:00.000Z",
    "title": "FTX Claims Portal Goes Dark Shortly After Launch",
    "url": "https://cryptodaily.co.uk/2023/07/ftx-claims-portal-goes-dark-shortly-after-launch",
    "description": "<p>Failed cryptocurrency exchange FTX recently launched its claims portal, allowing users from around the world to file a claim.&nbsp;</p>\n<p>However, the portal stayed live for around an hour before going offline for unknown reasons, leaving users in the lurch.&nbsp;</p>\nClaims Portal Goes Live\n<p>According to users on social media, the FTX claims portal went live on the 11th of July, with the page stating that users have until the 29th of September to submit their respective claims.&nbsp;</p>\n\n<p>&ldquo;Except as otherwise provided herein, all persons and entities, (including, without limitation, individuals, partnerships, corporations, joint ventures, and trusts) that assert a Customer Claim against any of the Debtors which arose on or prior to the Petition Date must file a proof of such claim so that it is actually received by Kroll Restructuring Administration LLC, the Debtors&rsquo; noticing and claims agent (the &ldquo;Claims Agent&rdquo;), on or before 4:00 p.m. (Eastern Time) on the 29th of September, 2023 (the &ldquo;Customer Bar Date&rdquo;).&rdquo;</p>\n\n<p>The claims portal allowed customers of the bankrupt exchange to access their account information, following which they could file a petition which would be included in FTX&rsquo;s Chapter 11 bankruptcy proceedings. The claims portal is for those customers who had accounts with FTX.com, FTX.us, Blockfolio, FTX EU, FTX JP, and cryptocurrency exchange Liquid.&nbsp;</p>\n<p>According to instructions available on the claims portal when it was online, customers would be redirected to the Kroll Restructuring Administration platform, where they would have to confirm their balances and submit an electronic proof of claim.&nbsp;</p>\n\n<p>&ldquo;You will be directed to the Kroll Restructuring Administration platform to confirm your balances as of the Petition Date and, if necessary, submit an electronic proof of claim.&rdquo;</p>\n\nAnd Then Goes Offline&nbsp;\n<p>However, barely an hour after it went online, the claims portal went offline for unknown reasons, leaving users dumbfounded. Before it went offline, the claims portal stated that users would be able to access their account balances as they were on the 11th of November, which was the day the FTX exchange filed for bankruptcy. However, users still have the option of filing their proof-of-claim through US mail and Kroll&rsquo;s online customer form. At the time of writing this report, the claims portal is still offline.&nbsp;</p>\n<p>The debtors&rsquo; party to the FTX bankruptcy case had announced in June that they were planning to launch a claims portal to handle customer claims and stated they would announce when the portal goes live.&nbsp;</p>\n\n<p>&ldquo;The FTX Debtors&rsquo; &ldquo;Customer Bar Date&rdquo; has been set for the 29th of September, 2023, at 4 p.m. ET. To streamline the process for customers, the FTX Debtors are finalizing an online claims portal at https://claims.ftx.com. FTX Debtors will announce when the portal is active.&rdquo;</p>\n\nThe FTX Collapse&nbsp;\n<p>FTX was one of the most prominent cryptocurrency exchanges and suffered a spectacular collapse in November 2022, filing for Chapter 11 bankruptcy. The exchange suffered a crippling liquidity crisis at the time, as fearful customers pulled an estimated $6 billion from the exchange amidst concerns that their assets were at risk. The news that the FTX exchange and its sister concern Alameda Research had been sharing their assets in a bid to boost their balance sheets only served to hasten the collapse.&nbsp;</p>\n<p>The bankruptcy proceedings are currently ongoing in a Delaware court. Meanwhile, Sam Bankman-Fried&rsquo;s trial for allegations of fraud is set to begin in October, with the former CEO set to be tried on 8 criminal charges for now. FTX is estimated to owe its creditors over $3 billion, with prosecutors alleging that Bankman-Fried co-mingled customer assets and misled investors about FTX&rsquo;s risk management strategies and practices.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T08:00:00.000Z",
    "title": "Nasdaq Explores the Power of Generative AI, Seeks AI Acceptance Among Employees",
    "url": "https://www.cryptopolitan.com/nasdaq-explores-ai-seeks-ai-acceptance/",
    "description": "In the wake of more advanced artificial intelligence (AI) capabilities, Nasdaq, the global stock exchange operator and technology provider, is witnessing a divergence in AI acceptance among its workforce. While engineers and marketers eagerly embrace this emerging technology&#8217;s potential, lawyers are more cautious, according to Brad Peterson, Nasdaq&#8217;s Chief Technology and Chief Information Officer. This ... <a title=\"Nasdaq Explores the Power of Generative AI, Seeks AI Acceptance Among Employees\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nasdaq-explores-ai-seeks-ai-acceptance/\" aria-label=\"More on Nasdaq Explores the Power of Generative AI, Seeks AI Acceptance Among Employees\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T07:56:19.000Z",
    "title": "Bored Apes Yacht Club Revolutionizes NFT Verification with Cutting-Edge On-Chain Tool",
    "url": "https://www.cryptopolitan.com/bored-apes-yacht-club-nft-verification/",
    "description": "In an exciting development for the Bored Ape Yacht Club (BAYC), one of the most popular NFT collections, the team has announced the upcoming launch of &#8220;Made by Apes,&#8221; an on-chain intellectual property (IP) verification tool. Developed in partnership with SaaSy Labs, this tool aims to provide a seamless solution for BAYC members to verify ... <a title=\"Bored Apes Yacht Club Revolutionizes NFT Verification with Cutting-Edge On-Chain Tool\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bored-apes-yacht-club-nft-verification/\" aria-label=\"More on Bored Apes Yacht Club Revolutionizes NFT Verification with Cutting-Edge On-Chain Tool\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-12T07:50:04.000Z",
    "title": "Bitcoin Hodlers Bullish Accumulation, Is the Bullrun Close?",
    "url": "https://nulltx.com/bitcoin-hodlers-bullish-accumulation-is-the-bullrun-close/",
    "description": "The ongoing regime of accumulation among Bitcoin HODLers, characterized by a consistent absorption of coins at a rate of +27.1K BTC per month since July 2021, suggests a bullish sentiment in the market. HODLers are individuals or entities that hold onto their Bitcoin investments for an extended period rather than engaging in frequent trading. Their [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T07:40:30.000Z",
    "title": "Bitcoin Market Braces For CPI Figures: Will BTC Rally Or Retreat Today?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-braces-cpi-figures-btc-rally-or-retreat-today/",
    "description": "As the highly anticipated US Consumer Price Index (CPI) data for June is set to be released today at 8:30 am EST, the Bitcoin (BTC) market finds itself at a crucial crossroads. With inflation concerns lingering and the Federal Reserve&#8217;s next moves under scrutiny, market participants eagerly await the impact of the CPI figures on BTC&#8217;s price trajectory. The expectations are as follows: Headline y/y at 3.1% (last 4.0%) Headline m/m at 0.3% (last 0.1%) Core CPI y/y of 5.0% (last 5.3%) Core CPI m/m of 0.3% (last 0.4%) The Fed&#8217;s Battle Against Inflation In recent months, inflationary pressures have been a cause for concern, capturing the attention of investors and economists alike. While headline inflation is cooling off fast and expected to fall further to 3.1% (from 4.0% in May), it is the core CPI, which excludes volatile food and energy prices, that has become increasingly important. In recent public appearances, members of the Federal Reserve (Fed) have maintained a hawkish stance and expressed concerns about a potential resurgence of inflation regarding the elevated core inflation. The underlying concern stems from the fact that inflation has primarily declined due to resolving supply chain problems, while core inflation remains elevated. Related Reading: Bitcoin And Crypto Investors Must Monitor The DXY: 6x Rally Ahead? The rise in wages could contribute to a cycle of increasing sticky core inflation. Although core CPI was at 5.3% in May, experts now anticipate a gradual decline to 5.0% in June. While this is progress, it shows how sticky core inflation currently remains. An unexpectedly sharp drop would therefore be extremely bullish. Any number below expectation could lead to a rally in the Bitcoin and cryptocurrency markets, as Christopher Inks, renowned trader and psychology coach, tweeted: CPI will be released with a large expected drop from 4% last time to 3.1% expected this time around for the headline number. If core CPI comes in below 5%, that would be huge, and you better hold onto your britches. Will used car sales send core down much greater than expected? A surprise in core inflation could have a significant impact on the next rate hike decision by the Fed. The next FOMC meeting is on July 26. At the moment, the CME FedWatch tool predicts with 92.4% a 25 bps rate hike which is holding back the markets. This probability is likely to drop massively if the core CPI surprises to the downside. Related Reading: Bitcoin At Mid-Cycle Point: Historical Pattern Repeating Itself? As usual, JP Morgan has drawn up a game plan for the S&#38;P 500 in view of today&#8217;s release of the Consumer Price Index. According to the banking giant, a drop in the CPI to 3%-3.2% has the highest probability at 45%. The S&#38;P 500 could then gain between 0.5-0.75%. The second-highest probability is given by JP Morgan to a drop in the headline CPI to 2.8% to 2.9% (25%). In this case, the S&#38;P 500 could rise by 1.5-1.75%. Moreover, the banking giant gives a 10% chance to a fall of the CPI to 2.7% or lower, while a surpassing of the forecasted reading (above 3.3%) is just at 20%. Potential Scenarios For Bitcoin If the CPI figures come in higher than expected, signaling elevated inflationary pressures, BTC could face a temporary retreat. In the case of CPI falling within the predicted range, BTC&#8217;s response may be moderate. Investors will closely monitor the data for signs of sustained inflation, potentially resulting in a slight dip in Bitcoin&#8217;s price. A lower-than-anticipated CPI figure, suggesting easing inflationary pressures, could ignite a bullish rally in BTC. Investors may perceive this as a positive signal which is signaling a continued rate pause by the Fed. A lower-than-expected core CPI reading has the potential to provide a much-needed boost for Bitcoin. At press time, the Bitcoin price has managed to break above the mid-range resistance, trading at $30,767. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T08:07:59.000Z",
    "title": "Dogecoin Emerges as a Potential Native Currency for Twitter Rival Threads; Surging Platform Hits 100M Users in a Single Week – Can DOGE Price Hit $0.15?",
    "url": "https://www.crypto-news-flash.com/dogecoin-emerges-as-a-potential-native-currency-for-twitter-rival-threads-surging-platform-hits-100m-users-in-a-single-week-can-doge-price-hit-0-15/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-emerges-as-a-potential-native-currency-for-twitter-rival-threads-surging-platform-hits-100m-users-in-a-single-week-can-doge-price-hit-0-15",
    "description": "<img width=\"512\" height=\"356\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T130722.014.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T130722.014.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T130722.014-300x209.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Mark Zuckerberg&#8217;s Thread is said to have copied Twitter&#8217;s features and is speculated to make Dogecoin a native currency. In response, Dogecoin has recorded a current bullish market sentiment with 24-hour positive growth but is still struggling to turn its weekly fall around.  Twitter was most likely to integrate Dogecoin (DOGE) as a native currency [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T08:00:09.000Z",
    "title": "Bitcoin Price Soars to New Heights And InQubeta Presale Rallies",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-soars-to-new-heights-and-inqubeta-presale-rallies/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-soars-to-new-heights-and-inqubeta-presale-rallies",
    "description": "<img width=\"512\" height=\"228\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-94.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-94.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-94-300x134.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market is experiencing a resurgence, with Bitcoin leading the way to new heights. As the world&#8217;s largest cryptocurrency shows signs of recovery, investors are once again turning their attention to the potential of digital assets. Let’s explore Bitcoin&#8217;s recent price surge and the significant milestones achieved by the InQubeta presale, highlighting the promising [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T07:46:31.000Z",
    "title": "BREAKING: FTX Launches Customer Claims Portal: Global Creditors Can Seek Compensation in Bankruptcy Proceedings",
    "url": "https://www.crypto-news-flash.com/breaking-ftx-launches-customer-claims-portal-global-creditors-can-seek-compensation-in-bankruptcy-proceedings/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-ftx-launches-customer-claims-portal-global-creditors-can-seek-compensation-in-bankruptcy-proceedings",
    "description": "<img width=\"1200\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-1024x513.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-768x385.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The new FTX &#8220;claim portal&#8221; will allow individual clients to access their account information and register for their claims. Before filing for claims, users will need to undergo necessary checks through the Kroll Restructuring Administration platform. Bankrupt cryptocurrency exchange FTX has recently launched a &#8220;Claim portal&#8221; for all its affected users. This is an effort [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T08:05:37.000Z",
    "title": "MATIC, BNB See Trading Volumes Rise: Intelligence Firm",
    "url": "https://coinedition.com/matic-bnb-see-trading-volumes-rise-intelligence-firm/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/📈_As_trading_volume_fluctuates_back_to_altcoins_two_assets_are-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain intelligence firm Santiment revealed in a tweet earlier today that Polygon (MATIC) and Binance Coin (BNB) have seen their trading volumes increase significantly over the past few weeks. According to the post, the overall altcoin market has seen its trading volume increase as Bitcoin (BTC) struggled to break above the $31K barrier. At [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/matic-bnb-see-trading-volumes-rise-intelligence-firm/\">MATIC, BNB See Trading Volumes Rise: Intelligence Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T07:42:33.000Z",
    "title": "Binance US Denies BCH FUD: Crypto Influencer Seeks Proof",
    "url": "https://coinedition.com/binance-us-denies-bch-fud-crypto-influencer-seeks-proof/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance US $1 Billion Voyager Acquisition\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Binance-US-1-Billion-Voyager-Acquisition-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Adam Cochran, founder of the activist venture capital firm Cinneamhain Ventures (CEHV), raised concerns against Binance.US and its CEO Brian Shroder. While the platform attempted to clarify the prevailing ambiguities regarding Bitcoin Cash (BCH) FUD, Cochran questioned the long silence of the company’s CEO for the past five months. Yesterday, the US wing of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-us-denies-bch-fud-crypto-influencer-seeks-proof/\">Binance US Denies BCH FUD: Crypto Influencer Seeks Proof</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]