[
  {
    "source": "CryptoSlate",
    "date": "2024-01-17T18:54:36.000Z",
    "title": "Zero-Knowledge infrastructure can secure ‘trillions’ in institutional money in 2024: Interview Polygon Labs",
    "url": "https://cryptoslate.com/zero-knowledge-infrastructure-can-secure-trillions-in-institutional-money-in-2024-interview-polygon-labs/",
    "description": "<p>In an exclusive interview with Colin Butler, Global Head of Institutional Capital at Polygon Labs, Butler brings a unique and informed perspective to the table, discussing various pivotal aspects shaping the future of blockchain and cryptocurrency. This interview explores the impact of traditional financial instruments like ETFs on the crypto market, the significant strides made [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/zero-knowledge-infrastructure-can-secure-trillions-in-institutional-money-in-2024-interview-polygon-labs/\">Zero-Knowledge infrastructure can secure &#8216;trillions&#8217; in institutional money in 2024: Interview Polygon Labs</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T18:47:23.000Z",
    "title": "Top 3 Cryptocurrencies to Watch This Week",
    "url": "https://cryptodaily.co.uk/2024/01/top-3-cryptocurrencies-to-watch-this-week",
    "description": "Explore this week's dynamic cryptocurrency market trends, including Bitcoin's ETF surge, Ethereum's significant growth, Solana's technological innovations, and Ripple's legal confrontations with the SEC. Discover how these factors, along with XRP's steady market performance, are shaping the evolving landscape of digital assets."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T18:42:59.000Z",
    "title": "DeSo-Backed SocialFi App Focus raises $20 Million in under 24 hours",
    "url": "https://cryptodaily.co.uk/2024/01/deso-backed-socialfi-app-focus-raises-20-million-in-under-24-hours",
    "description": "DeSo-Backed SocialFi App Focus raises $20 Million in under 24 hours"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T19:06:29.000Z",
    "title": "ApeCoin rises over 11% following announcement of new game edition",
    "url": "https://crypto.news/apecoin-rises-over-11-following-launch-of-new-game-edition/",
    "description": "ApeCoin, associated with Yuga Labs' Bored Ape Yacht Club, witnessed a surge of 11% in value after announcing a publicly accessible edition of the game Dookey Dash."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T19:05:48.000Z",
    "title": "Parabolic Bitcoin Indicator Points To Continued Bull Run Despite 15% Crash",
    "url": "https://www.newsbtc.com/all/parabolic-bitcoin-indicator-bull-run-despite-15-crash/",
    "description": "Recently, Bitcoin experienced a significant drop, crashing 15% from its 2024 highs around $49,000. This decline followed closely on the heels of the approval of 11 spot Bitcoin Exchange-Traded Funds (ETFs), a move that was initially met with optimism in the crypto community. The sudden downturn has left investors and traders analyzing the charts for clues about Bitcoin&#8217;s next move. Is The Bullish Bitcoin Trend Over? In the wake of this decline, technical analysis offers a beacon of insight. Notably, the correction was marked by a bearish engulfing candle on the daily chart, signaling a potential reversal in Bitcoin&#8217;s upward trend. Accompanying this was a nasty wick – a long upper shadow on the candlestick chart, indicating a significant sell-off after prices peaked. Further complicating the landscape was the opening of the CME BTC Futures with a sizeable gap down. Such gaps are often viewed as potential resistance levels, reinforcing the bearish sentiment. The Parabolic SAR remains below price action &#124; BTCUSD on TradingView.com Stop And Reverse: A Ray Of Hope However, amidst these seemingly negative signals, a ray of hope shines through from a &#8220;parabolic&#8221; technical indicator – the Parabolic SAR (Stop and Reverse). Despite the tumultuous market conditions, the weekly BTCUSD Parabolic SAR indicator remains untagged, suggesting that the long-term uptrend is still intact. This indicator, known for its effectiveness in identifying potential reversals in the market’s direction, paints a different picture from the immediate bearish signals and sentiment. What Is The Parabolic SAR? To fully grasp the significance of the Parabolic SAR in this context, it&#8217;s essential to understand what it is and how it functions. The Parabolic SAR is a popular technical analysis tool used primarily to determine the direction of an asset&#8217;s momentum and to provide entry and exit points. The &#8216;SAR&#8217; in Parabolic SAR stands for &#8216;Stop and Reverse.&#8217; This indicator is represented on charts as a series of dots placed either above or below the price bars. A dot placed below the price is viewed as a bullish signal, while a dot above is bearish. Related Reading: Bitcoin News Catalyst: Could ETF Hype Cause BTC Price To Double? The unique aspect of the Parabolic SAR is its ability to act as a trailing stop loss. As the price of an asset moves, the Parabolic SAR adjusts, moving closer to the price line. This adjustment provides a dynamic method for traders to manage their positions, securing profits while limiting potential losses. In the context of Bitcoin&#8217;s current situation, the Parabolic SAR&#8217;s position – still below the price bars on the weekly chart – suggests that the long-term bullish trend is not yet disrupted. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T19:00:31.000Z",
    "title": "Here Are The Most Bullish Predictions For ETH Price As Ethereum Dominance Rises Against Bitcoin",
    "url": "https://www.newsbtc.com/news/ethereum/predictions-eth-price-ethereum/",
    "description": "The sentiments around Ethereum look to be very bullish at the moment as the second-largest crypto token by market cap has seen its dominance surge against Bitcoin. Ethereum’s rise against the flagship crypto token is also significant, as crypto analyst Jaydee recently suggested that it could usher in the altcoin season.  Bullish Predictions For Ethereum’s Price Crypto analyst Ali Martinez recently highlighted the fact that Ethereum broke out from an ascending triangle on the weekly chart. According to him, the crypto token has its eyes on the $3,400 price level despite the short-term volatility. Backing Ali’s analysis, crypto analyst Mayne shared their belief that $3,400 remains a viable target for ETH’s price. Related Reading: Analyst Predicts Cardano Future Using Historic Trends, And It’s Very Bullish Interestingly, Mayne hinted that “ETH betas” could run alongside ETH when this significant price surge begins to happen. These ETH betas include tokens like the native tokens of Ethereum’s layer-2 networks Optimism and Arbitrum.  Crypto analyst Ash Crypto also offered a bullish prediction for ETH’s price while commenting on the state of the market. He remarked that money was currently flowing from Bitcoin to Ethereum and that it shouldn’t be long before the latter trades above $3,200.  ETH trading above the $3,000 price level looks to be the consensus going by these predictions. The CEO and founder of MN Trading, Michaël van de Poppe, had before now suggested that ETH was also going to rise above $3,000 on its way to $3,500. Then, Poppe boldly claimed that this price prediction would materialize in the first quarter of 2024. Meanwhile, crypto analyst ColdBloodedShill stated in a recent X post that ETH is likely planning for higher prices as long as it remains above $2,400. The $2,400 price range looks to be an important support level as ETH looks to break out. Crypto analyst Bluntz Capital also highlighted that price range ($2,495 specifically) as he noted that there will be an eventual breakout as long as ETH holds above that level.  ETH bulls struggle at $2,500 &#124; Source: ETHUSD on Tradingview.com Conviction On Ethereum Getting Stronger Market intelligence platform Santiment recently revealed that the number of new ETH addresses is on the rise as Ethereum continues to outperform Bitcoin. 89.4 thousand addresses are said to have been created daily during this stretch. This represents a significant increase from late last year, when 70.4 addresses were created daily in early November. Related Reading: Institutional Inflows Into XRP Surges 244% Amid ETF Speculation Santiment also added that ETH’s supply on exchanges had reduced drastically to 8.10%, almost getting close to its all-time low (since the opening week of trading) of 8.05%. Such a development usually suggests that ETH holders are looking to hold for the long term as they move their holdings to self-custody. Featured image from TechRadar, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-17T19:00:04.000Z",
    "title": "Can Solana Meme MYRO Continue to Climb?",
    "url": "https://www.crypto-news-flash.com/can-solana-meme-myro-continue-to-climb/?utm_source=rss&utm_medium=rss&utm_campaign=can-solana-meme-myro-continue-to-climb",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/solana.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/solana-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/solana-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/solana-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Solana ecosystem prepares for the next bull run, with another meme coin set to explode. Myro is surging past expectations as its market capitalization and coin price surge. NuggetRush is on the rise with an exciting gamification offering on the blockchain. As the year progresses and the crypto market unfolds, investors seek meme coins [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-17T18:59:37.000Z",
    "title": "Cardano Welcomes BUILD.5 and NMKR Partnership, Supercharging Asset Tokenization",
    "url": "https://www.crypto-news-flash.com/cardano-welcomes-build-5-and-nmkr-partnership-supercharging-asset-tokenization/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-welcomes-build-5-and-nmkr-partnership-supercharging-asset-tokenization",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano-ADA-black-logo-on-a-background-of-connected-white-lights\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Cardano-ADA-black-logo-on-a-background-of-connected-white-lights-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />According to a recent announcement, BUILD.5 has partnered with NMKR to add Cardano Tokenized assets to its enterprise platform.  The report also discloses that the partnership would cause the expansion of the digital twin capabilities to the Cardano blockchain.  Cardano Tokenized assets are to be added to the BUILD.5 enterprise platform after a partnership between [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-17T18:49:22.000Z",
    "title": "Former FTX Customers Fight for Fair Repayment in Cryptocurrency Boom",
    "url": "https://www.crypto-news-flash.com/former-ftx-customers-fight-for-fair-repayment-in-cryptocurrency-boom-2/?utm_source=rss&utm_medium=rss&utm_campaign=former-ftx-customers-fight-for-fair-repayment-in-cryptocurrency-boom-2",
    "description": "The FTX debtors filed to repay the creditors in the same value as the time of collapse, which could deny them the notable gains made in 2023. The distressed crypto exchange is close to the final restructuring process that ensures an imminent relaunch in order to fully repay creditors and customers. The distressed FTX customers [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-17T19:05:23.000Z",
    "title": "Crypto Analyst Predicts Over 25% Surge for Chainlink, Says One Under-the-Radar Altcoin Could Be Undervalued",
    "url": "https://dailyhodl.com/2024/01/17/crypto-analyst-predicts-over-25-surge-for-chainlink-says-one-under-the-radar-altcoin-could-be-undervalued/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/chainlink-gearing-up.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely filled crypto analyst is predicting a 25% upswing for decentralized oracle provider Chainlink (LINK) while updating his outlook on decentralized crypto exchange (DEX) SushiSwap (SUSHI). In a new thread, crypto strategist Ali Martinez tells his 40,800 followers on the social media platform X that the path appears clear for LINK to skyrocket to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/17/crypto-analyst-predicts-over-25-surge-for-chainlink-says-one-under-the-radar-altcoin-could-be-undervalued/\">Crypto Analyst Predicts Over 25% Surge for Chainlink, Says One Under-the-Radar Altcoin Could Be Undervalued</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]