[
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T03:00:17.000Z",
    "title": "Perplexity AI secures $73.6M in Series B funding, boosts valuation to $520M",
    "url": "https://cryptoslate.com/perplexity-ai-secures-73-6m-in-series-b-funding-boosts-valuation-to-520m/",
    "description": "<p>Perplexity AI, a San Francisco-based startup specializing in AI-powered search engines, recently completed a significant Series B funding round, raising $73.6 million. The funding round was led by Institutional Venture Partners (IVP) and included a mix of venture capitalists and tech luminaries like Jeff Bezos, NVIDIA, and others. The successful funding effort has brought Perplexity [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/perplexity-ai-secures-73-6m-in-series-b-funding-boosts-valuation-to-520m/\">Perplexity AI secures $73.6M in Series B funding, boosts valuation to $520M</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-05T03:00:52.000Z",
    "title": "Kevin O’Leary Anticipates Strong Institutional Interest in Crypto Regardless of Spot Bitcoin ETF Outcome",
    "url": "https://news.bitcoin.com/kevin-oleary-anticipates-strong-institutional-interest-in-crypto-regardless-of-spot-bitcoin-etf-outcome/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kevin O&#039;Leary Expects High Institutional Interest in Crypto Irrespective of Spot Bitcoin ETF Approval\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/kevin-oleary-bitcoin-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shark Tank investor Kevin O&#8217;Leary, also known as Mr. Wonderful, has emphasized that institutional interest in crypto and bitcoin will remain high regardless of the U.S. Securities and Exchange Commission (SEC)&#8217;s decision on spot bitcoin exchange-traded funds (ETFs). &#8220;Even a no decision will not change the long-term potential,&#8221; he stressed. Kevin O&#8217;Leary Discusses Impact of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T03:00:22.000Z",
    "title": "Crypto Fraud Unveiled: $1.3B Loss As Chuck Norris-Endorsed CEO Turns Out To Be Illusion",
    "url": "https://www.newsbtc.com/news/crypto-fraud-unveiled-1-3b-loss-as-chuck-norris-endorsed-ceo-turns-out-to-be-illusion/",
    "description": "In a recent investigation by The Guardian, alarming details have emerged regarding a crypto project, HyperVerse, that allegedly lost $1.3 billion of investors&#8217; funds.  The report reveals that the chief executive officer promoted by the project, supposedly backed by celebrity endorsements including Chuck Norris, appears to be absent. Investigation Exposes HyperVerse Crypto Scam HyperVerse, promoted by Australian entrepreneur Sam Lee and his business partner Ryan Xu, founders of the now-collapsed Australian Bitcoin (BTC) company Blockchain Global, has been scrutinized for its deceptive practices. The project attracted thousands of investors, who ultimately lost millions of dollars. The investigation raises concerns about the legitimacy of HyperVerse&#8217;s CEO, as the qualifications and credentials attributed to the supposed chief executive, Steven Reece Lewis, have no basis.  Related Reading: XRP Price Set To Spike As Ripple Enters Another $1.5 Trillion Industry Promotional material released for HyperVerse claimed that Lewis graduated from the University of Leeds and held a master&#8217;s degree from the University of Cambridge. However, neither institution has any record of his existence. Furthermore, there are no records of Lewis on the UK companies register, Companies House, or the US Securities and Exchange Commission (SEC). Interestingly, Adobe, a publicly listed company, also has no record of any acquisition involving a company owned by “Steven Reece Lewis.” The report indicates that HyperVerse managed to secure celebrity endorsements, including video messages of support from Steve Wozniak, co-founder of Apple, and actor Chuck Norris.  However, it is unclear how these messages were obtained, as all four celebrities mentioned in the report are available for hire through Cameo, where individuals can pay to have high-profile individuals read scripted messages. Australian Authorities Under Fire The investigation also highlights regulatory concerns, as HyperVerse operated without significant scrutiny in Australia despite being flagged by regulators overseas as a possible scam or suspected pyramid scheme.  The Australian Securities and Investments Commission (ASIC) has been referred to the case but has not yet taken action. Investors in HyperVerse were lured with promises of substantial returns and the opportunity to explore a new digital metaverse similar to Facebook. However, the scheme ultimately resulted in significant losses for investors, estimated at $1.3 billion in 2022, according to blockchain analysts Chainalysis. Related Reading: Crypto Analyst Predicts Cardano Price Jump In January – Here’s The Target The Guardian&#8217;s findings shed light on the deceptive practices employed by HyperVerse and raise questions about the responsibilities of regulators in overseeing such projects.  As the aftermath of this cryptocurrency scandal unfolds, investors and authorities alike are left grappling with the consequences of a scheme that capitalized on false claims and celebrity endorsements to defraud unsuspecting individuals. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T02:57:37.000Z",
    "title": "Bitcoin Price Faces Rejection, Here’s Why Dips Could Be Attractive",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-faces-rejection-44500/",
    "description": "Bitcoin price recovered further above $43,500 but struggled near $44,500. BTC is correcting gains and might test the $42,150 support zone. Bitcoin recovered above the $43,500 resistance and remained in a positive zone. The price is trading below $44,000 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $44,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could decline toward the $42,150 and $42,000 support levels. Bitcoin Price Holds Support Bitcoin price started a recovery wave above the $43,200 resistance zone. BTC even broke the $43,500 resistance zone to move further into a positive zone. There was a decent upward move, but the bears were active near the $44,500 resistance zone. It faced rejection near the 76.4% Fib retracement level of the downward move from the $45,913 swing high to the $39,500 low. A high was formed near $44,784 and the price is now correcting gains. There was a move below the $44,000 level. The price traded below the 23.6% Fib retracement level of the upward move from the $39,501 swing low to the $44,784 high. Bitcoin is now trading below $44,000 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $44,000 level. The first major resistance is $44,400. There is also a key bearish trend line forming with resistance near $44,400 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com A close above the $44,400 level could send the price further higher. The next major resistance sits at $45,500. Any more gains above the $45,500 level could open the doors for a move toward the $46,000 level. Fresh Decline In BTC? If Bitcoin fails to rise above the $44,400 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $42,800 level. The next major support is near $42,150 or the 50% Fib retracement level of the upward move from the $39,501 swing low to the $44,784 high. If there is a move below $41,150, the price could gain bearish momentum. In the stated case, the price could drop toward the $40,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $42,800, followed by $42,150. Major Resistance Levels – $43,800, $44,000, and $44,400."
  }
]