[
  {
    "source": "CoinDesk",
    "date": "2023-08-15T12:00:00.000Z",
    "title": "Sei Mainnet is Live After Testnet Sees More Than 7.5M Wallets Created",
    "url": "https://www.coindesk.com/markets/2023/08/15/sei-mainnet-is-live-after-testnet-sees-more-than-75m-wallets-created/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The trading focused layer 1 blockchain is backed by Jump Crypto and Flow Traders."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-15T11:42:08.000Z",
    "title": "Singapore's Central Bank Releases Stablecoin Regulatory Framework",
    "url": "https://www.coindesk.com/policy/2023/08/15/singapores-central-bank-releases-stablecoin-regulatory-framework/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Stablecoins must hold minimum base capital 1 million Singapore dollars ($740,000) and provide redemption within no more than five business days of a request."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T11:45:00.000Z",
    "title": "Singapore Releases Revised Regulatory Framework For Stablecoins",
    "url": "https://cryptodaily.co.uk/2023/08/singapore-releases-revised-regulatory-framework-for-stablecoins",
    "description": "<p>Singapore&rsquo;s central bank has announced the release of a revised regulatory framework to ensure stability for single-currency stablecoins regulated in the city-state.&nbsp;</p>\n<p>The framework outlines requirements that issuers need to meet to be deemed as regulated by the monetary authority of Singapore.&nbsp;</p>\nBetter Regulatory Clarity&nbsp;\n<p>The revised framework was announced on the 15th of August and is primarily aimed at non-bank issued stablecoins that are pegged to the value of the Singapore Dollar, or G10 currencies, including the British Pound, Euro, and the United States Dollar, and whose circulation is greater than 5 million Singapore Dollars. The Monetary Authority of Singapore stated,&nbsp;</p>\n\n<p>&ldquo;Stablecoins are digital payment tokens designed to maintain a constant value against one or more specified fiat currencies. When well-regulated to preserve such value stability, stablecoins can serve as a trusted medium of exchange to support innovation, including the &ldquo;on-chain&rdquo; purchase and sale of digital assets. MAS&rsquo; stablecoin regulatory framework will apply to single-currency stablecoins (SCS) pegged to the Singapore Dollar or any G10 currency that is issued in Singapore.&rdquo;</p>\n\n<p>According to the Singapore central bank&rsquo;s financial supervision deputy managing director, Ho Hern Shin, the framework helps to establish and facilitate stablecoin use as a credible digital medium of exchange and a bridge between the traditional and digital currency ecosystems. Shin also urged stablecoin issuers to prepare for compliance if they wished for their stablecoin to be labeled as regulated by the Monetary Authority of Singapore.&nbsp;</p>\nDetails Of The Framework&nbsp;\n<p>The revised regulatory framework lists several requirements for stablecoin issuers. These include redemption timelines, reserve management, disclosures, and capital requirements. According to the MAS, reserve assets will be subject to requirements depending on their valuation, composition, custody, and audit. Stablecoin issuers will also have to maintain a minimum base capital and liquid assets to stave off any risk of insolvency. Stablecoin issuers will also be required to return the par value of the stablecoins to holders within five business days following a redemption request.&nbsp;</p>\n<p>The Monetary Authority of Singapore also observed that only those issuers who could fulfill the revised requirements could apply to be regulated by the MAS. According to the country&rsquo;s central bank, this label would help distinguish regulated stablecoins from non-regulated ones in the market. It also warned that those representing a token or stablecoin to be certified by the Monetary Authority of Singapore would also be subject to penalties defined in the new framework. The penalties include prison time, fines, as well as the addition on an alert list.&nbsp;</p>\nAttempts At Regulating Stablecoins\n<p>The revised framework takes into account feedback from a public consultation held in October 2022. However, the MAS will still need to hold consultations, while parliament would need to pass amendments to enforce the revised framework. The MAS highlighted the risks involved in investing in crypto last year following the collapse of the TerraUSD (UST) and Luna tokens. The United States is also looking to pass regulations regarding stablecoins. The United States House Financial Services Committee had recently proposed a bill that would establish a federal regulatory framework.&nbsp;</p>\n<p>The bill proposes that the United States Federal Reserve draw up requirements for the issuance of stablecoins while maintaining the authority of state regulators. The bill was modified after several democrats raised concerns that stablecoin issuers could simply bypass stricter federal oversight by opting to be regulated by state regulatory authorities.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T12:07:03.000Z",
    "title": "The New York Times Bars AI Vendors from Utilizing its Content",
    "url": "https://www.cryptopolitan.com/new-york-times-bars-ai-vendors/",
    "description": "In a pivotal move that has sent ripples through the artificial intelligence (AI) industry, The New York Times has recently updated its Terms of Service policy to explicitly prohibit the use of its content for training AI systems. This bold decision applies to text content, photos, videos, and metadata, and has ignited discussions about data ... <a title=\"The New York Times Bars AI Vendors from Utilizing its Content\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-york-times-bars-ai-vendors/\" aria-label=\"More on The New York Times Bars AI Vendors from Utilizing its Content\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-15T11:57:38.000Z",
    "title": "US Fed incorporates DLT for its new service",
    "url": "https://crypto.news/us-fed-incorporates-dlt-for-its-new-service/",
    "description": "The Fed has incorporated Dropp, a Hedera-based micropayments platform using DLT technology, into its recently launched FedNow service. FedNow connects financial institutions, businesses, and service providers to bolster digital payments infrastructure. Dropp is expected to facilitate low-fee payments, manage incoming&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T11:50:32.000Z",
    "title": "Low Bitcoin Volatility Mirrors 2016: A Bullish Breakout On The Horizon?",
    "url": "https://www.newsbtc.com/news/bitcoin/low-bitcoin-volatility-mirrors-2016-bullish-breakout/",
    "description": "In today’s micro update from Capriole, founder Charles Edwards presented a compelling analysis that draws parallels between the current low volatility of Bitcoin and its historical behavior in 2016. With Bitcoin&#8217;s price stagnating around the $29,000 mark, experts are closely watching for signs of a potential bullish breakout. &#8220;Bitcoin’s price remains at $29K, in a sideways consolidation that has created one of the absolute lowest volatility periods in Bitcoin’s 14 year history,&#8221; Edwards states. This prolonged period of low volatility is reminiscent of 2016, suggesting that a significant price movement could be imminent. Bitcoin Breakout Imminent? While the technicals indicate a bearish breakdown from the $30,000 mark, the absence of a downward momentum offers a glimmer of hope for bullish investors. &#8220;If price was going to collapse, we would usually have seen that follow through by now,&#8221; the report notes. However, for a more concrete bullish sentiment, &#8220;a close back above $30K on the daily timeframe is required at the minimum as a technical confirmation of a failed breakdown.&#8221; Related Reading: Bernstein Predicts Spot ETFs Could Claim 10% Of Bitcoin’s Market If Greenlit On the fundamental front, Bitcoin&#8217;s on-chain data continues to contract, albeit at a decelerating rate. The imminent decisions on several Bitcoin ETF approvals could potentially disrupt the current low volatility phase. &#8220;An approval could cause a break from the current low volatility range. Best not to pre-empt this though, as these decisions often get pushed. Confirmations are key to mitigate risk,&#8221; Edwards cautions. Diving deeper into the technicals, the report highlighted two key observations: Since 2010, Bitcoin’s historic volatility has only been lower than today in 2016. Suggesting a big price move is on the horizon when volatility expansion (reversion to the mean) occurs. Bitcoin’s $30K breakdown has (so far) failed to follow through&#8230; A close back into the Wyckoff structure at $30K would signify a failed breakdown and therefore be a very positive technical signal. BTC On-Chain Indicators Are Neutral Capriole&#8217;s Bitcoin Macro Index, a comprehensive tool that amalgamates over 40 Bitcoin on-chain, macro market, and equities metrics into a machine learning model, currently scores at -0.36, indicating &#8220;Contraction&#8221;. This suggests that while the short-term outlook remains neutral, the long-term perspective appears bullish. Remarkably, this strategy takes long-only positions in Bitcoin. In slowdowns and contractions, cash is held. &#8220;The Macro Index today remains in a period of relative value (below zero), suggesting decent long-term value for multi-year horizon investors,&#8221; the report elucidated. Related Reading: Bitcoin Price Supported By Thin $40 Million Bid Pool, But For How Long? A noteworthy addition to Capriole&#8217;s analysis toolkit is the &#8220;Bitcoin Production Cost&#8221; model, which evaluates the cost of mining a Bitcoin based on global average electrical consumption. Currently, this model indicates that Bitcoin is trading within a long-term value region, with the report speculating, &#8220;I would be surprised if this holds into 2024.&#8221; In conclusion, the analysis from Capriole paints a picture of potential long-term value amidst the current bearish technicals. Drawing parallels with 2016, the report suggests that Bitcoin&#8217;s current low volatility phase could be a precursor to a bullish breakout. &#8220;All else equal, Bitcoin is like a beach ball submerged underwater. Nonetheless, we remain in a technical breakdown. We don’t know how long that hand will hold the ball underwater for. Prudent risk-management will await a technical confirmation before acting.&#8221; With the cyclical nature of Bitcoin&#8217;s expansion and contraction cycles, only time will tell if history will indeed repeat itself; especially with the backdrop of a totally different macro environment. At press time, the BTC price remained stagnant, trading at $29,445. Featured image from André François McKenzie / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T12:08:14.000Z",
    "title": "MIOTA Price Prediction: Analyzing IOTA’s Recovery Amidst Market Volatility",
    "url": "https://www.crypto-news-flash.com/miota-price-prediction-analyzing-iotas-recovery-amidst-market-volatility/?utm_source=rss&utm_medium=rss&utm_campaign=miota-price-prediction-analyzing-iotas-recovery-amidst-market-volatility",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Stanslavs-IOTA-1-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The MIOTA price is currently trading at its support levels and 50-day EMA suggests a trend reversal anytime. On the technical chart, MIOTA has formed a Doji candle, which suggests that the correction phase could potentially be ending. As the broader cryptocurrency market enters some kind of consolidation, crypto traders have been setting up their [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T11:48:00.000Z",
    "title": "Best Meme Coins List | Complete Guide to the Top New Meme Coins of 2023",
    "url": "https://www.crypto-news-flash.com/best-meme-coins-list-complete-guide-to-the-top-new-meme-coins-of-2023/?utm_source=rss&utm_medium=rss&utm_campaign=best-meme-coins-list-complete-guide-to-the-top-new-meme-coins-of-2023",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-41.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-41.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-41-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Step into the vibrant realm of meme coins, shedding light on the trending tokens that are driving conversations in the crypto community. Curated through meticulous research and expert analysis, this guide aims to serve seasoned crypto enthusiasts and novices alike. Uncover the nuances, narratives, and potentials of meme coins. If you&#8217;ve got an itch to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T12:00:00.000Z",
    "title": "China Cracks Down on People Exploiting Filecoin Blockchain Rewards",
    "url": "https://coinedition.com/china-cracks-down-on-people-exploiting-filecoin-blockchain-rewards/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tezos Narobi Deployment Yet to Impact on XTZ Price Action\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The future of Filecoin (FIL) now hangs in the balance as China&#8217;s crackdown on fraudulent activities within the crypto space unravels. A recent local report revealed that Chinese public prosecution had leveled severe accusations against individuals allegedly involved in a complex scheme. These individuals were said to have exploited Filiecoin’s distributed ledger technology (DLT) and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/china-cracks-down-on-people-exploiting-filecoin-blockchain-rewards/\">China Cracks Down on People Exploiting Filecoin Blockchain Rewards</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T11:42:00.000Z",
    "title": "Ripple’s XRP is More Efficient Than Bitcoin and Ethereum: Analyst",
    "url": "https://coinedition.com/ripples-xrp-is-more-efficient-than-bitcoin-and-ethereum-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Nick of the Cheeky Crypto YouTube channel thinks the XRP is more efficient than several other top cryptocurrencies in executing transactions. In a recent video, Nick compared transaction costs using XRP with that of Bitcoin and Ethereum. He observed from his findings that transacting with XRP is far cheaper than using any of the two [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripples-xrp-is-more-efficient-than-bitcoin-and-ethereum-analyst/\">Ripple’s XRP is More Efficient Than Bitcoin and Ethereum: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-15T11:45:24.000Z",
    "title": "The Fed Is Done Raising Interest Rates As Inflation on Path Lower, Says Fundstrat’s Tom Lee",
    "url": "https://dailyhodl.com/2023/08/15/the-fed-is-done-raising-interest-rates-as-inflation-on-path-lower-says-fundstrats-tom-lee/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/narrative-volatility-markets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fundstrat Global Advisors managing partner Tom Lee thinks the U.S. Federal Reserve is done raising its benchmark interest rate. In a new interview with CNBC, Lee says that&#8217;s he optimistic about the market and inflation numbers. &#8220;I think [last week&#8217;s] CPI (consumer price index) report kind of shows that inflation&#8217;s on a glide path lower. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/15/the-fed-is-done-raising-interest-rates-as-inflation-on-path-lower-says-fundstrats-tom-lee/\">The Fed Is Done Raising Interest Rates As Inflation on Path Lower, Says Fundstrat’s Tom Lee</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]