[
  {
    "source": "CoinDesk",
    "date": "2023-12-08T21:10:43.000Z",
    "title": "Protocol Village: Connext, Protocol for Cross-Chain Apps, Plans Bacco Upgrade Next Week",
    "url": "https://www.coindesk.com/tech/2023/12/06/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Dec 7-Dec. 13, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-08T21:22:12.000Z",
    "title": "SOL Surges 13% as Solana NFTs Overtake Ethereum, BONK Up 26%",
    "url": "https://decrypt.co/209160/sol-surges-13-solana-nfts-overtake-ethereum-bonk-up-26",
    "description": "Solana’s resurgence isn’t slowing, with SOL and Solana-based tokens still rising and NFT sales volume ruling the wider market."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T21:30:00.000Z",
    "title": " Crypto lawyer wants to depose Changpeng Zhao for civil case ",
    "url": "https://cointelegraph.com/news/crypto-lawyer-deposition-changpeng-zhao-binance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvM2I1N2I2YmUtZGRiOC00ODVkLWIwNTctZGUxYjJmZGE0OTBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Moskowitz Law Firm, which represented many crypto investors in class-action lawsuits, cited the former Binance CEO’s “unique knowledge” of issues in calling for his deposition.</p>\n                    <p><p>Adam Moskowitz, who has been the lead attorney in a number of civil cases involving crypto firms, filed a motion to take a deposition from former Binance CEO Changpeng “CZ” Zhao.</p><p>In a Dec. 8 filing in United States District Court for the Southern District of Flordia Miami Division, Moskowitz said Zhao’s testimony would be “crucial to the claims and defenses of all parties” involved. The law firm filed the motion as part of a <a href=\"https://cointelegraph.com/news/cz-binance-influencers-face-1b-lawsuit-for-unregistered-securities-promo\">$1 billion lawsuit against Zhao</a>, Binance, and crypto influencers, which a court ordered stayed in August.</p><p>Moskowitz and his firm have represented several clients in cases against high-profile crypto firms and related entities. He was counsel for many victims of the collapse of FTX in a <a href=\"https://cointelegraph.com/news/ftx-victims-lawyers-struggle-to-serve-shaq\">lawsuit targeting celebrities</a> who promoted the crypto exchange, as well as a suit <a href=\"https://cointelegraph.com/news/cristiano-ronaldo-class-action-lawsuit-over-binance-promotion\">claiming investors suffered losses</a> from soccer star Cristiano Ronaldo touting Binance’s nonfungible tokens.</p><p><a href=\"https://cointelegraph.com/news/crypto-lawyer-deposition-changpeng-zhao-binance\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T21:20:00.000Z",
    "title": " Palau’s Ripple-supported stablecoin pilot achieves positive results ",
    "url": "https://cointelegraph.com/news/palau-ripple-supported-stablecoin-pilot-achieves-positive-results",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTQzMmUyZDgtYjkwNC00Y2QxLWIwYTktOWI5ZWYxMTQ4MjQ1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The U.S. dollar-pegged Palau Stablecoin was used by 168 volunteers for $100 of retail purchases in three months. </p>\n                    <p><p>The first phase of the Palau Stablecoin (PSC) Program has been declared a success by the country’s Ministry of Finance. More work on the United States dollar-pegged national stablecoin is planned, with the goal of introducing the PSC on a national scale, according to a report <a href=\"https://www.palaugov.pw/wp-content/uploads/Republic-of-Palau-Stablecoin-Program-Phase-1-Report.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> on Dec. 7.</p><p>The three-month PSC project was carried out with the participation of Ripple and used the XRP Ledger central bank digital currency (CBDC) platform. The Finance Ministry recruited 168 volunteers from among government employees, who were able to spend 100 PSC at participating local retailers. Both the volunteers and retailers responded positively to their experience using the PSC.</p><p>Purchases were made using a phone and a QR code or by manually inputting a wallet address. Only the retailers were able to redeem the PSC for U.S. dollars, which is Palau’s legal currency. The PSC was fully collateralized by $20,000 in “a Tier 1 Federal Deposit Insurance Corporation (FDIC) United States bank.” </p><p><a href=\"https://cointelegraph.com/news/palau-ripple-supported-stablecoin-pilot-achieves-positive-results\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T21:18:40.000Z",
    "title": " Why is Solana (SOL) price up this week? ",
    "url": "https://cointelegraph.com/news/why-is-solana-price-up-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTAvMGI5ODY4NjktYWFhMi00ZDZmLTlkMTYtNzc1NDhlNGI4ZTcwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>SOL's meteoric rise to a new 2023 high appears to be driven by SPL tokens and a surge in DeFi and NFT activity </p>\n                    <p><p>Solana's native token (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) surged by 17% between Dec. 7 and Dec. 8, reaching its highest level since May 2022.</p><p>SOL's fate changed dramatically on Dec. 1 when Brian Armstrong, CEO of Coinbase, <a href=\"https://twitter.com/martypartymusic/status/1730674436515528930\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> a plan to integrate the Solana network, including its tokens, although no specific date has been provided. This news sparked interest in Bonk (BONK), a Solana SPL meme token listed on Bybit, KuCoin, and Solana's decentralized exchange, Orca, which gained 236% between Dec. 1 and Dec. 8.</p><p>On Dec. 6, Coinbase exchange <a href=\"https://twitter.com/CoinbaseAssets/status/1732490637029605684\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the listing of Jito (JTO), an SPL token on the Solana network, which saw instant success as JTO doubled in price between Dec. 7 and Dec. 8. With the current circulating supply of 115 million, Jito's market capitalization now stands at $422 million.</p><p><a href=\"https://cointelegraph.com/news/why-is-solana-price-up-this-week\">Read more</a></p></p>\n                \n            "
  }
]