[
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T16:14:16.000Z",
    "title": "US court rejects Fed's motion to dismiss Custodia Bank case",
    "url": "https://cointelegraph.com/news/us-court-rejects-fed-s-motion-to-dismiss-custodia-bank-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/96ab0b71-370c-4474-98bf-6f211a45da9e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Digital asset bank Custodia sued the Fed in June 2022, claiming an “unlawful delay” in processing an application for its master account.</p>\n                    <p><p>Custodia Bank won a step forward in its legal battle against the Federal Reserve, as a Wyoming federal judge <a href=\"https://www.courtlistener.com/docket/63366375/164/custodia-bank-inc-v-federal-reserve-board-of-governors/\" target=\"_blank\" rel=\"noopener nofollow\">denied</a> dismissal motions from both the Fed and the Federal Reserve Bank of Kansas City.</p><p>The digital asset bank sued the Federal Reserve in June 2022, claiming an “unlawful delay” in processing an application for its master account. In 2020, Caitlin Long, former Morgan Stanley and an early proponent of Bitcoin, founded the bank <a href=\"https://cointelegraph.com/news/caitlin-long-takes-aim-at-the-new-york-times-over-crypto-alarm-article\">to provide account services for crypto companies</a> and serve as a bridge to the United States dollar.</p><p>“The Federal Reserve’s latest motion to dismiss Custodia Bank’s lawsuit was once again rejected. We are pleased that the Fed’s attempt to provide itself a veto over state bank chartering decisions will now be tested in federal court,” Nathan Miller, a spokesperson for Custodia Bank, told Cointelegraph in a statement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/44221cb1-bd75-49a4-b09f-7edf5aa88b64.png\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the Order on Defendant's Motions to Dismiss Amended Complaint. Source: Court Listener</em></figcaption></figure><p>Custodia submitted an application for<a href=\"https://cointelegraph.com/news/how-does-the-fed-impact-crypto-find-out-on-the-market-report\"> a Federal Reserve master account</a> in October 2020. The application, if granted, would enable the bank to use the Federal Reserve's payment system, the FedWire network, which<a href=\"https://www.frbservices.org/resources/financial-services/wires/volume-value-stats/annual-stats.html\" target=\"_blank\" rel=\"noopener nofollow\"> processed</a> over 196 million transactions last year. In January 2023, the Fed <a href=\"https://cointelegraph.com/news/custodia-bank-s-membership-denied-for-ties-with-crypto-markets-says-us-fed\">denied the membership application</a>, saying it was “inconsistent with the required factors under the law” and citing the bank’s involvement in the crypto space. </p><p>Custodia was one of Wyoming's first Special Purpose Depository Institutions (SPDIs), also known as \"blockchain banks.\" SPDIs <a href=\"https://cointelegraph.com/news/while-washington-dithers-wyoming-and-other-us-states-mine-for-crypto-gold\">were created to serve businesses</a> unable to secure Federal Deposit Insurance Corporation (FDIC) banking services due to their dealings with cryptocurrency. In April, the state of Wyoming requested to intervene in the case between the bank and the Fed, defending its framework allowing certain crypto firms to qualify as state-chartered banks.</p><p>According to Miller, the Fed is reinterpreting federal laws to grant itself special authority that it never received from Congress after decades of automatically granting master accounts to chartered banks.</p><p> “The Fed has never held such authority in U.S. history, nor does it need discretion to block banks that already have been validly chartered by state banking authorities that rigorously separate the wheat from the chaff,\" Miller continued, adding that Custodia received its bank charter after more than 150 prospective applicants were rejected by the Wyoming Division of Banking. \"We look forward to the court’s review of this power grab by the Fed,” he stated. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/legal-dangers-getting-involved-daos/\"><strong><em>The legal dangers of getting involved with DAOs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-09T16:09:42.000Z",
    "title": "Robinhood Delists Solana, Cardano, and Polygon",
    "url": "https://cryptodaily.co.uk/2023/06/robinhood-delists-solana-cardano-and-polygon",
    "description": "<p>Trading app Robinhood will remove Solana, Cardano and Polygon from its platform come June 27. The move comes after the SEC alleged that several crypto tokens are unregistered securities. </p>\n<p>Robinhood Markets Inc. announced today that it would end support for Solana (SOL), Cardano (ADA), and Polygon (MATIC) as of June 27.</p>\nNo Other Coins Will Be Affected\n<p>The trading app informed users they would no longer be able to trade the tokens on its platform just days after the SEC labelled several popular cryptocurrencies unregistered securities. The regulator made the allegations in a lawsuit against crypto exchange Binance and its CEO, Changpeng Zhao.</p>\n<p>The lawsuit names Cardano, Polygon, Solana, Cosmos Hub (ATOM), Filecoin (FIL), Decentraland (MANA), Algorand (ALGO), The Sandbox (SAND), Coti (COTI), and Axie Infinity (AXS). The suit also identified the BUSD and BNB stablecoins as securities.</p>\n<p>Robinhood limited its delisting to SOL, ADA, and MATIC and said to users that no other coins would be affected and would remain safe on its platform.</p>\n<p>It had been reported that the trading app would review its cryptocurrency offerings. On Tuesday, the company&rsquo;s chief legal officer, Dan Gallagher, told Congress that it is &ldquo;actively reviewing&rdquo; the SEC&rsquo;s analysis &ldquo;to determine what if any, action to take.&rdquo;</p>\n<p>Gallagher, a former SEC commissioner, testified before the House Agriculture Committee during a meeting on digital assets.</p>\nSEC Sparkes Chaos in the Crypto Market\n<p>The securities agency filed lawsuits against two of the largest cryptocurrency exchanges &ndash; Binance and Coinbase.</p>\n<p>According to the SEC, Binance mishandled customer funds and deceived investors and regulators about its operations. It further alleged that both Zhao and the exchange failed to restrict US customers from its platform and charged Binance with operating as an unregistered securities exchange.</p>\n<p>The agency filed suit against Binance&rsquo;s rival platform, Coinbase, accusing the exchange of acting as an unregistered broker, exchange, and clearinghouse. The SEC charged Coinbase for &ldquo;the unregistered offer and sale of securities in connection with its staking-as-a-service program.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T16:32:08.000Z",
    "title": "Mark Zuckerberg tried Apple’s Vision Pro, and he hated it",
    "url": "https://www.cryptopolitan.com/mark-zuckerberg-tried-vision-pro-he-hated-it/",
    "description": "Tensions simmered as Mark Zuckerberg, the spirited Chief Executive Officer of Meta, candidly shared his reflections on Apple&#8217;s latest venture into the mixed reality realm. Apple&#8217;s recent unveiling of its Vision Pro headset, an augmented and virtual reality (VR) gadget, stirred both intrigue and skepticism in Zuckerberg, revealing diverging philosophies between the tech titans. The ... <a title=\"Mark Zuckerberg tried Apple&#8217;s Vision Pro, and he hated it\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mark-zuckerberg-tried-vision-pro-he-hated-it/\" aria-label=\"More on Mark Zuckerberg tried Apple&#8217;s Vision Pro, and he hated it\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T16:22:53.000Z",
    "title": "Monero price analysis: XMR returns to $145 after bouncing back on $140 support",
    "url": "https://www.cryptopolitan.com/monero-price-analysis-2023-06-09/",
    "description": "TL;DR Breakdown The Monero price analysis shows that the XMR price action found support at the $140.0 mark and the bullish momentum has enabled the price to return to the $144.0 mark. However, the price action still faces strong bearish pressure at press time as the bulls face rejection at the $145.0 mark.&#160; The broader ... <a title=\"Monero price analysis: XMR returns to $145 after bouncing back on $140 support\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-analysis-2023-06-09/\" aria-label=\"More on Monero price analysis: XMR returns to $145 after bouncing back on $140 support\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T16:21:23.000Z",
    "title": "UBS and Swiss govt’s shocking deal to safeguard losses",
    "url": "https://www.cryptopolitan.com/ubs-swiss-govts-deal-to-safeguard-losses/",
    "description": "UBS and the Swiss government have solidified an agreement to insulate UBS from potential losses tied to its impending takeover of Credit Suisse. The deal, signed on Friday, positions the government as the safety net for UBS, agreeing to absorb losses up to 9 billion Swiss francs (approximately $10 billion) linked to specific Credit Suisse ... <a title=\"UBS and Swiss govt&#8217;s shocking deal to safeguard losses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ubs-swiss-govts-deal-to-safeguard-losses/\" aria-label=\"More on UBS and Swiss govt&#8217;s shocking deal to safeguard losses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T16:15:57.000Z",
    "title": "Full list of crypto tokens that Robinhood is delisting on June 27, 2023",
    "url": "https://www.cryptopolitan.com/list-of-crypto-tokens-robinhood-is-delisting/",
    "description": "Robinhood has felt the heat from the ongoing crypto crackdown in the United States. In response to the Securities and Exchange Commission&#8217;s (SEC), recent lawsuits against two of the top crypto exchanges, Binance and Coinbase, American financial services company Robinhood announced on Friday that it would discontinue support for some of the crypto market tokens ... <a title=\"Full list of crypto tokens that Robinhood is delisting on June 27, 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/list-of-crypto-tokens-robinhood-is-delisting/\" aria-label=\"More on Full list of crypto tokens that Robinhood is delisting on June 27, 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T16:12:09.000Z",
    "title": "OKX and Manchester City join forces in Istanbul",
    "url": "https://www.cryptopolitan.com/okx-manchester-city-join-forces-in-istanbul/",
    "description": "As anticipation mounts for the historic football finals tomorrow, OKX, the globally recognized blockchain technology enterprise, will stand by Manchester City Football Club, the renowned team they&#8217;ve sponsored as their Official Cryptocurrency Exchange Partner. With the team set to square off against Inter Milan at the Atatürk Olympic Stadium in Istanbul, they&#8217;ll bear the emblems ... <a title=\"OKX and Manchester City join forces in Istanbul\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-manchester-city-join-forces-in-istanbul/\" aria-label=\"More on OKX and Manchester City join forces in Istanbul\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T16:33:19.000Z",
    "title": "Texas legislature passes new bitcoin mining laws",
    "url": "https://crypto.news/texas-legislature-passes-new-bitcoin-mining-laws/",
    "description": "The 88th session of the Texas Legislature has passed a series of bills set to influence the state's bitcoin mining industry."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T16:25:15.000Z",
    "title": "Shiba Inu (SHIB) Price At The Most Crucial Point In Its History?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shib-price-at-most-crucial-point-in-history/",
    "description": "After Shiba Inu (SHIB) had a fabulous rally at the beginning of the year, the price has been in a sustained downturn since February 5, which neither the beta launch of Shibarium nor an increase in monthly burn rates were able to prevent. With the price currently trading at $0.00000804, SHIB is thus at possibly the most important point in its young history. A look at the 1-day chart reveals that SHIB reached a local high of $0.00001575 on February 5, 2023. From that point until early May, the price formed a descending triangle with a horizontal trend line at $0.000010 acting as support for a long time. This price level was also aligned with the 23.6% Fibonacci level. Most Important Moment In Shiba Inu Price History? When the trend line was broken to the downside, the downtrend continued rapidly. All year-to-date gains were wiped out. However, one last hope may now be a triple bottom chart pattern, which the Shiba Inu price is currently exhibiting. The price area at $0.00000776 served as the last support back in mid-June 2022 and late December 2022, and now again. Shiba Inu meets all three characteristics of the chart pattern. Related Reading: Shiba Inu Hits Crucial Barrier – How This May Impact Investor Sentiment First, the three lows must be roughly equal in price and spaced apart by a certain distance (June and December 2022, June 2023). Second, volume must be decreasing throughout the pattern, which is a sign that the bears are losing strength. Looking at the time pattern of SHIB trading volume, this condition can also be considered to be met. Third, Shiba Inu has been in a steady downtrend with lower highs since the all-time high of late October 2021. Hence, the decisive moment might have come now: While the trading volume decreases during downward movements, the volume should increase during upward movements when the price breaks through the resistance levels. Only if that happens, a trend reversal seems possible. A very first resistance to break through is at $0.0000817. If successful, the 50-day Exponential Moving Average (EMA) currently at $0.00000907 could come into focus. However, probably the most important resistance to confirm a fake breakout is the 23.6% Fibonacci level at $0.000010. Related Reading: Shiba Inu (SHIB) Price Could Soar To Major Highs Soon, Here’s Why The bullish case of Shiba Inu is also supported by a possible bullish divergence of the RSI in the 1-day chart. This occurs when the RSI indicates an oversold condition (SHIB&#8217;s RSI dropped as low as 24 in May), followed by a higher low associated with lower price lows. Thus, the RSI of Shiba Inu price in the 1-day chart could indicate bullish momentum. The break above the oversold zone in recent days could be a signal for a new buy position. But the bearish case is still strong as well. SHIB traders do not want to see a drop below $0.00000716 at any cost. If this happens, it would be an alarming signal that SHIB could test the September 2021 low around $0,000006. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T16:13:21.000Z",
    "title": "Dell Promotes IOTA with Project Alvarium: Revolutionizing Carbon Footprint Tracking in the Billion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/dell-promotes-iota-with-project-alvarium-revolutionizing-carbon-footprint-tracking-in-the-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=dell-promotes-iota-with-project-alvarium-revolutionizing-carbon-footprint-tracking-in-the-billion-dollar-market",
    "description": "<p>The IOTA Foundation and Dell Technologies are partnering on Project Alvarium, and building a digital tool for real-time measurement, reporting, and verification of environmental impact. Through Project Alvarium, IOTA and Dell will track and verify data related to climate change, providing transparency and trust in carbon footprint tracking. The IOTA Foundation has been one of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dell-promotes-iota-with-project-alvarium-revolutionizing-carbon-footprint-tracking-in-the-billion-dollar-market/\">Dell Promotes IOTA with Project Alvarium: Revolutionizing Carbon Footprint Tracking in the Billion-Dollar Market</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-09T16:36:05.000Z",
    "title": "After $3 Million Private Sale and Seed Funding, AiONE Reveals Staking Platform",
    "url": "https://dailyhodl.com/2023/06/09/after-3-million-private-sale-and-seed-funding-aione-reveals-staking-platform/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/AiONE-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/AiONE-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/06/AiONE-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/AiONE-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/AiONE-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/AiONE-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>The business platform AiONE, harnessing the power of AI, shares insights into its recent seed funding, private sale and forward-thinking strategies intended to facilitate widespread access to AI across diverse sectors. AiONE is excited to announce it has successfully secured $1 million in seed funding from private investors and raised an additional $3 million through [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/09/after-3-million-private-sale-and-seed-funding-aione-reveals-staking-platform/\">After $3 Million Private Sale and Seed Funding, AiONE Reveals Staking Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]