[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T07:19:02.000Z",
    "title": "Matrixport's Bitcoin Greed & Fear Index Surpasses 90%, Suggests Bull Breather Ahead",
    "url": "https://www.coindesk.com/markets/2023/06/23/matrixports-bitcoin-greed-fear-index-surpasses-90-suggests-bull-breather-ahead/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Historically, an above-90% reading on the index has coincided with interim market tops."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T07:15:13.000Z",
    "title": "Bitcoin 'parabolic advance' means BTC price all-time high in 2023 — Trader",
    "url": "https://cointelegraph.com/news/bitcoin-parabolic-advance-btc-price-all-time-high-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/53eb7544-dbf5-44af-87f5-274d66121f4b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin has around four months to go before eclipsing its $69,000 peak if past impulse moves are a guide, says Credible Crypto.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) will hit new all-time highs in 2023, and October is the favorite month for it, a popular trader says.</p><p>In a <a href=\"https://twitter.com/CredibleCrypto/status/1671959219627757568\" target=\"_blank\" rel=\"noopener nofollow\">Twitter update</a> on June 22, Credible Crypto argued that the next four months should deliver the bullish BTC price momentum needed to tackle $69,000.</p><h2>October \"fairly logical\" for new Bitcoin all-time highs</h2><p>Bitcoin has put in solid performance this month, and Credible Crypto is increasingly optimistic for continuation. To do so, BTC/USD needs to present increasingly larger green monthly candles to keep it in line with previous impulse periods.</p><p>“Whats clear with any parabolic advance is that momentum increases exponentially and peaks at the top. We can see this in both prior impulsive moves from 3k-14k and from 10k-60k,” he explained.</p><p>This time around, Bitcoin has delivered a successful retest of support on monthly timeframes, with $25,000 now possibly a springboard for a new “parabolic advance.”</p><p>“So with that in mind, let's take our current situation- monthly retest complete and the largest monthly candle we have seen thus far was a 10k move which broke us above the monthly level of 25k,” he continued.</p><blockquote>“This means I would expect that once expansion begins (which it looks like it has) we should see monthly moves of &gt; 10k at a time, easily. From current levels to prior ATH is a $40,000 gap. This gap should then, logically, be covered within a few monthly candles if this is a parabolic advance.”</blockquote><p>Timing for such a move remains open, Credible Crypto added, while suggesting October as a “fairly logical guesstimate.”</p><p>“With that being said, that's all this is- an estimation based on the logic presented above,” he concluded. </p><blockquote>“I am not saying we MUST hit new all time highs by October, I AM saying I do think we will hit new ATH by the end of this year and if someone forced me to pick a month in which I think this will occur it would be October. Let's see how things play out.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3e90f447-f147-4560-8b0d-ac659bab2cf9.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Credible Crypto/Twitter</em></figcaption></figure><h2>Too early to celebrate?</h2><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-28-k-retracement-btc-price-retains-20-gains\">continues to report</a>, other traders are also keen for a return to record BTC price levels.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-metrics-similarities-2020-breakout\">3 Bitcoin price metrics showing ‘insane’ similarities to 2020 breakout</a></em></strong></p><p>At the same time, not everyone believes that the impetus for recent gains — <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">applications by BlackRock</a> and others to launch Bitcoin spot price exchange-traded funds (ETFs) in the United States — will get the green light.</p><p>The current make-up of U.S. regulatory oversight means that “near-term” approvals, even for BlackRock, remain less than likely, trading firm QCP Capital <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-spot-etf-unlikely-near-term\">warned</a> this week.</p><p>BTC/USD traded around the $30,000 mark at the time of writing, according to data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>, having cooled upside volatility the day prior.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9635d3cc-83d0-4ae4-a3f6-3bdb85d4b720.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\">Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T07:25:27.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T07:21:59.000Z",
    "title": "Get Optimized Access to Advanced Machine Learning Models from  Monster API",
    "url": "https://www.cryptopolitan.com/monster-api-revolutionizes-access-to-advanced-machine-learning-models/",
    "description": "Monster API, a groundbreaking platform, has emerged to democratize the use of advanced machine-learning models and techniques. By providing on-demand access to a distributed network of GPUs, the platform significantly lowers the barriers to training, refining, and deploying statistical AI models. With its cost-effective approach, Monster API aims to make AI models accessible to developers ... <a title=\"Get Optimized Access to Advanced Machine Learning Models from  Monster API\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monster-api-revolutionizes-access-to-advanced-machine-learning-models/\" aria-label=\"More on Get Optimized Access to Advanced Machine Learning Models from  Monster API\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-23T07:30:04.000Z",
    "title": "As A Crypto Newbie, Bitcoin or Altcoins Investment?",
    "url": "https://nulltx.com/as-a-crypto-newbie-bitcoin-or-altcoins-investment/",
    "description": "As a newbie in the crypto space, choosing whether to invest in Bitcoin or other altcoins requires careful consideration. Both options have their own advantages and risks, and it ultimately depends on your investment goals, risk tolerance, and understanding of the market dynamics. Bitcoin, The King Cryptocurrency Bitcoin, being the first and most well-known cryptocurrency, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T07:17:48.000Z",
    "title": "PEPE Leapfrogs With 72% Rally – What’s Behind The Surprise Vigor?",
    "url": "https://www.newsbtc.com/all/pepe-bulls-run-wild-with-72-rally/",
    "description": "Pepe Coin (PEPE), the once-heralded meme coin that rode the waves of exhilarating hype, is making a remarkable comeback after a period of stagnation. As the frenzy surrounding meme coins gradually dissipated, PEPE experienced a significant loss in value, leaving investors and enthusiasts uncertain about its future.  However, recent data analysis has shed light on a fascinating trend — the resurrection of PEPE. Notably, the token&#8217;s resurgence is not merely a coincidence; it can be attributed to a surge in buying pressure.  But what does this renewed interest in PEPE mean for its future? Related Reading: AVAX Breaches $13 Barrier With 16% Rally – What’s The Next Price Level To Watch? PEPE Demonstrates Promising Market Dynamics  PEPE, currently valued at $0.00000155 according to CoinGecko, has recently witnessed a moderate 2.3% rally within the past day, indicating a potential shift in its market dynamics. However, the most noteworthy development is the remarkable seven-day surge of 71.9%, suggesting a significant resurgence of interest. Source: Coingecko Analysis of on-chain data reveals a substantial decline in PEPE&#8217;s supply on exchanges, while its supply outside of exchanges has increased, illustrating investors&#8217; willingness to acquire the meme coin.  According to recent PEPE price report, his accumulation trend is further supported by the notable increase in the total number of holders over the past few days. The uptrend has also resulted in a surge of positive sentiment surrounding the coin. Whale&#8221;0x31f5&#8243; spent 4.54M $USDC and 150 $ETH ($287K) to buy 3.43T $PEPE at $0.000001406 in the past 8 hours. The whale made ~$11.47M on $PEPE for the first time and lost ~$741K on $PEPE for the second time. pic.twitter.com/SeS8P7jaQ3 — Lookonchain (@lookonchain) June 22, 2023 Moreover, a recent tweet from Lookonchain indicates that PEPE has been subject to buying pressure. According to the tweet, a whale invested $287,000, equivalent to 4.54 million USDC and 150 ETH, to purchase 3.43 trillion PEPE. Additionally, PEPE&#8217;s trading volume has experienced a remarkable surge of over 200% within the last 24 hours. Pepe Coin price movement in the last seven days. Source: Coingecko Challenges For PEPE As the meme coin continues to gain momentum with its recent surge and increased investor interest, the question arises: what lies ahead for this digital asset? While the current market dynamics appear promising, it is important to consider the challenges that PEPE may face in the future. Related Reading: Shiba Inu Breaks Through Crucial Resistance Point With 10% Climb Like many cryptocurrencies, meme coins are known for their high volatility and speculative nature. While the recent surge in PEPE&#8217;s value is encouraging, it is essential to recognize the inherent risks associated with investing in such assets.  As of today, cryptocurrencies have a total market cap of $1.13 trillion. Chart: TradingView.com The regulatory landscape surrounding cryptocurrencies is continuously evolving. In light of the US Securities and Exchange Commission’s lawsuits against Binance and Coinbase, governments and regulatory bodies are closely monitoring the space, which could lead to potential changes in legislation or stricter regulations. PEPE, like other meme coins, needs to navigate these regulatory challenges effectively to ensure its long-term viability. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Adobe Stock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T07:38:56.000Z",
    "title": "Floki Emerges as the Champion: Surges 16% in Crypto Rally Driven by Bitcoin, Outshining Dogecoin and Shiba Inu",
    "url": "https://www.crypto-news-flash.com/floki-emerges-as-the-champion-surges-16-in-crypto-rally-driven-by-bitcoin-outshining-dogecoin-and-shiba-inu/?utm_source=rss&utm_medium=rss&utm_campaign=floki-emerges-as-the-champion-surges-16-in-crypto-rally-driven-by-bitcoin-outshining-dogecoin-and-shiba-inu",
    "description": "As Bitcoin (BTC) leads a fresh bullish rally, Floki Inu managed to secure up to 26% in gains.  The memecoin has now outperformed other leading rival memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB).  Floki Inu has outperformed rival memecoins in the ongoing cryptocurrency rally led by Bitcoin. The memecoin has built momentum over the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T07:31:42.000Z",
    "title": "Ripple to be the Base Layer for Trillion Dollar CBDC Market and Major Partner of Central Banks",
    "url": "https://www.crypto-news-flash.com/ripple-to-be-the-base-layer-for-trillion-dollar-cbdc-market-and-major-partner-of-central-banks/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-to-be-the-base-layer-for-trillion-dollar-cbdc-market-and-major-partner-of-central-banks",
    "description": "Central Bank of Montenegro collaborates with Ripple to launch a CBDC, aiming to modernize monetary policy, enhance payment security, and promote cross-border efficiency. Global value of CBDCs projected to surge from $100 million to $213 billion by 2030, as major central banks worldwide plan to pilot and launch their own digital currencies. In a recent [...]"
  }
]