[
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T07:55:41.000Z",
    "title": "Dubai lures AI, Web3 enterprises with 90% subsidized commercial licenses",
    "url": "https://cointelegraph.com/news/dubai-ai-web3-subsidized-commercial-licenses",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/62cb156f-f32d-4aae-900f-ee3055c28f4a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In addition to attracting talent, Dubai has also given out operational licenses to crypto exchanges over the past several months.</p>\n                    <p><p>Dubai has started offering commercial licenses to <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> and <a href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> businesses at a 90% subsidy as it works to create the largest cluster of new-age tech companies in the Middle East and North Africa (MENA) region. </p><p>The Dubai AI and Web 3.0 Campus — an aspiring tech hub — <a href=\"https://www.difc.ae/newsroom/news/dubai-ai-and-web-30-campus-introduces-specialised-licensing-solutions-tech-firms-looking-scale-their-business-region/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the decision to subsidize the licenses for companies willing to set up a base in Dubai, United Arab Emirates. The licenses will be issued by Dubai International Financial Centre (DIFC) as the city eyes an influx of global talent and diversified investors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b3a0b789-d8c3-4c4d-9106-413ed54be8fd.jpeg\"  /><figcaption style=\"text-align: center;\"><em>DIFC’s newly-launched Innovation One building — physical offices and co-working spaces for registered AI and Web3 enterprises. Source: dubaiaicampus.com</em></figcaption></figure><p>DIFC Innovation Hub CEO Mohammad Alblooshi shared:</p><blockquote>“We are confident that by granting these licenses, we will attract more global talent and investment to the region and create a culture of collaboration and innovation.”</blockquote><p>The campus comes equipped with technologies that complement the crowd it hopes to attract, which includes AI lab facilities and training programs, supporting hardware and accelerator programs.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/953ec524-3e44-4ac9-8be2-28f862dfe9f4.png\"  /><figcaption style=\"text-align: center;\"><em>Dubai's AI and Web3 license application form. Source: innovationhub.difc.ae </em></figcaption></figure><p>Enterprises interested in signing up for subsidized commercial licenses will be required to fill up a form. Further investigation from Cointelegraph revealed that the sign-up form did not acknowledge the form submission and redirected the users to the home page at the time of writing.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-wins-operational-crypto-license-in-dubai\"><strong><em>Binance to offer crypto broker-dealer services in Dubai with new license</em></strong></a></p><p>In addition to attracting talent, Dubai has also given out operational licenses to crypto exchanges. Earlier in August, Nomura’s crypto arm Laser Digital Middle East FZE obtained an operating license from Dubai’s Virtual Asset Regulatory Authority (VARA).</p><p>The new virtual asset service provider (VASP) license would allow Laser Digital to offer broker-dealer and virtual asset management and investment services in the emirate.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T08:06:45.000Z",
    "title": "Gemini sees near $400 million Bitcoin withdrawal as ‘whale’ activity stirs market",
    "url": "https://cryptoslate.com/insights/gemini-sees-near-400-million-bitcoin-withdrawal-as-whale-activity-stirs-market/",
    "description": "<p>Quick Take CryptoSlate data reveals a significant development in Bitcoin market dynamics, with the third biggest Bitcoin withdrawal this year outpacing last week&#8217;s substantial outflow. The epicenter of this activity was the Gemini exchange, witnessing a near $400 million Bitcoin exodus, chiefly led by large-scale investors or ‘whales.’ This withdrawal further solidifies a decreasing trend [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/gemini-sees-near-400-million-bitcoin-withdrawal-as-whale-activity-stirs-market/\">Gemini sees near $400 million Bitcoin withdrawal as &#8216;whale&#8217; activity stirs market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T08:03:32.000Z",
    "title": "Singapore monetary authority releases regulatory framework for G10-pegged stablecoins",
    "url": "https://cryptoslate.com/singapore-monetary-authority-sets-regulatory-framework-for-g10-pegged-stablecoins/",
    "description": "<p>The Monetary Authority of Singapore (MAS) announced a regulatory framework for single-currency stablecoins (SCS) regulated in the Asian country, according to an Aug. 15 statement. The financial regulator stated that the regulations would apply to single-currency stablecoins (SCS) pegged to the Singapore Dollar (S$) or any G10 currency whose circulation surpasses S$5 million. Some G10 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/singapore-monetary-authority-sets-regulatory-framework-for-g10-pegged-stablecoins/\">Singapore monetary authority releases regulatory framework for G10-pegged stablecoins</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T08:08:00.000Z",
    "title": "RocketSwap Outlines Emergency Plan Following $865,000 Exploit",
    "url": "https://cryptodaily.co.uk/2023/08/rocketswap-outlines-emergency-plan-following-865000-exploit",
    "description": "<p>Base project RocketSwap has shared an emergency plan with users as it looks to recover from a brute force hack that saw the protocol lose around 471 ETH, valued at around $865,000, on the 14th of August.&nbsp;</p>\n<p>The team behind the project also plans on reaching out to the hacker.&nbsp;</p>\nThe Emergency Plan&nbsp;\n<p>The team at RocketSwap explained in a post on X on the 15th of August, stating that they planned to redeploy a new farm contract, following which it would be open-sourced on-chain. The team stated that they would also be relinquishing mining rights, mostly of RCKT, and also reach out to the hackers in an attempt to negotiate a return of the stolen assets, This approach was taken by Curve, and several other decentralized protocols following the Curve exploit.&nbsp;</p>\n\n<p>&ldquo;The emergency programme agreed upon by the team is as follows. We plan to redeploy a new farm contract by dropping the proxy contract and open-sourcing it on-chain. The new farm will advance the production reduction plan by 0.075 per block. The team relinquishes minting rights and retains only low-risk rights to allocate new pools. Locked initial liquidity and 80k tokens will be extended for 1 year. The team will continue to roll out LaunchPad, with further updates planned. Telegram groups will be reopened after stabilization. Call on hackers to return assets to victims.&rdquo;</p>\n\nThe RocketSwap Hack&nbsp;\n<p>On the 14th of April, a hacker managed to steal around 471 ETH, bridging it from Base to Ethereum. The activity was flagged by blockchain security firm PeckShield. The hacker then created 90 trillion LoveRCKT tokens before transferring them to Uniswap, along with 400 of the 471 ETH initially stolen. PeckShield detailed the hack in a post on X, stating,&nbsp;</p>\n\n<p>&ldquo;#PeckShieldAlert The @RocketSwap_Labs exploiter has grabbed ~471 $ETH and bridged them from #Base to #Ethereum, and then created the token $LoveRCKT, the exploiter already supplied 90T $LoveRCKT and 400 $ETH to #Uniswap.&rdquo;</p>\n\n<p>RocketSwap eventually confirmed the news on the same day, with PeckShield and another blockchain security firm, CertiK, providing additional details about the hack a few hours later. The attack was attributed to a brute force attack on RocketSwap&rsquo;s server, with the protocol stating,&nbsp;</p>\n\n<p>&ldquo;As a result of the team&rsquo;s investigation, We are sorry to inform you that the team needed to use offline signatures when deploying the launchpad and put the private keys on the server. A brute force hack of the server was detected, and due to the proxy contract used for the farm contract, there were multiple high-risk permissions that led to the transfer of the farm&rsquo;s assets. We shut down the farm to prevent further damage. The team is currently working on an emergency plan, and the Telegram group has been banned for the time being. The loss of farm assets is only a concern, DEX is not affected in any way.&rdquo;</p>\n\nGrowing Headaches On Base&nbsp;\n<p>Coinbase&rsquo;s layer-2 blockchain Base has faced several issues since commencing operations. LeetSwap, a leading decentralized exchange on the Base blockchain, suspended trading operations after flagging a security vulnerability in their factory, leading to the suspicion of compromised pool liquidity. The pause was done so that the team could investigate the issue further. PeckShield reported that around 340 ETH was exploited from liquidity pairs on Base, showing the gravity of the prevailing situation.&nbsp;</p>\n<p>Prior to the pause in trading by LeetSwap, the BALD memecoin suffered a significant drop in value. The crash occurred after the token&rsquo;s developer withdrew 6800 ETH, valued at around $12.5 million, from the liquidity pools on LeetSwap, raising several eyebrows and compounding the list of issues faced by LeetSwap. Furthermore, Coinbase is also dealing with its own set of regulatory challenges after finding itself as a target of the United States Securities and Exchange Commission (SEC). The Securities and Exchange Commission has ordered Coinbase to stop all crypto trading, except for that of Bitcoin. When Coinbase questioned the decision made by the regulatory body, Coinbase filed a lawsuit against the exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T08:09:41.000Z",
    "title": "Ex-FTX exec Salame will no longer testify in alleged campaign donation lawsuit",
    "url": "https://www.cryptopolitan.com/ex-ftx-exec-salame-will-no-longer-testify/",
    "description": "Ryan Salame, a former executive at FTX, is said to have plans to evade giving testimony regarding his involvement in the purported unlawful campaign contribution scheme tied to FTX. In the event of being issued a subpoena for Sam Bankman-Fried&#8217;s criminal trial, Salame, who was once a co-CEO at FTX, intends to refrain from providing ... <a title=\"Ex-FTX exec Salame will no longer testify in alleged campaign donation lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ex-ftx-exec-salame-will-no-longer-testify/\" aria-label=\"More on Ex-FTX exec Salame will no longer testify in alleged campaign donation lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T08:02:11.000Z",
    "title": "Machi Big Brother Withdraws Defamation Lawsuit Against ZachXBT",
    "url": "https://www.cryptopolitan.com/machi-big-brother-withdraws-lawsuit-zachxbt/",
    "description": "In a surprising turn, renowned NFT whale Machi Big Brother officially withdrew his defamation lawsuit against the prominent digital currency investigator, ZachXBT. This development has sent ripples through the crypto community, with many speculating on the reasons behind this sudden change of heart. The Background: A Clash of Titans Jeffrey Huang, more popularly known in ... <a title=\"Machi Big Brother Withdraws Defamation Lawsuit Against ZachXBT\" class=\"read-more\" href=\"https://www.cryptopolitan.com/machi-big-brother-withdraws-lawsuit-zachxbt/\" aria-label=\"More on Machi Big Brother Withdraws Defamation Lawsuit Against ZachXBT\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T07:59:29.000Z",
    "title": "Will Aptos Be Able To Make A Comeback? Crypto Community Prefer Everlodge Over Cardano",
    "url": "https://www.cryptopolitan.com/will-aptos-be-able-to-make-a-comeback-crypto-community-prefer-everlodge-over-cardano/",
    "description": "Experts suggest investing in projects that come with real-world utilities. These projects are less susceptible to any sudden market crash. This, in turn, ensures the safety of your investment. One such rare project is Everlodge, whose presale tokens are selling out fast. According to experts, ELDG’s market value can surge by 3000% upon its launch ... <a title=\"Will Aptos Be Able To Make A Comeback? Crypto Community Prefer Everlodge Over Cardano\" class=\"read-more\" href=\"https://www.cryptopolitan.com/will-aptos-be-able-to-make-a-comeback-crypto-community-prefer-everlodge-over-cardano/\" aria-label=\"More on Will Aptos Be Able To Make A Comeback? Crypto Community Prefer Everlodge Over Cardano\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T07:54:16.000Z",
    "title": "Move Over Litecoin (LTC) and Conflux (CFX), Pomerdoge (POMD)’s 5,000% Forecasted Surge is Stealing the Spotlight",
    "url": "https://www.cryptopolitan.com/move-over-litecoin-ltc-and-conflux-cfx-pomerdoge-pomds-5000-forecasted-surge-is-stealing-the-spotlight/",
    "description": "While Litecoin (LTC) and Conflux (CFX) have established themselves as steady players, the newcomer Pomerdoge (POMD) is causing quite a stir. With a forecasted surge of a whopping 5,000%, Pomerdoge is swiftly stealing the spotlight.&#160; It&#8217;s important to note that Pomerdoge is in its presale phase, creating a unique opportunity for investors to get in ... <a title=\"Move Over Litecoin (LTC) and Conflux (CFX), Pomerdoge (POMD)&#8217;s 5,000% Forecasted Surge is Stealing the Spotlight\" class=\"read-more\" href=\"https://www.cryptopolitan.com/move-over-litecoin-ltc-and-conflux-cfx-pomerdoge-pomds-5000-forecasted-surge-is-stealing-the-spotlight/\" aria-label=\"More on Move Over Litecoin (LTC) and Conflux (CFX), Pomerdoge (POMD)&#8217;s 5,000% Forecasted Surge is Stealing the Spotlight\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T07:49:32.000Z",
    "title": "European Blockchain Convention 9, set to be Europe’s largest blockchain event in 2H 2023",
    "url": "https://www.cryptopolitan.com/european-blockchain-convention-9-set-to-be-europes-largest-blockchain-event-in-2h-2023/",
    "description": "Barcelona, Spain — European Blockchain Convention 9 is set to be Europe&#8217;s largest blockchain event in 2H 2023, surpassing all its previous editions since the event was launched in 2018.   Ready to welcome 5,000 attendees, EBC9 is scheduled for October 24-27, 2023 at the vibrant city of Barcelona, ahead of the highly anticipated El Clasico ... <a title=\"European Blockchain Convention 9, set to be Europe’s largest blockchain event in 2H 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-blockchain-convention-9-set-to-be-europes-largest-blockchain-event-in-2h-2023/\" aria-label=\"More on European Blockchain Convention 9, set to be Europe’s largest blockchain event in 2H 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T07:45:35.000Z",
    "title": "Polkadot and Cosmos Dwindle as VC Spectra’s Investment Potential Magnifies",
    "url": "https://www.cryptopolitan.com/polkadot-and-cosmos-dwindle-as-vc-spectras-investment-potential-magnifies/",
    "description": "Polkadot (DOT) remains range bound, capped by significant bearish pressure, and Cosmos (ATOM) struggles with significant declines in both usage and market price. On the other hand, VC Spectra, a decentralized hedge fund platform, continues to make waves with consecutive highly successful funding rounds.&#160; Let&#8217;s explore the latest with Polkadot (DOT), Cosmos (ATOM), and VC ... <a title=\"Polkadot and Cosmos Dwindle as VC Spectra&#8217;s Investment Potential Magnifies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-and-cosmos-dwindle-as-vc-spectras-investment-potential-magnifies/\" aria-label=\"More on Polkadot and Cosmos Dwindle as VC Spectra&#8217;s Investment Potential Magnifies\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T08:07:29.000Z",
    "title": "XRP Shines: Outperforming BTC, ETH, and ADA in Speed, Cost, and Scalability",
    "url": "https://www.crypto-news-flash.com/xrpl-shines-outperforming-btc-eth-and-ada-in-speed-cost-and-scalability/?utm_source=rss&utm_medium=rss&utm_campaign=xrpl-shines-outperforming-btc-eth-and-ada-in-speed-cost-and-scalability",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ether\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />XRPL showcased more impressive protocol stats than BTC, ETH and ADA. The measured metrics includes speed, cost and scalability. Ripple’s XRP Ledger (XRPL) has outperformed prominent competitors like Bitcoin (BTC), Ethereum (ETH), and Cardano (ADA) in terms of major blockchain metrics like speed, cost, and scalability. For a long while, XRPL has taken center stage [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T08:02:43.000Z",
    "title": "Russia to Test Digital Ruble as Borroe Presale Gains Momentum: $ROE to $1?",
    "url": "https://www.crypto-news-flash.com/russia-to-test-digital-ruble-as-borroe-presale-gains-momentum-roe-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=russia-to-test-digital-ruble-as-borroe-presale-gains-momentum-roe-to-1",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-32.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-32.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-32-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-32-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-32-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-32-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Russia, aiming to complement the traditional ruble, sets out to test its digital version of its currency, the $Ruble. The digital ruble is a central bank digital currency (CBDC), which is a digital form of fiat currency that the central bank of Russia will issue. Amidst Russia’s exploration of a cryptocurrency, Borroe’s ($ROE) gains massive [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-15T08:01:42.000Z",
    "title": "10+ Iconic Brands That Minted Their First NFTs",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-iconic-brands-that-minted-their-first-nfts/",
    "description": "<p>When it comes to NFTs and blockchain, many people still have their doubts. But amid this uncertainty, various companies, from the entertainment and sports industries to luxury brands, are taking a chance on NFTs. Even the biggest and most iconic brands aren&#8217;t holding back. They started dipping their toes into the NFT pool several years [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-iconic-brands-that-minted-their-first-nfts/\">10+ Iconic Brands That Minted Their First NFTs</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T07:55:22.000Z",
    "title": "ADA TVL Reaching New Highs Is Extremely Bullish Sign: Trader",
    "url": "https://coinedition.com/ada-tvl-reaching-new-highs-is-extremely-bullish-sign-trader/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Another_day_and_another_all_time_high_for_Cardano_Total_Value_Locked-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano’s (ADA) Total Value Locked (TVL) has reached a new all-time high according to a Twitter post shared by cryptocurrency trader and notorious ADA stan, Dan Gambardello, earlier today. The post pointed out that the Ethereum-killer’s TVL stood at 616 million ADA. Gambardello explained his excitement surrounding ADA’s high TVL as he believes it is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-tvl-reaching-new-highs-is-extremely-bullish-sign-trader/\">ADA TVL Reaching New Highs Is Extremely Bullish Sign: Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]