[
  {
    "source": "NewsBTC",
    "date": "2023-12-11T03:30:12.000Z",
    "title": "Bitcoin Price Crashes 8% and Wipes Weekly Gains, Dips Supported?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-crashes-8-and-wipes-weekly-gains-dips-supported/",
    "description": "Bitcoin price started a sharp decline after trading close to $45,000. BTC is down over 8% but the bulls seem to be active above $40,000. Bitcoin is showing a few bearish signs from the $44,699 high. The price is trading below $43,500 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support near $43,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could find strong buying interest near the $40,000 zone. Bitcoin Price Drops Heavily Bitcoin price remained in a bullish zone after it broke the $40,000 resistance. BTC climbed higher steadily above the $42,000 and $43,000 levels. The price even rallied above $44,000. However, it failed to test the $45,000 resistance. A high was formed near $44,699 and the price started a sharp downside correction. There was a move below the $44,000 level. Besides, there was a break below a key bullish trend line with support near $43,500 on the hourly chart of the BTC/USD pair. The pair declined below the 50% Fib retracement level of the upward move from the $39,398 swing low to the $44,699 high. Bitcoin is now trading below $43,500 and the 100 hourly Simple moving average. However, the bulls are protecting the $40,000 support and the 76.4% Fib retracement level of the upward move from the $39,398 swing low to the $44,699 high. The price is attempting a recovery wave and facing resistance near the $42,400 level. Source: BTCUSD on TradingView.com The first major resistance is forming near $43,2000, above which the price might gain bullish momentum and rise toward $44,000. A close above the $44,000 resistance might start a strong upward move. The next key resistance could be near $44,200, above which BTC could rise toward the $45,000 level. $40K Is The Key For BTC If Bitcoin fails to rise above the $43,200 resistance zone, it could start another decline. Immediate support on the downside is near the $41,200 level. The next major support is near $40,500, below which the price might test the $40,000 zone. If there is a move below $40,000, there is a risk of more downsides. In the stated case, the price could drop toward the $38,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 30 level. Major Support Levels – $41,200, followed by $40,000. Major Resistance Levels – $42,400, $43,200, and $44,200."
  }
]