[
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T04:50:43.000Z",
    "title": " Gold ETFs bleed $2.4B so far this year as Bitcoin ETFs hit record volumes ",
    "url": "https://cointelegraph.com/news/gold-etfs-bleed-this-year-as-bitcoin-etfs-hit-record-volumes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDFmMjYzMjgtNjM4ZS00YWZmLWEyMTEtNDkzY2UwY2E3YmQ4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Leading gold ETFs have seen outflows of $2.39 billion so far this year as the price of spot gold declines. </p>\n                    <p><p>Gold-tracking exchange-traded funds (ETFs) have lost billions in outflows this year in stark contrast to ETFs tracking the spot price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>The leading 14 gold ETFs have seen outflows of $2.4 billion this year, <a href=\"https://twitter.com/EricBalchunas/status/1757767035134660987\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Bloomberg intelligence analyst Eric Balchunas on Feb. 14.</p><p>In January, Bloomberg senior commodity strategist Mike McGlone predicted that <a href=\"https://cointelegraph.com/news/gold-outperform-bitcoin-2024-bloomberg-analyst-predicts\">gold would outperform Bitcoin</a> in 2024, but he appears to be a little off the mark at the moment. </p><p><a href=\"https://cointelegraph.com/news/gold-etfs-bleed-this-year-as-bitcoin-etfs-hit-record-volumes\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T04:47:34.000Z",
    "title": "Dogecoin Price Prediction – DOGE Pump To $0.12 Seems Imminent",
    "url": "https://www.newsbtc.com/analysis/doge/dogecoin-price-prediction-doge-pump-to-0-12/",
    "description": "Dogecoin is gaining pace above the $0.085 zone against the US Dollar. DOGE could start a fresh rally above the $0.088 and $0.095 resistance levels. DOGE is showing positive signs above the $0.085 zone against the US dollar. The price is trading above the $0.0865 level and the 100 simple moving average (4 hours). There was a break above a key contracting triangle with resistance at $0.0820 on the 4-hour chart of the DOGE/USD pair (data source from Kraken). The price could extend its rally above the $0.088 and $0.095 resistance levels. Dogecoin Price Turns Green In the past few sessions, Dogecoin price started a decent increase from the $0.080 support zone. DOGE cleared many hurdles near $0.0820 to enter a positive zone. There was a break above a key contracting triangle with resistance at $0.0820 on the 4-hour chart of the DOGE/USD pair. It even broke the $0.0850 resistance, but the upsides were less than Bitcoin and Ethereum. A high is formed near $0.0883 and the price is now consolidating gains. It is trading above the 23.6% Fib retracement level of the recent increase from the $0.0795 swing low to the $0.0883 high. DOGE is also trading above the $0.0865 level and the 100 simple moving average (4 hours). Source: DOGEUSD on TradingView.com On the upside, the price is facing resistance near the $0.0880 level. The next major resistance is near the $0.0920 level. A close above the $0.0920 resistance might send the price toward the $0.095 resistance. The next major resistance is near $0.100. Any more gains might send the price toward the $0.120 level. Downside Correction in DOGE? If DOGE’s price fails to gain pace above the $0.0880 level, it could start a downside correction. Initial support on the downside is near the $0.0860 level. The next major support is near the $0.0840 level or the 50% Fib retracement level of the recent increase from the $0.0795 swing low to the $0.0883 high. If there is a downside break below the $0.0840 support, the price could decline further. In the stated case, the price might decline toward the $0.0820 level. Technical Indicators 4 Hours MACD – The MACD for DOGE/USD is now losing momentum in the bullish zone. 4 Hours RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.086, $0.084, and $0.082. Major Resistance Levels – $0.088, $0.092, and $0.10."
  }
]