[
  {
    "source": "CryptoSlate",
    "date": "2023-12-20T16:20:13.000Z",
    "title": "Ledger pledges full compensation for victims of $600k ConnectKit exploit",
    "url": "https://cryptoslate.com/ledger-pledges-full-compensation-for-victims-of-600k-connectkit-exploit/",
    "description": "<p>Hardware wallet provider Ledger has announced it will fully reimburse users impacted by the vulnerability that compromised its ConnectKit library last week. Additionally, the firm promised to disable blind signing—a process where users approve transactions without verifying their content—on its devices for Ethereum virtual machine (EVM)-compatible decentralized applications (dApps) by June 2024. $600k stolen In a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ledger-pledges-full-compensation-for-victims-of-600k-connectkit-exploit/\">Ledger pledges full compensation for victims of $600k ConnectKit exploit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-20T16:31:24.000Z",
    "title": "Bonk (BONK) Price Skyrockets 700% in 30 Days; Eos (EOS) & Borroe Finance ($ROE) Gear Up for Gains",
    "url": "https://cryptodaily.co.uk/2023/12/bonk-bonk-price-skyrockets-700-in-30-days-eos-eos-borroe-finance-roe-gear-up-for-gains",
    "description": "The crypto market is in a frenzy as 2024 promises big changes in the industry."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:39:50.000Z",
    "title": "Pontem Introduces Lumio: A Layer 2 Solution",
    "url": "https://www.cryptopolitan.com/pontem-introduces-lumio-layer-2-solution/",
    "description": "Pontem Network, a pioneer in decentralized technology, has recently unveiled Lumio, the first rollup to seamlessly integrate the capabilities of Ethereum and Aptos. The innovative development is set to revolutionize the Layer 2 landscape by supporting both Ethereum Virtual Machine (EVM) and Move VM, the virtual machine utilized by Aptos. Currently, in its closed testing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:35:23.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:35:19.000Z",
    "title": "The Surge in GPTBot Traffic Poses Security Threat to E-commerce Platform",
    "url": "https://www.cryptopolitan.com/the-surge-in-gptbot-traffic-poses-security/",
    "description": "As the holiday season approaches, e-commerce platforms face a formidable challenge in the form of a surge in GPTBot traffic. Recent Black Friday sales saw GPTBot traffic on these platforms reach a staggering 90%, raising significant security concerns for online shops and consumers.&#160; Security provider Qrator Labs from the Czech Republic has reported a substantial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:33:31.000Z",
    "title": "South Korea’s Financial Supervisory Service Governor to discuss crypto regulations with SEC",
    "url": "https://www.cryptopolitan.com/south-korea-crypto-regulations-sec-chair/",
    "description": "Financial Supervisory Service Governor Lee Bok-Hyeon of South Korea is set to meet with U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler in Washington D.C. next month, according to a Wednesday report by local media news outlet ChosunBiz. However, the meeting will center around crucial discussions on cryptocurrency regulations, addressing growing concerns in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:29:50.000Z",
    "title": "China, Saudi drive BRICS’ push to erase dollar in global economy",
    "url": "https://www.cryptopolitan.com/china-saudi-drive-brics-push-to-erase-dollar/",
    "description": "The global financial landscape is undergoing a dramatic transformation, with the BRICS alliance &#8211; Brazil, Russia, India, China, and South Africa &#8211; at the forefront of a daring initiative to challenge the supremacy of the US dollar. The year 2023 has been a landmark period for this bloc, particularly with the inclusion of powerhouse nations [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:25:37.000Z",
    "title": "Researchers Uncover Reliability Issues in AI-Language Models",
    "url": "https://www.cryptopolitan.com/researchers-uncover-reliability-issues-in-ai/",
    "description": "A recent study conducted by researchers at the University of Waterloo has raised significant concerns about the accuracy and reliability of large language models, particularly an early version of ChatGPT.&#160; The study, &#8220;Reliability Check: An Analysis of GPT-3’s Response to Sensitive Topics and Prompt Wording,&#8221; delves into the model&#8217;s understanding of statements across six categories, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:22:12.000Z",
    "title": "Moomoo Singapore Achieves Regulatory Milestone with MAS MPI License",
    "url": "https://www.cryptopolitan.com/moomoo-singapore-regulatory-mas-mpi-license/",
    "description": "Moomoo Singapore, a leading digital brokerage firm, has recently been granted in-principle approval for a Major Payment Institution License &#8211; Digital Payment Token Service, by the Monetary Authority of Singapore (MAS). The significant development marks a new chapter for Moomoo Singapore, enabling it to expand its service offerings and strengthen its position in the burgeoning [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:19:52.000Z",
    "title": "Coinbase stock saw a massive surge this year",
    "url": "https://www.cryptopolitan.com/coinbase-stock-saw-a-massive-surge-this-year/",
    "description": "In the dynamic world of cryptocurrency exchanges, Coinbase has emerged as a standout performer in 2023. This year, the company&#8217;s stock, COIN, has witnessed an extraordinary surge, outpacing not only its crypto contemporaries but also defying broader market trends. As the year draws to a close, Coinbase&#8217;s stock ascension reflects a broader affirmation of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T16:12:56.000Z",
    "title": "Cardano Partners with Brazil’s leading oil company Petrobras for blockchain education in the energy sector",
    "url": "https://www.cryptopolitan.com/cardano-petrobras-blockchain-education/",
    "description": "The Cardano Foundation has joined forces with Petrobras, Brazil&#8217;s leading state-owned oil company. The collaboration aims to provide comprehensive blockchain education to Petrobras&#8217; vast workforce of 45,000 employees and delve into potential use cases within the energy industry. Cardano blockchain education workshops for Petrobras employees The Cardano Foundation will spearhead blockchain education workshops for Petrobras [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T16:38:14.000Z",
    "title": "ARK sells Coinbase, Robinhood shares amid impressive stock growth",
    "url": "https://crypto.news/ark-sells-coinbase-robinhood-shares-amid-impressive-stock-growth/",
    "description": "ARK sells Coinbase, Robinhood shares amid impressive stock growth."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T16:28:09.000Z",
    "title": "Ledger to reimburse library exploit victims by February",
    "url": "https://crypto.news/ledger-to-reimburse-library-exploit-victims-by-february/",
    "description": "Hardware crypto wallet maker Ledger plans to make defi participants whole by covering approximately $600,000 in digital assets stolen during a Dec. 14 incident."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T16:12:29.000Z",
    "title": "TRM Labs: 99% of U.S. law enforcement wants more crypto training",
    "url": "https://crypto.news/trm-labs-99-of-u-s-law-enforcement-wants-more-crypto-training/",
    "description": "In a recent report, blockchain intelligence firm TRM Labs found that 90% of surveyed participants had received crypto-related training, while 99% said more was needed."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T16:30:32.000Z",
    "title": "Ethereum Retests Breakout Zone, Analyst Sets $3,500 Target",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-retests-breakout-analyst-3500-target/",
    "description": "An analyst has explained how Ethereum is retesting a breakout zone currently and that this might lead toward a price target of $3,500. Ethereum Is Retesting The Breakout Line Of An Ascending Triangle As pointed out by analyst Ali in a new post on X, Ethereum may be preparing for a further climb right now as it&#8217;s retesting the breakout zone of an ascending triangle. An &#8220;ascending triangle&#8221; is a pattern in technical analysis that, as its name implies, resembles a triangle. The pattern involves a horizontal line made by connecting highs and a slant line that strings together higher lows. Related Reading: Dogecoin Whales Are On The Move: A Worrying Sign? When the price retests the upper, horizontal level, it could be probable to feel some resistance. On the other hand, a touch of the lower level could lead to the price rebounding back up. A break out of either of these lines suggests a potential sustained continuation of the trend. Naturally, an escape out of the triangle towards the upside implies bullish momentum, while a fall under means bearish momentum. Like the ascending triangle, there is also the &#8220;descending triangle,&#8221; which is a similar pattern except for the fact that the two levels are switched around (as the prevailing trend is towards the downside). Now, here is the chart shared by Ali that displays how the price is interacting with an ascending triangle right now: Looks like the asset's value has plunged back towards the triangle in recent days &#124; Source: @ali_charts on X As is visible in the graph, Ethereum found a bottom at the lower line of this ascending triangle pattern back in October. Following this low, the asset turned itself around with a sharp rally and went on to challenge the upper line. The cryptocurrency succeeded in finding a break above the triangle and observed a continuation of the bullish momentum, exploring new highs for the year. Recently, though, the asset has slumped back again and has now fallen towards the triangle&#8217;s breakout line. So far, the line has provided support to the asset, as its price has been able to remain above it. The analyst believes that this retest could be a sign that the coin is preparing for a further rally. &#8220;The price range between $2,150 and $1,900 could be the ideal zone for accumulation before ETH sets its sights on a higher target of $3,500,&#8221; explains Ali. From the current price, such a target would mean a rally of almost 60% for the asset. Related Reading: Santiment Breaks Down “Most Trending” Altcoins Of Past Week October, the month when Ethereum turned itself around off the triangle&#8217;s slope, was also an inflection point for the asset in terms of on-chain activity, as the analytics firm Glassnode has explained in its latest weekly report. The trend in three on-chain indicators for ETH &#124; Source: Glassnode's The Week Onchain - Week 51, 2023 From the chart, it&#8217;s visible that the Ethereum transaction count and transfer volume have both been trending up since the inflection point a couple of months back, which could be bullish for the price. ETH Price Ethereum has gone a bit stale recently as it has been consolidating around the $2,200 mark. The price of the coin appears to have been moving sideways recently &#124; Source: ETHUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T16:30:11.000Z",
    "title": "Solana Q4 Triumph: Soaring Activity Leaves Ethereum In The Dust – Report",
    "url": "https://www.newsbtc.com/news/solana-q4-triumph-soaring-activity-leaves-ethereum-in-the-dust-report/",
    "description": "Solana (SOL) has undeniably emerged as a standout performer in the recent cryptocurrency landscape, showcasing a remarkable surge in value that has captured the attention of market participants. Its extraordinary performance, marked by substantial gains, has propelled Solana beyond the ranks of other leading cryptocurrencies, securing a coveted position among the top five by market capitalization. Solana&#8217;s Surge: Outshining Rivals, Proving Dominance The impressive rally of Solana stands as a testament to the blockchain&#8217;s underlying strength and the growing confidence of investors in its capabilities. Related Reading: Woo-ing Buyers: Woo Network Token 75% Rally Sparks Investor Interest This bullish momentum has not only allowed SOL to outshine some of the traditionally dominant cryptocurrencies but has also affirmed its relevance and potential within the broader digital asset ecosystem. The daily user activity on Solana has increased as a result of this outstanding performance. As the year&#8217;s final quarter draws to a close, the most recent statistics reveals a noteworthy growth of about 400%. According to a recent study by on-chain data company Messari, this far outpaced Ethereum&#8217;s pitiful 3% gain. Source: Messari The research firm claims that several protocols located within the Layer 1 (L1) blockchain network have completed a series of token airdrops, which is what is responsible for the recent rise in new demand for Solana. On December 16th, the trading volume of decentralized exchanges (DEX) on Solana temporarily surpassed that of Ethereum for the first time. This occurred as the smart-contract-enabled blockchain ecosystem continued to expand. Solana currently trading at $76.7377K territory. Chart: TradingView.com According to data from DeFillama, Ethereum&#8217;s trading volume during that time was only $1.164 billion, whereas the trading volume of DEXs on the blockchain surpassed $1.5 billion. Bitfinex Cheers Solana One of the biggest cryptocurrency exchanges in the world, Bitfinex, recently tweeted about Solana&#8217;s expansion. The tweet claims that in the previous three months alone, SOL&#8217;s price has increased by more than 340%. Good morning, @Solana fam! ☀️ Today&#8217;s a great day to celebrate the 343% growth of $SOL. From $19.80 per SOL 3 months ago to $67.94 today! Stay bullish.https://t.co/Ltajh1l15C — Bitfinex (@bitfinex) December 18, 2023 Related Reading: Ethereum Whales Scoop Up $230 Million In ETH In One Week – Price Hike Next? Three months later, the token&#8217;s value had increased to $67.94 from $19.80 at the start of its bull surge. As this developed, Jupiter, one of the biggest decentralized finance (DeFi) protocols on Solana and a swap aggregator, revealed that its much awaited 4 billion JUP token airdrop would happen in January. $SOL is on a tear. For the first time since 2021, the SOL/ETH price ratio saw a strong reversal as the Solana network recovers from the devastating collapse of FTX. pic.twitter.com/hAlCC23Yq0 — Kaiko (@KaikoData) December 19, 2023 Meanwhile, data analytics provider Kaiko said Solana is seeing a sharp increase in price, and the price ratio of SOL to ETH is strongly reversing. The Solana (SOL) to Ethereum (ETH) ratio is close to 0.04, according to a post on X published on December 19. Prior highs were around 0.06 in 2021 and lows were at 0.01 in early 2023. At the time of writing, the price of SOL is currently trading at $77.40, up 3.5% over the last day and rallying 17% over the last week, data from CoinMarketCap shows. Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-20T16:35:00.000Z",
    "title": "BTC has 80% Chance of Hitting $44K+ But a Fall Below $35k Could Invalidate It: Analyst",
    "url": "https://coinedition.com/btc-has-80-percent-chance-of-hitting-44k-but-a-fall-below-35k-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/BTC-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC has 80% Chance of Hitting $44K+ But a Fall Below $35k Could Invalidate It: Analyst\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/BTC-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/BTC-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/BTC-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/BTC-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/BTC-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/BTC-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A crypto analyst who goes by the pseudonym tedtalksmacro speculated on two possible routes that BTC could take in the macro view. Firstly, the analyst expects BTC to have a sharp and short-lived nuke into $35k, followed by a quick recovery. Secondly, he anticipates BTC to surge above $44K and hit Target 2, as shown [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/btc-has-80-percent-chance-of-hitting-44k-but-a-fall-below-35k-analyst/\">BTC has 80% Chance of Hitting $44K+ But a Fall Below $35k Could Invalidate It: Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]