[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-26T04:00:14.000Z",
    "title": "South African Regulator Expects to Determine Fate of 50 Crypto License Applications in ‘Coming Weeks’",
    "url": "https://news.bitcoin.com/south-african-regulator-expects-to-determine-fate-of-50-crypto-license-applications-in-coming-weeks/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2009155385.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The head of enforcement at South Africa’s financial industry watchdog said on Jan. 24 that he expects the organization to decide the fate of 50 crypto firms’ license applicants in the coming weeks. The watchdog stated that from the more than 100 entities that applied for a license, 20 have since withdrawn from their respective [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T03:49:21.000Z",
    "title": "PKT: The DePIN E-Commerce Revolution",
    "url": "https://www.cryptopolitan.com/pkt-the-depin-e-commerce-revolution/",
    "description": "TL;DR In the world of blockchains, there is one decentralized physical infrastructure (DePIN) project that distinguishes itself by its innovative approach to e-commerce. This article provides an overview of the PKT ecosystem and its real world use cases in e-commerce. Building Internet Infrastructure by the People The PKT Network is a censorship resistant ecosystem where [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T03:47:58.000Z",
    "title": "SuisseAlgo’s Cutting-Edge AI Platform Transforms Clients’ Financial Performance",
    "url": "https://www.cryptopolitan.com/suissealgos-cutting-edge-ai-platform-transforms-clients-financial-performance/",
    "description": "Zürich, Switzerland &#8211; SuisseAlgo introduces its groundbreaking artificial intelligence platform, a technological marvel designed to revolutionize the landscape of financial performance. In an era marked by unprecedented advancements, SuisseAlgo stands at the forefront, delivering cutting-edge solutions that transcend traditional paradigms and set new benchmarks for excellence. Harnessing the Power of Intelligence for Sustainable Financial Excellence [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T03:47:21.000Z",
    "title": "George Carlin Estate Fights AI-Generated Comedy Special in Landmark Lawsuit",
    "url": "https://www.cryptopolitan.com/george-carlin-ai-generated-comedy-lawsuit/",
    "description": "In a groundbreaking legal maneuver, the estate of legendary comedian George Carlin has launched a fierce legal battle against the creators of an AI-generated comedy special. This lawsuit marks a pivotal moment in the intersection of technology, entertainment, and intellectual property rights, as the estate seeks to protect Carlin&#8217;s legacy from unauthorized exploitation. With implications [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T03:46:26.000Z",
    "title": "CAGA Crypto’s Trailblazing Path to Accelerate Web3 Innovation",
    "url": "https://www.cryptopolitan.com/caga-cryptos-trailblazing-path-to-accelerate-web3-innovation/",
    "description": "The CAGA Crypto community, a linchpin in the ever-evolving realm of Web3, extends its heartfelt thanks to its dedicated members whose unwavering support has been instrumental in shaping an ambitious future. The collective efforts of the CAGA team and its community are not merely about envisioning what lies ahead; they are actively molding it, with [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T04:00:11.000Z",
    "title": "Bank Of England Reconsiders: Potential Freeze On CBDC Launch Raises Concerns",
    "url": "https://www.newsbtc.com/cbdc-2/bank-of-england-reconsiders-potential-freeze-on-cbdc-launch-raises-concerns/",
    "description": "On January 25, the Bank of England (BoE) and HM Treasury published a response to the Consultation Paper regarding a ‘digital pound’ issued in February of 2023.  The consultation paper sought the public’s feedback on introducing a UK central bank digital currency (CDBC). Related Reading: Quant Soars 20% After Partnership With Bank Of England, BIS For CBDC Project Is The UK Ready To Introduce Their CBDC? The BoE and HM Treasury consider that introducing a CBDC could provide people with an &#8220;additional choice of safe payment that is fit for the future,&#8221; unlock development opportunities for businesses, and make day-to-day payments more &#8220;convenient&#8221; while reducing costs for those who accept them. The consultation response highlighted that the consultation marked the beginning of the design phase of the digital pound project and, according to the BoE and HM Treasury, the developing process of a CBDC and its platform will present lasting benefits for the digital economy of the country, regardless of the decision that is ultimately taken. The consultation collected over 50,000 responses from the public, including individuals, businesses, and academia. The feedback illustrated some general concerns the respondents had regarding the digital pound. Due to these concerns, the response by the BoE and UK Treasury determined that “it is too early” to decide whether to introduce a digital pound, as the feedback makes clear “that legislation introduced by the Government for a digital pound would need to provide protections to guarantee users’ privacy and control of their money.” Respondents Concern Over A Digital Pound The feedback received from the respondents brought forward two key concerns: privacy and the possibility of cash being replaced. The response clarified that a digital pound would not replace cash, any existing form of money, or payment like debit and credit cards. However, it would complement physical money and other payment methods “as a new form of digital money for use by households and businesses for their everyday payment needs.” To guarantee this, the response explained that “the Government has legislated to safeguard access to cash, ensuring that it would remain available even if a digital pound were launched.” Regarding user privacy, the response acknowledged the importance of ensuring trust in a CBDC issued by the central bank is essential. Therefore, to guarantee that privacy is a core design feature of a digital pound, the following measures were made: the BoE and HM Treasury won’t have access to users’ data. The BoE committed to exploring technological options to prevent the bank from accessing users’ data through its core infrastructure, and the BoE and UK Treasury would not program the digital pound. The BoE and HM Treasury assured their commitment “to maintaining an open and collaborative approach throughout this design phase” by increasing both organization’s engagement with experts from the industry, civil society, academics, and technical specialists. Lastly, the response confirms that experiments will be undertaken with companies “to test how a digital pound could work in the real world.” The launch of the CBDC will be decided after the design phase culminates around 2025. If the decision to build a digital pound is taken, its introduction will come only after both Houses of Parliament have passed the relevant legislation. Related Reading: How To Accept Crypto Payments And Who Accepts Bitcoins? Bitcoin is trading at $39,781.43 in the daily chart. Source: BTCUSDT on TradingView.com Featured image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-26T04:08:15.000Z",
    "title": "Arthur Hayes Reveals Two Altcoin Picks, Warns Bitcoin Has Further To Drop – Here’s His Outlook",
    "url": "https://dailyhodl.com/2024/01/25/arthur-hayes-reveals-two-altcoin-picks-for-next-dip-says-bitcoin-has-further-to-drop-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/reveal-two-further.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BitMEX co-founder Arthur Hayes says he thinks Bitcoin (BTC) will continue to drop in price, and that he&#8217;s prepared to load up on specific altcoins if it does. In a new analysis, Hayes notes that a 30% correction is due for the crypto king from its 2024 high of around $48,000, which it reached after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/25/arthur-hayes-reveals-two-altcoin-picks-for-next-dip-says-bitcoin-has-further-to-drop-heres-his-outlook/\">Arthur Hayes Reveals Two Altcoin Picks, Warns Bitcoin Has Further To Drop – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]