[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T19:57:21.000Z",
    "title": "Curve Founder Still Owes $80M Despite Raising Nearly $30M in Past Two Days",
    "url": "https://www.coindesk.com/business/2023/08/03/curve-founder-still-owes-80m-despite-raising-nearly-30m-in-past-two-days/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Michael Egorov is under liquidation pressure following the CRV’s recent price drop and Curve exploit."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T19:45:53.000Z",
    "title": "Curve Offers Hackers 10% Bounty in Exchange for Return of Crypto",
    "url": "https://www.coindesk.com/business/2023/08/03/curve-offers-hackers-10-bounty-in-exchange-for-return-of-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "\"We will pursue you from all angles with the full extent of the law,\" said Curve, Metronome and Alchemix."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T20:05:35.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T19:57:45.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T19:45:21.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T20:00:27.000Z",
    "title": "Shiba Inu’s DeFi Aspirations May Rattle DOGE’s Market As SHIB Turns To Digital IDs",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-defi-aspirations-may-rattle-doges-market-as-shib-turns-to-digital-ids/",
    "description": "Initially tagged as a meme coin, Shiba Inu has been reinventing itself, aiming to break away from its meme coin status and step into the league of serious Decentralized Finance (DeFi) contenders, according to a new report. A key step towards this transformation involves an innovation that is about to reshape the Shiba Inu ecosystem: Digital Identity Verification. Embracing Digital Identity In The Shiba Inu Ecosystem In a push to improve the platform&#8217;s credibility among users and governmental entities, the Shiba Inu project is said to integrate Digital Identity Verification into all its future developments. This includes the forthcoming Shibarium Layer 2 blockchain, an update eagerly anticipated by the community. Related Reading: Whale Activity Spikes As Shiba Inu Preps For Shibarium Launch Digital identities or Self-Sovereign Identities (SSI) are, in essence, the digital counterparts of traditional identification documents such as passports and driver’s licenses. In the digital realm, SSIs confer users greater control over their personal data and its distribution online. Currently, Shiba Inu developers are reportedly collaborating with community projects that use SHIB or plan to build on the Shibarium blockchain to prioritize SSI deployment. Shiba Inu&#8217;s lead developer, &#8220;Shytoshi Kusama,&#8221; was the one who revealed the project&#8217;s ambitious goals. He stated that they are currently &#8220;laying the groundwork for a new global standard in decentralized digital trust and international identity verification. In this way, Shibarium is the herald of a new digital age where faith in systems is restored and enhanced.” Implications For Dogecoin (DOGE) A shift in the crypto market dynamics may be on the horizon as Shiba Inu&#8217;s foray into DeFi may have ripple effects, most specifically on Dogecoin (DOGE). Both SHIB and DOGE started as meme coins, but Shiba Inu&#8217;s recent maneuvers may force a reconsideration of its stature. With the rise of digital identities and data protection as hot-button topics in areas like Canada and the European Union, Shiba Inu’s move to integrate digital identities into its ecosystem could elevate its reputation. This could lead to an increase in demand for SHIB tokens, which may exert upward pressure on the coin&#8217;s price. In contrast, Dogecoin, which remains firmly in its meme coin status, may find itself in an increasingly precarious position. Although, DOGE still has its biggest fan and supporter, Elon Musk behind it, should Shiba Inu succeed in its DeFi transformation, it may establish a new benchmark for meme coins and, in turn, create additional pressure on DOGE to redefine its strategic direction. Furthermore, currently, DOGE is recording more losses than Shiba Inu in the past 24 hours. Particularly, Dogecoin has dropped by nearly 4% in this period while SHIB has only seen a modest downtrend of just 0.4% Related Reading: Can Dogecoin Reach $0.85? Bullish Setup Hints At Potential For Advance Meanwhile, as DOGE records losses of 7.4% in the past week, SHIB has gone in the opposite direction with an upward trend of 4.5%. At the time of writing, DOGE currently trades at a price of $0.073 while SHIB trades at $0.00000822. It is worth noting that despite the noteworthy difference in both DOGE and SHIB price action, the former still remains at the top among the largest crypto by market cap with over $10 billion in market cap while the latter records $4.8 billion in market cap. Featured image from CoinDesk, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T20:00:44.000Z",
    "title": "Veteran Trader Tone Vays Issues Bitcoin Alert, Says One BTC Support Level Needs To Hold To Avoid ‘Massive Panic’",
    "url": "https://dailyhodl.com/2023/08/03/veteran-trader-tone-vays-issues-bitcoin-alert-says-one-btc-support-level-needs-to-hold-to-avoid-massive-panic/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/tone-says-one-needs.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran Bitcoin (BTC) analyst Tone Vays is warning that the flagship crypto asset is facing a pivotal moment. While revealing that he’s lowering the Bitcoin allocation in his portfolio, Vays tells his 122,000 YouTube subscribers that chances of BTC falling are now high as the selling pressure is elevated. &#8220;Bitcoin continues to struggle and as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/veteran-trader-tone-vays-issues-bitcoin-alert-says-one-btc-support-level-needs-to-hold-to-avoid-massive-panic/\">Veteran Trader Tone Vays Issues Bitcoin Alert, Says One BTC Support Level Needs To Hold To Avoid ‘Massive Panic’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T19:55:08.000Z",
    "title": "Crypto Trader Predicts Double Digit Rally for Shiba Inu Rival Dogecoin, Updates Outlook on Bitcoin",
    "url": "https://dailyhodl.com/2023/08/03/crypto-trader-predicts-double-digit-rally-for-shiba-inu-rival-dogecoin-updates-outlook-on-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/analyst-cowen-worst-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting a double-digit rally for popular meme asset Dogecoin (DOGE) while updating his outlook on the top crypto asset by market cap. The pseudonymous trader Kaleo tells his 593,000 Twitter followers that DOGE is “finally in the ape zone” and that accumulating the memecoin under $0.08 is a good [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/crypto-trader-predicts-double-digit-rally-for-shiba-inu-rival-dogecoin-updates-outlook-on-bitcoin/\">Crypto Trader Predicts Double Digit Rally for Shiba Inu Rival Dogecoin, Updates Outlook on Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]