[
  {
    "source": "CoinDesk",
    "date": "2023-08-30T07:32:08.000Z",
    "title": "Sam Bankman-Fried’s Planned Defense ‘Irrelevant’ Without More Details, Govt Says",
    "url": "https://www.coindesk.com/policy/2023/08/30/sam-bankman-frieds-planned-defense-irrelevant-without-more-details-govt-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The FTX founder’s constitutional rights are being violated because he is ‘unable’ to prepare his defense from jail, his lawyers argued."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T07:20:12.000Z",
    "title": "Binance launches new crypto on-ramp ‘Send Cash’ in Latin America amid crypto card service suspension",
    "url": "https://cryptoslate.com/binance-launches-new-crypto-on-ramp-send-cash-in-latin-america-amid-crypto-card-service-suspension/",
    "description": "<p>Binance is launching a new solution in Latin America called Send Cash, designed to facilitate more efficient crypto to local bank transfers. This advancement comes on the heels of Binance&#8217;s decision to discontinue its crypto card services in the same region, a move that reportedly affected less than 1% of its users. Available initially in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-launches-new-crypto-on-ramp-send-cash-in-latin-america-amid-crypto-card-service-suspension/\">Binance launches new crypto on-ramp &#8216;Send Cash&#8217; in Latin America amid crypto card service suspension</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T07:37:18.000Z",
    "title": "OpenAI Edges Closer to $1 Billion in Annual Revenue, Fueled by ChatGPT’s Popularity",
    "url": "https://www.cryptopolitan.com/openai-1-billion-in-annual-revenue/",
    "description": "The tech trailblazer OpenAI is on track to hit a remarkable milestone: an annual revenue of $1 billion. This achievement is underpinned by the wide embrace of its cutting-edge technology, including the ChatGPT AI bot, across numerous businesses. The company&#8217;s financial strides are reflected in its reportedly substantial monthly revenue of $80 million. Insiders who ... <a title=\"OpenAI Edges Closer to $1 Billion in Annual Revenue, Fueled by ChatGPT&#8217;s Popularity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-1-billion-in-annual-revenue/\" aria-label=\"More on OpenAI Edges Closer to $1 Billion in Annual Revenue, Fueled by ChatGPT&#8217;s Popularity\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T07:32:18.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T07:30:27.000Z",
    "title": "Crypto to bank made easy: Binance’s ‘Send Cash’ shakes up Latin America",
    "url": "https://www.cryptopolitan.com/crypto-to-bank-made-easy-binances-send-cash-shakes-up-latin-america/",
    "description": "Binance, the world&#8217;s leading cryptocurrency exchange, announced the launch of &#8220;Send Cash,&#8221; a new service to facilitate crypto-to-bank account transfers in Latin America. The service, which became operational on August 29, is available to users in nine countries, including Colombia, Honduras, Guatemala, Argentina, Costa Rica, Paraguay, the Dominican Republic, Panama, and Mexico. Initially, the service ... <a title=\"Crypto to bank made easy: Binance&#8217;s &#8216;Send Cash&#8217; shakes up Latin America\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-to-bank-made-easy-binances-send-cash-shakes-up-latin-america/\" aria-label=\"More on Crypto to bank made easy: Binance&#8217;s &#8216;Send Cash&#8217; shakes up Latin America\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T07:28:30.000Z",
    "title": "AI Chatbot’s Cancer Treatment Recommendations Fall Short in Accuracy, Study Finds",
    "url": "https://www.cryptopolitan.com/ai-chatbots-cancer-treatment-accuracy-study/",
    "description": "In a recent study published in JAMA Oncology, the accuracy and reliability of AI chatbots powered by large language models (LLMs) were evaluated in the context of cancer treatment recommendations. As AI technology becomes more prevalent in healthcare, concerns arise about its potential to provide incorrect information, leading to harmful consequences. The study focuses on ... <a title=\"AI Chatbot&#8217;s Cancer Treatment Recommendations Fall Short in Accuracy, Study Finds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-chatbots-cancer-treatment-accuracy-study/\" aria-label=\"More on AI Chatbot&#8217;s Cancer Treatment Recommendations Fall Short in Accuracy, Study Finds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T07:14:46.000Z",
    "title": "SEBA Bank gains preliminary approval for crypto services in Hong Kong",
    "url": "https://www.cryptopolitan.com/seba-bank-crypto-services-in-hong-kong/",
    "description": "In a significant development for the cryptocurrency industry, SEBA Bank&#8217;s Hong Kong division has secured in-principle approval from the Hong Kong Securities and Futures Commission (SFC). This approval allows SEBA Hong Kong to engage in a range of crypto-related activities, including over-the-counter derivatives, advisory services on virtual assets, and asset management for discretionary accounts in ... <a title=\"SEBA Bank gains preliminary approval for crypto services in Hong Kong\" class=\"read-more\" href=\"https://www.cryptopolitan.com/seba-bank-crypto-services-in-hong-kong/\" aria-label=\"More on SEBA Bank gains preliminary approval for crypto services in Hong Kong\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-30T07:29:33.000Z",
    "title": "Grayscale Victory Over SEC: What Does It Mean For The Future Of Bitcoin ETFs",
    "url": "https://nulltx.com/grayscale-victory-over-sec-what-does-it-mean-for-the-future-of-bitcoin-etfs/",
    "description": "The crypto community is certainly optimistic after the Grayscale victory over the SEC. The court&#8217;s ruling that the SEC had exceeded its authority by blocking the conversion of Grayscale&#8217;s Bitcoin Trust (GBTC) into an ETF has been seen as a major step forward for the legitimization of cryptocurrencies. Will The SEC Appeal? It is still [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T07:10:10.000Z",
    "title": "Shiba Inu Price Faces Big Move: Triple Bottom Or Descending Triangle?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-triple-bottom-descending-triangle/",
    "description": "Shiba Inu (SHIB) price is once again at a crucial crossroads. Currently, it&#8217;s down a staggering 91% from its all-time high (ATH) of $0.00008845, recorded in October 2021. Over the past year, the token has been on a consistent downtrend, marking lower highs and lower lows on the monthly time frame. But all is not bleak for SHIB investors. The recent relaunch of Shibarium, a layer 2 blockchain, is a beacon of hope. This move is seen as Shiba Inu&#8217;s attempt to transition from its meme coin status to a more serious player in the crypto world, aiming to enable applications for millions across a vast ecosystem. Shiba Inu Faces A Double-Edged Sword From a technical chart analysis perspective, there&#8217;s another glimmer of hope: the formation of a triple bottom pattern. This pattern, if validated, could signal the end of SHIB&#8217;s two-year-long downtrend. However, it&#8217;s a double-edged sword. If invalidated, this pattern could morph into a descending triangle, potentially pushing SHIB to new lows. Related Reading: Shiba Inu Community Celebrates New Milestone One Day After Shibarium Goes Public A closer look at SHIB&#8217;s weekly chart reveals the formation of this triple bottom pattern. A triple bottom is a bullish chart pattern. It&#8217;s characterized by three roughly equal lows bouncing off a support level, followed by a breakout above the resistance. This visual pattern indicates a shift in power from sellers (bears) to buyers (bulls). Remarkably, the formation of a triple bottom is often seen as an opportunity for traders to enter a bullish position, especially after a prolonged bearish trend, as is the case with SHIB. A few rules typically qualify triple bottoms. An existing downtrend should precede the pattern. SHIB checks this box. Second, the three lows should be roughly equal in price, allowing for a horizontal trendline. SHIB fits this criterion as well. Third, the volume should decrease throughout the pattern, indicating weakening bears, while bullish volume should surge as the price breaks through the final resistance. The chart highlights this for SHIB. To delve deeper into the specifics: SHIB&#8217;s first bottom was recorded when it dropped to the $0.00000715 mark in June 2022. A subsequent recovery was short-lived, causing SHIB to fall to its second bottom at $0.00000781 in December 2021. The third bottom was formed at $0.0000060 in June 2023, after another recovery attempt faced resistance and marked a lower high. Related Reading: Shibarium Is Live And Scaling, What’s Ahead For Shiba Inu Price? However, the danger lies in the striking similarity between the triple bottom and the descending triangle. If the support at $0.00000715 breaks, SHIB could validate the descending triangle and target its previous yearly low at $0.000006. Holding this level is crucial; otherwise, SHIB might enter uncharted territory. It&#8217;s worth noting that traders often seek confirmation of a triple bottom using other technical indicators. An oversold Relative Strength Index (RSI) is one such indicator. Currently, SHIB&#8217;s weekly RSI stands at 45 (neutral), leaning more towards the possibility of a descending triangle pattern. But if the triple bottom plays out, the rewards could be substantial. The first major target for SHIB could be the 23.6% Fibonacci retracement level at $0.00002545, translating to a potential gain of approximately 200% from its current price. Featured image from Euro Weekly News, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T07:32:38.000Z",
    "title": "Crypto Analyst Ali Martinez Predicts Possible Bitcoin Dip to $20,590; Investors Rush To InQubeta Presale",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-ali-martinez-predicts-possible-bitcoin-dip-to-20590-investors-rush-to-inqubeta-presale/",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-107.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-107.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-107-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-107-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto industry relies on statistics for analyzing tokens. The UTXO Realized Price Distribution (URPD) is a significant metric on the Bitcoin (BTC) blockchain, representing the BTC balance following a transaction on the network. Analysis based on this metric has stirred the market, as Ali Martinez, a renowned crypto analyst, predicted a potential Bitcoin dip [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T07:13:40.000Z",
    "title": "Binance (BNB) Gears Up for Smart Chain Upgrade and Hard Fork on August 30: What Investors Should Note",
    "url": "https://www.crypto-news-flash.com/binance-bnb-gears-up-for-smart-chain-upgrade-and-hard-fork-on-august-30-what-investors-should-note/",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-104x69.jpg 104w\" sizes=\"(max-width: 800px) 100vw, 800px\" />The Binance Chain (BSC) Hertz hard fork will neither introduce a new burn mechanism nor the concept of GasTip. The upcoming network upgrade will introduce some London and Berlin upgrades from Ethereum to BSC for DeFi compatibility. The leading cryptocurrency exchange by daily traded volume and registered users, Binance, has announced that it will undertake [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T07:35:52.000Z",
    "title": "Bitcoin Surges As Grayscale Secures Partial Victory in SEC Lawsuit",
    "url": "https://coinedition.com/bitcoin-surges-as-grayscale-secures-partial-victory-in-sec-lawsuit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"sec\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Crypto-Auditors-Come-Under-SEC-Scrutiny-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin, the largest cryptocurrency by market cap, witnessed a substantial spike of 6% on Tuesday, following a court ruling that favored the investment management company Grayscale Investments in a lawsuit against the Securities and Exchange Commission (SEC). In a filing dated August 29, the court declared that the SEC is not justifiable in the denial [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-surges-as-grayscale-secures-partial-victory-in-sec-lawsuit/\">Bitcoin Surges As Grayscale Secures Partial Victory in SEC Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]