[
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T14:25:01.000Z",
    "title": "Bankrupt Celsius transfers $24M worth of altcoins to FalconX, OKX",
    "url": "https://cryptoslate.com/bankrupt-celsius-transfers-24m-worth-of-altcoins-to-falcon-okx/",
    "description": "<p>Bankrupt crypto lender Celsius Network sent around $24 million worth of altcoins to OKX and FalconX wallets during the early hours of June 17. Data from Arkham Intelligence shows that the bulk of the funds were sent to the cryptocurrency brokerage firm, FalconX. The company received $8.46 million worth of Chainlink (LINK), $7.71 million in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bankrupt-celsius-transfers-24m-worth-of-altcoins-to-falcon-okx/\">Bankrupt Celsius transfers $24M worth of altcoins to FalconX, OKX</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T14:28:36.000Z",
    "title": "AAG Marks A New Era Of Web3 With Its Event In Manila",
    "url": "https://cryptodaily.co.uk/2023/07/aag-marks-a-new-era-of-web3-with-its-event-in-manila",
    "description": "<p>MANILA, PHILIPPINES, July 17th, 2023, Chainwire</p><p>AAG, a Web3 infrastructure company, successfully held its maiden live event on June 21, further bolstering the Philippines' immersion into the Web3 ecosystem.</p><p>The event, a confluence of Web2 and Web3 aficionados, saw the participation of industry leaders like Lazada, GCash, and DITO CME, along with renowned key opinion leaders (KOLs) and strategic partners.</p><p>CEO and co-founder of AAG, Jack Vinijtrongjit, emphasized, \"AAG's commitment to integrating the worlds of Web2 and Web3 is instrumental in shaping the future. We are thrilled to lead this transformation and collaborate with enterprises on this exciting journey.\"</p><p>Key Highlights of the Event:</p><ol><li>The launch of AAG's MetaOne Affiliate Program was a significant milestone. This path-breaking program offers users of AAG&rsquo;s seedless self-custody wallet an opportunity to earn lifetime fee shares up to 80%. Furthermore, the program boasts enticing rewards, including monthly iPhone giveaways and a chance to win a BMW car!</li><li>The event was graced by around 50 prominent KOLs, with a cumulative follower base of over 6 million.</li><li>Leading Web3 companies such as Lazada, GCash, and DITO CME were present, contributing their insights on the latest evolutions in the Web3 arena.</li></ol>Donald Lim, COO of DITO CME, joined Jack Vinijtrongjit in a panel discussion about the transformative potential of Web3 technology on established businesses. Vinijtrongjit said, \"Businesses can leverage the innovative power of Web3 and blockchain technology to revolutionize customer relationship management. AAG, through its advanced tech stack, is enabling businesses to exploit Web3 capabilities and discover new avenues in their existing business models.\"<p>The successful conclusion of AAG's event in Manila underlined the burgeoning potential of the Web3 world, not only in the Philippines but on a global scale.</p><p>&nbsp;</p><p>About AAG</p><p>AAG is a web3 infrastructure company focused on providing software that helps simplify interactions with blockchain applications and the Metaverse for both mainstream users and traditional companies. AAG provides a secure and easy-to-use MetaOne&reg; wallet, as well as infrastructure software, such as a cross-chain search engine and Saakuru blockchain for enterprise companies. With the belief that education is the key to unlock the potential of web3, AAG is also exploring the concept of Learn-and-Earn with the mission of enabling economic opportunities worldwide via the Metaverse economy. AAG aims to bring 1 billion people into the Metaverse economy by 2030.</p><p>For more information about AAG, visit: AAG Linktree</p><p></p>ContactCEOJack Vinijtrongjitpartnership@aag.ventures"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T14:15:00.000Z",
    "title": "BRISE Outshines ETH, BNB, SOL, with Usual Price Gains, as Listing on 10 Major Exchanges Nears",
    "url": "https://cryptodaily.co.uk/2023/07/brise-outshines-eth-bnb-sol-with-usual-price-gains-as-listing-on-10-major-exchanges-nears",
    "description": "<table style=\"width: 675px;\">\n<tbody>\n<tr>\n<td class=\"s8\" style=\"width: 665px;\">\n\n● Bitgert celebrates its second anniversary by listing its BRISE on ten exchanges.\n● The platform also introduces a meme character for BRISE to bring a new level of fun and engagement to the community.\n● While BRISE maintained over 16% over the week, ETH and BNB barely had single-digit gains.\n\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"s5\">BRISE, the native token of the Bitgert crypto platform, has recently led the crypto market with phenomenal price gains. In a report that captured the eventful week performance of BRISE, it was reported that the coin gained over 30%, pushing its crypto market cap to over $103 million.</p>\n<p class=\"s5\">Contrasting the positive growth of BRISE, other major cryptocurrencies like Ethereum (ETH), Binance Coin (BNB), Solana (SOL), and Cardano (ADA) experienced losses in the last 24 hours. According to data from CoinMarketCap, while BRISE maintained over 16% upward trajectory over the past seven days, ETH and BNB barely had single-digit gains.</p>\n<p class=\"s5\">Additionally, BRISE has climbed three steps up the ranking of the most significant coins within two weeks, gaining more than $3 million in market cap. The interest in the coin can be attributed to exciting development, celebrations, and collaborations around Bitgert.</p>\n<p class=\"s5\">In a recent tweet, the project announced the listing of its token, BRISE, on ten major crypto exchanges, inviting the community to join in this significant milestone.</p>\n<p class=\"s5\">&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">🎉 Celebrating our 2nd anniversary which happened on 7th July 2023! 🎂 As part of the festivities, we're thrilled to announce the listing of our token on 10 major crypto exchanges. Join us in this milestone moment! 🚀#BRISE #bitgert pic.twitter.com/YA8viNIzCE</p>\n&mdash; Bitgert - $BRISE (@bitgertbrise) July 11, 2023\n<p>\n\n</p>\n<p class=\"s5\">The image shared in the tweet provided a timeline of the exchange listings scheduled throughout August. The first listing will come on August 1, with subsequent ones coming within about four days intervals until August 30.</p>\n<p class=\"s5\">Adding more fun and engagement to its ecosystem, Bitgert introduced a meme character for its native token, BRISE. It expressed enthusiasm for the new level of entertainment that the character would bring, promising comical posts and community engagements.</p>\n\n<p dir=\"ltr\" lang=\"en\">🚨Big news alert🚨 We've created our very own meme character for #BRISE! Get ready for a whole new level of fun as we spice things up with hilarious announcements and community interactions.Guess the meme character and let us know in comments. pic.twitter.com/vOnJPiQVWp</p>\n&mdash; Bitgert - $BRISE (@bitgertbrise) July 14, 2023\n<p>\n\n</p>\n<p class=\"s5\">The community was invited to participate in the guessing game and share their guesses in the comments.</p>\n<p class=\"s5\">Furthermore, the platform has partnered with ChangeNow to allow users to purchase BRISE using fiat currency, enhancing accessibility for investors. Additionally, the NFT platform NFTFeed is integrated into the Bitgert ecosystem to provide liquidity to the NFT market. Similarly, &nbsp;the partnership with the gaming platform Lifty.io expanded Bitgert's reach into the gaming sector.</p>\n<p class=\"s5\">While BRISE currently has a market share of around $103 million, the team asked the crypto community to prepare for a multi-billion market capitalization shortly.</p>\n<p class=\"s5\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T14:27:12.000Z",
    "title": "Crypto industry trapped as global regulations tighten",
    "url": "https://www.cryptopolitan.com/crypto-industry-trapped-global-regulations/",
    "description": "The dawn of a more stringent global regulatory era looms over the crypto industry as it grapples with a unified global push for enhanced safeguards. This comes in response to notorious incidents involving cryptocurrency firms, including the collapse of FTX exchange, marking a pivotal moment in the industry&#8217;s path towards maturity. Introducing financial safeguards: A ... <a title=\"Crypto industry trapped as global regulations tighten\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-industry-trapped-global-regulations/\" aria-label=\"More on Crypto industry trapped as global regulations tighten\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T14:17:14.000Z",
    "title": "AI Taskforce Head Acknowledges Inevitable Automation of Jobs, Calls for Rethinking Workforce",
    "url": "https://www.cryptopolitan.com/ai-taskforce-head-acknowledges-automation/",
    "description": "Ian Hogarth, the newly appointed head of the government’s new AI Taskforce, has highlighted the inevitability of more jobs being automated as artificial intelligence systems advance. Hogarth stressed the importance of rethinking how people work globally, acknowledging that winners and losers will emerge based on job distribution resulting from AI implementation. While some argue that AI ... <a title=\"AI Taskforce Head Acknowledges Inevitable Automation of Jobs, Calls for Rethinking Workforce\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-taskforce-head-acknowledges-automation/\" aria-label=\"More on AI Taskforce Head Acknowledges Inevitable Automation of Jobs, Calls for Rethinking Workforce\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T14:15:44.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T14:30:33.000Z",
    "title": "Stablecoin Exchange Deposits Remain Low, What Does It Mean For Bitcoin?",
    "url": "https://www.newsbtc.com/stablecoin/stablecoin-exchange-deposits-remain-low-mean-bitcoin/",
    "description": "On-chain data shows the stablecoin exchange deposits have remained low recently. Here&#8217;s what this may mean for Bitcoin. Stablecoin Exchange Deposits Stay Low, While Withdrawals Jump As pointed out by an analyst in a CryptoQuant post, the fact that the stablecoin exchange withdrawals have spiked while deposits have stayed low may be slightly alarming for BTC. There are two indicators of relevance here: the &#8220;stablecoin exchange withdrawing transactions&#8221; and the &#8220;stablecoin exchange depositing transactions.&#8221; As their names already imply, these metrics track the total number of withdrawals and deposit transfers, respectively, that investors of the ERC-20 stables are making right now. Generally, investors seek the safety of these fiat-tied tokens whenever they want to escape the volatility associated with the other assets in the sector. Eventually, when these holders think that the prices are right to jump back into the volatile markets, they swap their stables back for their desired cryptocurrency. These investors usually make use of centralized exchanges for this purpose. So, when the exchange withdrawing transactions are high, it can be a sign that holders are exchanging coins like Bitcoin for stablecoins right now. Related Reading: Here’s What On-Chain Data Reveals About XRP Rally On the other hand, the deposits being high can imply these investors are looking to buy volatile assets using their stables. Naturally, in the former case, Bitcoin and others may feel a bearish effect from the selling, while in the latter case, the prices might see a bullish boost. Now, here is a chart that shows the trend in the stablecoin exchange withdrawing and depositing transactions over the past couple of years: Looks like only one of these two metrics has had a high value recently &#124; Source: CryptoQuant As displayed in the above graph, the stablecoin exchange depositing transactions metric has been relatively low for a while now. This would suggest that there may not be enough demand for converting stables into other assets right now. From the graph, it&#8217;s visible that the last time the indicator spiked was back in March of this year. Following the deposits back then, Bitcoin observed a sharp rebound in its price as the rally saw a revival. The timing of these inflows might mean that it was the buying from these stablecoin holders that had provided the fuel for the BTC surge. Related Reading: Bitcoin MVRV At Critical Level: Will A Break Happen? In the graph, the quant has marked other similar past instances as well. It looks like the BTC price generally observes a rise after stablecoin deposits spike, given that the withdrawals are low at the same time. Recently, however, only the stablecoin withdrawals have observed a spike, implying that investors are taking these tokens away from exchanges, likely to hold onto them for extended periods in self-custody. As there aren&#8217;t any deposits happening to counteract this, the BTC price has been struggling recently. If the trend continues and more stablecoin withdrawals continue to take place, it&#8217;s possible that the cryptocurrency could take a hit in the short term. Bitcoin Price At the time of writing, Bitcoin is trading around $30,200, up 1% in the last week. BTC has taken a hit recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T14:16:49.000Z",
    "title": "Stellar Emerges as Leader in Tokenization: Franklin Templeton and WisdomTree Issue $300M+ in Digital Funds",
    "url": "https://www.crypto-news-flash.com/stellar-emerges-as-leader-in-tokenization-franklin-templeton-and-wisdomtree-issue-300m-in-digital-funds/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-emerges-as-leader-in-tokenization-franklin-templeton-and-wisdomtree-issue-300m-in-digital-funds",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Stellar protocol is fast becoming prominent as an outfit for tokenizing assets. Since the launch of the Stellar-backed WTSY, over $300 million is now tokenized as digital funds. Stellar (XLM) is currently leading the tokenization of assets in treasuries and digital funds according to a recent Reddit post. So far, over $300 million in tokenized [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-17T14:30:00.000Z",
    "title": "Crypto Trader Forecasts Big Leap for XRP, Says Do Not Mistake Bitcoin Consolidation for Weakness",
    "url": "https://dailyhodl.com/2023/07/17/crypto-trader-forecasts-big-leap-for-xrp-says-do-not-mistake-bitcoin-consolidation-for-weakness/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/xrp-ledger-used.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist says that XRP will likely witness a deluge of capital inflows following the favorable ruling in the SEC&#8217;s lawsuit against Ripple. Pseudonymous analyst Credible Crypto tells his 342,800 Twitter followers that the fear, uncertainty and doubt (FUD) surrounding XRP is no longer an issue after Judge Analisa Torres ruled that Ripple’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/17/crypto-trader-forecasts-big-leap-for-xrp-says-do-not-mistake-bitcoin-consolidation-for-weakness/\">Crypto Trader Forecasts Big Leap for XRP, Says Do Not Mistake Bitcoin Consolidation for Weakness</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]