[
  {
    "source": "Cointelegraph",
    "date": "2023-06-25T03:10:58.000Z",
    "title": "$794K SIM swap hacker PlugwalkJoe sentenced to five years in prison ",
    "url": "https://cointelegraph.com/news/sim-swap-hacker-plugwalk-joe-sentenced-to-five-years-in-prison",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/fa05026d-5ab9-44c1-a2a5-4c67416c8b61.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The hacker managed to steal $794,000 worth of crypto from an exchange via a SIM swap attack on an exec, but ultimately he didn’t cover his tracks well.  </p>\n                    <p><p>British<strong> </strong>Hacker Joseph O’Connor, also known online as PlugwalkJoe, has been sentenced to five years in U.S. prison for his role in stealing $794,000 worth of cryptocurrency via a <a href=\"https://cointelegraph.com/app/public/index.php/news/plugwalkjoe-indicted-for-784k-cryptocurrency-theft-scheme/amp\">SIM swap attack on a crypto exchange executive</a> back in April 2019. </p><p>O’Connor was initially arrested in Spain in July 2021 and was extradited to the U.S. on April 26, 2023. In May he pled guilty to a slew of charges relating to conspiracy to commit computer intrusions, conspiracy to commit wire fraud, and conspiracy to commit money laundering, to name a few. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">plugwalkjoe is getting his sentence in 5 days, so it’s time to bring this gem back <a href=\"https://t.co/OOBqD2FaFA\">pic.twitter.com/OOBqD2FaFA</a></p>&mdash; rip @ironic (@ripironic) <a href=\"https://twitter.com/ripironic/status/1670343087695233024?ref_src=twsrc%5Etfw\">June 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The prison sentence was <a href=\"https://www.justice.gov/usao-sdny/pr/uk-citizen-sentenced-five-years-prison-cybercrime-offenses\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> in a June 23 statement from the U.S. Attorney's Office of the Southern District of New York. </p><p>“In addition to the prison term, O’Connor was sentenced to three years of supervised release. O’Connor was further ordered to pay $794,012.64 in forfeiture,” the statement reads. </p><p>The hacked crypto exec has not been named, however after SIM swapping them, O’Connor gained unauthorized access to accounts and computing systems belonging to the exchange that the exec worked at. </p><blockquote>“After stealing and fraudulently diverting the stolen cryptocurrency, O’Connor and his co-conspirators laundered it through dozens of transfers and transactions and exchanged some of it for Bitcoin using cryptocurrency exchange services.” </blockquote><p>“Ultimately, a portion of the stolen cryptocurrency was deposited into a cryptocurrency exchange account controlled by O’Connor,” the statement adds. </p><p>O’Connor’s sentence also covers offenses relating to the major Twitter hack of July 2020, which ultimately fetched him and his crew around $120,000 worth of ill-gotten crypto gains. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Time for a story that combines the craziness of crypto, the perils of hacking, and the consequences of shady actions. Buckle up as we explore the case of Joseph James O&#39;Connor, aka PlugwalkJoe, the mastermind behind the infamous Twitter hack of July 2020!<a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a></p>&mdash; Crypto Camel  (@CamelChronicles) <a href=\"https://twitter.com/CamelChronicles/status/1672674384983588870?ref_src=twsrc%5Etfw\">June 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The hackers deployed a series of “social engineering techniques” and SIM-swapping attacks to hijack around 130 prominent Twitter accounts, along with two large accounts on TikTok and Snapchat. </p><p>“In some instances, the co-conspirators took control themselves and used that control to launch a scheme to defraud other Twitter users. In other instances, the co-conspirators sold access to Twitter accounts to others,” the statement reads.</p><p>As part of this scheme, O’Connor attempted to blackmail the Snapchat victim by threatening to publicly release private messages if they didn’t make posts promoting O’Connor’s online persona. </p><p>Additionally, O’Connor also “stalked and threatened” a victim, and “orchestrated a series of swatting attacks” on them by falsely reporting emergencies to authorities.</p><h3>SIM swaps are still a big issue </h3><p>A SIM swap attack involves a bad actor taking control of a victim’s phone number by linking it to another sim card controlled by them.</p><p>As a result, the bad actors can then re-route the victim’s calls and messages to a device controlled by them, and gain access to any accounts the victim uses <a href=\"https://cointelegraph.com/news/certik-says-sms-is-the-most-vulnerable-form-of-2fa-in-use\">SMS-based two-factor authentication</a> on. </p><p>The scheme is generally used to dupe followers of prominent accounts into clicking phishing links that ultimately end up swiping their crypto assets. </p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/darknet-hackers-are-selling-crypto-accounts-for-as-low-as-30-a-pop\"><strong>Darknet hackers are selling crypto accounts for as low as $30 a pop</strong></a></p><p>Despite O’Connor’s antics occurring roughly three years ago, SIM swapping attacks continue to be a significant issue in the crypto sector. </p><p>Earlier this month blockchain sleuth ZachXBT <a href=\"https://cointelegraph.com/news/scammers-steal-almost-1m-after-hijacking-8-prominent-crypto-twitter-accounts\">identified a group of scammers</a> that SIM-swapped at least eight accounts belonging to well-known figures in crypto, including Pudgy Penguins founder Cole Villemain, DJ and NFT collector Steve Aoki and Bitcoin Magazine editor Pete Rizzo. </p><p>According to ZachXBT, the group stole almost $1 million by promoting phishing links from the hacked accounts. </p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>‘Moral responsibility’ — Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-25T03:30:48.000Z",
    "title": "US Treasury Secretary Defends Dollar Dominance as Emerging Markets Push to De-Dollarize",
    "url": "https://news.bitcoin.com/us-treasury-secretary-defends-dollar-dominance-as-emerging-markets-push-to-de-dollarize/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Treasury Secretary Defends Dollar Dominance as Emerging Markets Push to De-Dollarize\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellen-defends-usd1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Treasury Secretary Janet Yellen has defended the dominance of the U.S. dollar amid rising efforts by emerging countries to de-dollarize. Brazilian President Luiz Inácio Lula da Silva, in particular, is set to raise the issue of de-dollarization at the next BRICS meeting. “There is a very good reason why the dollar is used widely [&#8230;]"
  }
]