[
  {
    "source": "Crypto Daily",
    "date": "2023-11-13T08:50:42.000Z",
    "title": "Cardano Founder Charles Hoskinson Eyes Partnership With Kraken",
    "url": "https://cryptodaily.co.uk/2023/11/cardano-founder-charles-hoskinson-eyes-partnership-with-kraken",
    "description": "Cardano founder Charles Hoskinson has hinted at a potential collaboration with cryptocurrency exchange Kraken, extending a proposal to CEO Jesse Powell on plans for the exchange’s Layer-2."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-13T09:00:17.000Z",
    "title": "Poloniex Hack Analysis: North Korean Hacking Syndicate Lazarus Group Suspected in Wallet Breach",
    "url": "https://news.bitcoin.com/poloniex-hack-analysis-north-korean-hacking-syndicate-lazarus-group-suspected-in-wallet-breach/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Poloniex Hack Analysis: North Korean Hacking Syndicate Lazarus Group Suspected in Wallet Breach\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lazzzz.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The North Korea-backed hacker group is thought to be behind the Nov. 10 Poloniex hot wallet breach. A market research platform has said &#x201C;a leakage of the private key&#x201D; could be the reason why the hot wallet got breached. Private Key Leakage According to X-explore, a market research platform, the recent Poloniex hacking incident was [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T09:12:03.000Z",
    "title": "Russia-Linked Hackers Acknowledge Responsibility for OpenAI Outage Amidst Alleged Israel Connection",
    "url": "https://www.cryptopolitan.com/russia-linked-hackers-openai-outage/",
    "description": "Unbelievably, Anonymous Sudan—a hacker group allegedly associated with Russia—has surfaced as the mastermind behind the latest wave of disruptions affecting OpenAI&#8217;s popular chatbot, ChatGPT. The group&#8217;s motive, as declared on the Telegram messaging app on Nov. 8, points accusing fingers at OpenAI&#8217;s alleged support of Israel through its exploration of investment opportunities.  The fallout from ... <a title=\"Russia-Linked Hackers Acknowledge Responsibility for OpenAI Outage Amidst Alleged Israel Connection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/russia-linked-hackers-openai-outage/\" aria-label=\"More on Russia-Linked Hackers Acknowledge Responsibility for OpenAI Outage Amidst Alleged Israel Connection\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T09:09:28.000Z",
    "title": "AI in the Classroom: Transforming Education at Princeton",
    "url": "https://www.cryptopolitan.com/ai-in-the-classroom-transforming-education/",
    "description": "As the influence of large language models (LLMs) like ChatGPT continues to grow, Princeton University is at the forefront of exploring the intersection of artificial intelligence and education. Some professors at the prestigious institution are harnessing AI as a pedagogical tool, while others are treading cautiously amid concerns about academic integrity. &#8220;Blockie&#8221; &#8211; ChatGPT on ... <a title=\"AI in the Classroom: Transforming Education at Princeton\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-the-classroom-transforming-education/\" aria-label=\"More on AI in the Classroom: Transforming Education at Princeton\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T08:55:46.000Z",
    "title": "Europe’s Secret Weapon to Challenge Big Tech in Generative AI",
    "url": "https://www.cryptopolitan.com/europe-secret-weapon-to-challenge-tech-in-ai/",
    "description": "Generative AI is currently the hottest ticket in tech, with major players like Microsoft, Google, Amazon, and Meta dominating the scene with their large language models (LLMs). These LLMs are widely seen as the next major breakthrough in technology. However, there&#8217;s a glimmer of hope for Europe as it seeks to challenge Big Tech&#8217;s supremacy, ... <a title=\"Europe&#8217;s Secret Weapon to Challenge Big Tech in Generative AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europe-secret-weapon-to-challenge-tech-in-ai/\" aria-label=\"More on Europe&#8217;s Secret Weapon to Challenge Big Tech in Generative AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T08:50:49.000Z",
    "title": "Hong Kong eyes Bitcoin integration in revamped investor immigration scheme",
    "url": "https://www.cryptopolitan.com/hong-kong-lawmaker-proposes-bitcoin-inclusion-revived-investment-immigration-program/",
    "description": "Hong Kong’s Legislative Council, from the Science and Technology Innovation Community, has proposed the inclusion of Bitcoin purchased on licensed exchanges as part of the city&#8217;s revamped investment immigration program, according to a local news report. The proposal comes as Hong Kong reactivates its investment immigration program after an eight-year hiatus, setting an entry threshold ... <a title=\"Hong Kong eyes Bitcoin integration in revamped investor immigration scheme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-lawmaker-proposes-bitcoin-inclusion-revived-investment-immigration-program/\" aria-label=\"More on Hong Kong eyes Bitcoin integration in revamped investor immigration scheme\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T08:41:44.000Z",
    "title": "The Wild AI Talent Market of 2023: Salaries Soaring and SWAT Teams for Hire",
    "url": "https://www.cryptopolitan.com/ai-talent-of-2023-salaries-soaring-and-swat/",
    "description": "Parents used to advise their children to pursue careers in law, banking, or the &#8220;Big Four&#8221; for quick riches, but if the past 12 months are any indication, the next generation of graduates is flocking to data science and machine learning. With PhD students commanding salaries of up to $400k right out of university, and ... <a title=\"The Wild AI Talent Market of 2023: Salaries Soaring and SWAT Teams for Hire\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-talent-of-2023-salaries-soaring-and-swat/\" aria-label=\"More on The Wild AI Talent Market of 2023: Salaries Soaring and SWAT Teams for Hire\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T08:45:16.000Z",
    "title": "Arthur Hayes Unveils His Playbook For Bitcoin, Crypto And Big Tech",
    "url": "https://www.newsbtc.com/news/arthur-hayes-playbook-bitcoin-crypto-big-tech/",
    "description": "In his latest essay, Arthur Hayes, the co-founder of BitMEX, has laid out his investment playbook in the current global economic landscape, focusing on the potential of Bitcoin, cryptocurrencies, big tech, and traditional financial markets. Dumb Trades Hayes begins with a blunt critique of traditional investment strategies, particularly the purchase of long-term bonds in the current economic climate. He explicitly states, &#8220;The dumbest thing one can do is purchase long-term bonds with a buy-and-hold mentality.&#8221; Hayes explains this viewpoint by highlighting the risks associated with these bonds, especially when liquidity conditions shift, saying, &#8220;You will experience a market-to-market gain today, but&#8230;the market will start to discount the impact of further Reverse Repo [RRP] balance decreases and long-end bond yields will creep higher, which means prices fall.&#8221; Related Reading: The Big Question: Will Bitcoin Hit $100,000 By 2024? Spotlight On Potential Drivers Moving on to smarter investment approaches, Hayes acknowledges leveraging short-term debt, as exemplified by Stan Druckenmiller. Hayes notes that Stan Druckenmiller went mega-long 2-year treasuries. He remarked, &#8220;Great trade, brah! Not everyone has the stomach for the best expressions of this trade (hint: it’s crypto). Therefore, if all you can trade are manipulated TradFi assets like government bonds and stocks, then this isn’t a bad option.&#8221; Hayes also argues that a trade &#8220;that’s a bit better than the medium-smart trade (but still not the smartest) is to go long on big tech.&#8221; Hayes focuses on AI-related companies. He identifies AI as a pivotal future technology, arguing, &#8220;Everyone knows that everyone knows that AI is the future. This means anything AI-related will pump, because everyone is buying it too. Tech stocks are long-duration assets and will benefit from cash being trash once more.&#8221; Smart Trades: Bitcoin And Crypto However, the smartest trade is to go long crypto, which has significantly outperformed other assets relative to the increase in central bank balance sheets. Hayes presented the chart below, comparing the performance of Bitcoin, Nasdaq 100, S&#38;P 500, and Gold against the Fed&#8217;s balance sheet since March 2020, highlighting Bitcoin&#8217;s exceptional growth. Hayes identifies Bitcoin as the primary investment target, describing it as &#8220;money and only money.&#8221; Following Bitcoin, he points to Ether as the commodity powering the Ethereum network. &#8220;Ether is the commodity that powers the Ethereum network, which is the best internet computer.&#8221; He categorizes other cryptocurrencies, stating, &#8220;Bitcoin and Ether are crypto’s reserve assets. Everything else is a shitcoin.&#8221; He further elaborates on alternative layer-one blockchains like Solana, calling them &#8220;all overhyped, me-too, pieces of shit that won’t overtake Ethereum in terms of active developers, dApp activity, or Total Value Locked.&#8221; Related Reading: When Is the Next BTC Halving Date? Bitcoin Halving Guide Hayes also discusses decentralized applications (dApps) and their tokens. He finds this sector exciting for its high-return potential, though he acknowledges the risks: &#8220;Finally, all manner of dApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return. I love shitcoins, so don’t ever call me a maxi!&#8221; Geo-Economic Factors Regarding his investment strategy in the context of current economic fluctuations, Hayes explains his focus on the net of RRP minus Treasury General Account (TGA) to gauge market liquidity, which informs his decisions on T-bill sales and Bitcoin purchases. He emphasizes the importance of adaptability, stating, &#8220;I will stay nimble and flexible. The best-laid plans of mice and men have a tendency to falter.&#8221; Hayes also delves into geopolitical considerations, specifically the potential impact of the Hamas v. Israel conflict on oil prices and monetary policy. He notes Bitcoin&#8217;s resilience in such scenarios: &#8220;Bitcoin has proven to outperform bonds during times of war. [&#8230;] The long-term US Treasury bond ETF has fallen 12% vs. Bitcoin pumping 52% since the onset of the Ukraine / Russia war.&#8221; While he concedes that Bitcoin could fall in an initial move when Iran is drawn into the Hamas v. Israel war, it would be a &#8220;buy the dip&#8221; situation according to Hayes. In a candid conclusion, Hayes comments on the historical context of geopolitical conflicts, expressing skepticism about the prospects for global peace: &#8220;Of course, if those in charge of Pax Americana committed themselves to peace and global harmony… nah, I’m not even going to finish that thought. These mofos have been practicing war since 1776, with no signs of letting up.&#8221; According to Hayes, however, all roads lead to Bitcoin: &#8220;[It] will reassert itself as a real-time scorecard on the health of the war-time fiat financial system.&#8221; At press time, BTC traded at $37,030. Featured image from South China Morning Post, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T08:53:00.000Z",
    "title": "Analyst Predicts BTC’s Positive Trend Is Likely To Continue",
    "url": "https://coinedition.com/analyst-predicts-btcs-positive-trend-is-likely-to-continue/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin to Reach $40K\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Bitcoin-Price-Analysis-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency trader and investor, Daan Crypto, shared in an X post on Saturday that Bitcoin’s (BTC) positive trend could continue. The trader&#8217;s prediction was largely based on the fact that the market leader is currently working on its fourth consecutive green week. Additionally, BTC was also trading well above its bull market support band on [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-predicts-btcs-positive-trend-is-likely-to-continue/\">Analyst Predicts BTC’s Positive Trend Is Likely To Continue</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]