[
  {
    "source": "CoinDesk",
    "date": "2023-09-07T15:45:00.000Z",
    "title": "Back to School: Supporting the Next Generation of Investors",
    "url": "https://www.coindesk.com/coindesk-indices/2023/09/07/back-to-school-supporting-the-next-generation-of-investors/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "How will advisors adapt to support the next gen investor? Erik Anderson from Global X takes us through the changing landscape in today’s Crypto for Advisor newsletter."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-07T15:41:40.000Z",
    "title": "SEC’s Gensler Should Be Focus of More Hearings on Treatment of Crypto: U.S. Senator",
    "url": "https://www.coindesk.com/policy/2023/09/07/secs-gensler-should-be-focus-of-more-hearings-on-treatment-of-crypto-us-senator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sen. Bill Hagerty (R-Tenn.) previewed the lawmaker ire in store for U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler as Congress returns from its summer break, with Hagerty accusing the regulator of stomping on crypto innovation during a speech on Thursday."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-07T16:01:37.000Z",
    "title": "Kenyan Official Calls Worldcoin a 'Gang of Criminals Who Are Coming to Harvest Data'",
    "url": "https://decrypt.co/155283/kenyan-official-calls-worldcoin-gang-of-criminals-coming-to-harvest-data",
    "description": "Worldcoin CEO Alex Blania refuted the claim, saying \"Worldcoin is designed to be privacy-preserving.\""
  },
  {
    "source": "Decrypt",
    "date": "2023-09-07T15:52:50.000Z",
    "title": "Anthropic Debuts Claude Pro to Rival ChatGPT's AI Chatbot",
    "url": "https://decrypt.co/155331/anthropic-debuts-claude-pro-rival-to-chatgpt-ai-chatbot",
    "description": "The new service competes against ChatGPT Plus and offers 5X more interactions, priority of computing power and access to early features."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T16:00:00.000Z",
    "title": "‘NFTs will win on Bitcoin’ — OnChainMonkey NFT collection ditches Ethereum",
    "url": "https://cointelegraph.com/news/onchainmonkey-nft-collection-migrate-ethereum-to-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/05348192-b54d-499a-b795-1f15f1e29b17.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Metagood CEO Danny Yang attributed the move to the Bitcoin network being seen as a more secure platform for its users, among other reasons.</p>\n                    <p><p>The team behind nonfungible token collection OnChainMonkey is shifting its entire collection of 10,000 NFTs from Ethereum to Bitcoin, in a massive undertaking expected to take several months. </p><p>\"A historical transition is on the horizon as we prepare to migrate our flagship collection, OCM Genesis, from Ethereum to Bitcoin,” Metagood co-founder and CEO Danny Yang said in a statement on Sept. 7. </p><p>The OnChainMonkeys were first launched in September 2021 on Ethereum, but Yang said the migration to Bitcoin Ordinals was due to its community seeing Bitcoin as offering a more secure platform for its users.</p><blockquote>“The Bitcoin Ordinal protocol is better designed for decentralization and security than the Ethereum NFT protocol. High-value NFTs will win on Bitcoin.”</blockquote><p>The proposal to migrate to Bitcoin was passed by 99% of OnChainMonkey tokenholders. Yang said this means the community had a high conviction for moving to Bitcoin.</p><p>The migration would come at a hefty cost though, with Metagood expecting to fork out over $1 million to ensure the migration process runs smoothly.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Why is the Art and Collectibles market significant for Bitcoin? Why should this matter to you? <br><br>1. Valuable Market. The wealth associated from art and collectibles by ultra-high net worth individuals (UHNWIs) *alone* accounts for $1.5 TRILLION in value according to Deloitte&#39;s…</p>&mdash; danny huuep (@huuep) <a href=\"https://twitter.com/huuep/status/1694128278280532116?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While the migration process is rather complex, each new OnChainMonkey on Bitcoin will have clear provenance to the corresponding original Ethereum NFT. Holders will receive the corresponding Bitcoin Ordinal once they’ve burned the Ethereum NFT.</p><p>However, Yang says the migration shouldn’t be too challenging compared to what Metagood has already accomplished in the Bitcoin Ordinals space:</p><blockquote>“We were the first to inscribe 10,000 images of a collection on Bitcoin. We were the first to launch a parent-child collection with OCM Dimensions 300. We pioneered recursive inscriptions on Bitcoin, as well as inscribing Three.js and p5.js for everyone to use.”</blockquote><p>However, Ethereum continues to dominate the NFT market, settling $236.8 million in NFTs over the last month, compared to second place Solana ($37.7 million), with Bitcoin ($11.1 million) back in sixth place, <a href=\"https://www.cryptoslam.io/blockchains\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CryptoSlam.</p><p>At the same time, Bitcoin Ordinals transaction volumes plunged 98% between May and mid-August despite <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-volume-hits-210-million-in-q2-2023\">rising to popularity in early 2023.</a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin Ordinals is dead.<br><br>Bitcoin is dead. We heard this many many times over the years. In the case of Bitcoin Ordinals, let&#39;s actually understand what actually is dead.<br><br>1. Bitcoin Ordinals is a new protocol at release 0.8.2. It&#39;s an early release of a protocol that still… <a href=\"https://t.co/NxJP7YY64y\">https://t.co/NxJP7YY64y</a></p>&mdash; danny huuep (@huuep) <a href=\"https://twitter.com/huuep/status/1693004610901086441?ref_src=twsrc%5Etfw\">August 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>But Yang isn’t concerned, highlighting to Cointelegraph that it is only time before a strong Bitcoin-native NFT ecosystem develops. Both Bitcoin and Ethereum NFT ecosystems can thrive, he added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-inscription-still-making-majority-btc-transactions\"><strong><em>Ordinals still make up majority of Bitcoin txs despite price collapse</em></strong></a></p><p>OnChainMonkey NFTs currently trade at an average floor price of 1.10 Ether (ETH) with over 20,550 ETH in transaction volume from 9,500 items since it launched on NFT marketplace OpenSea in September 2021.</p><p>Of the 2,900 owners of the OnChainMonkey NFTs, 31% are unique owners, <a href=\"https://opensea.io/collection/onchainmonkey\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to OpenSea.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ee090e25-a20f-4113-b486-9de0f23e9a8f.png\"  /><figcaption style=\"text-align: center;\"><em>List of OnChainMonkey NFTs currently traded on OpenSea. Source: OpenSea</em></figcaption></figure><p>The arrival of Ordinals and BRC-20 tokens launched in January, which were made possible by <a href=\"https://cointelegraph.com/news/breaking-the-bitcoin-network-welcomes-taproot-soft-fork-upgrade\">the Taproot soft fork</a> executed in November 2021.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/onchainmonkey-nft-collection-migrate-ethereum-to-bitcoin&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T16:00:00.000Z",
    "title": "9 crypto leaders share advice for proof-of-humanity solution builders",
    "url": "https://cointelegraph.com/innovation-circle/9-crypto-leaders-share-advice-for-proof-of-humanity-solution-builders",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c6005930-7f47-48f5-a94b-752d0270c8ab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Respect for users’ personal privacy must be top of mind when developing proof-of-humanity identity solutions.</p>\n                    <p><p>Trust is in shorter supply in the digital world these days. As artificial intelligence evolves and produces more “humanlike” and realistic results, users of digital services are increasingly concerned with knowing who and/or what, precisely, they’re interacting with. With a commitment to decentralization and broad access, the crypto industry in particular needs proof-of-humanity solutions to avoid issues like fake accounts and automated bots — and, of course, to comply with Know Your Customer and Anti-Money Laundering regulations.</p> <p>The crypto industry is nothing if not innovative, and proof-of-humanity solutions that leverage verified video registries, social connections and biometric identification are among those in the works. But user privacy and control are a cornerstone of the crypto philosophy, so it’s essential that developers demonstrate a commitment to these principles. Below, nine members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> share their advice and ideas to help developers of proof-of-humanity solutions preserve the privacy of personal information.</p> <h2>Aim for anonymous verification methods</h2> <p>Developers should aim for anonymous verification methods, such as zero-knowledge proofs, and process data on the user’s device to prevent personal information from being transmitted. When transmission is necessary, use end-to-end encryption. Emphasize transparency and user consent, and consider decentralized storage solutions to minimize centralized data breach risks. –<a href=\"https://circle.cointelegraph.com/u/d44c746c-442d-4c14-bb46-c229b457455a\"> Irina Litchfield</a>,<a href=\"https://www.lumeria.io/\"> Lumeria</a></p> <h2>Consider blockchain-based “proof of burn” </h2> <p>Since the latest proof-of-humanity measures involve facial or video recognition methods, it’s concerning that these providers record and store new layers of personal information beyond the “normal” personal data that could be exploited. It would be interesting to see whether blockchain could be employed to show a “proof of burn” of the personal information obtained during a proof-of-humanity verification. –<a href=\"https://circle.cointelegraph.com/u/313a59f1-efb9-465c-aee3-750eaa69f776\"> Timothy Enneking</a>,<a href=\"http://www.digital-capital-management.com/\"> Digital Capital Management</a></p> <h2>Verify identity without revealing it</h2> <p>Privacy isn’t an add-on; it’s the foundation of crypto. The pursuit of proof-of-humanity solutions mustn’t overshadow the sanctity of personal data. Use techniques like zero-knowledge proofs or homomorphic encryption to verify identity without revealing it. When done right, the result is a solution that respects identity and cherishes privacy. –<a href=\"https://circle.cointelegraph.com/u/d720a7cd-d784-46d6-9998-f4df393114ab\"> Erki Koldits</a>,<a href=\"https://www.popspot.com\"> OÜ Popspot</a></p> <h2>Implement a “forget me” feature</h2> <p>Give users the ability to fully delete their data. If a user changes their mind about using a particular identity solution, they should be able to completely exit the ecosystem without any lingering privacy concerns. This means developers should implement a “forget me” feature for users to remove both their data assets and their entire account history. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global\"> ENT Technologies AG</a></p> <h2>Adopt privacy-by-design principles</h2> <p>Adopt privacy-by-design principles during the development phase. Integrate privacy and data-protection measures into the architecture of the identity solution, including data minimization, user consent and secure data handling throughout the entire system. Implement robust encryption and decentralized storage to protect users’ data from unauthorized breaches. –<a href=\"https://circle.cointelegraph.com/u/5cae7f29-8588-4852-bb31-c66fd1d805c6\"> Anthony Georgiades</a>,<a href=\"https://pastel.network/\"> Pastel Network</a></p> <h2>Practice data minimization</h2> <p>While it is tempting for Big Tech to harvest our data for profit, developers of proof-of-humanity identity solutions must practice data minimization, collecting only the necessary information to verify humanity. By limiting the scope of data collected, they reduce the potential risks associated with unauthorized access or misuse, thereby safeguarding individuals’ privacy. –<a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\"> Sheraz Ahmed</a>,<a href=\"http://storm.partners/\"> STORM Partners</a></p> <h2>Focus on self-sovereign identity and multiparty computation</h2> <p>In the context of digital identity in a Web3 world, we really should be talking about self-sovereign identity, which gives users true ownership of their data. While zero knowledge is great at simple proofs, the Holy Grail for privacy is the use of multiparty computation, where privacy becomes fully programmable, allowing for multi-input computation without compromises. –<a href=\"https://circle.cointelegraph.com/u/16cde551-5395-4ca9-8281-7152cbb88396\"> Tiago Serôdio</a>,<a href=\"https://www.partisiablockchain.com/\"> Partisia Blockchain</a></p> <h2>Leverage homomorphic encryption</h2> <p>The anonymization-individuality conundrum is commonly disregarded. Proof-of-humanity systems authenticate unique human identities, which may violate privacy. Homomorphic encryption can compute encrypted data without decrypting it; thus, humanity can be proven without compromising privacy. –<a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\"> Arvin Khamseh</a>,<a href=\"http://soldoutnfts.io\"> SOLDOUT NFTs</a></p> <h2>Be wary of stockpiling biometric data</h2> <p>There’s a real question to answer when it comes to proof-of-humanity protocols: “Just because we can, does it mean we should?” History demonstrates, on a wide scale, the unwieldy nature of power. Not only is this a pivot from crypto’s tradition of eschewing institutionalized control, but collecting stockpiles of biometric data invites a scenario where it falls into the wrong hands. –<a href=\"https://circle.cointelegraph.com/u/83c71aad-8be6-470a-aaf9-7f146821217c\"> Oleksandr Lutskevych</a>,<a href=\"http://cex.io\"> CEX.IO</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T16:00:21.000Z",
    "title": "Changes in old supply shows selling pressure came from short-term holders",
    "url": "https://cryptoslate.com/insights/changes-in-old-supply-show-selling-pressure-came-from-short-term-holders/",
    "description": "<p>Quick Take A sell-off from short-term holders appears to have mostly fueled Bitcoin&#8217;s drop to $25,000. While there are many on-chain metrics pointing to this fact, it becomes clear when analyzing the changes in Bitcoin&#8217;s old coin supply — i.e., supply that was last active more than six months ago. Positive values indicate a net [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/changes-in-old-supply-show-selling-pressure-came-from-short-term-holders/\">Changes in old supply shows selling pressure came from short-term holders</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-07T16:04:12.000Z",
    "title": "Biggest Movers: TON Moves Towards $1.90, XLM Remains Near Recent Highs",
    "url": "https://news.bitcoin.com/biggest-movers-ton-moves-towards-1-90-xlm-remains-near-recent-highs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: TON Moves Towards $1.90, XLM Remains Near Recent Highs\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2343784259.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Toncoin was a big mover on Thursday, as the token rose by nearly 4%, closing in on the $1.90 level in the process. The rally came despite crypto price consolidation, with the global market cap largely unchanged as of writing. Stellar also surged, remaining near a recent two-week high. Toncoin (TON) Toncoin (TON) was one [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T16:03:37.000Z",
    "title": "Ripple Labs chair criticizes Joe Biden’s crypto policy",
    "url": "https://www.cryptopolitan.com/ripple-chair-criticizes-bidens-crypto-policy/",
    "description": "The United States’ legal system is poised to play a pivotal role in revitalizing the cryptocurrency industry, which some believe has been hampered by the Biden administration’s crypto policy. Chris Larsen, chair and co-founder of Ripple Labs, expressed his views during an interview with Bloomberg on September 7. He argued that recent developments in the ... <a title=\"Ripple Labs chair criticizes Joe Biden’s crypto policy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-chair-criticizes-bidens-crypto-policy/\" aria-label=\"More on Ripple Labs chair criticizes Joe Biden’s crypto policy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T15:49:21.000Z",
    "title": "Australian Senator warns against rejection of his crypto bill",
    "url": "https://www.cryptopolitan.com/australian-senator-against-rejection-bill/",
    "description": "Australia is facing a critical juncture in its approach to cryptocurrency regulation as the fate of the Digital Assets (Market Regulation) Bill hangs in the balance. Senator Andrew Bragg, the author of the bill, has issued a stark warning that if the legislation is rejected by parliament, Australian investors will be left exposed to unregulated ... <a title=\"Australian Senator warns against rejection of his crypto bill\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australian-senator-against-rejection-bill/\" aria-label=\"More on Australian Senator warns against rejection of his crypto bill\">Read more</a>"
  }
]