[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T04:38:29.000Z",
    "title": "Will Mentougou District Secure Its Place as Beijing’s AI Hub?",
    "url": "https://www.cryptopolitan.com/mentougou-district-as-beijings-ai-hub/",
    "description": "In a bold move to solidify its standing in Beijing&#8217;s tech domain, Mentougou district is carving out a path to become the city&#8217;s primary hub for artificial intelligence (AI) development. At the heart of this ambitious endeavor is the recently launched Ascend AI Computing Center, the first of its kind in Beijing, which is swiftly ... <a title=\"Will Mentougou District Secure Its Place as Beijing&#8217;s AI Hub?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mentougou-district-as-beijings-ai-hub/\" aria-label=\"More on Will Mentougou District Secure Its Place as Beijing&#8217;s AI Hub?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-22T04:28:17.000Z",
    "title": "LINK Price Prediction: Chainlink Recovery Stalls But Not Likely Over",
    "url": "https://www.newsbtc.com/analysis/link/link-price-prediction-chainlink-7-20/",
    "description": "Chainlink’s LINK price recovered above the $6.50 resistance. The price is now correcting gains, but it might find bids near $6.40 and could start a fresh increase. Chainlink price is showing positive signs above $6.5 against the US dollar. The price is trading above the $6.50 level and the 100 simple moving average (4 hours). There is a connecting bullish trend line forming with support near $6.40 on the 4-hour chart of the LINK/USD pair (data source from Kraken). The price could restart its increase unless there is a close below the $6.40 support. Chainlink (LINK) Price Turns Green After a steady decline, LINK price found support near the $5.75 zone against the US Dollar. A low was formed near $5.74 and the price recently started a fresh increase, like Bitcoin and Ethereum. The price recovered above the $6.00 and $6.20 resistance levels. The bulls were able to pump the price above the $6.50 level and the 100 simple moving average (4 hours). Finally, the bears appeared near the $7.00 zone. A high is formed near $7.03 and the price is now correcting gains. It traded below the 23.6% Fib retracement level of the upward move from the $5.74 swing low to the $7.03 high. LINK is still trading above the $6.50 level and the 100 simple moving average (4 hours). There is also a connecting bullish trend line forming with support near $6.40 on the 4-hour chart of the LINK/USD pair. The trend line is near the 50% Fib retracement level of the upward move from the $5.74 swing low to the $7.03 high. Source: LINKUSD on TradingView.com If there is a fresh increase, the price might face resistance near $6.80. The first major resistance is near the $7.00 zone. A clear break above $7.00 may possibly start a steady increase toward the $7.25 and $7.32 levels. The next major resistance is near the $7.50 level, above which the price could revisit $7.85. More Losses? If Chainlink’s price fails to climb above the $6.80 resistance level, there could be a downside extension. Initial support on the downside is near the $6.50 level. The next major support is near the $6.40 level, below which the price might test the $5.90 level. Any more losses could lead LINK toward the $5.75 level in the near term. Technical Indicators 4 hours MACD – The MACD for LINK/USD is losing momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for LINK/USD is now above the 50 level. Major Support Levels – $6.50 and $6.40. Major Resistance Levels – $6.80 and $7.00."
  }
]