[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T09:00:00.000Z",
    "title": "Solana (SOL) Faces Competition from Emerging Rival Cryptocurrency, Currently Valued at $0.01",
    "url": "https://www.cryptopolitan.com/solana-sol-faces-competition-from-emerging-rival-cryptocurrency-currently-valued-at-0-01/",
    "description": "In the ever-evolving world of blockchain technology, Solana (SOL) has encountered a new competitor that&#8217;s quickly gaining ground. This emerging rival cryptocurrency, with its current valuation at a mere $0.01, is poised to challenge Solana&#8217;s position in the market. Offering unique features and a robust platform that aims to enhance the decentralized finance (DeFi) ecosystem, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T08:58:32.000Z",
    "title": "Google Commits 25 Million Euros to Enhance AI Skills in Europe",
    "url": "https://www.cryptopolitan.com/google-commits-million-euros-to-ai-skills/",
    "description": "In a significant move towards fostering artificial intelligence (AI) competencies in Europe, Google has announced a €25 million pledge. The initiative aims to provide individuals across Europe with the necessary skills and knowledge to navigate the evolving landscape of AI technology. Strengthening AI education and employment Google&#8217;s investment is set to empower social enterprises and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T08:53:00.000Z",
    "title": "Bullish Indicator That Preceded Polygon’s 21000% Surge in 2021 Appears in This Token With Similar Potential in 2024",
    "url": "https://www.cryptopolitan.com/bullish-indicator-that-preceded-polygons-21000-surge-in-2021-appears-in-this-token-with-similar-potential-in-2024/",
    "description": "Retik Finance, a relatively new token priced attractively at just $0.12. What makes Retik Finance particularly intriguing is the emergence of a bullish indicator that bears a striking resemblance to the pattern observed before Polygon&#8217;s staggering surge of 21,000% in 2021. This similarity has piqued the interest of seasoned investors and novices alike, prompting them [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T08:48:48.000Z",
    "title": "Deepfake Regulation Considered Under Jamaican Cybercrimes Act",
    "url": "https://www.cryptopolitan.com/deepfake-under-jamaica-cybercrimes-act/",
    "description": "As Jamaican lawmakers contemplate the regulation of artificial intelligence-generated content, particularly concerning the creation of deepfakes, Deputy Director of Public Prosecutions Andrea Martin-Swaby suggests potential relief within the Cybercrimes Act. Legal framework and the cybercrimes act A senior prosecutor in Jamaica has highlighted the potential for victims of AI-generated mischief, such as deepfakes, to find [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-18T09:02:33.000Z",
    "title": "Monero shows resilience, Jupiter struggles, Borroe Finance innovates in defi space",
    "url": "https://crypto.news/monero-shows-resilience-jupiter-struggles-borroe-finance-innovates-in-defi-space/",
    "description": "Monero bounces back, Jupiter faces challenges, while Borroe Finance&#8217;s innovative DeFi solutions spark growing interest. Monero (XMR) and Jupiter (JUP) have been under pressure recently due to unfavorable ecosystem trends. While Binance plans to delist Monero later this month, JUP&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-18T08:47:56.000Z",
    "title": "Filecoin-Solana: Boosting Blockchain Scalability and Security",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/filecoin-solana-boosting-blockchain-scalability-and-security/",
    "description": "<p>Filecoin is now set to bolster Solana&#8217;s blockchain by providing a solution for one of the most pressing issues facing blockchains today. Scalable and secure data storage. Solana taps into Filecoin to improve block history access for stakeholders like providers, explorers, and indexers needing historical blockchain data. Enhancing Access to Solana&#8217;s Historical Data The integration [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/filecoin-solana-boosting-blockchain-scalability-and-security/\">Filecoin-Solana: Boosting Blockchain Scalability and Security</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-18T08:54:00.000Z",
    "title": "Gemini Set To Begin Monetization of Initial Earn Users’ Collateral",
    "url": "https://coinedition.com/gemini-set-to-begin-monetization-of-initial-earn-users-collateral/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Gemini Files a Reply Memorandum Against SEC To Dismiss Lawsuit\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Gemini-Set-Up-Platform-Outside-U.S-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Gemini Trust Co., Judge Sean Lane of the Southern District of New York has approved Genesis’ motion to sell Trust Assets. In a recent post on X (formerly Twitter), Gemini noted that the court had permitted it to begin monetization of the Initial Collateral it holds for the benefit of Earn users. The [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/gemini-set-to-begin-monetization-of-initial-earn-users-collateral/\">Gemini Set To Begin Monetization of Initial Earn Users’ Collateral</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]