[
  {
    "source": "CoinDesk",
    "date": "2023-07-17T10:25:13.000Z",
    "title": "SEC Launches Review of Latest Bitcoin ETF Applications ",
    "url": "https://www.coindesk.com/policy/2023/07/17/sec-launches-review-of-latest-bitcoin-etf-applications/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) has launched its review of the latest bitcoin exchange-traded-fund (ETF) applications."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T10:38:19.000Z",
    "title": "The aftermath of the ftx exchange collapse reshapes Bitcoin deposits, withdrawals",
    "url": "https://cryptoslate.com/insights/the-aftermath-of-the-ftx-exchange-collapse-reshapes-bitcoin-deposits-withdrawals/",
    "description": "<p>Quick Take The downfall of the FTX exchange in November 2022, led by Sam Bankman-Fried, marked a pivotal point in the landscape of Bitcoin deposits and withdrawals. The incident led to a drop in Bitcoin price below $16,000, the lowest point in that cycle. This collapse deceived many people and led to an all-time low [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/the-aftermath-of-the-ftx-exchange-collapse-reshapes-bitcoin-deposits-withdrawals/\">The aftermath of the ftx exchange collapse reshapes Bitcoin deposits, withdrawals</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T10:34:36.000Z",
    "title": "Beijing plans to train 10,000 talents annually in blockchain, AI, and other digital technologies",
    "url": "https://www.cryptopolitan.com/beijing-to-train-10000-talents-annually-blockchain-ai-digital-technologies/",
    "description": "In an unprecedented move set to redefine the digital landscape, Beijing&#8217;s municipal government has announced its ambitious initiative to train 10,000 engineering talents in emerging technologies annually. Revealed in a government document by the Beijing Municipal Human Resources and Social Security Bureau, the tech talents will specialize in burgeoning sectors, including blockchain, artificial intelligence (AI), ... <a title=\"Beijing plans to train 10,000 talents annually in blockchain, AI, and other digital technologies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/beijing-to-train-10000-talents-annually-blockchain-ai-digital-technologies/\" aria-label=\"More on Beijing plans to train 10,000 talents annually in blockchain, AI, and other digital technologies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T10:24:49.000Z",
    "title": "AnubisDAO rug pull funds move again via infamous Tornado Cash",
    "url": "https://www.cryptopolitan.com/anubisdao-rug-pull-funds-move-via-tornado/",
    "description": "About two years after AnubisDAO was rug-pulled for 13.5K ETH, the funds have been moved via Tornado Cash, a decentralized protocol that enhances the privacy of on-chain activities. The dog-inspired decentralized finance project&#8217;s funds were drained in October 2021 after only 20 hours of the project going live. Etherscan showed that the funds moved on ... <a title=\"AnubisDAO rug pull funds move again via infamous Tornado Cash\" class=\"read-more\" href=\"https://www.cryptopolitan.com/anubisdao-rug-pull-funds-move-via-tornado/\" aria-label=\"More on AnubisDAO rug pull funds move again via infamous Tornado Cash\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T10:24:22.000Z",
    "title": "Gasparino’s fiery encounter with XRP ‘cult’ leaves Ripple community divided",
    "url": "https://www.cryptopolitan.com/gasparinos-fiery-encounter-with-xrp-cult-leaves-ripple-community-divided/",
    "description": "In a clash of titans, Fox Business&#8217; Charles Gasparino finds himself embroiled in a fiery dispute with members of the XRP community, whom he has boldly labeled a “cult.” The ongoing legal struggle between Ripple and the SEC provides the backdrop for Gasparino&#8217;s encounters with the passionate XRP backers, resulting in frustration and professional exhilaration ... <a title=\"Gasparino&#8217;s fiery encounter with XRP &#8216;cult&#8217; leaves Ripple community divided\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gasparinos-fiery-encounter-with-xrp-cult-leaves-ripple-community-divided/\" aria-label=\"More on Gasparino&#8217;s fiery encounter with XRP &#8216;cult&#8217; leaves Ripple community divided\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T10:30:28.000Z",
    "title": "XRP Whales Ride The Crypto Surge, As Ripple Token Notches 62% Price Spike",
    "url": "https://www.newsbtc.com/news/xrp-whales-ride-the-crypto-surge-as-ripple-token-notches-62-price-spike/",
    "description": "XRP is now witnessing a surge in network activity as prominent holders of the cryptocurrency make their moves.  The latest findings from Lookonchain, a renowned data analytics firm, shed light on the purchase and sale patterns of XRP whales on the Binance Smart Chain (BSC), signaling a potential rise in selling activity within the market. Ripple&#8217;s triumph over the SEC has undoubtedly injected a fresh wave of confidence into the XRP community. With the regulatory cloud dissipating, investors and holders are now eager to capitalize on the newfound clarity surrounding the token&#8217;s status. As a result, the actions of these notable whales have become a focal point of interest for market observers and enthusiasts alike. Related Reading: USTC Surprises With Nearly 60% Rally – What’s Going On? XRP Whales&#8217; Purchasing Habits Revealed: Insight From Lookonchain Based on analysis by Lookonchain, the transactional behavior of four influential whales has come to light. Each of these whales demonstrates distinct patterns in their purchasing habits, shedding light on their strategies within the crypto market. 1/ Did whales sell $XRP as the price of $XRP rises? Let&#8217;s check the top 4 whales of $XRP on the #BSC.👇 pic.twitter.com/cwkXIcK6s2 — Lookonchain (@lookonchain) July 15, 2023 One of the whales, known as &#8220;0xf522,&#8221; has amassed a staggering 25 million XRP, equivalent to $18 million, between April 22 and November 24, 2022. Interestingly, this particular whale has refrained from selling any of their holdings thus far.  Source: Lookonchain Another notable participant, identified as &#8220;0x513d,&#8221; acquired 10 million units of the coin at an average price of $0.45 per token. Following the recent surge in XRP&#8217;s value, this whale has deposited 5.4 million XRP, worth around $4.3 million, into Binance. Related Reading: Shiba Inu Encounters Familiar Resistance, Prompting Concerns About Bull Run By taking advantage of the recent price rally, &#8220;0x513d&#8221; demonstrates a more proactive approach, capitalizing on the upward momentum of XRP. Source: Coingecko At present, Coingecko displays XRP&#8217;s price at $0.7412, reflecting a 2.9% rally within the past 24 hours alone. Over the course of the previous seven days, XRP has experienced a remarkable surge of 58.6%.  Ex-Ripple Chief Affirms Company&#8217;s Limited Market Influence Amid XRP&#8217;s Surge Meanwhile, Matt Hamilton, the former Director of Developer Relations at Ripple, clarified on Twitter that Ripple&#8217;s influence on the market is relatively constrained when considering the global daily sales volume of XRP. Ripple are the single largest holder of XRP with something like 48B XRP. Most of it is held in escrow contracts that release each month. Ripple sell a small portion of that and put the rest back in new escrow contracts. — Matt Hamilton (@HammerToe) July 16, 2023 This assertion holds true even in light of the recent surge in XRP&#8217;s value following the resolution of the Ripple-SEC case.  He stressed that the price movements of XRP are primarily governed by market forces and the performance of Bitcoin (BTC), underscoring the interplay between these factors in shaping the cryptocurrency&#8217;s trajectory. XRP market cap closing in to the $39 billion level. Chart: TradingView.com Hamilton explicitly stated that Ripple does not have authority over either XRP or the XRP Ledger (XRPL), ensuring any misunderstandings are clarified. In order to stress this notion further, he proposed the potential scenario where Ripple&#8217;s complete XRP holdings could be eradicated if the XRP community deemed it appropriate. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Blockchain News"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T10:15:22.000Z",
    "title": "Why Cardano (ADA) and Polygon (MATIC) Can’t Compete With Golden Cask Club’s (GCC) Presale",
    "url": "https://www.crypto-news-flash.com/why-cardano-ada-and-polygon-matic-cant-compete-with-golden-cask-clubs-gcc-presale/?utm_source=rss&utm_medium=rss&utm_campaign=why-cardano-ada-and-polygon-matic-cant-compete-with-golden-cask-clubs-gcc-presale",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T131413.431.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T131413.431.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T131413.431-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As each bull season comes around, new projects emerge, with each promising innovative solutions and potentially huge gains for investors. Among the multitude of offerings, Cardano (ADA) and Polygon (MATIC) gained considerably in past bull cycles. But as their “promise” keeps being promised, investors lose confidence in them and go for newer crypto assets that [...]"
  }
]