[
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T01:45:56.000Z",
    "title": " Crypto thieves will deploy more convincing AI scams in 2024, firms warn ",
    "url": "https://cointelegraph.com/news/how-crypto-hackers-will-up-their-game-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYmZmOTViYjMtZjVjNy00OGNjLWIwOGItNDZjYzBiZDI1MWY4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto investors will have to keep their eyes peeled for sophisticated phishing scams and a plethora of smart contract vulnerabilities next year, according to blockchain security firms.</p>\n                    <p><p>AI-powered phishing scams, BRC-20 exploits, and new smart contract vulnerabilities are among the biggest threats that crypto projects and investors will likely face in 2024, according to blockchain security firms.</p><p>While the <a href=\"https://cointelegraph.com/news/crypto-hacking-losses-plunge-nearly-50-2023-research\">$1.7 billion in scam and hack-related losses</a> in 2023 stands as an undeniable improvement to the $4 billion lost in 2022 — Jesse Leclere, a blockchain analyst from CertiK, warned Cointelegraph that scams are only becoming more advanced and users should remain hyper-vigilant for well-executed exploits.</p><p>“Phishing, evolving in its sophistication, will likely target not only individual users but also corporate systems [...] using social engineering tactics tailored to the crypto context,” said Leclere, <a href=\"https://cointelegraph.com/news/how-the-ledger-connect-hacker-tricked-users-into-making-malicious-approvals\">pointing to the Dec. 14 Ledger Connect exploit</a> as a prime example of an advanced attack.</p><p><a href=\"https://cointelegraph.com/news/how-crypto-hackers-will-up-their-game-2024\">Read more</a></p></p>\n                \n            "
  }
]