[
  {
    "source": "NewsBTC",
    "date": "2023-12-25T23:00:38.000Z",
    "title": "Dogecoin, Cardano, And Chainlink Get Special Listing From Binance",
    "url": "https://www.newsbtc.com/binance/dogecoin-cardano-chainlink-binance/",
    "description": "Binance is on the move once again with new special listings for Dogecoin, Cardano, and Chainlink, among others. The exchange has announced brand new crypto trading pairs for these cryptocurrencies which would bring advantages to traders. Binance Adds New Dogecoin, Cardano, And Chainlink Pairs In a new development that was revealed on Christmas Day, the Binance crypto exchange has expanded its list of pairs available for both Cross Margin and Isolated Margin users. The announcement revealed that it will be adding 11 new pairs across these two products. Related Reading: Machine Learning Algorithm Predicts When Cardano Price Will Hit New $6.5 ATH The new pairs are mainly denominated in the FDUSD pair, a stablecoin that the exchange adopted after Paxos was ordered to stop issuing BUSD tokens. The new pairs in the Cross Margin feature include “ ADA/FDUSD, AEUR/USDT, AVAX/FDUSD, DIA/USDT, DOGE/FDUSD, IOTX/ETH, LINK/FDUSD, MATIC/FDUSD, OM/USDT, POLS/USDT.” Meanwhile, only a single new pair was added to the Isolated Margin feature which is IOTX/ETH. Binance’s move to add new trading pairs across these products shows a move toward providing further liquidity for traders. “Binance Margin strives to enhance user trading experience by continuously reviewing and expanding the list of trading choices offered on the platform, allowing for greater diversification of user portfolios and flexibility with trading strategies,” the crypto exchange said in the announcement. The move comes only two days after the exchange had announced the removal of multiple spot trading pairs which affected the likes of Dogecoin, Cardano, and Solana, among others. There were no specific reasons for the removal, although the exchange explained that trading pairs can be delisted due to multiple factors. DOGE price at $0.093 &#124; Source: DOGEUSD On Tradingview.com Crypto Exchanges Cleaning Up Shop In the last week, there have been multiple instances of crypto exchanges delisting cryptocurrency pairs from their platform. The most prominent delistings for the week came from the Uphold exchange which delisted a number of cryptocurrencies in an effort to keep up with Canadian regulations. Related Reading: Shiba Inu Faces Make Or A Point As Analyst Identifies Critical Trading Pattern As Bitcoinist reported, Uphold emailed its customers in the region to reveal that it will be desolating 10 Tier 3 cryptocurrencies from the exchange. Those mentioned in the email included Dogecoin (DOGE), Cardano (ADA), Shiba Inu (SHIB), XDC Network (XDC), Kaspa (KAS), Hedera (HBAR), Stellar (XLM), VeChain (VET), Injective (INJ), and Casper (CSPR). Additionally, the crypto exchange revealed it will be delisting all Tier 4 cryptocurrencies as well. However, unlike Binance’s delisting which only affected some pairs of different cryptocurrencies, Uphold’s move is a total delisting. “Maintaining a healthy ecosystem of digital assets for our customers is one of our top priorities &#8211; occasionally delisting assets forms part of this process,” the exchange said. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Binance, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-25T23:01:06.000Z",
    "title": "OKX CEO Says He’s Being Urged To List More Bitcoin Ordinals As BRC-20 Total Market Cap Soars 30% in a Day",
    "url": "https://dailyhodl.com/2023/12/25/okx-ceo-says-hes-being-urged-to-list-more-bitcoin-ordinals-as-brc-20-total-market-cap-soars-30-in-a-day/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Stakeholders-With-Over.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive of crypto exchange OKX says that he’s being encouraged to list more Bitcoin (BTC) ordinals as the total market cap of BRC-20 tokens jumps 30% in one day. In a lengthy thread, OKX CEO Jay Hao tells his 65.500 followers on the social media platform X that while he’s being urged to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/25/okx-ceo-says-hes-being-urged-to-list-more-bitcoin-ordinals-as-brc-20-total-market-cap-soars-30-in-a-day/\">OKX CEO Says He’s Being Urged To List More Bitcoin Ordinals As BRC-20 Total Market Cap Soars 30% in a Day</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]