[
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T13:55:00.000Z",
    "title": "Rising institutional interest is a 'bullish' sign for crypto: SEBA Bank exec",
    "url": "https://cointelegraph.com/news/rising-institutional-interest-is-a-bullish-sign-for-crypto-seba-bank-exec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9926517c-6334-4b37-88a0-a48a60d844e5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SEBA Bank exec Nasha Afshar believes that the question of institutions getting into crypto has shifted from \"if\" to \"when,\" indicating growing confidence in the industry. </p>\n                    <p><p>As more institutions go from only showing their interest in the crypto space into actually investing in Web3 projects, getting into crypto turns into a question of “when” rather than a question of “if” according to an executive from institution-focused crypto firm SEBA Bank. </p><p>At the World Token Summit, Cointelegraph spoke with chartered financial analyst Nasha Afshar, who works as a director at SEBA Bank. Afshar discussed topics like the institutional interest and adoption of crypto and trends that they’ve been noticing as of late. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7381413d-46a6-4114-929c-19d6c6ffff6e.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Cointelegraph reporter Ezra Reguerra with </em>SEBA<em> Bank's Nasha Afshar (right) at the World Token Summit in Dubai. Source: Cointelegraph</em></figcaption></figure><p>According to Afshar, when the markets were in the bull run, many expressed their interest in the crypto space. “If you look at the institutional interest and adoption now versus back then, I think back then, there were more players coming into the space that were interested,” he said. </p><p>However, the executive believes that despite the interest back then, those who acted on that interest were fewer than what he is noticing today. He explained that: </p><blockquote>“How much action behind that interest was maybe not as strong as it is today, because if you look today, for example, you can see that most recently you've had firms that are of a very significant size and presence globally coming into crypto.”</blockquote><p>The executive cited Citadel <a href=\"https://cointelegraph.com/news/wall-street-giants-back-edx-markets-cryptocurrency-exchange\">backing a crypto exchange</a>, BlackRock <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">applying for a spot Bitcoin ETF</a> and others like WisdomTree and Invesco doing the same as “an extremely bullish sign for the industry.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-scammers-and-the-need-for-tools-to-prevent-theft-world-token-summit\"><strong><em>Crypto scammers and the need for tools to prevent theft: World Token Summit</em></strong></a></p><p>When asked about the local trends within the Abu Dhabi Global Markets in the UAE where SEBA Bank has an office, the exec recognized that there was a trend in terms of businesses also showing interest in expanding. He explained that:</p><blockquote>“We've seen a trend in businesses that were either located elsewhere or looking to expand a secondary office to expand their global footprint that has decided to set up in the because of that robust framework and pro-crypto stance.”</blockquote><p>Afshar also noted that back in the day, there was still a “question mark” hovering above cryptocurrency as an asset class among institutional investors. Today, the SEBA Bank exec believes that “it's not a question of if anymore, it's more a question of when.”</p><p>Lastly, the analyst said that there is already “not just a shift in terms of thought, but a shift in terms of action that this industry will become bigger.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\"><strong><em>Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T13:46:18.000Z",
    "title": "FTX files complaint to retrieve $700M from “super-networker” Bankman-Fried courted for connections",
    "url": "https://cryptoslate.com/ftx-files-lawsuit-to-retrieve-700m-from-super-networker-bankman-fried-courted-for-connections/",
    "description": "<p>Bankrupt crypto exchange FTX filed a complaint with the court asking to retrieve $700 million from, Michael Kives, a high&#8211;profile networker approached by Sam Bankman-Fried, and a company he co-owned,  K5 Global, according to a June 22 court filing. FTX alleges that its founder Sam Bankman-Fried (SBF), pursued the deal to leverage Kives&#8217; high-value network [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-files-lawsuit-to-retrieve-700m-from-super-networker-bankman-fried-courted-for-connections/\">FTX files complaint to retrieve $700M from &#8220;super-networker&#8221; Bankman-Fried courted for connections</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-23T13:51:08.000Z",
    "title": "Tether Chooses Kava As Gateway for Cosmos USDt",
    "url": "https://www.cryptoglobe.com/latest/2023/06/tether-chooses-kava-as-gateway-for-cosmos-usdt/",
    "description": "Georgetown, Cayman Islands, June 23rd, 2023, Chainwire Tether chooses Kava, a layer-1 blockchain designed for scalability and speed, as its gateway to the Cosmos ecosystem. Kava is excited and honored by Tether’s decision to bring the world’s most liquid, secure, and transparent stablecoin USDt to Cosmos appchains and Kava EVM dApps. Scott Stuart, Kava Co-Founder, said: […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T14:03:15.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $16.43 with a 24-hour trading volume of $130,897,839. Solana is down 3.53% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-23T14:00:00.000Z",
    "title": "Here is Why Avorak AI Holders are Excited to Trade Ethereum this Bull Run",
    "url": "https://nulltx.com/here-is-why-avorak-ai-holders-are-excited-to-trade-ethereum-this-bull-run/",
    "description": "After the harsh crypto winter in 2022, the crypto market is looking forward to the next bull run. The market has shown signs of recovery this year, but the progress remains stagnant. Experts predict that the next bull run will occur after the next Bitcoin halving, scheduled to take place in 2024. Here is why [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T14:04:52.000Z",
    "title": "FLOKI surges 25% on 2023 roadmap release",
    "url": "https://crypto.news/floki-surges-25-on-2023-roadmap-release/",
    "description": "The rival token to SHIB, FLOKI, experienced a significant surge that has seen it rise 25% from its previous 7-day price following the announcement of its 2023 roadmap. "
  },
  {
    "source": "Kraken Blog",
    "date": "2023-06-23T14:04:06.000Z",
    "title": "Otherdeed Expanded, Pixelady Maker, OCM Karma, KILLABEARS and more collections added to Kraken NFT",
    "url": "https://blog.kraken.com/otherdeed-expanded-pixelady-maker-ocm-karma-killabears-and-more-collections-added-to-kraken-nft",
    "description": "We’ve just added five new NFT collections to Kraken NFT for our clients to explore, collect and trade.&#160; After revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*&#160; We will continue to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T14:00:40.000Z",
    "title": "Bitcoin Investor Sentiment Suggest BTC Rally Is Far From Over",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-investor-sentiment-suggest-btc-rally-is-far-from-over/",
    "description": "Bitcoin has been rallying for the last three days and continues to maintain significant momentum. After the digital asset crossed the $30,000 resistance, there was speculation that bulls have finally run out of steam, so the price was expected to correct downward. However, BTC’s current levels combined with the crypto investor sentiment suggest that there could be more runway for the digital asset. Bitcoin Fear &#38; Greed Index Remains Firmly In Greed Presently, the Bitcoin Fear &#38; Greed Index is at one of the highest levels that it has been in the last year. After a long stretch in the neutral and fear territory, Bitcoin has finally moved back once more into the greed territory, signaling positive sentiment from investors. Related Reading: Shiba Inu Becomes 14th Largest Cryptocurrency As Bull Rally Heats Up The index is currently sitting at a score of 65, continuing Thursday’s bullish sentiment. It is now almost 20 points above its last week&#8217;s cumulative value of 47 and this shows the genuine jump in investor sentiment going from fearful to greedy. Fear &#38; Greed Index returns to greed as investor sentiment recovers &#124; Source: alternative.me The last time that the index was this high was back in April when Bitcoin’s price broke the $31,000 level for the first time in 2023. So it is possible that the current rally could continue on with time given that the rally that led to BTC climbing above $31,000 in April lasted for about a month. As of now, the crypto market has been rallying for only about two days, so it is too early for exhaustion on the part of buyers. With more investors feeling greedy and rushing to the market to take advantage of the recovery, they will end up pushing the price even higher. Bitcoin At $35,000 Is Possible The crypto market rally is being propelled forward by the entrance of institutional investors into the space. This includes the like of BlackRock and WisdomTree filing for Bitcoin ETFs. Now, the response from the Securities and Exchange Commission (SEC) is not expected for another couple of months, which leaves room for speculation to continue to drive up the price of the assets. This positive sentiment surrounding the ETF filings can push the price farther up to the $35,000 level, which is the next major resistance for BTC. Once this happens, then $40,000 is the next level to beat, at which point, exhaustion and correction back downwards can be expected. BTC price reclaims $30,000 &#124; Source: BTCUSD on TradingView.com If the ETFs do get approved this year, then BTC’s price will likely rally to its previous all-time high of $69,000 as around $20 billion in institutional investor funding is expected to flow into the market initially. As time goes on, this inflow will only continue to rise, propping up the price of the digital asset. Related Reading: US Bitcoin Investor Trading Volume Rises, Stage Set For Another Massive Rally? At the time of writing, BTC has already reclaimed the $30,000 level once more as bulls continue to maintain dominance. According to data from Coinmarketcap, the cryptocurrency is seeing 17.45% gains in the last week, bringing its market cap to $582 billion. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T14:08:56.000Z",
    "title": "Stellar Price Skyrockets as Usage of Stellar Ramps Explodes",
    "url": "https://www.crypto-news-flash.com/stellar-price-skyrockets-as-usage-of-stellar-ramps-explodes/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-price-skyrockets-as-usage-of-stellar-ramps-explodes",
    "description": "Stellar has joined the latest market uptrend with over 15% WTD growth. The bullish momentum is fueled by the growth in the usage of Stellar Ramp. Over the past week, the price of Stellar (XLM) has experienced a remarkable surge, catapulting it into the spotlight in the digital currency market. According to current data, Stellar [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T14:00:27.000Z",
    "title": "Binance coin and Stellar prices recover, Tradecurve price continues to surge",
    "url": "https://www.crypto-news-flash.com/binance-coin-and-stellar-prices-recover-tradecurve-price-continues-to-surge/?utm_source=rss&utm_medium=rss&utm_campaign=binance-coin-and-stellar-prices-recover-tradecurve-price-continues-to-surge",
    "description": "As of recently, the crypto market has witnessed a period of recovery, where numerous altcoins began seeing significant gains in their value and are recouping some of the losses experienced during the past two weeks. Binance Coin and Stellar are two notable examples of well-established projects that have begun to get back up in value. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T13:57:38.000Z",
    "title": "Fed Chair Powell Signals Temporary Pause, Fueling Bitcoin, Ethereum, and Altcoin Rally",
    "url": "https://www.crypto-news-flash.com/fed-chair-powell-signals-temporary-pause-fueling-bitcoin-ethereum-and-altcoin-rally/?utm_source=rss&utm_medium=rss&utm_campaign=fed-chair-powell-signals-temporary-pause-fueling-bitcoin-ethereum-and-altcoin-rally",
    "description": "Bitcoin (BTC) attractiveness and growth have sparked a broad recovery for altcoins. The latest stance of the Federal Reserve on interest rate pause is one of the recent catalysts fueling growth. The broad cryptocurrency market has been on a recovery streak since Tuesday when BlackRock applied for a spot Bitcoin (BTC) Exchange Traded Fund (ETF) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T13:40:10.000Z",
    "title": "Bitcoin Set for Strongest Weekly Close Since March, $250 Million Profit Awaits Bulls at Friday’s Options Expiry",
    "url": "https://www.crypto-news-flash.com/bitcoin-set-for-strongest-weekly-close-since-march-250-million-profit-awaits-bulls-at-fridays-options-expiry/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-set-for-strongest-weekly-close-since-march-250-million-profit-awaits-bulls-at-fridays-options-expiry",
    "description": "Bitcoin (BTC) touches $30k after breaking resistance points following BlackRock&#8217;s ETF application. There is bearish trade in the options market with a put-to-call ratio of around 0.82 according to analysts.  Bitcoin (BTC) currently has a neutral market sentiment with an incredible 17 percent gain in the last 7 days. As of press time, the asset [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T13:56:00.000Z",
    "title": "Crypto Analyst: PEPE Will Outperform DOGE in Next Bull Cycle",
    "url": "https://coinedition.com/crypto-analyst-pepe-will-outperform-doge-in-next-bull-cycle/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE Will Outperform DOGE\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/PEPE-Will-Outperform-DOGE-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>PEPE will outperform DOGE in the next bull cycle, predicts Miles Deutscher, a renowned cryptocurrency analyst. In a Twitter post, Deutscher highlighted the reasons behind his prediction. Deutscher’s first reason for supporting PEPE to outperform DOGE in the next cycle is what he called “The Underwater Thesis.” He noted fewer PEPE holders are “underwater” compared [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-pepe-will-outperform-doge-in-next-bull-cycle/\">Crypto Analyst: PEPE Will Outperform DOGE in Next Bull Cycle</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T13:50:07.000Z",
    "title": "Alien Worlds (TLM) Price Prediction 2023-2030: Will TLM Price Hit $0.03 Soon?",
    "url": "https://coinedition.com/alien-worlds-tlm-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Alien-Worlds-(TLM)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Alien-Worlds-TLM-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Alien Worlds (TLM)? Alien Worlds built by its community is a decentralized, non-fungible token (NFT) metaverse where players compete for scarce resources, Trilium (TLM), in a stimulated economy centered around planetary worlds. In order to supplement the above structure, Alien Worlds also has a decentralized finance (DeFi) element to the game where players [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/alien-worlds-tlm-price-prediction/\">Alien Worlds (TLM) Price Prediction 2023-2030: Will TLM Price Hit $0.03 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]