[
  {
    "source": "Cointelegraph",
    "date": "2023-05-28T23:58:06.000Z",
    "title": "Ethereum’s Shanghai upgrade made it easier to detect criminals",
    "url": "https://cointelegraph.com/news/ethereum-s-shanghai-upgrade-made-it-easier-to-detect-criminals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/f19a184c-3415-4bdd-9f6b-82a7189e8abc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Staking rewards following Ethereum’s Shanghai upgrade have made it easier for investigators to spot counterintuitive behavior by ETH holders.</p>\n                    <p><p>With its historic Merge event in September, Ethereum has become a proof-of-stake blockchain. The mechanism now used to confirm transactions relies on validators staking their Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). Ethereum’s March upgrade, codenamed Shanghai, finally enabled stakers to withdraw their locked Ether. </p><p>The Ethereum ecosystem’s “investment themes” have included a)<a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\"> decentralized finance (DeFi)</a> b) stablecoins c) Bitcoin (via wrapped versions of BTC) and d) <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">non-fungible tokens (NFTs)</a>. With the upgrade, the network also began providing fixed-income assets. </p><p>There are currently several ways people make money on or using Ethereum. Broadly, they can be grouped into “investment themes,” including: a) <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>; b) stablecoins; c) Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) (via wrapped versions of BTC); and d) <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>. Following Shanghai, the network began to offer fixed-income assets. </p><h2>Risk-free rate</h2><p>Yield is one of the core pillars of traditional finance (TradFi). A rise or fall in yield leads to an increase or decrease in the perceived risk of other financial assets. Thus, movements in the benchmark rate set by the United States Federal Reserve provide the rationale behind investment decisions, in general.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-is-going-to-transform-investing\"><strong><em>Ethereum is going to transform investing</em></strong></a></p><p>Accordingly, compliance professionals use trends in the risk-free rate to detect irrational movement of funds in capital markets, as such fund flows might be attempts to launder money. The reasoning here is that launderers of illicit funds do not actively chase financial gains like regular investors, as the sole purpose of money laundering is to obfuscate the trail of dirty money.</p><p>With Ethereum’s staking yield denoting the “risk-free rate” of the crypto ecosystem, the Shanghai upgrade may have enhanced the state of crypto forensics.</p><h2>TradFi forensics focuses on activity — crypto forensics focuses on entities</h2><p>Financial crime risk in TradFi is managed using automatic systems that alert institutions to probable illicit use of financial assets. While data scientists design and deploy models to raise red flags over suspicious transactions, investigation teams still must assess resultant leads and evaluate if Suspicious Activity Reports (SARs) need to be filed.</p><p>An interesting point of contrast between forensics for TradFi and crypto is that the latter focuses more on the criminal entity than the activity itself. In other words, investigators analyze networks of crypto wallets to identify transfers of criminal assets.</p><p>Money laundering occurs in three stages: a) Placement: proceeds of crime enter the financial system; b) Layering: complex movement of funds to obscure the audit trail and sever the link with the original crime; and c) Integration: criminal proceeds are now fully absorbed into the legal economy and can be used for any purpose.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/29d791db-f6e5-4a35-b227-eef4a0f2e2a2.jpg\"  /></figure><p>For crypto assets, it is convenient to design solutions to detect the placement of illicit assets. This is because most laundered money originates from crypto-native crimes such as ransomware attacks, DeFi bridge hacks, smart contract exploits and phishing schemes. In all such offenses, a perpetrator’s wallet addresses are readily available. Consequently, once a crime has been committed, relevant wallets are monitored to analyze asset flows. </p><p>In contrast, forensic experts working for, say, a bank do not have any visibility into the offense — such as human or drug trafficking, cybercrime or terrorism — when criminal proceeds are being injected into a bank’s ecosystem. This makes detection extremely difficult. Hence, most Anti-Money Laundering (AML) solutions are designed to identify layering.</p><h2>Ethereum’s staking rewards make it easier to detect unusual activity</h2><p>To design solutions to detect layering, it is imperative to think like criminals, who craft complex flows of funds to obfuscate the money trail. The time-tested approach to exposing such activity is to spot the irrational movement of assets. This is because money laundering does not have the goal of generating profit.</p><p>With Ether’s post-Shanghai staking yields providing benchmark interest rates for crypto, we can formulate baseline risk-reward structures. Armed with this, investigators can systematically spot financial behavior running counter-intuitive to trends in the benchmark rate.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/thanks-to-ethereum-altcoin-is-no-longer-a-slur\"><strong><em>Thanks to Ethereum, ‘altcoin’ is no longer a slur</em></strong></a></p><p>To illustrate, there might be a pattern where an address or a group of addresses that points toward an entity that consistently takes on high risk while earning below the risk-free rate. A situation like that would almost certainly be investigated at a bank.</p><p>Case in point, such a transaction surveillance architecture can be used to detect the wash trading of NFTs. Here, multiple market participants collude to carry out numerous NFT trades with the goal of layering criminal assets or manipulating prices. Since earning profits is not the intention behind the vast bulk of these transactions, such activity will raise a red flag.</p><p>Similarly, in a situation where proceeds of terrorism are being layered via DeFi protocols, detection of irrational asset movements can provide substantial leads to investigators, even without knowledge of the actual crime.</p><h2>Financial crime and DeFi</h2><p>Traditional capital markets are often used to covertly move funds to circumvent sanctions and finance terrorist activity. Analogously, DeFi ecosystems present an attractive target for financial crime due to the ability to move vast sums of assets between jurisdictions using blockchain.</p><p>Further, there has been a significant shift in activity from centralized exchanges to decentralized exchanges due to recent fiascos like the collapse of FTX. This increase in DeFi volumes has made it easier for illegal flows to remain obscure. </p><p>Even more compelling is the introduction of better compliance controls by centralized crypto service providers – often mandated by regulators – which are likely driving criminals to seek out new channels for money laundering.</p><p>Consequently, illicit flows to DeFi could originate from an expanded set of crimes. This paradigm shift in crypto markets will require forensics teams to increase their capabilities of investigating complex fund flows across diverse protocols without prior knowledge of the source of criminal assets. </p><p>Accordingly, compliance efforts need to pivot around the discovery of layering typologies. In fact, with the rapid progress in blockchain interoperability, systematic surveillance to detect criminal transfers has become even more crucial.</p><p>Our ability to detect suspicious activity in crypto is less than ideal, partly due to crypto’s extreme price volatility. The volatility renders static risk thresholds ineffective and can enable money laundering to go undetected. In this sense, if and when Ethereum sets a benchmark rate, it will provide a means of establishing baseline rationality for fund flows and thus spotting outliers.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Debanjan Chatterjee</strong> has more than 17 years of experience analyzing trends in financial crime using data science, including more than 13 years at HSBC. He holds a master’s in economics from India’s Delhi School of Economics.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T00:00:08.000Z",
    "title": "Chinese Yuan to Replace US Dollar as World’s Reserve Currency, Says Russian Banker",
    "url": "https://news.bitcoin.com/chinese-yuan-to-replace-us-dollar-as-worlds-reserve-currency-says-russian-banker/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Chinese Yuan to Replace US Dollar as World&#039;s Reserve Currency, Says Russian Banker\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/vtb-bank-yuan-dollar.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Russia&#8217;s second-largest bank’s chairman says there is every reason to expect the Chinese yuan to replace the U.S. dollar as the world’s main reserve currency. He highlighted that the central bank of Russia has already begun investing its reserves in yuan, and over 70% of the trade turnover between Russia and China is settled in [&#8230;]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T00:04:09.000Z",
    "title": "Brazil’s New President Says BRICS Should Launch Global Currency, Highlights Plan to Boost Business With China",
    "url": "https://dailyhodl.com/2023/05/28/brazils-new-president-says-brics-should-launch-global-currency-highlights-plan-to-boost-business-with-china/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/lulu-brics-currency.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Brazilian President Luiz Inácio Lula da Silva says he believes a group of five nations collectively known as BRICS should create its own common currency to compete on the global stage. After attending the G7 meeting in Hiroshima, President Lula hosted a press conference touting the benefits of a common currency that does does not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/28/brazils-new-president-says-brics-should-launch-global-currency-highlights-plan-to-boost-business-with-china/\">Brazil&#8217;s New President Says BRICS Should Launch Global Currency, Highlights Plan to Boost Business With China</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T00:00:52.000Z",
    "title": "$51,000 Ethereum (ETH) Now on the Table, According to VanEck – Here’s Their Outlook",
    "url": "https://dailyhodl.com/2023/05/28/51000-ethereum-eth-now-on-the-table-according-to-vaneck-heres-their-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Ethereum-Investor-Turns-7.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Global investment manager VanEck says Ethereum (ETH) could hit $51,000 in less than seven years if certain conditions align. In a new research report, VanEck lays out its base, bear and bull cases for Ethereum&#8217;s performance going into the end of the decade. VanEck explains its methodology in finding its estimates: &#8220;We base these estimates [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/28/51000-ethereum-eth-now-on-the-table-according-to-vaneck-heres-their-outlook/\">$51,000 Ethereum (ETH) Now on the Table, According to VanEck – Here’s Their Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]