[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T15:51:15.000Z",
    "title": "SEC Sought Freeze Order Despite ‘No Evidence’ That Binance Was Moving U.S. Customer Funds",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/23/sec-sought-freeze-order-despite-no-evidence-that-binance-was-moving-us-customer-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC’s “pre-crime” litigation strategy seemed to annoy Judge Amy Jackson."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-23T16:04:12.000Z",
    "title": "Bored Ape Yacht Club NFT Prices Are Plunging—Why?",
    "url": "https://decrypt.co/145947/bored-ape-yacht-club-nft-prices-plunging-why",
    "description": "Traders suggest that airdrop farming for the Blur marketplace token is having a negative effect on Bored Ape Yacht Club NFT floor prices."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T15:56:18.000Z",
    "title": "US Supreme Court halts Coinbase cases in its first crypto ruling",
    "url": "https://cointelegraph.com/news/us-supreme-court-halts-coinbase-cases-first-crypto-ruling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c6dd3a29-0769-490d-b55b-63002c28d6cf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United States Supreme Court ruled in favor of Coinbase in its first-ever opinion on a cryptocurrency case on June 23. </p>\n                    <p><p>The United States Supreme Court decided in favor of cryptocurrency exchange Coinbase on June 23 in a partisan opinion that will halt court proceedings against the company in two California cases. </p><p>Plaintiffs in the class-action lawsuits alleged Coinbase failed to provide proper relief after users lost money and that Coinbase allegedly engaged in deceptive advertising. </p><p>Coinbase asked the district courts overseeing the cases to dismiss them on the grounds that, per the company, users signed an agreement upon creating their accounts stating that such disputes would be handled through arbitration in lieu of lawsuits.</p><p>Per a court document <a href=\"https://www.courthousenews.com/wp-content/uploads/2023/06/coinbase-v-bielski-scotus-opinion.pdf\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> by Courthouse News: </p><blockquote>“The sole question here is whether the district court must stay its pre-trial and trial proceedings while the interlocutory appeal is ongoing. The answer is yes: The district court must stay its proceedings.”</blockquote><p>This ruling marks the U.S. high court’s first cryptocurrency-related ruling. Justice Brett Kavanaugh wrote the opinion, which was supported by four of the court’s five other conservative justices in a 5–4 vote. </p><p>California district courts will now kick both cases into arbitration, which is typically less costly for companies than arguing or settling cases through the courts. </p><p>While this represents a win for Coinbase, it could also have a ripple effect throughout the crypto industry. </p><p>As the court wrote in its opinion, “When creating a Coinbase account, individuals agree to the terms in Coinbase’s User Agreement. As relevant here, the User Agreement contains an arbitration provision, which directs that disputes arising under the agreement be resolved through binding arbitration.”</p><p>After California’s district courts denied Coinbase’s request for arbitration in the aforementioned cases, the company filed appeals requesting a stay while the appeals were handled, but the courts were inclined to continue the civil cases in spite of the company’s appeals.</p><p> The Supreme Court’s June 23 decision grants the stays and allows Coinbase’s appeals to go through before the class-action suits can continue. The court’s decision affords Coinbase the same legal treatment typically given to all companies <a href=\"https://www.law.cornell.edu/wex/federal_arbitration_act\" target=\"_blank\" rel=\"noopener nofollow\">under</a> the U.S. Federal Arbitration Act of 1925.</p><p>It’s unclear at this time how similar cases against other cryptocurrency companies will be affected, and there’s no indication that this case will affect the Securities and Exchange Commission’s ongoing action against Coinbase.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\"><strong><em>SEC sues Coinbase for breaking US securities rules</em></strong></a></p><p>However, it is notable that the Supreme Court’s ruling essentially underpins the idea that existing laws can be seamlessly applied to cases involving the cryptocurrency industry. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T15:45:06.000Z",
    "title": "Circle and Sequoia were among top depositors at Silicon Valley Bank: Report",
    "url": "https://cointelegraph.com/news/circle-and-sequoia-top-depositors-silicon-valley-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/06cfdb24-2321-4c83-b270-16bff89a8da7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to a Bloomberg report, other major depositors included Silicon Valley Bank, SVB Financial Group, biotechnology research company Altos Labs and China-based firm Kanzhun.</p>\n                    <p><p>Stablecoin issuer Circle and venture capital firm Sequoia Capital were reportedly among the top 10 depositors at the collapsed crypto-friendly Silicon Valley Bank (SVB) in March.</p><p>According to a June 23 report from Bloomberg, the Federal Deposit Insurance Corporation (FDIC) <a href=\"https://www.bloomberg.com/news/articles/2023-06-23/fdic-insured-billions-in-deposits-for-sequoia-other-top-svb-customers\" target=\"_blank\" rel=\"noopener nofollow\">provided</a> documents suggesting that Circle, Sequoia and others were covered for deposits in the billions of dollars. The Federal Reserve announced following the SVB collapse that it would work with the FDIC to make both insured and uninsured depositors whole — in most situations, the FDIC only insures up to $250,000 per depositor.</p><p>Circle reportedly held roughly $3.3 billion in deposits, while Sequoia had roughly $1 billion. Other major depositors included Silicon Valley Bank itself, SVB Financial Group, biotechnology research firm Altos Labs and Kanzhun Limited, a China-based company behind a major online recruitment platform.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">WHOA. The FDIC accidentally posted an un-redacted document showing that the big VC firm Sequoia had $1 billion on deposit at SVB when it collapsed <a href=\"https://t.co/hCbcHZ0yev\">https://t.co/hCbcHZ0yev</a> <a href=\"https://t.co/Ys1qbHnvDr\">pic.twitter.com/Ys1qbHnvDr</a></p>&mdash; Joe Weisenthal (@TheStalwart) <a href=\"https://twitter.com/TheStalwart/status/1672219482129854464?ref_src=twsrc%5Etfw\">June 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/circle-ceo-blames-us-crypto-crackdown-for-declining-usdc-market-cap\"><strong><em>Circle CEO blames US crypto crackdown for declining USDC market cap</em></strong></a></p><p>The failure of SVB and the subsequent collapses of Signature Bank and First Republic Bank has <a href=\"https://cointelegraph.com/news/us-exploring-ways-to-guarantee-the-country-s-18t-of-bank-deposits-report\">put a spotlight</a> on how regulators in the United States handle deposit insurance. Though the Fed, FDIC and Treasury Department said covering SVB and Signature deposits of more than $250,000 was part of a “systemic risk exception,” they have reportedly explored raising the insurance limit.</p><p>Following the failure of SVB in March and Circle <a href=\"https://cointelegraph.com/news/usdc-depegs-as-circle-confirms-3-3b-stuck-with-silicon-valley-bank\">confirming it had roughly $3.3 billion</a> in exposure to the bank, the firm’s USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) briefly depegged from the U.S. dollar. In June, the stablecoin issuer announced it planned to <a href=\"https://cointelegraph.com/news/circle-to-launch-official-version-of-usdc-natively-on-arbitrum\">launch a native version</a> of USDC on the Arbitrum network.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T15:51:48.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and it is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin (APE) ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-23T15:57:19.000Z",
    "title": "Insights On Golteum (GLTM) Presale And Similar Utility Tokens With Great Posture",
    "url": "https://nulltx.com/insights-on-golteum-gltm-presale-and-similar-utility-tokens-with-great-posture/",
    "description": "The potential choices for investors seeking profits and stability are Golteum (GLTM), Litecoin (LTC), and Cardano (ADA). Golteum is a new crypto project that tokenizes precious metals like gold as an investment. Cardano is a proof-of-stake blockchain platform that aims to allow change-makers, innovators, and visionaries to bring about positive global change. Litecoin is a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T15:53:47.000Z",
    "title": "Circle was a principal beneficiary of SVB government rescue",
    "url": "https://crypto.news/circle-was-a-principal-beneficiary-of-svb-government-rescue/",
    "description": "A recent report by Bloomberg states that Circle, the issuer of the USDC stablecoin, emerged as a primary recipient of support from the government-backed rescue of Silicon Valley Bank (SVB). "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T15:43:14.000Z",
    "title": "CACEIS Bank gains PSAN registration, becomes first digital asset custodian in France",
    "url": "https://crypto.news/caceis-bank-gains-psan-registration-becomes-first-digital-asset-custodian-in-france/",
    "description": "CACEIS Bank, the French banking entity of the CACEIS group, has achieved a significant milestone by obtaining PSAN status from the AMF, following the recommendation of the ACPR."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T16:00:09.000Z",
    "title": "Ethereum Bullsh Signal: Supply On Exchanges Continues To Hit New All-Time Lows",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-bullsh-supply-exchanges-hit-new-all-time-lows/",
    "description": "On-chain data shows the Ethereum supply on exchanges has continued to drop lower recently, a sign that could be bullish for the asset. Ethereum Supply On Exchanges Has Gone Down Recently According to data from the on-chain analytics firm Santiment, supply has continued to leave exchanges recently. The relevant indicator here is the &#8220;supply on exchanges,&#8221; which measures the total percentage of the Ethereum supply that&#8217;s sitting in the wallets of all centralized exchanges. When the value of this metric increases, it means that a net number of coins is entering the supply of these platforms. As one of the main reasons why investors might want to deposit their ETH to the exchanges is for selling-related purposes, this kind of trend can have a bearish effect on the asset&#8217;s value. On the other hand, decreasing values of the indicator imply the holders are withdrawing their coins from these platforms right now. Such a trend, when prolonged, may be a hint that the investors are accumulating currently, and hence, can be bullish for the cryptocurrency. Related Reading: Bitcoin 30-Day Price Range Foreshadowed The Rally, Here’s How Now, here is a chart that shows the trend in the Ethereum supply on exchanges over the last few months: The value of the metric seems to have been going down in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the Ethereum supply on exchanges has been in a downtrend during the last few weeks, implying that investors have been constantly taking out their coins from these platforms. When these withdrawals started, the indicator had reached what was essentially an all-time low (the only time the metric&#8217;s value was lower was way back during the first week of the asset going live for public trading). As the holders have continued to transfer their ETH out of the exchanges, new all-time lows in the metric have continued to be hit. Interestingly, even after the latest sharp rally in the Ethereum price has occurred, the metric hasn&#8217;t deviated from its downward trajectory. Usually, during rapid increases in the asset&#8217;s value, the supply on exchanges tends to go up as some investors look to take advantage of the profit-taking opportunity. Related Reading: Bitcoin Whales Show Most Active Hour In 3 Months As BTC Breaks $30,000 Since the indicator has only continued to go down further recently, it&#8217;s possible that even if there is some selling going on, there is also enough buying going to make up for it. In the chart, Santiment has also included the data for the &#8220;average fees,&#8221; an indicator that measures the average amount of fees that investors are attaching to their Ethereum transactions currently. From the graph, it&#8217;s visible that this metric has been relatively low recently. It would appear that even though the rally has taken place, the network activity hasn&#8217;t yet exploded, as the fees generally shoot up when there is a high amount of traffic on the blockchain. The analytics firm notes, however, that this setup is quite similar to that observed back in March, following which Ethereum saw a rapid rise toward the $2,100 level. ETH Price At the time of writing, Ethereum is trading around $1,800, up 12% in the last week. Looks like the value of the asset has seen a sharp surge recently &#124; Source: ETHUSD on TradingView Featured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T16:02:00.000Z",
    "title": "Crypto Analyst: Bitcoin Leads Crypto Market Into a Bullish Range",
    "url": "https://coinedition.com/crypto-analyst-bitcoin-leads-crypto-market-into-a-bullish-range/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/btc-101.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/btc-101.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/btc-101-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ran Neuner, the founder of Crypto Banter, has provided insight into his analysis of how cryptocurrency prices could develop under the present conditions. In a video uploaded to YouTube, the renowned analyst explained the market trend using notable price levels of the previous month. Neuner’s analysis revolved around the high, low, and mid-price levels of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-bitcoin-leads-crypto-market-into-a-bullish-range/\">Crypto Analyst: Bitcoin Leads Crypto Market Into a Bullish Range</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-23T15:42:28.000Z",
    "title": "What Does the Bitcoin DeFi Ecosystem Look Like?",
    "url": "https://blog.bitfinex.com/education/what-does-the-bitcoin-defi-ecosystem-look-like/",
    "description": "<p>Decentralised Finance has taken the crypto world by storm, making Ethereum the second largest blockchain by market capitalisation and spawning legions of parallel EVM-based, Web3, layer one, blockchains. It’s a little known fact, but DeFi also exists in Bitcoin-land and is growing quickly. Let&#8217;s examine...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/what-does-the-bitcoin-defi-ecosystem-look-like/\">What Does the Bitcoin DeFi Ecosystem Look Like?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]