[
  {
    "source": "Cointelegraph",
    "date": "2023-07-23T06:10:28.000Z",
    "title": "Evidence of crypto usage by ISIS is 'mounting': TRM Labs",
    "url": "https://cointelegraph.com/news/evidence-crypto-usage-isis-trm-labs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/66d39c13-3b2a-45a8-a753-4a65ea64b381.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain intelligence platform TRM Labs revealed that Tether (USDT) on the Tron network was being used for most of the transactions. </p>\n                    <p><p>Blockchain intelligence platform TRM Labs recently released a report that presents several case studies highlighting the use of cryptocurrency by ISIS affiliates across Asia. The report links on-chain connections between these groups and pro-ISIS fundraising campaigns in Syria.</p><p><a href=\"https://www.trmlabs.com/post/trm-finds-mounting-evidence-of-crypto-use-by-isis-and-its-supporters-in-asia\" target=\"_blank\" rel=\"noopener nofollow\">Published</a> on July 21, the report indicated that there was “mounting on-chain evidence” from the past twelve months that pro-ISIS networks in Tajikistan, Indonesia and Afghanistan have utilized cryptocurrency to help facilitate operations. </p><p>According to the report, the majority of transactions linked with the cases involved the use of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) on the Tron network (<a href=\"https://cointelegraph.com/tron-price-index\">TRX</a>).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/44bd1108-d47d-45a3-88cd-e683a38e7532.png\"  /><figcaption style=\"text-align: center;\"><em>Extract from 'TRM Finds Mounting Evidence of Crypto Use by ISIS and its Supporters in Asia' report. Source: TRM Labs</em></figcaption></figure><p>On July 21, Cointelegraph covered a presentation by Tara Annison, Elliptic’s former head of technical crypto advisory, where she also emphasized that Tron and Tether were popular assets for illicit use, as criminals were <a href=\"https://cointelegraph.com/news/criminals-prefer-stablecoins-over-bitcoin-for-illicit-use#:~:text=Criminals%20have%20moved%20away%20from,an%20alternative%20due%20to%20accessibility.\">shifting away from </a>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in favor of stablecoins. </p><p>The report pointed to an instance in Tajikistan where <a href=\"https://cointelegraph.com/news/israeli-authorities-seize-crypto-from-terror-organizations-credit-new-technology\">crypto was used</a> to recruit fighters for ISIS’s affiliate in Afghanistan. One of the fundraising campaigns, which was operational for more than a year, was linked to an address that received “around USD 2 million in USDT” on Tron in 2022. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/debunking-the-myth-cryptocurrency-is-used-for-criminal-activity\"><strong><em>Debunking the myth: Cryptocurrency is used for criminal activity</em></strong></a></p><p>Through blockchain tracing, TRM Labs identified the flow of funds and notified the exchange used by the group for cashing out their funds. The exchange then alerted local authorities, resulting in Turkish authorities arresting a senior ISIS fundraiser. </p><p>Additionally, the report noted a significant number of individuals using Indonesian-based exchanges to send funds to addresses associated with pro-ISIS fundraising campaigns in Syria. </p><blockquote>“Over USD 517,000 was sent in 2022 by individuals using an Indonesia-based exchange to addresses identified by TRM Labs as belonging to pro-ISIS fundraising campaigns in Syria and the local exchanges that facilitate their activities.”</blockquote><p>It was further reported that a media unit linked to ISIS’s affiliate in Pakistan (ISPP) began promoting its ability to accept donations in the second half of 2022.</p><p>TRM Labs identified that the addresses controlled by the group had a total volume of approximately $40,000 over the last twelve months.</p><p>This comes after TRM Labs revealed in a June 28 report that <a href=\"https://cointelegraph.com/news/bitcoin-btc-no-longer-favored-illicit-crypto-activity-trm-labs\">illicit finance volume</a> involving Bitcoin had fallen significantly over the past seven years. It noted that while Bitcoin was once the \"exclusive currency\" for terrorist financing in previous years, by 2022 it had all changed.</p><p>TRM Labs reported that by 2022, Tron was used for 92% of terrorist financing. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\">US enforcement agencies are turning up the heat on crypto-related crime</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-23T06:11:48.000Z",
    "title": "Bitcoin’s Bullish Future: Unpacking the Power of the Absorption Rate On-Chain Metric",
    "url": "https://www.cryptoglobe.com/latest/2023/07/bitcoins-bullish-future-unpacking-the-power-of-the-absorption-rate-on-chain-metric/",
    "description": "As the crypto space, analysts and investors alike are always looking for new metrics and indicators that can provide insights into market trends. One such metric that has recently caught the crypto community’s attention is Bitcoin’s yearly absorption rate on exchanges. This on-chain metric, as The Daily Hodl reported, shows signs of a bullish future […]\n"
  }
]