[
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T14:25:00.000Z",
    "title": "Ethereum price sees new low versus Bitcoin since switching to Proof-of-Stake",
    "url": "https://cointelegraph.com/news/ethereum-price-new-low-bitcoin-switch-pos",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a617ddf3-1a69-45ca-9d98-1ed411b4dfdc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum spot ETF request, Ripple’s potential win against the SEC, and growing decentralized app dominance retain hope for ETH investors.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has seen a 36% year-to-date increase in its price in 2023 in U.S. dollar terms. This recovery, however, is modest given that ETH is currently trading 66% below its November 2021 peak of $4,870. </p><h2>Ethereum vs. Bitcoin: 14-month downtrend and counting </h2><p>Moreover, on Sept. 20, Ether reached its lowest levels against Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in 14 months, breaching the critical 0.06 BTC support. This has raised questions among Ether investors about the factors behind this price decline and what it will take to reverse the trend.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/466b9c55-bca7-4fa2-b288-a1417860c782.png\"  /><figcaption style=\"text-align: center;\"><em>Ether price / BTC at Coinbase. Source: TradingView</em></figcaption></figure><p>ETH buyers placed their biggest hopes on protocol upgrades that significantly reduced the need for new coin issuance when the <a href=\"https://cointelegraph.com/news/ethereum-merge-a-year-later-energy-consumption-down-centralization-fears-ongoing\">network transitioned to a Proof-of-Stake consensus</a> mechanism. </p><p>These hopes were realized in mid-September 2022, resulting in an annualized issuance rate of just 0.25% of the supply. This transformation aligned with the Ethereum community's vision of \"ultrasound money.\"</p><p>Furthermore, the subsequent <a href=\"https://cointelegraph.com/news/ethereum-s-shapella-hard-fork-executed-on-mainnet\">Shapella upgrade</a> on April 12 allowed for withdrawals from the native staking protocol, addressing a major concern for investors. Previously, both the 32 ETH deposits and the yield from participating in the network consensus were locked up indefinitely.</p><p>Confidence among Ethereum enthusiasts grew as these significant hurdles were crossed with minimal issues. They anticipated that the price of Ether would surpass $2,000, a prediction that came true on April 14. </p><p>However, this optimism was short-lived, as ETH's price promptly fell back to the same $1,850 level just a week later.</p><p>Notably, instead of witnessing a net withdrawal, Ethereum staking experienced a net inflow of 3.1 million ETH in the 30 days following the Shappela upgrade, surpassing even the most optimistic expectations. </p><p>Given that the Ethereum network's planned developments have generally been on track, albeit with the customary delays, investors now need to explore other potential catalysts for reversing the current downtrend in Ether's price relative to BTC.</p><h2>External factors present important triggers for ETH price </h2><p>One of these potential catalysts lies in the ongoing legal battle between Ripple (formerly Ripple Labs) and the U.S. Securities and Exchange Commission (SEC), which could significantly impact Ether's price momentum. </p><p>The SEC contends that <a href=\"https://cointelegraph.com/news/sec-urges-court-to-grant-ripple-labs-appeal\">XRP sales to retail investors constitute a security offering</a>. However, in July, Judge Analisa Torres ruled that XRP generally does not qualify as a security under SEC guidelines, especially when distributed through exchanges.</p><p>As noted by the \"American Lawyer and Bitcoiner\" Bryan Jacoutot on a social network, the Ethereum Foundation remains exposed due to the pre-sale of ETH directed toward institutional investors and subject to a lock-up period.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">(1/12) ANALYSIS: I&#39;ve reviewed the district court ruling on XRP and it rests on very shaky ground. Expect an appeal.<br><br>AND Ethereum Foundation remains at risk even if its upheld because of important distinctions in the methods used by Ripple to sell the &quot;pre-mine&quot;<br><br> ⬇️⬇️</p>&mdash; Bryan Jacoutot (@BryanJacoutot) <a href=\"https://twitter.com/BryanJacoutot/status/1679539619312853028?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Jacoutot, even if Ripple were to secure a favorable outcome, it wouldn't immediately mitigate the risks for Ethereum. Nevertheless, it's undeniable that the regulatory uncertainty surrounding the Ether ICO remains a source of concern for investors.</p><p>On Sep. 20, an Ethereum address associated with the ICO era showed its first activity, transferring 32.1 ETH (valued at $52,000 at the time) directly to Coinbase. This additional movement only amplified regulatory concerns since there are no apparent incentives for addresses that have remained dormant for four to eight years to divest at this particular point in the market cycle.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An Ethereum ICO participant who has been dormant for 8 years transferred 32.1 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> to <a href=\"https://twitter.com/hashtag/Coinbase?src=hash&amp;ref_src=twsrc%5Etfw\">#Coinbase</a> just now.<br><br>The address received 200 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> at Ethereum Genesis.<br><br>And the address appears to be related to shemnon.eth (<a href=\"https://twitter.com/shemnon?ref_src=twsrc%5Etfw\">@shemnon</a>).<a href=\"https://t.co/nj5eF8iRT0\">https://t.co/nj5eF8iRT0</a> <a href=\"https://t.co/6Viytn4dU5\">pic.twitter.com/6Viytn4dU5</a></p>&mdash; Lookonchain (@lookonchain) <a href=\"https://twitter.com/lookonchain/status/1704532027889025529?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A similar occurrence unfolded with an address <a href=\"https://twitter.com/PeckShieldAlert/status/1704093424994177137\" target=\"_blank\" rel=\"noopener nofollow\">linked</a> to Vitalik Buterin, which sent 300 ETH (worth $490,000 at the time) to the Kraken exchange on Sep. 19.</p><h2>More positive news gives hope for Ethereum investors</h2><p>On the news side, Ethereum has seen some positive surprises, such as the unexpected <a href=\"https://cointelegraph.com/news/ark-invest-21shares-file-spot-ether-etf\">request for a spot Ether exchange-traded fund (ETF)</a> by ARK Invest and 21Shares on Sep. 6. This development reduced the risks associated with excessive institutional concentration in Bitcoin, particularly if the ETF is approved.</p><p>Additionally, Canto, a layer-1 Cosmos-native blockchain, <a href=\"https://cointelegraph.com/news/canto-and-astar-blockchains-plan-migration-to-ethereum-ecoystem\">announced its migration to Ethereum's layer-2</a> on Sep. 18. This Zero-Knowledge, permissionless rollup, compatible with the Ethereum Virtual Machine (EVM), is primarily focused on bringing traditional finance into the Ethereum ecosystem.</p><p>Should Bitcoin's price surge be driven solely by the approval of a spot <a href=\"https://cointelegraph.com/news/bitcoin-spot-push-us-trading-volumes-crypto-etf\">Bitcoin ETF</a> or inflation concerns in the U.S., Ether is well-positioned to follow suit, benefiting from the same catalysts.</p><p>Meanwhile, Ethereum's primary competitors in the decentralized applications sector, namely Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) and BSC Chain (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), face similar risks pertaining to ICO and securities regulations, making it unlikely for them to challenge Ethereum's dominance in terms of total value locked, or TVL, and trading volumes.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T14:14:21.000Z",
    "title": "Hashing It Out: What happens when crypto meets fintech in Africa?",
    "url": "https://cointelegraph.com/news/hashing-it-out-crypto-meets-fintech-innovation-africa",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4ffa511f-f94f-49ad-a454-cf68c03407ee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Guests on Hashing It Out episode 31 believe that traditional finance has hurt innovation in the African fintech space, and cryptocurrency can breathe some life into the space. </p>\n                    <p><p>Ahead of the Africa Money and DeFi Summit, Hashing It Out host Elisha Owusu Akyaw (GhCryptoGuy) speaks with Andrew Fassnidge, founder of Africa Tech Summit, and Enoch Antwi, CEO of Dnar, on the intersection between cryptocurrency developments on the African continent and the financial technology sector. Fassnidge shares his experience from the perspective of an investor and conference organizer who has seen the genesis of multiple unicorns on the content, and Antwi offers his thoughts from the perspective of a founder in both sectors. </p><p>Andrew Fassnidge, founder of Africa Tech Summit, opens the podcast with an explanation of the state of fintech in Africa. Fassnidge explains that despite the growth of financial technology applications on the continent, the rise of failed startups that raised huge capital has cast a dark shadow over the ecosystem. The lack of sustainability of innovations in the space has harmed investor confidence and has made the masses wary of using local financial apps. Additionally, the state of local currencies has created an appetite for storing wealth in foreign currencies. This trend is making decentralized finance and stablecoins popular in African markets. </p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096415\"></template><p>Enoch Antwi, CEO of Dnar, a finance application that has taken a decision to rebuild and re-enter the Ghanaian market this quarter, also explains that the ecosystem has reached a tipping point where the innovation that follows will be exponential. He also explains that favorable regulations will be developed in the next few years. He said: </p><blockquote> \"I am hearing some good things coming out of different markets across Africa, which which weren't happening three or four years ago in terms of regulation and policy towards digital assets. And normally it was just let's ban it, let's stop it. And now they realize. Actually. Well, we can't stop it because people are using it anyway.\"</blockquote><p>The episode also discusses issues concerning fundraising by African startups and the use cases of decentralized finance on the African continent. </p><p>Listen to the latest episode of<em> Hashing It Out</em> on <a href=\"https://open.spotify.com/show/3ibvcrJ87PAso4DBIiE5qn?si=5071800991044f7a\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>, <a href=\"https://podcasts.apple.com/us/podcast/hashing-it-out/id1658998696?app=podcast\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a>, <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8yMDk2NDE1LnJzcw\" target=\"_blank\" rel=\"noopener nofollow\">Google Podcasts</a>, or <a href=\"https://tunein.com/podcasts/Business--Economics-Podcasts/Hashing-It-Out-p3083469/\" target=\"_blank\" rel=\"noopener nofollow\">TuneIn</a>. You can also explore Cointelegraph's complete catalog of informative podcasts on the <a href=\"https://cointelegraph.com/podcasts\">Cointelegraph Podcasts page</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T14:30:08.000Z",
    "title": "Unprecedented Whale Activity in Long-Term Options Signals a Market Surge.",
    "url": "https://www.cryptopolitan.com/whale-activity-signals-as-market-surge/",
    "description": "In an astonishing turn of events within the cryptocurrency options market, significant trading activity involving Ethereum (ETH) options has taken place in the past hour, attracting attention from investors and experts alike. This whirlwind of activity centers on a complex strategy known as a diagonal spread, with 4,500 sets of sell ETH-28JUN24-4000-C and buy ETH-29MAR24-1900-C ... <a title=\"Unprecedented Whale Activity in Long-Term Options Signals a Market Surge.\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whale-activity-signals-as-market-surge/\" aria-label=\"More on Unprecedented Whale Activity in Long-Term Options Signals a Market Surge.\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T14:27:42.000Z",
    "title": "Streamlining UI Development for Robust and User-Friendly Interfaces",
    "url": "https://www.cryptopolitan.com/ui-development-for-robust-interfaces/",
    "description": "Building user interfaces (UIs) that strike the right balance between ease of use and maintainability is a constant challenge in today&#8217;s software development landscape. Glenn Reyes, a renowned expert in UI development, shared insights on this topic at NDC Oslo 2023.&#160; The challenge of building robust UIs Scaling a UI project without sacrificing simplicity and ... <a title=\"Streamlining UI Development for Robust and User-Friendly Interfaces\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ui-development-for-robust-interfaces/\" aria-label=\"More on Streamlining UI Development for Robust and User-Friendly Interfaces\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T14:26:50.000Z",
    "title": "The Ultimate Guide to 2023’s Highest-Paying Crypto Games",
    "url": "https://www.cryptopolitan.com/2023s-highest-paying-crypto-games/",
    "description": "The world of gaming has evolved dramatically over the years, and the advent of blockchain technology has opened up new avenues for gamers to not just play but also earn. Crypto games, often referred to as &#8220;play-to-earn&#8221; games, have become a lucrative ecosystem where players can make real money. Play-to-earn (P2E) games have emerged as ... <a title=\"The Ultimate Guide to 2023&#8217;s Highest-Paying Crypto Games\" class=\"read-more\" href=\"https://www.cryptopolitan.com/2023s-highest-paying-crypto-games/\" aria-label=\"More on The Ultimate Guide to 2023&#8217;s Highest-Paying Crypto Games\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T14:32:23.000Z",
    "title": "Bitsa introduces saving: a new feature for crypto investors",
    "url": "https://crypto.news/bitsa-introduces-saving-a-new-feature-for-crypto-investors/",
    "description": "Bitsa, a European prepaid card service that allows users to buy and sell cryptocurrencies, has launched a new feature called Saving. Saving is a tool that enables users to automate their crypto investments using the dollar-cost averaging (DCA) strategy. The&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T14:28:51.000Z",
    "title": "The good, the bad, and the hilarious: 7 iconic crypto tweets we can’t forget",
    "url": "https://crypto.news/the-good-the-bad-and-the-hilarious-7-iconic-crypto-tweets-we-cant-forget/",
    "description": "From moon predictions to market madness, we revisit the most memorable tweets in crypto's history."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T14:10:36.000Z",
    "title": "South Korea to launch a blockchain city",
    "url": "https://crypto.news/south-korea-to-launch-a-blockchain-city/",
    "description": "Busan, the second-largest city in South Korea, is embarking on an ambitious project to become a blockchain city. The project aims to integrate various blockchain-based services from different platforms into one unified platform that will power the city&#8217;s development. The&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T14:40:14.000Z",
    "title": "Crypto Analyst EGRAG’s Take: XRP’s Fate Hangs on $0.55 Breakthrough",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-egrags-take-xrps-fate-hangs-on-0-55-breakthrough/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-egrags-take-xrps-fate-hangs-on-0-55-breakthrough",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Prominent crypto analyst EGRAG anticipates XRP could rally to $0.60, pending a critical break above the $0.55 resistance. Recent bullish movement enabled XRP to shatter a major descending trendline, signaling potential upside momentum. The Current Trajectory of XRP The dynamic world of cryptocurrencies always presents moments of suspense, and XRP&#8216;s recent price movements are no [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-21T14:30:00.000Z",
    "title": "Stellar’s Protocol 20 Upgrade Has A Surprising Effect on XLM",
    "url": "https://coinedition.com/stellars-protocol-20-upgrade-has-a-surprising-effect-on-xlm/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/STELLAR-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On September 20, Stellar (XLM) completed its protocol 20 upgrade, geared at introducing support for businesses and developers building on the Stellar network. According to Stellar, the upgrade was a complex one, and by far the biggest since the project launched. While the upgrade on Wednesday was only a testnet version, Stellar in its blog [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/stellars-protocol-20-upgrade-has-a-surprising-effect-on-xlm/\">Stellar’s Protocol 20 Upgrade Has A Surprising Effect on XLM</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T14:30:44.000Z",
    "title": "Ethereum Wallet Suddenly Sells All Its ETH for Millions in Stablecoins After Lying Dormant for Nearly Four Years",
    "url": "https://dailyhodl.com/2023/09/20/ethereum-wallet-suddenly-sells-all-its-eth-for-millions-in-stablecoins-after-lying-dormant-for-nearly-5-years/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Its-ETH-for-Millions.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A long-dormant Ethereum (ETH) wallet suddenly sold all $4.18 million worth of its ETH on Tuesday, according to the crypto tracker Lookonchain. The wallet had held on to 2,591 ETH since November 2018, when the second-largest crypto asset by market cap was trading at around $110. Ethereum is trading at $1,634 at time of writing, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/ethereum-wallet-suddenly-sells-all-its-eth-for-millions-in-stablecoins-after-lying-dormant-for-nearly-5-years/\">Ethereum Wallet Suddenly Sells All Its ETH for Millions in Stablecoins After Lying Dormant for Nearly Four Years</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]