[
  {
    "source": "Cointelegraph",
    "date": "2023-07-22T04:57:20.000Z",
    "title": "SEC hints at potential appeal to XRP ruling from Ripple Labs lawsuit",
    "url": "https://cointelegraph.com/news/sec-hints-at-potential-appeal-to-xrp-ruling-from-ripple-labs-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/092a9399-d435-4018-8781-bfa61c9be5aa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to court documents, the SEC stated that it is now  “considering the various available avenues for further review” on the ruling which found XRP to not be a security.  </p>\n                    <p><p>The U.S. Securities and Exchange Commission has suggested that it may appeal a recent ruling on the Ripple Labs lawsuit, which deemed <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">XRP to not be a security</a> when sold to retail investors. </p><p>The SEC argues that the ruling goes against “fundamental securities laws principles” such as the Howey Test, which determines what falls under the category of an investment contract or not. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Do we really want a judge to ask herself: Does my strict application of the Howey test in this case result in an outcome in 2023 that comports with the policy implications behind a 1934 statute? <a href=\"https://t.co/acMNRc00B6\">https://t.co/acMNRc00B6</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1682559575638315008?ref_src=twsrc%5Etfw\">July 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC’s latest comments on the Ripple Labs lawsuit were made in a separate <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">lawsuit against Terraform Labs and its founder Do Kwon,</a> over allegedly “orchestrating a multi-billion dollar crypto asset securities fraud.” </p><p>As per the SEC’s July 21 response to a motion to dismiss from Terraform Labs — in which the potentially precedent-setting Ripple Labs ruling was referenced by the defendants — the SEC highlighted a host of issues it holds against the court’s recent decision on XRP. </p><p> “Contrary to Defendants’ assertions, much of the Ripple ruling supports the SEC’s claims in this case and rejects arguments Defendants have raised here. However, with respect to the Programmatic and other sales, the SEC respectfully avers that Ripple conflicts with and adds baseless requirements to Howey and its progeny,” the SEC stated, adding that:</p><blockquote>“Respectfully, those portions of Ripple were wrongly decided, and this Court should not follow them. SEC staff is considering the various available avenues for further review and intends to recommend that the SEC seek such review.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/xrp-price-searches-for-a-fresh-bullish-catalyst-to-trigger-a-move-above-1\"><strong><em>XRP price searches for a fresh bullish catalyst to trigger a move above $1</em></strong></a></p><p>The SEC’s statements come just a few days after SEC Chair Gary Gensler <a href=\"https://cointelegraph.com/news/sec-chair-gary-gensler-reaction-to-ripple-decision-is-mixed-still-under-consideration\">expressed his disappointment </a>over the court deeming XRP to not be a security when sold to retail investors.  </p><p>“We are pleased that the court addressed […] that a token for institutional investors is a security […] disappointed in the other aspect about retail investors. We are still taking a look at that and considering it,” Gensler stated in a July 17 interview with Yahoo Finance. </p><p>On the same day, Gensler also appeared at the National Press Club to give a talk on artificial intelligence, and was questioned if the court rulings represented an urgent need to establish clear regulation for the industry. </p><p>Gensler however, failed to provide a specific answer to such. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC arguing that a court didn’t follow Howey is rich… On its own website, the SEC has acknowledged that Fed courts require commonality &amp; then it goes on to say that it doesn’t require commonality in its analysis or view commonality as a distinct part of Howey. If the SEC’s… <a href=\"https://t.co/CX6Kwfh3cJ\">https://t.co/CX6Kwfh3cJ</a></p>&mdash; exlawyer.eth/tez (@exlawyernft) <a href=\"https://twitter.com/exlawyernft/status/1682551647170437122?ref_src=twsrc%5Etfw\">July 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-22T05:00:15.000Z",
    "title": "FTX planned to buy island of Nauru and build bunker in case of mass human extinction",
    "url": "https://cryptoslate.com/ftx-planned-to-buy-island-of-nauru-and-build-bunker-in-case-of-mass-human-extinction/",
    "description": "<p>FTX members allegedly planned to purchase a small island nation in case of disaster, according to a July 20 filing in the company&#8217;s bankruptcy case. Case text shows that an unidentified FTX officer communicated with Gabriel Bankman-Fried — the brother of former FTX CEO Sam Bankman-Fried — the possibility of buying an 8.1 square mile [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-planned-to-buy-island-of-nauru-and-build-bunker-in-case-of-mass-human-extinction/\">FTX planned to buy island of Nauru and build bunker in case of mass human extinction</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-22T04:43:00.000Z",
    "title": "Leading Cryptocurrency Exchange Updates $XRP Trading Campaign With $20,000 in Prizes",
    "url": "https://www.cryptoglobe.com/latest/2023/07/leading-cryptocurrency-exchange-updates-xrp-trading-campaign-with-20000-in-prizes/",
    "description": "Singapore-based cryptocurrency exchange Crypto.com has recently updated its unique two-phased $XRP trading competition, shortly after the token benefitted from a landmark ruling in which a  federal judge in New York determined it “is not necessarily a security on its face.” Crypto.com’s trading competition, coined the “XRP App Campaign,” is slated to run until July 28, […]\n"
  }
]