[
  {
    "source": "Decrypt",
    "date": "2023-08-09T08:26:38.000Z",
    "title": "Musician Grimes Is 'Pathologically Optimistic' About AI",
    "url": "https://decrypt.co/151829/grimes-ai-music-motherhood-elon-musk",
    "description": "In an interview with Wired, the artist says she made more money from the NFTs than from music."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T08:33:16.000Z",
    "title": "FTX lawfirm hit with class action over alleged role in FTX cover up",
    "url": "https://cryptoslate.com/ftx-lawfirm-hit-with-class-action-over-alleged-role-in-ftx-cover-up/",
    "description": "<p>A new class action lawsuit makes severe allegations that high-profile Silicon Valley law firm Fenwick &#38; West actively helped conceal and enable fraud by the collapsed cryptocurrency exchange FTX and its founder Sam Bankman-Fried. Filed in federal court on Aug. 7, the suit claims Fenwick had an &#8220;exceedingly close&#8221; relationship as legal counsel to FTX [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-lawfirm-hit-with-class-action-over-alleged-role-in-ftx-cover-up/\">FTX lawfirm hit with class action over alleged role in FTX cover up</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-09T08:16:25.000Z",
    "title": "$SHIB: Shiba Inu’s Exploration of Self-Sovereign Identity (SSI): Implications and Insights",
    "url": "https://www.cryptoglobe.com/latest/2023/08/shib-shiba-inus-exploration-of-self-sovereign-identity-ssi-implications-and-insights/",
    "description": "The Shiba Inu (SHIB) project is branching out into innovative digital territories. A recent blog post by Shytoshi Kusama, the project’s pseudonymous lead developer, delved into the Self-Sovereign Identity (SSI) concept and its potential integration with Shibarium, their Layer 2 solution. Deciphering SSI Self-Sovereign Identity represents a combination of protocols and technologies designed to let […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-09T08:33:50.000Z",
    "title": "MetaCene Revolutionizes Blockchain Gaming with Successful MMORPG Alpha Test",
    "url": "https://cryptodaily.co.uk/2023/08/metacene-revolutionizes-blockchain-gaming-with-successful-mmorpg-alpha-test",
    "description": "<p>Singapore, Singapore, August 9th, 2023, Chainwire</p><p>The blockchain gaming industry is undergoing a transformation and leading this charge is MetaCene, a pioneering AAA-inspired next-gen MMORPG incubated and published by MixMarvel. Building on its foundational strengths&mdash;dynamic gameplay, blockchain integration, and deep community engagement&mdash;MetaCene has wrapped up its immersive Alpha Test. A post-apocalyptic society, where survivors leverage diverse NFTs to craft a new civilization, emerged as the testing ground for innovative game dynamics and community-driven experiences. As players embarked on this journey from July 31st to August 7th, 2023, the gaming community awaited feedback and insights on this groundbreaking experience.</p><p>Diving into the MetaCene Universe</p><p>The Alpha Test's landscapes, namely the Origins of Clouds, Birdcry Town, and Sky Metropolis, unveiled a tapestry of lore, challenges, and technological wonders. Each zone, rich in narrative and design, presented players with unique opportunities for exploration, interaction, and accomplishment. The Origins of Clouds, for instance, offered a visually stunning entry into MetaCene&rsquo;s universe, while Sky Metropolis stood as a beacon of future digital societies.</p><p>Participants were met with a potent blend of Player vs. Environment (PVE) and PVP interactions as prominent features during the Alpha phase. The test emphasized the weight of each player's choices and their ripple effect throughout the game's evolving universe. The DAO-governed guilds epitomized this player agency, granting participants a direct hand in shaping the game's trajectory.</p><p>Feedback from Industry Leaders</p><p>The reviews are in and the sentiment is overwhelmingly positive. Here is how some leading guilds and players described their experience:</p><p>&ldquo;Playing this game MetaCene gives me a nostalgic feeling! I remember my childhood feeling when partying with other people that I did not know personally. Exchanging stories while leveling up with the community is one of the best feelings and you can find it in MetaCene&rdquo; - Munchies, ALLGUDINDAHUD</p><p>\"In total, the MetaCene game impressively constructs its game within this genre.\" - Ancient 8</p><p>\"I'm loving the game optimization...how smooth it currently is while exploring.\" - Hooga Gaming</p><p>&ldquo;We had an amazing time testing Metacene. We enjoyed exploring multiple features of the game, especially boss hunts and PvP! Although we encountered several bugs, it was expected since we are at the Alpha stage of the game. Overall, it was a great experience for the guild!&rdquo; - Nomad, GuildHouse&nbsp;</p><p>&ldquo;A week of sheer gaming chaos! NFTXSTREET ventured into a PK-packed world, but the gameplay's insanity took us by storm. From vengeance to mine protection &ndash; absolute madness. Drama, politics, and pesky bugs spiced up the alpha test. NFTXSTREET holds top ranks and readies for more ruthless PKing in the next round!&rdquo; - JB, NFTXS Guild&nbsp;</p><p>\"MetaCene's blockchain integration is undeniably innovative and stands out in the gaming space. The introduction of MMSDK sets them apart, offering players a seamless experience to transact with on-chain assets directly within the game. The game is so much more polished than the last time. Really glad your team is working hard on it.\" - PathDAO</p><p>\"I really like the art style reminds me of Jojo's adventure, and the skill animations are smooth. And the red button to notify you when you picked up higher power equipment.\" - Valluna</p><p>&ldquo;Metacene's science fiction universe is really captivating and once you log in, it's hard to stop playing! The monsters are unique; some are even funny! Looking at you Land Sprite! Overall, I've had a blast being a gunner (pun intended) and managed to get to level 33. Looking forward to the launch! Kudos Metacene team!\"&nbsp;- Mae-zing, YGG&nbsp;</p><p>&ldquo;One of the best Web3MMORPG I played as of this date looking forward to playing it on launch day!&rdquo; - Spraky, YGG</p><p>&ldquo;The biggest MMORPG of the year where you can play, earn and have fun.&rdquo; - Salles RJ, Brazilian YouTube Influencer</p><p>&ldquo;Great gameplay for being an alpha version. Good dynamics between missions. Fun and makes you want to play more and more.&rdquo; - Moreze, Brazilian YouTube Influencer</p><p>By the Numbers: MetaCene's Alpha Test Metrics</p><ul><li>Player Engagement: Of the 2961 enthusiasts who delved into the Alpha Test universe, a staggering 2663 (or roughly 90%) were engaged in Player vs. Player (PVP) combat, underscoring the game's intense and captivating battle dynamics. Such a high participation rate showcases the competitive spirit MetaCene incites and the immersive appeal of its combat scenarios.</li><li>Time Spent: Players collectively devoted an impressive 461916 minutes, further emphasizing the game's ability to captivate and retain player attention.</li><li>Mining Success: Out of the participants, 480 individuals showcased their strategic prowess, successfully engaging in mining activities 2527 times.</li><li>Boss Battles: A key highlight was the elimination of 2258 bosses, a testament to the collaborative spirit and strategic acumen of the player community.</li></ul><p>Diving deeper into the metrics, the transactional dynamics during the Alpha Test also provide compelling insights into its success. Spanning the period from July 31 to August 8:</p><ul><li>RPG (Rangers Protocol) Transactions: The gaming-centric blockchain that fuels MetaCene witnessed 112 RPG transactions and the birth of 29 fresh addresses.</li><li>USDT Transactions: There was an impressive 6,166 USDT transactions, accompanied by the creation of 1,225 new addresses.</li><li>MUD Transactions: Perhaps the most revealing metric lies in the MUD transactions, MetaCene's in-game currency. There were 3,558 MUD transactions, leading to 846 new addresses. The diverse utility and functionality of the MUD token came to the fore during the Alpha Test. The following are all the types of in-game utilization that were available during the test:</li><li class=\"ql-indent-1\">Store usage</li><li class=\"ql-indent-1\">Trading tax</li><li class=\"ql-indent-1\">Off-chain action</li><li class=\"ql-indent-1\">Guild creation</li><li class=\"ql-indent-1\">Skill upgrade</li><li class=\"ql-indent-1\">Weapon enhancement</li><li class=\"ql-indent-1\">Warehouse unlock</li><li class=\"ql-indent-1\">Backpack spots acquisition</li><li class=\"ql-indent-1\">Weapon refinement</li><li class=\"ql-indent-1\">Jail bribery</li><li class=\"ql-indent-1\">Resurrection</li><li class=\"ql-indent-1\">Warehouse storage</li><li class=\"ql-indent-1\">Total consumption stood at 17,147,819 MUD.</li></ul><p>Such extensive and varied usage of the MUD token underscores the game's multifaceted strengths and intrinsic value and adaptability of the in-game currency. It paints a vivid picture of a thriving virtual economy, highlighting both the allure of the game and the tangible utility of its digital assets.</p><p>Alan Tan, the game creator, shared &ldquo;MetaCene's Alpha Test was a pivotal moment in our journey to re-imagine the MMORPG universe through blockchain. Witnessing thousands of players, from MAN NFT holders to the wider gaming community, explore and engage with our world was truly exhilarating. Their feedback and experiences will be invaluable as we continue refining our vision, ensuring that MetaCene remains at the cutting edge of player-centric, blockchain-integrated gaming.&rdquo;</p><p>The Road Ahead</p><p>As MetaCene navigates its path to Beta testing, the gaming audience is abuzz with excitement. With a proven track record of blending stellar gameplay with innovative blockchain applications, MetaCene's future holds immense promise.</p><p>MetaCene's Alpha Test has been more than just a game&mdash;it's a synthesis of technology, art, and community. This harmonious blend heralds a new era for blockchain gaming, one where engagement, empowerment, and entertainment converge.</p><p>About MetaCene</p><p>MetaCene is building a next-gen blockchain MMORPG homeland for mass players. It presents a surreal post-apocalyptic society where survivors interact with diverse NFTs to redefine civilizations. MetaCene pioneers player-centric entertainment, governance, and creation through innovative PVE and PVP gameplay, robust technology infrastructures, social guild DAO governance, sustainable economic systems, and in-game editors. MetaCene is founded by gaming experts with 20+ years of industry experience from Shanda Games, Blizzard, Perfect World, and others. It envisages a multi-chain future from Rangers Protocol with real-time confirmation and super-low gas fees. The MetaCene Apostle NFT collection and the Alpha version are coming in 2023 Q2.</p>ContactHenry FerrMetaCenehenryferr@metacene.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T08:37:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T08:21:20.000Z",
    "title": "Tackling Disinformation with AI to Navigate the Dual Role",
    "url": "https://www.cryptopolitan.com/tackling-disinformation-with-ai/",
    "description": "The pervasive spread of disinformation has been exacerbated by the Internet, with social media platforms becoming a breeding ground for misleading information. A Eurobarometer report revealed that 28% of EU citizens have fallen victim to fake news, a crisis compounded in nations with restricted press freedom. The rapid evolution of generative AI tools, such as ... <a title=\"Tackling Disinformation with AI to Navigate the Dual Role\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tackling-disinformation-with-ai/\" aria-label=\"More on Tackling Disinformation with AI to Navigate the Dual Role\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T08:16:00.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T08:30:59.000Z",
    "title": "Bitcoin ETF to be approved in 6 months, Bloomberg analyst says",
    "url": "https://crypto.news/bitcoin-etf-to-be-approved-in-6-months-bloomberg-analyst-says/",
    "description": "Insiders suggest that Bitcoin ETF approval is inevitable. Bloomberg ETF analyst Eric Balchunas says expectations vary from four to six months. Bloomberg&#8217;s senior ETF analyst Balchunas cites the earnings call with Mike Novogratz, CEO at Galaxy Digital. Novogratz, in his&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T08:10:23.000Z",
    "title": "Cardano’s Daily Transaction Count Surpasses Bitcoin’s, BTC and ADA Holders Find Ripe Opportunity in $ROE Presale",
    "url": "https://www.crypto-news-flash.com/cardanos-daily-transaction-count-surpasses-bitcoins-btc-and-ada-holders-find-ripe-opportunity-in-roe-presale/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-daily-transaction-count-surpasses-bitcoins-btc-and-ada-holders-find-ripe-opportunity-in-roe-presale",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T100536.334.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T100536.334.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T100536.334-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T100536.334-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T100536.334-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T100536.334-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic landscape of cryptocurrencies, every milestone achieved is a testament to the relentless innovation and the shifting tides of potential. Cardano, often hailed for its visionary approach and groundbreaking technology, has recently achieved a remarkable feat that reverberates across the crypto sphere.  As the daily transaction count of Cardano surpasses even that of [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-09T08:38:00.000Z",
    "title": "Binance Wins Approval in El Salvador, Now Holds 18 Regulatory Licenses",
    "url": "https://coinedition.com/binance-wins-approval-in-el-salvador-now-holds-18-regulatory-licenses/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Binance_is_pleased_to_announce_that_it_has_become_the_first_fully-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent statement, Binance proudly unveiled its latest accomplishment: becoming the first fully licensed crypto exchange in the pro-Bitcoin country, El Salvador. The accolade came in the form of two significant licenses. The first is the Bitcoin Services Provider license (BSP) from the Central Reserve Bank (Banco Central de Reserva). And the second is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-wins-approval-in-el-salvador-now-holds-18-regulatory-licenses/\">Binance Wins Approval in El Salvador, Now Holds 18 Regulatory Licenses</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-09T08:11:13.000Z",
    "title": "LINK, MKR, GMX Poised for a Breakout? Whale Activity Suggests So",
    "url": "https://coinedition.com/link-mkr-gmx-poised-for-a-breakout-whale-activity-suggests-so/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Increased_Whale_Activity_In_LINK_MKR_GMX_Suggest_Potential_Gains-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to crypto trading experts, an important aspect of a trader’s buying strategy should be observing whale activity in the market and taking action based on that. A new video on Altcoin Buzz’s YouTube channel explored the top three cryptos that the whales are focusing on in recent times. These include Chainlink’s LINK, Maker Protocol’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/link-mkr-gmx-poised-for-a-breakout-whale-activity-suggests-so/\">LINK, MKR, GMX Poised for a Breakout? Whale Activity Suggests So</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]