[
  {
    "source": "Cointelegraph",
    "date": "2023-11-05T20:49:23.000Z",
    "title": "VC Roundup: private accounts, tokenization, and healthcare infrastructure grab investors’ attention ",
    "url": "http://cointelegraph.com/news/vc-roundup-private-accounts-tokenization-healthcare-infrastructure-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/61522f37-cd43-49ca-a04d-c0f3c35549fb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Nocturne, Untangled Finance, Account Labs, Rymedi, and Waterfall network secure venture capital funding in the latest funding blitz.</p>\n                    <p><p>Blockchain-based startups continue to gather funding during the current bear market, with MetaMask partner Blockaid<a href=\"https://cointelegraph.com/news/blockaid-secures-33-million-funding\"> raising $33 million in October</a>. However, the overall funding in the crypto industry has dropped to levels last seen in 2020,<a href=\"https://cointelegraph.com/news/crypto-vc-funding-falls-q4-2020-lows-research\"> amassing $2.1 billion over 297 deals</a> in the third quarter of 2023, as reported by Messari. As is often the case during bear markets, investors are taking a closer look at projects before investing and apparently seeking tangible real-world applications. </p><p>As part of October’s highlights, the Nature Science Journal<a href=\"https://cointelegraph.com/news/dao-help-scientists-funding-community-nature-science-journal\"> discussed applications of blockchain technology</a>, praising decentralized autonomous organizations (DAOs) for their potential to support underfunded scientific research. Cointelegraph’s venture capital (VC) roundup features projects that raised capital in October.</p><h3>Untangled Finance completes $13.5M fundraising to bring private credit on-chain</h3><p>London-based fintech Untangled Finance has raised $13.5 million to accelerate efforts to bring institutional-grade credit with a built-in liquidation mechanism on-chain. Fasanara Capital was the lead investor in the round. The platform’s protocol focuses on tokenizing real-world private credit assets, such as invoices and SME loans, into on-chain structured credit pools. These pools, in turn, facilitate the issuance of collateralized debt notes to both DeFi and TradFi investors, Untangled noted in a statement. The protocol concentrates on private credit markets, where it sees the most utility for DeFi. Through the funds, Untangled plans to access more than 130 verified asset originators spanning 60 countries.</p><h3>Nocturne raises $6M seed round for private accounts on Ethereum</h3><p>Nocturne, a protocol enabling on-chain private accounts, announced a $6 million seed funding round co-led by Bain Capital Crypto and Polychain Capital with participation from Vitalik Buterin and other members of the Ethereum community. Other investors include Bankless Ventures, HackVC and Robot Ventures. The company plans to launch on mainnet in the coming weeks, according to a statement. Nocturne offers a solution that combines stealth addresses, zero-knowledge proofs, and account abstraction to enable private accounts on public blockchains. The seed round will accelerate the production and deployment of Nocturne’s protocol across various ecosystems. A portion of the round will also go to legal work as the team continues to adapt to changing regulatory requirements.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ We&#39;re excited to announce our $6M seed round co-led by <a href=\"https://twitter.com/BainCapCrypto?ref_src=twsrc%5Etfw\">@BainCapCrypto</a> &amp; <a href=\"https://twitter.com/polychain?ref_src=twsrc%5Etfw\">@polychain</a> with participation from <a href=\"https://twitter.com/VitalikButerin?ref_src=twsrc%5Etfw\">@VitalikButerin</a> and other members of the Ethereum community.<br><br>This round will fund the deployment and continued development of private accounts on Ethereum. <a href=\"https://t.co/ve25yJp6iI\">pic.twitter.com/ve25yJp6iI</a></p>&mdash; Nocturne (@nocturne_xyz) <a href=\"https://twitter.com/nocturne_xyz/status/1717150278749725127?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Account Labs secures $7.7M in funding for the UniPass Wallet app</h3><p>Web3 wallet provider Account Labs announced raising US$7.7 million from lead investors Amber Group, MixMarvel DAO Ventures, and Qiming Ventures, among other participants. This announcement coincides with the launch of the company's first consumer-facing app, UniPass Wallet, on Polygon. According to Account Labs, its UniPass Wallet app leverages account abstraction to allow users to create and access a self-custody Web3 wallet with only a Google account and top up with any Mastercard or Visa card. Account Labs was formed from the merger of hardware wallet developer Keystone and software wallet developer UniPass in May 2023. The company hopes to address the demand for stablecoin transactions in the Southeast Asia region.</p><h3>Rymedi raises $9M to expand blockchain-based healthcare infrastructure </h3><p>Rymedi, a blockchain-based healthcare data exchange platform, announced a Series A round of $9 million to expand its reach. The round was co-led by RW3 Ventures and White Star Capital with participation from Blockchange Ventures, Avalanche’s Blizzard Fund, and strategic angel investors from the healthcare industry. Rymedi claims to serve over 1 million patients in over 1,200 locations across the United States, Africa, and Australia. The funds will be used to increase data security and healthcare record accessibility for patients. “We are always searching for great teams that are using blockchain technology to solve real-world problems with the potential to address global markets,” said in a statement Pete Najarian, managing partner of RW3 Ventures. </p><h3>Waterfall secures $2M funding for mainnet launch</h3><p>Layer-1 protocol Waterfall Network has raised $2M ahead of its mainnet launch, which is expected to take place during the first quarter of 2024. Infrastructure provider Bytrade Lab led the funding. Bytrade Lab has become a key investor and user of Waterfall Network following a six-month trial of its tech infrastructure, according to a statement. The protocol is Ethereum Virtual Machine (EVM) compatible and employs a technology called Directed AcyclicGraph or “DAG,” which allegedly allows for unlimited scalability. Waterfall is also collaborating with BlueWave Corporation to develop its smart contract platform.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-05T20:43:33.000Z",
    "title": "Matrixport Predicts Bitcoin’s Santa Claus Rally to Reach $56,000",
    "url": "https://www.cryptoglobe.com/latest/2023/11/matrixport-predicts-bitcoins-santa-claus-rally-to-reach-56000/",
    "description": "Markus Thielen, the head of research and strategy at crypto financial services firm Matrixport, reportedly conveyed to clients recently that Bitcoin’s performance this year could be a reliable indicator of its year-end position. According to a report by Omkar Godbole for CoinDesk, citing historical data, Thielen highlighted that when Bitcoin records a surge of at […]\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-05T21:00:51.000Z",
    "title": "Last Time This Happened, Bitcoin Exploded, According to Glassnode Co-Founders – Here’s What They Mean",
    "url": "https://dailyhodl.com/2023/11/05/last-time-this-happened-bitcoin-exploded-according-to-glassnode-co-founders-heres-what-they-mean/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Big-Bitcoin-Pumps.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Glassnode analysts are pointing out one historically bullish signal for Bitcoin (BTC) that previously prompted explosive rallies for the top crypto asset by market cap. Glassnode co-founders Jan Happel and Yann Allemann say that Bitcoin has &#8220;crushed&#8221; multiple critical resistance levels and is now at a point of strengthening momentum. The analysts zero in on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/05/last-time-this-happened-bitcoin-exploded-according-to-glassnode-co-founders-heres-what-they-mean/\">Last Time This Happened, Bitcoin Exploded, According to Glassnode Co-Founders – Here’s What They Mean</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]