[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-15T12:00:20.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: Bitcoin Retreats From 14-Month High, as Profit Takers Swoop In",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-bitcoin-retreats-from-14-month-high-as-profit-takers-swoop-in/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Retreats from14-Month High, as Profit Takers Swoop In\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1937588410-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin plunged from a recent fourteen-month high to start the weekend, as traders appeared to have begun securing yesterday&#x2019;s gains. The decline saw the price fall below $30,000, days after almost moving above $32,000. Ethereum also slipped, however remained above $1,900. Bitcoin Bitcoin (BTC) fell below $30,000 to start the weekend, as traders began to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-15T11:58:19.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-15T11:47:34.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T11:58:11.000Z",
    "title": "XRP trading volume skyrockets amid favorable court decision",
    "url": "https://crypto.news/xrp-trading-volume-skyrockets-amid-favorable-court-decision/",
    "description": "News of a favorable XRP ruling in its legal battle against the US SEC has sent the token’s trading volumes jumping by more than 1,300%.  The ruling sparked a surge in XRP’s price, with the digital asset reaching a high&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T11:45:43.000Z",
    "title": "FTX victim raises $450k for liquid token startup",
    "url": "https://crypto.news/ftx-victim-raises-450k-for-liquid-token-startup/",
    "description": "FTX victim, who lost over 90% of his net worth following the collapse, successfully raised $450,000 from his recently launched trading fund. Belgian resident Kasper Vendeloock recently launched Musca Capital, a new fund that trades liquid tokens. The venture is&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-15T11:40:06.000Z",
    "title": "Dogecoin Engagement Fails To Impress, Raising Concerns About Broader Interest",
    "url": "https://www.newsbtc.com/news/dogecoin-engagement-fails-to-impress/",
    "description": "Is Dogecoin (DOGE losing its charm? Despite the impressive price rally in May, recent trends suggest a decline in engagement and investor interest. As the crypto market continues to evolve, concerns are mounting about the broader implications of Dogecoin&#8217;s waning appeal.  Dogecoin&#8217;s engagement metrics have faltered, leaving some experts wondering if the crypto&#8217;s allure is wearing off. Market indicators show a decline in trading volume, with fewer transactions taking place compared to previous months.  Will this once-beloved digital currency be able to regain its momentum, or is its star beginning to fade? Dogecoin New Addresses Stagnant The growth of new addresses joining the Dogecoin community has hit a roadblock since May, according to a recent DOGE price report. However, on-chain data analysis reveals that this stagnation in new holders has not adversely affected the weighted sentiment associated with the cryptocurrency. Related Reading: BNB Chain Inks New Record With Soaring User Activity – A Boost For Price? Source: Santiment As of the latest update, DOGE&#8217;s weighted sentiment stands at -0.645. This metric provides insights into the average sentiment attached to a particular cryptocurrency, taking into account the unique social volume surrounding it. Interestingly, despite the somewhat negative value, the weighted sentiment has shown improvement from its low point of -1.99 on June 9. This shift suggests that the prevailing defeatist perception during that period has gradually shifted towards a more optimistic outlook. DOGE market cap slightly above the $10 billion level. Chart: TradingView.com Social Volume And Holder Count: A Diverging Trend However, while the weighted sentiment demonstrates a positive trajectory, the coin&#8217;s social volume tells a different story. Instead of aligning with the stagnant number of holders, the social volume of Dogecoin has remained remarkably low since June 9, as per Santiment&#8217;s data. Social volume measures the number of mentions and discussions specifically related to a cryptocurrency across various platforms. In the case of Dogecoin, this metric indicates a significant decrease in overall online activity and conversations surrounding the coin. Related Reading: Cardano Development Activity Dropping – What Does It Mean For ADA Price? As of now, there have been no significant changes in the aforementioned trends. This suggests that the hype surrounding DOGE has diminished considerably. From a market perspective, this could potentially indicate that the coin is undervalued and has yet to reach its peak valuation. The road ahead for Dogecoin appears challenging, as the cryptocurrency grapples with stagnant new addresses and a decline in social volume. However, it would be premature to discount the resilience of this meme-based digital asset. Source: Coingecko As of the latest data from Coingecko, the price of DOGE stands at $0.068, reflecting a decline of 4.7% over the past 24 hours. However, despite this recent dip, Dogecoin has experienced a seven-day rally of 4.6%, showing signs of resilience in the face of short-term fluctuations. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Terminix"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-15T11:45:23.000Z",
    "title": "Top Crypto Analyst Issues Bitcoin Alert, Warns BTC Could Nuke if One Critical Support Level Crumbles",
    "url": "https://dailyhodl.com/2023/07/15/top-crypto-analyst-issues-bitcoin-alert-warns-btc-could-nuke-if-one-critical-support-level-crumbles/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top crypto analyst is predicting that Bitcoin (BTC) is at risk of collapsing if one scenario plays out in the near term. Pseudonymous analyst DonAlt tells the 52,300 subscribers of the TechnicalRoundup YouTube channel that Bitcoin is looking at a decline of up to 30% if it loses the key $30,000 level. He notes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/15/top-crypto-analyst-issues-bitcoin-alert-warns-btc-could-nuke-if-one-critical-support-level-crumbles/\">Top Crypto Analyst Issues Bitcoin Alert, Warns BTC Could Nuke if One Critical Support Level Crumbles</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]