[
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T04:14:46.000Z",
    "title": " Bitcoin spikes outside US hours and traders could ‘take advantage’ — Analyst ",
    "url": "https://cointelegraph.com/news/bitcoin-price-united-states-market-hours-researcher-btc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvMGRlMDM0MjYtZTc3Zi00YWVjLThjMjktNzJkZmVhZWM2ZjE1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>For years, Bitcoin tended to dip during Asia trading hours, but something changed after spot Bitcoin ETFs were launched.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has seen most of its daily gains come outside U.S. trading hours ever since the launch of spot Bitcoin ETFs, which could present an opportunity for traders, according to an analyst.</p><p>The trend is a seeming reversal from the last two years, where most gains were concentrated during U.S. trading hours. Digital research firm 10x Research Markus Thielen suggests the new trend allows investors to capitalize on frequent small profit margins.</p><p>“Traders can take advantage of this information and buy Bitcoin ahead of the US trading hours and sell a few hours later,\" Thielen told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-united-states-market-hours-researcher-btc\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T04:32:20.000Z",
    "title": "Ethereum Price Faces Crucial Test: Will $3,250 Withstand the Pressure?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-faces-test-3250/",
    "description": "Ethereum price is struggling to recover above the $3,440 resistance zone. ETH is moving lower and might decline further if it clears the $3,250 support. Ethereum is struggling to climb above the $3,370 and $3,440 levels. The price is trading below $3,380 and the 100-hourly Simple Moving Average. There was a break below a major bullish trend line with support at $3,300 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend losses if there is a close below the $3,250 support zone. Ethereum Price Recovery Fades Again Ethereum price attempted a fresh recovery wave above the $3,300 and $3,320 levels, like Bitcoin. ETH even climbed above the $3,400 level, but the bears were active near the $3,440 zone. A high was formed near $3,443 before there was a fresh decline. There was a break below a major bullish trend line with support at $3,300 on the hourly chart of ETH/USD. The price trimmed gains and retested the $3,250 support. The price traded as low as $3,253 and is currently consolidating losses. It is trading just above the 23.6% Fib retracement level of the downward wave from the $3,443 swing high to the $3,253 low. However, Ethereum is trading below $3,380 and the 100-hourly Simple Moving Average. Immediate resistance is near the $3,320 level. The first major resistance is near the $3,350 level or the 50% Fib retracement level of the downward wave from the $3,443 swing high to the $3,253 low. The next key resistance sits at $3,440, above which the price might test the $3,500 level. Source: ETHUSD on TradingView.com The next key resistance is seen near the $3,550 level, above which Ether could gain bullish momentum. In the stated case, the price could rise toward the $3,650 zone. If there is a move above the $3,650 resistance, Ethereum could even rise toward the $3,750 resistance. More Losses In ETH? If Ethereum fails to clear the $3,350 resistance, it could continue to move down. Initial support on the downside is near the $3,250 level. The first major support is near the $3,220 zone. The next key support could be the $3,200 zone. A clear move below the $3,200 support might send the price toward $3,120. Any more losses might send the price toward the $3,040 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $3,250 Major Resistance Level – $3,350"
  }
]