[
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T22:45:38.000Z",
    "title": "The economy is refusing to die — which may mean it’s time to go risk-on",
    "url": "https://cointelegraph.com/news/economy-refusing-death-which-may-mean-risk-on",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0d3693e5-92cb-43c3-a5fd-79ffde590c9b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The economy is refusing to go down. If the trend continues, cryptocurrency prices are going to start rising — especially with Bitcoin's halving.</p>\n                    <p><p>The United States economy seems like it is refusing to be derailed. It added a staggering <a href=\"https://cointelegraph.com/news/bitcoin-price-dives-us-jobs-data-fed-rate-hike\">336,000 jobs in September</a>, defying most expectations. This achievement becomes all the more remarkable against the backdrop of soaring yields on longer-term Treasury bonds and surging mortgage rates.</p><p>The message embedded in the job data is crystal clear: the world’s largest economy continues to charge forward, even in the face of aggressive monetary tightening. It’s a testament to the economy’s resilience, and suggests that higher interests are here to stay for an extended period. </p><p>While this news could send shivers down some spines, particularly for those invested in stocks, it’s crucial to understand the bigger picture. Stocks may appear less enticing when you can secure a 6% return with a savings account, yet we may be reaching an inflection point with bonds. </p><h2>It has to get worse before it gets better</h2><p>The bond market has witnessed a historic rout, described by Bank of America Global Research as the “greatest bond bear market of all time.” But the analysis isn’t all doom and gloom — there are hints that the relentless sell off in U.S. Treasuries could come to an end. And if we do indeed see a recovery, it could signal the start of a new bull market for risk assets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\"><strong><em>Bitcoin ETFs: A $600B tipping point for crypto</em></strong></a></p><p>Turning to crypto, it’s crucial to recognize that short-term Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price action remains somewhat linked to regulatory decisions, particularly those pertaining to a Bitcoin spot ETF. So far, all of the positive news <a href=\"https://cointelegraph.com/news/grayscale-wins-court-battle-what-does-this-mean-for-spot-bitcoin-etf\">surrounding spot ETFs</a> has failed to move Bitcoin out of its holding pattern. A green light on this front could unleash substantial inflows into BTC, providing the much-awaited impetus for a resurgence. It would also be remiss not to mention the <a href=\"https://cointelegraph.com/news/sbf-lawyers-to-probe-ftx-lawyers-involvement-in-alameda-loans\">ongoing FTX saga</a>, which is currently playing out in the courts and damaging crypto’s reputation.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b4cc65c4-6655-40f3-9ca5-18d8a24c16eb.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">United States Federal Funds Effective Rate, 1955-2023. Source: Board of Governors of the Federal Reserve System.</figcaption></figure><p>But here’s the twist — what may spell bad news for financial markets could be good for the broader economy. The Federal Reserve holds a pivotal role in shaping the path for risk assets, and it has just two more meetings before the end of the year. Should the Fed decide to suspend further rate hikes, it could act as a catalyst, triggering market anticipation of an impending rate cut. This anticipation could, in turn, set the stage for a massive risk-on rally across various asset classes, including cryptocurrencies.</p><h2>Festive revelry could set the tone for 2024</h2><p>The last three months of the year often introduce a heightened Santa rally. After the year we’ve had, it might soften the blow and pave the way for a more palatable 2024. History shows that the market tends to gather momentum during this festive season, with a surge in buying activity and positive sentiment among investors. Among these factors, regulatory decisions regarding spot ETFs and any potential pause in rate hikes, or even a shift in the Fed’s messaging concerning future hikes will be watched closely. So while the cheer from September’s jobs data tends to drive immediate headline moves in the market, it doesn’t necessarily steer the long-term thinking of the Fed.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/high-interest-rates-exactly-what-crypto-market-needs\"><strong><em>Sky-high interest rates are exactly what the crypto market needs</em></strong></a></p><p>Looking ahead into 2024, we are faced with the prospect of a BTC “halvening” in April, historically a positive event for crypto. However, the broader macroeconomic conditions have signalled some signs of instability. Bitcoin’s ongoing correlation with stock markets adds an extra layer of complexity to the equation. The outcome hinges on the messaging from the Fed — and decisions made by the Securities and Exchange Commission (SEC) regarding spot ETFs. If the macroeconomic backdrop remains uncertain, the Fed may pivot toward rate cuts, potentially altering the trajectory of both traditional and digital asset markets. </p><p>With hints of a bond market recovery and the prospect of regulatory clarity in the crypto space, we could see brighter days ahead. As we approach the festive season, the <a href=\"https://cointelegraph.com/news/bitcoin-bull-market-us-faces-bear-steepener-arthur-hayes\">potential for a Santa rally</a> rekindles the type of hope and momentum that ignites the crypto market. While some challenges may loom, history teaches us that sometimes, it gets worse before it gets better.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lucas Kiely</strong> is chief investment officer of Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T22:53:47.000Z",
    "title": "SBF trial day 5: “I’m gonna be a POTUS one day”, Caroline Ellison quotes FTX’s founder",
    "url": "https://crypto.news/sbf-trial-day-5-im-gonna-be-a-potus-one-day-caroline-ellison-quotes-ftxs-founder/",
    "description": "Week 2 of Sam Bankman-Fried’s trial in New York continued after premiere witness accounts from SBF’s inner circle as federal prosecutors pointed the jury to alleged fraudulent schemes masterminded by the FTX founder himself."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T23:00:33.000Z",
    "title": "Trademark Tussle: Trader Joe’s Grocery Slaps Lawsuit On DEX Trading Platform",
    "url": "https://www.newsbtc.com/news/trademark-tussle-trader-joes-grocery-slaps-lawsuit-on-dex-trading-platform/",
    "description": "Trader Joe&#8217;s, a well-known supermarket chain in the United States, has taken legal action against a decentralized exchange (DEX) platform named Trader Joe, alleging that it has violated federal trademark laws.  The DEX platform, which operates under the domain name traderjoexyz.com, not only shares the same name as the supermarket but, according to recent reports, also appears to be trying to leverage the supermarket&#8217;s established brand and reputation.  US Supermarket Giant Locks Horns With Trader Joe DEX Trader Joe&#8217;s has gained popularity in the digital realm by initially launching on the Avalanche (AVAX) network and later expanding its presence to BNB Chain, Arbitrum (ARB), and Ethereum (ETH).  It currently holds over $77 million worth of tokens across various chains and has processed trades amounting to $25 million in September alone.  However, its success has been overshadowed by a heated dispute regarding the origin of its brand and allegations of fraudulent attempts to misrepresent its origins. Related Reading: Here’s Why The Ethereum Price Fell Toward $1,500 Trader Joe&#8217;s supermarket chain has grown increasingly frustrated by the lack of response to its requests to cease the misuse of its trademark. As a result, the matter has escalated internationally, and a complaint was filed with the World Intellectual Property Organization (WIPO) in May 2022 to force the crypto entity to relinquish its domain name. Furthermore, recently filed court documents in the US District Court for the Central District of California shed light on the proceedings at WIPO. According to these documents, the defendants presented a false narrative that distorted the true origins of &#8220;Trader Joe&#8217;s.&#8221;  They claimed that the platform was named after the co-founder&#8217;s brother, a claim that Trader Joe&#8217;s supermarket chain has vehemently denied. JOE Token Plummets In Value Amidst Legal Battle Trader Joe DEX has recently seen notable variations in several critical metrics, with shifts in trading volume, market capitalization, revenue, and total value locked. Over the past 24 hours, Trader Joe&#8217;s experienced a decline of 1.68% in its performance. This short-term dip in value has been reflected in the platform&#8217;s seven-day performance, with a 3.85% decrease.  However, despite these recent setbacks, the DEX has managed to maintain relative stability over 30 days, with a modest decline of 1.04%. According to Token Terminal data, one of the most striking figures is the platform&#8217;s 180-day performance, which shows a significant drop of 60.82%. Related Reading: Cardano (ADA) Struggles To Stay Above $0.26: What This Means For Traders Nevertheless, when considering market capitalization, Trader Joe&#8217;s DEX boasts a circulating market cap of $90.84 million, indicating its prominence within the DEX ecosystem.  Moreover, the platform has shown a positive trend, with a recent increase of 2.26%. Total value locked (TVL) is another crucial metric used to assess the health and popularity of a DEX platform. Despite the recent market fluctuations, Trader Joe DEX continues demonstrating a TVL of $78.66 million.  However, it experienced a decline of 4.54%, suggesting a potential shift in user participation and liquidity within the platform. Finally, trading volume, an essential measure of a platform&#8217;s activity, has witnessed a significant annualized decrease of 18.45%, amounting to $7.61 billion. This decline in trading volume raises concerns about engagement and participation on the Trader Joe DEX platform. Featured image from Shutterstock chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-10T23:00:00.000Z",
    "title": "Is XRP’s Price Truly Under Manipulation by Major Banks?",
    "url": "https://coinedition.com/is-xrps-price-truly-under-manipulation-by-major-banks/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple_Whales_Transfer_One_Billion_XRP,_Is_a_Price_Dump_Incoming\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Ripple_Whales_Transfer_One_Billion_XRP_Is_a_Price_Dump_Incoming-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from CoinMarketCap suggests that XRP is down by over 3% in the past week as it trades below the $0.5 mark. Amid XRP’s bearish performance, heated debates have surfaced within the crypto community about XRP being subject to market manipulation. In a recent tweet, XRP influencer WallStreetBulls (WSB) raised concerns about the supposed manipulation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-xrps-price-truly-under-manipulation-by-major-banks/\">Is XRP’s Price Truly Under Manipulation by Major Banks?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]