[
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T05:00:53.000Z",
    "title": "Op-ed: Let’s talk about Gitcoin – the silence around open source funding is deafening",
    "url": "https://cryptoslate.com/op-ed-lets-talk-about-gitcoin-the-silence-around-open-source-funding-is-deafening/",
    "description": "<p>Since 2020, crypto has seen dramatic prices, adoption, and attention swings. However, one term integral to the success of web3 has seemingly stagnated &#8211; &#8216;open-source funding.&#8217; Google News articles related to open-source funding have remained flat, along with searches for the biggest player in the space, Gitcoin. For comparison, the term &#8216;web3&#8217; has hovered around [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-lets-talk-about-gitcoin-the-silence-around-open-source-funding-is-deafening/\">Op-ed: Let&#8217;s talk about Gitcoin &#8211; the silence around open source funding is deafening</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T04:52:21.000Z",
    "title": "Ethereum Price Poised for Further Declines Unless this Level Gives Way",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-declines-1830/",
    "description": "Ethereum price is recovering from the $1,830 zone against the US Dollar. ETH could extend its decline if it stays below the $1,880 resistance. Ethereum is slowly moving higher from the $1,830 zone. The price is trading below $1,870 and the 100-hourly Simple Moving Average. There is a short-term bullish rising channel forming with support near $1,850 on the hourly chart of ETH/USD (data feed via Kraken). The pair could struggle to rise above the $1,870 and $1,880 resistance levels. Ethereum Price Faces Resistance Ethereum’s price extended its decline below the $1,900 level. ETH even traded below the $1,850 level to move into a bearish zone, similar to Bitcoin. A new weekly low is formed near $1,832 and the price is now attempting a recovery wave. There was a minor increase above the $1,850 resistance zone. The price moved above the 23.6% Fib retracement level of the downward move from the $1,903 swing high to the $1,832 low. Ether is now trading below $1,870 and the 100-hourly Simple Moving Average. There is also a short-term bullish rising channel forming with support near $1,850 on the hourly chart of ETH/USD. On the upside, immediate resistance is near the $1,870 level and the 100-hourly Simple Moving Average. It is close to the 50% Fib retracement level of the downward move from the $1,903 swing high to the $1,832 low. The first major resistance is near the $1,875 level. Source: ETHUSD on TradingView.com The main resistance is near the $1,900 zone, above which the price might rise toward the $1,920 hurdle. Any more gains could send Ether toward the $2,000 resistance or even $2,050 in the near term. More Losses in ETH? If Ethereum fails to clear the $1,875 resistance, it could continue to move down. Initial support on the downside is near the $1,850 level and the channel lower trend line. The first major support is near the $1,830 zone, below which the price might move further into a bearish zone. The next major support is near the $1,780 support level. Any more losses could open the doors for a move toward the $1,720 level in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,830 Major Resistance Level – $1,875"
  }
]