[
  {
    "source": "CryptoSlate",
    "date": "2023-12-04T23:00:31.000Z",
    "title": "Bitcoin breaks $42k with market cap outstripping Tesla and Berkshire Hathaway",
    "url": "https://cryptoslate.com/bitcoin-breaks-42k-with-market-cap-outstripping-tesla-and-berkshire-hathaway/",
    "description": "<p>Bitcoin (BTC) has broken the $42,000 mark, riding on a wave of optimism fueled partly by spot ETF hopefulness and the anticipation of the upcoming halving event. Bitcoin&#8217;s surge has propelled it into the top ten assets by market cap globally. With a market capitalization of $818 billion, Bitcoin surpassed Berkshire Hathaway and even Tesla. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-breaks-42k-with-market-cap-outstripping-tesla-and-berkshire-hathaway/\">Bitcoin breaks $42k with market cap outstripping Tesla and Berkshire Hathaway</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T23:05:43.000Z",
    "title": "How Hedera Hashgraph’s latest tech is making waves in green innovation",
    "url": "https://www.cryptopolitan.com/hedera-hashgraphs-latest-tech-imaking-waves/",
    "description": "At the 2023 UN Climate Change Conference (COP28), Envision Blockchain made a significant impact with its innovative blockchain and artificial intelligence (AI) based platforms. These platforms are designed to enhance emissions tracking and facilitate the growth of voluntary carbon markets. The company&#8217;s latest offerings include advanced features for methodology search, project data comparison, and adherence ... <a title=\"How Hedera Hashgraph&#8217;s latest tech is making waves in green innovation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hedera-hashgraphs-latest-tech-imaking-waves/\" aria-label=\"More on How Hedera Hashgraph&#8217;s latest tech is making waves in green innovation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T23:00:17.000Z",
    "title": "150 countries considering yuan as a replacement for USD",
    "url": "https://www.cryptopolitan.com/150-countries-yuan-as-a-replacement-for-usd/",
    "description": "In a global shift that could redefine the dynamics of international trade and finance, an increasing number of countries are contemplating replacing the US Dollar (USD) with the Chinese Yuan (CNY). This pivotal change is spearheaded by China&#8217;s Belt and Road Initiative (BRI), launched in 2013. The BRI, a massive global infrastructure development strategy, has ... <a title=\"150 countries considering yuan as a replacement for USD\" class=\"read-more\" href=\"https://www.cryptopolitan.com/150-countries-yuan-as-a-replacement-for-usd/\" aria-label=\"More on 150 countries considering yuan as a replacement for USD\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T22:52:07.000Z",
    "title": "Switzerland’s Pando joins the party, files for spot Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/pando-files-for-spot-bitcoin-etf/",
    "description": "Switzerland-based Pando Asset AG has made a notable entry into the spotlight. The digital asset management firm has recently filed an application with the U.S. Securities and Exchange Commission (SEC) to launch an exchange-traded fund (ETF) tied to spot Bitcoin prices. This move places Pando among a growing list of companies eager to tap into ... <a title=\"Switzerland&#8217;s Pando joins the party, files for spot Bitcoin ETF\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pando-files-for-spot-bitcoin-etf/\" aria-label=\"More on Switzerland&#8217;s Pando joins the party, files for spot Bitcoin ETF\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T23:00:26.000Z",
    "title": "LUNC Stuns With 300% Gains, Can It Reach Its Previous ATH Market Cap?",
    "url": "https://www.newsbtc.com/analysis/lunc/lunc-300-gains-ath-market-cap/",
    "description": "The Terra Classic (LUNC) price has been on a tear recently and over the last month, it has managed to outperform almost every cryptocurrency in the market. Its price has risen over 300% in a 30-day period, and this has brought its market cap back over $1.5 billion once more. As the coin continues to outperform, the possibilities of it returning to its previous all-time high market cap become greater. LUNC Price Breaks One-Year High Following the Terra collapse in 2022, the LUNC (then known as LUNA) price crashed completely, going from above $100 to less than $0. This has continued through the last year especially as the LUNC supply has swelled to over 6.5 trillion. Related Reading: AVAX Uprising: Crypto Analyst Predicts Bullish Wave To Push Price To $30 As the price has plunged, so has the market cap. But with the recovery in price so far, the jump in market cap has come as no surprise. However, it is still a long way from its all-time high market cap of $45 billion which was reached back in 2021. Now, if LUNC were to return to this all-time high market cap once more, it would be a significant increase from its current price. But it will still be a long way from its ATH price of $$120. At a market cap of $40 billion, the price of the altcoin would be just around $0.007. This would mean a more than 10x increase from its current price. However, it’ll still be very low compared to its previous price as well as the price of the new LUNA token which was launched in 2023 and is already trading above $1. Token price breaks $0.0002 &#124; Source: LUNCUSDT on Tradingview.com Can Terra Classic Break Previous ATH? The LUNC community has implemented a burn initiative to reduce the amount of tokens in circulation. This has seen billions of tokens taken out of circulation in less than a year. Data from the LuncMetrics website shows that so far, 83.77 billion tokens have been burned since the burn initiative was introduced in 2022. However, this is only a drop in the ocean of the total token supply which numbers in the trillions. Related Reading: 3 Bitcoin-Like Proof Of Work Altcoins That Could Make You A Millionaire In 2024 Nevertheless, the community continues to burn tokens in a bid to drastically reduce the circulating supply. In the last seven days, a little over 5.2 billion LUNC tokens have been sent to the burn address, reducing the supply little by little. The LUNC price is already far from returning to its past glory, but there is still a lot ahead for the coin. If it continues to perform well in the bull market, a return to the $0.01 level is a possibility. As the crypto industry grows, the likelihood of top coins crossing the $100 billion market cap becomes even more likely, signaling a better future for the altcoin. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Analytics Insight, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T23:01:01.000Z",
    "title": "Ripple-Owned Metaco Integrates With Institutional Custody Firm Backed by Standard Chartered",
    "url": "https://dailyhodl.com/2023/12/04/ripple-owned-metaco-integrates-with-institutional-custody-firm-backed-by-standard-chartered/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/global-exchange-moves.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple Labs&#8217; Metaco is integrating with an institutional custody firm backed by financial services giant Standard Chartered. According to a new press release, Metaco, a provider of digital assets infrastructure, is integrating with the London-based crypto custodian firm Zodia Custody as a means of creating a global network for institutions. “The integration enables institutions to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/ripple-owned-metaco-integrates-with-institutional-custody-firm-backed-by-standard-chartered/\">Ripple-Owned Metaco Integrates With Institutional Custody Firm Backed by Standard Chartered</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]