[
  {
    "source": "Decrypt",
    "date": "2024-02-12T22:18:01.000Z",
    "title": "Joe Biden's Cryptic Super Bowl Tweet Wasn't About Bitcoin—Or Was It?",
    "url": "https://decrypt.co/217089/joe-biden-super-bowl-tweet-bitcoin-laser-eyes",
    "description": "Did Joe Biden rig the Super Bowl? Did he pump Bitcoin to $50K? Should we seriously be writing about this? All important questions."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-12T22:37:14.000Z",
    "title": "Franklin Templeton files for spot Ethereum ETF, becoming ninth applicant overall",
    "url": "https://cryptoslate.com/franklin-templeton-files-for-spot-ethereum-etf-becoming-ninth-applicant-overall/",
    "description": "<p>Franklin Templeton has become the latest asset manager to apply for a spot Ethereum exchange-traded fund (ETF) with the publication of a Feb. 12 filing. The company detailed its plans in an S-1 registration statement with the U.S. Securities and Exchange Commission (SEC). Like other similar proposals, the fund will issue shares representing its assets [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/franklin-templeton-files-for-spot-ethereum-etf-becoming-ninth-applicant-overall/\">Franklin Templeton files for spot Ethereum ETF, becoming ninth applicant overall</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T22:16:10.000Z",
    "title": "Argentina leads Latin America in stablecoin adoption during financial instability",
    "url": "https://www.cryptopolitan.com/argentina-latin-america-stablecoin-adoption/",
    "description": "Argentina has emerged as the leading nation in Latin America for the purchase and holding of stablecoins, with a significant preference for Tether (USDT) and Circle&#8217;s USD Coin (USDC) over the past six months. Argentine citizens are holding stable coins as a hedge against the country&#8217;s ongoing economic instability and the depreciating value of the [&#8230;]"
  }
]