[
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T14:30:00.000Z",
    "title": "Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats",
    "url": "https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/magazine-Liberland-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Visiting Liberland — a crypto micronation between Croatia and Serbia — required decoys and diplomatic immunity to dodge the border guards.</p>\n                    <p><p><strong>Disembarking the Liberty houseboat moored off the frontier of the European Union, were met by a pair of Serbian police officers, their lit squad car nearly blinding us in the dark forest.</strong></p><p>How many people are staying on the boat? one asks, holding a large dog at bay. I really dont recall, says my colleague from Reuters. Fortunately, they let us go.</p><p>We must run, using phone lights to navigate the muddy path to the rally point a bit further in Croatia, in hopes that the departing presidential convoy has not left us behind.</p><p>We are meters from the border of Liberland, an unrecognized micronation of crypto fans claiming a piece of land between Croatia and Serbia on the Danube river. At just seven square kilometers  2.7 square miles  the piece of land is roughly the size of Gibraltar.</p><p>Liberland president Vt Jedlika explains it had not officially been claimed by either neighboring country, making it <em>terra nullius</em>  nobodys land  when he planted a flag there on April 13, 2015.</p><p>Though neither permanent infrastructure nor habitation has been established, the project has attracted a sizable community of Libertarian-minded folk. The de facto home in exile in Liberland is Ark Liberty Village, a nearby campground on the Serbian side.</p><p>Its here that Magazine attends Floating Man, a Liberland festival including wilderness and water survival training, music, a two-day blockchain conference, and a daring visit to Gornja Siga, also called Liberland. Getting into the independent state is going to be tricky, says Jedlika.</p><blockquote class=\"wp-block-quote\"><p>Its good to get in and out of Liberland without being beat up.</p></blockquote><h2 class=\"wp-block-heading\" id=\"h-breaking-into-liberland\">Breaking into Liberland</h2><p>As the conference concludes, the president takes the stage in front of a huge Liberland flag, pointing out the borders of Croatia and Hungary and the best ways to cross into the micronation on the map.</p><p>The route straight into Croatia to access the Danube is fastest, but most perilous  the border police know about our gathering and are expecting an incursion and, as such, are likely to prevent suspicious vehicles from entering. Flags, stickers or even Liberland-branded beer are a no-go at the crossing, as they will be confiscated, he explains.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"450\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/The-Croatian-border.-where-officers-were-serious-but-friendly.png\" alt=\"The Croatian border. where officers were serious but friendly\" class=\"wp-image-25539\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/The-Croatian-border.-where-officers-were-serious-but-friendly.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/The-Croatian-border.-where-officers-were-serious-but-friendly-300x225.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>The Croatian border, where officers were serious but friendly. (Elias Ahonen)</em></figcaption></figure><p>Entering the Schengen area through Hungary is more certain, with the Hungarians being indifferent to Liberland, making it possible to drive into the Croatian countryside and get to its land border with Liberland without prior detection.</p><p>The presidential convoy will go this route, while a boat carrying settlers will go upstream from a nearby port in Serbia to distract border patrols. Jet skis dragging inner tubes will take yet another route, with the aim of landing on Liberlands island before interception.</p><blockquote class=\"wp-block-quote\"><p>They may arrest you, but you are not breaking any law, so the longest they can hold you without charge is four hours.</p></blockquote><p>It feels like a military operation.</p><p>I begin to have doubts and unenlist myself from the jet-ski expeditionary troops to instead go with the convoy  I hadnt bought a bathing suit, and being detained in international waters in my underwear was more than Id do for a story.</p><p><strong><em>Also read:</em> <em><a href=\"https://cointelegraph.com/magazine/20-wild-attempts-to-create-crypto-micronations-or-communities/\" target=\"_blank\" rel=\"nofollow\" >Why are crypto fans obsessed with micronations and seasteading?</a></em></strong></p><p>Not to mention that the last time someone took a jetski to the island, they were brutalized  tackled and kicked on the ground  by Croatian police in an incident for which the police offered an apology and disciplined the officer in question. The event was widely reported in the country, in part because Croatian police were operating outside the nations borders.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Travelling-to-Liberland-on-Jedlickas-22presidential-convoy22-felt-like-teetering-on-the-edge-of-reality-too-real-to-be-unreal-yet-still-not-quite-reality.png\" alt=\"Travelling to Liberland on Jedlicka's presidential convoy felt like teetering on the edge of reality - too real to be unreal, yet still not quite reality\" class=\"wp-image-25540\" width=\"705\" height=\"312\" /><figcaption class=\"wp-element-caption\"><em>Traveling to Liberland on Jedlikas presidential convoy felt like teetering on the edge of reality  too real to be unreal, yet still not quite reality. (Elias Ahonen)</em></figcaption></figure><h2 class=\"wp-block-heading\">Terra nullius not on firm legal ground</h2><p>From the perspective of international law, the validity of Liberlands claims depends on which theory of state recognition is considered. According to Declarative Theory, supported by the 1933 Montevideo Convention on the Rights and Duties of States, an entity is a state  regardless of outside recognition  if it meets four criteria: a defined territory, permanent population, a government and the capacity to enter into relations with other states.</p><p>The area in question is neither Croatian nor Croatian-claimed  Jedlika says that matter was settled when Croatia entered the visa-free Schengen area at the start of 2023, with clearly defined borders being a set requirement of entry.</p><p>The land is also not Serbian. As un-owned and unclaimed land accessible from an international waterway, it appears to fit the definition of <em>terra nullius</em>, nobodys land, which may be freely occupied. A permanent population is the only missing feature, which Jedlika says is only a matter of time. If they can get in, of course.<br><br><strong><em>Also read:</em> <em><a href=\"https://cointelegraph.com/magazine/thailands-crypto-utopia-sex-drugs-libertarian-smart-village/\" target=\"_blank\" rel=\"nofollow\" >Thailands crypto utopia  90% of a cult, without all the weird stuff</a></em></strong></p><p>The competing Constitutive Theory of Statehood asserts that a state only exists if it is recognized by another state. Here, Liberland fails, though Jedlika argues it is passively recognized already.</p><p>They are checking peoples documents before they go to Liberland, and then once in Liberland they dont really care  so its happening already, Jedlika explains as we drive toward the border for a ceremony marking the opening the land border with Croatia.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/andy-warhol-loved-or-hated-nfts/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Andy Warhol would have loved (or possibly hated) NFTs</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/north-korean-crypto-hacking-separating-fact-from-fiction/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>North Korean crypto hacking: Separating fact from fiction</p>                        </a>                    </div></div></div><h2 class=\"wp-block-heading\">Web3 nation?</h2><p>Jedlika recalls that he first heard about <a href=\"https://cointelegraph.com/magazine/what-actually-like-use-bitcoin-el-salvador\" target=\"_blank\" rel=\"nofollow\" >Bitcoin</a> through his Libertarian circles when its value was under $1 and began to buy it on Mt. Gox for $32. When he proclaimed Liberlands independence in 2015, the coin stood at $225. With many of the early participants in the projects making their contributions in BTC, the treasury gained value with each bull market.</p><p>Bitcoin is really one of the most foundational parts of Liberland  99% of our reserves are in BTC.</p><p>Attracting blockchain companies is a key part of the micronations strategy, with the vision to offer a low-regulatory jurisdiction with only voluntary taxes just off Europe, directly accessible via the Danube river.</p><p>Who can become a Liberlander? Just about anyone willing to pay $150 for an e-residency, which comes with an ID card that looks like any other. Citizenship requires 5,000 Liberland Merits (LLM)  a little over $2,000  or can be earned via contributing to the project. </p><p><a href=\"https://liberland.org/en/why-blockchain\" target=\"_blank\" rel=\"nofollow\" >According</a> to Minister of Justice Michal Ptnk, while Bitcoin is the preferred currency in Liberland, the Liberland Dollar (LLD) will be used to pay transaction fees on the Liberland blockchain, which is envisioned as the backbone of on-chain companies, the judiciary, government contract execution and Liberlands stock market.</p><p>The chain is built using Polkadots <a href=\"https://www.parity.io/technologies/substrate/\" target=\"_blank\" rel=\"nofollow\" >Parity Substrate Network</a>, a solution from which customized blockchains can be built using modular components. </p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Liberland is pleased to confirm that thanks to the private initiative of Liberland citizens and supporters, people have started to trade Liberland Merits (LLM) on the exchange <a href=\"https://twitter.com/altillycom?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >@altillycom</a>. Trade and let trade! <a href=\"https://t.co/uMTOMtXpED\" target=\"_blank\" rel=\"nofollow\" >https://t.co/uMTOMtXpED</a></p>— Liberland (@Liberland_org) <a href=\"https://twitter.com/Liberland_org/status/1115619815324913666?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >April 9, 2019</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p>As we stand by the Hungarian border crossing, waiting to go in, I chat with the head ambassador of Polkadot, David Pethes. He notes that Liberlands governance token, the LLM, already has 19 live validators, and the website <a href=\"https://liberland.org/en/why-blockchain\" target=\"_blank\" rel=\"nofollow\" >explains</a> the requirements:</p><p>Only Liberland citizens can run validators, adding an extra layer of security against bad actors even in a scenario where less than 50% of circulating LLD is staked.</p><p>Pethes, who is Polkadots man in Eastern Europe, notes that Liberland is not on our list yet, but Id like to have it formally included in the Polkadot ecosystem. He sees the projects as ideologically aligned. The participants in the ecosystem have very similar views on how money should work, how you can send value without a central point of failure, he says.</p><p>Liberland governance and corporate governance have many similarities  the blockchain is basically forked from Polkadot, he notes. A land registry functioning on NFTs is also on the roadmap, as well as the <a href=\"https://liberverse.net/\" target=\"_blank\" rel=\"nofollow\" >Liberverse</a>.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"432\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/LLM-Tokenomics.png\" alt=\"LLM Tokenomics\" class=\"wp-image-25535\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/LLM-Tokenomics.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/LLM-Tokenomics-300x216.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>LLM tokenomics. (Liberland)</em></figcaption></figure><h2 class=\"wp-block-heading\">Journey to Liberland</h2><p>It begins to rain as we approach the Hungarian border. This apparently causes their internet to malfunction, resulting in an hours-long line for processing. Nearly giving up, we pull into the<a href=\"https://cointelegraph.com/magazine/ethics-101-should-crypto-projects-negotiate-hackers\" target=\"_blank\" rel=\"nofollow\" > diplomatic</a> channel, which the Hungarian officials are unhappy about upon recognizing Jedlika. They let us through, making us stay put for perhaps 20 minutes after processing, in what I understand is a summary slap on the wrist for abusing diplomatic convention.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Journey-to-Liberland.png\" alt=\"Journey to Liberland\" class=\"wp-image-25533\" width=\"300\" height=\"400\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Journey-to-Liberland.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Journey-to-Liberland-225x300.png 225w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><figcaption class=\"wp-element-caption\"><em>The border guards have a word. (Elias Ahonen)</em></figcaption></figure><p>Crossing into the Hungarian countryside, we encounter a roadblock meant to catch illegal migrants. But were able to continue and cross into Croatia by ferry.</p><p>I am told stories of previous journeys. Last year, police warned that it would be dangerous to venture into Liberland because it was hunting season. We could hear gunshots some distance away, but they thought we could not tell hunting rifles from pistols  no one hunts with a pistol, explains our driver, suggesting that police were firing their service pistols to scare them away.</p><p>Other times, border patrols would take it upon themselves to rescue those they deemed stuck in Liberland  against the wishes of the rescued. Technically, such actions may constitute kidnapping per both Croatian and Liberland law. Jedlika also notes that Liberlanders have been arrested for disobeying a no-parking sign installed in the forest.</p><p>Were on the northern border, Jedlika notes as we turn to a back road near the Danube river. Others have already arrived, and a Croatian police boat is tied to the shore with an officer respectfully collecting everyones passports and taking them to the boat. Another police vessel speeds to the location, but within 20 minutes, passports are returned.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Jedlicka-takes-a-picture-of-the-22BORDER-CROSSING-LIBERLAND-CROATIA22-sign.-Houseboat-visible-on-the-right.png\" alt=\"Jedlicka takes a picture of the BORDER CROSSING LIBERLAND-CROATIA sign. Houseboat visible on the right\" class=\"wp-image-25531\" width=\"-200\" height=\"-200\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Jedlicka-takes-a-picture-of-the-22BORDER-CROSSING-LIBERLAND-CROATIA22-sign.-Houseboat-visible-on-the-right.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Jedlicka-takes-a-picture-of-the-22BORDER-CROSSING-LIBERLAND-CROATIA22-sign.-Houseboat-visible-on-the-right-300x300.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Jedlicka-takes-a-picture-of-the-22BORDER-CROSSING-LIBERLAND-CROATIA22-sign.-Houseboat-visible-on-the-right-100x100.png 100w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Jedlika takes a picture of the BORDER CROSSING LIBERLAND-CROATIA sign. Houseboat visible on the right. (Elias Ahonen)</em></figcaption></figure><p>The supply van is opened, and each Liberlander takes what they can carry  boxes of equipment, rucksacks of supplies, coolers of food and drink. I carry water. We trek 700 meters into the forest, turning toward the river where a houseboat bearing the Liberland flag is moored.</p><p>Pictures are taken, and Jedlika carries the border crossing sign to a nearby tree, to which it is attached.</p><p>Someone announces that it is time for border control, and a line forms to get Liberland, American and Swedish passports stamped.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Passports-including-from-America-an-Sweden-being-stamped-as-people-prepare-to-board-the-Liberland-houseboat.png\" alt=\"Passports, including from America an Sweden, being stamped as people prepare to board the Liberland houseboat\" class=\"wp-image-25536\" width=\"-250\" height=\"-250\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Passports-including-from-America-an-Sweden-being-stamped-as-people-prepare-to-board-the-Liberland-houseboat.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Passports-including-from-America-an-Sweden-being-stamped-as-people-prepare-to-board-the-Liberland-houseboat-300x300.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Passports-including-from-America-an-Sweden-being-stamped-as-people-prepare-to-board-the-Liberland-houseboat-100x100.png 100w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Passports, including from America and Sweden, being stamped as people prepare to board the Liberland houseboat. (Elias Ahonen)</em></figcaption></figure><p>Will the stamp cause a problem if I have it in my real passport? one nervous visitor asks.</p><p>The answer is yes, it will, but at that moment, we were not aware of the headache it would create.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Liberland-stamp-on-an-American-passport.png\" alt=\"Liberland stamp on an American passport\" class=\"wp-image-25534\" width=\"-289\" height=\"-289\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Liberland-stamp-on-an-American-passport.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Liberland-stamp-on-an-American-passport-300x300.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Liberland-stamp-on-an-American-passport-100x100.png 100w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Liberland stamp on an American passport. (Elias Ahonen)</em></figcaption></figure><p>There is an element of theater  the tree and passport table are on shore, still in Croatia. The real border lies 200 meters further down the path, where officers lean against their cruiser, guarding the exit from Europe. I approach them.</p><p>Though they at first deny permission to pass, I returned with others to inquire again. They discouraged our entry, saying the forest is too dangerous due to wild boars. I asked how big they are, and the taller officer laughs and brought his hand near chest-level, suggesting that there are monsters beyond the boundary.</p><p>But they eventually allow us to pass on the promise that we would return before dark. I walk into the dimming wilderness, exiting the EU and Schengen area. Im in no mans land  Liberland. Its something of an anti-climax.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"400\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Journalist-Elias-Ahonen-in-Liberland.png\" alt=\"Journalist Elias Ahonen in Liberland\" class=\"wp-image-25532\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Journalist-Elias-Ahonen-in-Liberland.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Journalist-Elias-Ahonen-in-Liberland-300x200.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Journalist Elias Ahonen in Liberland. Looks very similar to Croatia in fact. (Elias Ahonen)</em></figcaption></figure><p>After 20 minutes, we return and our passports are again checked to reenter Croatia.</p><p>Back on the boat, theres is much eating and drinking and with some fanfare, Radio Liberland, whose signal was sent from soil of Liberland, makes its first broadcast.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Patrick-Banick-a-settler-who-has-been-living-on-the-boat-for-two-months-offers-me-a-beer.png\" alt=\"Below deck, 26-year old Patrick Banick, a settler who has been living on the boat for two months, offers me a beer.\" class=\"wp-image-25537\" width=\"594\" height=\"434\" /><figcaption class=\"wp-element-caption\"><em>Below deck, 26-year-old Patrick Banick, a settler who has been living on the boat for two months, offers me a beer. (Elias Ahonen)</em></figcaption></figure><p>Im an unusual person  I dont feel like myself when I have things tying me down, like being in a strict relationship with having commitments to be in certain places at certain times, he explains, saying that he was attracted to the project for its Libertarian philosophy.</p><p>I originally expected that we would just go to the land, build a camp, and refuse to leave  but its been very different. Ive learned a lot about how diplomatic you have to be, he reflects on Jedlikas approach.</p><p>Banick is optimistic about the projects blockchain aspirations. From my understanding, they create smart contracts that can be enforced as a sort of immutable court without third parties, without corruption. He also sees cryptocurrency as promoting economic freedom, which correlates with every single boost in the standard of living, including longevity, literacy rates and infant mortality. He is a true believer.</p><p>Theyre interested in utilizing smart contracts and blockchain to revolutionize governance and law.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"450\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Elias-Ahonen-center-with-Patrick-and-Jonas-on-Liberty-the-houseboat-where-they-were-living.png\" alt=\"Elias Ahonen (center) with Patrick and Jonas on Liberty, the houseboat where they were living.\" class=\"wp-image-25530\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Elias-Ahonen-center-with-Patrick-and-Jonas-on-Liberty-the-houseboat-where-they-were-living.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Elias-Ahonen-center-with-Patrick-and-Jonas-on-Liberty-the-houseboat-where-they-were-living-300x225.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Elias Ahonen (center) with Patrick and Jonas on Liberty, the houseboat where they were living. <em>(Elias Ahonen)</em></em></figcaption></figure><p>Jonas, a Czech national who was moving on to the boat that day, compares his vision for Liberland with Hong Kongs former Kowloon walled city, which once contained 35,000 residents on 2.6 hectares. It had like the cheapest rent, the cheapest medical care, the cheapest food, even though it was like the densest population of any place ever, he explains  though by most outsider accounts, the city was not exactly a comfortable place.</p><p>As I return above deck, there is silence. Ive been left behind.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/powers-on-top-crypto-legal-regulatory-developments-2021/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Powers On… Top 5 crypto legal and regulatory developments of 2021</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/who-takes-gold-in-crypto-blockchain-olympics/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Who takes gold in the crypto and blockchain Olympics?</p>                        </a>                    </div></div></div><h2 class=\"wp-block-heading\">Croatian border guards break the law</h2><p>Though some cars have already left, I manage to catch a ride with Jedlika after having my passport checked yet again by newly arrived police officers. Less than two kilometers away at the old guard post, we are again stopped for passport checks.</p><p>The final challenge was encountered at the Batina CroatiaSerbia border crossing, where Croatian officers took issue with two Americans and a Swede, whose passports were stamped by Liberland, refusing to return the passports unless they each pay a 230-euro fine.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"450\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/The-7th-time-passports-were-needed.png\" alt=\"The 7th time passports were needed\" class=\"wp-image-25538\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/The-7th-time-passports-were-needed.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/The-7th-time-passports-were-needed-300x225.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>The seventh time passports were needed. (Elias Ahonen)</em></figcaption></figure><p>A Croatian-American dual national with a Liberland stamp in her American passport says later that, in a private room, the Croatian officials threatened her with immediate loss of her Croatian citizenship if she refused the fine. This is legally impossible.</p><p>Throughout the ordeal, the officials at the otherwise deserted border post held all passports  including the authors Finnish passport  for approximately two hours and refused to explain the reason for the delay.</p><p>Driving back to the Ark camp through Serbia in the wee hours, we come across a melancholy sight: several dozen migrants traveling under cover of darkness, making their way to the Schengen border. Seeing them struggle and risk it all to get to Europe made me question whether what we had just done  with far greater resources and far lower stakes  made a mockery of their struggle. Could Liberland realistically become much more than a bunch of Bitcoiners LARPing sovereignty?</p><p>And while the early August Floating Man festival appeared  a turning point at the time  with the construction of small cabins and the establishment of a small settlement on the land mass, relations with neighboring Croatia have since taken a turn for the worse. On September 21, Liberland Press <a href=\"https://liberlandpress.com/2023/09/22/brutal-croatian-invades-liberland-destroys-houses/\" target=\"_blank\" rel=\"nofollow\" >reported</a> an unannounced extraterritorial incursion in which multiple settlers were arrested, newly built structures demolished, and equipment, including a generator, quad bike and food, were taken under the oversight of Croatian police.</p><p>The story of Liberland appears far from over.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T14:15:53.000Z",
    "title": "Poloniex restores services after $100M hack, users await info on reimbursement plan",
    "url": "https://cryptoslate.com/poloniex-restores-services-after-100m-hack-users-await-info-on-reimbursement-plan/",
    "description": "<p>Poloniex said it has resumed deposit and withdrawal services after a recent breach of its hot wallets, according to a Nov. 15 statement. On Nov. 10, a malicious actor compromised one of the exchange&#8217;s hot wallets, moving more than $100 million worth of digital assets, including Ethereum (ETH). At the time, the attacker had used [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/poloniex-restores-services-after-100m-hack-users-await-info-on-reimbursement-plan/\">Poloniex restores services after $100M hack, users await info on reimbursement plan</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-11-15T14:30:00.000Z",
    "title": "Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats",
    "url": "https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/magazine-Liberland-scaled.jpg\"></p><p>Visiting Liberland — a crypto micronation between Croatia and Serbia — required decoys and diplomatic immunity to dodge the border guards.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-15T14:10:17.000Z",
    "title": "BinaryX Launches City Building Game Pancake Mayor on PancakeSwap’s New Marketplace",
    "url": "https://www.cryptoglobe.com/latest/2023/11/binaryx-launches-city-building-game-pancake-mayor-on-pancakeswaps-new-marketplace/",
    "description": "Singapore, Singapore, November 15th, 2023, Chainwire Today, BinaryX, a GameFi and Initial Game Offering (IGO) platform, announced the launch of Pancake Mayor, a new city-building simulator on the newly launched PancakeSwap Gaming Marketplace.  Pancake Mayor: City Building Simulator Pancake Mayor is a free-to-play casual city-building game where players can obtain in-game currency, Mayor Cash, to […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T14:23:02.000Z",
    "title": "As Economic Currents Shift, Bitcoin (BTC) and Ethereum (ETH) Locked in a Close Battle",
    "url": "https://cryptodaily.co.uk/2023/11/as-economic-currents-shift-bitcoin-btc-and-ethereum-eth-locked-in-a-close-battle",
    "description": "Dive into the captivating dynamics between Bitcoin (BTC) and Ethereum (ETH) as they navigate through a volatile crypto market. Our insightful analysis examines their latest market trends, revealing a tense competition where each coin vies for dominance. With BTC experiencing a mix of highs and lows, and ETH showing signs of potential shifts, we offer an in-depth perspective on their current standings and future possibilities. Keep abreast of the latest developments in the cryptocurrency world with our thorough breakdown, poised to equip you with the knowledge needed to understand the subtle nuances of potential bullish surges or bearish downturns in this ever-evolving digital finance arena."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-15T14:30:08.000Z",
    "title": "From ‘Big Short’ to Big Shift — Michael Burry Rotates Out of Bearish Bets Following Several Misfires",
    "url": "https://news.bitcoin.com/from-big-short-to-big-shift-michael-burry-rotates-out-of-bearish-bets-following-several-misfires/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From ‘Big Short’ to Big Shift — Michael Burry Rotates Out of Bearish Bets Following Several Misfires\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/burryssd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Michael Burry, famously known for his bold &#8216;Big Short&#8217; wager against subprime mortgages in the early 2000s, has recently offloaded several substantial bearish positions following unsuccessful outcomes. As the founder of Scion Asset Management, Burry dissolved his put options on major indices and semiconductor stocks during the third quarter, as revealed by regulatory documents. These [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T14:18:22.000Z",
    "title": "Escalating Cyber Attacks Pose Alarming Threat to the Digital Landscape",
    "url": "https://www.cryptopolitan.com/cyber-attacks-threat-to-digital-landscape/",
    "description": "Projections from Cybersecurity Ventures paint a grim picture for the digital landscape. They estimate that the annual economic toll of cyber crimes is set to skyrocket to a staggering $10.5 trillion by 2025. This alarming figure underscores the pervasive and rapidly evolving nature of cyber threats in today&#8217;s interconnected world. Recognizing cyber attacks as ubiquitous ... <a title=\"Escalating Cyber Attacks Pose Alarming Threat to the Digital Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cyber-attacks-threat-to-digital-landscape/\" aria-label=\"More on Escalating Cyber Attacks Pose Alarming Threat to the Digital Landscape\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T14:25:44.000Z",
    "title": "How Stellar’s Blockchain Technology is Empowering Impoverished Communities",
    "url": "https://www.crypto-news-flash.com/how-stellars-blockchain-technology-is-empowering-impoverished-communities/?utm_source=rss&utm_medium=rss&utm_campaign=how-stellars-blockchain-technology-is-empowering-impoverished-communities",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Idris Elba is working with the Stellar Foundation to bring real-world changes through blockchain technology. Earlier this year, the well-known actor was a guest at this year’s annual edition of the Meridian Conference organized by the Stellar Foundation. The Stellar Foundation has made incredible strides this year through its Stellar network. Much of the work [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T14:23:00.000Z",
    "title": "Dogecoin (DOGE) Bulls Unite Once More After Brief Correction",
    "url": "https://coinedition.com/dogecoin-doge-bulls-unite-once-more-after-brief-correction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin (DOGE) Bulls Unite Once More After Brief Correction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Should bulls continue to grow stronger, DOGE’s price may attempt to establish a foundation above $0.07755. After its price dipped slightly over the past day, bulls are stepping in to push DOGE’s price back up again. DOGE was able to break above the $0.07755 resistance level over the past 5 days and reached a high [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/dogecoin-doge-bulls-unite-once-more-after-brief-correction/\">Dogecoin (DOGE) Bulls Unite Once More After Brief Correction</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]