[
  {
    "source": "Decrypt",
    "date": "2023-08-04T09:29:00.000Z",
    "title": "Revolut to Shutter US Crypto Operations Due to 'Regulatory Environment'",
    "url": "https://decrypt.co/151272/revolut-shutter-us-crypto-operations-due-regulatory-environment",
    "description": "From September 2, Revolut will suspend its cryptocurrency services in the U.S., with complete access disabled from October 3."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T09:20:49.000Z",
    "title": "Meta launches suite of generative AI music tools rivaling Google’s MusicLM",
    "url": "https://cointelegraph.com/news/meta-launches-suite-of-generative-ai-music-tools-rivaling-google-s-musiclm",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/689b8ba7-4553-476d-b200-ffea5233cd1d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Meta’s latest suite of generative AI tools allows users to input text to create musical and audio compositions, rivaling a similar tool released this year by Google. </p>\n                    <p><p>Meta, the parent company of Facebook and Instagram, launched a suite of generative AI models on Aug. 2, which it calls AudioCraft, for the purpose of music creation from various inputs, according to a blog <a href=\"https://ai.meta.com/blog/audiocraft-musicgen-audiogen-encodec-generative-ai-audio/\" target=\"_blank\" rel=\"noopener nofollow\">post</a>. </p><p>Included in the suite of generative AI tools are MusicGen and AudioGen, which operate off of text-based inputs to create new audio, along with another called EnCodec that “allows for higher quality music generation with fewer artifacts.”</p><p>In the announcement, Meta mentioned that its MusicGen model was trained with music that it owns or “specifically licensed.”</p><p>This comes as there have already been major controversy surrounding training AI with copyrighted work across many artistic fields, including a <a href=\"https://cointelegraph.com/news/meta-and-open-ai-sued-for-copyright-violations-sarah-silverman\">lawsuit against Meta for copyright infringement</a> during AI training. </p><p>At the moment, Meta has made MusicGen and AudioGen available in several sizes to the “research community” and developers. It said as it develops more advanced controls it envisions the models to become useful to both amateurs and professionals in the music industry. </p><blockquote>“With even more controls, we think MusicGen can turn into a new type of instrument — just like synthesizers when they first appeared.”</blockquote><p>In a recent interview between Cointelegraph and the CEO of the Recording Academy, Harvey Mason Jr., he also likened<a href=\"https://cointelegraph.com/news/ai-grammys-recording-academy-ceo-harvey-mason-jr\"> the emergence of AI-generated music</a> to the early days of synthesizers coming onto the music scene. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/spotify-reportedly-deletes-thousands-of-ai-generated-songs\"><strong><em>Spotify reportedly deletes thousands of AI-generated songs</em></strong></a></p><p>Meta’s release of its generative AI music tools comes shortly after Google launched its set of similar tools that turns text into music called MusicLM. </p><p>In May, the company <a href=\"https://blog.google/technology/ai/musiclm-google-ai-test-kitchen/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it was accepting “early testers” of the products via its AI Test Kitchen platform. </p><p>Meta has been actively releasing new AI tools, alongside many other tech giants including Google and Microsoft, in a race to develop and deploy the most powerful models. </p><p>On Aug. 1 Meta announced the launch of <a href=\"https://cointelegraph.com/news/meta-to-launch-ai-chatbots-with-personalities\">new AI chatbots with personalities</a>, which users on its platforms will be able to use as search helpers and as a “fun product to play with.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-04T09:13:57.000Z",
    "title": "Shiba Memu Announces BitMart Listing As Presale Soars Past $1.5M Milestone",
    "url": "https://www.cryptoglobe.com/latest/2023/08/shiba-memu-announces-bitmart-listing-as-presale-soars-past-1-5m-milestone/",
    "description": "London, UK, August 4th, 2023, Chainwire Shiba Memu, a buzzing new AI-backed crypto meme coin, is creating more stir as it surges past the $1.5 million fundraising milestone and makes its exchange announcement debut with a BitMart listing – all within just one month of its presale starting. Getting listed on an established exchange like […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-04T09:10:23.000Z",
    "title": "$XRP Fans Rejoice: CoinFlip Adds the Highly Popular Digital Asset to Its Online Order Desk",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-fans-rejoice-coinflip-adds-the-highly-popular-digital-asset-to-its-online-order-desk/",
    "description": "CoinFlip, a prominent fintech firm in the cryptocurrency space, has announced the addition of Ripple’s native token, XRP, to its Order Desk offering. This move comes in the wake of a court ruling on 13 July 2023 that determined XRP is not an unregistered security when bought by individual consumers, a decision that has been […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T09:19:21.000Z",
    "title": "SEC Charges 18 Defendants in DEBT Box, Freezes Its Assets",
    "url": "https://cryptodaily.co.uk/2023/08/sec-charges-18-defendants-in-debt-box-freezes-its-assets",
    "description": "<p>The US SEC on Thursday secured a temporary asset freeze, restraining order and further emergency relief against Digital Licensing, a Draper, Utah-based entity operating as DEBT Box. </p>\n<p>The US Securities and Exchange Commission (SEC) announced it had obtained emergency relief against DEBT Box and four of the company&rsquo;s principals.</p>\n<p>In its continued crackdown on crypto fraud, the SEC obtained a temporary asset freeze, restraining order, and other emergency relief against Digital Licensing Inc., a Draper, Utah-based entity operating as &ldquo;DEBT Box.&rdquo; The agency also acted against four of the company&rsquo;s principals, Jason Anderson, his brother Jacob Anderson, Schad Brannon, and Roydon Nelson, along with 13 other defendants for their connecting to a scheme to sell crypto asset securities to US investors which raised around $50 million and an undisclosed amount of Bitcoin (BTC) and Ether (ETH).</p>\n<p>According to the securities agency, the defendant sold unregistered securities called &ldquo;node licenses&rdquo; to unsuspecting victims. In the scheme, which started operating in March 2021, the defendants said to investors that the licenses would mine crypto and, in turn, increase in value when the defendants actually created the crypto using code on a blockchain.</p>\n<p>Tracy S. Combs, Director of the SEC&rsquo;s Salt Lake Regional Office, said in a press release:</p>\n\n<p>&ldquo;We allege that DEBT Box and its principals lied to investors about virtually every material aspect of their unregistered offering of securities, including by falsely stating that they were engaged in crypto asset mining.&rdquo;</p>\n\n<p>Adding,</p>\n\n<p>&ldquo;We filed this emergency action to protect the victims of the defendants&rsquo; unlawful actions and stop further harm.&rdquo;</p>\n\n<p>The SEC charged the 18 defendants, including the four principals mentioned above, with engaging in unregistered securities offerings.</p>\n\n<p>&ldquo;DEBT Box, Jason Anderson, Jacob Anderson, Brannon, Nelson, Franklin, Western Oil, and Bowen were also charged with violations of the antifraud provisions of the federal securities laws. Jason Anderson, Jacob Anderson, Brannon, Nelson, Bowen, Mark Schuler, Benjamin Daniels, Joseph Martinez, Travis Flaherty, Brendon Stangis, Matthew Fritzsche, B &amp; B Investment Group, LLC, and iX Global, LLC were charged with acting as unregistered brokers.&rdquo;</p>\n\n<p>The SEC charges seek permanent injunctive relief, the return of the ill-gotten gains, and further civil penalties.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-04T09:30:01.000Z",
    "title": "Crypto Assets Held in Self-Custody Wallets Have ‘a Non-Zero Chance’ of Getting Stolen — Fairside Network CEO",
    "url": "https://news.bitcoin.com/crypto-assets-held-in-self-custody-wallets-have-a-non-zero-chance-of-getting-stolen-fairside-network-ceo/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Assets Held in Self-Custody Wallets Have &#039;a Non-Zero Chance&#039; of Getting Stolen — Fairside Network CEO\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1917442553.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Brandon Brown, the co-founder and CEO of Fairside Network, self-custody crypto wallets generally lack inbuilt insurance coverage to protect against theft or loss. Brown attributes this to the challenges encountered when assessing digital asset risks as well as &#x201C;the absence of historical loss data, and evolving threats.&#x201D; Insurance Coverage for Assets Held in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T09:36:29.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T09:21:39.000Z",
    "title": "SEC cracks down on Utah-based DEBT Box in crypto fraud scheme, freezing $50 million in assets",
    "url": "https://www.cryptopolitan.com/sec-cracks-down-on-utah-based-debt-box-in-crypto-fraud-scheme-freezing-50-million-in-assets/",
    "description": "On Thursday, the Securities and Exchange Commission (SEC) launched an emergency legal intervention against Digital Licensing Inc., conducting business as “DEBT Box,” alongside its four principals and 13 additional defendants. This move is in response to the discovery of an alleged fraudulent scheme that sold unregistered crypto asset securities named &#8220;node licenses&#8221; to hundreds of ... <a title=\"SEC cracks down on Utah-based DEBT Box in crypto fraud scheme, freezing $50 million in assets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-cracks-down-on-utah-based-debt-box-in-crypto-fraud-scheme-freezing-50-million-in-assets/\" aria-label=\"More on SEC cracks down on Utah-based DEBT Box in crypto fraud scheme, freezing $50 million in assets\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-04T09:34:09.000Z",
    "title": "Tether CTO claims USDT price being manipulated, some suggest Binance involvement",
    "url": "https://crypto.news/tether-cto-claims-usdt-price-being-manipulated-some-suggest-binance-involvement/",
    "description": "Tether and Bitfinex chief technology officer Paolo Ardoino voiced concerns over what, according to him, are signs that the USDT (USDT) stablecoin is being manipulated. In an Aug. 3 tweet, Ardoino explained that USDT is being pressured down by about&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T09:28:12.000Z",
    "title": "Shiba Inu Price Poised To Reach $0.01 With Shibarium Upgrade, These CEOs Say",
    "url": "https://www.newsbtc.com/all/shiba-inu-price-poised-to-reach-0-01/",
    "description": "Shiba Inu (SHIB) is experiencing a remarkable surge in its upward movement, fueled by growing anticipation among meme coin enthusiasts for the upcoming introduction of Shibarium, an innovative upgrade to its layer 2 blockchain.  Scheduled for release this August, Shibarium holds the key to addressing the prevailing scalability and network congestion issues that the Shiba Inu blockchain currently grapples with. Its primary objective is to propel the SHIB token to unprecedented success. Related Reading: Kaspa (KAS) Takes Off With 23% Burst – What’s Fueling The Thrust? While investors in Shiba Inu eagerly anticipate this significant milestone, a group of financial specialists has recently been consulted to offer their expert perspectives on how SHIB might respond following the successful implementation of the Shibarium upgrade. Shibarium&#8217;s Potential Impact On SHIB, According To Experts Jonathan Merry, CEO of Moneyzine.com, elucidated that Shibarium is a developer platform to revolutionize the accessibility of SHIB-related token transactions. Additionally, it will establish a central space for developers to forge and unveil their projects, Merry elaborated.  Merry noted:. “In any case, as long as Shibarium is used, SHIB will profit. Suppose it is extremely successful and becomes a global sensation. In that case, SHIB may have a better chance of hitting the $0.01 target with the enhanced Shibarium and the new burn mechanism.” Ultimately, the potential realization of SHIB reaching $0.01 and the ascent of the BONE token price from $1 to $1,000 could be catalyzed by Shibarium, the executive suggested. SHIB market cap nearing the $5 billion level. Chart: TradingView.com Adam Garcia, CEO of The Stock Dork, delved into the significance of the forthcoming Shibarium upgrade, underscoring its role in mitigating the scalability and network congestion obstacles currently confronting the blockchain. Garcia said: “The expectation is that an improved and more efficient blockchain infrastructure could attract greater interest and adoption, thereby increasing the demand for the SHIB token.” He added that there is optimism that the token’s value could experience a substantial increase in the short term, especially as the network capabilities are upgraded and &#8220;supply-side pressures are reduced.” A Pivotal Juncture For Shiba Inu The analysis provided by these experts underscores the significance of the Shibarium upgrade for the SHIB token&#8217;s future. This juncture marks a technical evolution and a potential turning point in SHIB&#8217;s journey toward greater adoption and value appreciation. Related Reading: All Hype? BALD Meme Coin’s Volume Shaved By 96% The crypto community awaits the unveiling of Shibarium this month, and all eyes are on how this upgrade might catalyze a new era for Shiba Inu and its associated tokens. At the time of writing, SHIB was trading at $0.00000842, up 2.4% in the past 24 hours and notched a seven-day surge of 7.4%, data from crypto market tracker CoinGecko shows. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T09:34:03.000Z",
    "title": "BEWARE! Security Researchers Find 7 Fake Cryptocurrency Investment Apps in Google Play & Apple App Store",
    "url": "https://www.crypto-news-flash.com/beware-security-researchers-find-7-fake-cryptocurrency-investment-apps-in-google-play-apple-app-store/?utm_source=rss&utm_medium=rss&utm_campaign=beware-security-researchers-find-7-fake-cryptocurrency-investment-apps-in-google-play-apple-app-store",
    "description": "<img width=\"1920\" height=\"1357\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-300x212.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-1024x724.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-768x543.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-1536x1086.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-24x17.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-36x25.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/scam-sign-48x34.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Leading Cybersecurity giant Sophos X-Ops reveals that crypto scams are now dominating the Google Play Store and Apple App Store.  A prominent researcher revealed that the scams are now being enhanced by AI, as fraudsters now use ChatGPT to advance their schemes.  According to new reports, fake cryptocurrency investment scams are on the rise. These [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T09:33:07.000Z",
    "title": "As Ethereum’s Rebound Hangs by a Thread, Borroe Presale Lures Investors with 100x Potential",
    "url": "https://www.crypto-news-flash.com/as-ethereums-rebound-hangs-by-a-thread-borroe-presale-lures-investors-with-100x-potential/?utm_source=rss&utm_medium=rss&utm_campaign=as-ethereums-rebound-hangs-by-a-thread-borroe-presale-lures-investors-with-100x-potential",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the crypto market faces a lull in activity, investors are turning their attention to exciting opportunities like Borroe&#8217;s $ROE presale. Crypto analysts have predicted that the $ROE token has a growth potential of over 100x. Borroe ($ROE) &#8211; The AI-Powered Funding Marketplace Borroe stands at the forefront of innovation in a world where the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-04T09:29:39.000Z",
    "title": "98.87% Crypto Investors MISS This Altcoin! You Must Not",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/98-87-crypto-investors-miss-this-altcoin-you-must-not/",
    "description": "<p>What’s the biggest Proof of Work project after Bitcoin? Anyone know? It’s Litecoin. If you knew that I am sure you dont know this for sure. Litecoin is the backbone of Dogecoin. Surprised? So was I. But for some reason, this altcoin just keeps flying under everyone’s radar. That’s despite no downtime in 11 years [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/98-87-crypto-investors-miss-this-altcoin-you-must-not/\">98.87% Crypto Investors MISS This Altcoin! You Must Not</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T09:15:44.000Z",
    "title": "Top Crypto Analyst Who Predicted Bitcoin Rally From 2022 Bottom Says He’s Now ‘Very Very Bearish’ – Here’s Why",
    "url": "https://dailyhodl.com/2023/08/04/top-crypto-analyst-who-predicted-bitcoin-rally-from-2022-bottom-says-hes-now-very-very-bearish-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/From-2022-Bottom-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top trader is issuing a warning on Bitcoin (BTC) amid the flagship crypto asset’s failure to break above a key resistance level for months. The analyst pseudonymously known as DonAlt tells his 52,700 subscribers that he is “already very, very bearish” on Bitcoin even though he doesn’t have short positions on the flagship crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/top-crypto-analyst-who-predicted-bitcoin-rally-from-2022-bottom-says-hes-now-very-very-bearish-heres-why/\">Top Crypto Analyst Who Predicted Bitcoin Rally From 2022 Bottom Says He’s Now ‘Very Very Bearish’ – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]