[
  {
    "source": "CryptoSlate",
    "date": "2023-11-24T12:05:08.000Z",
    "title": "Bitcoin miners transfer 8,000 BTC amid transaction fee surge",
    "url": "https://cryptoslate.com/insights/bitcoin-miners-transfer-8000-btc-amid-transaction-fee-surge/",
    "description": "<p>Quick Take Within the span of a month, Bitcoin miner balances have experienced one of the most notable declines this year. As of late October, miner balances stood at 1.833 million Bitcoin. However, the subsequent month witnessed a departure of 8,000 Bitcoin from the miner balances. The shift does not necessarily imply that miners have [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-miners-transfer-8000-btc-amid-transaction-fee-surge/\">Bitcoin miners transfer 8,000 BTC amid transaction fee surge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-24T11:52:01.000Z",
    "title": "Current crypto bull market taking everyone by surprise",
    "url": "https://cryptodaily.co.uk/2023/11/current-crypto-bull-market-taking-everyone-by-surprise",
    "description": "While the crypto market is perhaps still not ‘raging’, it has caught many on the hop, and retail investors have still not flocked to the crypto market en masse."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-24T12:00:16.000Z",
    "title": "RoyalCDKeys: How to Buy Crypto Anonymously",
    "url": "https://news.bitcoin.com/royalcdkeys-how-to-buy-crypto-anonymously/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-23t184636-962.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />What&#x2019;s the main reason behind cryptocurrencies&#x2019; success? One word &#x2013; decentralization. Bitcoin offers what global banks can&#x2019;t. Every major bank you know or are a client of is centralized and, thus, controlled by a central authority. This means you can freely own and control your funds, but your bank account is reliant on banking intermediaries. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T12:00:22.000Z",
    "title": "Diverse thanksgiving: Crypto musings across the community",
    "url": "https://www.cryptopolitan.com/diverse-thanksgivings-crypto-musings/",
    "description": "Thanksgiving celebrations within the crypto community took on a unique flavor this year as enthusiasts expressed gratitude for the industry&#8217;s milestones and progress. As users gathered on various platforms, including X (formerly Twitter), the sentiment was a mix of appreciation for past achievements and contemplation of the industry&#8217;s future. Thanksgiving musings on market prices Members ... <a title=\"Diverse thanksgiving: Crypto musings across the community\" class=\"read-more\" href=\"https://www.cryptopolitan.com/diverse-thanksgivings-crypto-musings/\" aria-label=\"More on Diverse thanksgiving: Crypto musings across the community\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T11:51:22.000Z",
    "title": "Do Kwon’s extradition has been approved",
    "url": "https://www.cryptopolitan.com/do-kwons-extradition-has-been-approved/",
    "description": "The crypto world has been closely following the saga of Do Kwon, the controversial entrepreneur behind Terraform Labs. In a significant development, a court in Montenegro has approved his extradition, marking a crucial turn in the multinational legal pursuit. Kwon, embroiled in charges of multibillion-dollar fraud in the United States and facing legal troubles in ... <a title=\"Do Kwon&#8217;s extradition has been approved\" class=\"read-more\" href=\"https://www.cryptopolitan.com/do-kwons-extradition-has-been-approved/\" aria-label=\"More on Do Kwon&#8217;s extradition has been approved\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T12:00:29.000Z",
    "title": "BLUR Token Rules Today’s Top 100 Crypto Ranking With 88% Rally – Details",
    "url": "https://www.newsbtc.com/news/blur-token-rules-todays-top-100-crypto-ranking-with-88-rally-details/",
    "description": "The news of BLUR, which saw an impressive 88% increase in price in the last week, has the cryptocurrency industry buzzing. This abrupt increase in value is directly related to what happened after the Season 2 airdrop. Coincidentally, the price spike also occurred following news of Binance CEO Changpeng Zhao&#8217;s resignation. The cryptocurrency market saw a consecutive two-day period of downward trading activity subsequent to the disclosure of legal accusations against Zhao. Today, it seemed to have changed course and exhibited a favorable trend, with a notable increase of over 2.5% in value within the past 24 hours. Related Reading: Analyst’s Crystal Ball: XRP Bulls Eyeing $40 Price Target, Despite Doubts Blur trading at $0.626. Source: Coingecko BLUR On A Tear: 200% Price Boost In the 42 days since clearing a long-term descending resistance trend line, the price of BLUR has surged by more than 200%. The market movement indicates a positive outlook, despite the daily timeframe Relative Strength Index (RSI) providing a bearish reading. Market analysts have reported a significant surge in purchasing activity, wherein a total of 51.3 million BLUR tokens were acquired by 19 entities. This acquisition amounts to a remarkable investment of $21 million in the aforementioned commodity. BLUR is pumping after the Season 2 #airdrop! 19 addresses bought a total of 51.3M $BLUR($21M) after the Season 2 #airdrop. pic.twitter.com/hvgByltM5I — Lookonchain (@lookonchain) November 22, 2023 BLUR&#8217;s recent price surge followed a consolidation phase, indicating market indecision as its value consistently traded below a critical resistance level. The subsequent airdrop triggered a substantial increase in token ownership, particularly among major stakeholders, signaling a surge in bullish sentiment and highlighting positive prospects for BLUR&#8217;s long-term potential. New Yearly High Still In The Cards Notably, experienced investors, possibly foreseeing enduring value, have actively engaged in sizeable BLUR positions, emphasizing a deliberate and informed move in response to the cryptocurrency&#8217;s potential. The charts tell a tale of cautious optimism evolving into confidence in BLUR&#8217;s future. The consolidation phase hinted at a market awaiting direction, and the subsequent increase in token volume, especially post-airdrop, indicates a shift toward positivity. BLURUSD trading at $0.620 on the 24-hour chart: TradingView.com Though there has been a noticeable rising trend, BLUR has not yet hit a new annual high. Since February, BLUR has been trading below a trend line of declining resistance. The decline reached a low on August 17 at $0.15. After that, the price started to rise, reaching a higher low on October 12. It emerged from the trend line of downward resistance after five days. The trend line had been in place for 245 days at that point. As more investors became aware of the increase in activity, they might have joined the buying momentum that followed the airdrop. This kind of movement is common in the cryptocurrency space, where important transactions and news can cause asset values to fluctuate quickly. Keeping A Close Tab On The Crypto Even after substantial increases, BLUR is still warranting caution in this area. Waiting for confirmation of the bullish crossover could increase the risk-reward scenario for fresh long positions on a recovery off critical support zones, thus letting the RSI reset could be a good strategy. Blur seven-day price action. Source: Coingecko Related Reading: Binance Drama Causes Crypto Prices To Dance On The Edge – Details It will be very important to keep an eye on the important support level that is right now where the rise started. If the price of BLUR stays above this support, it could mean that the market has adjusted to the effects of the airdrop and is now setting a new price floor. But if this level doesn&#8217;t hold, the price might go back down to the next important support zone. This could be a good chance for people who missed the first wave to buy again. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Pexels"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-24T12:04:32.000Z",
    "title": "Wallet of Satoshi Removed from the App Store in the US",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/wallet-of-satoshi-removed-from-app-store-in-the-us/",
    "description": "<p>Wallet of Satoshi, known for its user-friendly interface and seamless Lightning Network integration, played a significant role in introducing users to the world of fast and low-cost Bitcoin transactions. Its removal from the App Store in the US is a stark reminder of the regulatory uncertainties and hurdles that continue to plague the cryptocurrency space. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/wallet-of-satoshi-removed-from-app-store-in-the-us/\">Wallet of Satoshi Removed from the App Store in the US</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]