[
  {
    "source": "CoinDesk",
    "date": "2023-09-20T21:58:13.000Z",
    "title": "Vivek Ramaswamy is Drafting a 'Crypto Policy Framework'",
    "url": "https://www.coindesk.com/policy/2023/09/20/vivek-ramaswamy-is-drafting-a-crypto-policy-framework/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Republican presidential candidate Vivek Ramaswamy will release a crypto policy paper."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-20T21:42:53.000Z",
    "title": "After Failed Bid to Reclaim Namesake Company, Ben 'Bitboy' Armstrong Asks Fans for Cash",
    "url": "https://decrypt.co/198021/after-failed-bid-reclaim-namesake-company-ben-bitboy-armstrong-asks-fans-cash",
    "description": "YouTuber Ben \"Bitboy\" Armstrong has received about $60,000 so far after a judge denied his emergency injunction to regain control."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-20T21:41:17.000Z",
    "title": "New DALL-E 3 Image Generator is a Big Upgrade—With Guardrails",
    "url": "https://decrypt.co/198035/new-dall-e-3-image-generator-is-a-big-upgrade-with-guardrails",
    "description": "OpenAI’s new model stands up well against MidJourney and SDXL, and refuses to mimic living artists."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T21:45:00.000Z",
    "title": "International financial group finds gaps in digital euro legislative package",
    "url": "https://cointelegraph.com/news/international-financial-group-finds-gaps-digital-euro-legislative",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7bf01a46-6f62-490b-84be-00e80fa5222e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Institute of International Finance looked at seven areas where digital euro legislation, which is being developed alongside the technology, is lacking.</p>\n                    <p><p>The Institute of International Finance (IIF) has published an assessment of the European Commission’s proposed legislation on the digital euro. It gave the bill middling marks.</p><p>The IIF is a financial industry global advocacy group headquartered in Washington, D.C. with members in 60 countries. It rated the digital euro bill <a href=\"https://cointelegraph.com/news/european-commission-aims-universal-acceptance-digital-euro-proposal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/european-commission-aims-universal-acceptance-digital-euro-proposal/amp\">introduced in June</a> and the impact assessment that accompanied it. The note is a follow-up to its comments submitted in June.</p><p>The IIF looked at seven areas. It considered six of those areas “partly addressed” by the proposed legislation. Some of the cost-benefit analysis was “basic and high-level,” while other aspects were dependent on previous studies or missing. </p><p>The mechanism suggested for financial stability and bank intermediation in the bill is holding limits. Those limits have yet to be set and it is unclear how they would be enforced, the IIF said. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ibm-offers-guidance-successful-implementation-digital-euro\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ibm-offers-guidance-successful-implementation-digital-euro/amp\">IBM offers guidance for successful implementation of digital euro</a></em></strong></p><p>Payment services providers (PSPs) would have limited ability to recover the costs of implementing digital euro services, such as connecting to the infrastructure and creating wallet software, and caps are placed on fees. Credit institutions would be required to provide basic digital euro services for free. Therefore, “economic and liability model challenges” were also found to be only partly addressed, the study found.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/96f818b2-82ef-4397-ab0b-887cc3724646.png\"><figcaption style=\"text-align: center;\">Digital euro development timeline. Source: ecb.europa.eu</figcaption></figure><p>Privacy controls on the digital euro have yet to be defined, the study noted, and it is not clear what PSPs will be required to do to meet the requirements, or if they it will even be possible for them at the time of introduction of the digital euro. Anti-Money Laundering and cybersecurity measures also remain to be established. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Institute of International Finance welcomes the opportunity to respond to the European Commission (EC) questionnaire on a potential euro-denominated central bank digital currency (CBDC). <a href=\"https://t.co/A1MF505OEH\">https://t.co/A1MF505OEH</a> <a href=\"https://twitter.com/IIF?ref_src=twsrc%5Etfw\">@IIF</a> <a href=\"https://twitter.com/hashtag/eurozone?src=hash&ref_src=twsrc%5Etfw\">#eurozone</a> <a href=\"https://twitter.com/hashtag/financialsystem?src=hash&ref_src=twsrc%5Etfw\">#financialsystem</a> <a href=\"https://twitter.com/hashtag/DigitalEuro?src=hash&ref_src=twsrc%5Etfw\">#DigitalEuro</a></p>— Fabien Risterucci (@FRProspektiv) <a href=\"https://twitter.com/FRProspektiv/status/1538083840023044096?ref_src=twsrc%5Etfw\">June 18, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Governance and conflicts of interest were not addressed in the legislation, the IIF said. As the bank supervisor and “issuer, administrator, and fee-setter for a digital euro,” the European Central Bank (ECB) could find itself in conflicting roles of regulator and operator. There is no independent oversight envisioned for it.</p><p>The IIF also repeated its position on interoperability. It said:</p><blockquote>“There is little-to-no value in settling for recreating parallel systems that could tie up capital and liquidity, face similar pain points, and be expensive. […] A CBDC would need to operate on platforms where other digital currencies otherwise operate.” </blockquote><p>The legislative proposal for the digital euro is being developed in tandem with its infrastructure. The digital euro is expected <a href=\"https://cointelegraph.com/news/ecb-sums-up-digital-euro-prototyping-exercise-as-it-nears-possible-pilot-launch\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ecb-sums-up-digital-euro-prototyping-exercise-as-it-nears-possible-pilot-launch/amp\">to be in the investigative phase</a> through October. After that, the ECB may decide to begin testing technical and business solutions. A live digital euro could only be issued after the passage of the legislation.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-heart-europe-crypto-city-guide-prague/\">Crypto City Guide to Prague: Bitcoin in the heart of Europe</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T21:50:25.000Z",
    "title": "Tether acquires 20% stake in German Bitcoin miner Northern Data in unusual equity deal: Report",
    "url": "https://cryptoslate.com/tether-acquires-20-stake-in-german-bitcoin-miner-northern-data-in-unusual-equity-deal-report/",
    "description": "<p>Stablecoin firm Tether is entering a $420 million deal involving artificial intelligence chips and an overseas Bitcoin crypto mining firm, Forbes reported on Sept. 20. Tether has not officially announced the investment. Rather, Forbes appears to have based its report on statements from Northern Data and its executives. That report indicates that Tether has spent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-acquires-20-stake-in-german-bitcoin-miner-northern-data-in-unusual-equity-deal-report/\">Tether acquires 20% stake in German Bitcoin miner Northern Data in unusual equity deal: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T22:00:05.000Z",
    "title": "Huobi Global Faces Risks As Investments In stUSDT Surge To $1.8 Billion",
    "url": "https://www.newsbtc.com/huobi-ht/huobi-global-faces-risks-as-investments-in-stusdt-surge-to-1-8-billion/",
    "description": "Huobi Global, a prominent cryptocurrency exchange, is at risk as investments in the staked USDT (stUSDT) project soar to $1.8 billion. The project, spearheaded by crypto entrepreneur Justin Sun, promises 5% returns tied to low-risk securities like government bonds.  However, according to a Bloomberg report, Huobi&#8217;s heavy involvement in the project raises concerns about the exchange&#8217;s ability to manage sudden outflows of funds and the transparency of its reserves.  Huobi&#8217;s Association With stUSDT Sparks Concerns And Triggers Institutional Withdrawals Per the report, Huobi&#8217;s close association with the stUSDT project has led to a significant transformation in the exchange&#8217;s crypto reserves.  Altering by this shift and the lack of transparency surrounding stUSDT, institutional traders have withdrawn a substantial portion of their crypto holdings from Huobi.  Related Reading: Bitcoin May Not See Lasting Bullish Momentum Until This Happens This withdrawal trend highlights the potential risks of Huobi&#8217;s concentration on the stUSDT platform. Notably, blockchain research firms have expressed concerns about the relative lack of transparency surrounding the stUSDT project. The absence of comprehensive information about its investments raises questions about the source and sustainability of the advertised 4.2% yield. Huobi&#8217;s reliance on the project exposes the exchange to problems that may arise within stUSDT, further magnifying its potential vulnerabilities. As investments in stUSDT have grown, Huobi&#8217;s Tether (USDT) reserves have plummeted, raising further concerns. While Huobi maintains that stUSDT is a separate project not overseen by the exchange, the heavy concentration of stUSDT in its reserves implies that Huobi&#8217;s fortunes are closely linked to the success or failure of the project.  The dominance of tokens associated with Justin Sun, such as TRON (TRX) and Huobi Token (HT), in Huobi&#8217;s reserves adds another risk layer, as market participants could perceive it as a higher exchange risk. Huobi Global&#8217;s Average Daily Trading Volume Plummets Institutional clients, including crypto funds and market makers, have expressed concerns about the dominance of stUSDT and other tokens associated with Justin Sun in Huobi&#8217;s reserves.  According to Bloomberg, these clients have withdrawn a significant portion of their digital assets from the exchange shortly after the launch of the staked Tether project. This departure from Huobi has contributed to a decline in the exchange&#8217;s average daily trading volume. The stUSDT project&#8217;s rapid growth and lack of transparency raise questions about its underlying investments and the sustainability of its returns. Investors and industry experts emphasize the importance of increased transparency and oversight to understand the sources of yield and mitigate potential risks. Per the report, the project&#8217;s management team intends to engage a reputable third-party verification entity to enhance community oversight. However, further details about the project&#8217;s structure and employees remain scarce. Related Reading: Bitcoin Bulls Could Buck Downtrend With Move To $42,000 What is certain is that Huobi Global&#8217;s involvement in the stUSDT project has significantly impacted the composition of its reserves, raising concerns among institutional traders and industry experts.  The heavy concentration of stUSDT, TRX, and HT tokens in Huobi&#8217;s reserves and the lack of transparency surrounding the project pose potential risks to the exchange&#8217;s financial stability.  To alleviate these concerns, greater transparency and oversight are essential, ensuring the sustainability and credibility of the stUSDT project and Huobi&#8217;s operations in the evolving crypto landscape. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-20T22:01:01.000Z",
    "title": "Stanford University Says It Will Return All of Sam Bankman-Fried’s Donations: Bloomberg",
    "url": "https://dailyhodl.com/2023/09/20/stanford-university-says-it-will-return-all-of-sam-bankman-frieds-donations-bloomberg/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/ftx-reboot-new.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Stanford University will reportedly return millions of dollars worth of gifts it received from bankrupt crypto exchange platform FTX. According to a new report by Bloomberg, a spokesperson for Stanford says that the California university will be returning the donated money in its entirety so those affected by the downfall of FTX can recover their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/stanford-university-says-it-will-return-all-of-sam-bankman-frieds-donations-bloomberg/\">Stanford University Says It Will Return All of Sam Bankman-Fried’s Donations: Bloomberg</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]