[
  {
    "source": "CoinDesk",
    "date": "2024-03-05T17:01:04.000Z",
    "title": "Crypto AI Startup Sahara Raises $6M to Reward AI Trainers",
    "url": "https://www.coindesk.com/tech/2024/03/05/crypto-ai-startup-sahara-raises-6m-to-reward-ai-trainers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sahara co-founder Sean Ren says his tech can help workers and businesses get compensated for their knowledge, data and expertise in the age of AI."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-05T16:55:23.000Z",
    "title": "Bitcoin ETF Giant Grayscale Introduces a Crypto Staking Fund",
    "url": "https://www.coindesk.com/business/2024/03/05/bitcoin-etf-giant-grayscale-introduces-a-crypto-staking-fund/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Grayscale Dynamic Income Fund initially includes APT, TIA, CBETH, ATOM, NEAR, OSMO, DOT, SEI and SOL."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-05T17:03:55.000Z",
    "title": "Bitcoin Crashes 6% After Hitting New All-Time High Price",
    "url": "https://decrypt.co/220227/bitcoin-crashes-after-hitting-new-all-time-high-price",
    "description": "In the past hour alone, $32 million long positions have been liquidated. "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-05T16:59:11.000Z",
    "title": " BTC price corrects 7% after Bitcoin sets first pre-halving all-time high ",
    "url": "https://cointelegraph.com/news/btc-price-corrects-bitcoin-pre-halving-all-time-high",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZWI5MjlkOTUtYWI5Yy00YzM5LWE5M2ItMWY2NWVlMWI5NWEwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin is making history — but this is not stopping a post-high BTC price comedown.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) fell $5,000 on March 5 after a unique BTC price all-time high sparked mass volatility.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCGBP/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked snap losses for BTC/USD as the pair shed 6.7% in just over an hour.</p><p>The reaction followed <a href=\"https://cointelegraph.com/news/bitcoin-price-sets-new-record-high-69k\">new all-time highs for Bitcoin</a>, with bulls waiting since November 2021 for BTC price discovery.</p><p><a href=\"https://cointelegraph.com/news/btc-price-corrects-bitcoin-pre-halving-all-time-high\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-05T16:54:41.000Z",
    "title": "Montenegro blocks Do Kwon extradition again following successful appeal",
    "url": "https://cryptoslate.com/montenegro-blocks-do-kwon-extradition-again-following-successful-appeal/",
    "description": "<p>Terraform Labs co-founder Do Kwon&#8217;s extradition to the US was annulled by the Appellate Court of Montenegro, according to a Mar. 5 notice on the Court&#8217;s website. This development occurs amid bankrupt Terraform Labs&#8217; recent legal wrangle with the US SEC. Why was Kwon&#8217;s extradition annulled? According to the Court, the High Court of Podgorica&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/montenegro-blocks-do-kwon-extradition-again-following-successful-appeal/\">Montenegro blocks Do Kwon extradition again following successful appeal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-05T17:01:04.000Z",
    "title": "AI-related tokens see 257% average growth since January",
    "url": "https://cryptobriefing.com/ai-tokens-surge-valuation-growth/",
    "description": "AI tokens like TAO, RNDR, and NOS have surged in market cap, with TAO leading at $3.85 billion and NOS gaining 988% in price"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-05T16:40:38.000Z",
    "title": "Bitcoin breaks $69,000 and registers a new all-time high",
    "url": "https://cryptobriefing.com/bitcoin-breaks-69000-registers-new-alltime-high/",
    "description": "Crypto industry voices share their insights on what's next for Bitcoin."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-05T17:03:49.000Z",
    "title": "Polkadot’s Uniquely Decentralized Community Governance Model Accelerates Ecosystem Traction",
    "url": "https://cryptodaily.co.uk/2024/03/polkadots-uniquely-decentralized-community-governance-model-accelerates-ecosystem-traction",
    "description": "Polkadot, the blockchain ecosystem devised by Ethereum co-founder Gavin Wood, has laid the foundations for a network that could ultimately become more decentralized than any of its peers."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-05T16:47:54.000Z",
    "title": "Steam Introduces Game Privacy Features in Latest Update",
    "url": "https://www.cryptopolitan.com/steam-introduces-game-privacy-features/",
    "description": "Steam with its latest update, introduces a notable enhancement to the platform&#8217;s shopping functionality. This update, implemented by Valve, significantly improves the overall shopping experience for users. Among the key features introduced is integrating a shared shopping basket across all devices, facilitating effortless access and efficient management of desired purchases. This innovation addresses a longstanding [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-05T17:04:40.000Z",
    "title": "Do Kwon’s US extradition stricken by Montenegro court",
    "url": "https://crypto.news/do-kwon-united-states-extradition/",
    "description": "The Montenegro Court of Appeals has ruled against fugitive Do Kwon's extradition to the United States to face fraud charges."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-05T16:54:22.000Z",
    "title": "Solana becomes 4th largest crypto following blitz past $140",
    "url": "https://crypto.news/solana-crypto-140-2024/",
    "description": "Solana followed Bitcoin’s rally on Mar. 4, gaining as much as 7% in 24 hours and usurping Binance’s BNB coin for a higher rank among the top five cryptocurrencies."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-05T17:00:37.000Z",
    "title": "Bitcoin Mining Firm CEO Predicts Start Of ‘Supercycle’, What It Means",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-mining-ceo-start-of-supercycle/",
    "description": "In a series of statements made on X (formerly Twitter), Marc van der Chijs, the CEO of the publicly traded Bitcoin mining firm Hut 8, shared an optimistic outlook on the future of Bitcoin, suggesting that the cryptocurrency may be on the brink of a &#8216;supercycle.&#8217; &#8220;I think I have never been more bullish about Bitcoin than I am right now,&#8221; he remarked, pointing to the cryptocurrency&#8217;s recent performance and the absence of widespread hype as a prelude to what he terms a &#8216;supercycle.&#8217; Understanding the concept of a &#8216;supercycle&#8217; is crucial to grasping van der Chijs&#8217; perspective. Unlike regular market cycles that see periodic rises and falls, a supercycle in the Bitcoin domain refers to an extended period of bullish growth over several years. This phase is characterized by a substantial increase in adoption, demand, and price, often leading to far-reaching economic implications. In essence, a supercycle marks a paradigm shift where the asset&#8217;s value escalates dramatically, supported by a continuous inflow of investment and a growing consensus about its long-term viability. To come to this conclusion, Van der Chijs&#8217; prediction hinges on several observations and trends within the Bitcoin sector. Why A Bitcoin Supercycle Could Be Possible First, he notes a significant shift towards Bitcoin ETFs by funds, including yesterday’s landmark announcement from Blackrock&#8217;s Strategic Income Opportunities Fund. This movement signifies a robust institutional interest that could feed a constant stream of investment into Bitcoin, setting the stage for a supercycle. “This will be a constant flow of new money into the ETFs. [&#8230;] The flows into the ETF are getting bigger, not smaller,” van der Chijs remarked. With financial advisors poised to recommend Bitcoin ETFs to clients following a regulatory settling period, van der Chijs sees a torrent of new capital on the horizon. This anticipation is not unfounded, considering the groundbreaking success of the Bitcoin ETF launch, which he cites as &#8220;the most successful ETF launch ever.&#8221; Related Reading: $1.3+ Trillion: Bitcoin Market Cap Sets New Record All-Time High Corporate strategies around Bitcoin also play a pivotal role in van der Chijs&#8217; supercycle theory. He points to Microstrategy&#8217;s aggressive leverage-based Bitcoin purchases as a harbinger of a trend where companies increasingly view Bitcoin not just as an investment, but as a fundamental aspect of their financial strategy. This shift, according to van der Chijs, could prompt other CEOs to follow suit, further accelerating Bitcoin&#8217;s ascendancy. Moreover, a critical mass of financial advisors is on the brink of recommending Bitcoin ETFs to clients, pending the expiration of regulatory and due diligence waiting periods. This opens the gates for substantial new investments from a segment traditionally cautious about direct cryptocurrency investments. “They can’t sell the ETF during the first 90 working days (internal regulations mostly because of DD), although they are fast tracking it for this ETF,” van der Chijs stated. FOMO And A Self-Fulfilling Prophecy The speculation around unidentified large-scale Bitcoin acquisitions adds another layer to the supercycle narrative. Van der Chijs alludes to the intrigue surrounding a wallet that has been steadily accumulating Bitcoin, hinting at the involvement of a billionaire possibly akin to Jeff Bezos. &#8220;Since November 2023 a wallet has been adding on average about 100 BTC per day, the wallet now contains over 50,000 BTC,&#8221; he states, pointing to the potential for influential figures to catalyze broader market movements. Another argument is potential purchases by nation-states. Although nation-state involvement in Bitcoin has been minimal, with El Salvador being a notable example, any increase in such activities could trigger a domino effect. The participation of nation-states in the Bitcoin market could significantly elevate Bitcoin&#8217;s status as a sovereign asset class. Related Reading: Bitcoin Proves European Central Bank Wrong: Hits All-Time High Against Euro Next, the retail sector remains largely on the sidelines in the current cycle, but van der Chijs anticipates a surge in retail interest following new all-time highs and increased media coverage. This could initiate a FOMO cycle, drawing more investment from traditional asset classes into Bitcoin. Last, van der Chijs mentions the concept of a self-fulfilling prophecy: As Bitcoin continues to rise without significant dips due to constant new money inflow, more people and institutions will entertain the concept of a supercycle. This, in turn, could lead to increased capital allocation to Bitcoin, making the supercycle more likely. Macroeconomic Implications Of A Supercycle Van der Chijs’ theory also touches on the potential macroeconomic implications of a Bitcoin supercycle, predicting a significant shift in wealth and power structures. The redistribution of wealth could see Bitcoin at the center of a new economic order, with traditional asset classes potentially losing ground. In conclusion, Marc van der Chijs outlines a compelling case for a forthcoming Bitcoin supercycle, supported by a confluence of institutional, corporate, speculative, and retail trends. He acknowledged the speculative nature of his prediction, “Right now I think there is a chance of maybe 10% that this will happen and that chance is (very slowly) going up.” However, the implications could be massive. “[I]t will change the existing world order. It will suck money out of the stock and bond markets, out of gold and other commodities, and even out of real estate (global housing prices could collapse). This will lead to BTC prices that we can&#8217;t even imagine today, potentially millions of dollars per BTC.” At press time, BTC traded at $67,806. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-05T16:51:23.000Z",
    "title": "Cardano’s Charles Hoskinson Shows Full Support for XRP Lawyer John Deaton’s Senate Bid",
    "url": "https://www.crypto-news-flash.com/cardanos-charles-hoskinson-shows-full-support-for-xrp-lawyer-john-deatons-senate-bid/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-charles-hoskinson-shows-full-support-for-xrp-lawyer-john-deatons-senate-bid",
    "description": "<img width=\"2048\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Charles Hoskinson\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-1536x1152.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-24x18.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-36x27.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-48x36.jpg 48w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />XRP lawyer John Deaton has launched his campaign against anti-crypto Elizabeth Warren for the Massachusetts Senate seat. Deaton has received massive support from the crypto community, most recently from Cardano co-founder Charles Hoskinson, who donated over $3,000. An XRP lawyer has recently announced that he is challenging Democratic U.S. Sen. Elizabeth Warren. John Deaton, who [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-05T17:00:00.000Z",
    "title": "NGN Trading Halted on Binance Amid Tensions with Nigerian Authorities",
    "url": "https://coinedition.com/ngn-trading-halted-on-binance-amid-tensions-with-nigerian-authorities/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"NGN Trading Halted on Binance\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The largest crypto exchange, Binance, announced it was shutting down all Nigerian Naira (NGN) trading services on its platform. According to the announcement, starting at 14:00 UTC on March 5, Binance will cease deposits of NGN. In parallel, Binance will discontinue withdrawals and conversions of NGN starting Friday, March 8. The exchange emphasized that any [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ngn-trading-halted-on-binance-amid-tensions-with-nigerian-authorities/\">NGN Trading Halted on Binance Amid Tensions with Nigerian Authorities</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]