[
  {
    "source": "NewsBTC",
    "date": "2024-01-27T00:00:25.000Z",
    "title": "Binance Smart Chain (BSC) Market Cap Hits New Milestone, Registering 48% QoQ Surge",
    "url": "https://www.newsbtc.com/binance-smart-chain/binance-smart-chain-bsc-market-cap-hits-new-milestone-registering-48-qoq-surge/",
    "description": "Binance Smart Chain (BSC) has demonstrated notable growth in key metrics during the fourth quarter (Q4) of 2023, as highlighted in a comprehensive report by Messari.  As the third-largest Layer-1 protocol by market capitalization, BSC experienced positive progress across its financial indicators, signaling a productive quarter for the blockchain ecosystem. Binance Smart Chain Record-Breaking Transactions The report reveals that BSC&#8217;s market capitalization witnessed a 48% quarter-over-quarter (QoQ) surge. This surge reflects renewed interest in BNB (Binance Coin), the native asset of BSC, following two consecutive quarters of decline. Moreover, BSC&#8217;s revenue measured in USD experienced a significant QoQ growth of 27%. This revenue surge, amounting to over $39 million in Q4, indicates increased activity on the protocol and the implementation of various initiatives throughout the year. Related Reading: Prepare For Impact: US Government Will Dump $130 Million Worth Of Bitcoin Gas fees burned in BNB, a metric reflecting network activity, also saw a notable QoQ increase of 21%. The rising number of transactions and smart contract interactions contributed to increased gas fees burned, further reinforcing the Binance Smart Chain ecosystem. In addition to financial metrics, BSC showcased impressive improvements in other areas. The number of active validators increased by 25% QoQ, highlighting growing trust and participation in securing the network. BSC&#8217;s commitment to decentralization was evident as the protocol experienced a 54% YoY increase in active validators. According to Messari, throughout 2023, BSC demonstrated its ability to handle heightened activity while simultaneously reducing costs for users. Daily transactions on the network witnessed a 35% year-over-year (YoY) increase and a 30% QoQ surge, averaging around 4.6 million transactions per day in Q4.  These spikes in transaction volume were attributed to inscription-related activity, with BSC processing a record-breaking 32 million transactions on December 7, 2023. BSC&#8217;s DeFi Ecosystem Reaches $4.6 Billion TVL Despite a decline in daily average active addresses and new unique addresses, primarily due to users exploring alternative chains like opBNB, BSC&#8217;s on-chain activity remained robust.  The protocol&#8217;s ecosystem of stablecoins, dominated by Tether’s USDT, reached a total value locked (TVL) of $4.6 billion in Q4, showcasing a 33% QoQ increase in Decentralized Finance (DeFi) TVL. Related Reading: Bitcoin Capitulation: Holders Flee BTC As Post-ETF Disappointment Hits While Non-Fungible Token (NFT)- related metrics declined in Q4, Binance Smart Chain and Ethereum (ETH) witnessed a resurgence in activity toward the end of the quarter, indicating a potential upward trend in the next market cycle. In addition to BSC’s growth, BNB also experienced notable price movements. After a sharp drop, BNB surged from $238 to reach the $338 level. However, it later retraced to $287 following a correction.  In the past 24 hours, BNB has recorded a growth of 3.7%, pushing its current trading price above $302.  Featured image from Shutterstock, chart from TradingView.com "
  }
]