[
  {
    "source": "CoinDesk",
    "date": "2024-01-24T10:25:02.000Z",
    "title": "Someone Just Put 90s Darling Game DOOM on Dogecoin",
    "url": "https://www.coindesk.com/markets/2024/01/24/someone-just-put-90s-darling-game-doom-on-dogecoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Ordinals technology native to the Dogecoin blockchain is allowing developers to bring utility to the meme token’s network."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T10:31:42.000Z",
    "title": "Mexico’s IFE Conference Pioneers AI Integration in Higher Education",
    "url": "https://www.cryptopolitan.com/ife-conference-ai-in-higher-education/",
    "description": "The Instituto Tecnológico de Monterrey&#8217;s Institute for the Future of Education (IFE) host the 10th edition of its renowned conference in Mexico from January 23 to 24, 2024. This milestone event will revolve around the theme of &#8220;Education in the Age of Artificial Intelligence,&#8221; aiming to elevate educational quality and accessibility on a global scale.  [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T10:26:48.000Z",
    "title": "SEC intensifies legal demands on Ripple in ongoing case",
    "url": "https://www.cryptopolitan.com/sec-intensifies-legal-demands-on-ripple/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has intensified its demands against Ripple, a prominent player in the cryptocurrency sphere. The SEC has filed a new motion to compel Ripple to produce financial documents and details of post-complaint XRP sales contracts. This recent development marks a significant escalation in the SEC&#8217;s legal strategy as it [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T10:24:39.000Z",
    "title": "The Evolution of Crypto Staking Platforms: Unlocking Passive Income Opportunities with CoinDepo",
    "url": "https://www.cryptopolitan.com/the-evolution-of-crypto-staking-platforms-unlocking-passive-income-opportunities-with-coindepo/",
    "description": "In simple terms, staking is a source of passive income from holding crypto or stablecoins in your account. The entire process is based on the Proof of Stake (PoS) algorithm. Using PoS, you can protect the blockchain from interference and unreliability of the posted data. In return, users receive incentives calculated as a percentage of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T10:22:03.000Z",
    "title": "Experience the Ultimate Crypto Gambling Adventure with HugeWin Casino",
    "url": "https://www.cryptopolitan.com/experience-the-ultimate-crypto-gambling-adventure-with-hugewin-casino/",
    "description": "With the growing popularity of crypto gambling, it is close to impossible to stay away from the movement. Thus, many crypto enthusiasts decide to try out a Bitcoin casino to learn what crypto gambling is about and earn new tokens through fun and engaging gambling games. However, it takes so much for a crypto casino [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T10:10:32.000Z",
    "title": "SAP Shifts Focus Towards AI, Announces Restructuring",
    "url": "https://www.cryptopolitan.com/sap-shifts-focus-towards-ai/",
    "description": "In a significant move towards artificial intelligence, German software giant SAP has announced a comprehensive restructuring plan. The plan, unveiled on January 23, involves a €2 billion restructuring of 8,000 roles within the company. This strategic shift underscores SAP&#8217;s commitment to AI-driven business areas, reflecting the industry&#8217;s evolving landscape. SAP&#8217;s commitment to AI SAP, a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T10:30:51.000Z",
    "title": "XRP Bears Looming: Analyst Predicts Potential Drop To $0.28",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-bears-looming-analyst-predicts-potential-drop-to-0-28/",
    "description": "Amid the bearish sentiment encompassing the crypto market, XRP has experienced a notable decline to the pivotal $0.51 price, which has led to several predictions from analysts concerning the price action of the token. Could The Price Of XRP Fall To $0.28? One of the well-known crypto analysts who has shared a daring prediction regarding the price action of XRP is JD. JD recently took to the social media platform X (formerly Twitter) to share his insights on the crypto asset with the crypto community. Related Reading: Is XRP Price At $20 Possible? Crypto Analyst Predicts Stunning Move In his projections, the analyst looked at the potential for additional declines in an attempt to forecast where XRP will go next. According to JD, the digital asset might be forming a &#8220;hidden bullish divergence&#8221; on a weekly basis. On the weekly period, JD pointed out that XRP has been trapped in a symmetrical triangular pattern since 2021. His chart&#8217;s data indicates that the crypto asset is presently moving toward the direction of the triangle&#8217;s lower trendline. JD highlighted an orange box he drew in November of last year, which overlaps the bottom trendline. The analyst also noted that the orange box is situated between Fibonacci 0.618 and 0.786. The box, according to him, is a desirable level for dollar-cost averaging (DCA) move, and a decline into the box is conceivable. He stated that once XRP hits the box, he intends to open a &#8220;buy-the-dip&#8221; campaign, &#8220;heavily&#8221; filling his bags around $0.28 and $0.33. He also mentioned several other price levels for his personal DCA, such as $0.45, $0.51, and $0.59. This simply suggests that the analyst is confident about the asset in the long run. The post read: A wick down the orange box is very possible. (Orange box has been posted since November 2023). My personal DCA: 0.28 &#8211; 0.33 (HEAVILY!), 0.45, 0.51, 0.59. Nonetheless, he has urged the community not to time the bottom and highlighted a signal for investors to buy more XRP. &#8220;Don&#8217;t time bottom. When &#8216;Dumb Money&#8217; complains, during the fear, that&#8217;s the signal to buy more,&#8221; he stated. Floor Price For The Digital Asset Even though the entire crypto market is currently experiencing a bearish trend, XRP is one of the most affected assets. The trend is mostly attributed to the waning enthusiasm around the Bitcoin Spot Exchange-Traded Funds (ETFs). The token has recently experienced severe losses, falling below the $0.55 support level. Due to the trend, analysts are now predicting significant drops in XRP&#8217;s valuation in the upcoming days. Another analyst who has predicted a decline in the price of the asset is XRP Shark. According to the analyst, the token could fall to a price level between $0.35 and $0.45. Related Reading: XRP Could Hit $0.39 Before Soaring 1000%: Crypto Analyst He believes that the aforementioned levels are the &#8220;bottom area&#8221; of the decline. However, XRP Shark has expressed optimism toward the token, while noting a &#8220;violent&#8221; recovery. As of the time of writing, XRP was sitting at $0.5129, demonstrating a decline of 10.27% in the past week. Despite the decline, its trading volume is presently up by over 15% in the past 24 hours. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-24T10:37:44.000Z",
    "title": "Revel In a World of Possibilities with HugeWin Casino",
    "url": "https://coinedition.com/revel-in-a-world-of-possibilities-with-hugewin-casino/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/Hugewin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/Hugewin.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/Hugewin-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Online business is starting to dominate most business areas today. With just a few clicks, we can solve most of the problems that until recently required us to commute and waste a lot of time. This shift is evident in the casino industry as well number of online casinos to choose from, providing an alternative [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/revel-in-a-world-of-possibilities-with-hugewin-casino/\">Revel In a World of Possibilities with HugeWin Casino</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-24T10:15:38.000Z",
    "title": "Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin",
    "url": "https://dailyhodl.com/2024/01/24/analyst-says-ethereum-massive-bullish-reversal-signal-flashing-updates-forecast-on-bitcoin-and-one-low-cap-altcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/eth-bottom-already-bull.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist says that Ethereum (ETH) is giving off a bullish reversal signal when paired against Bitcoin (ETH/BTC). Trader Michaël van de Poppe tells his 685,700 followers on the social media platform X that he thinks Ethereum will outperform Bitcoin in the coming weeks. According to the analyst, ETH/BTC is flashing a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/24/analyst-says-ethereum-massive-bullish-reversal-signal-flashing-updates-forecast-on-bitcoin-and-one-low-cap-altcoin/\">Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]