[
  {
    "source": "CryptoSlate",
    "date": "2023-11-23T22:18:46.000Z",
    "title": "SBF housed with ex-Honduras president in jail, is trading mackerel and giving crypto tips",
    "url": "https://cryptoslate.com/sbf-housed-with-ex-honduras-president-in-jail-is-trading-mackerel-and-giving-crypto-tips/",
    "description": "<p>The Wall Street Journal published an update on the prison living conditions of Sam Bankman-Fried, FTX&#8217;s co-founder and ex-CEO, on Nov. 23. The newspaper said that Bankman-Fried has been placed in a dormitory with Juan Orlando Hernández, a former Honduran president who is awaiting trial over acceptance of bribes from drug traffickers. Both appear to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sbf-housed-with-ex-honduras-president-in-jail-is-trading-mackerel-and-giving-crypto-tips/\">SBF housed with ex-Honduras president in jail, is trading mackerel and giving crypto tips</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T22:39:34.000Z",
    "title": "HTX services to resume 24 hours after massive hack",
    "url": "https://www.cryptopolitan.com/htx-service-to-resume-24h-after-massive-hack/",
    "description": "In a swift response to a major cybersecurity breach, HTX, formerly known as Huobi Global, has announced its intention to resume deposit and withdrawal services within 24 hours following a significant exploit. The crypto exchange, reeling from a $13.6 million hack, has assured users of full compensation for losses and the utmost security of their ... <a title=\"HTX services to resume 24 hours after massive hack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/htx-service-to-resume-24h-after-massive-hack/\" aria-label=\"More on HTX services to resume 24 hours after massive hack\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T22:24:51.000Z",
    "title": "Bitcoin ETF banter: How to approach the topic this thanksgiving",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-banter-this-thanksgiving/",
    "description": "Thanksgiving dinner is often a time for family, feasting, and sometimes, financial discussions. This year, as you pass the turkey and cranberry sauce, the conversation might just turn to the hottest topic of the financial world: Bitcoin ETFs. With Uncle Frank bringing up BlackRock&#8217;s efforts to launch a bitcoin ETF, it&#8217;s an opportunity to delve ... <a title=\"Bitcoin ETF banter: How to approach the topic this thanksgiving\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etf-banter-this-thanksgiving/\" aria-label=\"More on Bitcoin ETF banter: How to approach the topic this thanksgiving\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T22:25:07.000Z",
    "title": "Fake Elon Musk YouTube streams lead to $165k crypto scam",
    "url": "https://crypto.news/fake-elon-musk-youtube-streams-lead-to-165k-crypto-scam/",
    "description": "In a joint effort, SpaceX and BitOK have revealed a fraudulent crypto giveaway orchestrated by scammers impersonating Elon Musk, who managed to raise $165,000 in donations. The scheme was said to involve a deepfake version of Elon Musk in live&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T22:30:52.000Z",
    "title": "From Crypto To Catch: Disgraced FTX Founder Turns To Trading Fish In Prison",
    "url": "https://www.newsbtc.com/ftx/from-crypto-to-catch-disgraced-ftx-founder-turns-to-trading-fish-in-prison/",
    "description": "According to a report by Business Insider, Sam Bankman-Fried (SBF), co-founder and former CEO of FTX, has adapted to the economic system of New York&#8217;s Metropolitan Detention Center (MDC), where he is currently awaiting sentencing on multiple felony counts.  The disgraced crypto-billionaire has reportedly been bartering, using food as currency in exchange for various services within the prison. Former FTX CEO SBF Trades Fish For Services Per the report, mackerel, a fish commonly referred to as &#8220;macks&#8221; among inmates, emerged as the currency of choice in federal prisons after cigarettes were banned. The fish&#8217;s popularity stems from its stability and value within the prison economy.  Formerly incarcerated individuals like attorney Larry Levin have accepted mackerel as payment from fellow prisoners, using it to acquire services such as beard trims and shoe shines.  The demand for mackerel became so significant that suppliers, including Global Source Marketing, witnessed increased sales, according to Business Insider. Related Reading: AVAX Holders Beware: $204 Million Token Unlock Could Trigger Price Crash Today In a prison environment where inmates lack access to traditional or digital currency, products with steady value, such as certain food items and stamps, serve as substitutes for money.  Mackerel and other stable commodities like tuna become a means of exchange, with their value pegged to the dollar. This economic logic allows inmates to engage in various transactions while maintaining a semblance of a barter system. The use of fish as a medium of exchange in federal prisons has been widespread since 2004, following the cigarette ban.  Sam Bankman-Fried faces sentencing on March 28, 2024, for charges that include wire fraud and conspiracy to commit money laundering, with a potential prison term of up to 110 years. Additionally, SBF is set to stand trial for separate counts related to political bribery.  FTT Surges with Impressive Gains FTT, the native token of the FTX cryptocurrency exchange, has seen a remarkable surge in value in recent weeks. With substantial gains across various timeframes and an impressive market capitalization of 1.5 billion, FTT has cemented its position among the top 50 tokens in the crypto market.  Related Reading: Is Dogecoin About To Reverse? Key Factors To Watch Over the past 24 hours, FTT has experienced a significant increase of 21%, showcasing the token&#8217;s upward momentum. This short-term surge is complemented by a strong performance over the past week, with a notable rise of 26%.  However, the real standout lies in FTT&#8217;s gains over the past 14 and 30 days. Within the last two weeks, FTT has skyrocketed by an impressive 100%, while the 30-day timeframe has seen an astounding surge of 315%.  These gains highlight the growing demand and investor interest in FTT as rumors of a possible reboot of the exchange circulate within the crypto community. Featured image from Bloomberg, chart from TradingView.com "
  }
]