[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T09:00:00.000Z",
    "title": "Crypto Investing Platform Finblox Starts Offering Tokenized Treasury Yield With OpenEden",
    "url": "https://www.coindesk.com/business/2023/06/13/crypto-investing-platform-finblox-starts-offering-tokenized-treasury-yield-with-openeden/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Demand for tokenized versions of short-term U.S. government bonds has been increasing as crypto investors turn to real-world assets to earn returns on their investments."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T08:39:40.000Z",
    "title": "How Peter McCormack is turning an unknown town into a Bitcoin hub",
    "url": "https://cointelegraph.com/news/how-peter-mccormack-is-turning-an-unknown-town-into-a-bitcoin-hub",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f2ba8853-4c01-4a93-9582-f834eb651726.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin pitch invasion! A new Cointelegraph video examines a local soccer club’s impact on its town and national Bitcoin adoption.</p>\n                    <p><p>Can a football team backed by Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) really raise up a town? In the latest Cointelegraph documentary, reporter Joe Hall investigates the <a href=\"https://cointelegraph.com/news/bitcoin-soccer-club-real-bedford-fc-wins-the-league\">impact of a Bitcoin football club</a>, Real Bedford, on the small commuter town of Bedford in the United Kingdom.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/Yn7gaq6F2Jw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/peter-mccormack\">Peter McCormack</a>, the renowned host of the <em>What Bitcoin Did</em> podcast, <a href=\"https://cointelegraph.com/news/peter-mccormack-acquires-local-sports-club-bedford-fc-with-premier-league-ambitions\">bought Real Bedford Football Club in 2021</a> during the peak of the Bitcoin bull run. </p><p>While many questioned his decision, McCormack saw an opportunity to revive a football club and promote Bitcoin adoption in his hometown. Two years later, Real Bedford F.C. has gained promotion, secured significant sponsorships, and attracted a legion of local and international fans.</p><p>As the video demonstrates, the club’s bright orange jerseys proudly display the Bitcoin logo, symbolizing its close association with the world’s largest digital currency. Before each game, Bitcoin meetups are organized and influential figures from the Bitcoin world are invited to attend. </p><p>Naturally, the manager’s unconventional approach has sparked curiosity and criticism, with some locals skeptical of the Bitcoin branding and its implications. Hall asks locals in street interviews and pitchside conversations how much influence the club has had on the town. Some are familiar with the club’s Bitcoin takeover and others had never heard of McCormack, but the overarching sentiment was negative. </p><p>McCormack, however, aims to <a href=\"https://cointelegraph.com/news/global-impact-of-a-bitcoin-soccer-club-decentralize-with-cointelegraph\">dispel misunderstandings and facilitate greater Bitcoin adoption</a> through the football club. Rather than forcing the currency on the town’s residents, he believes in using the team as a Trojan horse to gradually introduce them to Bitcoin. The Real Bedford website even features a statement titled “Why you shouldn’t buy Bitcoin,” emphasizing the importance of education and responsible investment.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Trojan football ‍☠️ <a href=\"https://t.co/fh77fufvcx\">pic.twitter.com/fh77fufvcx</a></p>&mdash; Peter McCormack‍☠️ (@PeterMcCormack) <a href=\"https://twitter.com/PeterMcCormack/status/1645844890469761024?ref_src=twsrc%5Etfw\">April 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While Real Bedford remains a Bitcoin-only club, McCormack acknowledges the allure of other cryptocurrencies and crypto-related projects:</p><blockquote>“If I did a shitcoin, I could raise a billion, and I would get this club in the Premier League in nine years because you have the money to do it. I could build a £200 million stadium if I did a shit coin. It’s really tempting.”</blockquote><p>Nonetheless, McCormack is committed to Bitcoin’s principles. He is convinced that through hard work and the support of the Bitcoin community, Real Bedford can reach the Premier League in the 2030s.</p><p>Featuring interviews with Jeff Booth, Ben Arc, fans and locals, The Real Bedford documentary will shed light on the team’s story, showcasing the transformative power of Bitcoin in sports and local communities. </p><p>As the United Kingdom government warms up to central bank digital currencies — <a href=\"https://cointelegraph.com/news/uk-bitcoin-community-reacts-to-incoming-cbdc-and-digital-pound-rollout\">despite the Bitcoin community’s warnings</a> — Bitcoin could lose a foothold in the country. In such an environment, Real Bedford is increasingly a beacon for Bitcoin adoption in the United Kingdom. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-soccer-club-real-bedford-fc-wins-the-league\"><strong><em>Bitcoin soccer club Real Bedford FC wins the league</em></strong></a></p><p>Overall, to pinch Barcelona’s motto, Real Bedford is “mes que un club” or “more than a club.” It’s a symbol of resilience, rebellion and a real-world example of Bitcoin’s ability to raise up areas.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T09:05:49.000Z",
    "title": "BOE faces challenge as yields skyrocket following disappointing jobs report",
    "url": "https://cryptoslate.com/insights/boe-faces-challenges-following-disappointing-jobs-report/",
    "description": "<p>Quick Take The UK jobs report was released today (June 13,) with unemployment reaching a low of 3.8%, which was lower than the forecasted 4%. Other metrics indicate wage-price spirals and persistent inflation, complicating the Bank of England&#8217;s efforts to manage the economy. Controlling inflation in the UK may require an economic downturn, notably a recession. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/boe-faces-challenges-following-disappointing-jobs-report/\">BOE faces challenge as yields skyrocket following disappointing jobs report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T08:57:00.000Z",
    "title": "Ordinals 2.0 reduces bloat, brings smart contract-like functionality to inscriptions",
    "url": "https://cryptoslate.com/ordinals-2-0-reduces-bloat-brings-smart-contract-like-functionality-to-inscriptions/",
    "description": "<p>Ordinals are creating a paradigm shift in Bitcoin functionality, with the potential to unlock greater possibilities in digital asset management, NFTs, and collectibles. As the Ordinals project evolves, the integration of recursion establishes new opportunities for the creation of complex, interactive content on the Bitcoin blockchain. Labeled &#8220;Ordinals 2.0&#8221; by Bitcoin personality Dan Held, recursion [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ordinals-2-0-reduces-bloat-brings-smart-contract-like-functionality-to-inscriptions/\">Ordinals 2.0 reduces bloat, brings smart contract-like functionality to inscriptions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T08:58:00.000Z",
    "title": "Fraud Proceedings Against SBF Could Be Delayed By Months Or Years",
    "url": "https://cryptodaily.co.uk/2023/06/fraud-proceedings-against-sbf-could-be-delayed-by-months-or-years",
    "description": "<p>Lawyers for FTX Founder Sam Bankman-Fried have stated that litigation proceedings against him could be significantly delayed if further charges are added against the founder.&nbsp;</p>\n<p>Bankman-Fried&rsquo;s lawyers have argued that a new Supreme Court judgment shows that the FTX founder has not committed fraud.&nbsp;</p>\nA Significant Delay&nbsp;\n<p>Bankman-Fried&rsquo;s lawyers argued about the delay in legal filings that were made on Monday. The disgraced FTX founder remains on bail after being arrested in the Bahamas in December. US authorities filed several criminal charges against Bankman-Fried, following which he was extradited following the collapse of FTX and its associated entities, including Alameda Research. FTX and Alameda Research had filed for bankruptcy in November, with SBF pleading not guilty to charges brought against him, including those of money laundering and wire fraud.&nbsp;</p>\n<p>Lawyers representing Bankman-Fried argued in a pretrial motion to dismiss a majority of the charges against him that charges added by the United States Department of Justice after Bankman-Fried&rsquo;s extradition could breach the treaty between the United States and the Bahamas. They further added that he held the right to contest any attempt to add charges in overseas courts.&nbsp;</p>\n\n<p>&ldquo;Mr. Bankman-Fried is currently challenging the Government&rsquo;s new application for consent in The Bahamas, as is his right, and such proceedings may well take many months, even years, to be litigated.&rdquo;</p>\n\nThe US Supreme Court Boosts Defense Case&nbsp;\n<p>Sam Bankman-Fried&rsquo;s case has been significantly emboldened by the United States Supreme Court, which recently narrowed the scope of federal laws during a case involving the bidding of state contracts. The narrowing of the scope of federal laws, along with other case laws, significantly weakens the prosecution&rsquo;s arguments that Sam Bankman-Fried defrauded banks and users/clients that lend money to the crypto hedge fund Alameda Research. The banks and users in question still stand a chance of receiving their money back as the firm is wound up. Lawyers arguing for SBF stated,&nbsp;</p>\n\n<p>&ldquo;The Alameda lenders were not deprived of their contractual rights to collect the existing loans&rdquo; by Bankman-Fried&rsquo;s actions. We understand that Alameda&rsquo;s lenders are vigorously asserting their rights in the FTX bankruptcy proceedings.&rdquo;</p>\n\n<p>According to the document filed, &ldquo;Bank-1&rsquo;s right to control access to its bank accounts is no longer a valid property right&rdquo; after the Supreme Court&rsquo;s observation in May. According to SBF&rsquo;s lawyers, this invalidates charges against him, stating that he misrepresented the purpose of a bank account set up for the company North Dimension.&nbsp;</p>\nSBF&rsquo;s Growing Problems&nbsp;\n<p>Sam Bankman-Fried has constantly denied any wrongdoing after pleading not guilty to federal charges. In January, he posted an astonishing blog post stating that he did not steal funds or stash away billions. Instead, he blamed Binance CEO Changpeng Zhao, saying that he had orchestrated the liquidity crisis that led to the fall of FTX and its associated entities. Despite his protests, federal prosecutors added further charges to a growing list of indictments, alleging that he paid $40 million to Chinese officials to unfreeze specific accounts.</p>\n<p>Sam Bankman-Fried was also sued by FTX and its sister entity Alameda Research, as it looks to recover $240 million related to the Embed acquisition. Other executives sued by the companies include Nishad Singh and Gary Wang.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  }
]