[
  {
    "source": "Decrypt",
    "date": "2023-12-09T16:33:23.000Z",
    "title": "This Week in Coins: Bitcoin Rally Lends Meme Coins a Helping Hand",
    "url": "https://decrypt.co/209125/this-week-in-coins-bitcoin-rally-lends-meme-coins-a-helping-hand",
    "description": "Bitcoin continued to rally this week. And major altcoins—especially meme coins—blew up in value as a result."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-09T16:10:59.000Z",
    "title": "Shiba Inu ($SHIB) Price Surges 20% After Shibarium Devs Tout Superior Speed and Scalability Over Ethereum",
    "url": "https://www.cryptoglobe.com/latest/2023/12/shiba-inu-shib-price-surges-20-after-shibarium-devs-tout-superior-speed-and-scalability-over-ethereum/",
    "description": "Shiba Inu, commonly known as SHIB, is a cryptocurrency that emerged in August 2020. It was created by an anonymous entity known as “Ryoshi.” Named after the Japanese dog breed and often categorized as a “meme coin,” SHIB has gained significant popularity, partly riding on the wave created by Dogecoin. As an ERC-20 token, SHIB […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-09T16:37:41.000Z",
    "title": "Terra Classic Up Over 200% Over The Month, Pullix Predicted to 10x And KAVA Poised For Rally",
    "url": "https://cryptodaily.co.uk/2023/12/terra-classic-up-over-200-over-the-month-pullix-predicted-to-10x-and-kava-poised-for-rally",
    "description": "Amidst the current volatile wave currently raging in the crypto space, some altcoins are fighting to be among the best cryptos for investment"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-09T16:28:55.000Z",
    "title": "Meme Moguls (MGLS) Emerges as a Top Contender Amidst Dogecoin (DOGE) Price Retracement",
    "url": "https://cryptodaily.co.uk/2023/12/meme-moguls-mgls-emerges-as-a-top-contender-amidst-dogecoin-doge-price-retracement",
    "description": "Dogecoin has come a long way, riding the wave of the internet meme saga and pushing its way to the top ten best crypto to invest in."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-09T16:30:49.000Z",
    "title": "December Sparks NFT Sales Surge — Bitcoin Dominates as Market Recovers, Iconic Collections Realign",
    "url": "https://news.bitcoin.com/december-sparks-nft-sales-surge-bitcoin-dominates-as-market-recovers-iconic-collections-realign/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"December Sparks NFT Sales Surge — Bitcoin Dominates as Market Recovers, Iconic Collections Realign\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nfftsttdjjj.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the wake of a strong rise in non-fungible token (NFT) sales last November, the initial week of December continued this trend, with sales escalating by 57% compared to the previous week. Bitcoin Outshines as NFT Sales Skyrocket in Early December This past week&#x2019;s NFT sales amounted to approximately $316 million. Despite this surge, the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-09T16:30:09.000Z",
    "title": "Analyst Places XRP As The Top Coin For The 2024-2025 Bull Run",
    "url": "https://www.newsbtc.com/analysis/xrp/analyst-places-xrp-as-the-top-coin-for-the-2024-2025-bull-run/",
    "description": "Prominent altcoin, XRP, has produced a positive performance in the last day, rising by 6.92%, according to data from CoinMarketCap. This price increase adds to the token’s impressive form all week, culminating in an 11.85% gain in the last seven days.  Interestingly, it appears there may be larger gains for XRP investors in the coming months as popular crypto analyst Ben Armstrong has placed the token as the most favorable asset for investment ahead of a potential 2024-2025 bull crypto market. Related Reading: Bitcoin and Ethereum Fees Rise By Over 50%: Will BTC Conquer $69k? XRP Is The Token To Buy In 2024, Analyst Explains Why In a recent video on YouTube, Ben Armstrong has backed XRP to emerge as the leader of a potential crypto bull run over the next two years. Armstrong supports his claim with respect to many factors, including the team behind XRP, the token’s marketing, performance, utility, community, and technology, among others. When commenting on marketing, the renowned analyst explains that XRP is one of the most advertised assets to institutional investors. Furthermore, he claimed that the token’s publicity has largely increased following Ripple&#8217;s long-lasting squabble with the US Securities and Exchange Commission, which eventually resulted in a partial victory. On XRP’s performance, Ben Armstrong admits the altcoin left much to desire in the last bull run in 2020-2021. However, he attributes this negative performance to a suppression induced by the SEC case against Ripple. To back his XRP prediction,  the crypto analyst notes that the altcoin gained by over 44,000% in the 2017 bull run and could repeat a similar feat, topping the next bull run in 2024-2025.  In addition, Ben Armstrong also believes that XRP Is going to experience more adoption by traditional institutions in the world. Notably, he references the current application of the token in the creation of CBDCs by the central banks of some nations.  Related Reading: SEC’s “Crypto Asset Securities” Alert Boosts Spot Bitcoin ETF Prospects – Here’s Why Armstrong Notes Worry Over XRP’s Tokenomics  In his bold XRP prediction, Ben Armstrong has expressed some worry over the altcoin’s tokenomics as half of the coin’s supply is controlled by Ripple.  Notably, this factor does not alter the analyst’s projection of the altcoin in 2024-2025. In fact, he believes the payment company to retain his control over XRP to be beneficial for investors. However, Armstrong predicts Ripple’s dominance in the XRP market might prove to be an unfavorable policy in the long run.  At the time of writing, XRP trades at $0.687, with a 1.57% loss in the last hour. Meanwhile, the token’s trading volume is up by 51.78%  in the last day and is currently valued at $2.4 billion.  XRP trading at $0.685 on the daily chart &#124; Source: XRPUSD chart on Tradingview.com Featured image from CoinMarketCap, chart from Tradingview"
  }
]