[
  {
    "source": "Decrypt",
    "date": "2023-06-20T17:25:04.000Z",
    "title": "Binance US Market Share Evaporates as SEC Case Looms",
    "url": "https://decrypt.co/145431/binance-us-market-share-evaporates-as-sec-case-looms",
    "description": "Binance US started the year with 8% of the U.S. market share. Trading volume on the exchange has also dipped to yearly lows."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T17:20:34.000Z",
    "title": "Deutsche Bank crypto plans aid Bitcoin price trip to $27.5K June highs",
    "url": "https://cointelegraph.com/news/deutsche-bank-crypto-bitcoin-price-june-27",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5cfe9f4c-d57c-4ce0-bd46-3d25eefad541.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price performance nails its highest levels this month, but analysts are waiting for the weekly candle close.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) achieved new highs for the month after the June 20 Wall Street open as observers stayed cautious on market strength.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5d058247-2ae2-49cb-88fd-c2bb856ae55f.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart. Source: TradingView</em></figcaption></figure><h2>\"No meaningful trend shift\" for Bitcoin yet</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC/USD reaching $27,499 on Bitstamp.</p><p>The pair saw its highest levels since May 31 as the return of United States market trading boosted its performance. Versus the prior day’s lows, gains totaled around 4.2%.</p><p>Despite this, wary market participants stopped short of calling even low-timeframe trend shift.</p><p>“It's difficult to look for Daily breakout confirmation for BTC in the context of this blue Lower High diagonal resistance,” trader and analyst Rekt Capital <a href=\"https://twitter.com/rektcapital/status/1671196175079178240\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> alongside an explanatory chart. </p><blockquote>“Because $BTC has failed so many post-breakout retests on the Daily timeframe here. Better to watch out for Weekly timeframe confirmation.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a8b02cc0-8103-4a93-8641-19af152933d2.jpeg\"><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/Twitter</em></figcaption></figure><p>In further Twitter coverage, Rekt Capital <a href=\"https://twitter.com/rektcapital/status/1671195417235660801\" target=\"_blank\" rel=\"noopener nofollow\">added</a> that Bitcoin would have a “good chance” of exiting its current downtrend should strength hold out into the weekly close.</p><p>“But no meaningful trend-shift has occurred just yet, despite all the excitement,” he reiterated.</p><p>Fellow trader Crypto Tony was slightly more optimistic, forecasting a return to $27,500.</p><p>“Trend line being broken out as we speak, so let's see if the bulls have what it takes to turn this into something special,” he <a href=\"https://twitter.com/CryptoTony__/status/1671193944334512137\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> alongside a chart. </p><blockquote>“Remember that $27,100 is a key level for the bulls to flip into support tonight.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f4b0f6bc-7271-42ba-8ca1-2a7a4187e598.jpeg\"><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Crypto Tony/Twitter</em></figcaption></figure><h2>New institutional crypto moves spark distrust</h2><p>The uptick accompanied news that Germany’s largest bank, the $1.4 trillion lender Deutsche Bank, had applied for a license to <a href=\"https://cointelegraph.com/news/deutsche-bank-applies-digital-asset-custody-license\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/deutsche-bank-applies-digital-asset-custody-license/amp\">custody crypto assets</a>. This was the third similar announcement of the past week, following exchange-traded fund (ETF) applications from BlackRock and Fidelity Investments.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-boredom-18-months-research\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-boredom-18-months-research/amp\">Bitcoin price ‘sideways boredom’ may last 18 months — New research</a></em></strong></p><p>EDX Markets, a new crypto exchange with founding investors including Fidelity, Charles Schwab and Citadel Securities, opened its doors on the day.</p><p>“We are committed to bringing the best of traditional finance to cryptocurrency markets, with an infrastructure built by market experts to embed key institutional best practices,” EDX CEO, Jamil Nazarali, commented in an accompanying <a href=\"https://www.businesswire.com/news/home/20230620110605/en/Digital-Asset-Platform-EDX-Markets-Begins-Trading-and-Completes-New-Funding-Round\" target=\"_blank\" rel=\"noopener nofollow\">press release</a>.</p><p>Against the backdrop of U.S. regulatory action against two of the biggest extant exchanges, suspicions over the timing of the new products and applications were easy to spot.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I'm sorry, but after watching, Blackrock, Fidelity, Citadel, Schwab and now Deutsche Bank, all apply for <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> ETFs, spot exchanges, etc. only a few days after the SEC drops a TRO on Binance and sues Coinbase... how can't you think this entire past year was a giant inside job…</p>— Preston Pysh (@PrestonPysh) <a href=\"https://twitter.com/PrestonPysh/status/1671153596547874820?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Asset management guru Larry Lepard <a href=\"https://twitter.com/LawrenceLepard/status/1671153993891086336\" target=\"_blank\" rel=\"noopener nofollow\">additionally cited</a> the <a href=\"https://cointelegraph.com/news/grayscale-100-committed-to-turning-gbtc-into-bitcoin-etf-ceo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-100-committed-to-turning-gbtc-into-bitcoin-etf-ceo/amp\">repeated U.S. rejections</a> of plans by the Grayscale Bitcoin Trust (GBTC), the largest Bitcoin institutional investment vehicle, to convert to an ETF as food for thought.</p><p>Others were hopeful for the long-term positive impact on BTC price action.</p><p>“Bitcoin is bullish. Everything has changed,\" trader and podcast host, Scott Melker, known as “The Wolf of All Streets,” <a href=\"https://twitter.com/scottmelker/status/1671133474680455168\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of the day’s social media commentary.</p><blockquote>\"Whether you think the Wall Street intrusion is good or bad is irrelevant... it should help the price of Bitcoin.\"</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T17:10:39.000Z",
    "title": "Uniswap founder calls US’ approach to regulating crypto ‘sad and unfortunate’",
    "url": "https://cryptoslate.com/uniswap-founder-calls-us-approach-to-regulating-crypto-sad-and-unfortunate/",
    "description": "<p>Uniswap founder Hayden Adams said the U.S. has not been &#8220;very thoughtful or very good&#8221; in its approach to regulating the crypto industry, which is &#8220;a little bit sad and unfortunate.&#8221; Adams made the comments during an appearance on the Unchained podcast on June 20. He said that many countries in the world are taking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uniswap-founder-calls-us-approach-to-regulating-crypto-sad-and-unfortunate/\">Uniswap founder calls US&#8217; approach to regulating crypto &#8216;sad and unfortunate&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T17:30:10.000Z",
    "title": "Romanian Prosecutors Pursue Confiscation of $563K Bitcoin Stash Owned by Andrew Tate",
    "url": "https://news.bitcoin.com/romanian-prosecutors-pursue-confiscation-of-563k-bitcoin-stash-owned-by-andrew-tate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Romanian Prosecutors Pursue Confiscation of $563K Bitcoin Stash Owned by Andrew Tate\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21btc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Romanian prosecutors have officially submitted documents to the court, seeking the seizure of 21 bitcoin valued at $563,000 from Andrew Tate, a controversial social media influencer. The British-American ex-kickboxer, who gained a significant online presence, was charged with grave offenses of human trafficking and rape on December 29, 2022. Despite the charges, Tate vehemently denies [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T17:40:04.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T17:14:36.000Z",
    "title": "How Significant Is An OpenAI  App Store for AI Software?",
    "url": "https://www.cryptopolitan.com/how-significant-is-an-openai-app-store-for-ai-software/",
    "description": "OpenAI&#8217;s CEO, Sam Altman, hinted at the possibility of an OpenAI App Store for AI Software during a meeting with developers in London, England, last month. Although OpenAI has not actively pursued this market, industry insiders and analysts recognize the profound implications of such a development. In May 2023, OpenAI made an exciting announcement regarding ... <a title=\"How Significant Is An OpenAI  App Store for AI Software?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-significant-is-an-openai-app-store-for-ai-software/\" aria-label=\"More on How Significant Is An OpenAI  App Store for AI Software?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T17:14:52.000Z",
    "title": "FIFA files metaverse-related trademarks",
    "url": "https://crypto.news/fifa-files-metaverse-related-trademarks/",
    "description": "FIFA, the international governing body of soccer, has submitted trademark applications regarding the metaverse as part of its \"WE ARE\" initiative. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T17:30:09.000Z",
    "title": "Why The Ripple General Counsel Demands Impartiality From SEC Staff",
    "url": "https://www.newsbtc.com/news/ripple/why-the-ripple-general-counsel-demands-impartiality-from-sec-staff/",
    "description": "In a recent post, the Chief Legal Officer of Ripple, Stuart Alderoty, stated that legally federal employees must act impartially. As such, the United States Security and Exchange Commission (SEC) especially should comply with rigid rules. Alderoty reaction relates to the Hinman documents and allegations of William Hinman’s favoritism towards Ether. SEC Counsel Emphasizes On The Law In the tweet, Stuart Alderoty stated the law requires SEC employees, like all federal employees, to act (and appear to act) impartially. Notably, he cited the basic obligations of public service from (5 CFR 2635.101(b)(14)) covering the general principles and code of conducts for employees. Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels The sub-section states that federal employees shall endeavor to avoid any actions creating the appearance that they are violating the law or ethical standards. Alderoty quotes this while referring to the SEC and their perceived evasion tactics in the ongoing lawsuit against Ripple. Interestingly, the released Hinman documents imply that former Director of the SEC’s Corporation Finance William Hinman refused to heed caution while drafting the speech. In the documents, Hinman said that Ethereum and Bitcoin were not securities and noted that a token would no longer be grouped as a security if it became sufficiently decentralized.  However, some crypto community members believe the infamous speech deliberately favors Ether implying that Hinman wasn&#8217;t impartial in the speech. On June 13, Stuart posted; An investigation must be conducted to understand what or who influenced Hinman, why conflicts (or, at the very least, appearances of conflicts) were ignored, and why the SEC touted the speech knowing that it would create “greater confusion.&#8221; Ripple To Investigate Who Influenced Hinman On June 13, Stuart Alderoty gave a brief recap of the Hinman emails on Twitter, stating that he ignored multiple warnings that his speech contained a made-up analysis with no legal basis. Also, he noted that although Hinman claimed the speech was his personal opinion, the SEC used it for guidance and retained it on their website. Notably, other top executives at the SEC warned Hinman that the speech would create more market confusion. A warning he refused to heed when he delivered the speech. A Twitter user Mr. Huber, asked Ripple and its CEO, Brad Garlinghouse if they had plans to address the issue aside from calling for an investigation on Twitter.  The CEO of Ripple replied in the affirmative to the inquiry but did not reveal how they would execute the planned investigation on Hinman. Meanwhile, ex-SEC director Marc Fagel stated that he believes a ruling on the ongoing case is coming within days.  He noted that even if he is wrong, there is no basis to think that the delay is due to the complex nature of the case. Finally, he said that the speech did not cause greater confusion as Ripple is substantially different. featured image from Pixabay and chart from Tradingview.com"
  }
]