[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T02:53:11.000Z",
    "title": "What Opportunities Does Google’s AI Expansion Offer Taiwan?",
    "url": "https://www.cryptopolitan.com/opportunities-googles-ai-expansion-taiwan/",
    "description": "In a strategic move aimed at bolstering its presence in the dynamic tech landscape of Taiwan, Google has made significant announcements regarding its plans for expanding artificial intelligence initiatives in the country. With a focus on enhancing literacy, empowering developers, and fostering innovation, Google&#8217;s ambitions signify a pivotal moment in the intersection of technology and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T03:00:13.000Z",
    "title": "BNB Price Soars As Binance Smart Chain Implements “BEP 336” Upgrade, Inspired By Ethereum’s Dencun",
    "url": "https://www.newsbtc.com/binance-smart-chain/bnb-price-soars-as-binance-smart-chain-implements-bep-336-upgrade-inspired-by-ethereums-dencun/",
    "description": "Binance Smart Chain (BSC), commonly known as BNB Chain, has announced the “BEP 336 upgrade”, inspired by Ethereum&#8217;s Dencun upgrade (EIP 4844), which aims to optimize data storage and processing on the blockchain. The upgrade is expected to significantly reduce transaction costs, improve network performance, and drive the price of Binance Coin (BNB) towards its previous all-time high (ATH) of $686, reached in May 2021. BNB Smart Chain Cost-Effective Data Solution According to the protocol&#8217;s announcement, BEP 336 introduces an innovative concept called &#8220;Blob-Carrying Transactions&#8221; (BlobTx) that will change how large data blocks are handled.  These temporary and cost-effective memory segments, known as blobs, can capture data blocks as large as 128 KB. By streamlining the transaction verification process, the network only needs to verify that the attached blob contains the correct data rather than verifying each transaction within a block. Related Reading: Zooming NEAR: Solid 75% Growth Sparks Crypto Frenzy The introduction of blob transactions within the BSC, which is particularly beneficial for opBNB &#8211; the layer 2 network of the BNB ecosystem &#8211; offers several advantages. Blobs reduce network space consumption, resulting in lower storage costs and more affordable gas fees for users, similar to Etherem&#8217;s Dencun upgrade. This storage strategy allows for efficient data handling while managing blockchain bloat, ensuring data integrity and availability throughout its lifetime on the chain. BEP 336 also includes two additional components. The Blob Market establishes a fee market for blobs, ensuring regulated storage and transmission costs based on network demand. The Precompile Contract adds a layer of security by verifying that the data in a blob matches the reference in the blob-bearing transaction. While BEP 336 draws inspiration from Ethereum&#8217;s EIP 4844, it is tailored to meet BSC&#8217;s unique requirements. Notably, BSC&#8217;s design mandates that blobs be managed exclusively by the BSC client, distinguishing it from Ethereum&#8217;s approach. Moreover, BSC implements a dynamic gas pricing mechanism for blobs, ensuring reasonable transaction costs with minimum and maximum thresholds. BEP 336 Integration With Phased Roadmap BSC has outlined a phased roadmap for the integration of BEP 336. Beginning with the Testnet launch in April, developers can test and interact with the upgrade in a &#8220;controlled environment&#8221; to address potential issues.  The subsequent Magnet phase in May will focus on further testing and optimization to ensure the “robustness” and “scalability” of BEP 336. Finally, in June, the mainnet hard fork will mark the official deployment of BEP 336 on the BSC mainnet, ushering in a new era of efficiency and cost-effectiveness for the network. Related Reading: Ethereum Is Not Done: Crypto Analyst Sets New $5,000 Target According to the announcement, the benefits of BEP 336 are expected to impact developers and users within the BSC ecosystem significantly. Gas fees will be reduced considerably as certain data types no longer require permanent storage, making transactions more affordable.  The temporary storage mechanism will keep the blockchain lean and bloat-free, enhancing overall network performance. With lower costs and improved efficiency, BEP 336 aims to make the BSC ecosystem more accessible to a wider audience, including developers and newcomers to blockchain technology. The announcement has boosted Binance Coin&#8217;s (BNB) price by over 8%, resulting in a current trading price of $588, just 15% below its all-time high of $686.  In case of further price gains, the next resistance walls for the BNB price are placed at the $600 level and the $608 mark, which could prevent the token from further price appreciation in its mission to reach its current ATH.  Featured image from Shutterstock, chart from TradingView.com"
  }
]