[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T13:00:00.000Z",
    "title": "Convergence of AI and blockchain: Unlocking new possibilities",
    "url": "https://cointelegraph.com/innovation-circle/convergence-of-ai-and-blockchain-unlocking-new-possibilities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5ed76283-10dd-4eed-8d51-9d9283c27a94.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Overall, the combination of AI and blockchain represents a massive paradigm shift in modern technology and presents significant opportunities for lives and industries to improve.</p>\n                    <p><p>Let’s do a simple exercise, shall we?</p> <p>Try to imagine a world where innovations in banking, finance, power, medical services and social media are the best they have ever been. One where these industries and several others are powered entirely by unbreakable, difficult-to-hack-or-crack streams of data. </p> <p>A world where this kind of superpowered data is run by powerful algorithms, and is capable of learning, updating and improving itself. Do you think such a world is possible? It might be closer than you think. Over the last decade, AI and blockchain have proven themselves to be the future. One of them (blockchain technology) possesses the ability to produce unbreakable chains of data.</p> <p>On the other hand, AI is able to create self-updating algorithms that are capable of learning from the world around them. But have you ever wondered what might happen if we found a way to put both of these bits of technology together?</p> <p>Well, welcome to the future. </p> <h2><strong>Understanding the building block(chain)</strong></h2> <p>What exactly does AI entail?</p> <p>AI, in simple terms, refers to a combination of algorithms and data structures that give machines (particularly computers) the ability to think, learn and solve problems. Maybe even better than a human being ever could. Believe it or not, you directly use some form of AI, every single day.</p> <p>The music streaming apps you use, your flight booking apps and even the traffic lights on roads. AI is everywhere. Blockchain technology, on the other hand, can be decentralized, is generally unbreakable and is a transparent piece of technology that allows secure and tamper-proof transactions. </p> <p>Blockchain technology has several use cases that we have barely even scratched the surface of. Things like supply chains, transparent voting and asset tokenization are all under the umbrella of blockchain technology. With blockchain technology, you can convert the ownership of your house into a token that you can transfer, sell or even split into several pieces.</p> <h2><strong>The AI and blockchain revolution</strong></h2> <p>Both of these technologies have proven themselves, several times over. However, when AI and blockchain come together, they become an unstoppable force. </p> <p>If AI is used properly, it can enhance the abilities of blockchain networks, allowing them to process data faster, make better decisions in hashing algorithms and can even make smart contracts “smarter.” Imagine smart contracts that have the ability to think or make independent decisions.</p> <p>At the same time, blockchain can return the favor to AI systems, boosting their trust and security and ensuring that the data used to train AI models is tamper-proof and verifiable. When AI and blockchain technology come together, here are some wonders they could give birth to.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <h3><strong>Personalized practices for medical professionals</strong></h3> <p>At this point, almost everyone has tasted the power of AI tools like OpenAI’s ChatGPT, Google’s Bard and Microsoft’s Bing Chat. AI can be used to analyze massive amounts of medical data, such as patient records, genetic information and clinical trials. With this information, it can test out several drug combinations, simulate a person’s immune responses to them and even assist medical professionals by suggesting treatments for certain conditions.</p> <p>When integrated with blockchain, patient data can be stored securely and will only be accessed by authorized parties. Storing vast amounts of patient data under bulletproof privacy can potentially lead to more accurate diagnoses, tailored treatments and faster drug discoveries.</p> <h3><strong>Decentralized finance (DeFi)</strong></h3> <p>There are several problems with traditional financial systems like banks, brokers and lenders. These problems are so bad that fraud, unfair interest rates and security issues are only the beginning. With blockchain technology handling finances, there is less of a need for intermediaries and middlemen, contracts are open for everyone to see and well-written smart contracts are uncheatable and unbendable. When AI comes into the picture, its algorithms can analyze market data in split seconds, allowing almost anyone to make better and well-informed trading, banking and purchasing decisions.</p> <h3><strong>Fraud detection</strong></h3> <p>Patterns are in everything, and it is possible to accurately predict several circumstances ages before they happen. When AI is integrated with the vast amounts of data that flow through blockchains per second, several of these patterns that indicate fraud can be identified, caught and prevented awhile before they happen. With these, scams, rug-pulls and outright theft can be identified significantly earlier.</p> <h3><strong>Product tracking</strong></h3> <p>Imagine a world where you can check the verified age of a bottle of wine, the age of a house, the expiry date of a can of sardines or even the freshness of a crate of eggs using blockchain technology. Using blockchain and AI solutions, a company can create a digital record of products containing info such as where/when they are manufactured, allowing users to track a product’s origin and the materials used in its production.</p> <h2><strong>The challenges and opportunities</strong></h2> <p>While bringing AI and blockchain together holds great promise, it is not without problems. One of the biggest problems to tackle is scalability. In the real world, both AI and blockchain processes require massive amounts of computational power. However, AI can also be used to implement blockchain scalability solutions like sharding and off-chain computation.</p> <p>Another concern may be the issue of privacy. A combination of AI and blockchain technology will require more instances of data sharing. Data sharing, in turn, raises issues about who owns data and how it should be used. Both technologies will have to strike a balance between data accessibility and individual rights.</p> <p>At the same time, blockchain technology and AI will require more skilled personnel with experience using AI algorithms and blockchain protocols. Training and finding talent to join the workforce may prove to be a challenge and may be one of the crucial aspects for the success of this convergence.</p> <p>Overall, the combination of AI and blockchain represents a massive paradigm shift in modern technology and presents significant opportunities for lives and industries to improve. This combination of AI’s intelligence and blockchain technology’s trust will serve as the foundation of solutions that are more innovative than we have ever dreamed.</p> <p><em><a href=\"https://www.linkedin.com/in/abhisheksinghrajpurohit/\">Abhishek Singh</a> is a serial entrepreneur currently working on Acknoleger and is a vocal advocate of crypto.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T12:59:00.000Z",
    "title": "Renewable energy Bitcoin mining company powers up in Sweden",
    "url": "https://cointelegraph.com/news/renewable-energy-bitcoin-mining-sweden",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/980d4f9a-b320-4c22-b6a6-fc7dcbb3682c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin mining lands another green energy data center as global powerhouse GDA sets up shop in Sweden.</p>\n                    <p><p>Sweden has welcomed a hydro-powered Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining data center. </p><p>Genesis Digital Assets Limited (GDA), a mining and data center company with over 400 MW of power generation worldwide has made a opened a new data center in Sweden, driven by the country's burgeoning renewable energy surplus. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2c044084-caa6-4e40-9ab0-5d020078b273.jpeg\"  /></figure><p>The new operation is located in the far North of Sweden, where hydroelectric power dominates the grid.  Abdumalik Mirakhmedov, executive president and fouder of GDA, told Cointelegraph that the new data center is located near the Porjus Hydroelectric Power Station:</p><blockquote>“Given the proximity to the hydroelectric power station, we expect all of our electricity consumption to be powered by renewable energy.”</blockquote><p>The total capacity of the data center is approximately 8 MW and is expected to result in a hash rate of approximately 155 PH/s (peta hashes per second). GDA explained to Cointelegraph that there are 1,900 Bitcoin mining machines deployed in the Porjus data center.</p><p>As reported by Jaran Mellerud, a Business Developer at Luxor Mining, and a frequent Cointelegraph contributor, Sweden produces almost <a href=\"https://hashrateindex.com/blog/bitcoin-mining-around-the-world-sweden/\" target=\"_blank\" rel=\"noopener nofollow\">all</a> of its electricity from nuclear and hydropower, particularly the north. </p><p>Mellerud, who hails from nearby Norway, explains that renewable energy is also abundant: </p><blockquote>“Sweden is an electricity powerhouse, generating the fifth-most electricity per capita globally in 2021.</blockquote><p>GDA’s strategic expansion is part of a broader trend in the Northern European Bitcoin mining landscape. Christian Anders, the founder of BT.CX, a <a href=\"https://cointelegraph.com/news/eu-needs-further-efforts-to-implement-crypto-regulations-btc-x-ceo\">Swedish Bitcoin exchange dating back to January 2012,</a> told Cointelegraph that Bitcoin mining is not very common due to high energy prices. </p><p>However, the Nordics are a class apart, Anders told Cointelegraph:</p><blockquote>“Sweden, Finland, and Norway have a surplus of energy and negative energy prices from time to time, and primarily renewable energy in the form of hydropower in a remote location which is hard to distribute.”</blockquote><p>Untapped, stranded, and renewable energy are popular ingredients for Bitcoin mining as they tend to be the cheapest. Mirakhmedov explained, “Sweden also has abundant clean energy sources, which is an important factor we consider in our operations.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/51753097-7bb5-4972-8b2a-0766a20669a5.png\"  /><figcaption style=\"text-align: center;\">Porjus is in the far north of Sweden where renewable energy is abundant.</figcaption></figure><p>Moreover, while sentiment among <a href=\"https://cointelegraph.com/news/norwegian-town-wants-noisy-bitcoin-miners-out-experts-respond\">some Scandinavians is negative towards Bitcoin</a>, Anders told Cointelegraph that energy companies are coming around to Bitcoin mining's utility: “The CEO of the largest energy producer in Sweden, Vattenfall, is pro-bitcoin mining, and its use case for grid balancing.” Stabilizing electricity grids with Bitcoin miners is <a href=\"https://cointelegraph.com/news/bitcoin-mining-could-be-good-for-us-energy-independence-research\">also growing in the United States.  </a> </p><p>Tim Carra, the head of Nordic at GDA, expounded the point in correspondence with Cointelegraph: </p><blockquote>“With abundant energy sources, a pro-innovation environment, and a strong educational system that results in a great culture of innovation, we believe that Sweden is one of the best countries in the world where to mine bitcoin and expect to further invest in this beautiful region moving forward.”</blockquote><p>GDA concentrates the majority of its power generation in Texas: <a href=\"https://cointelegraph.com/news/genesis-digital-assets-announces-new-data-center-in-texas\">one facility consumes 300 MW of electricity.</a> The new Swedish operations complement a <a href=\"https://cointelegraph.com/news/genesis-digital-assets-opens-three-new-facilities-south-carolina-us-expansion\">new GDA facility in South Carolina</a> and demonstrate that there are still some attractive and untapped potential mining destinations around the world. Anders chimes in:</p><blockquote>“There is also a market opportunity in Spain/Portugal which gets cheap energy from Africa and its domestic solar production where prices also are very cheap from time to time. BT.CX is working with renewable bitcoin miners to offer a way to offset your bitcoin holdings.”</blockquote><p>As Anders alludes to, the generation of new Bitcoins consumes considerable amounts of electricity. The European Central Bank <a href=\"https://www.ecb.europa.eu/pub/financial-stability/macroprudential-bulletin/html/ecb.mpbu202207_3~d9614ea8e6.en.html\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> that Bitcoin mining has a significant carbon footprint. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c1c217eb-e32a-466d-9a9d-9b7ac031888f.png\"  /><figcaption style=\"text-align: center;\">Stats from the Cambridge Centre for Alternative Finance. Global energy consumtion is estimated at 25,000 terawatt-hours according to the IEA.</figcaption></figure><p>However, <a href=\"https://www.theatlantic.com/science/archive/2023/03/crypto-bitcoin-mining-carbon-emissions-climate-change-impact/673468/\" target=\"_blank\" rel=\"noopener nofollow\">portrayed</a> as an energy-guzzling and carbon-intensive industry, Bitcoin mining consumes just 149.95 Terawatt hours of electricity per year, or less than 0.7% of global energy, <a href=\"https://ccaf.io/cbnsi/cbeci\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the Cambridge Center for Alternative Finance.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tether-invests-in-el-salvador-renewable-energy-scheme\"><strong><em>Tether invests in El Salvador’s $1B renewable energy project</em></strong></a></p><p>Meanwhile, renewable energy including hydro continues to <a href=\"https://cointelegraph.com/news/this-earth-day-analysts-say-bitcoin-mining-is-naturally-gravitating-to-green-energy\">dominate the global bitcoin mining energy mix.</a> Neighboring Norway, for example, contributes<a href=\"https://cointelegraph.com/news/green-oasis-for-bitcoin-mining-norway-has-almost-1-of-global-btc-hash-rate\"> roughly 1% of the Bitcoin hash rate and is 100% renewable</a>, while the new GDA installation in Sweden is another green energy Bitcoin miner. </p><p>Ultimately, Anders concludes, “It's super cool that more miners are coming to the Nordic European countries to help us with this mission.”</p><p><strong>Magazine</strong>: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong>Bitcoin is on a collision course with ‘Net Zero’ promises</strong></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-21T13:08:22.000Z",
    "title": "ETF delay disappointment triggers $55M outflow from digital assets – reports",
    "url": "https://cryptoslate.com/etf-delay-disappointment-triggers-55m-outflow-from-digital-assets-reports/",
    "description": "<p>Digital asset investment products experienced a significant outflow of funds this week, totaling $55 million, according to the weekly report by CoinShares. Analysts, including James Butterfill, believe the market&#8217;s reaction is due to the disappointment from recent media reports indicating a delay by the US Securities &#38; Exchange Commission in approving a US spot-based ETF. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/etf-delay-disappointment-triggers-55m-outflow-from-digital-assets-reports/\">ETF delay disappointment triggers $55M outflow from digital assets &#8211; reports</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T12:40:39.000Z",
    "title": "\n                        ChainGPT is Launching Solidus AI Tech, the Web3 Infrastructure as a Service Provider\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/chaingpt-is-launching-solidus-ai-tech-the-web3-infrastructure-as-a-service-provider",
    "description": "\n                        <p>A new generation of blockchain-based projects have begun to ascend into the crypto industry, ChainGPT is there to provide them with the necessary support and tooling to help them succeed.</p>\n<p>ChainGPT, the leading AI Infrastructure provider for the crypto, blockchain, and Web3 industry is bringing one of its most promising incubation projects to the public. After months of careful planning, diligent development, and community building, Solidus AI Tech will be taking its next step into Web3 and launching its $AITech IDO on the ChainGPT Pad .</p>\n<p>With their world-class team, mesmerizing website, incredible network of connections, and rock-solid plan of action, Solidus AI Tech is ready to bring its products to market and become an active player in the digital economy!</p>\n<p>What is Solidus AI Tech?</p>\n<p>Based in Europe, Solidus AI Tech is an IaaS (infrastructure as a service) company that is solving some of the most prevalent, fundamental issues plaguing the digital economy; namely the demand for computational infrastructure. Building out their own 8,000-square-foot facility to house hardware that has been wired with their proprietary algorithms that improve computational costs and efficiencies. In tandem to the physical infrastructure, they are tapping into their resources to provide a full stack of cutting-edge Web3 infrastructural software solutions including Artificial-Intelligence-as-a-service (AIaaS), Blockchain-as-a-Service (BaaS), High Performance Computing power (HPC), and an Artificial Intelligence marketplace.</p>\n<p>What does AI Tech Provide?</p>\n<p>As an infrastructure services company, Solidus AI Tech is providing a suite of four core services that can be used by companies, institutions, and even governments as a foundation to build sustainable digital systems. From metaverse to CBDC to gaming and beyond this is what AI Tech is providing:</p>\n<p>AIaaS - Artificial-Intelligence-as-a-serviceArtificial intelligence is the frontier of mankind's intellectual flourishing. Considered to be just as, if not more important a technological revolution as was the steam engine, AI has become the building block for new technologies promising to improve the lives of people around the world. Solidus AI Tech has neatly wrapped up a turnkey solution to jumpstart the integrations and implementations of AI into a broad range of applications.</p>\n<p>BaaS - Blockchain-as-a-serviceBuilding blockchains from scratch is an extremely tedious, long, and resource-intensive (labor and capital) process. Building quality blockchains that can satisfy the security and operational demands of sensitive, high-value operations if even more arduous. Solidus AI Tech is extending its intelligent blockchain designs for any imaginable use case.</p>\n<p>HPC - High Performance ComputationThe demand for computation continues to grow alongside the world&rsquo;s population that is coming online and new energy-dependent solutions are introduced into society. Solidus AI Tech provides computation for the most intensive use cases across a multitude of industries.</p>\n<p>AI MarketplaceThe exchange of automated intelligent processes unlocks an entirely new machine economy that contributes to a potentially entirely new and untapped market segment. Solidus AI Tech will be providing a venue where industrial and individual AI commerce can take place.</p>\n<p>What are some of AI Tech&rsquo;s Unique Features?</p>\n<p>Apart from the four key products that Solidus AI tech provides, there is a mixture of sophisticated novel developments at the design, code, and principle layers of the project that make it stand out from the crowd and supersede all existing solutions attempting to spearhead the enormous, evergreen market segment of Computational Infrastructure.</p>\n<p>Some of these features include:</p>\n<p>High Performance Computing Costs reductionNotorious for its insatiable energy demands, HPC is a problem that is looking for solutions beyond just the linear increase of hardware. Solidus AI Tech has developed proprietary algorithms that improve hardware efficiencies by 40% above the benchmark rate of existing industry standards; driving down costs, while increasing efficiency.</p>\n<p>Eco Friendly Computation IP (Intellectual Property)Going hand-in-hand with its HPC reductions costs, a byproduct of Solidus AI Tech&rsquo;s focus on optimization has resulted in the creation of innovations granting them intellectual property in the form of algorithmic systems that is much friendly for the environment with its efficient (lowered) consumption of energy and heightened computational capacity.</p>\n<p>Custom Data CenterSolidus AI Tech has been able to secure a location with some of the lowest-cost energy and highest internet speed internet in all of Europe. With the presence of an in-house data center, Solidus AI Tech is in control of the computational supply chain and has full sovereignty in optimizing its service across every vertical of supply and demand. Built in Bucharest, the facility spans some 8,000 square feet and operates under ISO 14001:2015.Vulnerability MonitoringSecurity, monitoring, and specifically designed firewalls, Solidus AI tech provides a full spectrum of proactive protective measures to ensure the reliability of its systems. Leveraging novel structures of network devices existing without IP or MAC addresses alongside its protocol of automatic vulnerability detection satisfies the most stringent institutional security requirements.Government Enterprise Blockchain SolutionsUtilizing a combination of its software and hardware solutions, Solidus AI Tech is able to service the most demanding use cases while adhering to NATO quality assurance standard. From voting, taxation, land registration, and supply chain traceability to Healthcare and Identity management; the security, flexibility and expertise Solidus AI Tech provides caters to every grade of entity.</p>\n<p>Solidus AITECH Tokenomics</p>\n<p>In tune with the forward-looking innovations that are coming out of Solidus AI Tech&rsquo;s ecosystems, their vision of a decentralized, digital future is underscored with its elegant tokenomics that complement and underpin their system processes. Empowering users of all types with equal access to high quality infrastructure the $AITECH token adheres to inclusive, cost-efficient ideologies. From a payment vehicle for their product licenses, an incentive for creating and publishing quality AI tooling, and membership to the DAO, $AITECH is worth taking a look at:</p>\n<p>Token Name: AI TechToken Symbol: $AITECHToken Standard: BEP-20Issuing Network: Binance Smart ChainTotal Supply: 2,000,000,000</p>\n<p>Moreover, the $AITECH token has adopted the leading practices in deflationary economics by implementing a variable burn program that takes 5%-10% of every transaction used for acquiring platform serves and systematically removes them from circulation; thereby exerting constant pressure on the open market dynamics of the asset.</p>\n<p>&nbsp;</p>\n<p>$AITECH IDO on ChainGPT Pad Details</p>\n<p>Solidus AI Tech has dedicated a portion of its supply for the ChainGPT Pad IDO as follows:</p>\n<p>IDO Date: 08/21/2023Token Price&rdquo; $0.012Supply Allocation: 13,333,333.33 $AITECH tokensMax Allocation: $160,000Listing on Exchanges: August 28th, at 10 AM (UTC)</p>\n<p>More information about the IDO specifications are available in their official listing here.</p>\n<p>* ChainGPT implements a unique protection mechanism for all IDO participants in the form of a refund policy. After an IDO has been completed, if for any reason participants feel as though they would rather revise their contributions, they have up to 7 days to do so (unless they claim their allocations). For a more in-depth explanation of the ChainGPT Pad refund policy refer to their official article discussing it here.</p>\n<p>&nbsp;</p>\n<p>About ChainGPT</p>\n<p>ChainGPT is the leading provider of AI-powered Infrastructure for the crypto, blockchain, and Web3 industry. The one-stop-shop Crypto AI hub. From automated smart contract generation and auditing, to autonomous community management, advanced Web3 AI chatbot, AI-powered news aggregation, and NFT generation, ChainGPT is the most sophisticated, end-to-end AI solution on the market.</p>\n<p></p>\n<p>General Resources:&nbsp;Website | V1 App | ChainGPT Pad | Whitepaper&nbsp;DAO | NFT Generator | Staking | | Blog Community and Social Media: Twitter | Telegram | Discord | Instagram | LinkedIn | Youtube | TikTok</p>\n<p>Launchpad BD</p>\n<p>Contact Person(s): Gintare Kairyte / Amid YazdiContact Email(s): Gintare@chaingpt.org / Amid@chaingpt.org</p>\n<p>General BD</p>\n<p>Contact Person(s): Jake Wallace / Cameron French / Ilan RakhmanovContact Email(s): jacob@chaingpt.org / cameron@chaingpt.org / ceo@chaingpt.org</p>\n<p>&mdash;&gt; To learn more about ChainGPT visit the official ChainGPT.org website</p>\n<p>&mdash;&gt; For all inquiries, please contact info@chaingpt.org&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T13:00:26.000Z",
    "title": "XRP Whales Accumulate, Can Price Recover Now?",
    "url": "https://www.newsbtc.com/altcoin/xrp-whales-accumulate-can-price-recover-now/",
    "description": "On-chain data shows the XRP whales have been sharply accumulating recently, something that can help the price recover. XRP Whales Have Continued To Expand Their Holdings Recently According to data from the on-chain analytics firm Santiment, the largest of the XRP investors have been buying in recent days. The relevant indicator here is the &#8220;Supply Distribution,&#8221; which tells us about the total amount of the asset that each holder group in the market is carrying in their combined wallets right now. The addresses or investors are divided into these groups based on the total number of coins that they are currently holding. The 10-100 coins cohort, for instance, includes all holders who own at least 10 and at most 100 XRP. In the context of the current discussion, two such groups are of interest: 10 million to 100 million coins and 100 million to 1 billion coins. The combined range of these groups has a lower bound of $5.22 million at the current exchange rate, while the upper bound converts to $522 million. This means that the members of both these groups are the whale entities, with the latter cohort naturally carrying the largest of holders even among these humongous investors. Related Reading: Bitcoin Weekly Chart Completes Double Top: Market Shifts Ahead? Now, here is a chart that shows the trend in the XRP Supply Distribution for both of these whale groups over the last few months: Looks like both these metrics have observed growth in recent days &#124; Source: Santiment on X As displayed in the above graph, the XRP Supply Distribution for the smaller of the two cohorts (that is, the 10 million to 100 million coins group) has been rising for a while now. This means that these whales have only continued to buy more as the asset&#8217;s price has observed an extended drawdown. This behavior hasn&#8217;t changed with the latest sharp plunge in the cryptocurrency, either, as the metric has now risen toward the 5.1 billion mark. The largest of whales (100 million coins to 1 billion coins), on the other hand, started to actively dump their coins not too long after the coin hit its top in July. They continued their selling until the recent crash, but following it, they have changed their tune and have participated in some pretty significant accumulation. This is naturally a positive sign for the cryptocurrency, as it means that these humongous whales believe that the current lows should prove to be a profitable buying point. Related Reading: Bitcoin Investors Fall Into Fear As BTC Crashes To $26,500 With this accumulation spree, this cohort as a whole now holds an 11 billion tokens stack. This means that these two whale cohorts combined now carry around 16.1 billion coins of the asset, worth around $8.4 billion. It&#8217;s uncertain whether XRP would recover anytime soon, but the buying from the whales is at least a sign that these humongous entities would be supportive of such a move if it happens. XRP Price At the time of writing, XRP is trading around $0.52, down 17% in the last week. XRP has fallen hard recently &#124; Source: XRPUSD on TradingView Featured image from Rémi Boudousquié on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T13:05:58.000Z",
    "title": "The Magnetic Pull of Everlodge’s 100x Potential Attracts Aave and Filecoin Holders",
    "url": "https://www.crypto-news-flash.com/the-magnetic-pull-of-everlodges-100x-potential-attracts-aave-and-filecoin-holders/?utm_source=rss&utm_medium=rss&utm_campaign=the-magnetic-pull-of-everlodges-100x-potential-attracts-aave-and-filecoin-holders",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-88.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-88.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-88-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The prospect of a 100x return has always been an irresistible lure for shrewd investors. This allure is especially true in the case of Everlodge (ELDG), which is currently attracting Aave (AAVE) and Filecoin (FIL) holders looking to diversify their portfolios. Let&#8217;s take a look at what Everlodge is and why it&#8217;s so appealing to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T12:58:00.000Z",
    "title": "Blockchain Trading Platform Dinari Raises $7.5m in Funding Round",
    "url": "https://coinedition.com/blockchain-trading-platform-dinari-raises-7-5m-in-funding-round/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Startup_Aims_to_Tokenize_Stocks_by_Playing_by_the_Rules-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Dinari, a California-based blockchain trading platform, recently announced that it has raised $7.5m in a seed funding round, a Bloomberg report reveals. The company says its regulatory-compliant platform will enable users outside the U.S. to buy shares of prominent U.S. companies and exchange-traded funds. Notably, the company said the funds raised would go to building [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/blockchain-trading-platform-dinari-raises-7-5m-in-funding-round/\">Blockchain Trading Platform Dinari Raises $7.5m in Funding Round</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T12:52:09.000Z",
    "title": "Compound (COMP) Price Prediction 2023-2030: Will COMP Reach $75 Soon?",
    "url": "https://coinedition.com/compound-comp-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Compound-COMP-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Compound-(COMP)-Price-Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Compound-COMP-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Compound-COMP-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Compound-COMP-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Compound-COMP-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Compound-COMP-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The compound is a decentralized finance (DEFI) protocol launched on the Ethereum blockchain. Its native token is denoted with COMP. Compound investors are bullish on the token since it has had a return on investment (ROI) of over 107% in the past three months. The crypto bubble in 2021 led to an increase in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/compound-comp-price-prediction/\">Compound (COMP) Price Prediction 2023-2030: Will COMP Reach $75 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]