[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T16:00:00.000Z",
    "title": "Bitcoin Prices Are Hot, but Here’s What Could Crush the Rally",
    "url": "https://www.coindesk.com/markets/2023/07/05/bitcoin-prices-are-hot-but-heres-what-could-crush-the-rally/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BTC has proved incredibly resilient to the perils of the past year, including FTX’s demise. But there are some macroeconomic surprises that could erect obstacles to further gains."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-05T16:00:00.000Z",
    "title": "A New Metric to Evaluate Crypto Ecosystem Fundamentals",
    "url": "https://www.coindesk.com/markets/2023/07/05/a-new-metric-to-evaluate-crypto-ecosystem-fundamentals/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The years-to-profitability ratio is a good way to evaluate a level-1 blockchain."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-05T16:00:00.000Z",
    "title": "Axiom’s Zero-Knowledge Proofs Might One Day Help Detect Deepfakes",
    "url": "https://www.coindesk.com/tech/2023/07/05/axioms-zero-knowledge-proofs-might-one-day-help-detect-deepfakes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The startup is working to build ZK technology that can be used en masse for AI applications."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-05T16:00:00.000Z",
    "title": "Starkware Plans ‘Quantum Leap’ Upgrade Next Week After Testnet Version Deployed",
    "url": "https://www.coindesk.com/tech/2023/07/05/starkware-plans-quantum-leap-upgrade-for-next-week-after-testnet-version-deployed/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The upgrade will increase the number of transactions per second the blockchain can handle as well as reduce the time-to-inclusion."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T16:00:00.000Z",
    "title": "Starknet’s Quantum Leap hits testnet with TPS reaching ‘triple figures’",
    "url": "https://cointelegraph.com/news/starknet-quantum-leap-testnet-tps-triple-figures",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/22077811-2909-447e-9867-e61cc4802c00.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Starknet's latest upgrade will scale the ZK rollup's throughput by 50X or more. But capacity is very different to real world usage. </p>\n                    <p><p>Starknet’s Quantum Leap upgrade has been deployed on testnet, with the Ethereum layer-2 scaling protocol claiming it's capable of processing \"hundreds of transactions per second.\"</p><p>If achieved, it would be at least a 50X improvement from its current throughput, thanks to the Version 12 upgrade harmonizing how the sequencer's code interacts with the Cairo programming language.</p><p>A Starknet fact sheet states that the \"time to inclusion\" after the upgrade goes live on mainnet \"will be under 15 seconds\" meaning DApps will be able to confirm transactions on-chain within seconds.</p><p>Co-founder Uri Kolodny was a little more circumspect in an interview with Cointelegraph, stating that the upgrade has hit \"triple figures\" during testing so far.</p><p>If this throughput is mirrored in real-world usage — and high TPS is as much a function of demand from users as technical capability — the upgrade would be a huge leap for Israeli firm StarkWare's decentralized scaling network.</p><p>According to L2Beat, Starknet is currently processing just 1.79 TPS, meaning the upgrade could improve transaction speed by 56X or more. It would also easily outshine other Ethereum L2s including the OP mainnet (6 TPS), <a href=\"https://cointelegraph.com/news/zksync-new-hyperchains-network-testnet-by-year-end\">zkSync Era (8.63 TPS) </a>and Arbitrum One (9.69 TPS), not to mention Ethereum itself (12.29 TPS).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/49526e39-fa70-49bd-b50c-3f4fbd964056.png\"  /><figcaption style=\"text-align: center;\">Ethereum layer 2 TPS. Source: L2beat</figcaption></figure><p>But to put those TPS figures in perspective, it's still a lot less than Solana's 4127 TPS or Visa's 1700 TPS. </p><p>\"Scaling has been the primary challenge that this ecosystem has been fighting with over the past several years,\" Kolodny said. </p><blockquote>\"We believe that Version 12 brings with it this Quantum Leap — in fact there are a whole series of leaps that will roll out through the summer we'll go through. But we are already in the triple digits for transactions per second.\"</blockquote><p>Capacity is very different to usage however, and even after the upgrade if there are not enough users on Starknet that actually make 100 transactions per second, then the protocol will not run at 100 TPS. </p><p>Kolodny added that raw TPS is not the best metric of performance, given that<a href=\"https://cointelegraph.com/news/starknet-evm-compatibility-scalability-zk-evm-kakarot-testnet\"> complicated transactions are harder to perform </a>than simple ones. But he said the upgrade also enables complicated transactions to make multiple calls \"each performing separate logic from a separate contract.\"</p><p>\"In terms of Cairo steps per second, we're observing an increase of at least something on the order of 50X compared to what we have today.\"</p><p><strong><em><a href=\"https://cointelegraph.com/news/zero-barriers-podcast-series-crypto-adoption-fueled-by-zk-rollups\">Zero Barriers podcast series: Crypto adoption fueled by ZK-rollups</a></em></strong></p><p>The Quantum Leap upgrade does not solve the data availability problem faced by <a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">all ZK rollups.</a> The issue is that there is not enough room on Ethereum to write back all of the required data for the transactions on L2s, which pushes up costs.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As of now, 90% of costs on Starknet are associated with Data availability cost to L1.<br><br>Ackktually, Starknet will be the first L2 to offer Volition, and reduce fees by up to 85% post its launch later this year.<br><br>Moreover, the implementation of EIP4844 on L1 will further lower it.</p>&mdash; Starknet  (@Starknet) <a href=\"https://twitter.com/Starknet/status/1666351045155627008?ref_src=twsrc%5Etfw\">June 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kolodny said this would be addressed by the Version 13 Volition upgrade , which is due before the end of this quarter. It will give users granular control that enables them to store crucial or high value data on Ethereum, and less important data elsewhere. This is projected to cut fees by 85% and could pave the way for low fee micropayments or a boom in affordable and fast blockchain gaming.</p><p>One of the key components of the upgrade is Cairo-rs, which is a faster implementation of the Cairo virtual machine using Rust instead of Python from venture studio LambdaClass. </p><p>Founder Federico Carrone said Quantum Leap was a \"historic moment\" for blockchains in general.</p><blockquote>\"This release shows that it's possible to scale blockchains in a safe way thanks to STARKs and enables the creation of new applications that were impossible to think of a few years ago on top of a blockchain.\"</blockquote><p>StarkWare previously announced on June 29 that its validity proof ZK scaling technology had now facilitated more than <a href=\"https://techcrunch.com/2022/05/25/starkware-quadruples-valuation-to-8b-in-6-months-closing-round-in-choppy-market/\" target=\"_blank\" rel=\"noopener nofollow\">$1 trillion</a> in transactions.</p><p><strong><em><a href=\"https://cointelegraph.com/magazine/ethereum-eating-world-only-need-one-internet/\">Magazine: Ethereum is eating the world — ‘You only need one internet’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T15:58:41.000Z",
    "title": "Is the bear market finally nearing an end?",
    "url": "https://cryptoslate.com/insights/is-the-bear-market-finally-nearing-an-end/",
    "description": "<p>Quick Take In simple terms, the &#8220;realized price&#8221; refers to the total cost basis of all Bitcoin in existence, while the &#8220;Mayer Multiple&#8221; (MM) is a tool that quantifies the discrepancy between Bitcoin&#8217;s current price and its 200-day moving average. This variance can be used to pinpoint historical trends that might foretell the emergence of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/is-the-bear-market-finally-nearing-an-end/\">Is the bear market finally nearing an end?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T15:56:39.000Z",
    "title": "Polygon signs second big partnership with Indian government",
    "url": "https://cryptodaily.co.uk/2023/07/polygon-signs-second-big-partnership-with-indian-government",
    "description": "<p>Polygon has formed its second significant partnership with the Indian government.&nbsp;</p>\nA 3-way partnership\n<p>The Indian government has partnered with Polygon and Airchains in order to develop a blockchain-based land ownership system. Under this agreement Polygon will closely collaborate with government bodies and stakeholders to explore and implement blockchain solutions across various sectors.&nbsp;</p>\n<p>The primary goal of this partnership is to utilise Polygons' expertise in scalable blockchain infrastructure to enhance existing government initiatives and streamline operations. By integrating blockchain technology into critical systems.&nbsp;</p>\n<p>Airchain, a prominent player in the logistics industry, will also play a vital role in the partnership between Polygon and the Indian government. With its expertise in supply chain management and logistics solutions, Airchain will collaborate with Polygon to streamline and optimise the movement of goods within the blockchain-powered ecosystem.</p>\nTwo areas where blockchain provides the solution\n<p>Land document mutation is a real issue in India and can often lead to landowners unlawfully losing possession of their land. The implementation of a system based on the transparency of blockchain will aim to bring trust back into land ownership transactions.</p>\n<p>An additional and exciting new development that can become a reality through blockchain is that of fractional property ownership. Once properly implemented, the door will be open for many citizens to be able to own a fractional share of land, something that was unthinkable not so long ago.</p>\nA Digital India\n<p>This collaboration aligns with the Indian government's vision of a Digital India by accelerating the country's journey towards digital transformation. Polygons' established reputation, technical proficiency, and commitment to scalability make it an ideal partner.&nbsp;</p>\n<p>As demand for blockchain based solutions continues to rise, Polygon's infrastructure and expertise can play a crucial role in realising India's digital aspirations. This collaboration has the potential not only to unlock new possibilities but also drive innovation while establishing India as a global leader in blockchain technology.&nbsp;</p>\n<p>By actively pursuing partnerships with prominent projects like Polygon the Indian government demonstrates its proactive approach towards embracing cutting edge technologies. Such collaborations foster cooperation, knowledge sharing, and innovation&mdash;an ecosystem that can keep India at the forefront of digital progress.&nbsp;</p>\n<p>In its endeavour to further engage with the Indian government, Polygon aims to create ripple effects that surpass national boundaries. This distinctive partnership paves the way for other governments globally, exhibiting how blockchain technology can bring about transformative changes in addressing tangible obstacles and stimulating socioeconomic advancement.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T16:07:27.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T15:59:03.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s&#160;Solana price&#160;is $19.80 with a 24-hour trading volume of $618,897,839.&#160;Solana is up 3.58% in the last 24 hours.&#160;The current CoinMarketCap ranking is #10, with a live market cap of $7,273,881,101.&#160;It has a circulating supply of 394,890,490 SOL coins&#160;and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T15:55:52.000Z",
    "title": "South Korea ushers in banking revolution, inviting new entrants for the first time after 30 years",
    "url": "https://www.cryptopolitan.com/south-korea-ushers-in-banking-revolution-inviting-new-entrants/",
    "description": "South Korea, one of the world&#8217;s most vibrant economies, is witnessing an unprecedented shift in its banking industry. This comes as the government, to stimulate competition, is opening doors for new entrants into the banking sector for the first time in three decades. This move follows criticism of large bonuses paid to banking employees while ... <a title=\"South Korea ushers in banking revolution, inviting new entrants for the first time after 30 years\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-ushers-in-banking-revolution-inviting-new-entrants/\" aria-label=\"More on South Korea ushers in banking revolution, inviting new entrants for the first time after 30 years\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T15:46:27.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T16:00:14.000Z",
    "title": "Solana (SOL) Notches 16% Gains On Weekly Chart, Will It Cross $20?",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-notches-16-gains-on-weekly-chart-will-it-cross-20/",
    "description": "Solana (SOL) has recorded progressive gains in the past week, with its 7-day high at 15.95%. It is currently trading at $18.73 today with slight gains on its price. Although SOL is still 92.61% below its all-time high value of $260, its recent gains in the past week have pushed its price closer to the $20 price level.  SOL Price Outlook This Week Suggests A Bearish Trend SOL is in a sideways trend this week, following positive price action in the last two weeks. It has formed a small red candle on the weekly chart implying that the bears are active this week. Also, SOL is still trading in the lower region of the Donchian Channel (DC), expressing a bearish sentiment. Related Reading: Bitcoin Humpback Wallets Reach ATH, Is BlackRock Behind The Surge? Its Relative Strength Index (RSI) is at 45.60 in the neutral zone between the oversold region of 30 and the overbought region of 70. The RSI indicator reflects the sideways trend this week. SOL&#8217;s Moving Average Convergence/Divergence (MACD) is slightly above its signal line and shows convergence which is a bearish signal.  Although the MACD displays a negative value, the Histogram bars are green, signaling a bullish recovery ahead. So if the bulls prevail, SOL will likely move to an uptrend in the coming weeks.  SOL’s Key Support And Resistance Levels SOL is trading at $18.73 after it found critical support at the $15.43 price level weeks ago. This puts the altcoin close to the $19.48 resistance level. A break above the $19.48 resistance level will help to boost its price to reclaim the $20 psychological resistance level. If this happens, SOL will likely rally to the $21.81 resistance level after breaking above $20. However, a price decline below $18 in the short term remains possible due to its bearish outlook on the weekly chart.  Factors Influencing Solana’s Price There are several factors right now that could influence the SOL&#8217;s price. These factors include macroeconomic factors such as inflation and crypto regulation in several areas. Also, utility and adoption are vital factors alongside recent trends and developments in the ecosystem.  Another trend in SOL&#8217;s ecosystem likely influencing its price action this week is its decentralized exchange (DEX) volume. According to a report from the on-chain analytic platform DefiLlama, Solana&#8217;s weekly DEX volume increased to see it rank fifth on the list at press time.  Related Reading: Lido (LDO) Sustains Weekly Run With 16% Gain – What Fuels It? SOL’s DEX volume surged by 84%, and its 24-hour volume rose above $38 million. This increase will likely help to boost its price action in the coming week. However, despite an increase in its total DEX volume, its Total Value Locked (TVL) is stagnant. DefiLlama shows that SOL&#8217;s TVL has been stagnant since its decline in November 2022 following the collapse of FTX. The TVL is currently sitting at $273.26 million, with no notable increase in value despite slight gains in SOL&#8217;s price on the daily chart. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T15:56:55.000Z",
    "title": "Litecoin Bulls Set to Roar: Anticipated 13% Rally Looms as Key Resistance Level Beckons",
    "url": "https://www.crypto-news-flash.com/litecoin-bulls-set-to-roar-anticipated-13-rally-looms-as-key-resistance-level-beckons/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-bulls-set-to-roar-anticipated-13-rally-looms-as-key-resistance-level-beckons",
    "description": "<img width=\"510\" height=\"340\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Litecoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340.jpg 510w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340-104x69.jpg 104w\" sizes=\"(max-width: 510px) 100vw, 510px\" /> There is a potential for Litecoin to rise toward $120 before the halving event.   Litecoin has witnessed a substantial surge of more than 20%.  Over the past few weeks, Litecoin has had a constant upward trajectory, signaling a positive market attitude. Litecoin has effectively maintained its upward trajectory in recent trading sessions, keeping pace with [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T15:43:03.000Z",
    "title": "Bitcoin and Ether Holders Take Control: Exchange Supply Plummets, Goldman Sachs Takes Notice",
    "url": "https://www.crypto-news-flash.com/bitcoin-and-ether-holders-take-control-exchange-supply-plummets-goldman-sachs-takes-notice/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-and-ether-holders-take-control-exchange-supply-plummets-goldman-sachs-takes-notice",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/BTC-ETH-Bitcoin-Ethereum-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin and Ether miners are not as reliable in sending tokens to exchanges per a Goldman Sachs report. The lack of interest possibly stems from growing regulatory scrutiny on exchanges. Goldman Sachs Group Inc has highlighted in a new report a significant decline in the total monthly Bitcoin (BTC) and Ether (ETH) inflows from miners [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T15:56:00.000Z",
    "title": "Will Decentraland’s Price Bounce Back Amid Bearish Sentiment?",
    "url": "https://coinedition.com/will-decentraland-price-bounce-back-amid-bearish-sentiment/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Will Decentraland&#039;s Price Bounce Back Amid Bearish Sentiment?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Price-analysis-8-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the last 24 hours, bearish sentiment has gained the upper hand in the Decentraland (MANA) market as bulls struggled to break through the resistance at the 24-hour high of $0.4054. Subsequently, bears pushed the price down to an intra-day low of $0.3862, where the MANA market found support. The bearish grip remains strong, leading [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/will-decentraland-price-bounce-back-amid-bearish-sentiment/\">Will Decentraland&#8217;s Price Bounce Back Amid Bearish Sentiment?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]