[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T19:30:04.000Z",
    "title": "Soliciting the Saudi Crown Prince and Buying Snapchat: Ex-Alameda Chief Reveals Covert Dealings in SBF’s Fraud Hearing",
    "url": "https://news.bitcoin.com/soliciting-the-saudi-crown-prince-and-buying-snapchat-ex-alameda-chief-reveals-covert-dealings-in-sbfs-fraud-hearing/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Soliciting the Saudi Crown Prince and Buying Snapchat: Ex-Alameda Chief Reveals Covert Dealings in SBF&#039;s Fraud Hearing\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellison.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />FTX&#8217;s former CEO, Sam Bankman-Fried (SBF), allegedly guided staff to inappropriately utilize FTX client resources and hide financial vulnerabilities from various lenders, revealed former Alameda Research CEO Caroline Ellison during Wednesday&#8217;s hearing in SBF&#8217;s ongoing fraud case. Caroline Ellison Testimony Day 2 The saga continued on its sixth day with ex-Alameda chief, Caroline Ellison, sharing [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T19:14:17.000Z",
    "title": "Galxe announces fund recovery plan worth $396k following security breach",
    "url": "https://crypto.news/galxe-announces-fund-recovery-plan-worth-396k-following-security-breach/",
    "description": "Galxe unveils a comprehensive Fund Recovery Plan to reimburse affected users and bolster security following last week&#8217;s DNS breach. Following last week&#8217;s security breach, leading web3 community-building platform Galxe unveiled a comprehensive &#8216;Fund Recovery Plan&#8216; to address the losses incurred&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T19:11:07.000Z",
    "title": "Hong Kong’s regulatory approach criticized as “licensed to be killed”",
    "url": "https://crypto.news/hong-kongs-regulatory-approach-criticized-as-licensed-to-be-killed/",
    "description": "The Vice-President of HKUST criticizes Hong Kong's current virtual asset licensing system as \"Licensed to Be Killed,\" advocating for a new public blockchain for real-world assets."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T19:30:16.000Z",
    "title": "Bitcoin Supply Metric Touches New All-Time High, Time For Reversal?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-supply-metric-ath/",
    "description": "Bitcoin has been named the best performer among asset classes in 2023, but the cryptocurrency is still struggling to break new levels in its price. Despite the current bearish sentiment, many analysts have hinted and predicted a bull run in the coming months, especially as the market awaits the approval of a spot Bitcoin ETF.  This has probably prompted many investors to hold on to their coins, as on-chain metrics have shown that the amount of Bitcoin supply idling recently reached a new all-time high.  Unmoved Bitcoin Supply Reaches Record High The industry expects the SEC&#8217;s approval of spot Bitcoin ETFs to ignite the next bullish run for the price of Bitcoin. Although the SEC has so far rejected a number of requests for Bitcoin ETFs, many analysts believe it will not be long until one is accepted.  Related Reading: Crypto Analyst Puts Litecoin Price At $84, Here’s The Timeline Considering Bitcoin&#8217;s dominance of the entire crypto market capitalization, a spike in Bitcoin&#8217;s price is expected to flow into all other cryptocurrencies. As a result, investors have been keeping their holdings in expectation of a future price increase.  Recent data has shown that 94.8% of the total Bitcoin supply has not moved in the past month, indicating a new all-time high for the metric.  JUST IN: 94.8% of the #Bitcoin supply has not moved in the past month, a NEW ALL TIME HIGH 🚀 pic.twitter.com/bNa4MdFbKW — Bitcoin Magazine (@BitcoinMagazine) October 10, 2023 Similarly, a recent post by on-chain intelligence platform Glassnode alerts revealed that the amount of HODLed or lost Bitcoin reached a 5-year high of 7,906,288.227 BTC. 📈 #Bitcoin $BTC Amount of HODLed or Lost Coins just reached a 5-year high of 7,906,288.227 BTC View metric:https://t.co/dJK8rxBVD3 pic.twitter.com/6OxLnd611f — glassnode alerts (@glassnodealerts) October 6, 2023 The overall Bitcoin net flow into exchanges has decreased by 862.42 BTC ($23.27 million) in the past 24 hours, according to chart insights provided by IntoTheBlock. While this is relatively small compared to Bitcoin&#8217;s market cap, it shows investor mood might be changing into a bullish sentiment. Source: IntoTheBlock Time For Reversal? Bitcoin&#8217;s price just rebounded up to $27,100 after failing to gain traction above the $27,800 resistance in the midst of escalating Israel-Hamas tensions in the Middle East. Despite this, BTC still remains the best-performing investment asset this year, outperforming stocks and bonds with its year-to-date (YTD) return of 63.3%.   Related Reading: Crypto Analyst Identifies 6 Overlooked Altcoins That Could Be Due For A Price Surge Some investors view unmoved Bitcoin as a sign of solid faith in the network and adoption of a long-term mindset. Whatever the reason, Bitcoin&#8217;s unmoved supply metric is worth watching as an indicator of holder sentiment and potential future price pressure.  Recent happenings, particularly the tension of an oncoming recession in the US, have prompted billionaire hedge fund manager Paul Tudor Jones to assert that this is the best time to buy Bitcoin.  BTC still holding above $27,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-11T19:35:00.000Z",
    "title": "XRP Faces Further Decline as Bearish Dominance Continues",
    "url": "https://coinedition.com/xrp-faces-further-decline-as-bearish-dominance-continues/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrencies are known for their volatility, but XRP’s recent bearish performance has sparked particularly intense debate among experts. Besides being the fifth-largest crypto by market value, XRP has been the subject of a marathon legal skirmish. Historical Echoes and Market Movements Recently, XRP faced a significant price tumble, mirroring its performance after a crucial July [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-faces-further-decline-as-bearish-dominance-continues/\">XRP Faces Further Decline as Bearish Dominance Continues</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]