[
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T17:40:01.000Z",
    "title": "Coinbase beefs up its global advisory council with 4 national security experts ",
    "url": "http://cointelegraph.com/news/coinbase-beefs-up-global-advisory-council-national-security-experts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/94e57340-4392-4484-8838-516fd5f2e7b2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coinbase is getting wonky with prominent names in national security from both sides of the U.S. political divide. They will join former lawmakers and other strategists.</p>\n                    <p><p>Coinbase has expanded its Global Advisory Council with four national security experts, it <a href=\"https://www.coinbase.com/blog/four-national-security-experts-join-the-coinbase-global-advisory-council\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Nov. 7. The new members will help the cryptocurrency exchange assess the impact of regulatory uncertainty in the United States.</p><p>The Coinbase council will take on a decidedly more strategic tone with the new members. Mark Esper is a former U.S. secretary of defense, Stephanie Murphy is a former congressperson and a national security expert, Frances Townsend was homeland security adviser to former U.S. President George W. Bush, and David Urban is a former managing director of BRG Group. </p><p>The new council members will be joining former U.S. legislators Patrick Toomey, Tim Ryan and Sean Patrick Maloney. In addition to them, the original members of the council include Haun Ventures chief strategy officer Chris Lehane and Impact Research Polling founder John Anzalone. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Andy Vermaut shares:Controversial Activision Blizzard executive Frances Townsend steps down: Townsend will continue to advise CEO Bobby Kotick <br><br>The post Controversial Activision Blizzard executive Frances Townsend steps down appeared first on… <a href=\"https://t.co/WNC2Zyxsfq\">https://t.co/WNC2Zyxsfq</a> Thank you. <a href=\"https://t.co/UMQkK778pI\">pic.twitter.com/UMQkK778pI</a></p>&mdash; Andy Vermaut (@AndyVermaut) <a href=\"https://twitter.com/AndyVermaut/status/1576948455666511875?ref_src=twsrc%5Etfw\">October 3, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Global Advisory Council <a href=\"https://cointelegraph.com/news/coinbase-establishes-advisory-council-with-former-us-lawmakers\">was set up in May</a> as the third advisory council at Coinbase. The others are concerned with asset management and regulation. Among their members are former Securities and Exchange Commission Chair Jay Clayton and former CIA General Counsel Courtney Elwood. All of the councils have a bipartisan composition.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/coinbase-user-agreement-dispute-reaches-us-supreme-court\">Coinbase user agreement dispute reaches US Supreme Court</a></em></strong></p><p>The stated goal of the new appointments was to  “examine what consequences will result from regulatory uncertainty for crypto in the United States.” Coinbase clearly had an international perspective in mind. It linked its white paper “Defending American Leadership: The National Security Case for Crypto and Blockchain” in the announcement. </p><p>Despite an <a href=\"https://cointelegraph.com/news/coinbase-disputes-sec-authority-last-suit-dismissal-bid\">ongoing dispute with the SEC</a>, Coinbase CEO Brian Armstrong has <a href=\"https://cointelegraph.com/news/coinbase-ceo-leaving-usa-not-realm-possibility-right-now\">stated his commitment</a> to keeping the San Francisco-based exchange in the country, even as the crypto industry is <a href=\"https://cointelegraph.com/news/the-crypto-industry-has-already-started-moving-outside-of-the-us-says-ripple-ceo\">possibly moving away</a> from the United States. At the same time, Coinbase has <a href=\"https://cointelegraph.com/news/coinbase-is-planning-to-set-up-crypto-trading-platform-outside-us-report\">stepped up its activities</a> abroad. Those efforts have not always proceeded entirely smoothly, however, as <a href=\"https://cointelegraph.com/news/kazakhstan-authorities-confirm-blocked-access-coinbase-report\">was recently seen</a> in Kazakhstan.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/binance-coinbase-head-to-court-and-the-sec-labels-67-crypto-securities-hodlers-digest-june-4-10/\">Binance, Coinbase head to court, and the SEC labels 67 crypto-securities: Hodler’s Digest, June 4-10</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T17:40:02.000Z",
    "title": "Anticipated Bitcoin halving may contribute to mining stocks’ decline despite Bitcoin’s rise",
    "url": "https://cryptoslate.com/insights/anticipated-bitcoin-halving-may-contribute-to-mining-stocks-decline-despite-bitcoins-rise/",
    "description": "<p>Quick Take Over the past three months, the Bitcoin landscape has presented a striking anomaly. Bitcoin, the flagship cryptocurrency, has experienced a 20% surge, climbing near its year-to-date (YTD) high, around $35,000. Conversely, this upward momentum appears to have bypassed Bitcoin mining stocks, which have reported a substantial decline. Prominent mining stocks such as Cleanspark, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/anticipated-bitcoin-halving-may-contribute-to-mining-stocks-decline-despite-bitcoins-rise/\">Anticipated Bitcoin halving may contribute to mining stocks’ decline despite Bitcoin&#8217;s rise</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-07T18:04:59.000Z",
    "title": "Broker Complaint Alert (BCA) Marks 3 Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide",
    "url": "https://cryptodaily.co.uk/2023/11/broker-complaint-alert-bca-marks-3-years-of-successful-crypto-scam-recovery-bringing-hope-to-victims-worldwide",
    "description": "Broker Complaint Alert (BCA) Marks 3 Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T17:58:20.000Z",
    "title": "Study lowers Ethereum price expectation for next 7 years",
    "url": "https://crypto.news/study-lowers-ethereum-price-expectation-for-next-7-years/",
    "description": "Cryptocurrency experts have lowered their predictions for Ethereum, over the next few years."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T17:44:44.000Z",
    "title": "Aave DAO to consider security patches after Nov. 4 market freeze",
    "url": "https://crypto.news/aave-dao-to-consider-security-patches-after-nov-4-market-freeze/",
    "description": "A coalition of Aave contributors and web3 developers put forth a proposal to address vulnerabilities discovered in two versions of defi’s largest lending protocol which prompted a halt on select markets."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T18:00:13.000Z",
    "title": "Self-Authentication System Of Shiba Inu Has Technical Issues, Developer Reveals",
    "url": "https://www.newsbtc.com/shiba-inu/self-authentication-system-of-shiba-inu-has-technical-issues-developer-reveals/",
    "description": "The newly launched SHIB self-authentication system, Shibdentity, has witnessed some technical issues. Kaal Dhairya, a Shiba Inu developer, revealed this today, November 7. As part of their efforts to make the Shib Ecosystem self-sufficient, the developers also introduced The Shib Magazine. Shiba Inu Developers Launches The Shib Magazine The Shiba Inu developers recently launched Shib Name Service (SNS) on its layer-2 network, Shibarium. The Shib Name Service aims to introduce the Shibdentity, a self-custodial identity system for the SHIB ecosystem Related Reading: Near-Term XRP Price Rally Of 270% Is Imminent: Crypto Analyst The product aims to make the ecosystem sufficiently decentralized so users wouldn&#8217;t have to depend on third-party platforms. Shibdentity creates a decentralized identity platform, enhancing security and user experience and eliminating censorship so that users can control their digital identities. As stated in an October 31 disclosure, the launch of the SNS marks a milestone for Shiba Inu. The team described the newly launched feature as a disruptor introducing something special and human-readable addresses to the ecosystem.  It allows users to self-manage their Shibarium addresses without third-party interference. They can quickly transfer tokens to others using unique initials.  Meanwhile, the SHIB self-authentication system Shibdentity, launched on November 1, developed some technical issues. The developer has yet to reveal the reason behind the technical glitch. However, the issue may be due to overwhelming traffic on the system.  Dhairya noted that the developer team is working to resolve the issues and have things back to normal as soon as possible. “The newly launched self-custodial authentication system as part of the Shib Magazine is having technical issues for some users. We are working towards fixing this as soon as possible,” the developer said. Shiba Inu Developers Launches The Shib Magazine For Timely Ecosystem Updates The Shib Magazine aims to furnish the community with updates regarding Shib Inu products and services, including the layer-2 network Shibarium. In addition, the newly launched magazine will also report on the latest interviews with top cryptocurrency industry experts.  This will ensure the community members remain up-to-date on happenings around the ecosystem and the broader crypto market. Moreover, when fully up and running, the magazine will promote a timely update of trending tokens and upcoming Shibarium features.  According to reports, the first 1,000 readers will receive an NFT of the magazine cover for free. The SHIB Doggy DAO Foundation sponsors this effort. More Updates On Shibarium Progressive Strides Shibarium has proven successful since its launch in late August, covering significant milestones in the subsequent months. On October 18, the layer-2 network exceeded 3.5 million in total transactions, with over 1.2 million blocks in less than two months post-launch. Currently, Shibarium boasts a total of 3.8 million transactions and over 1.5 blocks. Related Reading: Chainlink Enters Bull Territory, Signals Long-Term Uptrend — Crypto Expert There was a popular notion that the launch of Shibarium would boost Shiba Inu’s price by facilitating token burns, lowering transaction costs, and increasing speed. However, within the launch period, Shiba Inu recorded a considerable price decline, even when most tokens soared. But recently, Shiba Inu has posted notable strides, recording over 15% 30-day price increases and a nearly 6% gain in the last seven days. Over the past 24 hours, SHIB price has increased over 2% and trades at $0.0000081. Featured image from Shutterstock and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T17:54:46.000Z",
    "title": "Bitcoin Faces Scrutiny: UN Warns of Worrying Environmental and Social Effects",
    "url": "https://www.crypto-news-flash.com/__trashed-7/?utm_source=rss&utm_medium=rss&utm_campaign=__trashed-7",
    "description": "<img width=\"512\" height=\"394\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-74.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-74.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-74-300x231.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A United Nations study shows Bitcoin mining consumes more electricity than many countries and heavily impacts the environment. Bitcoin&#8217;s reliance on fossil fuels for mining has a significant carbon footprint, and its water usage is large enough to affect hundreds of millions of people. A recent study issued by the United Nations has drawn global [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T17:45:55.000Z",
    "title": "October Overwhelmingly Positive for Cryptos Like Dogecoin, Solana and Bitcoin Spark",
    "url": "https://www.crypto-news-flash.com/october-overwhelmingly-positive-for-cryptos-like-dogecoin-solana-and-bitcoin-spark/?utm_source=rss&utm_medium=rss&utm_campaign=october-overwhelmingly-positive-for-cryptos-like-dogecoin-solana-and-bitcoin-spark",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-10.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-10.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-10-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-10-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Uptober has undeniably lived true to its hype, especially for cryptos like Dogecoin (DOGE), Solana (SOL), and Bitcoin Spark (BTCS). Let’s explore. Dogecoin price prediction The Dogecoin (DOGE) price broke free from a multi-month downtrend in October, confirming the potential for a trend reversal. The meme coin’s Relative Strength Index (RSI), which had made three [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T17:39:51.000Z",
    "title": "IOTA 2.0 Unleashed: A Quantum Leap in Decentralized Innovation",
    "url": "https://www.crypto-news-flash.com/iota-2-0-unleashed-a-quantum-leap-in-decentralized-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=iota-2-0-unleashed-a-quantum-leap-in-decentralized-innovation",
    "description": "<img width=\"5500\" height=\"3667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1.jpg 5500w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-48x32.jpg 48w\" sizes=\"(max-width: 5500px) 100vw, 5500px\" />IOTA 2.0 is designed to enable digital autonomy, underpinned by key principles such as accessibility, parallelism, and sustainable tokenomics. Billy Sanders, Director of Research at the IOTA Foundation discussed the protocol&#8217;s snapshot files and commitments, its unique approach to block creation, the introduction of a validator system. IOTA developers and research scientists have been working [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-07T17:42:00.000Z",
    "title": "The SEC Struggles to Recruit Crypto Experts, Report Says",
    "url": "https://coinedition.com/the-sec-struggles-to-recruit-crypto-experts-report-says/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/08.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The SEC Struggles to Recruit Crypto Experts, Report Says\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/08.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/08-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/08-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A U.S. government report found that the SEC faces difficulty hiring crypto experts. Professionals were reportedly reluctant to divest their crypto holdings to work for the agency. The report cited conflict of interest laws and competition from the private sector, hurting expert recruitment. The United States Securities and Exchange Commission (SEC) is facing difficulties in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/the-sec-struggles-to-recruit-crypto-experts-report-says/\">The SEC Struggles to Recruit Crypto Experts, Report Says</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T17:55:48.000Z",
    "title": "Hong Kong Considering Crypto ETFs as Part of Effort To Become Leading Digital Asset Hub: Report",
    "url": "https://dailyhodl.com/2023/11/07/hong-kong-considering-crypto-etfs-as-part-of-effort-to-become-leading-digital-asset-hub-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/hong-kong-etfs-part.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Hong Kong is reportedly weighing the possibility of allowing spot cryptocurrency exchange-traded funds (ETF). In a new Bloomberg report, Hong Kong’s Securities and Futures Commission CEO Julia Leung outlines what it would take for spot crypto ETFs to be authorized in the city-state. “We welcome proposals using innovative technology that boosts efficiency and customer experience. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/hong-kong-considering-crypto-etfs-as-part-of-effort-to-become-leading-digital-asset-hub-report/\">Hong Kong Considering Crypto ETFs as Part of Effort To Become Leading Digital Asset Hub: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]