[
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T18:45:08.000Z",
    "title": "Flow blockchain resilience amid global NFT decline in Q2 2023",
    "url": "https://cryptoslate.com/flow-blockchain-resilience-amid-global-nft-decline-in-q2-2023/",
    "description": "<p>In the face of a global decline in NFTs interest, Flow (FLOW) blockchain intriguingly showcases growth and resilience, navigating the wave of Q2 2023 with a blend of remarkable achievements and challenges. Data from DefiLlama shows that NFT volume has fallen to two-year lows, with OpenSea, remarked in purple, affected the most. Blur, shown in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/flow-blockchain-resilience-amid-global-nft-decline-in-q2-2023/\">Flow blockchain resilience amid global NFT decline in Q2 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T19:06:21.000Z",
    "title": "Contemporary Giant Yue Minjun Embarks on a Revolutionary Web3 Journey with his First NFT Project Exclusively on LiveArt",
    "url": "https://cryptodaily.co.uk/2023/07/contemporary-giant-yue-minjun-embarks-on-a-revolutionary-web3-journey-with-his-first-nft-project-exclusively-on-liveart",
    "description": "<p>New York, USA, July 27th, 2023, Chainwire</p><p>LiveArt, the Web3 Platform for Art and Culture, announced a groundbreaking NFT collection, Kingdom of the Laughing Man, by Yue Minjun, one of the most important contemporary Chinese artists creating today.&nbsp;</p><p>Yue Minjun, the contemporary art giant of the 21st century, enters the digital art space with his inaugural Web3 project. The artist&rsquo;s works fetch millions of dollars at auctions worldwide (USD 6.9 million sales record at Christie's HK) and are in the permanent collections of the SFMoma, Denver Art Museum, The Culture Centre of Francois Mitterrand, Guangdong Museum of Art, Shenzhen Art Museum, and other leading art institutions. Collaborations with artists like KAWS and fashion brands like Comme De Garcons have cemented Yue Minjun's signature style in global pop culture.</p><p>Kingdom of the Laughing Man launches with Boundless, a generative collection of 1,200 unique NFT artworks echoing Yue Minjun&rsquo;s iconic self-portraits. All Yue Minjun Boundless collection holders will have the opportunity to purchase unique physical prints signed by the artist based on the NFTs they own. Subsequent drops will feature 3D animated art and culminate with an immersive metaverse experience. The collection is offered exclusively on LiveArt.</p>\"I've explored numerous media with my art over the years. This new digital frontier excites me the most as I can bring my art to life in a way that I haven't been able to with physical media. In Web3 I can create a new engaging experience and relationship with the next generations of art collectors shaping the art world of the future,\" says Yue Minjun.\"Yue Minjun exemplifies the caliber of artists who call LiveArt home in this new digital world. I think he is probably the most significant contemporary artist to commit fully to a Web3 journey today, and we are honored and excited for the historic opportunity we can offer our collectors,\" says Boris Pevzner, CEO and Co-Founder of LiveArt.<p>The first drop is set to launch on August 8, 2023, on LiveArt. It is expected to sell out during a \"pre-sale\" exclusive to collectors and LiveArt X Card holders, according to LiveArt insiders. To ensure a spot on the pre-sale list, click here.</p><p>Press contacts: press@liveart.io&nbsp;</p><p>About LiveArt</p><p>Founded by Sotheby's and Christie's art market veterans and backed by Binance Labs and Animoca Brands, LiveArt is the global Web3 platform for art and culture. LiveArt blends AI and blockchain with intimate art market knowledge to bring exclusive Web3 collecting experiences to a global audience. LiveArt's $ART utility token powers the LiveArt Protocol that drives value for the LiveArt ecosystem through membership and loyalty programs for the communities of LiveArt and its partners.&nbsp;</p><p>For more information: Official Website | Twitter | Discord | Instagram</p><p></p><p>Yue Minjun, photo by Michelle Yue</p><p></p><p></p><p>Artwork from the Kingdom of the Laughing Man: Boundless (2023) collection by Yue Minjun, published by LiveArt.</p><p></p><p>Artwork from the Kingdom of the Laughing Man: Boundless (2023) collection by Yue Minjun, published by LiveArt.</p><p></p><p></p><p>Artwork from the Kingdom of the Laughing Man: Boundless (2023) collection by Yue Minjun, published by LiveArt.</p><p></p><p>Artwork from the Kingdom of the Laughing Man: Boundless (2023) collection by Yue Minjun, published by LiveArt.</p>ContactMarketing &amp; PartnershipsElena ZavelevLiveArtelena@liveart.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T18:45:00.000Z",
    "title": "Department of Justice Drops Charges Against Sam Bankman-Fried",
    "url": "https://cryptodaily.co.uk/2023/07/department-of-justice-drops-charges-against-sam-bankman-fried",
    "description": "<p>The US Department of Justice announced that it had dropped the charges of illegal campaign finance activity against the FTX founder Sam Bankman-Fried.</p>\n<p>According to a filing of July 26, the US Department of Justice (DOJ) agreed to drop one of the charges related to illegal campaign finance activity against the disgraced FTX Democrats megadonor and FTX founder Sam Bankman-Fried.&nbsp;</p>\nThe Crypto Robinhood Uncovered\n<p>After months of investigation, it was estimated that Sam Bankman-Fried donated $93 million worth of stolen customer funds to the US politicians. The FTX founder is known as one of the largest Democratic Party donors. Some of Bankman-Fried&rsquo;s illegal contributions include donations to the 2020 Presidential campaign, as well as campaigns of the U.S. Senators and U.S. House representatives. Prosecutors suggested that the crypto mogul had made these contributions to influence the policies that could potentially benefit the crypto industry.</p>\n<p>Following the sudden collapse of the Sam Bankman-Fried&rsquo;s crypto exchange FTX due to its inability to repay the clients, it was also revealed that the company&rsquo;s former CEO had authorized the diversion of $2 billion from customers' funds to cover loans and expenses for the firm.</p>\nOne of the Eight Charges Dropped\n<p>Sam Bankman-Fried was originally indicted on eight charges in December. One of these charges is now dropped thanks to the extradition treaty between the United States and the Bahamas. Apparently, the Bahamas submitted a filing to New York federal judge Lewis Kaplan that dropped the charges of campaign finance fraud.</p>\n\n<p>The Department of Justice letter said, &ldquo;The Government has been informed that The Bahamas notified the United States earlier today that The Bahamas did not intend to extradite the defendant on the campaign contributions count. Accordingly, in keeping with its treaty obligations to The Bahamas, the Government does not intend to proceed to trial on the campaign contributions count.&rdquo;</p>\n\n<p>The FTX founder will still be charged with the other seven counts present in the DOJ&rsquo;s original indictment. Those include charges regarding wire fraud, securities fraud, and money laundering.&nbsp;</p>\nWhat&rsquo;s Next for Sam Bankman-Fried?\n<p>After being released on $250 million bail back in December, the bail status of Sam Bankman-Fried is now in jeopardy due to his latest interview with the New York TImes. The persecutors accused the former FTX CEO of discrediting their witness, Caroline Ellison. As a result, Bankman-Fried has agreed to an interim gag order that prevents him from publicly discussing the case. The terms of his bail now depend on federal prosecutors and attorneys.</p>\n\n<p>&ldquo;I am certainly very mindful of his First Amendment rights, and I am very mindful of the government&rsquo;s interest here, which I take very seriously. And I say to the defendant, Mr. Bankman-Fried: You better take it seriously, too.&rdquo; commented Judge Kaplan.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T19:07:47.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T19:00:00.000Z",
    "title": "Follow The Path Of Crypto Millionaires: Unlock Wealth With These Three Meme Coin Investments: Floki (FLOKI), DigiToads (TOADS), And Shiba Inu (SHIB)",
    "url": "https://www.cryptopolitan.com/follow-the-path-of-crypto-millionaires-unlock-wealth-with-these-three-meme-coin-investments-floki-floki-digitoads-toads-and-shiba-inu-shib/",
    "description": "Meme coins were projects created solely for humor and hype. But recently, the rise of meme coins has unlocked new wealth opportunities for investors. Following the new wave of innovative crypto projects, investors seek the best crypto investment to unlock wealth. DigiToads (TOADS), Floki (FLOKI), and Shiba Inu (SHIB) are three meme coins that empower ... <a title=\"Follow The Path Of Crypto Millionaires: Unlock Wealth With These Three Meme Coin Investments: Floki (FLOKI), DigiToads (TOADS), And Shiba Inu (SHIB)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/follow-the-path-of-crypto-millionaires-unlock-wealth-with-these-three-meme-coin-investments-floki-floki-digitoads-toads-and-shiba-inu-shib/\" aria-label=\"More on Follow The Path Of Crypto Millionaires: Unlock Wealth With These Three Meme Coin Investments: Floki (FLOKI), DigiToads (TOADS), And Shiba Inu (SHIB)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T18:55:37.000Z",
    "title": "Nexo joins sanctions association amid increased scrutiny",
    "url": "https://www.cryptopolitan.com/nexo-sanctions-association-amid-scrutiny/",
    "description": "As the Web3 ecosystem faces increased regulatory scrutiny, cryptocurrency lending platform Nexo is taking proactive steps to enhance its compliance measures. The platform has decided to leverage training resources, connections, and data by becoming a member of the Association of Certified Sanctions Specialists (ACSS). The ACSS is an organization that provides training and certification for ... <a title=\"Nexo joins sanctions association amid increased scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nexo-sanctions-association-amid-scrutiny/\" aria-label=\"More on Nexo joins sanctions association amid increased scrutiny\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T18:44:38.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T19:07:15.000Z",
    "title": "US SEC chair says crypto riddled with fraud and non-compliance",
    "url": "https://crypto.news/us-sec-chair-says-crypto-riddled-with-fraud-and-non-compliance/",
    "description": "US SEC chair, Gary Gensler, is concerned about the pervasive fraud and regulatory non-compliance in the crypto market"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T18:51:22.000Z",
    "title": "Swisstronik launches testnet, announces $70k bug bounty",
    "url": "https://crypto.news/swisstronik-launches-testnet-announces-70k-bug-bounty/",
    "description": "Swisstronik, an interoperability-oriented layer-1 network, has released its testnet 1.0 and a $70K bug bounty program"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T18:41:22.000Z",
    "title": "CME Group: ETHBTC reacts to tech stocks, USD, and Bitcoin supply changes",
    "url": "https://crypto.news/cme-group-ethbtc-reacts-to-tech-stocks-usd-and-bitcoin-supply-changes/",
    "description": "CME Group report reveals that ETHBTC pair is heavily influenced by tech stock performance, the US dollar strength, and Bitcoin supply changes"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T19:00:33.000Z",
    "title": "Sui Foundation Dumps MovEX After Contract Violation",
    "url": "https://www.newsbtc.com/news/sui-foundation-dumps-movex-after-contract-violation/",
    "description": "Sui Foundation has ended its relationship with the decentralized exchange MovEX following a breach of contract. The foundation alleged that MovEX had released a significant amount of SUI tokens &#8211; subject to a contractual lockup &#8211; into circulation. Sui Foundation Terminates Relationship With MovEX For Unlocking 2.5 Million Tokens On July 26, 2023, the Sui Foundation released a blog post, explaining the network’s token supply and the essence of its token release schedule. The foundation also announced the termination of its relationship with MovEX after breaching its token lockup contract.  Related Reading: Shibarium Bridge Goes Live In Beta But There’s A Catch According to the foundation, early contributors to the network received SUI tokens that were subject to a lockup period &#8211; only to be released based on a preset schedule. MovEX was one of the recipients of this token allocation, collecting 2.5 million SUI tokens as payment for its contribution to the exchange product DeepBook.  However, the decentralized exchange (DEX) was found to have violated the token lockup by moving its entire allotment of tokens in three (625,000 SUI) transactions to three separate wallets.  At the time, these transactions raised questions about the Sui Foundation, with some tweets implying that the foundation “intentionally misrepresented” the token emissions schedule. The foundation denied these claims and has further clarified in its latest post that it didn&#8217;t consent to the three transactions by MovEX.  As a result of these events, the Sui Foundation has cut off ties with the decentralized exchange. It also confirmed that no additional SUI tokens will be distributed to MovEX, nor will the DEX remain a contributor to DeepBook. “By July 3, upon Sui Foundation’s request, MovEX had moved the entire allotment of 2.5M tokens to a wallet at a qualified custodian who will release them according to the contractual lockup schedule in compliance with the previously released token emissions schedule,” the foundation noted. According to the analytics dashboard Token Unlocks, a total of 646.25 million SUI tokens have been unlocked so far, with the next unlocking event expected to take place on July 31. SUIUSDT valued at $0.6359 &#124; Source: daily SUIUSDT chart from TradingView MovEX Addresses Community On Situation On Thursday, July 27, the team behind MovEX released a statement on Twitter, addressing its community on the situation. In the tweet, the project acknowledged that it received the SUI tokens &#8211; as claimed by the Sui Foundation. Related Reading: Short-Lived Hype: Worldcoin (WLD) Signups Dwindle Less Than A Week After Launch MovEX also stated that it transferred its entire allotment of SUI tokens to “custodian and non-custodian wallets”. While confirming that it has moved the tokens back to a qualified custodian, the DeFi protocol claims to understand the decision of the Sui Foundation. MovEX is a decentralized exchange native to the Sui network. According to the protocol’s whitepaper, it combines an automated market maker (AMM) and order book to create a hybrid liquidity DEX. Featured image from Dreamstime, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T19:06:45.000Z",
    "title": "Contemporary Giant Yue Minjun Embarks on a Revolutionary Web3 Journey with his First NFT Project Exclusively on LiveArt",
    "url": "https://www.crypto-news-flash.com/contemporary-giant-yue-minjun-embarks-on-a-revolutionary-web3-journey-with-his-first-nft-project-exclusively-on-liveart/?utm_source=rss&utm_medium=rss&utm_campaign=contemporary-giant-yue-minjun-embarks-on-a-revolutionary-web3-journey-with-his-first-nft-project-exclusively-on-liveart",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Yue_Minjun_Premint_14_1690471927NMbsdmfSQ3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Yue_Minjun_Premint_14_1690471927NMbsdmfSQ3.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Yue_Minjun_Premint_14_1690471927NMbsdmfSQ3-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Yue_Minjun_Premint_14_1690471927NMbsdmfSQ3-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Yue_Minjun_Premint_14_1690471927NMbsdmfSQ3-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />New York, USA, July 27th, 2023, Chainwire LiveArt, the Web3 Platform for Art and Culture, announced a groundbreaking NFT collection, Kingdom of the Laughing Man, by Yue Minjun, one of the most important contemporary Chinese artists creating today.  Yue Minjun, the contemporary art giant of the 21st century, enters the digital art space with his [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T18:45:12.000Z",
    "title": "US Lawmakers To Consider Legislation That Would Clarify When Crypto Assets Are Securities: Report",
    "url": "https://dailyhodl.com/2023/07/27/us-lawmakers-to-consider-legislation-that-would-clarify-when-crypto-assets-are-securities-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/us-to-see-clarify.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Members of a key congressional committee reportedly just voted to advance a proposed legislation that will establish when crypto assets should be treated as securities or commodities. According to Reuters, the House Financial Services Committee passed the proposed law on Wednesday and the House Agriculture Committee will consider the same bill on Thursday. If the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/us-lawmakers-to-consider-legislation-that-would-clarify-when-crypto-assets-are-securities-report/\">US Lawmakers To Consider Legislation That Would Clarify When Crypto Assets Are Securities: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T18:41:49.000Z",
    "title": "Coinbase CEO Brian Armstrong Calls for Support of Legislation That Will Offer Regulatory Clarity for Crypto",
    "url": "https://dailyhodl.com/2023/07/27/coinbase-ceo-brian-armstrong-calls-for-support-of-legislation-that-will-offer-regulatory-clarity-for-crypto/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Coinbase-CEO-Brian-Armstrong.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of Coinbase is calling for support of legislation that would establish clear guidelines for the digital asset industry. In a new announcement, Coinbase chief executive Brian Armstrong urges his Twitter audience to email their legislators to vote yes on the Financial Innovation and Technology for the 21st Century Act, which he says would [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/coinbase-ceo-brian-armstrong-calls-for-support-of-legislation-that-will-offer-regulatory-clarity-for-crypto/\">Coinbase CEO Brian Armstrong Calls for Support of Legislation That Will Offer Regulatory Clarity for Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]