[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T14:06:27.000Z",
    "title": "UK Blazes Trail With New Cryptocurrency Rules",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/05/uk-blazes-trail-with-new-cryptocurrency-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The FCA’s regulations provide greater legal clarity for developers but place additional compliance burdens on companies marketing cryptocurrencies, says Preston Byrne, a partner at Brown Rudnick."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-05T14:00:00.000Z",
    "title": "Payments Platform Nuggets Working With Bank of England on Privacy Layer for Digital Pound ",
    "url": "https://www.coindesk.com/policy/2023/07/05/payments-platform-nuggets-working-with-bank-of-england-on-privacy-layer-for-digital-pound/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The BofE said in February that a digital pound was likely needed, but that it will not make a decision on issuing one until at least 2025."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-05T14:00:00.000Z",
    "title": "Blockchain Project Interlay Wants its New Platform to Become a ‘One-Stop-Shop for Bitcoin DeFi’",
    "url": "https://www.coindesk.com/tech/2023/07/05/blockchain-project-interlay-wants-its-new-platform-to-become-a-one-stop-shop-for-bitcoin-defi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“We've only seen the tip of the iceberg with bitcoin DeFi today,” said Interlay CEO and Co-founder Alexei Zamyatin in an exclusive interview with CoinDesk."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-05T13:45:12.000Z",
    "title": "Generative Tezos Art Platform fxhash Adds Ethereum in Multichain Push",
    "url": "https://decrypt.co/147375/generative-tezos-art-platform-fxhash-adds-ethereum-multichain-push",
    "description": "Tezos generative art platform fxhash is expanding to include Ethereum, marking its evolution into a multichain model."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T14:01:00.000Z",
    "title": "Heating a home with a Bitcoin miner: Staying warm with sats",
    "url": "https://cointelegraph.com/news/heating-a-home-with-a-bitcoin-miner-staying-warm-with-sats",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/dce45848-1f69-443b-976e-1c7e9776d0ba.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The heat generated from Bitcoin mining could make mining at home more accessible, affordable and environmentally friendly.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miners emit a lot of heat. </p><p>Some miners use that heat to <a href=\"https://cointelegraph.com/news/water-great-idea-bitcoin-mining-heats-this-swimming-pool\">warm swimming pools</a>, dehydrate meat to <a href=\"https://cointelegraph.com/news/seven-times-bitcoin-miners-made-the-world-a-better-place\">make beef jerky</a> or even <a href=\"https://cointelegraph.com/news/sustainable-bitcoin-miner-uses-waste-heat-to-dry-wood\">dry out timber</a> at a Swedish hydropower Bitcoin farm. In Ireland, the “<a href=\"https://cointelegraph.com/news/how-irish-farmers-turn-cow-dung-into-digital-gold-bitcoin\">Bitcoin Farmer” joked</a> that he hangs out laundry to dry in front of his Bitcoin miner.</p><blockquote class=\"twitter-tweet\"><p lang=\"cs\" dir=\"ltr\">S9 <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> beef jerky <a href=\"https://t.co/Fyc3lz98kQ\">pic.twitter.com/Fyc3lz98kQ</a></p>&mdash; ₿usiness Cat (@_business_cat) <a href=\"https://twitter.com/_business_cat/status/1558083967420596224?ref_src=twsrc%5Etfw\">August 12, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Miner heat is not <a href=\"https://bitcointalk.org/index.php?topic=155841.0;all\" target=\"_blank\" rel=\"noopener nofollow\">new</a> to the Bitcoin industry. In the early days of Bitcoin, enthusiasts would mine the cryptocurrency with their everyday computers, leading to overheating and stories of uncomfortably <a href=\"https://bitcointalk.org/index.php?topic=7216.405;imode\" target=\"_blank\" rel=\"noopener nofollow\">warm</a> environments. </p><p>Bitcoin mining has changed since the early days. With the markedly increased difficulty of solving hash computations on the Bitcoin blockchain, miners have ditched ubiquitous graphics processing units for more powerful application specific integrated circuits, or ASICS. However, heating and cooling still remain an issue.</p><p>In a nod to the future of capturing waste heat, Satoshi Nakamoto <a href=\"https://www.google.com/url?q=https://bitcointalk.org/index.php?topic%3D721.msg8431%23msg8431&amp;sa=D&amp;source=docs&amp;ust=1688553996456554&amp;usg=AOvVaw2tW2aUpxIuxL0ZOVqjzbJB\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> a message showing precognition: </p><blockquote>“The heat from your computer is not wasted if you need to heat your home.” </blockquote><p>So why not take advantage of that heat and use it for productive resources? That’s exactly what I wanted to experiment with at my home near Lisbon, Portugal, this winter. </p><p>Do-it-yourself solutions that utilize Bitcoin miner “waste” heat in the home are increasingly popular. However, it can be tricky. The #mine4heat hashtag on Twitter boasts Bitcoin hobbyists who can rewire and soundproof Bitcoin miners — without electrocuting themselves.</p><p>One savvy miner <a href=\"https://cointelegraph.com/news/gas-heater-broke-down-i-ll-just-heat-my-caravan-with-a-bitcoin-miner\">heats their mobile home</a>, an airstream, while others have found ingenious ways to mine Bitcoin and keep their homes toasty:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Proud DIY basement miner dude that exhausts his heat with trash bags taped end to end when I dont need it:) <a href=\"https://t.co/S1XTz3T08p\">pic.twitter.com/S1XTz3T08p</a></p>&mdash; Barc (@Barcinthedark) <a href=\"https://twitter.com/Barcinthedark/status/1649262019781214208?ref_src=twsrc%5Etfw\">April 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, for the “average Joe,” like me, it seems daunting. I’m a technologically stunted Bitcoin enthusiast who took years to run a node. So while the idea is appealing, I feared I might burn the house down. </p><p>There are several heater-cum-Bitcoin mining companies, like Heatbit and BitHeater, which are aware of Bitcoin miners’ ability to make money while heating spaces, but also that there could be pent-up demand for a plug-and-play solution.</p><p>Heatbit founder Alex Busarov told Cointelegraph that while ease of use was appealing, the environmental use case for Bitcoin miner heat drove the mission: “We want to make mining truly green,” he said.</p><p>Busarov said, “The claims that ‘xx%’ of energy used for mining comes from renewable energy’ are misleading. While the number might sound impressive, it ignores the fact that this renewable energy would have been added to the grid if not used for industrial mining.”</p><blockquote>“Bitcoin mining is only genuinely green when combined with heating; this way, no extra energy is consumed by mining.”</blockquote><p>Busarov referred to the statistics and claims published by Bitcoin mining advocates, including that Bitcoin <a href=\"https://cointelegraph.com/news/this-earth-day-analysts-say-bitcoin-mining-is-naturally-gravitating-to-green-energy\">is the greenest industry</a> and that Bitcoin mining incentivizes <a href=\"https://cointelegraph.com/news/sustainable-energy-usage-for-btc-mining-grows-nearly-60-in-a-year\">renewable energy buildout</a>. Nonetheless, Bitcoin miners take a lot of heat even when using <a href=\"https://cointelegraph.com/news/bitcoin-mining-heats-water-in-brooklyn-bathhouse-users-flip-out\">waste heat for productive purposes. </a></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\">Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</a></em></strong></p><p>Personally, I was more focused on the power draw of the Heatbit Bitcoin miners. If it consumes less electricity than my standard electric heaters, it would be a no-brainer for use over the winter — so I got my hands on one and put it to the test. </p><p>The result: for four months, I heated my small flat in Portugal with a Heatbit. </p><h2>Set up</h2><p>The package arrived in mid-November during an unseasonably hot spell. I lugged it upstairs, unboxed it and scanned the instructions. It seemed too good to be true. The instructions are idiot-proof. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a3deaba9-6ae5-4aa0-b0e6-8305f2cca5c7.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Heatbit box. Cointelegraph slippers for scale.</em></figcaption></figure><p>I connected the Heatbit to power, downloaded the Heatbit app, and it quickly found the Heatbit device and synchronized. I selected the hot setting and soon felt a warm stream of air coming from the vent at the top. I pushed my ear to it and was surprised at how quiet it was.</p><p>Bitcoin miners are very, very loud when turned up full blast. Some residents of a Norweigan town <a href=\"https://cointelegraph.com/news/norwegian-town-wants-noisy-bitcoin-miners-out-experts-respond\">have even made noise complaints</a> about a nearby industrial-scale Bitcoin mine, but my fridge is much louder than the Heatbit. </p><p>I waited until I had mined one satoshi — less than a penny — which took about 15 minutes. By that point, the balcony enclosure of my flat was uncomfortably warm, so I turned it off. </p><p>Over the next few months, I turned the heater on and off, moving it around the flat on its two rear wheels. </p><h2>Can you make money with it?</h2><p>Technically yes — but not really. I raked in 30,000 satoshis during winter, which is just over $10.</p><p>The miner was whirring away for a couple of hours most evenings and in the mornings I was at home. Sadly, I wasn’t in Portugal a great deal, <a href=\"https://cointelegraph.com/news/why-senegal-rejects-the-cfa-and-is-warming-to-bitcoin-video\">with trips to Senegal</a>, Poland and Cape Verde during the winter. Had I been home, I would have netted another roughly 50,000 sats of “heat.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5882e086-5674-4924-9adf-63a2e98c8c2f.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Using the Heatbit during winter.</em></figcaption></figure><p>Moreover, my electricity bill was marginally lower than the previous winter, which is a minor success in light of double-digit inflation in Portugal. </p><p>However, that misses the point. The Hearbit is a heater first and a Bitcoin miner second. The heat is smoother than my regular heater and requires zero maintenance (so far). Plus, as Busarov points out: </p><blockquote>“We want to decentralize mining. It’s unlikely that Satoshi envisioned mining to be centralized in large farms. The ideal approach is ‘everyone contributing a bit.’”</blockquote><p>The Heatbit contributes to the Nicehash mining pool. Some critics claim that mining pools <a href=\"https://cointelegraph.com/news/the-dangers-of-mining-pools-centralization-and-security-issues\">lead to mining centralization</a> — something the Bitcoin community is attempting to overcome with upcoming <a href=\"https://stratumprotocol.org/\" target=\"_blank\" rel=\"noopener nofollow\">Stratum V2</a> upgrades to the mining algorithm. Nonetheless, there have been other unexpected consequences to running a Bitcoin miner. </p><h2>Living with a Bitcoin miner</h2><p>In Portugal, central heating is rare. Most homes I’ve stayed in use oil heaters or electric heaters. The Heatbit quickly replaced my electric heater, which was more expensive due to its higher power draw. The miner is also quieter, and the heat emitted is consistent and less punchy. However, it’s also 10 times the price of my electric heater.</p><p>Interestingly, the Heatbit’s size and stature raise eyebrows and questions like, “What’s that?” among friends visiting my flat. Guests were surprised to learn that the white box was mining Bitcoin, as invariably, they thought that Bitcoin mining took place in giant data centers. I showed them how much I’d earned on my phone, and, in a way, the heater is an <a href=\"https://cointelegraph.com/news/chatgpt-learns-bitcoin-will-end-central-banking-and-fiat-currency\">orange pilling aid</a>.</p><p>As Busarov explains, the point of the Heatbit “is to expand the Bitcoin community.” “There are far more people using electric heaters than miners,” he said. Tools like easy-to-use at-home Bitcoin heater miners are another step toward greater adoption. </p><p>The downsides are the price tag and the size. The unit is large, heavy and costs over $1,000 brand-new. Given that in Portugal, I use a heater for four to five months a year, the Heatbit becomes a large paperweight from April to October. </p><p>Ultimately, it would take a few years to pay off at current price levels in a warm country like Portugal. Naturally, if the Bitcoin price were in the six figures, it would be a different story. </p><p>Moreover, on Reddit and YouTube reviews, some users have reported problems with use and <a href=\"https://www.youtube.com/watch?v=QEYov5--Wuo\" target=\"_blank\" rel=\"noopener nofollow\">concerns</a> about customer service.</p><p>Plus, the mainstream and plug-and-play nature of the Heatbit is contrary to the ethos of the DIY Bitcoin miners, who see the company as making a profit on something a person could do themselves. And fundamentally, Bitcoin was first propagated by hobbyists, so it’s understandable. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4e166419-4455-415b-b6c8-1112cc210521.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Developers working on works on the Heatbit One prototype. Source: Heatbit</em></figcaption></figure><p>To Heatbit’s credit, it listened. The company is introducing a smaller heater, the “Heatbit Mini,” from $299, in time for the next European winter. Busarov explains:</p><blockquote>“We also added air purifying functionality, making the device usable all year round. And, as the name suggests, the [Heatbit] Mini is smaller in size — less than 50 cm tall — making it convenient to place in any room.”</blockquote><p>The Heatbit Mini consumes 300 watts for mining and air purification, boostable to 1,300 watts of heat in the wintertime. The 300-watt setting still contributes the full 10 terrahashes per second, while the original Heatbit hash rate drops off as it dials down. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-begins-has-institutional-trust-returned-to-crypto\">Bitcoin ETF race begins: Has institutional trust returned to crypto?</a></em></strong></p><p>That should mean you can run it all year round as an air purifier and a heater. Naturally, I’ve signed up for one. </p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T14:00:49.000Z",
    "title": "Coinbase downgraded by analysts amidst regulatory wrangles",
    "url": "https://cryptoslate.com/coinbase-downgraded-by-analysts-amidst-regulatory-wrangles/",
    "description": "<p>Piper Sandler analyst Patrick Moley has downgraded Coinbase due to its ongoing legal tussle with the Securities and Exchange Commission (SEC) and the continuing ambiguity over cryptocurrency regulation in the U.S., according to BNN Bloomberg. On July 5, Moley expressed that the regulatory uncertainties have made it too challenging to project Coinbase&#8217;s future revenues prudently, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-downgraded-by-analysts-amidst-regulatory-wrangles/\">Coinbase downgraded by analysts amidst regulatory wrangles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-05T13:47:59.000Z",
    "title": "Singapore’s DBS Bank Launches Digital Yuan Payment Solution in China",
    "url": "https://cryptobriefing.com/dbs-bank-launches-e-yuan-payment-solution/?utm_source=feed&utm_medium=rss",
    "description": "DBS Bank, a leading Singaporean bank in China, has launched a digital yuan merchant collection solution, marking DBSs first client transaction with Chinas digital yuan. This solution allows DBS&#8217;s corporate..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T13:59:00.000Z",
    "title": "New UK Bill Could Seize And Freeze Crypto",
    "url": "https://cryptodaily.co.uk/2023/07/new-uk-bill-could-seize-and-freeze-crypto",
    "description": "<p>The UK parliament has passed a bill that could help the authorities to seize and freeze cryptocurrencies that have been used for crime.&nbsp;</p>\nCryptos Can Be Seized Under New Bill?\n<p>In a significant move to combat cryptocurrency-related crime, the UK House of Lords has passed a bill that empowers authorities to seize and freeze digital assets involved in illegal activities. The legislation aims to address the growing concern of cryptocurrencies being exploited by criminals for money laundering, fraud, and other illicit purposes. The bill, titled &ldquo;Economic Crime and Corporate Transparency Bill,&rdquo; received overwhelming support from the House of Lords on Tuesday.&nbsp;</p>\n<p>Under the provisions of the bill, authorities will have the power to freeze and seize cryptocurrencies suspected to be linked to criminal enterprises. The bill had been previously amended to include terrorism cases. The legislation also mandates exchanges and custodian services to cooperate with law enforcement agencies, providing them with access to relevant transactional information.</p>\nHow Is The Bill Becoming A Law?\n<p>The bill was first introduced in September 2022, when Director General of the National Crime Agency, Graeme Biggar, said,&nbsp;</p>\n\n<p>\"Domestic and international criminals have for years laundered the proceeds of their crime and corruption by abusing U.K. company structures, and are increasingly using cryptocurrencies. These reforms &ndash; long awaited and much welcomed &ndash; will help us crack down on both.\"</p>\n\n<p>Later in March, the government revealed its three-year economic crime agenda which including the fight against criminal abuse of crypto. As a part of the agenda to help identify digital assets linked to criminal activities, crypto tactical advisers have been incorporated into nationwide police departments.</p>\n<p>In the next step, the bill will now proceed to the House of Commons for further review and debate. It will be passed back and forth between the chambers of Parliament until the House of Lords and the House of Commons both sign off on the document. Once an agreement is reached, it will be presented before the king, who can then sign it into law.&nbsp;</p>\nUK Continues Its Crypto Stride\n<p>The UK government has recognized the need to adapt its legal framework to keep pace with technological advancements and emerging threats in the digital realm. Most recently, the House of Lords passed the Financial Services and Markets Bill to regulate Bitcoin and crypto in the UK.&nbsp;</p>\n<p>By bringing cryptocurrencies under the purview of existing anti-money laundering and asset forfeiture regulations, the bill aims to close existing loopholes and strengthen the country's financial integrity.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-05T14:00:38.000Z",
    "title": "Bitcoin Emerges as NFT Contender With $463 Million in Sales in 4 Months",
    "url": "https://news.bitcoin.com/bitcoin-emerges-as-nft-contender-with-463-million-in-sales-in-4-months/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Emerges as NFT Contender With $463 Million in Sales in 4-Months\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbricks.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In just four months, starting from February 7, 2023, non-fungible token (NFT) sales on the Bitcoin blockchain have soared to $463.68 million. This growth has propelled the network to secure the second-highest number of monthly NFT sales consistently since then. However, despite this impressive ascent within the past four months, Bitcoin&#x2019;s overall NFT sales figures [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T14:00:58.000Z",
    "title": "Decentralized Hedge Fund VC Spectra (SPCT) Raises $2.4million In Seed Sale Round",
    "url": "https://www.cryptopolitan.com/decentralized-hedge-fund-vc-spectra-spct-raises-2-4million-in-seed-sale-round/",
    "description": "London, United Kingdom, July 5th, 2023, Chainwire VC Spectra (SPCT), a decentralised hedge fund, is currently 70% into its first stage of its public presale. The private seed sale, which raised $2.3 million in just two weeks, has filtered through into the public presale. A leading firm in the fintech and blockchain space, VC Spectra ... <a title=\"Decentralized Hedge Fund VC Spectra (SPCT) Raises $2.4million In Seed Sale Round\" class=\"read-more\" href=\"https://www.cryptopolitan.com/decentralized-hedge-fund-vc-spectra-spct-raises-2-4million-in-seed-sale-round/\" aria-label=\"More on Decentralized Hedge Fund VC Spectra (SPCT) Raises $2.4million In Seed Sale Round\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T13:56:53.000Z",
    "title": "Chiliz Seizes The Moment, but Can It Compete With Chancer’s Long-Term Plan?",
    "url": "https://www.cryptopolitan.com/chiliz-seizes-the-moment-but-can-it-compete-with-chancers-long-term-plan/",
    "description": "With a focus on sports and entertainment, Chiliz has a viable use case in the crypto market as a way to connect sports clubs, associations, and their fans. Some crypto traders don’t believe it carries the financial incentive they seek, though. Chancer offers better investment potential due to more community integrations as a betting platform ... <a title=\"Chiliz Seizes The Moment, but Can It Compete With Chancer&#8217;s Long-Term Plan?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chiliz-seizes-the-moment-but-can-it-compete-with-chancers-long-term-plan/\" aria-label=\"More on Chiliz Seizes The Moment, but Can It Compete With Chancer&#8217;s Long-Term Plan?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T13:43:18.000Z",
    "title": "MetisDAO reveals post-exploit purchases invalidated after Poly Network breach",
    "url": "https://www.cryptopolitan.com/metisdao-reveals-post-exploit-purchases-invalidated-after-poly-network-breach/",
    "description": "Metis, a renowned blockchain project, has recently made a shocking revelation about discovering and disclosing vulnerabilities in the Poly Network. Taking to Twitter, Metis informed its community that only METIS tokens purchased from BNBChain addresses before the attack and the initial sale of exploited METIS would retain their validity. To ensure accuracy, the Metis team ... <a title=\"MetisDAO reveals post-exploit purchases invalidated after Poly Network breach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metisdao-reveals-post-exploit-purchases-invalidated-after-poly-network-breach/\" aria-label=\"More on MetisDAO reveals post-exploit purchases invalidated after Poly Network breach\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T14:00:00.000Z",
    "title": "AAVE Records 26% Weekly Gain, Looks To Break Key Resistance",
    "url": "https://www.newsbtc.com/analysis/aave/aave-records-26-weekly-gain-looks-to-break-key-resistance/",
    "description": "AAVE, one of the most prominent DeFi tokens, has made a bright start to July. The coin is experiencing a price rally, jumping by more than 26% in the past week. Overall, the AAVE market seems to be enjoying much attention as shown by recent high whale activity.  AAVE Aims For $90 Again &#8211; Price Action  AAVE has been on a positive run in the past few weeks. Since reaching a yearly low of $50 in mid-June, the token has been on a bullish course, which has seen its value rise by over 53%. Related Reading: Lido (LDO) Sustains Weekly Run With 16% Gain – What Fuels It? It is worth noting that the price of AAVE declined for a few days after touching the $75 mark on June 26. This fall caused the token to shed most of its price gain at the time. However, the DeFi token appears to have fully recovered from this loss, with its yearly high of $91.73 now in sight.  According to historical price data, there seems to be resistance at the $80 price zone. So the AAVE token would need to overcome this barrier in order to make its way to $90 again. If the coin fails to break this threshold, it could experience a slight retracement to find support at the $70 price level. CoinGecko data shows that AAVE currently trades at $75.81, losing more than 2% of its value in the past 24 hours. This signals a waning buying pressure, which could hamper the token’s chance of breaking the $80 resistance zone. AAVEUSD trading at $74.25 &#124; Source: AAVEUSD chart from TradingView Aave Freezes TUSD Reserve on V2 Ethereum Pool On July 3, 2023, the Aave community executed a proposal to freeze the TrueUSD (TUSD) reserve on the Aave V2 Ethereum pool. This comes in response to the recent controversy surrounding the stablecoin. This proposal will prevent users from depositing or borrowing TUSD on the Aave V2 Ethereum pool. “This AIP (Aave Improvement Proposal) is designed to take a conservative approach to the TUSD situation,” the proposal read. Related Reading: Aptos (APT) Gains By 10% Ahead Of July Token Release TUSD jitters started after its technology partner Prime Trust was rumored to have gone bankrupt. These issues were compounded when the embattled Fintech company shut off withdrawals and deposits due to pressure from Nevada state regulators. Although TrueUSD has halted the minting of its stablecoin via Prime Trust, there is still some uncertainty surrounding the use of its assets. And losing its dollar peg in the month of June didn&#8217;t help its case. This AIP to freeze TUSD reserves received overwhelming support, as nearly 84% of voters approved it. However, it is worth noting that users will still be able to repay and withdraw their TUSD from the stablecoin pool. Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T14:00:37.000Z",
    "title": "Decentralized Hedge Fund VC Spectra (SPCT) Raises $2.4million In Seed Sale Round",
    "url": "https://www.crypto-news-flash.com/decentralized-hedge-fund-vc-spectra-spct-raises-2-4million-in-seed-sale-round/?utm_source=rss&utm_medium=rss&utm_campaign=decentralized-hedge-fund-vc-spectra-spct-raises-2-4million-in-seed-sale-round",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-05_12-35-39_1688549938MXh06negwY.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-05_12-35-39_1688549938MXh06negwY.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-05_12-35-39_1688549938MXh06negwY-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-05_12-35-39_1688549938MXh06negwY-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-05_12-35-39_1688549938MXh06negwY-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, July 5th, 2023, Chainwire VC Spectra (SPCT), a decentralised hedge fund, is currently 70% into its first stage of its public presale. The private seed sale, which raised $2.3 million in just two weeks, has filtered through into the public presale. A leading firm in the fintech and blockchain space, VC Spectra [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T13:58:31.000Z",
    "title": "Binance Withdraws Support For Multichain-bridged Tokens",
    "url": "https://coinedition.com/binance-withdraws-support-for-multichain-bridged-tokens/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance, the world’s biggest crypto exchange platform, has suspended deposits and withdrawals for certain Multichain-bridged tokens. According to the announcement posted on Binance&#8217;s official blog, the suspension will take effect from 2023-07-07 00:00 (UTC) until further notice. Earlier in May, Binance made a similar suspension of deposits for Multichain-bridged in what it described as a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-withdraws-support-for-multichain-bridged-tokens/\">Binance Withdraws Support For Multichain-bridged Tokens</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T13:43:00.000Z",
    "title": "Analyst: Emerging Golden Cross Signal Could Push XRP Above $9",
    "url": "https://coinedition.com/analyst-emerging-golden-cross-signal-could-push-xrp-above-9/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/046.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/046.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/046-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/046-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/046-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/046-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/046-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/046-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/046-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/046-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/046-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/046-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/046-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/046-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/046-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/046-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/046-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CoinsKid, a cryptocurrency analyst on Twitter, predicts that XRP will climb to at least $9 if it overcomes the existing all-time high (ATH). He predicted that after noticing a developing golden cross of the 10 and 20 EMA on the XRP/USD monthly chart. According to CoinsKid, the XRP monthly chart printed a 10 and 20 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-emerging-golden-cross-signal-could-push-xrp-above-9/\">Analyst: Emerging Golden Cross Signal Could Push XRP Above $9</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-05T14:01:09.000Z",
    "title": "Change Log: Version 1.75",
    "url": "https://blog.bitfinex.com/changelogs/change-log-version-1-75/",
    "description": "<p>The Bitfinex Change Log is an overview of all performance and UI changes made to the Bitfinex trading platform. For an overview of all previous changes, please refer to blog.bitfinex.com/category/changelogs. Version 1.75 Features Added currency links to corresponding knowledge base articles in deposits and withdrawals...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/changelogs/change-log-version-1-75/\">Change Log: Version 1.75</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]