[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T05:07:23.000Z",
    "title": "What’s Missing in Generative AI’s Pursuit of True Innovation in Engineering?",
    "url": "https://www.cryptopolitan.com/generative-ais-pursuit-innovation/",
    "description": "In a pivotal discovery for the field of engineering design, a recent MIT study underscores the limitations of current generative AI models, shedding light on their inherent flaws. The study, led by MIT mechanical engineering graduate student Lyle Regenwetter and assistant professor Faez Ahmed, challenges the prevailing notion that AI&#8217;s ability to mimic existing designs ... <a title=\"What&#8217;s Missing in Generative AI&#8217;s Pursuit of True Innovation in Engineering?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ais-pursuit-innovation/\" aria-label=\"More on What&#8217;s Missing in Generative AI&#8217;s Pursuit of True Innovation in Engineering?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T04:53:24.000Z",
    "title": "Sanctioned but Unstopped: Is Russia Using Garantex to Politically Distract from Its Ukrainian Stalemate?",
    "url": "https://www.cryptopolitan.com/sanctioned-but-unstopped-is-russia-using-garantex-to-politically-distract-from-its-ukrainian-stalemate/",
    "description": "When it comes to global politics, the money trail can be just as telling as military maneuvers. While most eyes are on Russia&#8217;s military actions in Ukraine, another story is quietly unfolding—one that also has Russia at its center but is happening far away in the Middle East. This isn&#8217;t about tanks or soldiers; it&#8217;s ... <a title=\"Sanctioned but Unstopped: Is Russia Using Garantex to Politically Distract from Its Ukrainian Stalemate?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sanctioned-but-unstopped-is-russia-using-garantex-to-politically-distract-from-its-ukrainian-stalemate/\" aria-label=\"More on Sanctioned but Unstopped: Is Russia Using Garantex to Politically Distract from Its Ukrainian Stalemate?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T05:00:13.000Z",
    "title": "xDay 2023 Day 1: How MultiversX Is Bridging The Metaverse, AI, And Blockchain Under Ecosystem",
    "url": "https://www.newsbtc.com/news/xday-2023-multiversx-bridging-metaverse-blockchain/",
    "description": "In the next three days, our team at NewsBTC will cover xDay 2023, an event organized by MultiversX in the Palace of Parliament, Romania. Formerly known as Elrond, the project rebranded in 2022 and focused on the Metaverse, one of the hottest trends in crypto. Related Reading: Elrond Coin Looks To Breach $55 Resistance – Is $65 Hittable This Month? Following The Trend, What To Look For At xDay 2023? In addition to rebranding, the project launched new products, including a “Super App” called xPortal, to expand its ecosystem. The project founder and CEO, Beniamin Mincu, has been vocal about their attempts to provide “real” use cases and value to their users and foster a new financial system supported by blockchain, AI, the multiverse, and other technologies. We went to xDay to explore how MultiversX works to achieve this goal and what makes this ecosystem unique. The event will begin today, October 19th, and will last three days to wrap up this upcoming Saturday, October 21. Mincu told us in an exclusive statement: xDay brings together builders, government officials, executives from major global companies and investors for 3 days of meaningful dialogues on the latest trends and advancements at the intersection of blockchain, AI, Metaverse and Web3. A great opportunity to build bridges across industries and uncover our latest innovations, products and strategic partnerships. The Technological Renaissance Runs On The Blockchain The event will be subdivided into chapters, with the first two chapters dedicated to discussing MultiversX and its ecosystem, its technical milestones, and the projects building on top of this network. Mincu and other vital members of MultiversX will take center stage. In addition, the Romanian Minister of Energy, Sebastian Burduja, and the Romanian Minister of Economy, Stefan Radu, will talk about the potential for blockchain and crypto to drive innovation and growth in the country. The third and fourth chapters of the event will focus on partnerships, with Daniël Rood, Head of Web3 at Google Cloud, Tobias Jung from Deutsche Telekom, Nikita Kharchenko from Amazon Web Services, and Liu Bin from Tencent Cloud taking over the stage. These experts will discuss ways to drive global adoption of Web3, regulation, scalability, and interoperability across different sectors and regions. Representatives from Circle, Osmosis, Binance, KuCoin, Deloitte, Ledger, Trust Wallet, and others will speak about investment strategies, staking, security, and other relevant topics. Finally, on the final day of the xDay 2023 event, new technologies and their integration with blockchain and crypto, such as Artificial Intelligence and the Metaverse, will become the focus. Across the event, the community will have a voice as the Palace of Parliament in Bucharest becomes a place of dialogue. The CEO of MultiversX added: A catalyst for bridging the gap between Web2 and Web3, this event plans to reignite European ambitions, marking the beginning of a technological Renaissance (…). Over the next 3 days, we&#8217;re diving deep. Expect hands-on demos, product unveilings right from this stage, firsthand accounts of our newest strategic partnerships, and spotlights of the most audacious grassroots projects from our vibrant ecosystem, that are turning heads and setting trends. But beyond the tech, beyond the unveilings, xDay is a forum for dialogue. Related Reading: Elrond (EGLD) Price May Break Past $56 Hurdle – Here’s How The event will be live-streamed via the project’s official channels. The event will become available for the worldwide crypto community a few days later. Cover image from MultiversX, chart from Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T04:58:58.000Z",
    "title": "SOL Price Prediction: Why Solana Could Surge 25% Above This Key Hurdle",
    "url": "https://www.newsbtc.com/analysis/sol-price-prediction-why-solana-surge-30/",
    "description": "Solana is correcting gains from the $25 resistance against the US Dollar. SOL price remains supported and might aim for a fresh rally toward $30. SOL price started a downside correction after it failed to clear the $25 resistance against the US Dollar. The price is now trading above $23.00 and the 100 simple moving average (4 hours). There is a key contracting triangle forming with resistance near $23.90 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could start a strong rally if it clears the $24 and $25 resistance levels. Solana Price Remains In Uptrend After a steady increase, Solana struggled to clear the $25 resistance zone. SOL formed a high at $24.82 and recently started a downside correction, like Bitcoin. There was a move below the $24.20 and $22.00 levels. The bears pushed the price below the 23.6% Fib retracement level of the upward move from the $20.94 swing low to the $24.82 high. There is also a key contracting triangle forming with resistance near $23.90 on the 4-hour chart of the SOL/USD pair. SOL is now trading above $23.00 and the 100 simple moving average (4 hours). It is now showing positive signs and remains supported above the $22.00 pivot level. Source: SOLUSD on TradingView.com On the upside, immediate resistance is near the $24.00 level and the triangle region. The first major resistance is near the $24.00 level. The main resistance is still near the $25.00 zone. A successful close above the $25.00 resistance could set the pace for a larger increase. The next key resistance is near $28.50. Any more gains might send the price toward the $30.00 level. Are Dips Limited in SOL? If SOL fails to recover above the $24.00 resistance, it could continue to move down. Initial support on the downside is near the $22.85 level or the 50% Fib retracement level of the upward move from the $20.94 swing low to the $24.82 high. The first major support is near the $22.40 level. If there is a close below the $22.40 support, the price could decline toward the $21.80 support. In the stated case, there is a risk of more downsides toward the $20.50 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is losing pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $22.85, and $22.40. Major Resistance Levels – $23.90, $24.00, and $25.00."
  }
]