[
  {
    "source": "CoinDesk",
    "date": "2023-11-16T13:01:00.000Z",
    "title": "First Mover Americas: SEC Delays Decision on Hashdex’s ETF Application   ",
    "url": "https://www.coindesk.com/markets/2023/11/16/first-mover-americas-sec-delays-decision-on-hashdexs-etf-application/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Nov. 16, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-16T12:58:43.000Z",
    "title": "A Physical Dogecoin Could Reach the Moon in December",
    "url": "https://www.coindesk.com/business/2023/11/16/a-physical-dogecoin-could-reach-the-moon-in-december/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Dogecoin community plans to send a physical token to the Moon in a December mission by space payload transporter Astrobotic."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-16T12:55:39.000Z",
    "title": "Head of Dubai Crypto Regulator to Quit to 'Pursue Other Interests'",
    "url": "https://www.coindesk.com/business/2023/11/16/head-of-dubai-crypto-regulator-to-quit-to-pursue-other-interests/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Henson Orser, the CEO of VARA, Dubai's crypto regulator, is set to leave the job and will be replaced by a partner at PwC."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-16T13:01:02.000Z",
    "title": "Why BlackRock Considers Tether a Risk for Its Bitcoin ETF",
    "url": "https://decrypt.co/206303/blackrock-tether-usdt-fud-bitcoin-spot-etf-filing",
    "description": "\"There is a risk that a disorderly de-pegging or a run on Tether or USDC could lead to dramatic market volatility,\" the firm writes."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T13:00:00.000Z",
    "title": "Blockchains are becoming dollarized: Now what?",
    "url": "http://cointelegraph.com/innovation-circle/blockchains-are-becoming-dollarized-now-what",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/8b31628c-69e7-4fd0-8c85-f163bbe80e75.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The merit of stablecoins is that they create demand for the blockchain — driving fees that are necessary to pay for mining, and hence security.</p>\n                    <p><p>It has become increasingly clear that stablecoins have become the dominant means of transaction settlement on public blockchains, at the exclusion of native cryptoassets (like Bitcoin/Ether). This wasn’t in the plan of the architects of these blockchains or their communities.</p> <p>On-chain data supports this observation: Stablecoins represent approximately 10% of the total crypto market cap, but they account for around 70%-80% of transactional value settled on blockchains, according to data <a href=\"https://niccarter.info/wp-content/uploads/token2049_niccarter_090923.pdf\">presented</a> by Nic Carter at Token2049 (a crypto event in which our company was a sponsor of).</p> <p>While most metrics show a stagnation of interest and usage for major crypto use cases, stablecoin usage is <a href=\"https://coinmarketcap.com\">high</a> and growing: the value settled by stablecoins has stayed fairly steady throughout the last two years of the bear market, and monthly active transacting users continue to grow.</p> <p>According to data compiled by Brevan Howard Digital, USDT and USDC are continuing their trend upwards in weekly active addresses, with Tron and BSC being the major blockchains seeing usage. The weekly transaction count for major stables is nearing an ATH. Ethereum L2s like Arbitrum, Polygon and Optimism are also gaining traction as stablecoin settlement venues. Ethereum L1s used to be the dominant venue for stables like USDC and USDT, but Tron has grown to compete with Ethereum in terms of value settled. It’s increasingly clear that Tether on Tron is the most popular digital asset <a href=\"https://www.wsj.com/articles/tether-is-winning-stablecoin-battle-despite-looming-risks-50aa566b\">used</a> worldwide — particularly in emerging markets.  </p> <p>Meanwhile, the usage of native cryptoassets like Bitcoin and ETH appears to be in retreat — even as their prices recover. Narratives around Bitcoin and Ether have more to do with the emergence of financial products like ETFs, or staking in the case of ETH. They have little to do with the actual usage of these blockchains. </p> <p>The rise of stablecoins is thus challenging narratives that cryptocurrency enthusiasts long believed; namely, that the native tokens themselves would become a major media of exchange. Indeed, there’s some demand for Bitcoin and Ethereum as a store of value, but enthusiasts have long believed these assets would become a mean of exchange and a unit of account.</p> <p>However, if people would rather transact on-chain in tokenized dollars, these narratives are being questioned. Certainly, in places like the U.S., there are good tax reasons to transact in USD terms — because using a volatile crypto asset can trigger a taxable event causing the user to incur capital gains. Also, users may prefer not to be exposed to unnecessary volatility if they want to engage in a cross-border transaction. </p> <p>The question emerges: Are stablecoins parasitic free riders, borrowing from the security of blockchains without giving any back? Bitcoiners tend to think so, largely discouraging stablecoin usage on Bitcoin (Tether recently <a href=\"https://www.coindesk.com/business/2023/08/17/tether-stops-support-for-bitcoin-layer-omni-citing-lack-of-demand/\">dropped</a> the Omni protocol on Bitcoin, which was how it came to market in the first place). Bitcoiners tend to think stablecoins cannibalize the usage of Bitcoin as a medium of exchange, trying to discourage its usage and push users to use tools like Lightning instead. However, Lightning usage has <a href=\"https://defillama.com/protocol/lightning-network\">stalled</a> by most metrics, with TVL at a mere $150 million, versus a $125 billion market cap for stablecoins.</p> <p>Potential changes are afoot, though. Lightning Labs <a href=\"https://www.coindesk.com/tech/2023/10/18/lightning-labs-rolls-out-taproot-assets-to-make-bitcoin-multi-asset-network/\">released </a>their Taproot Assets protocol, enabling the issuance of assets (including stablecoins) on Bitcoin efficiently. Stables could re-enter Bitcoin through such protocols, but must build liquidity, tooling and network effects from scratch. Bitcoin’s long ideological resistance to stables has caused it to fall behind other blockchains. This is ironic, as the first major stablecoin, Tether, was first issued on Bitcoin via Omni. </p> <p>The merit of stablecoins is that they create demand for the blockchain — driving fees that are necessary to pay for mining, and hence security. Bitcoin would be better situated in the long term if it could harness some of the demand for transacting in stablecoins. However, it faces a difficult path to get there. </p> <p>Ethereum leadership, by contrast, recognized that non-native assets would dominate transactional demand in the long term. Through EIP-1559, they created a system ensuring that transactions, even for non-native assets, would result in the burning of Ether directly. This ensured a harmonization of interests between Ether itself and the usage of the Ethereum blockchain, even if it was tokenized USDs being transacted.</p> <p>Thus, more demand for USD transactions on Ethereum means more capital returned to Ether holders. Additionally, Ethereum’s move toward staking has created positive carry around the asset, meaning that it’s now possible to build stablecoins that track the dollar, but are based entirely on staked-Ether collateral. In these two ways, the rise of stablecoins isn’t necessarily bad for Ethereum, even if it marginalizes Ether as a medium of exchange. </p> <p>However, Ethereum does face the risk of a ‘race to the bottom’ in terms of where stablecoins themselves circulate. End users may not care which blockchain they use and care more about fees instead. Thus, Tron has been a significant recent winner in the stablecoin space, and Solana’s cheap and fast settlement has caused some stablecoin usage to move there, too.</p> <p>Visa Crypto recently <a href=\"https://usa.visa.com/solutions/crypto/deep-dive-on-solana.html\">endorsed</a> Solana as their blockchain of choice for stablecoins. These blockchains, too, will face the challenge of aligning stablecoin usage with their native token values. Even if a considerable number of USD transactions move to Solana, it’s unclear how this would feed into the value of SOL or the security of the blockchain itself. I suspect more blockchains will take a leaf from Ethereum’s book, finding a way to turn usage of non-native assets into value accrual for the native token. </p> <p>However, if stablecoin users remain fee-sensitive and keep moving their business to new low-fee blockchains, the fee pressure may ultimately be incidental. In that case, the best hope for these blockchains is to find a way to issue stables against their native tokens, as is happening with staked Ether. </p> <p>It’s clear stablecoins are major financial rails, rivaling established TradFi settlement networks. They are clearly good for financial inclusion and as a protection from inflation. Yet, whether they are good for blockchains themselves remains an open question.</p> <p><em>Megan Nyvold is Head of Media, North America, leading crypto exchange <a href=\"https://bingx.com/en-us/\">BingX. </a></em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T12:55:51.000Z",
    "title": "The $CATCH token pre-sale is live – over $200,000 raised in the first days!",
    "url": "https://cryptodaily.co.uk/2023/11/the-catch-token-pre-sale-is-live-over-200000-raised-in-the-first-days",
    "description": "After almost a year and a half of active development of the long-awaited mobile game SpaceCatch, the main product has finally arrived – the $CATCH token. The pre-sale of this token is planned in three phases, with the first phase having started yesterday"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-16T12:54:12.000Z",
    "title": "Blackrock Officially Submits Ethereum ETF Proposal to US Securities Regulator ",
    "url": "https://news.bitcoin.com/blackrock-officially-submits-ethereum-etf-proposal-to-us-securities-regulator/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/s1.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blackrock Officially Submits Ethereum ETF Proposal to US Securities Regulator \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Blackrock, the world&#x2019;s largest asset manager, has taken a significant step by officially filing its Ethereum Trust S-1 form with the U.S. Securities and Exchange Commission (SEC). This move is to introduce a spot ethereum exchange-traded fund (ETF) on Nasdaq. This development comes on the heels of Blackrock establishing the trust in Delaware and unveiling [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-16T13:02:29.000Z",
    "title": "BlackRock Takes a Big Leap: Files for Ethereum ETF with SEC",
    "url": "https://www.crypto-news-flash.com/blackrock-takes-a-big-leap-files-for-ethereum-etf-with-sec/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-takes-a-big-leap-files-for-ethereum-etf-with-sec",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-10.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-10-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-10-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock, the global fund management behemoth, has filed an application with the U.S. Securities and Exchange Commission (SEC) to launch a spot Ethereum ETF. Following this news, Ethereum’s price experienced a notable surge, highlighting the market&#8217;s positive response to the potential of an Ethereum-based ETF. BlackRock&#8217;s Ethereum ETF Filing: A New Dawn for Crypto In [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-16T13:01:01.000Z",
    "title": "Blackrock Filed an Application for a Spot Ethereum ETF",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/blackrock-filed-an-application-for-a-spot-ethereum-etf/",
    "description": "<p>The filing of an S-1 application by BlackRock underscores the increasing legitimacy of cryptocurrencies in traditional financial markets. This Ethereum ETF will oversee trillions of dollars in assets that will be injected into the crypto ecosystem as soon as it&#8217;s approved. Let&#8217;s discover more about this important milestone. Effects of BlackRock&#8217;s Spot Ethereum ETF An [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/blackrock-filed-an-application-for-a-spot-ethereum-etf/\">Blackrock Filed an Application for a Spot Ethereum ETF</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-16T13:05:21.000Z",
    "title": "BlackRock Officially Submits Form S-1 With SEC for Ethereum ETF",
    "url": "https://coinedition.com/blackrock-officially-submits-form-s-1-with-sec-for-ethereum-etf/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The trillion-dollar U.S.-based asset manager BlackRock has officially submitted an Ethereum exchange-traded fund (ETF) application with the United States Securities and Exchange Commission (SEC).  In particular, BlackRock submitted a Form S-1 Registration Statement with the SEC on Wednesday, November 15, for an iShares Ethereum Trust. This development followed BlackRock&#8217;s filing for the corporation name &#8220;iShares [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/blackrock-officially-submits-form-s-1-with-sec-for-ethereum-etf/\">BlackRock Officially Submits Form S-1 With SEC for Ethereum ETF</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-16T12:57:00.000Z",
    "title": "Crypto Analyst Predicts Dogecoin Would Rally to $2 in 2024",
    "url": "https://coinedition.com/crypto-analyst-predicts-dogecoin-would-rally-to-2-in-2024/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The price of DOGE may attempt to challenge a key resistance soon if bulls are able to overcome its current sell pressure. Read more on CE.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The host of VisionPulsed, a YouTube crypto analysis channel, stated that a $2 target is reasonable for Dogecoin for the next bull run. The host explained the reason behind a potential rally for Dogecoin, noting that the meme coin’s rise is not dependent on Elon Musk. The VisionPulsed host explained in a recent video that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-analyst-predicts-dogecoin-would-rally-to-2-in-2024/\">Crypto Analyst Predicts Dogecoin Would Rally to $2 in 2024</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-16T12:45:04.000Z",
    "title": "Top Trader Who Nailed 2018 Bitcoin Bottom Says One Catalyst Could Send Ethereum-Based Altcoin Rallying ‘Hard’",
    "url": "https://dailyhodl.com/2023/11/16/top-trader-who-nailed-2018-bitcoin-bottom-says-one-catalyst-could-send-ethereum-based-altcoin-rallying-hard/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Altcoin-Rallying-Hard.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader who accurately predicted the bottom for Bitcoin (BTC) in 2018 believes that one altcoin is on the verge of a massive move to the upside. Pseudonymous analyst Bluntz tells his 228,700 followers on the social media platform X that liquid-staking service provider Lido DAO (LDO) is ready to soar after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/16/top-trader-who-nailed-2018-bitcoin-bottom-says-one-catalyst-could-send-ethereum-based-altcoin-rallying-hard/\">Top Trader Who Nailed 2018 Bitcoin Bottom Says One Catalyst Could Send Ethereum-Based Altcoin Rallying ‘Hard’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]