[
  {
    "source": "Decrypt",
    "date": "2024-02-21T20:59:13.000Z",
    "title": "Google Has a New Open-Source AI Model—Can It Compete With Meta's Llama-2?",
    "url": "https://decrypt.co/218417/google-has-a-new-open-source-ai-model-can-it-compete-with-metas-llama-2",
    "description": "Google's Gemma is one day old and is already trending on AI leaderboards and beating Meta’s models across the most popular benchmarks."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T20:57:47.000Z",
    "title": " Sam Bankman-Fried is back in court, waives conflict of interest for lawyers ",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-court-waives-conflict-interest-lawyers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTk0OWFmNjQtMjk5My00MTUyLTg3NjctN2E3OGY5OTdhMmRlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Lawyers Marc Mukasey and Torrey Young will represent the former FTX CEO through his sentencing on March 28, while Christian Everdell and Mark Cohen are withdrawing.</p>\n                    <p><p>Former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam “SBF” Bankman-Fried</a> returned to the courtroom for one of the first times since his conviction to address potential conflicts of interest in his lawyers.</p><p>According to a Feb. 21 report from Inner City Press, Bankman-Fried <a href=\"https://twitter.com/innercitypress/status/1760386455028080667\" target=\"_blank\" rel=\"noopener nofollow\">waived</a> his right to conflict-free legal representation with lawyers Marc Mukasey and Torrey Young. The two attorneys filed notices of appearance with both SBF and former Celsius CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/su-zhu-and-alex-mashinsky\">Alex Mashinsky</a>, who <a href=\"https://cointelegraph.com/news/alex-mashinsky-waives-conflict-lawyers\">took similar action</a> in a Feb. 20 hearing.</p><p>The courtroom appearance in United States District Court for the Southern District of New York marked one of the first times Bankman-Fried had been seen outside of jail since a jury <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-found-guilty-on-all-charges\">convicted the former FTX CEO</a> of seven felony counts in November 2023. SBF’s life behind bars has been mainly out of the media spotlight, but on Feb. 19, photos <a href=\"https://cointelegraph.com/news/sbf-jail-beard-thinner-newly-surfaced-prison-photo\">surfaced showing the former FTX CEO</a> with other inmates. </p><p><a href=\"https://cointelegraph.com/news/sam-bankman-fried-court-waives-conflict-interest-lawyers\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T20:41:14.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Terraform Labs co-founder Do Kwon will reportedly be extradited to the United States, where he faces fraud charges. Meanwhile, Ripple’s boss gives his views on ETFs, and stablecoin issuer Circle announced that it would cease minting its USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) on the Tron network effective immediately. </p><p>The co-founder of Terraform Labs, Do Kwon, will reportedly be <a href=\"https://cointelegraph.com/news/terraform-do-kwon-extraditon-united-states-montenegrin-court\">extradited to the United States</a> to face fraud charges. </p><p>According to news reports, Kwon, who’s been in Montenegro since his arrest in March 2023, will be extradited to the U.S. after the High Court of Podgorica rejected a request to have him extradited to South Korea. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-21T21:08:09.000Z",
    "title": "Top SEC crypto lawyer leaves to join pro-crypto firm, regulator facing new lawsuit",
    "url": "https://cryptoslate.com/top-sec-crypto-lawyer-leaves-to-join-pro-crypto-firm-regulator-facing-new-lawsuit/",
    "description": "<p>A key member of the US Securities and Exchange Commission&#8217;s (SEC) legal team, Ladan Stewart,  stepped down from her role at the agency to join a pro-crypto law firm, Bloomberg Law reported on Feb. 21. Stewart, who served as Regional Trial Counsel in the SEC&#8217;s Crypto Assets and Cyber Unit since September 2022, has joined [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/top-sec-crypto-lawyer-leaves-to-join-pro-crypto-firm-regulator-facing-new-lawsuit/\">Top SEC crypto lawyer leaves to join pro-crypto firm, regulator facing new lawsuit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-21T20:47:17.000Z",
    "title": "BitKong Casino Introduces Groundbreaking Crash Game – A New Era of Crypto Gaming",
    "url": "https://cryptodaily.co.uk/2024/02/bitkong-casino-introduces-groundbreaking-crash-game-a-new-era-of-crypto-gaming",
    "description": "BitKong Casino Introduces Groundbreaking Crash Game – A New Era of Crypto Gaming"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T21:03:54.000Z",
    "title": "SEC crypto unit leader departs for private sector following Coinbase litigation",
    "url": "https://www.cryptopolitan.com/sec-crypto-unit-leader-depart-private-sector/",
    "description": "Ladan Stewart, known for her role as a leading anti-crypto lawyer at the Securities and Exchange Commission (SEC), has transitioned to the private sector. Stewart, who has been at the forefront of the SEC&#8217;s Crypto Assets and Cyber Unit, is set to enhance the crypto and cyber defense practice at international law firm White &#38; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T20:47:21.000Z",
    "title": "BitKong Casino Introduces Groundbreaking Crash Game – A New Era of Crypto Gaming",
    "url": "https://www.cryptopolitan.com/bitkong-casino-introduces-groundbreaking-crash-game-a-new-era-of-crypto-gaming/",
    "description": "Yerevan, Armenia, February 21st, 2024, Chainwire In an exciting development for the online gaming community, BitKong Casino is proud to announce the launch of its newest game, Crash, this February 2024. Known for its innovative approach to gaming, BitKong is once again at the forefront, blending the thrill of cryptocurrency with cutting-edge gameplay and design. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T21:00:54.000Z",
    "title": "Is Altcoin Season On? Here’s What Glassnode Data Says",
    "url": "https://www.newsbtc.com/altcoin/altcoin-season-heres-what-glassnode-data/",
    "description": "Here&#8217;s what the &#8220;Altseason Indicator&#8221; from the on-chain analytics firm Glassnode says regarding if an Altcoin season is currently going on or not. What Altseason Indicator Says Regarding The Altcoin Season In its latest weekly report, Glassnode has discussed what the Altcoin season status for the cryptocurrency market has looked like recently. To check whether the &#8220;altseason&#8221; is on, the analytics firm has devised its Altseason Indicator. This metric judges if the investors are in a risk-on mode based on how capital rotations are occurring in the sector. There are two conditions the indicator checks for. Related Reading: Bitcoin FOMO Hasn’t Spiked Yet: Green Signal For Rally To Continue? First, the Altseason Indicator looks at the capital netflows involving the three major asset classes in the sector: Bitcoin (BTC), Ethereum (ETH), and stablecoins. For the former two assets, netflows are gauged using their &#8220;realized caps.&#8221; The realized cap is a capitalization model that calculates any asset&#8217;s total valuation by assuming that the real value of any token in circulation is the price at which it was last moved rather than the current spot price. The last transfer for any coin was likely the last point at which it changed hands, so the price at the time of that transaction would be its current cost basis. As such, the realized cap sums up the cost basis of every holder in the sector. Put another way, the realized cap measures the actual amount of capital the investors have put into the asset. Thus, changes in the metric would reflect the amount of capital flowing into or out of the asset. For the stablecoins, net flows can be judged based on the supply or market cap alone, as the stables&#8217; value remains tied to $1 at every point, so the magnitude of the market cap and realizes cap would be equal (both of these would also equal the supply, except for the unit). For the Altcoin Season to be active, all three asset classes should have positive netflows. This is because capital generally enters the cryptocurrency sector through these coins and only then rotates into altcoins as investors&#8217; appetite for risk rises. The other condition the Altseason Indicator checks for is the momentum in the altcoin market cap itself. In particular, the metric confirms whether or not the altcoin market cap is currently over its 30-day simple moving average (SMA). The data of the Altseason Indicator over the past few years &#124; Source: Glassnode's The Week Onchain - Week 8, 2024 The chart shows that the Altseason Indicator first started flashing the risk-on signal in October of last year. However, the signal turned off when the market cooled off following the launch of the Bitcoin spot ETFs. Related Reading: Solana, Chainlink Among Coins With Overheating Open Interest: Data After staying off for 22 days this month, though, the Altseason Indicator seems to have been saying that the Altcoin season is back on. BTC Price At the time of writing, Bitcoin is trading around the $50,900 level, down 1% in the past week. Looks like the price of the asset has gone down over the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, Glassnode.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T21:00:24.000Z",
    "title": "‘We Have a Long Way’ To Go Before Bitcoin Reaches Its Cyclical Top, According to CryptoQuant CEO – Here’s Why",
    "url": "https://dailyhodl.com/2024/02/21/we-have-a-long-way-to-go-before-bitcoin-reaches-its-cyclical-top-according-to-cryptoquant-ceo-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/long-way-reaches-top.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One Bitcoin metric indicates there&#8217;s still a &#8220;long way to go&#8221; before BTC hits its cyclical top, according to the co-founder and chief executive of analytics platform CryptoQuant. Ki Young Ju notes that 63% of Bitcoin’s realized cap hasn&#8217;t moved in more than six months. Realized cap is an on-chain metric that attempts to provide [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/we-have-a-long-way-to-go-before-bitcoin-reaches-its-cyclical-top-according-to-cryptoquant-ceo-heres-why/\">‘We Have a Long Way’ To Go Before Bitcoin Reaches Its Cyclical Top, According to CryptoQuant CEO – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T20:55:39.000Z",
    "title": "$150,000 Bitcoin Price Target on the Table for This Year, According to Fundstrat’s Tom Lee – Here’s Why",
    "url": "https://dailyhodl.com/2024/02/21/150000-bitcoin-price-target-on-the-table-for-this-year-according-to-fundstrats-tom-lee-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Cohorts-Aggressively-Accumulating-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fundstrat CEO Tom Lee says a myriad of positive catalysts are setting up to most likely push Bitcoin to much higher prices by the end of 2024. In a new interview on CNBC, Lee says that looser monetary policy, the Bitcoin halving and the increased demand stemming from the new spot BTC exchange-traded funds (ETFs) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/150000-bitcoin-price-target-on-the-table-for-this-year-according-to-fundstrats-tom-lee-heres-why/\">$150,000 Bitcoin Price Target on the Table for This Year, According to Fundstrat’s Tom Lee – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]