[
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T04:53:05.000Z",
    "title": "FASB rules ‘eliminate the poor optics’ that shied firms from crypto: Analyst",
    "url": "https://cointelegraph.com/news/fasb-crypto-accounting-rules-eliminate-poor-optics-impairment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/80ff0403-7a4a-4f5b-843c-a0ea9e47ab6a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“The change should help MicroStrategy and other companies that hold digital assets to eliminate the poor optics that have been created by impairment losses,” said analysts from Berenberg Capital.</p>\n                    <p><p>The United States Financial Accounting Standards Board’s new rules for crypto accounting will eliminate the “poor optics” that plagued companies holding digital assets, according to analysts from Berenberg Capital.</p><p>On Sept. 6, the U.S. Financial Accounting Standards Board (FASB) <a href=\"https://cointelegraph.com/news/fasb-united-states-accounting-rules-companies-holding-crypto-2025\">approved</a> new rules for cryptocurrencies with regard to how companies report the fair value of their holdings on their balance sheets.</p><p>In a follow-up analyst note from Berenberg’s senior equity research analyst Mark Palmer, the analyst argued the changes would be particularly beneficial for companies such as Microstrategy, who will soon be able to report their digital asset holdings each quarter without having to realize impairment losses.</p><p>“The change should help MicroStrategy and other companies that hold digital assets to eliminate the poor optics that have been created by impairment losses under the rules that the FASB has had in place,” it wrote. </p><p>Since it started <a href=\"https://cointelegraph.com/news/microstrategy-pledges-to-buy-more-btc-despite-paper-loss-on-its-holdings-of-424-8m-in-q2\">accumulating</a> Bitcoin in August 2020, MicroStrategy has racked up $2.23 billion in cumulative <a href=\"https://cointelegraph.com/explained/what-is-impermanent-loss-and-how-to-avoid-it\">impairment losses</a>. </p><p>Moreover, some of the quarterly reports the company has released during the past three years have included sizeable impairment losses on its BTC holdings that reflected downward moves in the asset’s price.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4002df32-a6cd-452a-ace1-96424501fffd.jpg\"  /><figcaption style=\"text-align: center;\"><em>MicroStrategy impairment losses. Source: Berenberg Capital</em></figcaption></figure><p>This led to negative news coverage of the firm and its reports, “giving the impression that the company’s inherent value had been negatively impacted when such was not the case,” said Palmer.</p><p>Under the new rules, which will go into effect in 2025, firms that hold crypto will be able to report those holdings at fair value. Therefore, their quarterly reports will reflect the current values of the assets, including any price rebounds. </p><p>Currently, impairment losses must be included and cannot be adjusted even if the asset price recovers. </p><p>MicroStrategy is the world’s largest corporate holder of BTC with 152,800 coins as of July 31, currently valued at around $3.9 billion. The new rules can be applied in advance and Berenberg believes <a href=\"https://cointelegraph.com/news/micro-strategy-buys-347m-worth-of-bitcoin-amid-market-thaw\">MicroStrategy</a> will do so which will value its BTC holdings at $8.8 billion by April 2024. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin\"><strong><em>MicroStrategy returns to profit and now owns $4.4B worth of Bitcoin</em></strong></a></p><p>According to Berenberg's note, MicroStrategy CEO Michael Saylor oncesaid that the primary reason more firms have not adopted a BTC investment strategy is because of the FASB's \"hostile\" and \"punitive\" treatment of crypto. He continued to state that the change is a positive outcome: </p><blockquote>“A change in the accounting treatment would be a significant positive catalyst for the price of Bitcoin, as it would spur adoption by tech companies.”</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T04:51:02.000Z",
    "title": "Naver’s Market Cap Plummets by W4 Trillion as Hyped AI Program Fails to Impress",
    "url": "https://www.cryptopolitan.com/naver-hyped-ai-program-fails-to-impress/",
    "description": "In a surprising turn of events, Naver Corporation, South Korea&#8217;s leading online portal, has witnessed a substantial nosedive in its market capitalization, losing nearly W4 trillion in value. The dramatic decline comes on the heels of the highly anticipated launch of their generative artificial intelligence program, HyperCLOVA X, which had generated significant buzz in the ... <a title=\"Naver&#8217;s Market Cap Plummets by W4 Trillion as Hyped AI Program Fails to Impress\" class=\"read-more\" href=\"https://www.cryptopolitan.com/naver-hyped-ai-program-fails-to-impress/\" aria-label=\"More on Naver&#8217;s Market Cap Plummets by W4 Trillion as Hyped AI Program Fails to Impress\">Read more</a>"
  }
]