[
  {
    "source": "Decrypt",
    "date": "2023-06-15T09:23:00.000Z",
    "title": "Sam Bankman-Fried Trial Can Proceed on Original Charges Only, Says DoJ",
    "url": "https://decrypt.co/144740/sam-bankman-fried-trial-can-only-proceed-original-charges-says-doj",
    "description": "The Government is willing to wait a bit longer to try the FTX founder Sam Bankman-Fried on several additional counts."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T09:20:59.000Z",
    "title": "Crypto trading bot borrows $200M for a $3 gain",
    "url": "https://cointelegraph.com/news/crypto-trading-bot-borrows-200m-for-a-3-gain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3c31e5c4-7890-426c-a0f5-86d85abd0d99.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>One community member praised the bot saying that \"profit is profit\" while another said that the event highlights how bad the bear market is. </p>\n                    <p><p>A crypto trading bot programmed to perform arbitrage trades made various complex moves within the Ethereum blockchain, including taking a $200 million flash loan, all to secure a mere $3.24 profit. </p><p>On June 14, blockchain analysis firm Arkham Intelligence shared a breakdown of the bot’s movements. According to the firm, the transaction was made by an arbitrage bot that uses flash loans. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This morning, $200M worth of DAI was minted and burned by MakerDAO in the same block.<br><br>It was part of an arbitrage transaction with a net profit of... $3?<br><br>Why did this happen - and what does this mean?<br><br>Details below  <a href=\"https://t.co/wWLZeC8All\">pic.twitter.com/wWLZeC8All</a></p>&mdash; Arkham (@ArkhamIntel) <a href=\"https://twitter.com/ArkhamIntel/status/1668921471387963393?ref_src=twsrc%5Etfw\">June 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The analysis firm explained that the reason the the DAI amount borrowed was high is because MakerDAO's \"DssFlash\" contract allows zero-fee borrowing on any amount of DAI, with a limit of $500 million. This means that the bot can make uncollateralized loans as long as the assets loaned will be paid within the same block. </p><p>According to Arkham, the bot borrowed 200 million DAI (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) from the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocol MakerDAO and then supplied the funds to the AAVE DAI Market. Following this, 1.349 Wrapped Ether (WETH) was borrowed against the funds. The WETH was then used to purchase Threshold Network (T) tokens on the Curve exchange and was sold at the liquidity protocol Balancer. </p><p>With these transactions, the bot gained a total of 0.019 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), which was valued at around $33 at the time of the trade. However, the transaction fees for the trade were around $28.76, with an additional $1 sent to the block builder. This left the bot with only $3.24 in profit. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sandwich-trading-bots-lose-bread-and-butter-in-25m-exploit\"><strong><em>Sandwich trading bots lose bread and butter in $25M exploit</em></strong></a></p><p>While the risk seemed high compared to the amount gained, a community member <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/149am3o/comment/jo4yn2z/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">applauded</a> the bot saying that \"profit is profit.\" Meanwhile, a Twitter user <a href=\"https://twitter.com/apesmartchain/status/1668998457447657476\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that doing all this for a small profit shows how bad the bear market is. </p><p>Meanwhile, not all bots are working on low-profit trades. On April 20, a bot operator <a href=\"https://cointelegraph.com/news/subway-themed-trading-bot-makes-millions-using-sandwich-attacks\">gained more than $1 million</a> by using sandwich attacks on memecoin traders. A majority of the profits came from targeting trading activity from memecoins like Pepe (PEPE) and Wojak (WOJAK).</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>‘Moral responsibility’ — Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-15T09:16:45.000Z",
    "title": "XRP (XRP/USD) Price Analysis – 15 June 2023: ‘STRONG SELL’ Suggested by Technical Indicators and Moving Averages",
    "url": "https://www.cryptoglobe.com/latest/2023/06/xrp-xrp-usd-price-analysis-15-june-2023-strong-sell-suggested-by-technical-indicators-and-moving-averages/",
    "description": "Introduction This report provides a comprehensive analysis of XRP’s price dynamics on Binance, covering technical indicators, moving averages, and pivot points. Price and Volume Overview As of 8:51 a.m. UTC on 15 June 2023, on Binance, the price of XRP is $0.47400, which is a decrease of $0.02930 (-5.82%) from the previous close. The volume […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T09:15:19.000Z",
    "title": "Tether (USDT) De-Pegs As Crypto Market Stumbles, More Downside Coming?",
    "url": "https://www.newsbtc.com/news/tether-usdt-de-pegs-as-crypto-market-stumbles/",
    "description": "The Bitcoin and crypto markets are deep in the red today. Even though the US Federal Reserve announced the hoped-for interest rate pause yesterday, the release of the updated dot plot was a nasty surprise for the financial markets. The Fed revealed in its updated dot plot that it sees the average terminal interest rate at 5.6% instead of 5.1% for 2023. As Fed Chairman Jerome Powell explained, almost all FOMC members think further hikes are reasonable. And the resulting price slump in the crypto markets is also having an impact on Tether&#8217;s stablecoin, USDT, at the moment. Tether (USDT) De-Pegs Slightly USDT has slightly lost its peg to the US dollar at the time of writing. On Binance, the USDC / USDT exchange rate was at 1.0030. The reason for this seems to be Curve&#8217;s 3Pool, which is one of the most important pools for stablecoin trading in decentralized finance. Currently USDT accounts for 73.79% of the Curve 3Pool, DAI for 13.05% and USDC for 13.16%. Apparently, users are rushing to exchange tens of millions of USDT in favor of the stablecoins USD Coin (USDC) and Dai (DAI). The ideal balance of the Curve 3Pool should be 33.33% for each of the three stablecoins. Due to the imbalance, USDT is currently de-pegging. Related Reading: Crypto Market Bleeds As SEC Pressures Mount, Is It Time To Buy? Chinese journalist Collin Wu also reports that in Aave V2, the USDT lending rate skyrocketed, including the deposit rate by more than 20% and the loan rate by more than 30%. Some big whales are borrowing USDT on Aave and selling it on DEX like Curve. One of them is Ethereum whale @samczsun. He borrowed 31.5 million USDT from Aave V2 using 17,000 ETH and 14,000 stETH as collateral, and then exchanged all the borrowed USDT for USDC on 1inch. The borrower then deposited USDC 10 million and USDC 21 million to V2 and V3 respectively. This guy then borrowed 12 million USDT from V3 and deposited it with V2. Wu further explains: Twenty minutes after czsamsun.eth borrowed USDT, another address (0xd2&#8230;0701) mortgaged 52,200 stETH through Aave V2 and borrowed 50 million USDC, using USDC&#62;USDT de-peg, with a few million USDC converts USDC from Curve to USDT in batches at a time, and each operation can obtain an additional 1000-8000 USDT. However, Tether CTO Paolo Arduino remains calm. On Twitter, he commented that &#8220;markets are edgy in these days,&#8221; adding: &#8220;so it&#8217;s easy for attackers to capitalize on this general sentiment. But at Tether we&#8217;re ready as always. Let them come. We&#8217;re ready to redeem any amount.&#8221; Related Reading: Bitcoin Price Hammered Below $25,000 Amid Fed’s Hawkish Tone, SEC Lawsuits The last time Curve 3Pool was unbalanced was in mid-March, when the balance of USDC and DAI rose to over 45% each. Moreover, there was also an imbalance in November 2022 when FTX and in May 2022 when the Terra ecosystem collapsed. Will The Crypto Market Continue To Fall? Bitcoin, as the leading indicator for the crypto market, is in a critical situation. For the first time since the mid-March crash, the BTC price has fallen below the extremely important 200-day EMA (blue line). A recapture of the price level currently at $25,290 could be of high importance to create a recovery similar to mid-March 2023. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T09:18:35.000Z",
    "title": "Discover the Top Meme Coins in 2023: Hollywood X PEPE $HXPE Takes the Lead",
    "url": "https://www.crypto-news-flash.com/discover-the-top-meme-coins-in-2023-hollywood-x-pepe-hxpe-takes-the-lead/?utm_source=rss&utm_medium=rss&utm_campaign=discover-the-top-meme-coins-in-2023-hollywood-x-pepe-hxpe-takes-the-lead",
    "description": "If you&#8217;ve been following the blockchain space closely, you&#8217;re no stranger to the world of meme coins. These tongue-in-cheek cryptocurrencies have been making waves in the financial world with their unexpected surges in value. In this blog post, we will discuss some of the top meme coins in 2023, with a special spotlight on the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T09:16:18.000Z",
    "title": "Will Solana Fork in Response to SEC Pressure? Developer Sheds Light on Hard Fork Discussion",
    "url": "https://www.crypto-news-flash.com/will-solana-fork-in-response-to-sec-pressure-developer-sheds-light-on-hard-fork-discussion/?utm_source=rss&utm_medium=rss&utm_campaign=will-solana-fork-in-response-to-sec-pressure-developer-sheds-light-on-hard-fork-discussion",
    "description": "Following SEC&#8217;s classification of SOL as a security, there&#8217;s some chatter in the community about a hardfork of the Solana blockchain. The Solana Foundation and developers, however, don&#8217;t agree to it stating that it could sever ties with Alameda Research. Discussions are currently underway regarding forking Ethereum Layer-1 competitor Solana, which offers greater scalability among [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T09:15:48.000Z",
    "title": "Trader Predicts Over 50% Jump for One Top-10 Altcoin, Says Bitcoin Could Get ‘Violent’ if Support Level Crumbles",
    "url": "https://dailyhodl.com/2023/06/15/trader-predicts-over-50-jump-for-one-top-10-altcoin-says-bitcoin-could-get-violent-if-support-level-crumbles/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Jump-for-One-Top.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst and trader is predicting that XRP could go higher while expressing bearish sentiment on Bitcoin (BTC). The pseudonymous trader known as Altcoin Sherpa tells his 195,900 Twitter followers that XRP is flashing signs of strength amid the current market downturn. According to Altcoin Sherpa, XRP could surge to a level [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/trader-predicts-over-50-jump-for-one-top-10-altcoin-says-bitcoin-could-get-violent-if-support-level-crumbles/\">Trader Predicts Over 50% Jump for One Top-10 Altcoin, Says Bitcoin Could Get ‘Violent’ if Support Level Crumbles</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]