[
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T09:04:00.000Z",
    "title": "MetaMask scammers take over government websites to target crypto investors",
    "url": "https://cointelegraph.com/news/metamask-scam-government-websites-crypto-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a80584a0-512f-4e9d-ab27-d1c2cac1c285.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Official government websites from India, Nigeria, Egypt, Colombia, Brazil, Vietnam and other jurisdictions have been found redirecting to fake MetaMask websites.</p>\n                    <p><p>Crypto scams targeting MetaMask users are using government-owned website URLs to con victims and access their crypto wallet holdings.</p><p>Ethereum-based crypto wallet MetaMask has been a long-standing target for scammers — which involves redirecting unwary users to fabricated websites that request access to the MetaMask wallets. Cointelegraph’s investigation on the matter found numerous government-owned websites being used to perpetrate this exact scam.</p><p>Official government websites from India, Nigeria, Egypt, Colombia, Brazil, Vietnam and other jurisdictions have been found redirecting to fake MetaMask websites, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c0fa9d68-25f6-4ed1-a608-d7b58707c55b.png\"  /><figcaption style=\"text-align: center;\"><em>MetaMask scammers use government websites to steal from crypto users. Source: Cointelegraph (via Google)</em></figcaption></figure><p>Cointelegraph altered MetaMask about the ongoing scams and has not yet heard back from them at the time of writing.</p><p>Once a user clicks on any of the rogue links placed within the government website URLs, they are redirected to a fake URL, instead of the original URL \"MetaMask.io\". Once accessed, Microsoft’s built-in security — Microsoft Defender — warns users about a possible phishing attempt. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4827176d-1e81-42e4-b6c8-d0f9461099ba.png\"  /><figcaption style=\"text-align: center;\"><u><em>Microsoft's warning against the MetaMask phishing websites. Source: Cointelegraph</em></u></figcaption></figure><p>If a user decides to ignore the warning, they are then greeted by a website that closely resembles the official MetaMask website. The fake websites will eventually ask the users to link their MetaMask wallets to access various services on the platform. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/726782c1-93db-4001-8fa8-e55a9834b318.png\"  /><figcaption style=\"text-align: center;\"><em>Comparison between the original and fake MetaMask websites. Source: Cointelegraph</em></figcaption></figure><p>The above screenshot shows the similarity between the real and fake MetaMask websites, which is one of the main reasons investors fall for such common scams. Linking MetaMask wallets on such websites gives scammers complete control over the assets held over those particular MetaMask wallets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/scam-alert-metamask-warns-users-of-deceptive-march-31-airdrop-rumors\"><strong><em>Scam alert: MetaMask warns users of deceptive March 31 airdrop rumors</em></strong></a></p><p>In April, MetaMask denied claims of an exploit that potentially drained over 5,000 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Recent reporting on <a href=\"https://twitter.com/tayvano_?ref_src=twsrc%5Etfw\">@tayvano_</a>’s thread has incorrectly claimed that a massive wallet draining operation is a result of a MetaMask exploit. <br><br>This is incorrect. This is not a MetaMask-specific exploit. <a href=\"https://t.co/MiJ3QgslMy\">https://t.co/MiJ3QgslMy</a></p>&mdash; MetaMask  (@MetaMask) <a href=\"https://twitter.com/MetaMask/status/1648422118097584128?ref_src=twsrc%5Etfw\">April 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The wallet provider said the 5,000 ETH was stolen “from various addresses across 11 blockchains,” reaffirming the claim that funds were hacked from MetaMask “is incorrect.”</p><p>Speaking to Cointelegraph, Wallet Guard co-founder Ohm Shah said the MetaMask team has been “researching tirelessly,” and there is “no solid answer to how this has happened.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T08:55:55.000Z",
    "title": "South Korean Hana Bank enters crypto custody business with BitGo",
    "url": "https://cointelegraph.com/news/south-korean-hana-bank-enters-crypto-custody-business-with-bitgo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/40c3d249-963e-4c25-909f-1fb26091829a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>KEB Hana Bank and BitGo plan to launch a joint cryptocurrency custody venture in the second half of 2024.</p>\n                    <p><p>One of the largest South Korean banks, Korea Exchange Bank (KEB Hana Bank), is moving to offer digital asset custody services through a new partnership with major cryptocurrency custody firm BitGo Trust Company.</p><p>KEB Hana Bank has signed a strategic business agreement with BitGo to jointly establish digital asset custody in South Korea, the local news agency Yonhap <a href=\"https://www.yna.co.kr/view/AKR20230905075300002\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>. The commercial bank has a network of 111 branches with local banking assets of nearly $10 billion and equity of $490 million.</p><p>Hana Bank representatives reportedly announced the news on Sept. 5 at the cryptocurrency industry conference “Korea Blockchain Week.”</p><p>As part of the collaboration, the parties will establish a joint venture featuring BitGo’s custody solutions and Hana Bank’s financial service and compliance expertise.</p><p>“By promoting digital asset custody business together with global partners, we expect to contribute to strengthening trust in the domestic digital asset market and consumer protection,” a Hana Bank executive reportedly said.</p><p>BitGo CEO Mike Belshe noted that the firm will focus on its capabilities of enhancing transparency and security of the South Korean digital asset industry.</p><p>Hana Bank and BitGo <a href=\"https://forkast.news/headlines/south-koreas-hana-bank-bitgo/\" target=\"_blank\" rel=\"noopener nofollow\">plan</a> to launch their joint cryptocurrency custody venture in the second half of 2024, according to online reports.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitgo-raises-100-million-after-losing-lawsuit-against-galaxy\"><strong><em>BitGo raises $100M after losing lawsuit against Galaxy</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/cds-vs-stablecoins-korean-banks-to-research-the-stablecoins-alternative\">Hana Bank has recently expressed interest in tokenized deposit technology</a> as an alternative to private stablecoins and central bank digital currencies. </p><p>In July 2023, the bank issued a report alongside local private banks like Woori Bank and Maeli Business News Korea, describing the so-called “certificate of deposit” tokens that could potentially replace customary notes and deposits without disrupting the traditional banking system.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-05T08:55:46.000Z",
    "title": "$ETH: Crypto Influencer Heidi Chakos on ‘New Threat to Ethereum That No One is Talking About’",
    "url": "https://www.cryptoglobe.com/latest/2023/09/eth-crypto-influencer-heidi-chakos-on-new-threat-to-ethereum-that-no-one-is-talking-about/",
    "description": "In a recent video on her highly popular YouTube channel “Crypto Tips,” Heidi Chakos, a well-known crypto educator and influencer, discussed the increasing influence of Lido, a liquid staking platform, on the Ethereum network. According to Heidi, Lido currently controls 29% of the staking power on the Ethereum network. She pointed out that Ethereum has […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-05T08:46:12.000Z",
    "title": "Casio To Drop Virtual G-SHOCK NFTs On Polygon",
    "url": "https://cryptodaily.co.uk/2023/09/casio-to-drop-virtual-g-shock-nfts-on-polygon",
    "description": "The project will begin with an NFT-based G-SHOCK creator pass, which will invite users to design and vote on its appearance."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T09:06:49.000Z",
    "title": "DeFi TVL drops to 31-month low amid bear storm",
    "url": "https://crypto.news/defi-tvl-drops-to-31-month-low-amid-bear-storm/",
    "description": "The global DeFi total value locked (TVL) has been struggling since April, and with the recent bear storm, it has dropped to a 31-month low. According to data provided by DeFi Llama, the total decentralized finance (DeFi) TVL has been&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T08:58:32.000Z",
    "title": "Shiba Inu (SHIB) Presents Compelling Reversal Indicators – Could This Be It?",
    "url": "https://www.newsbtc.com/all/shiba-inu-shib-presents-compelling-reversal-indicators-could-this-be-it/",
    "description": "Shiba Inu (SHIB) has recently been on the radar of cryptocurrency enthusiasts as data suggests a potential comeback for this meme-inspired digital asset. The SHIB community had reason to celebrate with the successful relaunch of the Shibarium Layer 2 solution, akin to a tech company unveiling a highly anticipated software update.  This event not only breathed new life into the ecosystem but also injected a sense of optimism among SHIB holders. The Shibarium relaunch has elevated SHIB beyond its meme coin status, adding a layer of credibility and utility. Related Reading: Stellar Tough Spot: Will XLM Prices See A Dip Amid Mid-Range Struggles? SHIB Price Analysis Indicates Hope Over the past weeks, SHIB has seen a decline in its price, accompanied by a decrease in trading volume. However, recent price analysis hints at a potential change in the trend. The descending trading volume, coupled with the declining price, often serves as a signal that the downward momentum might be losing its steam.  It appears that the market may be running out of compelling reasons to continue pushing the asset lower, providing a glimmer of hope for SHIB enthusiasts. Surprising Popularity Among American Investors In a surprising turn of events, Shiba Inu emerged as the sixth most popular cryptocurrency asset among American investors, according to a recent survey conducted by ConsenSys. Interestingly, 17% of respondents had allocated their funds to this $4.5 billion market-capped asset, placing SHIB ahead of larger and more established cryptocurrencies like Tether and Cardano. Source: ConsenSys The survey also unveiled a prevailing sentiment among respondents regarding the cryptocurrency landscape. Many felt that this asset class needed &#8220;heavy regulation&#8221; to protect investors due to the prevailing uncertainty. While Bitcoin and Ethereum still held the top positions in terms of popularity among American investors, SHIB&#8217;s unexpected rise in popularity signifies a growing interest in alternative cryptocurrencies. SHIB market cap currently at $4.4 billion. Chart: TradingView.com Current State Of SHIB As of now, SHIB is trading at $0.00000745, according to CoinGecko. Over the past 24 hours, the asset has experienced a 3.3% decline, while the seven-day performance shows a 9.3% slump. These figures reflect the ongoing volatility in the cryptocurrency market but also underline the potential for a turnaround as SHIB aims to regain its footing. Related Reading: Pepe Coin September Challenge: Can It Reach $0.000001 Again? Shiba Inu&#8217;s recent Shibarium relaunch and its surprising popularity among American investors suggest that this meme-inspired cryptocurrency might be poised for a resurgence.  Despite recent price declines, the signs of optimism, coupled with a shifting sentiment in the cryptocurrency landscape, could pave the way for a potential comeback for SHIB. However, as with all cryptocurrencies, investors should exercise caution and conduct thorough research before making any investment decisions. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from CarSwitch"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T09:00:55.000Z",
    "title": "NEAR Protocol (NEAR) and Tezos (XTZ) Turn Bullish, but for How Long? Everlodge (ELDG) To Pump by 191%",
    "url": "https://www.crypto-news-flash.com/near-protocol-near-and-tezos-xtz-turn-bullish-but-for-how-long-everlodge-eldg-to-pump-by-191/",
    "description": "<img width=\"512\" height=\"242\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T104324.713.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T104324.713.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T104324.713-300x142.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Recently, NEAR Protocol (NEAR) and Tezos (XTZ) have shown bullish signs, raising questions about the sustainability of their upward trajectories. Amidst this uncertainty, Everlodge (ELDG) has captured the attention of investors with the potential for a substantial 191% surge. Keep reading to dive into the factors influencing these tokens&#8217; movements and explore the reasons behind [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T08:42:10.000Z",
    "title": "Bitcoin’s Price Hovers Below $26K Amid SEC ETF Delays: Crypto Market Update",
    "url": "https://www.crypto-news-flash.com/bitcoins-price-hovers-below-26k-amid-sec-etf-delays-crypto-market-update/",
    "description": "<img width=\"1280\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-1024x639.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-768x479.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-163x102.png 163w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Bitcoin price takes a nosedive to trade below $26k after staging a rally last week to hit $28k. The reason for the fall has been linked to the delay in SEC&#8217;s ETF decision which was expected to be made by Friday.  The crypto market made a shocking turnaround last week with Bitcoin leading the altcoins [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-05T09:02:38.000Z",
    "title": "TOKEN2049 Singapore will Be the World’s Largest WEB3 Event.",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/token2049-singapore-will-be-the-worlds-largest-web3-event/",
    "description": "<p>TOKEN2049, Asia&#8217;s top Web3 and cryptocurrency conference, has unveiled a lineup of prominent title sponsors and keynote speakers for its forthcoming Singapore edition. TOKEN2049 will take place on September 13-14, 2023, at Marina Bay Sands, exactly 50 days before the Formula 1 Singapore Grand Prix 2023 race weekend. In this article, you will discover more [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/token2049-singapore-will-be-the-worlds-largest-web3-event/\">TOKEN2049 Singapore will Be the World&#8217;s Largest WEB3 Event.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T08:48:00.000Z",
    "title": "Shiba Inu Price Awaits Shibarium Momentum As Traders Remain Cautious",
    "url": "https://coinedition.com/shiba-inu-price-awaits-shibarium-momentum-as-traders-remain-cautious/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SHIB Has Potential For Continued Bull Run, Will the Bulls Rally ?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/7.-Shiba-Inu-to-dominate-top-Altcoins-soon-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shiba Inu&#8217;s price continues to decline despite growing acceptance and adoption of its layer-2 network. Many people expected the Shibarium relaunch to boost the token’s price, but traders are still threading with caution. Since its relaunch, Shibarium has been met with growing acceptance and adoption by the crypto community. Despite these successes, activities on the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-price-awaits-shibarium-momentum-as-traders-remain-cautious/\">Shiba Inu Price Awaits Shibarium Momentum As Traders Remain Cautious</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]