[
  {
    "source": "CoinDesk",
    "date": "2023-09-18T15:00:00.000Z",
    "title": "Crypto VC Firm Blockchain Capital Raises $580M for 2 New Funds",
    "url": "https://www.coindesk.com/business/2023/09/18/crypto-vc-firm-blockchain-capital-raises-580m-for-2-new-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Most of the firm's limited partners are traditional institutional investors, including university endowments, private foundations, financial institutions, sovereign wealth funds and U.S. pension plans."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T14:54:14.000Z",
    "title": "Decentralized finance needs alternatives to blockchain",
    "url": "https://cointelegraph.com/news/decentralized-finance-needs-alternatives-to-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6cb0c057-f3a2-435e-8f93-957639604288.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Critics often overlook the inconvenient fact that “decentralized” blockchains in fact depend on centralized points of failure that have the potential to corrupt entire ecosystems.</p>\n                    <p><p>One of the laziest and most frustrating criticisms of digital currencies — particularly Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) — is when pundits liken it to a pyramid scheme dependent on the “greater fool” joining to make a quick buck. While some people do indeed purchase digital assets purely for speculative purposes, it’s unfair to ignore many of the great services and achievements that are being made by developers in areas such as remittances, logistics, financial inclusion and intellectual property.</p><p>A fairer criticism of blockchains is that, for all proponents say about decentralization, blockchains are still dependent on miners or other powerful players that control their networks. Whether it be factories filled with servers for <a href=\"https://cointelegraph.com/blockchain-for-beginners/proof-of-stake-vs-proof-of-work:-differences-explained\">proof-of-work (PoW)</a>, pools of PoW miners, large pools of tokens for <a href=\"https://cointelegraph.com/news/how-bitcoin-can-help-secure-proof-of-stake-blockchain-protocols\">proof-of-stake (PoS)</a>, or the fact that at times, more than 50% of transactions that run on the Ethereum network run through the Infura API, there’s no ignoring these massive centralized points of failure.</p><p>Granted, the design of popular PoW and PoS blockchains has been incentivized to ensure bad actors are punished, yet it remains to be seen how they will operate when the value of digital assets operating on certain blockchains exceeds the value of the underlying ledger’s native coin. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-s-merge-will-affect-more-than-just-its-blockchain\"><strong><em>Ethereum’s Merge will affect more than just its blockchain</em></strong></a></p><p>Imagine, for instance, if a popular stablecoin grew so large that its total value exceeded that of the native coin of the underlying blockchain it operated on. Essentially, it would create an inverse pyramid whereby the holders of the native token could control the transactions of the said stablecoin. Given the concentration of many crypto assets among “whales” who have a vested interest in their blockchain’s native token (and price), this could become a very real problem. </p><p>In Ethereum, as a PoS ledger, miners’ stakes are in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). Should Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) or USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) become larger than Ether in market value, they could theoretically pull off a double-spend in those respective digital currencies, lose their Ether stake, and still profit more from the double-spend. Although it still remains hypothetical, it’s by no means unimaginable.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a0e90263-060f-4509-b309-65f7c8da4762.jpg\"  /></figure><p>This then poses a question regarding how we should rethink distributed ledger technology (DLT) architecture and the role mining or staking assets should play.</p><p>Tether now boasts a market capitalization of over $80 billion, Circle just under $30 billion, while the Ethereum blockchain it’s programmed on has a market capitalization of Ether over $220 billion — not that far, given how quickly things can change in crypto.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tax-on-income-you-never-earned-it-s-possible-after-ethereum-s-merge\"><strong><em>Tax on income you never earned? It’s possible after Ethereum’s Merge</em></strong></a></p><p>This problem might seem theoretical and far off from being a potential issue; however, the rapid growth of cryptocurrencies as an asset class over the last decade should make people pause to consider what could happen if stablecoins enter the mainstream. Although DLT remains a very young industry, the last 14 years have given us their fair share of unexpected surprises, unintended consequences and shocks that, in hindsight, seemed obvious.</p><p>Developers might consider whether now is the time to rethink the architecture underpinning digital assets. Dependency on centralized miners or servers, mistakes made by coders writing smart contracts, and the potential for double-spend when projects exceed the value of their underlying blockchains mean decentralized finance needs to look at alternatives to blockchain. Post-blockchain distributed ledgers, such as <a href=\"https://cointelegraph.com/explained/what-is-a-directed-acyclic-graph-in-cryptocurrency-how-does-dag-work\">directed acyclic graphs (DAG)</a>, which allow access to anyone and don’t rely on block producers, could provide an insight into how this industry evolves over the next decade.</p><p>Whatever form the new architecture takes is a prize waiting to be claimed. Only then will the industry finally live up to its promise and stop being associated with pyramid schemes.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Anton Churyumo </strong>is the founder of Obyte. He previously served as the co-founder and CEO of companies including Teddy ID, SMS Traffic and Platron. He graduated from the Moscow Engineering Physics Institute before obtaining a graduate degree in math and theoretical physics.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-18T14:56:38.000Z",
    "title": "Islamic Coin Launches Public Sale On Republic",
    "url": "https://cryptodaily.co.uk/2023/09/islamic-coin-launches-public-sale-on-republic-1",
    "description": "Islamic Coin Launches Public Sale On Republic"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T15:00:14.000Z",
    "title": "OMG Price Prediction 2023-2032: Can OMG spike soon?",
    "url": "https://www.cryptopolitan.com/omg-price-prediction/",
    "description": "OMG Price Predictions 2023-2032 Unique crypto projects have been created to solve different real-world problems, and their underlying blockchain technologies show great promise. However, the mass adoption of these projects has been slow due to a combination of technological immaturity and bad press. The OMG network is one project that is striving to change this ... <a title=\"OMG Price Prediction 2023-2032: Can OMG spike soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/omg-price-prediction/\" aria-label=\"More on OMG Price Prediction 2023-2032: Can OMG spike soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T14:56:24.000Z",
    "title": "Islamic Coin Launches Public Sale On Republic",
    "url": "https://www.cryptopolitan.com/islamic-coin-launches-public-sale-on-republic/",
    "description": "Zug, Switzerland, September 18th, 2023, Chainwire Islamic Coin has launched its Reg D Token Offering to the Public with OpenDeal Broker LLC, dba THE CAPITAL R (“ODB”) – a subsidiary of Republic. ISLM (Islamic Coin token) is a digital money that adheres to Shariah principles and emphasizes ethical values. This synergy encompasses support from Republic ... <a title=\"Islamic Coin Launches Public Sale On Republic\" class=\"read-more\" href=\"https://www.cryptopolitan.com/islamic-coin-launches-public-sale-on-republic/\" aria-label=\"More on Islamic Coin Launches Public Sale On Republic\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T14:52:09.000Z",
    "title": "AI-Driven Surveys and Web Scraping: Revolutionizing Data Collection for Marketers",
    "url": "https://www.cryptopolitan.com/ai-driven-surveys-and-web-scraping/",
    "description": "Data Science and Artificial Intelligence (AI) have become integral to the field of marketing, allowing marketers to make informed decisions and optimize their strategies. However, the manual collection and reporting of data can be time-consuming and tedious. Fortunately, AI can seamlessly integrate with data science, making the marketer&#8217;s job more efficient while maintaining essential data ... <a title=\"AI-Driven Surveys and Web Scraping: Revolutionizing Data Collection for Marketers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-driven-surveys-and-web-scraping/\" aria-label=\"More on AI-Driven Surveys and Web Scraping: Revolutionizing Data Collection for Marketers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T14:49:10.000Z",
    "title": "Bank of England’s possible interest hike poses risk of overtightening",
    "url": "https://www.cryptopolitan.com/bank-of-englands-possible-interest-hike/",
    "description": "Financial markets are anticipating that the Bank of England (BoE) will implement another quarter-point increase in interest rates at its upcoming meeting on Thursday. This move would bring the borrowing cost to 5.5%, marking its highest level since early 2008. Presently, markets are factoring in approximately 18 basis points for this week&#8217;s meeting. Although forward ... <a title=\"Bank of England&#8217;s possible interest hike poses risk of overtightening\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-englands-possible-interest-hike/\" aria-label=\"More on Bank of England&#8217;s possible interest hike poses risk of overtightening\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-18T14:58:48.000Z",
    "title": "Current Popular Crypto Narratives That Would Spearhead The Next Bitcoin Market Bull Run",
    "url": "https://nulltx.com/current-popular-crypto-narratives-that-would-spearhead-the-next-bitcoin-market-bull-run/",
    "description": "The crypto market has been in a bear market for the past few months, but there are signs that the next bull run is on the horizon. Here are some recent, current, and popular crypto narratives, including RWA, that will spearhead the next Bitcoin market bull run: Institutional Adoption Institutional adoption of crypto is one [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T15:02:59.000Z",
    "title": "A&T Capital loses major financial backer in retreat from crypto",
    "url": "https://crypto.news/at-capital-loses-major-financial-backer-in-retreat-from-crypto/",
    "description": "Ant Group, the Chinese fintech giant, is reportedly set to divest its investment in A&#38;T Capital, marking a significant retreat from a $100 million venture central to its crypto strategy. This announcement represents a step back from a $100 million&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T14:40:24.000Z",
    "title": "China to establish regulatory standards for metaverse",
    "url": "https://crypto.news/china-to-establish-regulatory-standards-for-metaverse/",
    "description": "Beijing is seeking a way to put regulatory burden on the yet-to-be-developed next internet iteration. China is set to form a working group to develop standards for the metaverse as the country sees a big future for the technology. According&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T14:45:23.000Z",
    "title": "Why Is Bitcoin Price Up Today? BTC Climbs Above $27,000",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-price-up-today-btc-above-27000/",
    "description": "The Bitcoin price is sustaining its bullish momentum from the previous day. Today, it surpassed the $27,000 threshold, a level not seen since August 31. Notably, BTC recorded its first green weekly closing candle in five weeks yesterday. As of press time, the Bitcoin price has reached an intra-day high of $27,267. Why Is Bitcoin Price Up Today? One major indicator that has captured analysts&#8217; attention is the rapid increase in Open Interest. DaanCrypto, a noted figure in the crypto space, commented on the Open Interest of Bitcoin: &#8220;Bitcoin Open Interest has been ramping up like crazy these past few hours. Up +$850M in hours.&#8221; According to him, this can be an issue if spot bid disappears which could cause for a full retrace similar to before. &#8220;This would then be due to underwater positions that entered near the top. If spot bid remains then these positions are obviously fine. Open Interest is now back to post Grayscale pump levels,&#8221; Daan stated, further noting the resilience in the spot premium at the moment, &#8220;Longs are comfy as long as spot bid is present.&#8221; Maartuun, the community manager at CryptoQuant Netherlands, also highlights the rapid surge in Open Interest: &#8220;Fasten your seat belts. The Open Interest goes bonkers on this break-out attempt. It has increased by $600 million (7%).&#8221; Related Reading: Jordan Peterson Sparks Debate On How Bitcoin Can Solve Major Banking Problem Interestingly, Coinglass data reveals that as of press time, short liquidations for BTC remain modest, with just about $20 million in shorts being liquidated. At press time, OI skyrocketed further, up almost $1 billion (from $11.04 to $12.03 billion). Renowned analyst @52kskew emphasized the trading behavior on Binance: &#8220;Majority chasing shorts aggressively from what I can see so far. Binance Open Interest: Binance perp OI starting to moon again with minimal price difference ~ big move brewing. OI up and insignificant change in perp delta (positions opening into price). Takers still aggressively selling into price, bulls want to see constant limit chasing on the bid here. $26.7K pivotal price for direction.&#8221; Ali Martinez, another analyst, pointed towards Bitcoin&#8217;s 3-day chart and noted a buy signal by the TD Sequential yesterday. &#8220;A boost in $BTC buying pressure might drive prices to the channel&#8217;s mid or upper boundary &#8211; targeting $28,000 or $31,000. Still, watch the TD Risk Line at $24,500. It&#8217;s the key invalidation point.&#8221; From macro perspective, renowned analyst Ted (@tedtalksmacro) indicated a correlation between USD liquidity and Bitcoin price movements: &#8220;If you can track/forecast USD liquidity, you&#8217;ll have a solid idea of where price is headed.&#8221; He went on to highlight a divergence between the rise in USD liquidity and the previous stagnation of BTC, emphasizing the recent shift which might be driven by returning liquidity. Monthly Close Will Be Crucial As NewsBTC reported, September is historically one of the worst months of the year for the Bitcoin price. However, this year could be different if BTC continues its trend of the last few days. Rekt Capital highlighted the potential significance of the upcoming monthly candle close for Bitcoin in a recent tweet, stating: &#8220;The upcoming Monthly Candle Close will be pivotal.&#8221; According to the analyst, Bitcoin often produces long upward wicks when it transforms old Monthly supports into new resistances. Related Reading: Glassnode Co-Founders Weigh In On Bitcoin (BTC) Path To $30,000 In simple terms, an upward wick on a candlestick chart indicates price levels where Bitcoin traded during a period but didn&#8217;t close. A long wick suggests a strong rejection from those higher price levels. This could mean that while buyers tried to push the price up during the month, by the close, sellers had brought it back down, leaving a long &#8216;wick&#8217; on the candlestick. Rekt Capital suggests that these wicks can extend up to +8% beyond the candle body. The analyst notes that if the monthly candle close produces an upside wick of +7% beyond the ~$27,100 level, it could mean the price might go beyond the weekly lower high. This could be a positive sign if the monthly close remains above $27,100, indicating it as a support level. However, if the price closes the month below $27,100 after reaching higher levels, it may confirm $27,100 as a new resistance, hinting that the recent price movement might be just a temporary upward rally. At press time, BTC stood at $27,241. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T15:00:47.000Z",
    "title": "The Road to 10x Gains: Between UMA, Nervos Network and Anarchy, Which Token Will Win?",
    "url": "https://www.crypto-news-flash.com/the-road-to-10x-gains-between-uma-nervos-network-and-anarchy-which-token-will-win/?utm_source=rss&utm_medium=rss&utm_campaign=the-road-to-10x-gains-between-uma-nervos-network-and-anarchy-which-token-will-win",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-80.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-80.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-80-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-80-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Last week, Bloomberg analysts took it a step further by predicting there would be a 75% chance of spot Bitcoin ETFs launching this year. While this increased optimism in the market, the entire table was flipped when Greyscale was declared the winner of the lawsuit against the SEC. The advent of this occurrence has increased [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T14:57:29.000Z",
    "title": "Ripple’s Key Partnerships Poised to Transform Tokenization, Experts Say",
    "url": "https://www.crypto-news-flash.com/ripples-key-partnerships-poised-to-transform-tokenization-experts-say/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-key-partnerships-poised-to-transform-tokenization-experts-say",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer John Deaton\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Many industry commentators have acknowledged Ripple Labs&#8217; role in today&#8217;s financial evolution. With the Metaco and Fortress Trust acquisition, the company will hold a main spot as a financial and tokenization infrastructure provider. Experts in the blockchain industry have praised Ripple Labs Inc.’s strategic partnerships with Metaco and Fortress Trust, citing its potential to revolutionize [...]"
  }
]