[
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T03:21:09.000Z",
    "title": "Gala Games founders biff over $130M theft, corporate waste allegations",
    "url": "https://cointelegraph.com/news/gala-games-founders-sue-court-token-theft-corporate-waste",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/adf1c625-62de-4960-97fb-2a700b52b20a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gala co-founder Eric Schiermeyer allegedly enriched himself, says his founding peer Wright Thurston, while Schiermeyer says Thurston stole millions.</p>\n                    <p><p>The co-founders of blockchain gaming platform Gala Games have locked horns in court over two separate lawsuits, one alleging the theft of $130 million worth of Gala (<a href=\"https://cointelegraph.com/gala-price-index\">GALA</a>) and the other, alleging corporate waste.</p><p>On Aug. 31 Gala co-founders Wright Thurston and Eric Schiermeyer, also the firm’s CEO, filed lawsuits against one another in a Utah District Court.</p><p>On behalf of Gala, Schiermeyer <a href=\"https://ecf.utd.uscourts.gov/doc1/18306207947?caseid=142042\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> that in early 2021 Thurston and his investment firm True North United Investments <a href=\"https://cointelegraph.com/news/exploits-hacks-and-scams-stole-almost-1b-in-2023-report\">stole around</a> $130 million worth of GALA — a token tied to the Gala Games ecosystem.</p><p>Schiermeyer’s suit claims GALA tokens were moved to a wallet under the company’s control but were later moved into 43 other wallets by Thurston who, when confronted about the movements, said he was holding the tokens in secure wallets for Gala.</p><p>He later moved the tokens from the wallets and exchanged or sold them in a “complex web of obfuscatory transactions” between September 2022 and May 2023, the suit alleged.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c63bbf33-3c1c-4572-8ab7-33d3cc8530a0.png\"  /><figcaption style=\"text-align: center;\"><em>Excerpt from Schiermeyer's suit against Thurston regarding the allegedly stolen GALA. Source: PACER</em></figcaption></figure><p>The suit claimed Thurston later feined knowledge of the alleged token sales but now claims the sold GALA belonged to him — which Schiermeyer’s suit rejected.</p><p>Thurston is also alleged to have stolen licenses to run Gala ecosystem nodes which can earn GALA tokens — selling the licenses and keeping the proceeds.</p><p>The same day, Thurston’s True North <a href=\"https://ecf.utd.uscourts.gov/doc1/18306209021?caseid=142069\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a lawsuit against Schiermeyer — similarly on behalf of Gala — claiming he caused Gala to “sell off and waste millions of dollars in company assets” and lent millions of Gala’s funds to himself <a href=\"https://cointelegraph.com/news/ftx-yacht-former-alameda-ceo-sam-trabucco\">for personal purchases</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/30982ed3-6972-4304-ba0e-8c433b5ad8f8.png\"  /><figcaption style=\"text-align: center;\"><em>Highlighted excerpt from Thurston’s suit against Schiermeyer’s claiming the latter used Gala’s assets for personal gain. Source: PACER</em></figcaption></figure><p>Schiermeyer also allegedly created Gala entities in Switzerland and Dubai and made himself the controlling shareholder to pursue business opportunities, according to the lawsuit. </p><p>True North claims Schiermeyer operated Gala without input from Thurston — a Gala director — and gave incomplete or incorrect information and corporate records to Thurston “despite repeated requests.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-vs-sec-new-attorney-patrick-v-kennedy-joins-fight\"><strong><em>SEC vs. Coinbase: New lawyer Patrick Kennedy joins fight</em></strong></a></p><p>Schiermeyer’s suit requested Thurston be removed as a Gala director and seeks various relief and damages payments including the return of the allegedly stolen GALA.</p><p>Thurston similarly requested that Schiermeyer be removed from Gala and sought at least $750 million in various damages and relief.</p><p>In March, the United States Securities and Exchange Commission sued Thurston, True North and another company he founded called Green United <a href=\"https://cointelegraph.com/news/sec-accuses-utah-firm-of-fraudulent-18m-crypto-mining-scheme\">for selling investments</a> in an allegedly fake crypto mining scheme.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gta-owner-blockchain-game-bitcoin-casino-sunflower-land-review-web3-gamer/\"><strong><em>Web3 Gamer: GTA owner joins Web3, Bitcoin casino, Sunflower Land review</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-04T03:30:52.000Z",
    "title": "Report: Kenyan Subscribers Constituted 25% Worldcoin’s Global Total in July",
    "url": "https://news.bitcoin.com/report-kenyan-subscribers-constituted-25-worldcoins-global-total-in-july/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Kenyan Subscribers Constituted 25% Worldcoin&#039;s Global Total in July\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/kenysa.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />At some point in July, there were as many as 350,000 Kenya-based residents who had subscribed and shown interest in receiving Worldcoin&#8217;s crypto token. According to a Kenyan legislator, Worldcoin executives are now expected to appear before a parliamentary committee on Sept. 4. Argentina&#8217;s Record Sign Ups A Kenyan parliamentary committee tasked with investigating Worldcoin’s [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T03:26:54.000Z",
    "title": "Bitcoin Price Recovery Could Soon Fade If BTC Fails To Surpass 100 SMA",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-recovery-fade-26200/",
    "description": "Bitcoin price tested the $25,350 zone and is currently recovering. BTC must clear the $26,200 resistance to start a decent increase in the near term. Bitcoin is attempting a recovery wave from the $25,350 zone. The price is trading below $26,200 and the 100 hourly Simple moving average. There was a break above a major bearish trend line with resistance near $26,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a decent increase if it clears $26,200 and the 100 hourly SMA. Bitcoin Price Faces Hurdles Bitcoin price remained in a bearish zone below the $27,000 resistance zone. BTC extended its decline and traded below the $26,000 level. There was also a spike below $25,500 and the price tested $25,350. A low was formed near $25,333 and the price is now attempting a recovery wave. There was a minor increase above the $25,800 resistance. The price climbed above the 23.6% Fib retracement level of the downward move from the $28,150 swing high to the $25,333 low. Besides, there was a break above a major bearish trend line with resistance near $26,000 on the hourly chart of the BTC/USD pair. However, Bitcoin is still trading below $26,200 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $26,200 level and the 100 hourly SMA. The first major resistance is near the $26,750 level or the 50% Fib retracement level of the downward move from the $28,150 swing high to the $25,333 low. Source: BTCUSD on TradingView.com The main resistance is now forming near the $27,000 level. A clear move above the $27,000 level might send the price toward $27,500. The next major resistance is near $28,000, above which there could be a decent upward move. In the stated case, the price could test the $28,800 level. Another Decline In BTC? If Bitcoin fails to clear the $26,200 resistance, it could start another decline. Immediate support on the downside is near the $25,650 level. The next major support is near the $25,350 level. A downside break below the $25,350 level might send the price further lower. In the stated case, the price could drop toward $24,800. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $25,650, followed by $25,350. Major Resistance Levels – $26,200, $26,750, and $27,000."
  }
]