[
  {
    "source": "CoinDesk",
    "date": "2023-10-03T19:44:47.000Z",
    "title": "Chinese Firms Used Crypto Payments to Run Fentanyl Network, U.S. Claims in Charges",
    "url": "https://www.coindesk.com/policy/2023/10/03/chinese-firms-used-crypto-payments-to-run-fentanyl-network-us-claims-in-charges/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Department of Justice (DOJ) targeted several Chinese businesses and their employees Tuesday in the latest round of charges tied to production and trafficking of fentanyl – a network that depended on cryptocurrency payments, according to authorities."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T19:40:00.000Z",
    "title": "Bitcoin price drops its early week gains — Here is why",
    "url": "https://cointelegraph.com/news/why-bitcoin-price-drops-its-early-week-gains",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/487d6f22-4eb2-45f2-9fd6-5963617a14f5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price gave up its recent gains as concerning signals from the US economy continue to weigh on investor sentiment.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price gained 6% from Oct. 1 to Oct. 2 but after failing to break the $28,500 resistance, the price dropped by 4.5% on the same day. This decline happened because of the disappointing performance of Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures exchange-traded funds (ETFs) that were launched on Oct. 2 and concerns about an upcoming economic downturn.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/cbbbf5d7-5abf-4482-bf3b-b580c01f257a.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin price index, USD. Source: TradingView</em></figcaption></figure><p>This correction in Bitcoin's price on Oct. 3 marks 47 days since Bitcoin last closed above $28,000 and has led to the liquidation of $22 million worth of long leverage futures contracts. But before discussing the events affecting Bitcoin and the cryptocurrency market, let's attempt to understand how the traditional finance industry has affected investor confidence.</p><h2>The overheated US economy could lead to more Fed action</h2><p>Investors have heightened their expectations of further contractionary measures by the U.S. Federal Reserve following the release of the latest U.S. labor market data on Oct. 3, revealing that there were 9.6 million job openings at the end of August, up from 8.9 million in July.</p><p>Fed Chair Jerome Powell had indicated during a <a href=\"https://www.reuters.com/markets/us/highlights-fed-chair-powells-jackson-hole-speech-2023-08-25/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">speech</a> at the Jackson Hole Economic Symposium in August that \"evidence suggesting that tightness in the labor market is no longer easing could necessitate a monetary policy response.\"</p><p>Consequently, traders are now pricing in a 30% chance that the Fed will raise rates at their November meeting, compared to 16% in the previous week, according to the CME's FedWatch tool.</p><h2>The Ether futures ETFs launch falls short</h2><p>On Oct. 2, the market welcomed nine new ETF products expressly designed to mirror the performance of futures contracts linked to Ether. However, these products saw <a href=\"https://cointelegraph.com/news/ethereum-futures-etfs-launch-low-volume-trading-first-day\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-futures-etfs-launch-low-volume-trading-first-day/amp\">trading volumes of under $2 million</a> during the first trading day, as of midday Eastern Time. Senior ETF analyst at Bloomberg, Eric Balchunas, noted that the trading volumes fell short of expectations.</p><figure><img alt=\"\" src=\"https://s3.cointelegraph.com/uploads/2023-10/02454f9b-37bb-4504-92cc-5eb410261e27.png\" title=\"\"><figcaption style=\"text-align: center;\"><em>Ethereum futures-based ETF volumes on Oct. 2, USD. Source: K33 Research / <a href=\"https://twitter.com/VetleLunde\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">@VetleLunde</a></em></figcaption></figure><p>On the debut day, the trading volume for Ether ETFs significantly lagged behind the remarkable $1 billion launch of the ProShares Bitcoin Strategy ETF. It's worth noting that the Bitcoin futures-linked ETF was introduced in October 2021 during a flourishing cryptocurrency market.</p><p>This occurrence may have dampened investors' outlook on the potential inflow after an eventual Bitcoin spot ETF. Still, there remains uncertainty surrounding the probability and timing of these approvals by the U.S. Securities and Exchange Commission (SEC).</p><h2>Regulatory pressure mounts as Binance faces a class-action lawsuit</h2><p>On Oct. 2, a <a href=\"https://cointelegraph.com/news/class-action-suit-filed-against-binance-alleged-harm-ftx-collapse\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/class-action-suit-filed-against-binance-alleged-harm-ftx-collapse/amp\">class-action lawsuit was filed against Binance.US</a> and its CEO Changpeng \"CZ\" Zhao in the District Court of Northern California. The lawsuit alleges unfair competition aimed at monopolizing the cryptocurrency market by harming its competitor, the now-defunct exchange FTX.</p><p>The plaintiffs claim that CZ's statements on social media were false and misleading, particularly since Binance had previously sold its FTT token holdings before the announcement on Nov. 6, 2022. The lawsuit asserts that CZ's intention was to drive down the price of the FTT token.</p><p>The criminal <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-preview\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-ftx-trial-preview/amp\">case against Sam Bankman-Fried will begin on Oct. 4</a> in New York. Despite CZ's denial of unfair competition allegations, speculation within the crypto community continues to circulate regarding this matter.</p><h2>BTC’s correlation to traditional markets seems higher than anticipated</h2><p>Bitcoin's price decline on Oct. 3 appears to reflect concerns about an impending economic downturn and the potential Federal Reserve's monetary policy response. Furthermore, it demonstrated how closely cryptocurrency markets are tied to macroeconomic factors.</p><p>Exaggerated expectations for the cryptocurrency ETFs also signal that the $28,000 level might not be the consensus for investors given the regulatory pressures and legal challenges, such as the class-action lawsuit against Binance, which underscore the ongoing risks in the space.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</p>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-03T19:58:25.000Z",
    "title": "Fireside Chat With the FCA’s Head of Capital Markets: A Report From CCDAS 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/10/fireside-chat-with-the-fcas-head-of-capital-markets-a-report-from-ccdas-2023/",
    "description": "Earlier today, Helen Boyd, a key figure at the Financial Conduct Authority (FCA) participated in a Fireside Chat with Alissa Ostrove, Chief of Staff at CCData, during CCDAS, which is the UK’s premier annual digital asset conference that is organized by CCDtata, an FCA-authorized benchmark administrator and a global leader in providing institutional-grade digital asset […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T19:50:09.000Z",
    "title": "Government Embracing a Post-Digital Era: The Power of Data Integration and AI",
    "url": "https://www.cryptopolitan.com/government-embracing-a-post-digital-era/",
    "description": "In recent years, the government&#8217;s journey towards IT modernization has been synonymous with digital transformation. However, the landscape is rapidly evolving, with artificial intelligence (AI) and advanced data integration capabilities pushing the boundaries of what&#8217;s possible. According to Accenture, while digital remains crucial, it has become the baseline for conducting government business. Gartner&#8217;s insights indicate ... <a title=\"Government Embracing a Post-Digital Era: The Power of Data Integration and AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/government-embracing-a-post-digital-era/\" aria-label=\"More on Government Embracing a Post-Digital Era: The Power of Data Integration and AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T19:42:30.000Z",
    "title": "Sam Bankman-Fried takes his insurance provider to court",
    "url": "https://www.cryptopolitan.com/sam-bankman-fried-takes-his-insurance-provider-to-court/",
    "description": "Sam Bankman-Fried has recently filed a lawsuit against his insurance provider, CNA, also known as the Continental Casualty Company. The suit accuses CNA of failing to honor his insurance claims for legal defense costs. However, this suit is just one component in a multifaceted legal landscape surrounding Bankman-Fried and his businesses. According to court documents, ... <a title=\"Sam Bankman-Fried takes his insurance provider to court\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sam-bankman-fried-takes-his-insurance-provider-to-court/\" aria-label=\"More on Sam Bankman-Fried takes his insurance provider to court\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T20:00:42.000Z",
    "title": "Ethereum ETFs Face Lackluster Debut From Small Investors: Is The Hype Fizzling Out?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-etfs-face-lackluster-debut-from-small-investors-is-the-hype-fizzling-out/",
    "description": "Yesterday&#8217;s launch of futures-based Ethereum (ETH) exchange-traded funds (ETFs) delivered underwhelming results, with shallow trading volumes indicating a deficient demand for ETH exposure. Furthermore, a recent report by The Wall Street Journal report by The Wall Street Journal, it was revealed that the launch of the first Ethereum exchange-traded funds on Monday generated little interest from small investors.  These ETFs provided individual investors access to the second-largest cryptocurrency through brokerage accounts. However, per the report, most of the futures-based Ether ETFs ended the day in the red, with a combined trading volume of less than $2 million. Related Reading: Bitcoin News: Revival Of “Satoshi Nakamoto” Account Could Signal Slump In BTC Price? Red Flags For Ethereum ETFs? The Ether ETFs, offered by prominent asset management firms such as ProShares, VanEck, and Bitwise Asset Management, are entering a highly competitive market. Experts believe these funds will have to compete fiercely in cost and marketing strategies to attract investors amidst the crowded landscape. Eric Balchunas, senior ETF analyst at Bloomberg Intelligence, expressed his concerns regarding the funds, stating:  A lot of these funds are going to struggle to get assets. There&#8217;s probably only room for one stud in this race. During a Bloomberg TV appearance, Balchunas emphasized the relatively low trading volume of the Ethereum ETFs compared to BITO, a Bitcoin (BTC) ETF that tracks the price of BTC using Bitcoin Futures launched in 2021.  Notably, the trading environment for the first futures-based Ether ETFs differs significantly from the first futures-based Bitcoin ETFs. ProShares&#8217; initial Bitcoin ETF (BITO) debut, which took place during the peak of the crypto bull market, was one of the most highly traded ETF launches ever.  Conversely, on the inaugural trading day of Ether future ETFs, the value traded amounted to nearly $1.9 million by noon, with Valkyrie emerging as the frontrunner in the race for Ether futures ETFs. Initially focused on Bitcoin futures and later expanded to include Ether, the fund experienced a 3.9% increase. VanEck&#8217;s EFUT managed to generate some volume by launching ahead of its competitors. However, volumes quickly dwindled, with a staggering 49% of EFUT&#8217;s daily volume occurring within its first trading minute.  Disappointing Launch Day For Futures-Based ETH Senior analyst of k33 research, Vetle Lunde, suggests that this lackluster launch points to more choppy market conditions ahead. The highly anticipated launch day failed to meet market expectations, reminiscent of the underwhelming debut of Bakkt.  This sheds light on a seemingly &#8220;non-existent&#8221; demand for additional crypto exposure, indicating a continuation of the current consolidation range in the market. Related Reading: Bitcoin And Gold Poised For Growth Amidst US Fiscal Troubles, Top Macro Investor Says In defense of the lackluster ETF launch, it is worth noting that activity in crypto ETFs has been consistently shallow in recent months. BITO, for example, has witnessed consistent outflows since mid-July and experienced its third-lowest average daily volume (ADV) in September 2023, surpassed only by volumes in August and December 2022. The Ethereum futures products launched on Monday, along with their respective net expense ratios, include: BitWise Ethereum Strategy ETF (AETH) &#8211; 0.85% Bitwise Bitcoin and Ether Equal Weight Strategy ETF (BTOP) &#8211; 0.85% ProShares Ether Strategy ETF (EETH) &#8211; 0.95% ProShares Bitcoin &#38; Ether Equal Weight Strategy ETF (BETE) &#8211; 0.95% Bitcoin &#38; Ether Market Cap Weight Strategy ETF (BETH) &#8211; 0.95% VanEck Ethereum Strategy ETF (EFUT) &#8211; 0.66%. The disappointing debut of futures-based ETH ETFs underscores the challenges in generating substantial investor interest in crypto ETFs. As the crypto market continues to evolve, market participants will closely monitor developments and assess the impact on investor sentiment and the future of crypto ETFs. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-03T19:45:00.000Z",
    "title": "Coinbase Legal Chief Previews Key Aspects of Commencing SBF Trial",
    "url": "https://coinedition.com/coinbase-legal-chief-previews-key-aspects-of-commencing-sbf-trial/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase’s-just-filed-amicus-brief\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent tweet, Coinbase&#8217;s Chief Legal Officer, Paul Grewal, offered insights into the upcoming trial against Sam Bankman-Fried (SBF), founder of the bankrupt FTX exchange. SBF’s trial commences within the next 24 hours, with U.S. Federal Judge Lewis Kaplan presiding over the case. Drawing from his extensive experience of selecting juries in federal civil [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-legal-chief-previews-key-aspects-of-commencing-sbf-trial/\">Coinbase Legal Chief Previews Key Aspects of Commencing SBF Trial</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-03T20:00:35.000Z",
    "title": "Bitcoin Shark and Whales Gobble $1,170,000,000 in BTC in About a Month: Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/10/03/bitcoin-shark-and-whales-gobble-1170000000-in-btc-in-about-a-month-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-sharks-gobble-month.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Large Bitcoin (BTC) holders have been snapping up the top crypto asset since the beginning of September, according to the crypto analytics firm Santiment. Santiment notes that Bitcoin sharks and whales, or entities holding between 10-10,000 BTC, have accumulated a combined $1.17 billion since September 1st. The firm says that the accumulation pattern makes it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/03/bitcoin-shark-and-whales-gobble-1170000000-in-btc-in-about-a-month-analytics-firm-santiment/\">Bitcoin Shark and Whales Gobble $1,170,000,000 in BTC in About a Month: Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-03T19:55:32.000Z",
    "title": "Trader Warns Bitcoin Reversal Likely Based on Historical Precedent, Updates Outlook on Chainlink",
    "url": "https://dailyhodl.com/2023/10/03/trader-warns-bitcoin-reversal-likely-based-on-historical-precedent-updates-outlook-on-chainlink/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Rocket-Move-for-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says Bitcoin (BTC) may be on the verge of a final leg to the downside. Crypto trader Rekt Capital tells his 355,900 followers on the social media platform X that BTC is about to test its bull market support band. &#8220;Bitcoin is now trying to retest the bull market support band as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/03/trader-warns-bitcoin-reversal-likely-based-on-historical-precedent-updates-outlook-on-chainlink/\">Trader Warns Bitcoin Reversal Likely Based on Historical Precedent, Updates Outlook on Chainlink</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]