[
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T08:47:11.000Z",
    "title": "UK to expand crypto crime agency, hiring spree underway",
    "url": "https://cointelegraph.com/news/uk-crypto-crime-agency-team-job-hiring",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8c68a47c-42f8-434a-87be-852f7999692c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The job involves investigating crypto fraud, money laundering and other blockchain-based crime performed by organized groups.</p>\n                    <p><p>The United Kingdom's National Crime Agency (NCA) wants to expand its digital assets investigation team by hiring four senior investigators for its Complex Financial Crime Team (CFCT) that will work on crypto-related crimes. </p><p>The position involves investigating high-end crypto fraud, money laundering and other blockchain-based crime carried out by organized crime groups. The investigators will be working with a surveillance team and will work with London Police. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8e42c76f-526a-421f-8d2a-3097c625d09c.png\"  /><figcaption style=\"text-align: center;\"><em>Job posting for digital assets investigators. Source: National Crime Agency</em></figcaption></figure><p>The role requires working and collaborating with other investigators, intelligence and analysis team members to develop complex cases using data and evidence from various sources. </p><p>The position requires a current or active Professionalising Investigation Programme Level 2 (PIP2) accreditation or any equivalent qualification on investigative crime that a government agency issued. The job pays a salary of £34,672 to £38,314 ($44,145 to $48,782.92) and other civil service benefits. </p><p>The United Kingdom has been working to establish an investigative team focusing on illicit crypto activities. On Jan. 4, the NCA <a href=\"https://cointelegraph.com/news/uk-looks-for-a-crypto-crime-fighter-with-a-50k-salary\">launched its digital assets team</a>, signaling an increased focus on crypto assets. The formation of the unit was driven by an increase in value lost to crypto fraud in the UK in 2022. According to the UK's reporting system for cybercrime and fraud, crypto scammers <a href=\"https://www.fnlondon.com/articles/crypto-crime-uk-nca-job-anti-money-laundering-national-crime-agency-digital-fraud-20230104\" target=\"_blank\" rel=\"noopener nofollow\">stole</a> at least $287 million in 2022. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-us-department-of-justice-to-double-its-crypto-team\"><strong><em>US Justice Department to double its crypto team, target ransomware crimes</em></strong></a></p><p>The NCA has been continuously trying to bring more manpower to its crypto team. On July 26, the NCA also posted that it was <a href=\"https://cointelegraph.com/news/uk-crime-agency-to-hire-crypto-blockchain-investigators\">looking for financial investigations managers</a>. These investigators will oversee crypto and digital assets crime investigations from a Proceeds of Crime Act (POCA) perspective, which is related to confiscating and redirecting crime money for the benefit of the community. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-07T09:03:12.000Z",
    "title": "Huobi insolvency rumors as USDT reserves decline on all exchanges except Binance",
    "url": "https://cryptoslate.com/huobi-insolvency-rumors-as-usdt-reserves-decline-on-all-exchanges-except-binance/",
    "description": "<p>Claims about crypto exchange Huobi&#8217;s financial health and its executives&#8217; legal entanglements have fueled market speculation over the weekend. Huobi has been witnessing continued outflows from its total locked-up value (TVL), dropping to $2.4 billion from a level of $3 billion in July. As reported by FX168 Financial News, there have now been rumors that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/huobi-insolvency-rumors-as-usdt-reserves-decline-on-all-exchanges-except-binance/\">Huobi insolvency rumors as USDT reserves decline on all exchanges except Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T08:55:00.000Z",
    "title": "OPNX Launches Bid To Acquire 75% Of Crypto Lender Hodlnaut",
    "url": "https://cryptodaily.co.uk/2023/08/opnx-launches-bid-to-acquire-75-of-crypto-lender-hodlnaut",
    "description": "<p>OPNX, the newly launched crypto exchange by founders of the now-defunct Three Arrows Capital (3AC), has reportedly launched a bid to take over struggling crypto lender Hodlnaut.</p>\n<p>If the bid is approved, the deal could see an injection of around $30 million worth of FLEX tokens into Hodlnaut.&nbsp;</p>\nA White Knight Investor For Hodlnaut?&nbsp;\n<p>According to a report in Bloomberg, the OPNX exchange has made an offer to acquire 75% of the struggling crypto lender. The bid comes at a critical time for Hodlnaut, which is undergoing a restructuring plan under the supervision of a Singapore court. The deal would see a significant capital injection into Hodlnaut and would partially cover outstanding claims and creditor payouts. If the deal is approved, creditors will receive 30% of their claims in FLEX tokens and other cryptocurrencies. This offer also gives them a direct stake in the future potential of the entity being acquired.&nbsp;</p>\n<p>Alternatively, creditors also have the choice of opting for a pro-rata payment, allowing them to recover about 95% of the available corporate asset pool. According to OPNX, this option prioritizes the immediate financial recovery and stability of creditors. However, the bid is subject to approval from Hodlnaut&rsquo;s creditors, who effectively hold the fate of the acquisition in their hands. The creditors&rsquo; decisions could also have a significant impact on the larger crypto-lending ecosystem.&nbsp;</p>\nUnclear If Deal Goes Through&nbsp;\n<p>So far, it remains to be seen if Hodlnaut&rsquo;s creditors will accept the deal. Back in April, a significant majority of the struggling crypto lender&rsquo;s creditors indicated their desire to liquidate the company. In a letter from the interim judicial manager (IJM), users representing 55.38% of creditors having claims of around 228.3 million Singaporean dollars ($170 million) have indicated that they prefer liquidation rather than restructuring. However, at the time, there was no source of fresh capital for the company.&nbsp;</p>\n\n<p>&ldquo;There appears to be no indication of a white knight investor to date, and hence no prospect of any fresh capital injection.&rdquo;</p>\n\n<p>Meanwhile, only users with around 2.42% of claims supported looking into the restructuring option. However, all of these claims belonged to company directors. A mediation proposal was also opposed by the major creditors of the company, including Samtrade Custodian and SAM Fintech, and the Algorand Foundation. Algorand has a $35 million exposure to Hodlnaut.&nbsp;</p>\nThe Hodlnaut Fiasco&nbsp;\n<p>Hodlnaut halted all withdrawals in August 2022, as the turmoil in the crypto markets led to a significant liquidity crisis for the crypto lender. Eventually, the company entered into judicial management, temporarily protecting it against legal action. Following this, the company entered into a court-based restructuring process, shedding light on the extent of its financial difficulties. The company had stated at the time,&nbsp;</p>\n\n<p>&ldquo;We are aiming to avoid a forced liquidation of our assets as it [&hellip;] will require us to sell our users&rsquo; cryptocurrencies such as BTC, ETH, and WBTC at these current depressed asset prices.&rdquo;</p>\n\n<p>With Hodlnaut struggling with the complexities of financial rehabilitation and creditor interests, founders Zhu Juntao and Simon Lee proposed selling the business as an alternative to liquidation, arguing it would result in a more favorable outcome for creditors. Furthermore, regulatory concerns have also compounded troubles, with figures associated with Hodlnaut and OPNX facing reprimands in Dubai for operating OPNX without the necessary local licenses.&nbsp;</p>\nThe OPNX Exchange And Its 3AC Connection\n<p>The FLEX token is the native token of the CoinFLEX exchange, founded by Sudhu Arumugam and Mark Lamb. Arumugam and Lamb are also the co-founders of OPNX, a crypto claims trading marketplace. Other co-founders of OPNX include Kyle Davies and Su Zhu, who founded the now-bankrupt crypto hedge fund Three Arrows Capital. Creditors are pursuing both Zhu and Davies in the US over bankruptcy proceedings.&nbsp;</p>\n<p>The legal team representing creditors filed a motion urging that Davies be held in contempt of court for wilfully ignoring a subpoena connected to the firm&rsquo;s bankruptcy proceedings. Creditors have alleged that Davies is purposely delaying asset recovery. However, the motion does not apply to co-founder Su Zhu, who, thanks to his Singaporean nationality, is not subject to the jurisdiction of US courts.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T08:45:00.000Z",
    "title": "WAGMI Hires Top Web2 Gaming Talents To Bring Web3 To The Masses",
    "url": "https://cryptodaily.co.uk/2023/08/wagmi-hires-top-web2-gaming-talents-to-bring-web3-to-the-masses",
    "description": "<p>Web3 video games franchise WAGMI Games has announced a couple of new executive hires, enhancing its dynamic team with experienced talent from some of the biggest names in the gaming industry.&nbsp;</p>\n<p>The new hires include Esteban Gil, formerly of Garena Free Fire, and Brent Pease, who previously held a senior role at Electronic Arts, the legendary company behind the FIFA football franchise.&nbsp;</p>\n<p>WAGMI said it was delighted to be able to announce the new hires, who bring a wealth of expertise from established games developers to help transform the industry with the unique advantages of Web3.&nbsp;</p>\n<p>If you haven't heard of WAGMI, it&rsquo;s essentially a video games studio that&rsquo;s focused on Web3 gaming. In Web3 video games, players are uniquely able to own in-game assets such as characters, weapons and skins, which are represented by non-fungible tokens that can be bought and sold at will. Web3 gaming also provides unique incentives for players with in-game rewards such as WAGMI tokens which can be earned for completing daily challenges and beating other players in head-to-head matches.&nbsp;</p>\n<p>WAGMI&rsquo;s flagship title is WAGMI Defense, a sci-fi themed tower defense game in the mould of Plants vs. Zombies or Kingdom Rush Vengeance. Players are required to strategically place their troops and set their traps in order to defend their tower from the enemy onslaught. They need to stand up to the assault for three minutes per match, and with each round they win they&rsquo;ll earn an in-game resource called NiFe that can be used to buy other items or traded for cryptocurrency.&nbsp;</p>\n<p>Gil, who previously led Garena Free Fire and served as Lean Portfolio Management at Respawn and Apex Legends, is being hired to assume a similar role at WAGMI. In particular, he&rsquo;ll be tasked with overseeing the company&rsquo;s business strategy development, focused on driving demand for consumer-oriented products.&nbsp;</p>\n<p>In a statement, Gil said he&rsquo;s excited to apply his skills and experience to Web3, and stated his belief that technologies such as NFTs can revolutionize the gaming industry. &ldquo;By leveraging these cutting-edge technologies, we can deliver even more engaging and immersive gaming experiences to our fans around the world,&rdquo; he added.&nbsp;</p>\n<p>As for Pease, he joins the company from EA, where he most recently served as its Director of Operations. As a highly experienced industry executive, he will assume a combined COO/GM role at WAGMIU, where he&rsquo;ll be tasked with overseeing the company&rsquo;s day-to-day operations and focus on the implementation of key growth strategies. Pease is said to be a widely respected figure in the video gaming industry, having previously founded Industrial Toys, which was later acquired by EA.&nbsp;</p>\n\n<p>&ldquo;'I am honored to have been asked to bring my 30 years of experience in building games and companies to this incredible team of passionate creators,&rdquo; Pease said. &ldquo;This is the most exciting vision for players I have seen and I look forward to making amazing games at WAGMI that thrill our ever-growing community.&rdquo;</p>\n\n<p>There is certainly lots of room for WAGMI to grow. At present, Web3 games attract barely 3% of the estimated three billion video games players in the world. Yet WAGMI says the advantages of Web3 gaming are so compelling that if it&rsquo;s able to lower the barrier to entry by easing onboarding friction, this number will surely grow.&nbsp;</p>\n<p>Of course, is Web3 gaming is to really catch on, the industry will need to develop truly engaging games that can capture the imagination of millions of gamers, just as legendary titles from the Web2 gaming world, such as GTA and Fortnite, have done. This explains WAGMI&rsquo;s decision to go after talent with experience in the traditional video game industry.&nbsp;</p>\n\n<p>&ldquo;To have AAA Talent like Brent and Esteban join our team is a real testament to what we are building,&rdquo; said WAGMI&rsquo;s chief executive Ian Bentley. &ldquo;They see clearly not only our vision as a franchise, but also this once in a lifetime opportunity to be a part of history in evolving the gaming space.&rdquo;</p>\n\n<p>&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T08:53:40.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.117, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 2.45% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T09:05:02.000Z",
    "title": "PEPE’s Future: Will Prices Of Meme Coins Continue To Drop?",
    "url": "https://www.newsbtc.com/all/will-meme-coins-continue-to-drop/",
    "description": "In the realm of meme coins, PEPE&#8217;s Network Realized Profit/Loss (NPL) metric has emerged as a critical barometer, shedding light on price trends within the cryptocurrency landscape. This metric has now indicated a glimmer of a price floor for the frog-themed token that has been facing its fair share of challenges. As a result, a ray of positivity has dawned upon numerous investors who have been expecting a much-needed rebound, following a prolonged period of decline within the meme coins arena. However, a more meticulous analysis of the situation unveils a contrasting reality, suggesting that the token&#8217;s woes might be far from over. At first glance, the dip in PEPE&#8217;s NPL metric appeared to be an encouraging sign. Historically, a significant drop in this metric has often coincided with a price bottom in many cryptocurrencies.   PEPE NPL metric on the downward trend. Source: Santiment.  Related Reading: Shiba Inu: More Bite Than Bark Over The Weekend With Over 15% Jump PEPE’s Misleading NPL Dip Conceals Ongoing Selling Pressure The recent uptick in PEPE&#8217;s 24-hour performance, with a 1.7% rally, seemed to lend credence to this belief. Nevertheless, deeper scrutiny of on-chain data reveals a less optimistic picture. While the NPL suggested a potential price floor, the broader on-chain performance of PEPE contradicts this notion. The token has experienced consistent and sustained selling pressure. PEPE seven-day slump. Source: Coingecko Holders have continued to offload their tokens including meme coins, thwarting the possibility of a substantial price rebound. The 9.1% seven-day slump underscores the persistent challenges PEPE faces, casting doubt on the immediate potential for recovery. Insights From The Broader Crypto Market Struggle PEPE&#8217;s struggle is not occurring in isolation. The wider cryptocurrency market has been grappling with a plethora of challenges, including regulatory uncertainties, market sentiment shifts, and macroeconomic factors. The volatility that has become synonymous with the crypto landscape has impacted tokens across the spectrum, including well-established ones. This backdrop of uncertainty has resulted in heightened caution among investors. The fear of further price drops, according to a recent PEPE price analysis, prompts them to liquidate their holdings preemptively, even when metrics like NPL seem favorable. This collective behavior contributes to the sustained selling pressure observed in tokens like PEPE, despite signs that might hint at a price recovery. The market cap of cryptocurrencies reached $1.12 trillion today. Chart: TradingView.com PEPE And Meme Coins: The Road Ahead While the dip in PEPE&#8217;s NPL initially raised hopes of a price bottom, a meticulous analysis uncovers the underlying challenges that continue to suppress the token&#8217;s recovery. The on-chain data reflects a consistent trend of token holders selling, which overshadows the potential for an immediate price rebound. Moreover, the broader struggles of the crypto market further exacerbate the situation, making it crucial for investors to manage their expectations. Related Reading: Bone ShibaSwap Among Weekend 100 Biggest Hitters With 25% Rally While metrics like NPL provide insights, they must be viewed within the larger context of market dynamics. Only by taking a holistic approach and considering multiple factors can investors make informed decisions that mitigate risks and capitalize on opportunities in this highly volatile environment. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Earth.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T09:05:09.000Z",
    "title": "Base L2 Attracts Millions in ETH Ahead of Launch, InQubeta Top Performing ICO for 2023",
    "url": "https://www.crypto-news-flash.com/base-l2-attracts-millions-in-eth-ahead-of-launch-inqubeta-top-performing-ico-for-2023/?utm_source=rss&utm_medium=rss&utm_campaign=base-l2-attracts-millions-in-eth-ahead-of-launch-inqubeta-top-performing-ico-for-2023",
    "description": "<img width=\"512\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T093331.848.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T093331.848.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T093331.848-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T093331.848-150x150.jpg 150w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The year 2023 has brought remarkable developments in the crypto and blockchain spaces. Two projects that stand out for their significant achievements include Base L2 and InQubeta. Base L2 is a Coinbase-backed layer-2 blockchain, with Coinbase being one of the leading centralized exchanges in the world. In preparation for Base L2’s launch, about $68 million [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T08:58:40.000Z",
    "title": "Chainlink Gaining Momentum as CCIP Testnet Activity Surges – Can LINK Revisit its ATH?",
    "url": "https://www.crypto-news-flash.com/chainlink-gaining-momentum-as-ccip-testnet-activity-surges-can-link-revisit-its-ath/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-gaining-momentum-as-ccip-testnet-activity-surges-can-link-revisit-its-ath",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink celebrates the first anniversary of Chainlink Economics 2.0.\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Chainlink&#8217;s CCIP Testnet activity is on the rise, sparking interest in LINK&#8217;s potential recovery. LINK, Chainlink&#8217;s native token, is showing an upward trend, trading at $7.133 on Binance, prompting speculation about reaching its all-time high. The Chainlink ecosystem is abuzz with increased activity on its Cross Chain Interoperability Protocol (CCIP) testnet. This heightened level of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-07T09:05:55.000Z",
    "title": "Why are Starbucks NFTs Successful?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-are-starbucks-nfts-successful/",
    "description": "<p>Non-fungible tokens were at the center of the 2021 bull market. During that time, we saw lots of top brands, such as Gucci, embrace Web 3. However, things paused in 2022 thanks to the bear markets. Statistics show that NFT sales decreased by 83% in 2022 compared to the previous year. Interestingly, Starbucks entered the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-are-starbucks-nfts-successful/\">Why are Starbucks NFTs Successful?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T08:58:00.000Z",
    "title": "Alchemix’s Stolen Funds Returned by Curve Finance Hacker",
    "url": "https://coinedition.com/alchemixs-stolen-funds-returned-by-curve-finance-hacker/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/We_are_extremely_happy_to_announce_that_all_funds_stolen_by_the-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Alchemix announced on Twitter that all of its funds stolen in the recent Curve Finance pool hack have now been returned. On July 31, Curve shared that a number of stablepools (alETH, msETH, and pETH) were exploited as a result of a malfunctioning re-entrancy lock. Curve lost 50% of its TVL and more than $62 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/alchemixs-stolen-funds-returned-by-curve-finance-hacker/\">Alchemix’s Stolen Funds Returned by Curve Finance Hacker</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T08:45:26.000Z",
    "title": "Is This Famous Token the Next LUNA? Crypto Influencer Weighs In",
    "url": "https://coinedition.com/is-this-famous-token-the-next-luna-crypto-influencer-weighs-in/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto influencer Jordi Alexander believes that Worldcoin may become the next LUNA. Alexander, who also serves as the chief alchemist of the Mantle Network, expressed concerns about the crypto economics surrounding Worldcoin in addition to its controversial real-world activities, including biometric data collection through retina scans. Alexander recently appeared in an interview with Crypto Banter [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-this-famous-token-the-next-luna-crypto-influencer-weighs-in/\">Is This Famous Token the Next LUNA? Crypto Influencer Weighs In</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]