[
  {
    "source": "Decrypt",
    "date": "2024-01-09T21:00:54.000Z",
    "title": "Trillions of 'Notcoin' Farmed in Telegram Meme Coin Game—But There's a Catch",
    "url": "https://decrypt.co/212154/trillions-notcoin-farmed-telegram-meme-coin-game-but-theres-catch",
    "description": "Telegram's Notcoin clicker game looks like a gateway to free crypto. However, the meme coin isn't real yet—but an airdrop could be coming."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:06:46.000Z",
    "title": " Bitcoin Ordinals proponents should demand a new Bitcoin fork ",
    "url": "https://cointelegraph.com/news/bitcoin-ordinals-demand-new-bitcoin-fork",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjk3OTZlZjAtMTljMS00MzMyLTk1MjMtYTkzZGRjYjE2NTYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Bitcoin Core v27 update is aiming to eject Ordinals from the Bitcoin blockchain. Proponents of the phenomenon should fork to their own chain.</p>\n                    <p><p>Bitcoin Ordinals burst onto the scene in 2023 essentially as <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> on the Bitcoin blockchain. The ensuing Bitcoin Ordinal debate resulted in a considerable fissure in the Bitcoin community, which has been relatively united since the great <a href=\"https://cointelegraph.com/news/the-bigger-the-better-64-of-bitcoin-users-vote-for-block-size-increase\">Bitcoin block size debate</a> of 2016.</p><p>Rather than risk splintering the Bitcoin Community into factions just as massive Wall Street firms gear up to issue Bitcoin ETFs, Bitcoin Ordinal supporters might consider a hard fork of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) similar to Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) and Bitcoin SV (<a href=\"https://cointelegraph.com/bsv-price-index\">BSV</a>) so as to keep their NFT on-chain dream alive without the risk of their collectibles being nullified by Bitcoin core developers. </p><p>Hard forks occur when a blockchain splits into two. The original fork continues on as the pre-existing protocol and ledger. In this case, there would be no Ordinals moving forward on the original chain. The new fork changes the protocol in some way–such as an increase in block size–and then rolls it out as a coin oftentimes proclaiming to be the real Bitcoin as Satoshi Nakamoto envisioned. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-demand-new-bitcoin-fork\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T20:47:20.000Z",
    "title": " Spot Bitcoin ETF incoming? Outcomes investors may see from the SEC this week ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-incoming-outcomes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNGYwOGMxOTQtNDVhMy00MWUzLWE5NjEtMmM1YjY1Njg5NTQ3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>All approved, all denied, or somewhere in between based on the applications from asset managers? Nothing is set in stone with the SEC when it comes to spot Bitcoin ETFs.</p>\n                    <p><p>Many are expecting the United States Securities and Exchange Commission (SEC) to approve listing shares of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund on exchanges for the first time by Jan. 10. Even if the regulator should move forward with a decision to approve, there are many possibilities to what approval may look like.</p><p>Despite all positive signs pointing to approval, at the time of publication, there is no absolute guarantee that the SEC will still decide to give the green light to a spot Bitcoin ETF. Several asset managers completed some of the last stages of paperwork in <a href=\"https://cointelegraph.com/news/sec-closer-spot-bitcoin-etf-approval\">filing form 19b-4 amendments</a> on Jan. 5 and amended form S-1 filings on Jan. 8.</p><p>Historically, the SEC has never approved a spot cryptocurrency exchange-traded product for U.S. exchanges, and only in 2021 started to allow ETFs with exposure to crypto futures. An October court ruling forced the commission to revisit a spot Bitcoin ETF application from Grayscale Investments, but this would presumably still allow the SEC to deny an investment vehicle for different reasons. </p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-incoming-outcomes\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T21:00:33.000Z",
    "title": "CFTC says DeFi poses ‘serious risks’ due to lack of accountability",
    "url": "https://cryptoslate.com/cftc-says-defi-poses-serious-risks-due-to-lack-of-accountability/",
    "description": "<p>A new report released by the CFTC&#8217;s Digital Assets and Blockchain Technology Subcommittee has released a comprehensive report — &#8220;Decentralized Finance&#8221; — outlining the risks inherent in the burgeoning field of Decentralized Finance (DeFi). Spearheaded by CFTC Commissioner Christy Goldsmith Romero, the report raises critical concerns about the lack of clear responsibility and accountability within [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cftc-says-defi-poses-serious-risks-due-to-lack-of-accountability/\">CFTC says DeFi poses ‘serious risks’ due to lack of accountability</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-09T21:02:00.000Z",
    "title": "Global Economy to Decelerate for Third Year in a Row, but Avoid Recession: World Bank",
    "url": "https://www.cryptoglobe.com/latest/2024/01/global-economy-to-decelerate-for-third-year-in-a-row-but-avoid-recession-world-bank/",
    "description": "The World Bank’s new forecast for global economic growth predicts a deceleration for a third consecutive year in 2024, but it optimistically rules out a recession as it sees the global growth rate dipping to 2.4% from an estimated 2.6% last year. As first reported by Yahoo Finance, the World Bank’s latest Global Economic Prospects […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-09T21:00:55.000Z",
    "title": "‘Extreme Greed’ — Bitcoin’s Price Rise Leads to Highest Fear and Greed Index Level Since 2021",
    "url": "https://news.bitcoin.com/extreme-greed-bitcoins-price-rise-leads-to-highest-fear-and-greed-index-level-since-2021/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"&#039;Extreme Greed&#039; — Bitcoin&#039;s Price Rise Leads to Highest Fear and Greed Index Level Since 2021\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/extremegreed.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Hovering just below the $47K mark, bitcoin&#x2019;s price rise has coincided with the Crypto Fear and Greed Index (CFGI) reaching a notable 76 on Jan. 9, 2024. This signals a phase of &#x201C;extreme greed,&#x201D; a sentiment intensity not witnessed since the cryptocurrency&#x2019;s previous bull run in November 2021. Soaring Bitcoin Drives Greed Index to New [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T21:00:13.000Z",
    "title": "Solana Foundation reports remarkable growth in developer retention in 2023",
    "url": "https://www.cryptopolitan.com/solana-foundation-growth-developer-retention/",
    "description": "The Solana Foundation recently released a report highlighting a significant rise in developer retention within its ecosystem. Throughout 2023, the retention rate of developers surged from 31% to over 50%. This growth is attributed to enhanced onboarding processes and expanding opportunities within the ecosystem. The assessment of this growth used a metric based on developers [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T21:00:53.000Z",
    "title": "Bitcoin Social Dominance Soars As Spot ETF Approval Nears: Santiment",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-social-dominance-soars-as-spot-etf-approval-nears-santiment/",
    "description": "The crypto community is buzzing about the US Securities and Exchange Commission (SEC) approving spot Bitcoin Exchange-Traded Funds (ETFs). This anticipation has permeated market discussions and significantly influenced social media metrics around Bitcoin. According to Santiment, a leading on-chain analytics platform, there has been a notable increase in Bitcoin&#8217;s social dominance in recent times, particularly in short-term periods. Related Reading: Bitcoin Enters Uncharted Territory with First Ever Golden Cross Bitcoin Social Dominance Surge And Market Response Santiment’s data reveals a spike in Bitcoin ETF-related conversations since mid-October, marking the highest level of social interest since the bullish rally. The top eight trending topics in these discussions include ETF, BTC, week, approval, BTC ETF, Monday, spot, and Gary, signifying the community&#8217;s focus on the potential ETF approval. 📈 The potential #BitcoinETF approval is seemingly on all of the #crypto community&#8217;s mind as $BTC has surged above $46.1K for the first time since April, 2022. Wide expectations presume several #ETF applications will be approved simultaneously, which would immediately (Cont) 👇 pic.twitter.com/60fc77UUp8 — Santiment (@santimentfeed) January 8, 2024 This trend is not just a reflection of growing investor interest but also points to the impact of social sentiment on market dynamics. As conversations around Bitcoin ETFs dominate social platforms, they highlight the significant role of community expectations and speculative discussions in shaping market trends. Amid this heightened social chatter, Bitcoin&#8217;s market performance has mirrored the optimistic sentiment. Yesterday, the flagship crypto surged past the $47,000 mark, a notable achievement since April 2022. Although there has been a slight retracement, with Bitcoin currently trading around $46,721, the asset maintains a 3.8% increase over the past day. ETF Approval Anticipation: Analysts Offer Perspectives On SEC&#8217;s Swift Response Notably, Bitcoin&#8217;s rally underscores the market’s responsiveness to the spot ETF buzz and the potential impact of the anticipated approval. So far, experts in the field have been closely monitoring these developments, offering their insights into the unfolding scenario. One significant observation comes from James Seyffart, an ETF sector analyst, who offers an alternative view to the speculation of an approval delay by the US SEC. Seyffart acknowledges the SEC&#8217;s recent comments on the S-1 filings of aspiring issuers, particularly regarding fee structures. However, he interprets these developments not as signs of postponement but as indications of the SEC&#8217;s readiness to progress. 1. This is true, comments came back on those S-1 documents with the fees that we all went crazy over this morning (this isn&#8217;t out of ordinary) 2. Expect to see more amendments tomorrow because of this 3. That said &#8212; I don&#8217;t think this is necessarily a delay signal https://t.co/o2m0lIBSct — James Seyffart (@JSeyff) January 9, 2024 The promptness in the SEC&#8217;s feedback, Seyffart notes, is unusual for the agency and suggests an eagerness to advance the approval process. Echoing Seyffart&#8217;s opinion, ETF specialist Scott Johnsson remarked on the unusual swiftness of the SEC&#8217;s recent feedback. Related Reading: Jim Cramer Says Bitcoin Is Topping Off, Time To Buy Bitcoin? Johnsson remembered how past ETF approvals, such as the futures-based ones in 2022, did not require fully completed S-1 forms for 19b-4 approval. Johnsson suggests that the current swift response from the US SEC likely indicates a deliberate effort to accelerate the approval and introduction of spot Bitcoin ETFs. Yes, it’s unheard of. And to remind everyone, S-1s do not NEED to be complete when 19b-4s are approved. Take futures ETFs in 2022. Hashdex didn’t even get initial comments until after its 19b-4 was approved. More than anything, these quick comments demonstrate SEC working to push… https://t.co/SjIUIHxQD4 — Scott Johnsson (@SGJohnsson) January 9, 2024 This perspective offers a ray of hope to the crypto community, eagerly awaiting a favorable decision that could significantly impact the market and solidify Bitcoin’s position in the broader financial landscape. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-09T21:00:34.000Z",
    "title": "NFTs, Memecoins and Six Other Topics To Drive Crypto Markets in 2024, According to Analytics Firm",
    "url": "https://dailyhodl.com/2024/01/09/nfts-memecoins-and-six-other-topics-to-drive-crypto-markets-in-2024-according-to-analytics-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/nfts-six-other-topics.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analytics platform Santiment is listing the major narratives that are likely to prevail in the crypto space this year. Starting with non-fungible tokens (NFTs) and memecoins, Santiment says that the two crypto sub-sectors are &#8220;always primed for a sudden surge of interest.&#8221; As an example, Santiment says that the rise in interest in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/09/nfts-memecoins-and-six-other-topics-to-drive-crypto-markets-in-2024-according-to-analytics-firm/\">NFTs, Memecoins and Six Other Topics To Drive Crypto Markets in 2024, According to Analytics Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-09T20:55:04.000Z",
    "title": "Chainlink Facing Make-or-Break Moment As LINK Nears Bearish Setup, According to Crypto Trader",
    "url": "https://dailyhodl.com/2024/01/09/chainlink-facing-make-or-break-moment-as-link-nears-bearish-setup-according-to-crypto-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/05/chainlink-earnings.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is saying that one Ethereum-based (ETH) altcoin is dangerously close to flipping bearish. Pseudonymous crypto strategist Rekt Capital tells his 385,900 followers on the social media platform X that decentralized oracle provider Chainlink (LINK) has to hold a key support level of around $13.57 to remain in an uptrend. “Chainlink [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/09/chainlink-facing-make-or-break-moment-as-link-nears-bearish-setup-according-to-crypto-trader/\">Chainlink Facing Make-or-Break Moment As LINK Nears Bearish Setup, According to Crypto Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]