[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T15:04:35.000Z",
    "title": "Microsoft President Calls for Comprehensive AI Regulation Amid Sci-Fi Concerns",
    "url": "https://www.cryptopolitan.com/microsoft-president-calls-for-ai-regulation/",
    "description": "In a pivotal moment for the tech industry, Brad Smith, President and Vice Chairman of Microsoft, has urged the global community to develop a robust &#8220;regulatory blueprint&#8221; to ensure that artificial intelligence (AI) remains securely under human control. Speaking at the high-profile B20 Summit India 2023, Smith emphasized the pressing need for &#8220;real clarity&#8221; on ... <a title=\"Microsoft President Calls for Comprehensive AI Regulation Amid Sci-Fi Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-president-calls-for-ai-regulation/\" aria-label=\"More on Microsoft President Calls for Comprehensive AI Regulation Amid Sci-Fi Concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T14:58:12.000Z",
    "title": "Alibaba Unveils Advanced AI Models For Image Understanding and Complex Conversations",
    "url": "https://www.cryptopolitan.com/alibaba-unveils-advanced-ai-models-for-image/",
    "description": "Alibaba, the Chinese tech powerhouse, has introduced two cutting-edge artificial intelligence models, Qwen-VL and Qwen-VL-Chat, boasting remarkable capabilities in comprehending images and engaging in intricate conversations. These models mark a significant leap forward in the global race for AI supremacy and are poised to reshape various industries with their unprecedented features. Enhanced image interpretation and ... <a title=\"Alibaba Unveils Advanced AI Models For Image Understanding and Complex Conversations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alibaba-unveils-advanced-ai-models-for-image/\" aria-label=\"More on Alibaba Unveils Advanced AI Models For Image Understanding and Complex Conversations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T14:49:34.000Z",
    "title": "Protolabs Collaborates with Small Robot Company to Advance Agricultural Robotics",
    "url": "https://www.cryptopolitan.com/protolabs-collaborates-small-robot-robotics/",
    "description": "The Small Robot Company is at the forefront of a revolution in agriculture, offering autonomous precision agri-robots to solve the pressing challenge set by the UN: produce 70% more food by 2050 without expanding agricultural land or harming ecosystems. Departing from traditional methods involving tractors and heavy machinery, the company&#8217;s innovative approach leverages existing technology ... <a title=\"Protolabs Collaborates with Small Robot Company to Advance Agricultural Robotics\" class=\"read-more\" href=\"https://www.cryptopolitan.com/protolabs-collaborates-small-robot-robotics/\" aria-label=\"More on Protolabs Collaborates with Small Robot Company to Advance Agricultural Robotics\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-25T14:54:17.000Z",
    "title": "Meet the whales: Bitcoin’s biggest holders and their market influence",
    "url": "https://crypto.news/meet-the-whales-bitcoins-biggest-holders-and-their-market-influence/",
    "description": "Despite cryptocurrency&#8217;s decentralized ideals, a select few hold vast amounts of Bitcoin, wielding outsized influence. Who owns the most Bitcoin, and how do these whales sway the market? It has been 15 years since the invention of Bitcoin (BTC), the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T15:00:24.000Z",
    "title": "PEPE Token Tumbles 20% Amid Suspicious Activity – Details",
    "url": "https://www.newsbtc.com/news/pepe-token-tumbles-20-amid-suspicious-activity-details/",
    "description": "PEPE, the once-promising meme coin that garnered attention in the past quarter, suffered an unforeseen blow on Thursday as it succumbed to the grip of FUD (fear, uncertainty, and doubt). Despite making waves in recent months, PEPE&#8217;s momentum fizzled out by August, exacerbated by a wave of negative sentiment that battered the altcoin. The current price of PEPE stands at a mere $0.000000870194 according to CoinGecko, sustaining a 21% slump in the last 24 hours alone. Over the span of seven days, the meme coin incurred losses of 15.3%, signaling a distressing trend for its holders. PEPE price action today. Source: Coingecko Multisig Wallet Changes Fuel PEPE Rug Pull Allegations The root of this downturn traces back to recent alterations in PEPE&#8217;s multisig wallet, coupled with newfound token transfers that ignited a prevailing fear of a potential &#8220;rug pull&#8221; orchestrated by the project&#8217;s developers.  On August 24, nearly $16 million worth of Pepe tokens were transferred from the developers&#8217; multisig wallet to various crypto exchanges, sending shockwaves throughout the community. 1/4 1 hour ago, the Pepe multisig wallet, changed the amount of signatures required on their multisig from a 5/8 to 2/8. This comes after sending $15.7 million worth of $PEPE to exchanges. A breakdown of what we know: pic.twitter.com/bxBxp6Nzqz — ASXN (@asxn_r) August 24, 2023 The tokens flowed out of the PEPE multisig wallet, directed towards addresses affiliated with notable platforms such as Binance, OXK, and Bybit.  What further exacerbated concerns was the transformation in the transaction approval process within the vault-like wallet. Previously requiring consensus from five out of eight wallets, it had inexplicably shifted to a meager two out of eight. Any reason why the PEPE multisig wallet changed the threshold to just 2/8 signatures? Seems weird, this isn&#8217;t standard right? Also, seems that some has been sent to exchanges pic.twitter.com/1DVZIOvef8 — CryptoNoddy (@Crypto_Noddy) August 24, 2023 This unprecedented maneuver marked the first instance in which the project&#8217;s crucial multisig, responsible for safeguarding a significant portion of the token&#8217;s supply, executed such an outward transfer. Investor Reactions And Realized Losses While the authenticity of the allegations remains unverified, investors swiftly leaped to conclusions, suspecting the development team of orchestrating a scam for personal gain. Contrary to this sentiment, closer analysis suggests that had foul play been intended, the transfer&#8217;s magnitude would have been substantially larger. PEPEUSD trading at $0.000001 on the daily chart: Gemini/TradingView.com Nevertheless, the panic-induced sell-off rapidly gained traction, precipitating an abrupt nosedive in PEPE&#8217;s price and fostering an environment dominated by fear. On a broader scale, the network experienced a surge in Realized Losses, reaching a three-month peak and registering the third-highest single-day losses since the token&#8217;s inception. Ultimately, investor losses tallied a staggering $14 million. Related Reading: Tron Reverses August Slump As TRX Open Interest Climbs The rollercoaster journey of the PEPE meme coin, from soaring highs to a precipitous fall, underscores the impact of FUD within the volatile cryptocurrency landscape. While the true intentions behind the wallet changes and token transfers remain shrouded in uncertainty, the incident serves as a stark reminder of the fragility inherent in meme-based tokens. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Blockcast"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T14:45:11.000Z",
    "title": "Bitcoin Price Prediction for 2023, 2024, 2025, 2030 and Beyond",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-prediction-for-2023-2024-2025-2030-and-beyond/",
    "description": "Bitcoin has come a long way since its inception in 2009. From being worth less than a penny initially, it has seen massive growth over the years with some dramatic ups and downs. Today, Bitcoin is emerging as a major alternative asset class and its future valuation prospects remain optimistic. This comprehensive guide takes a data-driven approach to analyze factors affecting Bitcoin prices and makes educated projections about its potential highs and lows in the short, medium and long-term timeframes. With cryptocurrencies gaining mainstream traction, the report aims to provide clarity to investors on what lies ahead for Bitcoin prices based on historical patterns and developments.  What is Bitcoin (BTC)? Bitcoin is the first and most popular cryptocurrency in the world. It was created in 2009 by the pseudonymous Satoshi Nakamoto, who published the Bitcoin whitepaper and developed the Bitcoin protocol. Bitcoin introduced blockchain technology to the world. The Bitcoin blockchain is a public ledger that records all Bitcoin transactions ever made. It is decentralized, meaning no single entity controls it. The blockchain is maintained by a global network of computers known as Bitcoin miners. Key attributes of Bitcoin include: Decentralized No central authority controls Bitcoin. It is maintained by a distributed network of users. Limited supply Only 21 million Bitcoins will ever exist. This scarcity gives Bitcoin value. Pseudonymous Bitcoin addresses are not linked to real-world identities by default, giving users privacy. Secure Bitcoin uses cryptography and the blockchain to ensure the security of payments and ownership records. Divisible One Bitcoin can be divided into 100 million smaller units called satoshis, allowing small transactions. Permissionless Anyone can use Bitcoin without the need for permission from authorities. These attributes make Bitcoin unique compared to traditional fiat currencies and a promising digital asset for investment. Factors Influencing Bitcoin Price Many factors can affect the price of Bitcoin, leading to volatility. Some major factors include: Supply and Demand Basic economic theory states that when demand increases while supply remains constant, price goes up. As more investors and institutions adopt Bitcoin, demand rises. But since new Bitcoins are mined at a fixed rate, supply remains steady, driving prices up. Media Hype and Public Sentiment Positive or negative media coverage and public sentiment can influence demand and price. For example, Elon Musk&#8217;s tweets on Bitcoin often lead to price swings based on his views. Major Protocol Changes and Upgrades Major Bitcoin developments like the SegWit upgrade or Lightning Network adoption can improve Bitcoin&#8217;s capabilities and affect price. Regulations and Legal Status Regulatory crackdowns or acceptance of Bitcoin in different countries impacts price as it affects demand. Whales and Institutional Investors &#8220;Whales&#8221; &#8211; entities holding large amounts of Bitcoin &#8211; can manipulate prices when they buy or sell. Increased institutional investment also drives up prices through increased demand. Security Breaches and Scandals Security issues with exchanges and wallets like the Mt.Gox hack or malicious business practices like the FTX collapse can erode investor confidence and depress prices. Macroeconomic Conditions Economic instability and currency devaluations motivate investors to buy Bitcoin as a hedge, boosting its price. However, it has struggled in a hawkish Fed environment and amidst rate hikes. Bitcoin Price Performance in the Past Looking at past price performance can provide insights into long-term trends and help predict future prices. Let’s take a walk down BTC memory lane. The Early Days &#8211; Volatility and Growth (2009-2013) When Bitcoin launched in 2009, it was practically worthless. In 2010, Bitcoin went from $0 to $0.39 and was extremely volatile in its early days. By early 2011, it achieved parity with the US dollar, hitting $1.00 in February 2011. In the same year, it reached $10 and then $30. This early volatility was attributed to insufficient liquidity, scarcity due to the low Bitcoin supply, and lack of exchange infrastructure. In mid-2011, Bitcoin fell from around $30 to $2 after a series of exchange hacks and thefts shook investor confidence. It took over a year to reach $10 again. 2012 saw gradual gains up to $12 but also wild fluctuations between $7-$15. In 2013, Bitcoin entered a bull run from $12 to over $1,100 driven by increasing media coverage and adoption in the dark web. But it ended the year around $700 following a China ban on financial institutions and payment processors dealing with Bitcoin. This cycle of rapid gains and dramatic crashes would come to define Bitcoin price performance. The 2014-2016 Bear Market 2014 kicked off with the collapse of Mt.Gox, then the largest Bitcoin exchange, after a series of hacks. This erased most gains from 2013 and caused Bitcoin to fall from around $850 to below $350. For the next two years, Bitcoin hovered in the $200-$300 range. Increased regulation and lack of institutional interest kept mainstream adoption low during this period. Prices were relatively stable compared to past volatility. 2017 &#8211; The Bull Run and Mainstream Mania 2017 marked Bitcoin&#8217;s entry into mainstream awareness and a massive growth in price to nearly $20,000. Several factors drove this rally: Growing media and investment bank coverage calling Bitcoin &#8220;digital gold&#8221; Increased adoption in countries facing currency crises like Venezuela and Zimbabwe Proposals for Bitcoin ETFs (exchange-traded funds) drew investor attention Launch of Bitcoin futures trading on major exchanges like CME and CBOE lent legitimacy Large institutional investments &#8211; U.S billionaire Michael Novogratz invested $500M in Bitcoin in 2017 Demand rose as Bitcoin went from being an obscure digital asset to a household name. But by January 2018, Bitcoin had lost over 60% from its peak following regulatory measures and other factors leading to a cool down from its previously overheated state. 2018-2020 &#8211; The Crypto Winter and Maturation Bitcoin spent much of 2018 in a bear market following the 2017 rally, trading in the $3,000-$6,000 range. Increased regulatory scrutiny, exchange hacks, and coin scams contributed to falling prices. But this period also saw the maturation of Bitcoin with developments including: Lightning Network launch &#8211; enabled fast, cheap Bitcoin micropayments Increased mainstream institutional investment from firms like Fidelity and US Bank Bitcoin futures added on Bakkt, Nasdaq exchanges Countries like Japan recognized Bitcoin as legal tender These developments likely prevented further drops. By mid-2019, Bitcoin recovered to the $10k-$11k range. The COVID-19 pandemic and resulting economic crisis in 2020 proved Bitcoin&#8217;s value as a hedge against inflation and currency devaluation. Stimulus spending eroded fiat savings while Bitcoin held its value. Growing institutional interest like Microstrategy&#8217;s $500M Bitcoin purchase helped take prices past 2017 highs, eventually reaching an all-time high of around $68,000 in 2021. 2021-2022 &#8211; Twin Peaks and Recession Risk  Bitcoin price made not one, but two new highs in 2021. The second high failed to move significantly past the first high, catching investors off-guard who had anticipated BTC reaching $100,000 or more.  Instead, Bitcoin crashed throughout 2022 as the US Federal Reserve launched its QT program and began raising interest rates to fight back against inflation. The situation was worsened by the implosion of several crypto businesses, including FTX. Eventually, Bitcoin reached a local low of $15,800 in November 2022.  How is Bitcoin Doing Now in 2023? Bitcoin price is doing its best to recovery from the crypto market carnage of 2022. The US Federal Reserve continues to raise rates to record levels, and the US SEC is cracking down on the rest of the crypto industry, making it harder for Bitcoin to regain its footing. Despite the challenges, many institutions are eying launching Bitcoin EFTs, which could create a bullish narrative that drives prices higher. In the meantime, BTC is correcting after spending the majority of 2023 in a short-term uptrend. The question remains: Is Bitcoin falling back into a bear market, or will the short-term uptrend roll into a more meaningful mid-term uptrend? Short-Term Bitcoin Price Prediction for 2023 In the short-term, as in before the end of 2023, there are primarily three options from a technical standpoint. The bullish scenario is based on Elliott Wave Principle, and points to a wave 5 and a possible new all-time high this year. The bearish scenario would put Bitcoin in a further corrective pattern, targeting $6,000 per BTC. Of course, an alternative scenario is that Bitcoin simple remains in a sideways consolidation phase for several months longer to finish out 2023. Otherwise, a Bitcoin price prediction of $160,000 in 2023 isn&#8217;t impossible given past price trajectories and percentage moved. Medium-Term Bitcoin Price Prediction for 2024 &#38; 2025 In the medium-term, Bitcoin price forecasts are based on the four-year cycle theory that relies on the Bitcoin block reward halving to tip the tides of supply and demand in favor of price appreciation. Fundamentally over the next several years, Bitcoin should have limited downside. Instead, Bitcoin price predictions for 2024 and 2025 point to anywhere between $100,000 to $250,000 per coin on the upside. Long-term Bitcoin Price Prediction for 2030 and Beyond Predicting Bitcoin&#8217;s price in the long-term is challenging considering how new it still is. However, using a logarithmic growth curve, Bitcoin price predictions reach between $150,000 and $1 million per coin by 2030. Further out into the future, if Bitcoin establishes itself as the leading global digital currency, it could be worth between $1 million and $10 million per coin. Total 21 million BTC in supply would give Bitcoin a market cap of $21-$210 trillion, rivaling major assets like real estate and global broad money supply. But such valuations remain speculative. Bitcoin may also face future competition from both other cryptocurrencies and central bank digital currencies (CBDCs). Bitcoin Price Predictions by Experts Here are some Bitcoin price forecasts by noteworthy experts and analysts. Ark Invest CEO Cathie Wood believes that Bitcoin could hit over $1,000,000 per coin in the long term, with a &#8220;base case&#8221; of $600,000. Venture capitalist Tim Draper sees Bitcoin price ultimately at more than $250,000 per BTC by the end of 2025. Standard Chartered has a Bitcoin price prediction of $120,000 by the end of 2024. FAQ: Frequently Asked Questions Here are answers to some common questions about this Bitcoin price prediction article: What was Bitcoin&#8217;s lowest price? The first recorded Bitcoin transaction in 2010 valued BTC at $0.0008. Bitcoin&#8217;s lowest recent price was around $15,800 in late 2022. What was Bitcoin&#8217;s highest price? Bitcoin&#8217;s all-time high price was around $68,000 in November 2021.  How high could Bitcoin realistically go? Considering growing mainstream adoption and investment interest, Bitcoin realistically could reach $100,000-$500,000 by 2030. A $1 million+ valuation cannot be ruled out in the very long-term. Can Bitcoin price fall to zero? It is unlikely Bitcoin price will crash to zero given its growing adoption, finite supply, and increasing regulation. There will likely always be some demand for Bitcoin which gives it fundamental value. Anything is possible, however.  Why is Bitcoin price so volatile? As a new asset class, Bitcoin is still establishing itself, leading to volatility. Manipulation by &#8220;whales&#8221;, media hype, and regulatory uncertainty add to large price swings. Price should stabilize with broader adoption. When will Bitcoin price stop fluctuating so much? Bitcoin price volatility should reduce significantly as it becomes a mainstream asset and gains broader public adoption in 5-10 years. But some short-term fluctuations will always remain. Will Bitcoin price rise in 2023? Considering adoption trends and investor interest, the overall Bitcoin price trajectory appears to be upwards in 2023 despite some short-term fluctuations.  Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involves substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell any securities or cryptocurrencies."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T15:02:33.000Z",
    "title": "Polkadot Gears Up for Stellar-Based USDC Launch: Web3 Interoperability Meets Billion-Dollar Stablecoin Giant Circle",
    "url": "https://www.crypto-news-flash.com/polkadot-gears-up-for-stellar-based-usdc-launch-web3-interoperability-meets-billion-dollar-stablecoin-giant-circle/",
    "description": "<img width=\"1280\" height=\"721\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot-1024x577.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Circle&#8217;s USDC stablecoin is expanding to new blockchains like Base, NEAR, Noble, Optimism, and Polkadot, boosting accessibility and options for users and developers. This expansion offers faster and cheaper transactions, making USDC more accessible for businesses and people worldwide. The Polkadot blockchain, known for its Web3 interoperability, is gearing up for the upcoming launch of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T15:00:15.000Z",
    "title": "dYdX Forecast: Price Predictions for DYDX and Its Latest Rival, Anarchy (ANA)",
    "url": "https://www.crypto-news-flash.com/dydx-forecast-price-predictions-for-dydx-and-its-latest-rival-anarchy-ana/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-87.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-87.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-87-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-87-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />If there was a perfect time for a token to launch, it will be now, as investors are keeping their eyes peeled for the best token to invest in 2023. Anarchy (ANA) is already drawing investors&#8217; attention, as its presale has gone over the two-million-dollar mark and is setting its eyes on the next milestone. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T14:44:08.000Z",
    "title": "Shibarium Blockchain Integration: DEXTools Takes DeFi Analytics to New Heights",
    "url": "https://www.crypto-news-flash.com/shibarium-blockchain-integration-dextools-takes-defi-analytics-to-new-heights/",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shib\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />A leading DeFi analytics platform has integrated the Shibarium blockchain, enabling users to trade directly on the platform. After facing a turbulent launch, lead developer Kusama has confirmed the addition of new features to strengthen the project. Shiba Inu-affiliated Shibarium is celebrating a new positive development. DEXTools has confirmed its integration into the recently launched [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-25T14:40:07.000Z",
    "title": "Why WorldCoin’s (WLD) Price Dropped 40% In the Last Month?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-worldcoins-wld-price-dropped-40-in-the-last-month/",
    "description": "<p>Investors and enthusiasts have become accustomed to rapid changes, both upward and downward, in the value of various digital assets. WLD, the native token of Worldcoin, a prominent player in the cryptocurrency market, has recently experienced a significant downturn, with its price plummeting by 40% in just one month. This sharp decline has left many [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-worldcoins-wld-price-dropped-40-in-the-last-month/\">Why WorldCoin&#8217;s (WLD) Price Dropped 40% In the Last Month?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T15:00:00.000Z",
    "title": "PEPE, DOGE, and SHIB Crash: What Meme Coins Are Poised to Explode Next?",
    "url": "https://coinedition.com/pepe-doge-and-shib-crash-what-meme-coins-are-poised-to-explode-next/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE, DOGE, and SHIB Crash What Meme Coins Are Poised to Explode Next\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>PEPE token hits a 30-day low, prompting active trading and potential buying opportunities. DOGE struggles near support at $0.0619, with potential for a bearish trend, eyes on the $0.0600 level. FLOKI and BONE&#8217;s recovery is on the horizon as positive developments set the stage for a bullish rally. Pepe (PEPE) has fallen to a 30-day [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepe-doge-and-shib-crash-what-meme-coins-are-poised-to-explode-next/\">PEPE, DOGE, and SHIB Crash: What Meme Coins Are Poised to Explode Next?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]