[
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T05:22:00.000Z",
    "title": " New year rings in with 11% shrinkage in installed Bitcoin ATMs ",
    "url": "https://cointelegraph.com/news/bitcoin-crypto-atm-installed-number-falls-2024-new-year",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMWFiNjE1ZjMtOTU1Yi00ZjNmLWFiNTgtNDk5YWMxNzcyNmI4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>For nearly a decade, the number of crypto ATMs had steadily increased without fail, but something flipped in late 2022.</p>\n                    <p><p>The number of installed Bitcoin ATMs is roughly 11.1% less than at the start of 2023, bucking a 10-year trend that saw the tally increase at the start of every year.</p><p><a href=\"https://coinatmradar.com/charts/growth/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Coin ATM Radar, the number of crypto ATMs globally as of Jan. 1, 2024, is 33,628, down from 37,827 recorded on Jan. 1, 2023. The net total number of Bitcoin ATMs had a mix of growth and decline over 2023, but ultimately fell by the year's end. </p><p>Since Coin ATM Radar first started tracking crypto ATMs in October 2013, the number of installed crypto ATMs has steadily increased monthly until reaching an all-time high of 39,376 in August 2022.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-crypto-atm-installed-number-falls-2024-new-year\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T05:38:56.000Z",
    "title": "Ordinals protocol sparks Bitcoin fork speculation amidst network debates",
    "url": "https://www.cryptopolitan.com/ordinals-protocol-sparks-bitcoin-fork-specul/",
    "description": "Bitcoin developer Jimmy Song has expressed skepticism towards the Ordinals protocol, comparing it to run-of-the-mill altcoin scams. Song, known for his maximalist views, has raised concerns about the impact of Ordinals on the Bitcoin network. Exploiting Bitcoin&#8217;s reputation Song argues that Ordinals is essentially an altcoin scam that capitalizes on the Bitcoin branding to deceive [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T05:30:29.000Z",
    "title": "Ethereum Bulls Sight New High In 2024 As BTC Pumps Above $45K",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-bulls-sight-high-2024/",
    "description": "Ethereum price is eyeing an upside break above the $2,440 resistance. ETH could rally like Bitcoin if there is a close above the $2,500 level. Ethereum is moving higher from the $2,250 support level. The price is trading above $2,350 and the 100-hourly Simple Moving Average. There was a break above a major bearish trend line with resistance near $2,300 on the hourly chart of ETH/USD (data feed via Kraken). The pair could accelerate higher if there is a clear move above $2,400 and $2,440. Ethereum Price Eyes Key Upside Break Ethereum price found support near the $2,250 level and recently started a fresh increase. ETH managed to recover after Bitcoin pumped above the $44,400 resistance zone. The price cleared the $2,300 and $2,320 resistance levels. There was also a break above a major bearish trend line with resistance near $2,300 on the hourly chart of ETH/USD. The pair climbed above the 61.8% Fib retracement level of the downward move from the $2,445 swing high to the $2,258 low. Bitcoin is now trading above $2,350 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,400 level. It is close to the 76.4% Fib retracement level of the downward move from the $2,445 swing high to the $2,258 low. Source: ETHUSD on TradingView.com The first major resistance is now near $2,445. A close above the $2,445 resistance could send the price toward $2,500. The next key resistance is near $2,550. If the bulls remain in action and push ETH above $2,550, there could be a drift toward $2,620. The next resistance sits at $2,650, above which Ethereum might rally and test the $2,800 zone. Another Decline in ETH? If Ethereum fails to clear the $2,400 resistance, it could start another decline. Initial support on the downside is near the $2,350 level. The first key support could be the $2,320 zone. A downside break and a close below $2,320 might start another major decline. In the stated case, Ether could test the $2,250 support. Any more losses might send the price toward the $2,120 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,320 Major Resistance Level – $2,400"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-02T05:28:54.000Z",
    "title": "Why Pushd (PUSHD) Could Compete With The Likes Of Solana (SOL) and Cardano (ADA)",
    "url": "https://coinedition.com/why-pushd-pushd-could-compete-with-the-likes-of-solana-sol-and-cardano-ada/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-2-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Solana (SOL) and Cardano (ADA) are the sixth and eighth biggest cryptocurrencies in the world by market capitalization. To put into perspective just how big these crypto projects are, Solana (SOL) has a market cap of $44.4 billion and ADA’s market cap is $21.4 billion. These two tokens have been among the highest-ranked cryptos in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/why-pushd-pushd-could-compete-with-the-likes-of-solana-sol-and-cardano-ada/\">Why Pushd (PUSHD) Could Compete With The Likes Of Solana (SOL) and Cardano (ADA)</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]