[
  {
    "source": "CoinDesk",
    "date": "2023-09-13T01:00:00.000Z",
    "title": "CoinDesk Indices Expands Into APAC Region in Deal With ICE Futures Singapore",
    "url": "https://www.coindesk.com/business/2023/09/13/coindesk-indices-expands-into-apac-region-in-deal-with-ice-futures-singapore/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ICE Futures Singapore's bitcoin futures contracts will now be known as CoinDesk Bitcoin Futures contracts."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-13T00:19:22.000Z",
    "title": "Rising Interest Rates Could Actually Pump Bitcoin: Arthur Hayes",
    "url": "https://decrypt.co/156139/rising-interest-rates-could-actually-pump-bitcoin-arthur-hayes",
    "description": "Bitcoin’s price may rise if central banks worldwide continue tightening monetary policies, according to the BitMEX co-founder."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T01:07:38.000Z",
    "title": "Decentralized exchanges a magnet for crypto wash traders: Solidus Labs",
    "url": "https://cointelegraph.com/news/decentralized-crypto-exchanges-wash-trading-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/24ea1293-07e8-4007-a319-784af099452c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Token deployers and liquidity providers wash-traded over $2 billion worth of crypto on Ethereum-based DEXs since 2020, a Solidus Labs report claims.</p>\n                    <p><p>Over 20,000 crypto tokens have been manipulated via decentralized exchange (DEX) wash trading in the last three years, according to market surveillance firm Solidus Labs.</p><p>In the second part of its <em>2023 Crypto Market Manipulation Report</em> released Sept. 12, Solidus <a href=\"https://www.soliduslabs.com/reports/crypto-wash-trading\" target=\"_blank\" rel=\"noopener nofollow\">s</a><a href=\"https://www.soliduslabs.com/reports/crypto-wash-trading\" target=\"_blank\" rel=\"noopener nofollow\">aid</a> among a sample of 30,000 Ethereum-based DEX liquidity pools, nearly 70% were found to have executed wash trades since September 2020 — making up for around $2 billion worth of crypto.</p><p><a href=\"https://cointelegraph.com/explained/what-are-wash-trading-and-money-laundering-in-nfts\">Wash trading</a> is a form of market manipulation where an entity buys and sells the same asset giving the false impression of market activity.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Major Update! Unveiling Part Two of our Crypto Market Manipulation Report!  Our data shows a shocking $2 billion <a href=\"https://twitter.com/hashtag/washtrades?src=hash&amp;ref_src=twsrc%5Etfw\">#washtrades</a> on DEXs since Sept 2020. That&#39;s affecting over 20,000 tokens! ⚠️<br><br> Full details here in our report: <a href=\"https://t.co/pcRvMBGfb0\">https://t.co/pcRvMBGfb0</a></p>&mdash; Solidus Labs (@Solidus_Labs) <a href=\"https://twitter.com/Solidus_Labs/status/1701582244140220880?ref_src=twsrc%5Etfw\">September 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Wash trades are present in traditional finance, however, Solidus argued market manipulators often have easier means to do so when it comes to crypto. </p><blockquote>“In crypto, liquidity is fragmented across a variety of centralized and decentralized exchanges, resulting in smaller markets that are easier to manipulate.”</blockquote><p>There’s also an ongoing regulatory question over <a href=\"https://cointelegraph.com/news/defi-regulations-where-us-regulators-should-draw-the-line\">who is responsible</a> for on-chain wash trading detection and prevention — likely given the borderless nature of decentralized finance. </p><p>\"Market manipulation remains a significant challenge within the crypto industry, especially in an era of greater regulatory scrutiny and institutional adoption,\" Solidus founder and CEO Asaf Meir said in a statement.</p><blockquote>\"The wash trading activity we have unearthed here is a clear sign of market manipulation, and it must be prevented for crypto and DeFi to flourish.”</blockquote><p>Solidus explained wash traders come in all shapes and sizes, from <a href=\"https://cointelegraph.com/news/one-crypto-wallet-launched-114-dodgy-memecoins-in-two-months\">token deployers looking for an easy rug pull</a>; to speculators attempting to game an upcoming token airdrop; to exchange and marketplace operators reporting higher trading volumes to attract investors and users.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nft-wash-trading-increases-by-126-in-february-data\"><strong><em>NFT wash trading increases by 126% in February: Data</em></strong></a></p><p>In 2022, a National Bureau of Economic Research study suggested more than 70% of unregulated exchange volumes <a href=\"https://cointelegraph.com/news/70-of-unregulated-exchange-transactions-are-wash-trading-nber-study\">were wash trades. </a></p><p>According to the researchers, there are short-term incentives for wash trading and suggested fake transactions often impact the rankings of the exchanges on data and statistics websites such as CoinMarketCap and CoinGecko.</p><p>In addition, fake transactions also affect the crypto prices within the exchanges over the short term.</p><p><strong><em>Hodler’s Digest, Sept. 3-9: <a href=\"https://cointelegraph.com/magazine/binances-exec-exodus-nasdaq-to-trade-ai-orders-and-sbf-loses-bail-appeal-hodlers-digest-sept-3-9/\">B</a><a href=\"https://cointelegraph.com/magazine/binances-exec-exodus-nasdaq-to-trade-ai-orders-and-sbf-loses-bail-appeal-hodlers-digest-sept-3-9/\">inance’s exec exodus, Nasdaq to trade AI orders and SBF loses bail appeal</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T00:24:34.000Z",
    "title": "Binance.US cuts third of staff as CEO Brian Shroder leaves",
    "url": "https://cointelegraph.com/news/binance-us-cuts-third-of-staff-ceo-brian-shroder-leaves-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/547bced3-4673-4c63-a1c1-928ff7aacc8a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The staff cut and departure comes amid legal action from United States regulators.</p>\n                    <p><p>Binance.US, the United States arm of the crypto exchange has cut around a third of its staff — or 100 positions — with its president and CEO Brian Shroder also departing the firm.</p><p>A Binance.US spokesperson confirmed the layoffs and Shroder's departure to Cointelegraph, adding it took the actions to give the exchange \"more than seven years of financial runway\" amid its <a href=\"https://cointelegraph.com/news/binance-usd-deposits-withdrawals-moonpay-usdt\">move to a crypto-only</a> exchange.</p><blockquote>\"The [Securities and Exchange Commission's] aggressive attempts to cripple our  industry and the resulting impacts on our business have real-world consequences for American jobs and innovation, and this is an unfortunate example of that.”</blockquote><p>The spokesperson confirmed Shroder was replaced on an interim basis by chief legal officer Norman Reed.</p><p>Shroder joined Binance.US in September 2021 and his departure comes amid a slew of regulatory action taken against the firm in recent months.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-executive-denies-ftx-comparisonss\">Binance’s Richard Teng denies FTX comparisons: ‘We welcome the scrutiny’</a></em></strong></p><p>Earlier this year, the SEC and the Commodity Futures Trading Commission <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">sued Binance, Binance.US</a>, and the exchange's co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng \"CZ\" Zhao</a> alleging it operated an illegal exchange, sold unregistered securities, violated commodities laws and mishandled customer funds.</p><p>On June 9, the exchange <a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">suspended dollar deposits</a> and notified its customers it would also be pausing fiat withdrawal channels amid the battle with the SEC. </p><p>Binance.US then transitioned to a crypto-only exchange for two months, only opening a path for USD ramps again in August when it secured a partnership with MoonPay. </p><p>In July, a report from Reuters citing Kaiko data suggested that <a href=\"https://cointelegraph.com/news/binance-us-market-share-drops-amid-regulatory-lawsuit-report\">Binance.US' market share</a> in the U.S. dropped from more than 22% in April to roughly 0.9% as of June 26. </p><p class=\"post-content__disclaimer\">Update (Sep. 13, 12:30 am UTC): This article has been updated with a comment from a Binance.US spokesperson. </p><p class=\"post-content__disclaimer\">Additional reporting by Felix Ng. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-13T00:31:00.000Z",
    "title": "Crypto Market Faces $3 Billion Shockwave as FTX Plans to Sell Off Its Tokens",
    "url": "https://www.cryptoglobe.com/latest/2023/09/crypto-market-faces-3-billion-shockwave-as-ftx-plans-to-sell-off-its-tokens/",
    "description": "The cryptocurrency market may be facing an impending tremor, as an analytics firm has recently suggested that a potential 3 billion sell-off is looming, rooted in the potential liquidations of FTX’s massive cryptocurrency stack to repay creditors. A recent court filing has recently revealed that the estate of the once-giant cryptocurrency exchange, which filed for […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T01:00:57.000Z",
    "title": "Bitcoin Begins Rally As Franklin Templeton Joins Race For BTC Spot ETF",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-begins-rally-as-franklin-templeton-joins/",
    "description": "Bitcoin (BTC) has welcomed another noteworthy decision from the global investment firm Franklin Templeton. With a portfolio spanning various financial instruments, the company is now setting its sights on one of the most sought-after financial products in the digital currency realm: a spot Bitcoin exchange-traded fund (ETF). This development signifies the firm&#8217;s progressive stance on digital assets and underscores the increasing mainstream acceptance of cryptocurrencies, particularly Bitcoin. Following the news, BTC has surged 4.2% in the past day, breaking above $26,000, as of this writing.  Related Reading: GBTC’s Discount Narrows Amid Bitcoin’s Downturn, But A Bullish Trend Is Coming? Details Of The Franklin Spot BTC ETF Based on recent filings, the proposed offering has been dubbed the &#8220;Franklin Bitcoin ETF.&#8221; One of the fundamental characteristics of this ETF would be its primary assets—essentially constituted of Bitcoin. Coinbase Custody Trust Company, a subsidiary of one of the world&#8217;s leading cryptocurrency exchange platforms, will serve as these assets&#8217; custodians. Such a collaboration could provide the proposed fund an extra layer of credibility and security, given Coinbase&#8217;s longstanding reputation in the crypto space. Another critical aspect to consider is the chosen trading platform. If the Securities and Exchange Commission (SEC) approves, Franklin Templeton&#8217;s Bitcoin ETF will see its shares being traded on the Cboe BZX Exchange. In determining Bitcoin&#8217;s pricing, the filing indicates a reliance on the Chicago Mercantile Exchange (CME) CF Bitcoin Reference Rate, specifically the New York Variant. Bitcoin Begins Rally After Bouncing Off $24,900 Following the Franklin Templeton spot Bitcoin ETF filing disclosure, Bitcoin has shown signs of recovery. The top crypto experienced a slight surge, breaking the downward trend that had dominated the market in recent weeks. Over the past 24 hours, Bitcoin has surged by nearly 3%, trading for $26,185 as of this writing. Particularly, the asset broke away from the stagnant price zone of around $25,000 observed over the past week.   Complementing its price movement, Bitcoin&#8217;s trading volume experienced a significant uptick. A comparison reveals that while the trading volume was as low as $1.7 billion last Wednesday, it increased to $18.4 billion in the past 24 hours. Notably, the financial industry&#8217;s anticipation for the first-ever spot crypto ETF is palpable. Franklin Templeton&#8217;s decision, while bold and promising, enters a domain where the SEC has shown consistent reticence. Related Reading: JPMorgan Adjusts Bitcoin’s Production Cost: What This Means For BTC And Its Miners? Over the last month, the regulatory body decided to postpone its decisions concerning proposals for spot Bitcoin ETFs. This delay can be attributed to the SEC&#8217;s current process of sifting through the influx of recent applications in this category. There hasn&#8217;t been a single spot crypto ETF that has secured the SEC&#8217;s endorsement. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-13T00:13:00.000Z",
    "title": "Shibarium Executive Reflects On Shibaswap 2.0, Shibahub & More",
    "url": "https://coinedition.com/shibarium-executive-reflects-on-shibaswap-2-0-shibahub-more/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SHIB Ranks Second in Trending List Despite Horrific Price Losses\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/SHIB-Ranks-Second-in-Trending-List-Despite-Horrific-Price-Losses-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shiba Inu’s marketing strategist Lucie recently took to X (formerly Twitter) to reflect on multiple upcoming developments including the $TREAT token. The Shibarium executive told her followers that upgrades were steps in the project’s development journey and were not motivated by price pumping or attempts to support the price of Shiba Inu. According to Lucie, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shibarium-executive-reflects-on-shibaswap-2-0-shibahub-more/\">Shibarium Executive Reflects On Shibaswap 2.0, Shibahub &amp; More</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]