[
  {
    "source": "Cointelegraph",
    "date": "2023-12-03T14:30:00.000Z",
    "title": " How blockchain improves daily healthcare routine, explained ",
    "url": "https://cointelegraph.com/explained/how-blockchain-improves-daily-health-care-routine-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9mOWMxYjI3M2Q0MDE3YmNlYjhhM2NhZWJjNTM3MWQ2NC5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Blockchain enhances daily healthcare by securing patient data, streamlining coordination and minimizing errors for efficient care delivery.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-27819-5\">            <h2 data-ct-widget=\"explained-block-title\">                The significance of blockchain in the daily healthcare routine            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Blockchain has the potential to revolutionize healthcare by preserving data integrity, fostering better teamwork, and increasing patient care &mdash; even in the face of ongoing difficulties with scale and integration.</em></p><p>Blockchain technology has the potential to completely <a href=\"https://cointelegraph.com/explained/why-the-service-industry-needs-blockchain-explained\" >transform healthcare practices</a>. </p><p>Blockchain makes it easier to create a decentralized ledger that safely keeps patient data private and permits authorized access. </p><p>Additionally, the technology can strengthen clinical trial integrity, guaranteeing the reliability of outcomes and advancing medical research. </p></p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-27819-4\">            <h2 data-ct-widget=\"explained-block-title\">                How can blockchain prevent the counterfeiting of drugs in the pharmaceutical supply chain?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Blockchain technology&rsquo;s intrinsic transparency and immutability are vital in the fight against drug counterfeiting in the pharmaceutical supply chain.&nbsp;</em></p><p>Blockchain follows the movement of pharmaceuticals from production to distribution, providing an immutable record of every stage along the way by generating an unchangeable ledger of transactions.</p><p>Every drug batch is registered as a distinct block on the chain, holding important data, including quality certifications, shipment information and production details. </p><p><a href=\"https://cointelegraph.com/explained/how-blockchain-improves-daily-health-care-routine-explained\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-03T14:30:57.000Z",
    "title": "Big Names Talk Potential Impact of ETFs on BTC Price, Solo Miner Pulls Down Lucky Block Reward, and More — Week in Review",
    "url": "https://news.bitcoin.com/big-names-talk-potential-impact-of-etfs-on-btc-price-solo-miner-pulls-down-lucky-block-reward-and-more-week-in-review/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Big Names Talk Potential Impact of ETFs on BTC Price, Solo Miner Pulls Down Lucky Block Reward, and More — Week in Review\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1192186693.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Global investment bank JPMorgan has noted that SEC approval of a spot bitcoin exchange-traded fund (ETF) could &#x201C;put severe downward pressure on bitcoin prices.&#x201D; Conversely, Standard Chartered Bank sees &#x201C;price upside&#x201D; related to such an approval from the United States Securities and Exchange Commission. In other news, a solo bitcoin miner has snagged a block [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-03T14:18:08.000Z",
    "title": "Avalanche MOM volume up 167% as L1 networks record growth",
    "url": "https://crypto.news/avalanche-mom-volume-up-167-percent-l1-networks-growth/",
    "description": "Avalanche (AVAX), an Ethereum Virtual Machine (EVM)-based layer 1 solution, experienced a significant surge in trading activity, spiking to about $2.73 billion."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-03T14:30:26.000Z",
    "title": "XRP Lawsuit: Full History, News, Schedule And Price Predictions",
    "url": "https://www.newsbtc.com/xrp-news/xrp-lawsuit-news-updates-schedule-price-predictions/",
    "description": "Few events have garnered as much attention as the ongoing lawsuit between Ripple Labs and the US Securities and Exchange Commission (SEC) &#8211; often referred to as “XRP lawsuit”. This legal battle, which has significant implications for the broader crypto market, has seen a series of twists and turns that have kept investors and industry observers on their toes. In this article, we delve into the details of the XRP lawsuit, provide the latest updates, and explore what the future might hold for XRP price. XRP Lawsuit Overview: What Are The SEC&#8217;s Claims? In December 2020, the US Securities and Exchange Commission (SEC) filed a lawsuit against Ripple Labs, the company behind the XRP cryptocurrency, and two of its executives, Brad Garlinghouse and Christian Larsen. The SEC alleged that XRP is an unregistered security and that Ripple Labs illegally raised over $1.3 billion through its sale. The SEC&#8217;s position hinges on the application of the Howey Test, a standard derived from a 1946 Supreme Court case, to determine if a transaction qualifies as an &#8220;investment contract&#8221; and therefore should be considered a security subject to SEC regulation. The SEC argues that investors in XRP expected profits primarily from the efforts of Ripple&#8217;s management and its corporate actions, classifying XRP as a security under this framework. XRP Lawsuit: The Howey Test The SEC&#8217;s case hinges on the Howey Test, a four-pronged test that determines whether an asset is considered a security under US law. The four prongs of the Howey Test are: An investment of money: The investor must have invested money in a common enterprise. A reasonable expectation of profits: The investor must have a reasonable expectation of profits to be derived from the investment, solely from the efforts of others. Participation in a common enterprise: The investor must participate in a common enterprise with the promoter of the investment. An expectation of profits from the efforts of others: The investor must have an expectation of profits from the efforts of others rather than solely from their own efforts. The SEC argues that XRP meets all four prongs of the Howey test. Specifically, the SEC alleges that: Investors purchased XRP with the expectation that its value would appreciate. Ripple Labs promoted XRP as an investment opportunity. XRP holders participated in a common enterprise with Ripple Labs. XRP holders expected to profit from the efforts of Ripple Labs and others in the XRP ecosystem. Ripple Labs has vehemently denied the SEC&#8217;s allegations, arguing that XRP is a utility token used for cross-border payments and not an investment contract. The company has also maintained that its sale of XRP was not an unregistered securities offering. Ripple XRP Lawsuit: The Full History The legal saga between Ripple and the US Securities and Exchange Commission (SEC) has been marked by a series of pivotal events, shaping the discourse around cryptocurrency regulation and the classification of digital assets. Below is a comprehensive timeline of the key milestones in the Ripple vs. SEC lawsuit. Dec. 21, 2020: SEC Files Lawsuit Against Ripple Labs The SEC&#8217;s lawsuit against Ripple Labs, Brad Garlinghouse, and Christian Larsen was a pivotal moment in the cryptocurrency industry. This was the first time the SEC took action against a major crypto company for allegedly selling unregistered securities. The SEC&#8217;s complaint alleged that Ripple Labs had raised over $1.3 billion through the sale of XRP, which it classified as an unregistered security. The SEC also alleged that Ripple Labs had engaged in ongoing sales of XRP to retail investors, further violating securities laws. Dec. 28, 2020: Coinbase Delists XRP Following the lawsuit&#8217;s initiation, Coinbase, a major cryptocurrency exchange, removed XRP from its trading platform. This move was a significant reaction to the legal uncertainty surrounding XRP&#8217;s status and indicated the potential market impact of the SEC&#8217;s actions. Almost all crypto exchanges followed, delisting XRP for American clients. Ripple XRP Lawsuit: The Year 2021 March 3, 2021: Larsen and Garlinghouse Challenge SEC’s Fair Notice Ripple’s executives contended that the SEC did not provide adequate notice that XRP would be considered a security. This defense focused on the lack of regulatory clarity and guidance for market participants regarding the status of digital assets like XRP. March 8, 2021: SEC Requests Immediate Hearing In a response to Ripple&#8217;s fair notice defense, the SEC sought a quick hearing, indicating the agency&#8217;s urgency in addressing and refuting Ripple&#8217;s claims and moving forward with the legal proceedings. March 22, 2021: XRP Recognized For Currency Value And Utility Judge Sarah Netburn&#8217;s recognition of XRP’s utility and currency value was a notable moment in the lawsuit. This ruling differentiated XRP from typical securities, suggesting a possible unique legal standing for XRP compared to other digital assets. June 14, 2021: SEC’s Internal Crypto Trading Policies Deadline Extended The court’s decision to extend the deadline for the SEC to disclose its internal cryptocurrency trading policies indicated the complexity and sensitivity of the information expected, which could potentially impact the case&#8217;s direction. Aug. 31, 2021: Deadline for SEC’s Internal Crypto Trading Policies Disclosure The disclosure of these policies was anticipated to provide transparency into the SEC&#8217;s internal stance on cryptocurrencies and potential conflicts of interest, which could have implications for the lawsuit. Oct. 15, 2021: Expert Discovery Deadline The inclusion of expert opinions from the fields of cryptography and securities law aimed to bring technical and legal clarity to the case, potentially influencing the court’s understanding of XRP&#8217;s nature. XRP Ripple Lawsuit: The Year 2022 Jan. 24, 2022: Extension for Sensitive Document Disclosure The extension allowed the SEC more time to contest the decision requiring the disclosure of sensitive documents, highlighting the critical nature of these documents in the legal battle. Sept. 17, 2022: Motions for Summary Judgment Filed The filing of summary judgment motions by both parties was a crucial step in the legal process, summarizing their arguments and legal positions, and moving the case closer to a resolution. Sept. 21, 2022: Chamber of Digital Commerce Granted Amicus Curiae Brief Filing The court’s permission for the Chamber of Digital Commerce to file an amicus curiae brief brought an additional perspective from a key blockchain advocacy group, potentially influencing the court&#8217;s understanding of the broader industry context. Dec. 2, 2022: Replies to Summary Judgment Motions Made Public The public release of these replies provided deeper insights into the legal strategies and arguments of both the SEC and Ripple, clarifying the stakes and positions in the lawsuit. Dec. 22, 2022: SEC’s Attempt to Prevent Public Release of Hinman Documents The SEC&#8217;s efforts to block the release of the Hinman documents underscored their potential significance in clarifying the SEC’s internal views and policies regarding digital assets like XRP. Ripple Clinches Four Victories: The Year 2023 #1: June 12, 2023: Hinman Documents Unsealed And Made Public The Hinman emails were released in the SEC Ripple case on June 13, 2023. These emails, related to former SEC director William Hinman, were part of the SEC&#8217;s lawsuit against Ripple Labs, and their release had been highly anticipated for months. The documents included exchanges between Hinman and Ethereum founders Vitalik Buterin and Joe Lubin. They revealed that Hinman ignored instructions from high-ranking SEC officials in preparation for his June 14, 2018 speech, where he discussed Ether and its classification as a security. Ripple&#8217;s CEO, Brad Garlinghouse, stated that the Hinman documents were &#8220;well worth the wait&#8221;. The release of these emails had severe implications for the SEC&#8217;s credibility and the ongoing XRP lawsuit, and marked the first victory for Ripple. #2: July 13, 2023: Ripple Labs Wins The Summary Judgment Ripple Labs achieved its second, although partial victory in its legal battle with the SEC. The US District Court for the Southern District of New York ruled that the sale of Ripple’s XRP tokens on exchanges and through algorithms did not constitute investment contracts. This was a significant decision because it implied that these sales were not subject to federal securities laws. However, the court found that Ripple&#8217;s direct sales of XRP to institutional buyers, hedge funds, and other parties were in violation of federal securities laws. These institutional sales, amounting to approximately $770 million, were deemed as unregistered offers and sales of investment contracts. The court&#8217;s ruling was based on the expectation that investors in these institutional sales would profit from Ripple&#8217;s efforts to promote and increase the value of XRP. This ruling was notable because it provided some clarity on the circumstances under which digital assets like XRP could be considered securities. For the programmatic sales through exchanges and algorithms, the court found no evidence that a reasonable buyer would have the expectation of profits derived from the efforts of Ripple’s management. This aspect of the ruling was a relief for Ripple, as it suggested that regular sales of XRP to general investors did not violate securities laws. The court&#8217;s decision not to grant the SEC&#8217;s motion for summary judgment on the &#8220;aiding and abetting&#8221; claim against Ripple executives Larsen and Garlinghouse further bolstered Ripple&#8217;s position​. #3: October 3, 2023: Judge Torres Denies SEC’s Interlocutory Appeal The SEC&#8217;s interlocutory appeal against Ripple was denied on October 3, 2023. The decision marked the third consecutive loss for the SEC in its legal battle with Ripple, where Judge Torres rejected the SEC&#8217;s attempt to appeal its loss against Ripple, setting the stage for further proceedings in the case. #4: October 19, 2023: SEC Drops Claims Against Ripple Labs Executives In its fourth loss to Ripple, the SEC dropped charges against Brad Garlinghouse and Christian Larsen. This left Ripple Labs as the sole defendant in the lawsuit. This decision was a surprise to many observers, as it suggested that the SEC may have been losing confidence in its case against the individual executives. Pending: Ripple XRP Lawsuit &#8211; The Trial A trial date has yet to commence. The trial will be a high-stakes event for Ripple Labs, as the company could face significant penalties for its institutional sales worth $770 million which were considered unregistered securities sales. The trial is scheduled to take place between April and June 2024. The remedies phase will determine the appropriate fine for Ripple&#8217;s past institutional sales of XRP, valued at $770 million. The SEC will seek the entire amount as penalties. Ripple might attempt to reduce this figure by arguing for the exclusion of legitimate business expenses and XRP sales outside the United States​​. XRP Wins Lawsuit: But What About Remedies? John E. Deaton&#8217;s Analysis John E. Deaton, who acted as amicus curiae in the XRP lawsuit, expressed strong confidence in Ripple’s success in the ongoing lawsuit with the SEC. He predicted that Ripple has a 99.1% chance of winning, contingent on agreeing to a fine not exceeding $20 million. Deaton argued that the SEC could not demand significant disgorgement without proving harm to investors. In his analysis he also emphasized that the people who viewed the SEC’s victory as 50-50 were mistaken. He suggested that it was more like a 90-10 win in Ripple’s favor. According to Deaton, if Ripple ends up paying a fine of $20 million or less, it would represent a near-total legal victory​​. Jeremy Hogan&#8217;s Analysis Jeremy Hogan, another pro-XRP attorney, recently provided insights into the potential arguments Ripple might use during the remedies briefing. Hogan referred to the SEC v. Liu case, which emphasized that disgorgement should be &#8220;fair&#8221; and based on the violator’s net profits rather than gross. He suggested that Ripple is likely to deduct its legitimate business expenses from any potential penalties. Hogan also pointed out that sales outside the SEC’s US jurisdiction could be excluded from the total sum. This could seriously affect the penalties&#8217; final amount. Additionally, he mentioned that disgorgement should go to those who experienced financial losses, namely individuals or entities that suffered investment losses. If an XRP holder acquired the cryptocurrency at a lower price than its current value, they would not qualify as victims, thus challenging the SEC&#8217;s case for disgorgement. Hogan concluded, &#8220;In conclusion, $770 million is NOT going to be $770 million, but something much less.&#8221;​ XRP Lawsuit News As of November 2023, the ongoing legal battle between Ripple Labs and the US SEC has entered a crucial phase. Both parties have submitted a joint proposal for the next stage of the lawsuit. This proposal focuses on the remedies briefing and discovery process. Important: Stay up to date with the latest news in the XRP lawsuit on NewsBTC. XRP Lawsuit Next Court Dates: Upcoming Schedule Pro-XRP lawyer John E. Deaton has provided the final dates for the Ripple vs. SEC case, as per the orders from US District Judge Analisa Torres. According to the schedule based on the remedies and discoveries filing: February 12, 2024: Deadline for both parties to conclude all remedies-related discovery. March 13, 2024: The SEC is required to file its brief regarding the remedies. April 12, 2024: Ripple will file its opposition to the SEC’s brief. April 29, 2024: The SEC is expected to file its response to Ripple’s opposition. Deaton predicts that the lawsuit&#8217;s conclusion will likely occur in July 2024, during the summer. This schedule sets the stage for the final phases of this landmark case. XRP Lawsuit End Date Predictions: When Will The XRP Lawsuit Be Over? The Ripple vs. SEC lawsuit is entering a critical phase, with various experts providing insights on the potential XRP lawsuit end date. John Deaton sees the penalty phase as a complex stage. The SEC could demand $770 million for Ripple&#8217;s institutional sales of XRP. Deaton anticipates a time-consuming process to finalize the penalty fee, potentially extending the case into the late summer 2024. There&#8217;s also speculation about the SEC&#8217;s intent to appeal. The SEC, led by Gary Gensler, might consider this route after Judge Analisa Torres delivers the final verdict. An appeal could prolong the case by at least another year. The XRP lawsuit end date would be dragged out for years. Earlier in the lawsuit, the SEC&#8217;s attempt for an interlocutory appeal was denied, implying they must wait for the final judgment. Given the SEC&#8217;s previous decision not to appeal in a similar case with Grayscale, the likelihood of an appeal remains uncertain. Pro-XRP Attorney Fred Rispoli, closely following the lawsuit, commented on the recent court order that schedules the upcoming remedies phase. The court order requires the completion of remedies-related discovery by February 12, 2024, with the subsequent filing of briefs and responses extending to April 29, 2024. Rispoli speculates that in the event of an appeal, the Second Circuit may not deliver a ruling until at least mid-2026. XRP Price Prediction After Lawsuit Win The resolution of the Ripple vs. SEC lawsuit, especially if it results in a favorable outcome for Ripple, is expected to exert a substantial influence on XRP&#8217;s price. However, it&#8217;s important to note that price predictions are speculative and subject to various market forces. XRP Price After Lawsuit: How High Will It Go? The summary judgment on July 13, 2023, which found that XRP is not considered a security, had a notable impact on its market performance. Following the summary judgment on July 13, price surged from $0.475 to $0.95, marking a 100% increase. The trading volume for the token also exploded, spiking by almost 2,000%. This surge propelled XRP to become the fourth-largest cryptocurrency by market cap. The reinstatement of XRP on major US exchanges like Coinbase, Kraken, and Gemini, which had halted trading after the SEC&#8217;s lawsuit, further bolstered this momentum​. A final victory by Ripple in the XRP lawsuit could have similar implications. Past price moves could be indicative for a XRP price prediction after lawsuit. However, neither the dismissal of the interlocutory appeal nor the dismissal of the claims against the two Ripple executives had such a major impact on the XRP price as the summary judgment. However, predicting the exact price of XRP post-lawsuit is challenging due to the volatile nature of the crypto market. Factors like overall market trends, investor sentiment, and broader economic conditions will play a significant role. A victory by Ripple is a bullish signal for XRP. This could potentially result in a significant rise in its price. Short-Term: In the immediate aftermath, XRP price could experience a sharp increase as investors react to the news. Long-Term: Over time, the price might stabilize as the market absorbs the impact of the lawsuit resolution. Ripple could drive long-term growth by continued development and adoption in the financial industry. XRP Price After Lawsuit Win: Predictions Predictions about XRP&#8217;s price post-lawsuit victory vary among analysts. Some conservative estimates target a rise to $1 by the end of the year following a Ripple court victory. More bullish analysts suggest that Ripple could retest its all-time high of $3.84 within hours of the court decision. Moreover, many believe that no technical resistance exists to prevent further rises in XRP&#8217;s price. Each new banking partnership could potentially serve as a catalyst for the token&#8217;s value increase. FAQ: XRP Lawsuit How High Will XRP Go After The Lawsuit? The future price of XRP post-lawsuit is speculative. Factors influencing this include the lawsuit&#8217;s outcome, market conditions, and investor confidence. Previous data suggest that the XRP price is highly sensitive to news from the Ripple Labs vs. US SEC lawsuit. When Will The XRP Lawsuit Be Over? The timeline for the conclusion of the XRP lawsuit is uncertain. Legal proceedings can be lengthy and unpredictable. However, based on current progress of the case, the lawsuit is likely to conclude in 2024 with the remedies phase. A SEC appeal could further delay the case for years. Did XRP Win The Lawsuit? Ripple Labs has achieved significant legal victories. Most importantly, judge Analisa Torres ruled that the XRP token itself is not a security. However, this ruling applies only to specific aspects of the case. Additionally, the SEC achieved a partial victory: the court declared that Ripple&#8217;s institutional sales worth $770 million are security sales. Has the XRP Lawsuit Been Dropped? The XRP lawsuit is still ongoing. It has progressed through various stages, with recent rulings favoring Ripple. The remedies phase, starting in April 2024 is next. Will XRP Win The Lawsuit? Predicting the complete outcome of the XRP lawsuit is difficult. While Ripple Labs has achieved a landmark win, the case involves complex legal arguments. Also, the potential for a SEC appeal exists​. Ultimately, the SEC could take the case before the US Supreme Court. What Is The XRP Lawsuit All About? The XRP lawsuit by the SEC concerns allegations that Ripple conducted a $1.3 billion unregistered securities offering by selling XRP. The SEC argues that XRP sales and trading did not meet the principles of the Howey Test. What Is The Significance Of The XRP Lawsuit For The Cryptocurrency Market? The lawsuit&#8217;s outcome is significant for the entire cryptocurrency industry, potentially influencing US and global regulatory approaches to cryptocurrencies. It may set precedents for how cryptocurrencies are classified and regulated​. How High Will XRP Go After Lawsuit? The price prediction for XRP after the lawsuit is largely speculative and hinges on various market factors. Some experts and investors anticipate that XRP could reclaim its all-time high of $3.40. Featured images from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-03T14:30:00.000Z",
    "title": "“A Cardano Explosion Is Setting Up,” According to Analyst",
    "url": "https://coinedition.com/a-cardano-explosion-is-setting-up-according-to-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano Explosion Is Setting Up\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Cardano-Node-v.8.0.0-and-Lace-1.1.0-Key-Highlights-in-Development-Report-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst Dan Gambardello revealed in an X post yesterday that a bullish explosion for the Cardano ecosystem is setting up. In his post, Gambardello highlighted the fact that the top 20 Cardano tokens currently have a collective market cap of around $850 million.  This impressive statistic is overshadowed by the $235 [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/a-cardano-explosion-is-setting-up-according-to-analyst/\">“A Cardano Explosion Is Setting Up,” According to Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]