[
  {
    "source": "CoinDesk",
    "date": "2024-02-01T09:14:11.000Z",
    "title": "Binance Sued by Families of Hamas Victims, Hostages",
    "url": "https://www.coindesk.com/policy/2024/02/01/binance-sued-by-families-of-hamas-victims-hostages/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The plaintiffs, who are also suing Iran and Syria, say the crypto exchange facilitated the financing of Hamas and other terrorist groups between 2017 and 2023."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T09:17:58.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Celsius, now from Chapter 11 bankruptcy in the United States, is set to start distributing $3 billion worth of crypto and fiat to creditors. Ripple chairman Chris Larsen was hacked out of 213 million XRP tokens, according to on-chain sleuth ZachXBT. Meanwhile, the Web3 ecosystem lost $38.9 million due to various security incidents in the first month of 2024.</p><p>Cryptocurrency lending firm Celsius is set to start distributing $3 billion worth of crypto and fiat to creditors, along with launching a new Bitcoin mining firm. Celsius said Ionic Digitial will “continue to deliver recoveries to creditors,” and its stock is “expected to be publicly traded once the requisite approvals are received.”</p><p data-ct-non-breakable=\"true\">The top five smart contract protocols that suffered the highest losses include Radiant Capital, Gamma Strategies, Wise Lending, Socket and Goledo Finance.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-01T09:29:19.000Z",
    "title": "From record highs to notable lows: Bitcoin fees after the inscription booms",
    "url": "https://cryptoslate.com/insights/from-record-highs-to-notable-lows-bitcoin-fees-after-the-inscription-booms/",
    "description": "<p>Quick Take A compelling trend emerged in the Bitcoin landscape in 2023, marked by two distinct spikes in mining fees – one in May and the other in November. Both were directly correlated to a surge in Bitcoin inscriptions, with the May frenzy subsiding after a month, while the November surge endured for approximately two [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/from-record-highs-to-notable-lows-bitcoin-fees-after-the-inscription-booms/\">From record highs to notable lows: Bitcoin fees after the inscription booms</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-01T09:23:18.000Z",
    "title": "US Energy Department to conduct ’emergency’ review of crypto miners",
    "url": "https://cryptobriefing.com/us-energy-department-conduct-emergency-review-of-crypto-miners/?utm_source=feed&utm_medium=rss",
    "description": "The provisional survey is categorized as an \"emergency collection of data\" request and is slated to commence next week."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-01T09:13:27.000Z",
    "title": "Signet, Talisman’s New Multisig Enterprise Workflow Solution, Launches Private Beta",
    "url": "https://cryptodaily.co.uk/2024/01/signet-talismans-new-multisig-enterprise-workflow-solution-launches-private-beta",
    "description": "On January 30th, 2024, Signet announced the launch of their private beta. Known as the brainchild of the highly popular Talisman Wallet, Signet aims to enhance operations security, compliance, and efficiency in Web 3. Their private beta showcases their enterprise workflow management and Multisig solutions for on-chain organizations."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T09:23:35.000Z",
    "title": "Worldcoin Price Prediction 2024 – 2033: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T09:23:26.000Z",
    "title": "Coinbase and Ripple fuel PAC for crypto-friendly US policy",
    "url": "https://www.cryptopolitan.com/coinbase-fuel-pac-for-crypto-friendly-policy/",
    "description": "In a significant move ahead of the U.S. elections, major players within the cryptocurrency industry, including Coinbase, Andreessen Horowitz (a16z), Electric Capital, and Ripple, have collectively funneled tens of millions of dollars into the Fairshake political action committee (PAC). Their collective goal is to support candidates favorable towards the crypto sector, aiming to influence U.S. [&#8230;]"
  }
]