[
  {
    "source": "CoinDesk",
    "date": "2024-03-13T13:00:00.000Z",
    "title": "PancakeSwap Decentralized Exchange Unveils Version 4 to Make Trading More Efficient",
    "url": "https://www.coindesk.com/tech/2024/03/13/pancakeswap-decentralized-exchange-unveils-version-4-to-make-trading-more-efficient/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The platform is adding  four features designed to make trading faster, cheaper and more customized."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-13T12:45:58.000Z",
    "title": "Toncoin Rises 61% in Two Days as Telegram Eyes Potential IPO",
    "url": "https://www.coindesk.com/business/2024/03/13/toncoin-rises-61-in-two-days-as-telegram-eyes-potential-ipo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "While officially separate, Telegram endorsed Ton Network as its blockchain of choice in September."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-13T13:05:20.000Z",
    "title": " India plans faster stock settlements to slow down crypto migration ",
    "url": "https://cointelegraph.com/news/india-faster-stock-market-settlements-slow-crypto-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYmYzMjI5N2YtNzU3OC00MmQ5LTk0ZWYtNWQ2ZTAyOWQ3ZDdlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Indian stock market has been operating on a T+1 settlement cycle since 2021, which implies that all stock trades are settled the following day.</p>\n                    <p><p data-ct-non-breakable=\"true\">India will soon introduce a faster trade settlement mechanism for its stock market to improve competitiveness against investors’ growing inclination toward crypto exchanges.</p><p>On March 11, Securities and Exchange Board of India (SEBI) chair Madhabi Puri Buch <a href=\"https://www.youtube.com/watch?v=UfUZcnY-Ys8\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its plan to introduce a T+0 trade settlement cycle by March 28. The service is optional for traders. Specifically catering to those looking for same-day settlement. </p><p>The Indian stock market has been operating on a T+1 settlement cycle since 2021, which implies that all stock trades are settled the following day. Similar to T + 0, the T + 1 settlement cycle was introduced in a phased manner.</p><p><a href=\"https://cointelegraph.com/news/india-faster-stock-market-settlements-slow-crypto-adoption\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-13T12:52:18.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">The European Union approved the world’s first legislation aimed at regulating artificial intelligence (AI). Bitcoin Fog founder Roman Sterlingov was convicted of money laundering. Meanwhile, major financial institutions completed a pilot test on the Canton Network blockchain.</p><p>The European Parliament <a href=\"https://www.europarl.europa.eu/news/en/press-room/20240308IPR19015/artificial-intelligence-act-meps-adopt-landmark-law\" target=\"_blank\" rel=\"noopener nofollow\">granted</a> final <a href=\"https://cointelegraph.com/news/eu-parliament-passes-landmark-ai-act\">approval</a> to the European Union’s artificial intelligence (AI) law — the EU AI Act — on March 14, which marks one of the world’s first set of comprehensive AI regulations. </p><p>The EU AI Act will govern the bloc of 27 member states to ensure that “AI is trustworthy, safe and respects EU fundamental rights while supporting innovation,” according to the EU Parliament’s website.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-13T12:48:23.000Z",
    "title": " Thailand approves personal income tax exemption for token earnings ",
    "url": "https://cointelegraph.com/news/thailand-tax-exemption-token-earnings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZTk1Yzk4MzItYjAwMC00NDc4LTgxNDYtNzUxMDA0NGUxMTk5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The tax measures aim to promote fundraising using investment tokens and establish the country as an investment hub.</p>\n                    <p><p data-ct-non-breakable=\"true\">The Thai government has approved tax breaks for individuals holding investment tokens in an effort to promote the use of investment tokens for fundraising. </p><p>On March 13, local media outlet Bangkok Post <a href=\"https://www.bangkokpost.com/business/general/2757523/tax-ruling-for-tokens-ratified\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the Thailand cabinet had approved the tax breaks for investment token holders. In the report, the director-general of Thailand’s revenue department, Kulaya Tantitemit, said that individuals who made a profit from holding investment tokens and had a 15% withholding tax deducted could exclude this income when calculating their personal income tax. </p><p>Tantitemit said that the tax measures, effective Jan. 1, aim to promote fundraising using investment tokens and establish the country as an investment hub. The government official believes that this move will boost the country’s economy by having positive effects on investment and employment in the region.</p><p><a href=\"https://cointelegraph.com/news/thailand-tax-exemption-token-earnings\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-13T13:00:34.000Z",
    "title": "Cosmos DeFi boosted as ‘rivals’ Osmosis and Astroport collaborate on programmable liquidity pools",
    "url": "https://cryptoslate.com/cosmos-boosted-as-rivals-osmosis-and-astroport-partner-to-deploy-programmable-liquidity-pools/",
    "description": "<p>Cosmos-based decentralized exchange Astroport is set to deploy its passive concentrated liquidity (PCL) pools on Osmosis, the largest Cosmos-based DEX by volume, following successful governance votes on both platforms. This move marks an alignment between two of the most active DEXes in the Cosmos ecosystem, aiming to improve the overall trading experience and capital efficiency [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cosmos-boosted-as-rivals-osmosis-and-astroport-partner-to-deploy-programmable-liquidity-pools/\">Cosmos DeFi boosted as &#8216;rivals&#8217; Osmosis and Astroport collaborate on programmable liquidity pools</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-13T12:59:11.000Z",
    "title": "TRON integrated with Amazon Web Services to Accelerate Blockchain Adoption",
    "url": "https://cryptoslate.com/tron-integrated-with-amazon-web-services-to-accelerate-blockchain-adoption/",
    "description": "<p>Geneva, Switzerland, March 18, 2024 – TRON DAO is glad to announce the integration with Amazon Web Services (AWS). This integration introduces the TRON Full Node on AWS, enabling users and developers to launch a TRON Full Node with unparalleled ease and efficiency. Seamless Full Node Deployment on AWS Through this integration, launching a TRON [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tron-integrated-with-amazon-web-services-to-accelerate-blockchain-adoption/\">TRON integrated with Amazon Web Services to Accelerate Blockchain Adoption</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-13T12:45:20.000Z",
    "title": "Ethereum Dencun upgrade day triggers surge in layer 2 protocol token value",
    "url": "https://cryptoslate.com/ethereum-dencun-upgrade-day-triggers-surge-in-layer-2-protocol-token-value/",
    "description": "<p>The imminent launch of the Ethereum Dencun upgrade at 14.00 UTC today, March 13, has sparked a notable surge in the prices of native tokens for layer-2 protocols, including Arbitrum, Polygon, and Optimism. According to CryptoSlate&#8217;s data, the sector has surged by approximately 5% in the last 24 hours, reaching a total market capitalization of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-dencun-upgrade-day-triggers-surge-in-layer-2-protocol-token-value/\">Ethereum Dencun upgrade day triggers surge in layer 2 protocol token value</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-03-13T13:05:20.000Z",
    "title": " India plans faster stock settlements to slow down crypto migration ",
    "url": "https://cointelegraph.com/news/india-faster-stock-market-settlements-slow-crypto-adoption",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYmYzMjI5N2YtNzU3OC00MmQ5LTk0ZWYtNWQ2ZTAyOWQ3ZDdlLmpwZw==.jpg\"></p><p>The Indian stock market has been operating on a T+1 settlement cycle since 2021, which implies that all stock trades are settled the following day.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-13T13:00:52.000Z",
    "title": "SynFutures Launches 500,000 USDB DeFi Trading Competition Following V3 Launch",
    "url": "https://cryptodaily.co.uk/2024/03/synfutures-launches-500000-usdb-defi-trading-competition-following-v3-launch",
    "description": "SynFutures Launches 500,000 USDB DeFi Trading Competition Following V3 Launch"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-13T13:09:26.000Z",
    "title": "Tensor Announces Launch Of New Governance Token $TNSR",
    "url": "https://cryptodaily.co.uk/2024/03/tensor-announces-launch-of-new-governance-token-tnsr",
    "description": "Solana-based NFT platform Tensor has announced the launch of its new token, TNSR, which will allow token holders to govern the protocol."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-13T12:42:58.000Z",
    "title": "ceτi AI Announces Successful Launch of Revolutionary Decentralized AI Infrastructure Token",
    "url": "https://cryptodaily.co.uk/2024/03/ceti-ai-announces-successful-launch-of-revolutionary-decentralized-ai-infrastructure-token",
    "description": "ceτi AI Announces Successful Launch of Revolutionary Decentralized AI Infrastructure Token"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T13:07:50.000Z",
    "title": "Giant Skull, Stig Asmussen’s New Venture, Unveils Ambitious Plans",
    "url": "https://www.cryptopolitan.com/giant-skull-stig-asmussens-new-venture/",
    "description": "In a significant announcement that has sent ripples through the gaming community, Stig Asmussen, renowned for his directorial prowess in titles like Star Wars Jedi: Fallen Order and God of War 3, has stepped into the spotlight once again. Asmussen has unveiled his brainchild, Giant Skull, a AAA studio poised to redefine the landscape of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T13:01:32.000Z",
    "title": "PropyKeys Officially Launches, Introducing Onchain Home Addresses as a New Asset Class",
    "url": "https://www.cryptopolitan.com/propykeys-officially-launches-introducing-onchain-home-addresses-as-a-new-asset-class/",
    "description": "Miami, FL, March 13th, 2024, Chainwire Now on Coinbase’s Layer-2 Base, PropyKeys aims to democratize real estate investing by enabling users to mint addresses and deeds onchain PropyKeys, a standout project within the Propy ecosystem known for its blockchain-powered real estate solutions, today announced the public launch of their innovative decentralized application (dApp) that enables [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:53:47.000Z",
    "title": "Spider-Man Fans Petition for Revival of The Great Web Multiplayer Game",
    "url": "https://www.cryptopolitan.com/spider-man-fans-petition-for-revival/",
    "description": "A leaked trailer for &#8220;The Great Web&#8221; multiplayer game has ignited a vigorous response from Spider-Man fans, prompting them to petition for its revival. The game, revealed in a massive gaming hack last year, showcased cooperative gameplay set in Insomniac&#8217;s Spider-Man universe. Despite being seemingly canceled during development, the leaked trailer has stirred up enthusiasm [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:49:27.000Z",
    "title": "ceτi AI Announces Successful Launch of Revolutionary Decentralized AI Infrastructure Token",
    "url": "https://www.cryptopolitan.com/ce%cf%84i-ai-announces-successful-launch-of-revolutionary-decentralized-ai-infrastructure-token/",
    "description": "Portland, Oregon, March 13th, 2024, Chainwire ceτi AI, a pioneering decentralized artificial intelligence infrastructure provider, is thrilled to announce the successful launch of its CETI token. Founded by a team of visionaries led by Dennis Jarvis (formerly of Bitcoin.com and Apple), ceτi AI is on a mission to democratize access to AI by building a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:47:53.000Z",
    "title": "Bitcoin ETF stalls as SEC flags first Trust SkyBridge plan",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-stalls-as-sec-flags-first-trust-skybridge/",
    "description": "The US Securities and Exchange Commission (SEC) has recently directed First Trust Advisors and SkyBridge Capital to consider their Bitcoin exchange-traded fund (ETF) application as abandoned. This directive came after the firms failed to respond to previous communications from the SEC regarding their registration statement. The notice was issued on a Wednesday, marking a significant [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:47:02.000Z",
    "title": "Next Stop $5? These Cryptocurrencies Are on the Rise",
    "url": "https://www.cryptopolitan.com/next-stop-5-these-cryptocurrencies-are-on-the-rise/",
    "description": "Cryptocurrencies are increasingly gathering momentum with the market painting a bullish picture. Amidst skyrocketing values, industry observers have their eyes on tokens potentially hitting the $5 landmark. Given this backdrop, several trending cryptos have caught investors&#8217; attention due to their promising rise and potential for higher gains. in the market. BlastUP Presale Exceeds $1 Million: [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:46:45.000Z",
    "title": "Explore 5 Underrated Cryptos on the Verge of a 500% Upswing!",
    "url": "https://www.cryptopolitan.com/explore-5-underrated-cryptos-on-the-verge-of-a-500-upswing/",
    "description": "Cryptocurrency discussions are heating up in global economic circuits, following the recent spike witnessed in digital asset valuations. In the midst of this exciting trend, there are certain crypto assets that remain lowkey, yet hold high potential. As the crypto environment further evolves, exploring these underrated cryptocurrencies can yield interesting insights. They might just be [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:46:42.000Z",
    "title": "Unlock the Best Low-cost Cryptos Aiming for a 400% Rise!",
    "url": "https://www.cryptopolitan.com/unlock-the-best-low-cost-cryptos-aiming-for-a-400-rise/",
    "description": "The global financial environment is rapidly shifting, with notable events suggesting a digitization of capital. The revolutionary potential sees an influx of investors to cryptos with high-yield aspirations. Among these, certain economical cryptos are targeted for an impressive 400% surge. The inevitable movement can provide a vivid panorama of the lucrative opportunities laying in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-13T12:46:11.000Z",
    "title": "BlackRock’s iShares Leads Charge: Bitcoin ETFs Hit $1 Billion Inflows!",
    "url": "https://www.cryptopolitan.com/blackrocks-bitcoin-etfs-billion-inflows/",
    "description": "Bitcoin exchange-traded Funds (ETFs) in the United States have reached an unprecedented milestone, with daily inflows hitting $1 billion for the first time.&#160; This investment surge indicates the growing interest and confidence in Bitcoin as an asset class among institutional investors.&#160; The influx of capital into Bitcoin ETFs has coincided with a notable bull run [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-13T12:43:25.000Z",
    "title": "Number Of Ethereum Short-Term Holders Increasing – Is A Bull Rally Next?",
    "url": "https://www.newsbtc.com/news/ethereum/number-of-ethereum-short-term-holders-increasing-is-a-bull-rally-next/",
    "description": "Ethereum (ETH) has been showing a solid performance lately, leaving investors both ecstatic and wary. The world&#8217;s second-largest cryptocurrency, boasting a market capitalization of nearly $480 billion, recently surpassed the coveted $4,000 mark for the first time since December 2021, igniting a flurry of bullish predictions. But is this a genuine resurgence, or are we witnessing a temporary blip before a potential correction? Related Reading: Cardano (ADA) Price Alert: Analyst Predicts 60% Rally In Next 7 Days Let&#8217;s dissect the forces at play. Proponents of a sustained uptrend point to a confluence of positive factors. The long-awaited approval of a US-based Ethereum ETF is a hot topic, with speculation swirling that a green light could trigger a significant influx of institutional capital, potentially injecting billions into the Ethereum ecosystem. Additionally, the upcoming Bitcoin halving, an event that cuts Bitcoin&#8217;s mining reward in half, is expected to have a positive spillover effect on the entire cryptocurrency market, potentially propelling Ethereum further. Surge In Short-Term Ethereum Holders Signals Optimism This optimistic outlook is bolstered by a surge in on-chain activity. Data from IntoTheBlock reveals a significant increase in the number of short-term Ethereum holders. Source: TradingView/IntoTheBlock Historically, this trend, with its 60% monthly price surge for ETH, aligns with bull markets, signifying an influx of new users entering the crypto space and actively participating in the network. Think of it as a crowded party &#8211; the more people show up (currently approaching the highs of the last bull cycle), the livelier the atmosphere becomes (and potentially the higher the price goes). But, there&#8217;s more to the story. A closer inspection of technical indicators paints a slightly different picture. The Relative Strength Index (RSI) and Chaikin Money Flow (CMF) are currently hovering in overbought territory, with RSI specifically nearing the 70 mark. Total crypto market cap is currently at $2.677 trillion. Chart: TradingView In simpler terms, this suggests that Ethereum&#8217;s price at slightly above $4,000 might be stretched a bit thin and due for a potential pullback. Imagine a jump rope competition &#8211; if you&#8217;re swinging too hard and fast (like an RSI over 70), eventually you&#8217;ll trip yourself up. Source: Coingecko Ethereum&#8217;s Future: Balancing Act Adding a layer of intrigue, the sentiment among investors seems geographically divided. While the &#8220;Coinbase Premium,&#8221; a metric reflecting buying pressure, is thriving in the US, its Korean counterpart indicates ongoing selling activity. Related Reading: Bitcoin Hodlers Eye Long Term: $520 Million BTC Go To Cold Storage This regional disparity could be attributed to diverse market dynamics and investor preferences. Perhaps American investors, with a green Coinbase Premium, are more optimistic about the regulatory landscape surrounding crypto, while their Korean counterparts, with a red Korea Premium, are taking a more cautious approach. So, what does this all mean for Ethereum&#8217;s future? The answer, unfortunately, isn&#8217;t as clear-cut as we&#8217;d like. The confluence of positive factors like potential ETF approval, increased network activity with a surge in short-term holders, and a potential Bitcoin halving boost paint a bullish picture. However, technical indicators hinting at an overbought market and contrasting investor sentiment across regions introduce a note of caution. Ethereum is currently walking a tightrope &#8211; will it maintain its momentum or face a reality check in the form of a price correction? It&#8217;s anybody&#8217;s guess. Featured image from Pixabay, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-13T13:00:47.000Z",
    "title": "Toncoin (TON) Surges to New All-Time High: Insights into the Rally’s Catalysts",
    "url": "https://www.crypto-news-flash.com/toncoin-ton-surges-to-new-all-time-high-insights-into-the-rallys-catalysts/?utm_source=rss&utm_medium=rss&utm_campaign=toncoin-ton-surges-to-new-all-time-high-insights-into-the-rallys-catalysts",
    "description": "<img width=\"1805\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Toncoin-TON-logo-with-price-trading-charts-in-the-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background.jpg 1805w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-1536x1021.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-450x299.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Toncoin-TON-logo-with-price-trading-charts-in-the-background-1200x798.jpg 1200w\" sizes=\"(max-width: 1805px) 100vw, 1805px\" />Toncoin (TON) staged an all-time high run to hit $4.45, surged by 20% in just 24 hours and 62% in 30 days. Analysts believe that the price is reacting to the recent report that Telegram would introduce an advertising platform. With the explosive run of the broad market pushing the total market cap to a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-13T12:40:25.000Z",
    "title": "Memeinator Raise Passes $6.5M as Presale Nears Final Stage",
    "url": "https://www.crypto-news-flash.com/memeinator-raise-passes-6-5m-as-presale-nears-final-stage/?utm_source=rss&utm_medium=rss&utm_campaign=memeinator-raise-passes-6-5m-as-presale-nears-final-stage",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Memeinator_PR_Images__1200x700_1710243195vAEbvKsv5c.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Memeinator_PR_Images__1200x700_1710243195vAEbvKsv5c.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Memeinator_PR_Images__1200x700_1710243195vAEbvKsv5c-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Memeinator_PR_Images__1200x700_1710243195vAEbvKsv5c-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Memeinator_PR_Images__1200x700_1710243195vAEbvKsv5c-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Memeinator_PR_Images__1200x700_1710243195vAEbvKsv5c-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, March 13th, 2024, Chainwire Memeinator is progressing towards the end of its ICO, having recently blasted past $6.5 million raised. Already in stage 19 of 20 and pricing in at $0.0276, the Memeinator team is optimistic that the presale is likely to sell out fast. The Memeinator storyline outlines how it&#8217;s been [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-13T13:01:27.000Z",
    "title": "PropyKeys Officially Launches, Introducing Onchain Home Addresses as a New Asset Class",
    "url": "https://coinedition.com/propykeys-officially-launches-introducing-onchain-home-addresses-as-a-new-asset-class/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/Screenshot_2024-03-12_at_102148_AM_1710264218olJQ6IQUfc-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Miami, FL, March 13th, 2024, Chainwire Now on Coinbase’s Layer-2 Base, PropyKeys aims to democratize real estate investing by enabling users to mint addresses and deeds onchain PropyKeys, a standout project within the Propy ecosystem known for its blockchain-powered real estate solutions, today announced the public launch of their innovative decentralized application (dApp) that enables [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/propykeys-officially-launches-introducing-onchain-home-addresses-as-a-new-asset-class/\">PropyKeys Officially Launches, Introducing Onchain Home Addresses as a New Asset Class</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-13T13:00:57.000Z",
    "title": "SynFutures Launches 500,000 USDB DeFi Trading Competition Following V3 Launch",
    "url": "https://coinedition.com/synfutures-launches-500000-usdb-defi-trading-competition-following-v3-launch/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/grand_prix_1710278118U3L5so3Kei-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Singapore, Singapore, March 13th, 2024, Chainwire SynFutures (https://www.synfutures.com), a leading decentralized derivatives exchange, today announced the Trading Grand Prix (TGP) Competition, setting a new record with the largest stablecoin prize pool ever offered in decentralized finance (DeFi) history. With 500,000 USDB in rewards, the competition marks a monumental milestone following the launch of SynFutures V3 [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/synfutures-launches-500000-usdb-defi-trading-competition-following-v3-launch/\">SynFutures Launches 500,000 USDB DeFi Trading Competition Following V3 Launch</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-13T12:49:17.000Z",
    "title": "ceτi AI Announces Successful Launch of Revolutionary Decentralized AI Infrastructure Token",
    "url": "https://coinedition.com/ce%cf%84i-ai-announces-successful-launch-of-revolutionary-decentralized-ai-infrastructure-token/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/ceti_feature_171031296161nVy8SVsj-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Portland, Oregon, March 13th, 2024, Chainwire ceτi AI, a pioneering decentralized artificial intelligence infrastructure provider, is thrilled to announce the successful launch of its CETI token. Founded by a team of visionaries led by Dennis Jarvis (formerly of Bitcoin.com and Apple), ceτi AI is on a mission to democratize access to AI by building a [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ce%cf%84i-ai-announces-successful-launch-of-revolutionary-decentralized-ai-infrastructure-token/\">ceτi AI Announces Successful Launch of Revolutionary Decentralized AI Infrastructure Token</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]