[
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T14:51:48.000Z",
    "title": "Nexo launches crypto Mastercard for EEA citizens",
    "url": "https://cointelegraph.com/news/nexo-launches-crypto-mastercard-eea-citizens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/31a5ca3f-cf31-46c5-bb0a-84029516e182.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The card is only available to citizens of the 30-country European Economic Area. </p>\n                    <p><p>Bulgarian decentralized lending platform Nexo has unveiled a crypto-powered debit and credit Mastercard for citizens of the European Economic Area (EEA).</p><p>According to the Aug. 31 announcement, the Nexo Card will allow users to spend their euro, U.S. dollar, and British pound stablecoins via debit transactions at over 100 million merchant terminals worldwide. Up to 9% in annual interest will reportedly be paid to stored balances.</p><p>Meanwhile, the Nexo Card's credit transactions use major cryptocurrencies, such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), as collateral, offering up to 2% cash back and interest rates of 16% per annum on used credit lines. Both debit and credit transactions directly convert users' crypto to fiat money when used at terminals. Nexo claims that custodied assets are insured by Ledger and Bakkt.</p><p>The firm also says that the new Nexo Card has no monthly or inactivity fees, no foreign exchange fees for up to 20,000 euros ($21,700) per month, and a limit of 10,000 euros ($10,800) in monthly ATM withdrawals. Upon passing Know Your Customer verification checks, a virtual card and a physical card will be issued; both can connect to Apple Pay and Google Pay. The card is only available to citizens of the 30-country EEA.</p><p>Earlier this year, Nexo's corporate offices in Sofia were <a href=\"https://cointelegraph.com/news/crypto-lender-nexo-wants-to-sue-bulgaria-after-office-raids\">raided by Bulgarian police</a> over allegations of violating sanctions and Anti-Money Laundering laws against Russia. The firm said it plans to sue the Bulgarian government for damages relating to the incident. Due to issues with the local government, Nexo does not provide services to residents in Bulgaria.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The future of <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> payments is here.<br><br>Introducing the world-first Dual Mode of our pioneering Nexo <a href=\"https://twitter.com/Mastercard?ref_src=twsrc%5Etfw\">@Mastercard</a>, featuring both credit and debit capabilities.<br><br>Experience the ease of debit coupled with the power of credit, earn rewards, and spend your way.  <a href=\"https://t.co/FuHNUrSRNO\">pic.twitter.com/FuHNUrSRNO</a></p>&mdash; Nexo (@Nexo) <a href=\"https://twitter.com/Nexo/status/1697225270837522588?ref_src=twsrc%5Etfw\">August 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\">Should we ban ransomware payments? It’s an attractive but dangerous idea</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T14:45:19.000Z",
    "title": "Bitcoin futures show renewed confidence amidst price surge",
    "url": "https://cryptoslate.com/bitcoin-futures-shows-renewed-confidence-amidst-price-surge/",
    "description": "<p>Earlier this week, Bitcoin broke above the $27,000 barrier on the news about Grayscale&#8217;s court victory against the SEC. The decision marks a pivotal win for Grayscale and carries profound ramifications for upcoming spot Bitcoin ETF applications. As highlighted by CryptoSlate earlier, the court&#8217;s verdict on this case might influence the outcome of several spot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-futures-shows-renewed-confidence-amidst-price-surge/\">Bitcoin futures show renewed confidence amidst price surge</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T14:58:58.000Z",
    "title": "Offchain Labs launches Arbitrum Stylus to expand smart contract development on Ethereum’s Layer 2 network",
    "url": "https://www.cryptopolitan.com/offchain-labs-launches-arbitrum-stylus-to-expand-smart-contract-development/",
    "description": "Offchain Labs has launched Arbitrum Stylus, a novel tool designed to expand the programming languages available for smart contract development on Ethereum&#8217;s Layer 2 network. This initiative aims to democratize access to Ethereum-compatible smart contract development by supporting languages that can be converted to WebAssembly (WASM), such as Rust, C, and C++. Before the advent ... <a title=\"Offchain Labs launches Arbitrum Stylus to expand smart contract development on Ethereum&#8217;s Layer 2 network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/offchain-labs-launches-arbitrum-stylus-to-expand-smart-contract-development/\" aria-label=\"More on Offchain Labs launches Arbitrum Stylus to expand smart contract development on Ethereum&#8217;s Layer 2 network\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T14:58:53.000Z",
    "title": "Best Twitter threads of the day – August 31st",
    "url": "https://www.cryptopolitan.com/best-twitter-threads-of-the-day-august-31st/",
    "description": "What happened in crypto in the last 24h? Why the next bull run of Bitcoin could be epic"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T14:56:17.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T14:51:20.000Z",
    "title": "Top crypto tweets of the day – August 31st",
    "url": "https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-31st/",
    "description": "Another angle to understanding how Bitcoin works US Courts are crumbling the entire SEC narrative on crypto Bitcoin is the most egalitarian thing ever Binance launches the Ordinals Inscription Service Worldcoin token price nosedives The inflation rate in the US goes up again Curve Finance launches on Base network US court rules that Bitcoin and ... <a title=\"Top crypto tweets of the day &#8211; August 31st\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-31st/\" aria-label=\"More on Top crypto tweets of the day &#8211; August 31st\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T15:02:34.000Z",
    "title": "XRP Price Prediction for 2023, 2024, 2025, 2030 and Beyond",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-for-2023-2024-2025-2030/",
    "description": "XRP has been one of the most controversial cryptocurrencies since its creation by Ripple Labs in 2012. Its close ties to traditional finance have alienated parts of the crypto community. However, it retains a loyal following for its fast and cheap transactions. This XRP price prediction guide examines the coin’s outlook using technical analysis methods. What is XRP? XRP is a cryptocurrency created by the Ripple payment network to facilitate fast cross-border payments. Ripple Labs founders Arthur Britto, David Schwartz, and Chris Larsen designed it to overcome Bitcoin&#8217;s scalability issues while enabling seamless transfers between different currencies. Some key features of XRP include: Speed  Settlement of XRP transactions takes 3-5 seconds, far faster than Bitcoin&#8217;s 10+ minutes. Low cost XRP transaction fees are a fraction of a penny, making it affordable for micropayments. Fixed supply The total supply of 100 billion XRP was created at launch, unlike Bitcoin&#8217;s limited issuance schedule. Bank partnerships Ripple has partnered with over 300 banks and financial institutions to use XRP for settlement. Controversies XRP has been mired in controversy regarding everything from centralization to securities classification. XRP is designed for use by financial institutions, though it trades publicly on exchanges. Its adoption rate will likely depend significantly on the outcome of Ripple&#8217;s ongoing SEC lawsuit. Factors Influencing XRP Price Numerous factors impact XRP prices, leading to high volatility: Ripple Company Developments and XRP Regulatory Status Ripple&#8217;s partnerships, service offerings, and legal issues have significant ramifications for XRP&#8217;s price action. For example, the SEC deeming XRP kept the asset from making new all-time highs during the 2020 and 2021 bull market in crypto. Now that Ripple has won the case against the SEC and a US judge deeming XRP not a security, new all-time highs could arrive during the next bullish cycle. Cryptocurrency Market Trends Like most altcoins, XRP&#8217;s price tends to follow Bitcoin&#8217;s price movements overall. When Bitcoin rises or falls sharply, so does XRP. Bitcoin itself has been struggling recently due to the US Federal Reserve raising interest rates. Mainstream Adoption XRP gaining transactional adoption from banks and payment providers would establish real-world utility and boost prices. But it faces stiff competition from private blockchains. Decentralization Efforts Lessening Ripple Lab&#8217;s control over XRP supply and the ledger through further decentralization could enhance XRP&#8217;s appeal and value to the crypto community. Burn Rate Ripple periodically burns XRP supply to manage circulation. Higher burn rates decrease available XRP which can positively impact prices. XRP Price History XRP&#8217;s price history has been defined by major announcements, partnerships, and controversies. 2012-2014: The Early Years XRP traded for a fraction of a penny initially. Prices remained relatively flat between $0.002 to $0.02 till 2017 as Ripple focused on building partnerships rather than exchanges. 2017: Crypto Bubble Peak As crypto mania peaked in late 2017, XRP saw massive speculative gains, rising from $0.006 in April to an all-time high of $3.84 in January 2018 &#8211; an incredible 63,000% return within 9 months! However, this meteoric rise was fueled by hype rather than fundamentals. XRP came crashing down as Bitcoin collapsed, declining over 90% within a year after the peak. 2018-2020: Building Products Between 2018-2020, XRP stayed afloat better than most altcoins, trading between $0.20 to $0.60 as Ripple doubled down on establishing real-world utility. Major developments included: Ripple launched On-Demand Liquidity (ODL) allowing financial institutions to use XRP for instant cross-border payments. Over 300 banks signed up for RippleNet to connect payment channels globally. Remittance firms including MoneyGram began using ODL for transferring funds. This suggested future adoption could be driven by Ripple&#8217;s offerings. 2021 &#8211; 2022: Legal Woes and a Bear Market Emerge After starting 2021 strongly with XRP exceeding $1 again thanks to crypto resurgence, Ripple was hit by an SEC lawsuit in December 2020 alleging XRP was an unregistered security. Many exchanges delisted XRP while its price collapsed due to negative sentiment. XRP failed to set a new all-time high while Bitcoin, Ethereum, Dogecoin, and several others as a result. Each of these other cryptocurrencies set a peak during this time, entering a bearish market in 2022. This lowered the chances of XRP making a recovery during the year. Recent XRP Price Action 2023 has been a difficult year for most cryptocurrencies, which are only starting to recover from the prolonged crypto winter. XRP, however, has outperformed most cryptocurrencies this year thanks to Ripple winning its legal battle with the SEC.  A US court judge ruled that XRP is not a security when sold to retail investors. This caused several exchanges to relist the asset, and prices spiked from under $0.50 to $1 in 48 hours after the decision. The SEC plans to appeal the decision, which prompted a full retrace of the rally. Now what’s next for XRP price? Short-Term XRP Price Prediction for 2023 With XRP fully retracing the SEC court case ruling rally, sentiment is back to scared across the crypto market. Combined with other altcoins setting new lows, investors are fearful that the bear market might return. XRP, however, could be performing a throwback retest of ascending triangle resistance turned support, which is common in financial markets. If support holds, price could ultimately approach over $1 in the next attempt.  Meanwhile, if price were to fall back through the bottom of the ascending triangle pattern, it would indicate failure and lead to a retest of bear market lows. Medium Term XRP Price Prediction for 2024 &#8211; 2025 If XRP can continue with its bullish market, then 2024 and 2025 could see the final move in the first major bull market sequence.  Elliott Wave Principle believes that bull markets move in what’s called a motive wave, which is a five-wave upward sequence, where odd numbered moves are in the direction of the primary trend, while even numbered moves move against the trend. Corrections are typically labeled as ABC, unless the correction is a triangle, in which it is labeled ABCD and E. More complex corrections can evolve over time. Triangles represent the consolidation before the final thrust in a sequence. Price projections put XRP above $10, between $14, and $17 depending on momentum and supporting environment. Long-Term XRP Price Prediction for 2030 XRP’s long term forecast is a lot more difficult to predict using traditional technical analysis techniques. In this case, we’ve chosen to draw a price mean through years of price action in an attempt to project a linear trend line. Peaks and troughs would occur above and below the mean, providing the potential for mean reversion trades. The trajectory puts XRP upwards of $20 per coin in the future if the mean line is accurate. XRP Price Prediction FAQs Let&#8217;s look at some commonly asked questions regarding XRP price forecasts: What was XRP&#8217;s lowest price? During its initial couple years after launch, XRP hit lows between $0.002 to $0.005. Its recent low was $0.24 in July 2022. What was XRP&#8217;s highest price? XRP&#8217;s all-time high was $3.84 reached in January 2018 during the crypto bubble. It also briefly exceeded $3.60 in the same time frame. How high can XRP realistically go? Based on its fundamentals and adoption risks, a realistic best-case high for XRP by 2025-2030 is likely in the $10 to $20 range if it gains widespread utility. Reaching triple digits appears very unlikely. Can XRP&#8217;s price crash to zero? If Ripple suffered an existential threat, XRP could potentially crash below $0.01. But delisting risks have reduced after a US court deemed XRP not a security, making a complete collapse improbable without a catastrophic event. Why is XRP price volatile? As a cryptocurrency exposed to speculative trading, XRP experiences high volatility from hype cycles and shifts in investor confidence amplified by its low liquidity relative to larger cryptos. When will XRP&#8217;s price stabilize? XRP volatility should stabilize and gravitate closer to currency-like fluctuations once it establishes a reliable demand baseline among commercial users and institutions. But this remains dependent on Ripple&#8217;s success. Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involves substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell any securities or cryptocurrencies. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T15:00:59.000Z",
    "title": "FTX Sam Bankman-Fried’s October Trial Date No Longer A Sure Thing",
    "url": "https://www.newsbtc.com/ftx/ftx-sam-bankman-fried-trial/",
    "description": "Disgraced FTX Founder Sam Bankman-Fried’s (SBF) trial is set to begin on October 3. However, a recent development suggests that his trial date could be pushed back.  Judge Kaplan Could Delay FTX Founder Trial Date According to a Reuters report, Judge Lewis Kaplan, the judge in charge of SBF’s case, said he could consider delaying the trial slated for October 3 to give SBF and his lawyers more time to review discovery documents and prepare their defense.  Related Reading: GBTC Shares See Volumes Climb To 2-Year High Amid Grayscale’s Victory Lap Judge Kaplan told SBF’s lawyers they could ask for a postponement if they needed more time. However, he clarified that there is no guarantee that he would grant it as the defendant must prove there is “a need” to postpone the trial date. To prove this, they must go beyond just stating the number of discovery materials they need to review. According to the Judge, there has to be “more meat on those bones.” A virtual hearing had taken place on August 30 to rule on the pending requests by the FTX founder&#8217;s lawyers. They had earlier asked that the government be precluded from using certain documents as evidence when the trial commences.  The defense counsel had alleged the government had produced “an additional 4 million pages of discovery” on August 24, which they believe their client won’t be able to finish reviewing before his trial begins. However, the judge denied this request, noting that the government had clarified that they would obtain information continuously.  Interestingly, before his bail was revoked, SBF had access to the Google documents, which form part of the documents the defense asks to be precluded as evidence. The judge stated that the defense’s alleged “deluge of documents” was “seriously exaggerated.” SBF and his lawyers will have to file a motion by the end of this week if they intend to ask for a postponement. The Judge also suggested that any postponement would likely move the trial date to March 11, 2024, subject to approval by the Bahamas government.  FTT token struggles at $1.033 &#124; Source: FTTBUSD on Tradingview.com Lawyers Ask For Temporary Release For Sam Bankman-Fried During the hearing, SBF’s lawyers asked for a temporary release for their client, stating that they had no faith in the provisions the government had made for SBF. Related Reading: Bitcoin Insider Trading Suspicions Take Root Following Grayscale Win, What’s Happening? Meanwhile, the prosecutors argued that they had made enough provisions for SBF as he had 70 hours a week to do discovery. Furthermore, his lawyers were allowed to visit him seven days a week, and they provided him with a laptop that he could use every day from about 8 AM to 7 PM Judge Kaplan stated he wasn’t going to rule on the defendant’s application just yet and asked for a joint report to be presented to him by September 5 as to the “exact situation” at the Brooklyn Metropolitan Detention Center (MDC) where SBF is being held. Featured image from Bloomberg, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T15:07:03.000Z",
    "title": "Crypto Analyst: Bitcoin and Ethereum Will Go Through Strong Correction Before Bull Run Starts Through Grayscale BTC ETF",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-bitcoin-and-ethereum-will-go-through-strong-correction-before-bull-run-starts-through-grayscale-btc-etf/",
    "description": "<img width=\"960\" height=\"641\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/btc-6272696_960_720-48x32.jpg 48w\" sizes=\"(max-width: 960px) 100vw, 960px\" />As Bitcoin faces rejection at its 200-DMA of $27,500, analysts maintain skepticism over the recent price recovery. As per the Elliot Wave Theory, Ethereum shows weakness on the technical chart with a probability of falling to $1,450. After the Grayscale court ruling earlier this week on Tuesday, Bitcoin and the broader crypto market staged a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T15:07:00.000Z",
    "title": "Frustrated Floki Inu (FLOKI) Investors Are Convinced This New Memecoin is the Key to Their Portfolio Recovery This Year",
    "url": "https://www.crypto-news-flash.com/frustrated-floki-inu-floki-investors-are-convinced-this-new-memecoin-is-the-key-to-their-portfolio-recovery-this-year/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-120.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-120.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-120-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-120-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Floki Inu&#8217;s start to the year looked like the ideal comeback from 2022&#8217;s bearish waves. The token recorded a 700% price surge in the first quarter, giving its investors hope for a bullish 2023. However, the Floki Inu (FLOKI) price has been underwhelming these past weeks, and frustrated investors are already casting around for options [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T15:01:56.000Z",
    "title": "Ripple Rival Stellar Leads the Way in Tokenization: Franklin Templeton and WisdomTree Issue $300M+ in Digital Funds",
    "url": "https://www.crypto-news-flash.com/ripple-rival-stellar-leads-the-way-in-tokenization-franklin-templeton-and-wisdomtree-issue-300m-in-digital-funds/",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Stellar has emerged as a strong contender in tokenized treasuries, outperforming Ethereum and Polygon. Stellar&#8217;s achievement of tokenizing assets worth over $300 million showcases its robust infrastructure and ability to convert real-world assets into digital tokens seamlessly.  According to a recent Reddit post, Stellar has made remarkable strides in the domain of tokenized treasuries are [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T14:57:00.000Z",
    "title": "Legal Battle Heats Up: DOJ Demands More Info on Bankman-Fried’s Defense",
    "url": "https://www.crypto-news-flash.com/legal-battle-heats-up-doj-demands-more-info-on-bankman-frieds-defense/",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The US DOJ wants more insight on the Defense-of-Counsel strategy from Sam Bankman-Fried. His legal team sees this as way forward in its current legal mess. The United States Department of Justice (DOJ) is demanding further elaboration regarding Sam Bankman Fried’s (SBF) intended utilization of the advice-of-counsel defense. This development stems from the ongoing legal [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T14:47:27.000Z",
    "title": "Ethereum (ETH) and Baby Doge Coin Price Crash; Pikamoon Is Born To Soar",
    "url": "https://www.crypto-news-flash.com/ethereum-eth-and-baby-doge-coin-price-crash-pikamoon-is-born-to-soar/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-119.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-119.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-119-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-119-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum and BabyDoge are in a downtrend, and their investors are bleeding cash. However, Pikamoon, a new hybrid meme coin, stands as a beacon to help investors recover losses on their portfolio and make massive profits before the end of 2023. In this article, we’ll delve into the price projections of both Ethereum and BabyDoge [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-31T14:55:00.000Z",
    "title": "Behind the Stablecoin Decline: Key Moves Dictating Market Changes",
    "url": "https://coinedition.com/behind-the-stablecoin-decline-key-moves-dictating-market-changes/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The stablecoin ecosystem is undergoing dynamic change, according to new analysis by on-chain data firm Santiment. Stablecoins, cryptocurrencies designed to maintain a steady value, have faced declining activity and supply in recent months. However, Santiment&#8217;s report reveals the key events and strategies shaping the market beneath the surface. Overall stablecoin circulation has trended downward since [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/behind-the-stablecoin-decline-key-moves-dictating-market-changes/\">Behind the Stablecoin Decline: Key Moves Dictating Market Changes</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]