[
  {
    "source": "Crypto Daily",
    "date": "2023-07-16T06:00:00.000Z",
    "title": "Polkadot Eyeing Resource Allocation Shifts For Parachains $DOT",
    "url": "https://cryptodaily.co.uk/2023/07/polkadot-eyeing-resource-allocation-shifts-for-parachains-dot",
    "description": "<p class=\"md-end-block md-p\">Polkadot's founder, Gavin Wood, has proposed a major shift in how the blockchain network allocates resources.</p>\n<p class=\"md-end-block md-p\">This initiative, referred to as Polkadot 2.0, reimagines the network's architecture as a conglomerate of sovereign chains connected by treaty-like 'accords.'</p>\n<p class=\"md-end-block md-p\">During the fourth Decoded conference, Wood illustrated his vision, likening Polkadot's journey of discovery to Ethereum's, another project he co-founded.</p>\nRethinking Polkadot's Infrastructure\n<p class=\"md-end-block md-p\">After launching Polkadot in May 2020, Wood transitioned from his CEO role at Parity Technologies to the network's chief architect in October 2022. Polkadot's core primitive, the parachain auctions, was not unveiled until November 2021, amidst the previous crypto bull market. The move caused a sharp price surge in Polkadot's native token, DOT, but later faced issues due to the competitive and fluctuating environment of parachain auctions.</p>\n<p class=\"md-end-block md-p\">From Parachains to Cores</p>\n<p class=\"md-end-block md-p\">Wood sees Polkadot as a multicore computer, with reserved cores for the parachains. However, the core of Polkadot 2.0's vision lies in a shift from a focus on chains to one on 'space' or resources that chains need. Wood highlighted the necessity of a more agile system, noting that the slot auction model, whcile appealing, presented both perceived and real barriers.</p>\n<p class=\"md-end-block md-p\">Under the proposed framework, 'core time' would be allocated via a marketplace. This marketplace would cater to both on-demand (instantaneous) and long-term (bulk) needs. Wood suggested that these monthly blocks of core time would be represented by NFTs, which can be fractionalized, letting owners of bulk time allocarte computation on a Polkadot core.</p>\n<p class=\"md-end-block md-p\">This means that all currently existing leases would continue under the new system, with the bulk pricing requiring initialization by governance.</p>\nShifting to an Application-Centric Model\n<p class=\"md-end-block md-p\">The Polkadot 2.0 proposal is all about application-centricity as opposed to chain-centricity. Wood pointed out that Polkadot is ultimately a platform for building applications for users, and these applications should ideally span across chains seamlessly, both from a user and developer perspective.</p>\n<p class=\"md-end-block md-p\">The robust nature of Polkadot's infrastructure allows deploying a pseudo network rather than just an application, which demands additional care regarding collators and network uptime. In some instances, it might be preferable to deploy smart contracts directly on cores, thus entirely bypassing the parachain concept.</p>\n<p class=\"md-end-block md-p md-focus\">The proposed Polkadot 2.0 initiative represents a significant evolution of the blockchain network, focusing more on resources (space) over chains. By redesigning its resource allocation model, Polkadot hopes to make the system more agile, with a focus on applications and user experience.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-16T06:00:46.000Z",
    "title": "Europe Expects Its First Bitcoin ETF This Month, Report",
    "url": "https://news.bitcoin.com/europe-expects-its-first-bitcoin-etf-this-month-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Europe Expects Its First Bitcoin ETF This Month, Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1150453745.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Europe’s first bitcoin exchange-traded fund (ETF) is set to launch in July after a 12-month delay caused by the crypto winter. The fund has been authorized in Guernsey, a more flexible jurisdiction, which will ostensibly help to avoid some of the regulatory challenges associated with the European Union. Europe to Have Its First Bitcoin ETF [&#8230;]"
  }
]