[
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T08:03:28.000Z",
    "title": " DeFi protocol Unizen to provide ‘immediate reimbursement’ after $2.1M hack ",
    "url": "https://cointelegraph.com/news/unizen-hack-immediate-refund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWFiNzE5NmEtMDU5Zi00ZWMxLWE5NzMtZjQ2YzhkNjI4MjdlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>DeFi protocol Unizen announced that it will issue an immediate refund to users who lost their funds to an exploit this weekend. </p>\n                    <p><p data-ct-non-breakable=\"true\">Decentralized finance (DeFi) protocol Unizen announced that it would reimburse its users who lost 750,000 or less “as soon as humanly possible” after the platform got compromised, losing about $2.1 million in user funds.</p><p>On March 9, blockchain analytics firm PeckShield <a href=\"https://twitter.com/peckshield/status/1766210445415727608\" target=\"_blank\" rel=\"noopener nofollow\">flagged</a> an “approve issue” with the DeFi platform, reporting that over $2 million had already been drained. The security firm urged users to revoke the approvals from the trade aggregator to avoid further loss. Security company SlowMist estimated the exploit losses to be around $2.1 million and noted that the attacker swapped the Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) for the stablecoin DAI (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>). </p><p>A day later, the DeFi protocol sent an on-chain message to the hacker, offering a 20% bounty in exchange for returning the remaining stolen funds. The protocol also said they are already working with law enforcement and forensic experts to determine the hacker’s identity. </p><p><a href=\"https://cointelegraph.com/news/unizen-hack-immediate-refund\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T07:49:12.000Z",
    "title": " How to buy and sell Bitcoin options ",
    "url": "https://cointelegraph.com/news/how-to-buy-and-sell-bitcoin-options",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzU5NjZhZjYtMTA3MC00NDQ3LWI0NGUtMWU5N2Y2YmQ2OTI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Discover how to speculate on Bitcoin’s price movements without owning the asset itself via Bitcoin options.</p>\n                    <p><p>Bitcoin options contracts are a type of derivatives contract that allows investors to speculate on Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price movements without owning Bitcoin itself. Bitcoin derivatives trading and investing in Bitcoin options are other routes that investors use to leverage the volatility of the cryptocurrency market. </p><p>In investing, a <a href=\"https://cointelegraph.com/news/two-sides-of-the-same-derivative-comparing-traditional-and-crypto-markets\">derivative</a> is a product or contract with a value determined by an underlying asset. Cryptocurrency derivatives include <a href=\"https://cointelegraph.com/learn/crypto-derivatives\">futures, options and perpetual contracts</a>. This basic Bitcoin options trading guide focuses solely on Bitcoin options, how investors trade them and some of the risks and strategies. </p><p>Here, a <a href=\"https://cointelegraph.com/explained/bitcoin-options-explained\">Bitcoin options contract</a> derives its value from Bitcoin. Investors engage in speculating or “hedging” on the price volatility of Bitcoin. A Bitcoin options contract allows a trader to buy or sell Bitcoin at a previously agreed time and date. </p><p><a href=\"https://cointelegraph.com/news/how-to-buy-and-sell-bitcoin-options\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T07:48:21.000Z",
    "title": " BTC price blasts through $70K — 5 things to know in Bitcoin this week ",
    "url": "https://cointelegraph.com/news/btc-price-blasts-through-70k-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMmIxYzAxYzEtMjY4ZC00MjIwLWEyMmQtNGI1NjVlMjc2YTAyLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin bulls waste no time attempting BTC price discovery after the highest weekly close in history.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) begins a new week with a wobble and fresh all-time highs as BTC price volatility stays firmly in charge.</p><p>The largest cryptocurrency has sealed its highest-ever weekly close, but bulls continue to face stiff resistance when it comes to breaking higher.</p><p>As the battle for price discovery rages, Bitcoin is caught in a familiar state of flux — selling pressure at key psychological price levels combined with the relentless bid from the spot exchange-traded funds (ETFs).</p><p><a href=\"https://cointelegraph.com/news/btc-price-blasts-through-70k-5-things-bitcoin-this-week\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T08:00:01.000Z",
    "title": "Dubai Police Introduce Virtual Autopsy Technology",
    "url": "https://www.cryptopolitan.com/dubai-police-virtual-autopsy-technology/",
    "description": "Dubai Police have ushered in a groundbreaking era of forensic investigation with the introduction of virtual autopsy technology, known as virtopsy. This innovative approach utilizes cutting-edge scanning and imaging technology facilitated by artificial intelligence (AI), marking a significant leap forward in crime-solving capabilities. Revolutionizing forensic medicine Maj. Gen. Ahmed Thani bin Ghalita Al Muhairi, Director [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T07:55:15.000Z",
    "title": "How Are States Faring in Enforcing AI Oversight Policies?",
    "url": "https://www.cryptopolitan.com/are-states-faring-in-enforcing-ai-oversight/",
    "description": "In an era where artificial intelligence (AI) permeates numerous aspects of daily life, from job applications to medical care decisions, the lack of government AI oversight regarding potential biases has become a pressing concern. States are now stepping up to fill this regulatory void, with lawmakers in at least seven states spearheading efforts to legislate [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T07:52:14.000Z",
    "title": "WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, SOL, XRP, ADA, And DOGE",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis/",
    "description": "Weekly crypto price analysis for major tokens such as Bitcoin( BTC),  Ethereum (ETH), Binance(BNB), Solana(SOL), XRP, Cardano(ADA), and Dogecoin(DOGE shows a promising outlook for the market. Most digital assets display a sideways trend, with bulls and bears struggling to gain control. However, several tokens have shown resilience with modest gains, suggesting a potential shift towards [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T07:45:52.000Z",
    "title": "Congressman Proposes Legislation for AI-Driven Financial Audits in DoD",
    "url": "https://www.cryptopolitan.com/congressman-proposes-for-ai-driven-in-dod/",
    "description": "In a bid to address the ongoing challenge of achieving a clean financial audit within the Department of Defense (DoD), Representative David Schweikert from Arizona has unveiled a groundbreaking proposal aimed at implementing an AI-driven financial audit. The proposed legislation, dubbed the Algorithms Utilized to Detect Institutional Transactions (AUDIT) Act, seeks to revolutionize the auditing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T07:44:50.000Z",
    "title": "Let’s talk about central banks and inflation – Who is actually winning the fight?",
    "url": "https://www.cryptopolitan.com/central-banks-and-inflation-who-is-winning/",
    "description": "Central banks in Europe and the U.S. are inching closer to a collective sigh of relief, hinting they might just have inflation, that relentless beast, on the back foot. With the new stats rolling in, there’s chatter about possible rate cuts come summer. This wishful thinking is actually backed by solid data pointing to a [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-11T08:01:00.000Z",
    "title": "Cardano’s Real World Adoption: UAE Embraces the Blockchain",
    "url": "https://coinedition.com/cardanos-real-world-adoption-uae-embraces-the-blockchain/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano_ADA_Is_Priced_“More_Aggressively,”_Report_Shows\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The United Arab Emirates (UAE), one of the richest countries in the world, has embraced Cardano to secure its criminal investigations. In a recent update shared by Chris O, the founder of the Cardano GhostFund DAO, UAE’s decision to adopt Cardano represents the blockchain’s “massive real-world adoption.” At the World Police Summit in Dubai, the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cardanos-real-world-adoption-uae-embraces-the-blockchain/\">Cardano’s Real World Adoption: UAE Embraces the Blockchain</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]