[
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T22:15:00.000Z",
    "title": "Aave proposal to freeze alleged Curve founder's loans draws controversy",
    "url": "https://cointelegraph.com/news/aave-proposal-to-freeze-alleged-curve-founder-s-loans-draws-controversy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/77707c2a-1b08-4cf5-a877-2aece171a9b8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The proposal suggests that a cap should be imposed on the use of CRV as collateral, preventing this wallet address from adding more loans.</p>\n                    <p><p>A June 12 AAVE (<a href=\"https://cointelegraph.com/aave-price-index\">AAVE</a>) proposal aimed at <a href=\"https://governance.aave.com/t/gauntlet-recommendation-to-freeze-crv-and-set-crv-ltv-0-on-aave-v2/13644\" target=\"_blank\" rel=\"noopener nofollow\">preventing</a> a particular account from accumulating more debt has led to controversy, with some participants arguing that the proposal violates the principle of censorship-resistance or “neutrality” in decentralized finance, or DeFi.</p><p>Some participants believe that the account is owned by Curve (CRV) founder Michael Egorov. Cointelegraph was not able to independently confirm who the account’s owner is.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Uhh seems like Curve’s founder has a $110m leverage position against his <a href=\"https://twitter.com/search?q=%24CRV&src=ctag&ref_src=twsrc%5Etfw\">$CRV</a> stack across all Defi.<br><br>If not repaid at some point (spoil: it prob won’t, my man is taking profit), this will cascade into a lot of bad debt for lending protocols <a href=\"https://t.co/kxwc0Sk65V\">https://t.co/kxwc0Sk65V</a> <a href=\"https://t.co/yhHp9JFWBV\">pic.twitter.com/yhHp9JFWBV</a></p>— vapor (@trading_vapor) <a href=\"https://twitter.com/trading_vapor/status/1668913321469157377?ref_src=twsrc%5Etfw\">June 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the proposal’s author, financial modeling platform Gauntlet, the Ethereum address 0x7a16ff8270133f063aab6c9977183d9e72835428 has accumulated $67.7 million worth of debt in US Dollar Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) and Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) through the AAVE V2 protocol using $185 million of Curve tokens as collateral. </p><p>Gauntlet expressed fears that this account may continue increasing its debt, leading to the risk that it may be liquidated if there is a sudden fall in the price of Curve. Compounding the problem in Gauntlet’s view is the fact that CRV has suffered a decline in liquidity over the past few months. This may cause slippage if the account gets liquidated, as there may not be enough buyers of CRV in the marketplace willing to take on such a large amount of tokens. </p><p>This may lead to millions of dollars in bad debt for AAVE, Gauntlet suggested.</p><p>AAVE user DecentMuse claimed that the wallet address “is tagged as belonging to the founder of Curve,” indicating that it may belong to Egorov. In DecentMuse’s view, the loan may represent a way for the founder to take profits from his entrepreneurial activities on behalf of Curve. Cointelegraph was not able to confirm the identity of the address’s owner.</p><p>In the proposal, Gauntlet suggested that the AAVE decentralized autonomous organization (AAVE DAO) should implement a patch to freeze any further uses of CRV as collateral for loans. This would allow the account to continue holding its current loan position, but would also prevent it from accumulating any further debt.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/bug-in-aave-v2-polygon-causes-some-assets-to-become-stuck-in-contracts\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bug-in-aave-v2-polygon-causes-some-assets-to-become-stuck-in-contracts/amp\"><strong>Bug in Aave v2 on Polygon causes some assets to become stuck in contracts</strong></a></p><p>Some forum participants supported the proposal and criticized the account for piling on so much debt. For example, a user who goes by the handle “AAVEBull” reportedly claimed that the account must have no intention of paying off its debts, since it has continuously added to its position as the token has declined in price.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/461fe14f-82a8-432a-8364-be346af48638.png\"></figure><p>In response, critics of the proposal defended the account. For example, user pray.eth stated that the account’s owner may simply believe CRV tokens are radically undervalued; leading them to believe that as the price declines, it makes sense to increase their use as collateral.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b92ed770-027d-4f15-a4a5-be9fd3d2cf26.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\">An Aave forum participant commenting on the matter | Source: Aave</figcaption></figure><p>Aave-Chan Initiative (ACI) founder Marc Zeller, who is a frequent participant in the forums, also weighed in on the proposal. He stated that AAVE DAO should be careful not to violate “the core ethos of DeFi, which is neutrality.” “The intention of users or what they do with their funds is not our primary concern,” Zeller stated, adding “Users should be free to utilize the protocol as they see fit.”</p><p>The proposal is listed as a “recommendation” as of June 16. This means that it has not yet been turned into a formal AAVE Improvement Proposal (AIP) that can be voted on by the DAO. The author has stated that turning it into a formal AIP is the proposal’s “next step.”</p><p>Participants in the blockchain ecosystem continue to debate the limits of censorship-resistance. In January, many Bitcoin users complained of high fees caused by other users minting and trading Ordinals. Some users <a href=\"https://cointelegraph.com/news/ordinals-protocol-sparks-debate-over-nft-s-place-in-the-bitcoin-ecosystem\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ordinals-protocol-sparks-debate-over-nft-s-place-in-the-bitcoin-ecosystem/amp\">wanted to ban ordinals</a>, while others saw a ban as censorship.</p><p>On April 11, Tether <a href=\"https://cointelegraph.com/news/tether-blacklists-validator-address-that-drained-mev-bots-for-25m\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/tether-blacklists-validator-address-that-drained-mev-bots-for-25m/amp\">blacklisted an address</a> that had drained $25 million from EVM front-running bots. Polygon co-founder Jaynti Kanani said the blacklisting established “a bad precedent” that could lead to more transactions being censored, while on-chain sleuth ZachXBT claimed that Tether may have been forced to engage in the act due to a court order. </p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/hyperbitcoinization-underway-rfk-seeks-bitcoin-donations-hodlers-digest/\">Hyperbitcoinization is underway, RFK seeks Bitcoin donations and other news</a></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T22:30:38.000Z",
    "title": "Arbitrum Airdrop Success: Metrics Soar Higher Across The Board",
    "url": "https://www.newsbtc.com/analysis/arb/arbitrum-airdrop-success-metrics-soar-higher-across-the-board/",
    "description": "Arbitrum, a popular blockchain platform, has shown promising results after its airdrop in March 2023. According to a report by Nansen, a blockchain analytics platform, every activity metric on Arbitrum has gone up compared to pre-airdrop days.  Related Reading: Bitcoin Holds $26,000: Why This Level Could Define Its Fate Arbitrum’s Airdrop Bucks Trend The report notes that since the airdrop, the daily count of transactions and users has remained consistently higher than the chain&#8217;s historical averages. On top of that, the value of transactions, transfers, and trades in United States Dollars (USD) has followed a similar pattern. Despite the initial surge in new wallets after the airdrop, the number of new wallets initiating their first transaction on Arbitrum has slowly declined over the two months. However, gas spending on Arbitrum has been on the rise, consistently maintaining higher levels than pre-airdrop. Nansen’s report notes that approximately 71% of the total 17,000 Ethereum (ETH) utilized for transaction fees on Arbitrum in the past 6 months was attributed to Layer 1. This indicates that Arbitrum maintains a significant share of bridging volume from Ethereum. At the same time, smaller entities such as Starkware, zkSync, PulseChain, and Across have gained a noticeable market share from March to May. The report also highlights the number of wallets initiating their first-ever transactions on Arbitrum, a proxy for the rate at which new users enter the ecosystem. The number of new users has consistently remained at higher levels after the airdrop, surpassing Optimism and closely approaching Ethereum. In addition, The report shows that 200,000 distinct wallets have chosen to delegate their voting rights to another 16,000 distinct wallets. The five largest wallets in terms of voting power belong to Treasure, delegate.l2beat.eth, olimpio.eth, PlutusDAO, and Griff Green collectively hold 49.7% of the Arbitrum voting Quorum. The report also tracks the on-chain activity of airdrop recipients on Arbitrum, noting that the proportion of transactions originating from airdrop recipients has decreased after the airdrop. It accounts for approximately 5% to 6% of transactions on both Arbitrum and Optimism. Despite this decline, the report shows that the number of daily active users, transaction count, and on-chain value on Arbitrum has stabilized at a level higher than before the airdrop. The upward trends in gas fee spending and the creation of new wallets also indicate a growing use of the platform. Arbitrum Enables Exclusive Access To Snoop Dogg&#8217;s Tour With NFT Pass Variety Magazine has reported that the famous rapper Snoop Dogg is launching an NFT pass on the Ethereum scaling network Arbitrum, allowing fans to join him virtually on his upcoming concert tour. The Snoop Dogg Passport NFT pass is priced at 0.025 ETH or $43. The Snoop Dogg Passport NFT pass promises exclusive access to updates from the rapper&#8217;s life on tour, including behind-the-scenes videos and images uploaded by Snoop and his team.  In addition, fans who buy the NFT pass will also receive free drops of curated works from select NFT artists and access to future Snoop Dogg drops, playlists, and the ability to buy merchandise and tickets to events. Related Reading: Crypto Market Bleeds As SEC Pressures Mount, Is It Time To Buy? This move by Snoop Dogg highlights the increasing adoption of blockchain technology in the music industry and the potential for NFTs to revolutionize how artists engage with their fans. Overall, the Snoop Dogg Passport NFT pass is an exciting new development in NFTs and blockchain technology, providing fans with unique and exclusive access to their favorite artists. As more musicians and artists explore the potential of blockchain technology, further innovation and development in this space can be expected. Featured image from Unsplash, chart from TradingView.com"
  }
]