[
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T20:15:00.000Z",
    "title": "Issuing digital euro, or ‘Cash+,’ is probably a duty, French central banker says",
    "url": "https://cointelegraph.com/news/banque-de-france-governor-issuing-digital-euro-probably-duty",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/fb169a56-03c8-4b80-8513-27c7269db4f1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>François Villeroy de Galhau tried to soft sell the proposed euro CBDC to commercial bankers, emphasizing collaboration and the CBDC’s advantages.</p>\n                    <p><p>The digital euro holds something in store for every stakeholder, Governor of the Banque de France François Villeroy de Galhau told commercial bankers on June 22. Disintermediation is not in the works, he <a href=\"https://www.banque-france.fr/en/intervention/building-together-future-proof-banking-and-payment-sector-europe\" target=\"_blank\" rel=\"noopener nofollow\">said</a> at the Global Official Institutions Conference hosted by French multinational bank BNP Paribas.</p><p>Before addressing the euro central bank digital currency (CBDC), Villeroy de Galhau began with an explanation of why the banking crisis earlier this year did not affect the eurozone. He credited European regulation and supervision for keeping its banking system safe. He noted, however, that the acquisition of Credit Suisse by UBS “raised new questions” about reliable crisis resolution. “The framework for the ECB to provide ‘Eurosystem resolution liquidity’ has yet to be built,” he said.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/france-on-the-verge-of-passing-stringent-crypto-firm-licensing-laws\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/france-on-the-verge-of-passing-stringent-crypto-firm-licensing-laws/amp\">France on the verge of passing stringent crypto firm licensing laws</a></em></strong></p><p>Villeroy de Galhau’s tone became more cajoling as he pivoted to the “less consensual ground” of the digital euro. He asked rhetorically, “As everything is becoming digital, why should central bank money be the only thing to remain in paper?” </p><blockquote class=\"twitter-tweet\"><p lang=\"fr\" dir=\"ltr\">️ François Villeroy de Galhau :  \"Notre engagement est de ramener l’<a href=\"https://twitter.com/hashtag/inflation?src=hash&ref_src=twsrc%5Etfw\">#inflation</a> à 2% d’ici fin 2025, qui est la bonne température de l’<a href=\"https://twitter.com/hashtag/%C3%A9conomie?src=hash&ref_src=twsrc%5Etfw\">#économie</a>, comme 37° est la bonne température du corps\". <a href=\"https://t.co/SEdiuedj8u\">pic.twitter.com/SEdiuedj8u</a></p>— Banque de France (@banquedefrance) <a href=\"https://twitter.com/banquedefrance/status/1669380887698350083?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The e-euro will be a digital banknote, or ‘Cash+,’” he continued. Its use will be optional, but it will have the advantage of allowing the use of central bank money in e-commerce. Without it, a crisis of trust would arise “sooner or later.” But the digital euro will not lead to disintermediation, according to Villeroy de Galhau, as: </p><blockquote>“We central banks have absolutely no intention to open private accounts.” </blockquote><p>Wholesale CBDC is also a joint undertaking, Villeroy de Galhau said. Commercial and central banks share the goals of “fostering tokenised finance and tokenised securities; facilitating cross-border interoperability.” Not only would the digital euro not be a competitor to commercial bank money, it will help resist “giving ground to so called ‘stablecoins’ probably issued by non-European players.” In fact:</p><blockquote>“It’s very probably our duty to issue a CBDC, but it’s our will to issue it with you, commercial banks, and not against you.”</blockquote><p>The digital euro would be rolled out gradually beginning in 2027 or 2028, if approved by the European Central Bank Governing Council, Villeroy de Galhau said.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\">Bitcoin in Senegal: Why is this African country using BTC?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  }
]