[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T22:42:40.000Z",
    "title": "Prediction Market Kalshi Sues U.S. CFTC for Denying Its Contracts for Congressional Elections",
    "url": "https://www.coindesk.com/policy/2023/11/01/prediction-market-kalshi-sues-us-cftc-for-denying-its-contracts-for-congressional-elections/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Prediction market Kalshi is suing the U.S. Commodity Futures Trading Commission (CFTC) for denying its effort to list derivatives for betting on the outcome of political events – specifically which party will control each chamber of the U.S. Congress after an election."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-01T22:51:44.000Z",
    "title": "What’s Driving the Solana Rally?",
    "url": "https://decrypt.co/204048/solana-rally-price-why",
    "description": "Solana fell to as low as $8 after the collapse of FTX. It's now up over 80% in the last 30 days. What gives?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T22:53:19.000Z",
    "title": "Bitcoin beyond 35K for Christmas? Thank Jerome Powell if it happens",
    "url": "http://cointelegraph.com/news/bitcoin-beyond-35k-christmas-thank-jerome-powell",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/40d4a390-5c64-4db3-9db2-f65f665a40ed.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Led by Chairman Jerome Powell, the Federal Reserve has halted the rise of interest rates. Will it be enough to fuel the surging market through Christmas?</p>\n                    <p><p>Historically, a Santa rally happens in the weeks leading up to Christmas when a collective sense of goodwill bleeds into equity markets. This is typically a seasonal blip and nothing to write home about. But this year, we could see a far more significant rally as the United States Federal Reserve, the <a href=\"https://cointelegraph.com/news/bitcoin-spot-etf-deny-rug-pull-gary-gensler-sec-bloomberg-analysts\">Securities and Exchange Commission</a> and <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">BlackRock</a> line up to deliver a bonanza of holiday cheer.</p><p>The Federal Open Market Committee (FOMC) finished its penultimate meeting of 2023 on Wednesday, and it decided to hold interest rates steady. As we know, U.S. inflation has been tamed from a high of 9.1% in June 2022 to its current level of 3.7% thanks to the Fed’s aggressive interest rate hiking cycle that brought the Federal Funds Rate to 5.25-5.5% — its highest level since 2001.</p><p>However, while this campaign has been unquestionably successful, markets remain deeply concerned about the potential of higher rates, or even rates sustained at this level, to trigger a recession in the U.S. The Fed also now shares these concerns as it softens to some degree against inflation.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-evolving-multi-asset-network\"><strong><em>Bitcoin is evolving into a multiasset network</em></strong></a></p><p>Should the next Bureau of Labor Statistics inflation reading on Nov. 14 show a move downward, we can expect to see money flooding into risk assets as investors anticipate the next interest rate decision to be a cut. This will, of course, have a positive impact on equity markets, and even bond markets as yields fall and the back end of the yield curve flattens.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">GUNDLACH: THINK CPI WILL COME DOWN BASED ON INFLATION MODEL</p>&mdash; *Walter Bloomberg (@DeItaone) <a href=\"https://twitter.com/DeItaone/status/1719799872847593485?ref_src=twsrc%5Etfw\">November 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Crypto markets will follow suit, with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) remaining strongly correlated to main markets. What will provide an extra shot in the arm, though, will be the approval of the first U.S.-based Bitcoin spot ETF — which is likely to come before Jan. 10, as J.P. Morgan predicts. This is underlined by the excitement that rumors of the approval of BlackRock’s application have generated over the past few weeks, which sent Bitcoin back up to $35,000: a level it hasn’t enjoyed since the pre-Terra Luna days of 2022. </p><p>Eventual approval will provide further impetus for Bitcoin, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), and large swathes of altcoin markets. However, if investors are following the old adage, “buy the rumor, sell the fact”, it may not be huge. We might even see a small dip before a more sustained rally. There is little doubt, however, that approval will be positive for cryptocurrency. Indeed, longer-term it has the potential to be the greatest driver of crypto markets since the conditions created by the Covid pandemic saw BTC top $60,000 in 2021.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-trial-telling-story-classic-financial-deceit\"><strong><em>Sam Bankman-Fried’s trial is telling a story of classic financial deceit</em></strong></a></p><p>Potential spanners in the works include higher inflation in the U.S. before the end of the year, and potentially a ramping up of tensions between Israel and Palestine. Either of these could put the brakes on an end-of-year Santa rally — but that does not seem to be the direction of travel right now. </p><p>Indeed, Bitcoin has already enjoyed quite a rally this year. While the fallout from the FTX crash in November 2022 saw BTC<a href=\"https://cointelegraph.com/news/bitcoin-sinks-to-new-yearly-low-at-16-8k-as-ftx-insolvency-fears-turn-into-contagion\"> fall to the $15,000 range </a>and start 2023 at a paltry price of slightly more than $16,000, its level today of $34,000 to $35,000 represents growth of more than 100%. Of course, it’s only the very smart or lucky traders who ever manage to take advantage of Bitcoin’s extreme volatility. Year-on-year, many crypto investors are still nursing losses. </p><p>For FTX investors, for example, while there are now hopes some will get their Bitcoin, Ether, and other tokens back, most will face somewhat of a Pyrrhic victory as they stare down the barrel of 60% to 70% losses. This accounts for the generally pessimistic mood in the crypto market, which would otherwise look like the winner of 2023. </p><p>As we approach the end of the year, then, it would do all of us well to take a step back and view Bitcoin and crypto markets with fresh eyes. Even if we don’t get a much anticipated and, perhaps, deserved Santa rally, we can celebrate the fact that crypto has survived another challenging year and is ending on a high.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lucas Kiely </strong>is chief investment officer of Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-01T23:00:39.000Z",
    "title": "Earn Network Unveils Restaking Category: A New Feature to Compound Your Delegation Gains",
    "url": "https://news.bitcoin.com/earn-network-unveils-restaking-category-a-new-feature-to-compound-your-delegation-gains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/untitled-1.png 800w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. The Earn Network introduces yet another category to its community-driven marketplace &#8211; Restaking. This cutting-edge feature comes on the heels of successful launches in both DeFi Staking and NFT Staking and is designed to amplify the yield on digital assets. What is Restaking? Restaking involves the reinvestment of staking rewards back into the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T23:00:34.000Z",
    "title": "Bitcoin Ends October On A High Note, What To Expect For BTC Price In November",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-btc-price-in-november/",
    "description": "The month of October just drew to a close and Bitcoin and the rest of the crypto market has ushered in the new month of November. With October proving to be an incredibly bullish month for Bitcoin with a green monthly close, eyes are now on the new month and what possibilities it could hold for the digital asset. October Was A Good Month For Bitcoin Looking back to the month of October, it has been one of the best months so far for 2023. The price of BTC started out at around $28,000 and closed out the month above $34,000. In total, the return for Bitcoin in the month of October was 28.5%. Related Reading: Cardano Bearish Signal: Dormant ADA Whales Are On The Move In comparison to the previous months, only one month has surpassed October and that was the month of January. Bitcoin also benefited from a green price close in the month of September, albeit with meager gains of 3.99%. 2023 has also turned out to be a year of good returns with six months out of the last 10 months closing in the green. The months of August, May, and July were the only months with significant losses of 11.2%, 7.1%, and 4.04%, respectively. While February closes out with small losses of -0.01%. BTC retraces after flash surge &#124; Source: BTCUSD on Tradingview.com How November Is Looking For BTC Price The first day of November is already starting out with losses for the price of BTC but it is still early for the digital asset to pick back up. Historically though, especially over the last five years, Bitcoin has recorded poor performance in the month of November. In 2022, the infamous FTX crash took the Bitcoin price from above $21,400 to below $16,000, and the month ended with 16.1% losses. The same was the case for the previous year in 2021 when the crypto bull market began to wind down. That month ended up with a red close of -7.12%. 2020 was different in the fact that Bitcoin saw a 42.9% increase in November, which was the year the bull market began. But 2023 is more closely similar to the year 2019 because they’re both the year before the Bitcoin halving takes place and November suffered losses in 2019. Related Reading: Shiba Inu Burn Rate Nosedives Following 7,700% Jump, What Happened? If Bitcoin keeps to the November trend similar to 2019, then it is possible that the digital asset will reverse its October gains this month. A 17% decline would mean a fall back to the $28,000 level, which would wipe around $6,000 off its current value. However, Bitcoin has been known to buck historical trends in various cases, so there could be a change in the trend. For example, in 2015, the year before the 2016 Bitcoin halving, Bitcoin price saw a 19.8% increase by the time November was over. This shows that nothing is set in stone when it comes to Bitcoin. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T23:02:00.000Z",
    "title": "Turkey Plans Fresh Crypto Legislation to Ease FATF Concerns",
    "url": "https://coinedition.com/turkey-plans-fresh-crypto-legislation-to-ease-fatf-concerns/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Turkey Plans Fresh Crypto Legislation to Ease FATF Concerns\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Crypto-regulation-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Turkish Finance Minister, Mehmet Simsek, on Tuesday said the country plans to introduce fresh crypto-assets legislation to improve its standing before the Financial Action Task Force (FATF). The FATF had, in 2021, added Turkey to the “grey list” for failing to address concerns about money laundering and terror financing.&#160;&#160; The planned crypto legislation will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/turkey-plans-fresh-crypto-legislation-to-ease-fatf-concerns/\">Turkey Plans Fresh Crypto Legislation to Ease FATF Concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]