[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:19:49.000Z",
    "title": "I regolatori finanziari ribadiscono la richiesta di una legislazione per affrontare i rischi legati alle criptovalute",
    "url": "https://www.coindesk.com/it/policy/2023/12/14/financial-regulators-reiterate-call-for-legislation-to-address-crypto-risks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Il Congresso deve approvare leggi riguardanti le stablecoin e i mercati spot non finanziari, ha affermato il Financial Stability Oversight Council nel suo ultimo rapporto annuale."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:19:49.000Z",
    "title": "Reguladores financeiros reiteram apelo por legislação para lidar com riscos criptográficos",
    "url": "https://www.coindesk.com/pt-br/policy/2023/12/14/financial-regulators-reiterate-call-for-legislation-to-address-crypto-risks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "O Congresso precisa aprovar leis que abordem stablecoins e mercados à vista não mobiliários, disse o Conselho de Supervisão da Estabilidade Financeira em seu último relatório anual."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:19:49.000Z",
    "title": "Les régulateurs financiers réitèrent leur appel à une législation pour lutter contre les risques cryptographiques",
    "url": "https://www.coindesk.com/fr/policy/2023/12/14/financial-regulators-reiterate-call-for-legislation-to-address-crypto-risks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Le Congrès doit adopter des lois concernant les marchés au comptant des pièces stables et des autres titres, a déclaré le Conseil de surveillance de la stabilité financière dans son dernier rapport annuel."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:19:49.000Z",
    "title": "Financial Regulators Reiterate Call for Legislation to Address Crypto Risks",
    "url": "https://www.coindesk.com/policy/2023/12/14/financial-regulators-reiterate-call-for-legislation-to-address-crypto-risks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Congress needs to pass laws addressing stablecoins and non-securities spot markets, the Financial Stability Oversight Council said in its latest annual report."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:15:19.000Z",
    "title": "Protocol Village : Metagood, derrière les NFT OnChainMonkey, lève un tour de table de 5 millions de dollars",
    "url": "https://www.coindesk.com/fr/tech/2023/12/14/protocol-village-metagood-behind-onchainmonkey-nfts-raises-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Les dernières mises à niveau technologiques blockchain, annonces de financement et accords. Pour la période du 14 décembre au 14 décembre. 20, avec des mises à jour en direct tout au long."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:15:19.000Z",
    "title": "Protocol Village: Metagood, dietro gli NFT OnChainMonkey, raccoglie un round di seed da 5 milioni di dollari",
    "url": "https://www.coindesk.com/it/tech/2023/12/14/protocol-village-metagood-behind-onchainmonkey-nfts-raises-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Gli ultimi aggiornamenti sulla tecnologia blockchain, annunci di finanziamenti e offerte. Per il periodo dal 14 dicembre al 14 dicembre. 20, con aggiornamenti in tempo reale ovunque."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T22:15:19.000Z",
    "title": "Protocol Village: Metagood, por trás dos NFTs OnChainMonkey, levanta rodada inicial de US$ 5 milhões",
    "url": "https://www.coindesk.com/pt-br/tech/2023/12/14/protocol-village-metagood-behind-onchainmonkey-nfts-raises-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "O que há de mais recente em atualizações de tecnologia blockchain, anúncios de financiamento e negócios. Para o período de 14 de dezembro a dez. 20, com atualizações ao vivo por toda parte."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T22:36:57.000Z",
    "title": " Don&#039;t get excited about Fed &#039;dovishness&#039; — another rate hike is in the cards ",
    "url": "https://cointelegraph.com/news/another-federal-reserve-rate-hike-in-the-cards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjcwYmIzOGEtOWY3NC00ODc5LWJkNDMtM2E2MGRlNjdmZmI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Contrary to Jerome Powell's intimations, inflation is likely to rise in the months ahead. If the Fed does not hike rates in 2024, the problem will get worse.</p>\n                    <p><p>December’s Federal Open Market Committee (FOMC) meeting was a huge boon for markets. Risk assets — including cryptocurrencies — soared as the central bank appeared to take a <a href=\"https://cointelegraph.com/news/what-does-fed-rate-pause-mean-for-crypto\">more dovish stance on monetary policy</a>. But the markets may be in for a nasty surprise in 2024 as the Federal Reserve faces an uphill battle against price increases, which may well force policymakers to hike again to reach their 2% inflation target.</p><p>The overwhelming expectation right now is that the Fed has won its battle against inflation. However, this is not what economic analysis shows. In fact, the recent slowdown in price growth is very likely to prove temporary — with inflation soaring again next month to finish the year around 3.5%, and remaining sticky well into 2024. This will be problematic for the central bank, whose dual mandate stipulates it must control prices while maintaining maximum employment. </p><p>So far, it has certainly succeeded with the latter. Unemployment remains at historically low levels, dropping from 3.9% in October to 3.7% in November. The economy added 199,000 jobs that month, beating analysts’ expectations. Wage growth also continued to outstrip inflation for the fifth month in a row in October, rising again to 5.7% after a brief hiatus.</p><p><a href=\"https://cointelegraph.com/news/another-federal-reserve-rate-hike-in-the-cards\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T22:31:40.000Z",
    "title": " Is OpenAI about to drop a new ChatGPT upgrade? GPT-4.5 screenshot &#039;leaked&#039; ",
    "url": "https://cointelegraph.com/news/open-ai-chat-gpt-upgrade-gpt-4-5-screenshot-leaked",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOTA3MjFlMjQtMDA5Zi00NDllLWE2ZjQtMGRhZjliMzc4M2U5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A screenshot circulating on Reddit and X suggests that OpenAI could be releasing its latest large language model GPT4.5 soon.</p>\n                    <p><p>OpenAI's latest ChatGPT large language model, GPT4.5, could be launching sooner than expected. </p><p>A screenshot, which has been making the rounds on social media including X (formerly Twitter), shows a description of \"GPT 4.5\" which reads: </p><p>\"Our most advanced model brings multi-model capabilities across language, audio, vision, video and 3D, alongside complex reasoning and cross-model understanding.\"</p><p><a href=\"https://cointelegraph.com/news/open-ai-chat-gpt-upgrade-gpt-4-5-screenshot-leaked\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-14T22:10:03.000Z",
    "title": "Ledger resolves security flaw affecting dApps, $500k in user losses",
    "url": "https://cryptobriefing.com/ledger-resolves-security-flaw-affecting-dapps-damage-estimates-500k/?utm_source=feed&utm_medium=rss",
    "description": "The hardware wallet manufacturer traces the exploit's origins to a phishing attack targeting a former employee."
  },
  {
    "source": "NullTX",
    "date": "2023-12-14T22:10:40.000Z",
    "title": "WOO Token Experiences Impressive Surge Post Annual Report Disclosure",
    "url": "https://nulltx.com/woo-token-experiences-impressive-surge-post-annual-report-disclosure/",
    "description": "The value of the WOO token ($WOO) has surged following the publication of its annual report, unveiling significant accomplishments and ambitious plans for the future. Revealing key milestones, the annual report highlights WOO&#8217;s successful launch of its orderbook decentralized exchange (DEX), WOO Turkey, WOOFI Swap, and Multi-MM – marking a [&#8230;]"
  }
]