[
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T20:00:00.000Z",
    "title": "Bank of America Predicts PYUSD Won’t Be Easily Adopted",
    "url": "https://cryptodaily.co.uk/2023/08/bank-of-america-predicts-pyusd-wont-be-easily-adopted",
    "description": "<p>Bank of America reacts to the launch of PayPal&rsquo;s U.S. dollar-pegged stablecoin PYUSD and argues that the asset is not likely to be used widely, at least not in the short term.</p>\n<p>PayPal&rsquo;s recent groundbreaking announcement about the launch of its U.S. dollar-denominated stablecoin PYUSD has provoked its share of criticism around the world. While it does seem a significant step towards crypto adoption, some say that PayPal won&rsquo;t see much success any time soon.</p>\n<p>One of the U.S. largest banks, Bank of America, described the main reasons why PayPal USD is not likely to witness immediate adoption in its recent research report.&nbsp;</p>\nCompeting Against CDBCs\n<p>First of all, Bank of America&rsquo;s analysts Alkesh Shah and Andrew Moss explained that the PayPal&rsquo;s stablecoin might face intense competition on the market:</p>\n\n<p>&ldquo;Over the longer term, we expect PYUSD to experience additional adoption headwinds as competition from central bank digital currencies (CBDCs) and yield-bearing stablecoins increases.&rdquo;</p>\n\n<p>It is true that numerous countries are actively exploring central bank digital currencies (CBDCs) that could potentially compete with stablecoins as both are based on similar technologies and pegged to fiat currencies. Only this year, countries such as Brazil, South Korea, Russia, Japan, the UK, among others have reported new developments on the rollout of their CBDCs. There are speculations that the U.S. might also be working on its CBDC, even though some of the country&rsquo;s presidential candidates have claimed to be against it.</p>\nCompeting Against Other Stablecoins\n<p>Besides, there are many other stablecoins PYUSD will have to compete with. Yield-bearing stablecoins are now especially attractive to investors, according to Bank of America:</p>\n\n<p>&ldquo;Investors may have been fine holding non-yield bearing stablecoins, such as USDT and USDC, when rates were close to zero, but yield-bearing stablecoins will likely become increasingly available and attractive with short-term rates above 5%.&rdquo;</p>\n\nDealing with Regulatory Scrutiny&nbsp;\n<p>Finally, the analysts also suggested that PayPal could face regulatory troubles if traditional banks are banned from issuing stablecoins:</p>\n\n<p>&ldquo;Investors are likely indifferent to which stablecoins they hold as long as the stablecoins are perceived as safe and accessible on the largest trading platforms. We do not expect PYUSD&rsquo;s launch to lead to accelerated regulatory clarity, given the stablecoin&rsquo;s issuance does not alter systemic risk for traditional markets, but the stablecoin may face regulatory headwinds if non-banks are ultimately barred from stablecoin issuance.&rdquo;</p>\n\n<p>Only a day after PayPal had unveiled its stablecoin project, the U.S. Federal Reserve published new guidelines regarding the use of &ldquo;dollar tokens&rdquo; by American banks. According to the statement, in order to engage in any sort of activity linked to stablecoins, the U.S. banks will now have to receive a written supervisory non-objection from the Fed.</p>\n<p>Meanwhile, crypto scammers didn&rsquo;t wait long to try and profit from the big news and flooded decentralized exchanges with fake PayPal tokens.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T20:00:51.000Z",
    "title": "What Essential Features Should the Right AI Chatbot Have?",
    "url": "https://www.cryptopolitan.com/essential-features-right-ai-chatbot/",
    "description": "In today&#8217;s rapidly advancing digital age, AI chatbots have become integral to our daily workflows. With tech giants like Google, OpenAI, and Meta pushing the boundaries of language models, the capabilities of chatbots are continually expanding. But with many options available, how do you ensure you&#8217;re making the right choice? Here&#8217;s a deep dive into ... <a title=\"What Essential Features Should the Right AI Chatbot Have?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/essential-features-right-ai-chatbot/\" aria-label=\"More on What Essential Features Should the Right AI Chatbot Have?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T19:42:29.000Z",
    "title": "ChatGPT Becomes A Chemistry Assistant To Help Reshape Material Development, JACS Report",
    "url": "https://www.cryptopolitan.com/how-chatgpt-becomes-a-chemistry-assistant/",
    "description": "The process of developing novel materials demands significant time and effort, but a glimmer of hope is emerging for chemists as artificial intelligence (AI) steps onto the scene to alleviate this burden. In an innovative study, researchers have harnessed the power of a widely recognized AI model, ChatGPT, to tackle a labor-intensive task—scouring through scientific ... <a title=\"ChatGPT Becomes A Chemistry Assistant To Help Reshape Material Development, JACS Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-chatgpt-becomes-a-chemistry-assistant/\" aria-label=\"More on ChatGPT Becomes A Chemistry Assistant To Help Reshape Material Development, JACS Report\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T19:40:18.000Z",
    "title": "SEC delays decision on Cathie Wood’s ARK Invest Bitcoin ETF – Here’s why",
    "url": "https://www.cryptopolitan.com/sec-delays-decision-on-ark-invest-btc-etf/",
    "description": "From the very start, it was clear that the crypto industry won&#8217;t have fair play with the SEC. According to a Friday filing by the regulator, the U.S. Securities and Exchange Commission (SEC) has delayed a decision on whether to approve the spot bitcoin exchange-traded fund (ETF) of Cathie Wood&#8217;s Ark Investment Management (ARK). According ... <a title=\"SEC delays decision on Cathie Wood&#8217;s ARK Invest Bitcoin ETF &#8211; Here&#8217;s why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-delays-decision-on-ark-invest-btc-etf/\" aria-label=\"More on SEC delays decision on Cathie Wood&#8217;s ARK Invest Bitcoin ETF &#8211; Here&#8217;s why\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T20:00:02.000Z",
    "title": "Curve Finance Resurgence: 70% Of Stolen Funds Recovered, Redemption On The Horizon",
    "url": "https://www.newsbtc.com/news/curve-finance-resurgence-70-of-stolen-funds-recovered-redemption-on-the-horizon/",
    "description": "Curve Finance (CRV), a leading decentralized finance (DeFi) protocol, announced significant progress in its recovery efforts following a recent hack that resulted in losing $73.5 million across several projects within its factory pools.  The attack on July 30 exploited a critical security flaw known as a &#8220;reentrancy vulnerability,&#8221; allowing malicious actors to drain funds from Curve&#8217;s smart contracts. Curve Finance Commits To Restitution Process For Hacked Funds In a significant effort, Curve Finance has successfully retrieved 70% of the funds affected by the hack. While this achievement marks an important milestone, an active investigation is underway to recover the remaining balance and hold the perpetrators accountable. Related Reading: Kraken Surges Ahead In Altcoin Liquidity To Overtake Coinbase In US: Kaiko Understanding the gravity of the situation, Curve Finance has also taken proactive measures to ensure a fair and transparent distribution of the recovered funds to affected users. The protocol is diligently working to measure the respective shares of each impacted account, aiming to facilitate an equitable restitution process that prioritizes user protection and trust restoration. Curve Finance&#8217;s recovery efforts are further bolstered by their recent announcement of a $1.85 million bounty. This generous reward will be granted to anyone who can provide accurate information leading to the identification and apprehension of the attackers holding the remaining funds.  By offering this substantial bounty, Curve Finance actively encourages community participation and collaboration to expedite the investigation and bring the perpetrators to justice. Curve’s Post-Hack Safety Report Following a thorough investigation, Curve Finance discovered that the exploit primarily targeted the aleth, peth, mseth, and crveth pools.  The vulnerability stemmed from a bug within the vyper 0.2.15-0.3.0 version, which the protocol promptly identified as the root cause of the breach. By swiftly pinpointing the issue, Curve Finance was able to take immediate action to mitigate any further risk to its users. Related Reading: Regulatory Pressure Mounts On Worldcoin, Can WLD Price Recover? It is important to note that all other pools on Curve Finance have been confirmed as safe and unaffected by the exploit, according to Curve&#8217;s update. This assurance gives users the confidence to continue utilizing the platform, knowing that their funds remain secure within these pools. Alongside the technical remediation, Curve Finance collaborates with security experts, auditors, and the broader DeFi community to conduct thorough audits and implement additional security measures.  This collaborative approach aims to reinforce the protocol&#8217;s resilience and prevent similar incidents in the future. Overall, Curve Finance&#8217;s recovery of 70% of the hacked funds, coupled with its ongoing investigation and bounty initiative, underlines the protocol&#8217;s commitment to user protection and the broader DeFi community.  According to Token Terminal data, Curve Finance&#8217;s circulating market cap currently stands at $518.76 million, reflecting a decrease of 22.29% over the analyzed period.  The fully diluted market cap, which represents the potential future market value of the project, is estimated at $1.97 billion. Curve Finance&#8217;s total value locked (TVL), a crucial indicator of the protocol&#8217;s popularity and user engagement, currently amounts to $2.44 billion. Despite a decline of 35.19% over the analyzed period, Curve Finance maintains a substantial TVL, highlighting its significance within the DeFi landscape. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-11T20:00:02.000Z",
    "title": "Argentina’s Data Privacy Agency Investigating Controversial Crypto Project Worldcoin (WLD)",
    "url": "https://dailyhodl.com/2023/08/11/argentinas-data-privacy-agency-investigating-controversial-crypto-project-worldcoin-wld/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/data-agency-wld.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Argentina&#8217;s data privacy government agency is following in France and the United Kingdom&#8217;s footsteps by investigating the eye-scanning crypto project Worldcoin (WLD). The Agency of Access to Public Information (AAIP) says in a new press release it&#8217;s looking into how the Worldcoin Foundation collects, stores and uses personal data in Argentina. The agency&#8217;s new investigation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/11/argentinas-data-privacy-agency-investigating-controversial-crypto-project-worldcoin-wld/\">Argentina’s Data Privacy Agency Investigating Controversial Crypto Project Worldcoin (WLD)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-11T19:55:29.000Z",
    "title": "Crypto Analyst Breaks Down Bitcoin (BTC) and XRP, Doubles Down on Bull Run Prediction",
    "url": "https://dailyhodl.com/2023/08/11/crypto-analyst-breaks-down-bitcoin-btc-and-xrp-doubles-down-on-bull-run-prediction/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-scenarios-for-btc.jpeg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader says Bitcoin (BTC) is hovering just below a line that marks where the &#8220;party starts.&#8221; Crypto analyst Michaël van de Poppe tells his 663,100 X followers that the king crypto needs to break over the $29,800 line to take off. &#8220;Lower side of the range still holding up for Bitcoin.&#8221; BTC is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/11/crypto-analyst-breaks-down-bitcoin-btc-and-xrp-doubles-down-on-bull-run-prediction/\">Crypto Analyst Breaks Down Bitcoin (BTC) and XRP, Doubles Down on Bull Run Prediction</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]