[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T16:51:36.000Z",
    "title": "Police in Estonia and Kazakhstan Investigate Atomic Wallet Hack",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/13/police-in-estonia-and-kazakhstan-investigate-atomic-wallet-hack/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "CEO Konstantin Gladych told CoinDesk Atomic is cooperating with law enforcement after a $100 million exploit of the non-custodial wallet."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-13T16:44:34.000Z",
    "title": "U.S. Treasury Examining How Using Digital Dollars Could Be Kept Private",
    "url": "https://www.coindesk.com/policy/2023/06/13/us-treasury-examining-how-using-digital-dollars-could-be-kept-private/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As the Treasury Department studies a possible central bank digital currency, senior official Graham Steele says the effort is looking at privacy, but is also wary of CBDC run risks."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-13T16:43:40.000Z",
    "title": "‘The Industry Doesn’t Want the Answers.’ Josh Klayman on Coinbase and Binance",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/13/the-industry-doesnt-want-the-answers-josh-klayman-on-coinbase-and-binance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto lawyer isn’t buying the argument that the SEC refuses to give the industry “regulatory clarity.” Chair Gary Gensler has been quite clear over the last two years about what is and what isn't a security, she says."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T16:57:48.000Z",
    "title": "What's in the SEC's Hinman Emails and Do They Really Help Ripple?",
    "url": "https://decrypt.co/144404/whats-in-the-secs-hinman-emails-and-do-they-really-help-ripple",
    "description": "The emails about former SEC director Williiam Hinman's 2018 speech saying Ethereum is not a security have been released."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T16:54:47.000Z",
    "title": "eToro to Delist MATIC, MANA, DASH and ALGO for US Customers",
    "url": "https://cryptodaily.co.uk/2023/06/etoro-to-delist-matic-mana-dash-and-algo-for-us-customers",
    "description": "<p>Trading platform eToro announced on Monday that it would delist four crypto assets for its US customers, citing &ldquo;recent developments.&rdquo; </p>\n<p>On Monday, social investment platform eToro said it would delist four crypto tokens from its platform for US customers. The platform announced via Twitter that US customers will no longer be able to open new positions in Algorand (ALGO), Decentraland (MANA), Dash (DASH), and Polygon (MATIC) from July 12.</p>\n<p>The platform said, however, that customers will still be able to hold and sell existing positions in these tokens.</p>\n\n<p dir=\"ltr\" lang=\"en\">From 6:00AM ET on Wednesday July 12th, 2023, US customers will no longer be able to open new positions in Algorand (ALGO), Decentraland (MANA), Dash (DASH) and Polygon (MATIC). Customers can continue to hold and sell existing positions in these coins. (2/5)</p>\n&mdash; eToro US (@eToroUS) June 12, 2023\n<p>\n\n</p>\nSEC Action Leads eToro to Delist Four Tokens\n<p>eToro ended support for these tokens as part of an ongoing review process.</p>\n<p>The firm cited &ldquo;recent developments&rdquo; for the move, referring to the SEC&rsquo;s legal action against Binance and Coinbase.</p>\n\n<p>&ldquo;eToro has a framework in place which reviews the cryptoassets we offer in light of the rapidly evolving regulatory landscape. Due to recent developments, we will be making some changes to our crypto offering for US customers.&rdquo;</p>\n\n<p>In the lawsuit against Binance, the SEC called several popular crypto tokens unregistered securities. The suit named Cardano (ADA), Polygon (MATIC), Solana (SOL), Cosmos Hub (ATOM), Filecoin (FIL), Decentraland (MANA), Algorand (ALGO), The Sandbox (SAND), Coti (COTI), and Axie Infinity (AXS).</p>\n<p>The platform will only halt purchases for the four tokens mentioned and said it remains a supporter of crypto assets.</p>\n\n<p>&ldquo;We remain a supporter of crypto assets and believe in the importance of offering our users access to a diversified range of asset classes, which includes stocks, ETFs, and options. We are committed to working closely with regulators around the world to shape the future of the crypto industry and champion access for the ordinary investor.&rdquo;</p>\n\n<p>eToro&rsquo;s decision comes after its competitor Robinhood announced it would end support for ADA, SOL, and MATIC.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T17:03:41.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T17:03:09.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:53:13.000Z",
    "title": "U.S., Hong Kong to implement stablecoin regulations soon",
    "url": "https://www.cryptopolitan.com/us-hong-kong-stablecoin-regulations-soon/",
    "description": "As the world of finance increasingly migrates towards digital currencies, two major jurisdictions, Hong Kong and the U.S., are poised to implement regulatory frameworks for stablecoins within their respective economies. Navigating the complexities of digital currencies, these financial behemoths aim to balance innovation with risk mitigation, showcasing contrasting strategies for fostering growth and ensuring protection ... <a title=\"U.S., Hong Kong to implement stablecoin regulations soon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-hong-kong-stablecoin-regulations-soon/\" aria-label=\"More on U.S., Hong Kong to implement stablecoin regulations soon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:47:32.000Z",
    "title": "ICP price analysis: ICP shows bullish potential at $3.891",
    "url": "https://www.cryptopolitan.com/icp-price-analysis-2023-06-13/",
    "description": "ICP price analysis on June 13, 2023, an analysis of the price of Internet Computer (ICP) indicated a noticeable bullish trend, implying an upward trajectory for the cryptocurrency as a result of favorable momentum in the market. Over the span of several hours, the price of ICP demonstrated consistently high levels and experienced a sudden ... <a title=\"ICP price analysis: ICP shows bullish potential at $3.891\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-analysis-2023-06-13/\" aria-label=\"More on ICP price analysis: ICP shows bullish potential at $3.891\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:44:45.000Z",
    "title": "Americans don’t really like the idea of CBDC",
    "url": "https://www.cryptopolitan.com/americans-dont-really-like-the-idea-of-cbdc/",
    "description": "Despite the ubiquity of digital dollars in the form of credit cards, debit cards, and various digital platforms, Americans appear to be more hesitant when it comes to the concept of a Central Bank Digital Currency (CBDC), an asset that would bridge citizens and the central bank of the U.S. more directly. Shaky ground: American ... <a title=\"Americans don&#8217;t really like the idea of CBDC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/americans-dont-really-like-the-idea-of-cbdc/\" aria-label=\"More on Americans don&#8217;t really like the idea of CBDC\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T17:00:50.000Z",
    "title": "SEC emails show multiple officials examining ethereum in 2018",
    "url": "https://crypto.news/sec-emails-show-multiple-officials-examining-ethereum-in-2018/",
    "description": "Email correspondence from 2018 have uncovered that several officials within the US Securities and Exchange Commission (SEC) engaged in discussions regarding the classification of ETH as a security."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T16:43:22.000Z",
    "title": "Damus App must drop bitcoin tipping or face Apple app store removal",
    "url": "https://crypto.news/damus-app-must-drop-bitcoin-tipping-or-face-apple-app-store-removal/",
    "description": "Apple has issued a warning to the Damus app, which operates on the Nostr platform, urging it to align with Apple's guidelines or risk being removed from the App Store within a 14-day timeframe."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T17:00:05.000Z",
    "title": "SUI Defies Bear Market With 15% Rally, Is A Return To $1 Imminent?",
    "url": "https://www.newsbtc.com/altcoin/sui-defies-bear-market-with-15-rally-is-a-return-to-1-imminent/",
    "description": "Over the last 24 hours, SUI has put on a tremendous rally and has risen over 15% in this time period. With this rally, the altcoin has moved once more into bullish territory, which begs the question of whether SUI would be on its way back to $1 soon. SUI Crosses $0.7 After Rising Over 15% SUI returned to its bullish trend on Monday with a sharp recovery that saw its price rise quickly. The resulting surge in price saw the digital asset’s price rise above $0.7 after touching as low as $0.5 on Saturday. This over 15% rise also saw the altcoin dominate as one of the top gainers for the day. Related Reading: Bitcoin Miner Inflows To Exchanges Reach 2021 Levels As Bear Trend Persists SUI now contends for the top gainer spot with the likes of Luna Classic (LUNC) which has seen some significant upside over the last week, as well as FTM and XRP, which are being propelled forward by the release of the Hinman documents. The rise in price comes at a time when most of the market is still nursing loss with Bitcoin barely holding on to the $26,000 level. As such, this suggests some level of deviation on the part of the altcoin from the general market trend, which could point toward more upside to come. Is The Race To $1 Back On? Following its much-anticipated launch back in May 2023, the price of SUI traded well above the $1 price mark even as presale participants were able to sell their coins at a huge markup. However, the digital asset quickly lost footing above this level and dropped back down rapidly. SUI struggles to hold $0.7 &#124; Source: SUIUSD on TradingView.com The bear market brought on by regulatory headwinds affected the altcoin, sending it on an over 50% plunge over the course of two weeks. This saw its price fall to a new low of $0.5 last week before rallying back up above $0.7 on Monday. With this latest rally, it is possible that SUI could retest the $1 resistance but that depends on whether the bulls are able to keep momentum going. At the time of writing, the bears have already begun to take over the reins as SUI’s price has lost the $0.7 support. Related Reading: Crypto Investor Sentiment Refuses To Budge, But Can The Weekend Change This? Its market cap is fortunately 53% higher compared to the previous day which suggests there could be higher demand for the altcoin. However, it could also point toward selling pressure, which would explain the reversal over the last several hours. Nevertheless, bulls must reclaim and hold the $0.7 support if SUI is to make a return to the $1 level. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T17:06:21.000Z",
    "title": "Ripple CEO Brad Garlinghouse: Release of Hinman Documents “Was Well Worth the Wait” – Can It Drive XRP Price to $2? Report",
    "url": "https://www.crypto-news-flash.com/ripple-ceo-brad-garlinghouse-release-of-hinman-documents-was-well-worth-the-wait-can-it-drive-xrp-price-to-2-report/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-ceo-brad-garlinghouse-release-of-hinman-documents-was-well-worth-the-wait-can-it-drive-xrp-price-to-2-report",
    "description": "The unsealing of the Hinman documents today could be a major turning point in Ripple&#8217;s case against the SEC. Ripple CEO Brad Garlinghouse and Chief Legal Officer Stuart Alderoty believe that the Hinman documents will prove to be valuable and worth the 18-month fight to have them unsealed. June 13, the Hinman documents will finally [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-13T17:00:00.000Z",
    "title": "Jack Dorsey Discusses Elon Musk, AI Regulation on Breaking Points",
    "url": "https://coinedition.com/jack-dorsey-discusses-elon-musk-ai-regulation-on-breaking-points/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Discusses-Elon-Musk-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Jack Dorsey Discusses Elon Musk\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Discusses-Elon-Musk-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Discusses-Elon-Musk-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Discusses-Elon-Musk.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In an exclusive interview with the YouTube channel Breaking Points, former Twitter CEO Jack Dorsey elaborated on his recent endorsement of Robert F. Kennedy, Jr. as the Democratic nominee for the 2024 United States presidential elections. Dorsey highlighted Kennedy&#8217;s focus on peace, ending wars, and addressing critical issues such as regulatory capture and the military-industrial [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/jack-dorsey-discusses-elon-musk-ai-regulation-on-breaking-points/\">Jack Dorsey Discusses Elon Musk, AI Regulation on Breaking Points</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T16:55:59.000Z",
    "title": "Coinbase CEO Brian Armstrong Outlines Dream Regulatory Structure for Crypto, Says It’s Not Rocket Science",
    "url": "https://dailyhodl.com/2023/06/13/coinbase-ceo-brian-armstrong-outlines-dream-regulatory-structure-for-crypto-says-its-not-rocket-science/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase CEO Brian Armstrong is giving his version of what US crypto regulations should look like, just days after the U.S. Securities and Exchange Commission (SEC) sued the exchange. In a new interview with the Wall Street Journal, Armstrong details his dream regulatory structure for crypto in the US. According to Armstrong, the ideal regulatory [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/coinbase-ceo-brian-armstrong-outlines-dream-regulatory-structure-for-crypto-says-its-not-rocket-science/\">Coinbase CEO Brian Armstrong Outlines Dream Regulatory Structure for Crypto, Says It’s Not Rocket Science</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]