[
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T22:07:02.000Z",
    "title": "Bitcoin price falls below $26K in two-month lows for BTC",
    "url": "https://cointelegraph.com/news/bitcoin-price-falls-below-26k-in-two-month-lows-for-btc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d79de646-0727-42c7-a131-71e36469d0a5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The price of Bitcoin fell around 8% in just 10 minutes on Aug. 17, down to prices unseen since June. </p>\n                    <p><p>Bitcoin (BTC) dropped 8% in less than 10 minutes to temporarily fall under $26,000 after several downward days of price action.</p><p>BTC was hovering around $27,600 on Aug. 17 at 9:30 pm UTC time before tumbling more than 8% to $25,320 at the time of writing, according to CoinGecko.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d3ee3d8c-822a-4b84-b118-dbe271300694.png\"  /></figure><p>The fall has taken Bitcoin's market cap below $500 billion for the first time since June 16, and hit lows not seen since June 20.</p><p>Despite the dip, BTC is still up 60% since it entered 2023 at about $16,550.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-17T22:00:08.000Z",
    "title": "Bitcoin’s flat trend amid surging treasury yields signals potential price upheaval",
    "url": "https://cryptoslate.com/insights/bitcoins-flat-trend-amid-surging-treasury-yields-signals-potential-price-upheaval/",
    "description": "<p>Quick Take A striking parallel is observed in the price behavior of Bitcoin during the banking collapse in March 2023 and the current market conditions. Before the banking downfall, Bitcoin&#8217;s price remained relatively dormant, oscillating in the narrow band of $23,000 to $25,000. The collapse of SVB triggered a fall, pushing Bitcoin below the $20,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-flat-trend-amid-surging-treasury-yields-signals-potential-price-upheaval/\">Bitcoin&#8217;s flat trend amid surging treasury yields signals potential price upheaval</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-17T22:00:39.000Z",
    "title": "Canaan to Debut ‘Groundbreaking’ Bitcoin Mining Product at 10th-Anniversary Singapore Event",
    "url": "https://news.bitcoin.com/canaan-to-debut-groundbreaking-bitcoin-mining-product-at-10th-anniversary-singapore-event/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Canaan to Debut &#039;Groundbreaking&#039; Bitcoin Mining Product at 10th-Anniversary Singapore Event\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/btc-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shortly after Bitmain announced its intention to launch a new bitcoin mining rig at the 2023 World Digital Mining Summit (WDMS) in Hong Kong this September, Canaan, another mining machine giant, hinted at introducing a &#x201C;groundbreaking&#x201D; product poised to elevate the BTC mining sphere. Canaan&#x2019;s Big Reveal: Setting the Stage for a New Era in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T21:58:50.000Z",
    "title": "Dent Price Prediction 2023-2032: What is Driving DENT Prices?",
    "url": "https://www.cryptopolitan.com/dent-price-prediction/",
    "description": "Dent Price Prediction 2023-2032 The Network proposes tokenizing the mobile data Industry and creating a worldwide marketplace on Ethereum to sell and buy Mobile Data. Dent is an ERC20 token used to pay for mobile data globally using the eSIM (not unique to DENT, and the existing solutions are way better) as long as you ... <a title=\"Dent Price Prediction 2023-2032: What is Driving DENT Prices?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dent-price-prediction/\" aria-label=\"More on Dent Price Prediction 2023-2032: What is Driving DENT Prices?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T21:54:01.000Z",
    "title": "Group behind the Tornado Cash lawsuit loses to the US Treasury",
    "url": "https://www.cryptopolitan.com/tornado-cash-plaintiffs-lose-to-us-treasury/",
    "description": "A federal judge in Texas has sided with the United States Department of the Treasury by granting a motion for summary judgment in a lawsuit brought by six individuals sponsored by the cryptocurrency exchange Coinbase against Tornado Cash. The group of crypto investors and developers backed by Coinbase argued the U.S. Treasury Department abused its ... <a title=\"Group behind the Tornado Cash lawsuit loses to the US Treasury\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tornado-cash-plaintiffs-lose-to-us-treasury/\" aria-label=\"More on Group behind the Tornado Cash lawsuit loses to the US Treasury\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T22:04:28.000Z",
    "title": "US Fed takes action against bank linked to FTX’s Alameda Research",
    "url": "https://crypto.news/us-fed-takes-action-against-bank-linked-to-ftxs-alameda-research/",
    "description": "The Federal Reserve has taken action against Farmington State Bank, previously linked to FTX, following undisclosed business strategy shifts"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T21:49:13.000Z",
    "title": "Coinbase to delists USDT, DAI, and RAI for Canadians",
    "url": "https://crypto.news/coinbase-to-delists-usdt-dai-and-rai-for-canadians/",
    "description": "Coinbase, a crypto exchange, will discontinue the trading of USDT, DAI, and RAI stablecoins for its Canadian users from September 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T22:00:35.000Z",
    "title": "Will Bitcoin Volatility Continue? These Metrics Say Yes",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-volatility-continue-these-metrics-say-yes/",
    "description": "Bitcoin has observed some sharp price action today, and if data of these metrics is to go by, the asset may not be done being volatile just yet. Bitcoin&#8217;s Open Interest And Leverage Ratio Have Remained High As explained by an analyst in a CryptoQuant post, some metrics are forming a pattern that can lead to more volatility in the cryptocurrency&#8217;s price. These indicators are the open interest and the estimated leverage ratio. The &#8220;open interest&#8221; refers to the total amount of Bitcoin futures contracts that are open on all derivative exchanges. An increase in this metric suggests that the investors are opening more positions on the futures market right now, while a decrease implies some of them are closing their positions, or are getting liquidated. The other metric of interest here, the &#8220;estimated leverage ratio,&#8221; keeps track of the ratio between the open interest and the derivative exchange reserve (that is, the total amount of Bitcoin sitting in the wallets of these derivative platforms). What this metric tells us is the amount of leverage that futures users are opting for on average. High leverage can significantly increase the risk of a large number of contracts being liquidated, so whenever this metric has a high value, the market can become more probable to show high volatility due to violent liquidation events. Related Reading: Bitcoin Plunges To $28,500, Will This Historical Support Hold Again? Now, here is a chart that shows the trend in these two Bitcoin indicators over the past few days: Looks like both these metrics have observed high values in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin open interest and estimated leverage ratio had both been at relatively high values right before the plunge that the asset saw in the past 24 hours. In this sharp price plummet, the futures market naturally observed a high amount of liquidations, leading to the open interest registering some decrease. The metric, however, didn&#8217;t actually see that much of a cool down despite these liquidations, and it has now already reached back to the same levels it was at before the volatility. This would suggest that the futures market users have opened new positions since the mass liquidation event. While the open interest had gone down in this event, albeit briefly, the leverage ratio actually hadn&#8217;t budged even that much. Related Reading: Are Bitcoin Whales Selling? This Metric May Suggest So Rather, the indicator has only been going up, implying that the users opening up the new futures contracts are only opting for higher and higher amounts of leverage. Because of the open interest rebounding and the leverage ratio only trending higher, it would appear like a reasonable possibility that the Bitcoin price would observe more volatility in the near future. Such volatility can take the coin in either direction, but generally, the side of the market with the less amount of contracts is the more probable one. In the chart, the data for the &#8220;funding rates&#8221; is attached, which basically tells us whether the longs or the shorts are dominant in the futures market currently. The funding rates had been positive in the latest futures market overheat, as well as in the one seen earlier in the month, but following today&#8217;s long liquidations, the metric has turned negative. This may suggest that a liquidation event involving the shorts is more likely to happen next. BTC Price At the time of writing, Bitcoin is trading around $28,500, down 3% in the last week. BTC has plunged during the past 24 hours &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T22:01:23.000Z",
    "title": "Mysterious Shiba Inu Whale Abruptly Moves 4,657,881,590,632 SHIB Amid Launch of Shibarium Layer-2 Solution",
    "url": "https://dailyhodl.com/2023/08/17/mysterious-shiba-inu-whale-abruptly-moves-4657881590632-shib-amid-launch-of-shibarium-layer-2-solution/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/whale-pounces-on-shiba.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A mysterious Shiba Inu (SHIB) whale is suddenly moving trillions of SHIB as the project launches its new layer-2 scaling solution, Shibarium. New data from whale-surveying platform Whale Alert reveals that a deep-pocketed SHIB investor has abruptly shifted a staggering 4,654,881,590,632 tokens, worth about $40.7 million, from one unknown wallet to another unknown wallet. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/mysterious-shiba-inu-whale-abruptly-moves-4657881590632-shib-amid-launch-of-shibarium-layer-2-solution/\">Mysterious Shiba Inu Whale Abruptly Moves 4,657,881,590,632 SHIB Amid Launch of Shibarium Layer-2 Solution</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]