[
  {
    "source": "Decrypt",
    "date": "2023-09-26T09:25:40.000Z",
    "title": "Lawyers Again Urge Release for Bankman-Fried Ahead of Trial Date",
    "url": "https://decrypt.co/198733/lawyers-again-urge-release-bankman-fried-ahead-trial-date",
    "description": "A week from his trial, Bankman-Fried's lawyers have again requested his temporary release, citing the case’s complexity."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-26T09:30:26.000Z",
    "title": "ELI5:50 – Web3 liquid staking versus traditional bank savings explained",
    "url": "https://cryptoslate.com/eli550-web3-liquid-staking-versus-traditional-bank-savings/",
    "description": "<p>As the decentralization of finance continues to steer the course of modern financial systems, the interplay between traditional bank savings and web-based liquid staking is something most may not fully comprehend. Let&#8217;s break the topic down using the &#8216;Explain Like I&#8217;m 5&#8217; (ELI5) concept. ELI5: Liquid Staking in Web3 Imagine you&#8217;re at an arcade. You [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/eli550-web3-liquid-staking-versus-traditional-bank-savings/\">ELI5:50 – Web3 liquid staking versus traditional bank savings explained</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T09:31:16.000Z",
    "title": "AI-Powered Method Enhances Life Detection on Other Planets",
    "url": "https://www.cryptopolitan.com/ai-powered-method-enhances-life-detection/",
    "description": "In a significant stride for astrobiology, a team of researchers has introduced an innovative technique that employs artificial intelligence (AI) to distinguish whether a sample from another celestial body is biological or non-biological, with an impressive accuracy rate of 90%.&#160; Spearheaded by Professor Robert Hazen from the Carnegie Institution’s Geophysical Laboratory and George Mason University, ... <a title=\"AI-Powered Method Enhances Life Detection on Other Planets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-method-enhances-life-detection/\" aria-label=\"More on AI-Powered Method Enhances Life Detection on Other Planets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T09:24:05.000Z",
    "title": "Advertising Association Launches AI Taskforce to Promote Ethical and Transparent AI Usage in Advertising",
    "url": "https://www.cryptopolitan.com/advertising-association-launch-ai-taskforce/",
    "description": "In a significant development aimed at addressing the far-reaching impact of artificial intelligence (AI) on the advertising and marketing sector, the Advertising Association has introduced an innovative AI task force. This initiative seeks to foster a cohesive policy approach by comprising influential representatives from within its membership.&#160; This underscores the urgent need to establish ethical ... <a title=\"Advertising Association Launches AI Taskforce to Promote Ethical and Transparent AI Usage in Advertising\" class=\"read-more\" href=\"https://www.cryptopolitan.com/advertising-association-launch-ai-taskforce/\" aria-label=\"More on Advertising Association Launches AI Taskforce to Promote Ethical and Transparent AI Usage in Advertising\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T09:17:52.000Z",
    "title": "Innovation in Ultralow-Field MRI: Deep Learning Transforms Brain Imaging at 0.055 Tesla",
    "url": "https://www.cryptopolitan.com/innovation-in-ultralow-mri-deep-learning/",
    "description": "In a remarkable development, researchers have effectively utilized deep learning to expedite brain magnetic resonance imaging (MRI) at ultralow-field strengths of 0.055 Tesla (T). This achievement carries the potential to make MRI more widely available in healthcare settings across the globe, particularly in areas where high-field MRI scanners are in short supply. The recent publication ... <a title=\"Innovation in Ultralow-Field MRI: Deep Learning Transforms Brain Imaging at 0.055 Tesla\" class=\"read-more\" href=\"https://www.cryptopolitan.com/innovation-in-ultralow-mri-deep-learning/\" aria-label=\"More on Innovation in Ultralow-Field MRI: Deep Learning Transforms Brain Imaging at 0.055 Tesla\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T09:30:52.000Z",
    "title": "Market Analysts Outline When The First Spot Bitcoin ETF Will Be Approved",
    "url": "https://www.newsbtc.com/news/bitcoin/analyst-spot-bitcoin-etf/",
    "description": "In a recent development, analysts at asset management firm Bernstein have predicted when the US Securities and Exchange Commission (SEC) will likely approve the first Spot Bitcoin ETF. When Will The First Spot Bitcoin ETF Be Approved? According to the analysts, the pending Spot Bitcoin ETF applications could be approved early next year. They made this projection in line with the recent court ruling in the Grayscale case, which they believe could force the SEC’s hands.  Related Reading: $200 Million In Crypto Lost As Mixin Network Comes Under Attack The court had ruled in favor of Grayscale in a case in which the asset manager argued that the Commission had acted arbitrarily and capriciously by not giving its Spot Bitcoin ETF application the same regulatory treatment it did to Bitcoin futures ETFs. As part of its ruling, the court ordered the Commission to review the application again. Many saw this as a major win and proof that a Spot Bitcoin ETF was imminent, with Bloomberg analysts also weighing in and increasing the likelihood of these pending funds launching this year to 75%. They stated that “the unanimity and decisiveness of [the] ruling was beyond expectations,” with the SEC having little or nothing to hang on to. The analysts at Bernstein also seem to adopt this view as they noted that the SEC would simply go the “middle route” and be more open to approving these ETFs rather than “inventing another reason for refusal” and sticking to the strict approach which they have taken on the crypto industry so far.  This projection also seems feasible since the SEC must decide (approve or deny) on the ARK 21Shares Bitcoin ETF by January 10, 2024.  Considering that the court has overruled the primary reason why the SEC has continued to deny these applications, the Commission might have difficulty coming up with another convincing reason to deny the application. Before then, the SEC will be expected to decide on some pending applications in October. However, the Commission can delay its decision on them once again.  ETFs Integral To The Crypto Asset Management Industry Bernstein’s analysts also project the crypto asset management industry to grow from its current level (between $45 to $50 billion) to over $500 billion in the next five years. These ETFs, which they project could launch early next year, are part of the factors they believe could spur such growth. Related Reading: Number Of Ethereum Addresses Losing Money Just Reached A New All-Time High According to them, there will be increased demand from institutional investors in crypto assets, and funds such as a Spot Bitcoin ETF will be their go-to option. A Spot Bitcoin ETF will allow these investors to invest directly in the flagship cryptocurrency in a regulated manner.   In line with this, they expect the ETFs to hold 10% of the Bitcoin and Ethereum market cap and “5-6% share for liquid crypto hedge funds.” BTC price sitting above $26,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T09:30:26.000Z",
    "title": "Ripple or Stellar: Decoding the Crypto Rivalry",
    "url": "https://www.crypto-news-flash.com/ripple-or-stellar-decoding-the-crypto-rivalry/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-or-stellar-decoding-the-crypto-rivalry",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Ripple is a real-time international money transfer network aiming to revolutionize the financial system and transform the future of finance. Stellar Lumens is a blockchain-based payment network that enables international transfers at a fast and low cost, primarily targeting unbanked individuals. Two of the fastest-growing cryptocurrency projects are Ripple (XRP) and Stellar Lumens (XLM). In [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T09:14:43.000Z",
    "title": "Hedera ($HBAR), VeChain ($VET), and InQubeta ($QUBE) Rejecting Bears, What Happened?",
    "url": "https://www.crypto-news-flash.com/hedera-hbar-vechain-vet-and-inqubeta-qube-rejecting-bears-what-happened/?utm_source=rss&utm_medium=rss&utm_campaign=hedera-hbar-vechain-vet-and-inqubeta-qube-rejecting-bears-what-happened",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-145.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-145.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-145-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-145-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrency markets are renowned for their volatility, and the recent price action of Hedera ($HBAR), VeChain ($VET), and InQubeta ($QUBE) is a testament to that fact. Investors have recently witnessed these three altcoins grappling with bears and embracing bullish momentum over the past few months, leading to a remarkable price appreciation for these top crypto [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-26T09:15:36.000Z",
    "title": "Trader Predicts Year-End Rally for Ethereum, Updates Outlook on Bitcoin and One Low-Cap Altcoin",
    "url": "https://dailyhodl.com/2023/09/26/trader-predicts-year-end-rally-for-ethereum-updates-outlook-on-bitcoin-and-one-low-cap-altcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/End-Rally-for-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist thinks that the leading smart contract protocol Ethereum (ETH) is positioning for a year-end surge. Pseudonymous analyst Inmortal tells his 199,000 followers on the social media platform X that Ethereum will likely see significantly higher prices before 2023 expires. In the coming weeks, however, the analyst says that ETH could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/26/trader-predicts-year-end-rally-for-ethereum-updates-outlook-on-bitcoin-and-one-low-cap-altcoin/\">Trader Predicts Year-End Rally for Ethereum, Updates Outlook on Bitcoin and One Low-Cap Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]