[
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T13:45:00.000Z",
    "title": "Cardano node upgrade to boost performance amid rising DeFi interest",
    "url": "https://cryptoslate.com/cardano-node-upgrade-to-boost-performance-amid-rising-defi-interest/",
    "description": "<p>Cardano recently released Node 8.1.1, which is expected to enhance the performance of Cardano&#8217;s network, especially for stake pool operators (SPO.) The upgrade, released to Cardano&#8217;s mainnet on June 19, offers significant improvements in epoch boundary performance and corrects previous concerns with P2P/DNS. The Cardano GitHub states, &#8220;All SPOs are strongly encouraged to update.&#8221; Cardano [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cardano-node-upgrade-to-boost-performance-amid-rising-defi-interest/\">Cardano node upgrade to boost performance amid rising DeFi interest</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T14:00:00.000Z",
    "title": "Etherscan Unveils AI-powered Code Reader $ETH",
    "url": "https://cryptodaily.co.uk/2023/06/etherscan-unveils-ai-powered-code-reader-eth",
    "description": "<p class=\"md-end-block md-p\">Etherscan, an Ethereum block explorer and analytics platform, has launched an innovative tool that utilizes artificial intelligence (AI) to retrieve and interpret the source code of specific contract addresses. </p>\n<p class=\"md-end-block md-p md-focus\">Dubbed the 'Code Reader,' this application aims to enhance users' understanding of Ethereum source code by harnessing the capabilities of ChatGPT, an algorithmic implementation for natural language developed by OpenAI.</p>\nDecoding Ethereum Contracts via AI: A Glimpse into Code Reader\n<p class=\"md-end-block md-p\">Powered by ChatGPT, Code Reader's function is to generate insights into Ethereum contracts' source code files based on user prompts. After a user inputs a prompt, the tool responds with AI-generated interpretations of the contract&rsquo;s source code files. In the world of blockchain analytics, Code Reader represents a significant advancement, as it provides comprehensive lists of smart contract functions related to Ethereum data and offers deep insights into the interactions of the underlying contract with decentralized applications.</p>\n<p class=\"md-end-block md-p\">Using Code Reader, however, requires a valid OpenAI API Key and sufficient OpenAI usage limits. The tool does not store any user's API keys, safeguarding user privacy and data security.</p>\nEtherscan&rsquo;s Beta Integration of ChatGPT: A Prudent Approach\n<p class=\"md-end-block md-p\">While Etherscan's integration of ChatGPT signals a major leap forward, the company maintains a cautious stance. The firm highlighted that the newly launched Code Reader is currently in its beta phase and that user feedback is actively encouraged for the tool&rsquo;s refinement.</p>\n<p class=\"md-end-block md-p\">Importantly, Etherscan reminds users that the tool is for informational purposes only and cautions them against taking ChatGPT's responses at face value. This precautionary approach relates to the AI industry's common issue known as \"hallucinating,\" where AI may generate false or misleading results not supported by real-world data. In light of this, Etherscan has been explicit in advising users to always verify the responses they receive from the tool.</p>\nAI in Blockchain Analytics: Future Prospects and Challenges\n<p class=\"md-end-block md-p\">The launch of Etherscan's Code Reader comes amid a growing trend of AI integration in blockchain analytics, seen with Alchemy's recent launch of its own ChatGPT-based tool, AlchemyAI. However, the burgeoning role of AI in the blockchain industry also presents considerable challenges, especially regarding feasibility and data capacity.</p>\n<p class=\"md-end-block md-p\">A report by Singaporean venture capitral firm Foresight Ventures highlighted the substantial resources required to train large AI models, which can exceed the capacity of most networks. This report suggests that small AI models remain a more feasible choice, underlining the need for caution amidst the excitement surrounding the integration of larger AI models like ChatGPT.</p>\n<p class=\"md-end-block md-p\">Etherscan&rsquo;s launch of the AI-powered Code Reader, and its integration of ChatGPT, marks a significant development in the use of AI in blockchain analytics. However, the challenges presented by AI hallucinations and data capacity constraints underline the importance of careful management and continuous improvement in this fast-paced industry.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T14:02:53.000Z",
    "title": "China-US relations show progress, notes Xi Jinping",
    "url": "https://www.cryptopolitan.com/china-us-relations-show-progress-xi-jinping/",
    "description": "In the wake of a landmark encounter, Chinese President Xi Jinping indicates a promising thaw in the ice-cold diplomatic relations between China and the United States. The President&#8217;s comments underscore the strongest sign yet that Beijing might entertain the possibility of a ceasefire in its ongoing dispute with Washington. Landmark encounter signals progress The president&#8217;s ... <a title=\"China-US relations show progress, notes Xi Jinping\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-us-relations-show-progress-xi-jinping/\" aria-label=\"More on China-US relations show progress, notes Xi Jinping\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T14:02:40.000Z",
    "title": "How Top 10 Bitcoin Maximalists Support The Original Cryptocurrency",
    "url": "https://www.cryptopolitan.com/top-10-bitcoin-maximalists/",
    "description": "As a financial instrument that has profoundly transformed our global economy, Bitcoin sits firmly at the epicenter of the digital asset revolution. In this guide, particular emphasis will be placed on a group of individuals whose unwavering support for Bitcoin&#8217;s supremacy stands as a testament to their belief in its potential: the Bitcoin Maximalists. Bitcoin ... <a title=\"How Top 10 Bitcoin Maximalists Support The Original Cryptocurrency\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-10-bitcoin-maximalists/\" aria-label=\"More on How Top 10 Bitcoin Maximalists Support The Original Cryptocurrency\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T13:53:52.000Z",
    "title": "Crypto ownership surges among risk-averse young Australians",
    "url": "https://www.cryptopolitan.com/crypto-ownership-among-young-australians/",
    "description": "The modern era is often tagged as the age of the &#8220;digital natives,&#8221; and it&#8217;s clear that this demographic is reshaping the financial landscape. A wave of crypto-enthusiasm has engulfed Australia&#8217;s young, risk-averse investors, marking a change in investment patterns. Crypto enthusiasm among Australia&#8217;s youth An intriguing paradox is unraveling among Australia&#8217;s youngest investors, aged ... <a title=\"Crypto ownership surges among risk-averse young Australians\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-ownership-among-young-australians/\" aria-label=\"More on Crypto ownership surges among risk-averse young Australians\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T13:50:53.000Z",
    "title": "What About Arthur Hayes, the King of Crypto, And His Lasting Imprint?",
    "url": "https://www.cryptopolitan.com/arthur-hayes-the-king-of-crypto/",
    "description": "Cryptocurrency, the digital frontier of finance, has birthed a new breed of pioneers who challenge the traditional notions of money and power. At the forefront stands Arthur Hayes, a figure whose impact on the world of crypto is as profound as it is controversial. This Cryptopolitan guide dissects the life and legacy of Arthur Hayes, ... <a title=\"What About Arthur Hayes, the King of Crypto, And His Lasting Imprint?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arthur-hayes-the-king-of-crypto/\" aria-label=\"More on What About Arthur Hayes, the King of Crypto, And His Lasting Imprint?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-20T14:00:24.000Z",
    "title": "Discover Why Avorak AI Could Outperform Cardano and Cosmos This Summer",
    "url": "https://nulltx.com/discover-why-avorak-ai-could-outperform-cardano-and-cosmos-this-summer/",
    "description": "Avorak AI (AVRK) has gained traction in the crypto market while in ICO (initial coin offering). As the AI crypto project&#8217;s launch draws near, several analysts have predicted that it could outperform Cardano (ADA) and Cosmos (ATOM). Layer one blockchains vs AI crypto Layer one blockchains and AI crypto projects both play a significant role [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T14:01:35.000Z",
    "title": "Deutsche Bank awaits regulatory approval to offer digital asset custody services",
    "url": "https://crypto.news/deutsche-bank-awaits-regulatory-approval-to-offer-digital-asset-custody-services/",
    "description": "Deutsche Bank — a leading global financial institution — has recently submitted an application to the German securities regulator, Bafin, seeking approval to provide custody services for digital assets."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T13:40:00.000Z",
    "title": "Man gathering crypto for monkey torture is among 20 investigated in international action",
    "url": "https://crypto.news/man-gathering-crypto-for-monkey-torture-is-among-20-investigated-in-international-action/",
    "description": "A BBC investigation into the brutal abuse of monkeys has led to the investigation of at least 20 individuals, with the suspect list spanning from the UK to the US and Indonesia. The suspects, including a Wisconsin man known as&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T14:00:38.000Z",
    "title": "This New Altcoin Has Been Dubbed A Dogecoin Killer, But Both Could Thrive In 2023",
    "url": "https://www.crypto-news-flash.com/this-new-altcoin-has-been-dubbed-a-dogecoin-killer-but-both-could-thrive-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=this-new-altcoin-has-been-dubbed-a-dogecoin-killer-but-both-could-thrive-in-2023",
    "description": "Over the years in the cryptocurrency space, we have learned that there is more than enough room for both originals and upcoming projects challenging them for dominance. Dogecoin, the leading meme coin, has a new challenger in Tradecurve.  However, experts have predicted that both altcoins could thrive together in 2023. What are their reasonings behind [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T13:57:50.000Z",
    "title": "Regulatory Uncertainty Leads to Delisting of Solana, Cardano, and Polygon by Bakkt, Impacting Crypto Market Liquidity",
    "url": "https://www.crypto-news-flash.com/regulatory-uncertainty-leads-to-delisting-of-solana-cardano-and-polygon-by-bakkt-impacting-crypto-market-liquidity/?utm_source=rss&utm_medium=rss&utm_campaign=regulatory-uncertainty-leads-to-delisting-of-solana-cardano-and-polygon-by-bakkt-impacting-crypto-market-liquidity",
    "description": "Bakkt, a regulated crypto trading platform, has decided to delist Solana, Cardano, and Polygon tokens due to regulatory uncertainty and lack of clarity. The delisting of these cryptocurrencies will greatly impact the future of digital asset trading for both retail and institutional investors. Amid the recent regulatory crackdown by the U.S. Securities and Exchange Commission [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T13:41:18.000Z",
    "title": "Monero’s Battle for Privacy: Can XMR Withstand Market Turmoil? Experts Forecast Potential Rise to $1,000 by 2030",
    "url": "https://www.crypto-news-flash.com/moneros-battle-for-privacy-can-xmr-withstand-market-turmoil-experts-forecast-potential-rise-to-1000-by-2030/?utm_source=rss&utm_medium=rss&utm_campaign=moneros-battle-for-privacy-can-xmr-withstand-market-turmoil-experts-forecast-potential-rise-to-1000-by-2030",
    "description": "Monero&#8217;s price has corrected by 10% following regulatory actions, and it is currently trading at around $140 with a market cap of $3 billion. Analysts are predicting the XMR price to rally all the way to $1000 by 2030. The US SEC lawsuits over two of the world&#8217;s largest crypto exchanges earlier this month have [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-20T13:52:00.000Z",
    "title": "Ripple’s Strategic Global Expansion Bolsters Fight Against SEC",
    "url": "https://coinedition.com/ripples-strategic-global-expansion-bolsters-fight-against-sec/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/043.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/043.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/043-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/043-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/043-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/043-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/043-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/043-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/043-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/043-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/043-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/043-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/043-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/043-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/043-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/043-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/043-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>xSpectar founder Dirk Schepens tweeted on June 19 that Ripple has taken proactive measures to win the SEC vs. Ripple lawsuit by establishing a solid presence in Europe and Latin America. Ripple&#8217;s stand is so powerful that even in the event of a no-win situation, Ripple will persist in its pursuit of market leadership in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripples-strategic-global-expansion-bolsters-fight-against-sec/\">Ripple&#8217;s Strategic Global Expansion Bolsters Fight Against SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]