[
  {
    "source": "Decrypt",
    "date": "2023-10-11T10:25:39.000Z",
    "title": "Bored Bitcoin Analysts Point to McRib Meme for Bullish Return",
    "url": "https://decrypt.co/200966/bored-bitcoin-analysts-point-mcrib-meme-bullish-return",
    "description": "The McRib is back and analysts are busy trying to pin Bitcoin and stock performances to the McDonald’s sandwich relaunch."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T10:12:37.000Z",
    "title": "European regulator: DeFi comes with significant risks as well as benefits",
    "url": "https://cointelegraph.com/news/crypto-european-regulator-de-fi-significant-risks-benefits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/2fa92d84-f489-4b05-bca7-6a16cd69e007.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The European Securities and Markets Authority released an article on Decentralized Finance and its risks for the EU Market.</p>\n                    <p><p>The European Securities and Markets Authority (ESMA), the European Union’s markets regulator, <a href=\"https://www.esma.europa.eu/sites/default/files/2023-10/ESMA50-2085271018-3349_TRV_Article_Decentralised_Finance_in_the_EU_Developments_and_Risks.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> an article on Decentralized Finance (DeFi) and its risks for the EU Market on Oct. 11. </p><p>In a 22-page report, the ESMA admits the promised benefits of DeFi, such as greater financial inclusion, the development of innovative financial products, and the enhancement of financial transactions’ speed, security, and costs. </p><p>However, the paper also highlights the “significant risks” of DeFi. According to ESMA, the first one is the liquidity risk tied to the highly speculative and volatile nature of many crypto-assets. The regulator compares the 30-day volatility of Bitcoin or Ether and the Euro Stoxx 50, with the former being on average 3.6 and 4.7 times higher than the latter. </p><p>The ESMA doesn’t believe that DeFi managed to avoid the counterparty risk, even if, in theory, it should be lower or even non-existent due to smart contracts and atomicity. Yet, smart contracts are not immune to errors or flaws. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/eu-regulations-large-ai-models\"><strong><em>EU mulls more restrictive regulations for large AI models: Report</em></strong></a></p><p>DeFi is especially vulnerable to scams and illicit activities as it lacks know-your-customer (KYC) protocols. Another important source of risk for DeFi users, as specified in the report, is the lack of an identifiable responsible party and the absence of a recourse mechanism. </p><p>But, at this point, DeFi, and crypto in general, do not represent “meaningful risks” to financial stability, the report concludes. That is because of their relatively small size and limited interconnectedness between crypto and traditional financial markets. </p><p>The ESMA pays close attention to the crypto market, releasing its <a href=\"https://cointelegraph.com/news/european-regulator-publishes-second-consultation-on-mica\">second consultative paper on Markets in Crypto-Assets (MiCA) mandates</a> on Oct. 5. In a 307-page document, the regulator suggested allowing crypto asset providers to store transaction data in “the format they consider most appropriate,” if they can convert it into a specified format should the authorities request it.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T10:17:34.000Z",
    "title": "How are AI and Automation Revolutionizing Workflows at UK Workplaces?",
    "url": "https://www.cryptopolitan.com/ai-and-automation-workflows-at-uk-workplaces/",
    "description": "In a groundbreaking revelation, a recent study conducted by Dropbox unveils a transformative shift in the work habits of British knowledge workers. As the one-year anniversary of ChatGPT preview approaches, the study indicates that AI and automation are increasingly becoming integral to the daily operations of UK workers. This shift signifies not only a response ... <a title=\"How are AI and Automation Revolutionizing Workflows at UK Workplaces?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-and-automation-workflows-at-uk-workplaces/\" aria-label=\"More on How are AI and Automation Revolutionizing Workflows at UK Workplaces?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T10:38:25.000Z",
    "title": "UK parliament calls for NFT copyright protection rights",
    "url": "https://crypto.news/uk-parliament-calls-for-nft-copyright-protection-rights/",
    "description": "A cross-party committee of the UK Parliament has called on the government to protect the rights of artists and consumers in the NFT market. The committee members also raised concerns about fan tokens in sports, which are a type of&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-11T10:13:55.000Z",
    "title": "Hamas Crypto Funding Sparks Controversy as Coinbase CLO Takes a Stand",
    "url": "https://coinedition.com/hamas-crypto-funding-sparks-controversy-as-coinbase-clo-takes-a-stand/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/coinbase-8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/coinbase-8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/coinbase-8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/coinbase-8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/coinbase-8-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/coinbase-8-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/coinbase-8-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Following the recent escalation between Hamas and Israel, Coinbase&#8216;s Chief Legal Officer Paul Grewal condemned the idea of a fund to support the Palestinian resistance movement Hamas. Hamas launched an attack on Israel on October 7, and Grewal shared that what’s happening in Israel is “evil.” He stated, “No funds should EVER be used to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hamas-crypto-funding-sparks-controversy-as-coinbase-clo-takes-a-stand/\">Hamas Crypto Funding Sparks Controversy as Coinbase CLO Takes a Stand</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]