[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T00:53:26.000Z",
    "title": "Franklin Templeton gives Bitcoin Ordinals their flowers",
    "url": "https://www.cryptopolitan.com/franklin-templeton-on-bitcoin-ordinals/",
    "description": "Over the last year, the Bitcoin ecosystem has been busy with a fresh wave of innovation and development, marking a significant chapter in its evolution. At the forefront of this resurgence is the advent of Bitcoin NFTs, famously known as Bitcoin Ordinals, alongside other groundbreaking advancements like BRC-20 tokens, Runes, and various Decentralized Finance primitives [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T01:00:48.000Z",
    "title": "This Bitcoin Indicator May Have Signaled Latest Market Downturn In Advance",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-indicator-signaled-downturn-advance/",
    "description": "The Bitcoin Network Value to Transactions (NVT) Golden Cross indicator attained overheated values coinciding with the recent local top in the price. Bitcoin NVT Golden Cross Surged To 3.17 During Recent Peak An analyst in a CryptoQuant Quicktake post explained that the NVT Golden Cross may have served as an indicator of the recent top in cryptocurrency prices. The &#8220;NVT&#8221; refers to an on-chain metric that tracks the ratio between Bitcoin&#8217;s market cap and transaction volume (both in USD). This ratio is generally used to determine whether the asset&#8217;s price is fair or not. Related Reading: Bitcoin Short-Term Holders Capitulate: $5.2 Billion Sold At Loss When the indicator has a high value, the asset&#8217;s price (the market cap) is high compared to its utility (the transaction volume). Such a trend may suggest that the coin could be overvalued currently. On the other hand, the low metric could suggest the network isn&#8217;t valued fairly compared to its high ability to transact capital, and as such, its price may be due to an uplift. In the context of the current discussion, the NVT itself isn&#8217;t interesting, but rather, a modified version called the NVT Golden Cross is. This metric compares the short-term trend of the NVT (10-day moving average) against its long-term trend (30-day MA). Like the NVT, this variant is also used to estimate the fairness of the asset. Historically, values greater than 2.2 have been a signal that BTC is overheated, as the short-term trend is notably outpacing the long-term at these levels. Similarly, values under the -1.6 level may indicate that the cryptocurrency is undervalued; hence, its price may likely form a bottom and find a rebound soon. Now, here is a chart that shows the trend in the Bitcoin NVT Golden Cross over the last few years: The value of the metric seems to have been going up in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin NVT Golden Cross rose to relatively high levels earlier. This growth happened as the asset&#8217;s price rallied towards the $71,000 level. The metric had touched the 3.17 mark in this surge, which suggests the coin may have become too overpriced. Indeed, the asset followed this by observing a sharp drawdown, which took it back under the $65,000 level. As the quant has marked in the chart, a similar pattern of the NVT Golden Cross hitting these high levels and resulting in a price correction was observed at different points over the last few years. Related Reading: Bitcoin Traders No Longer Extremely Greedy: Rebound Signal? Since the latest overheated signal, the indicator has cooled off alongside the Bitcoin price, although it hasn&#8217;t gone towards the negative side yet. BTC Price Bitcoin has recovered over the past day as its price has now climbed back to $67,800. Looks like the price of the asset has seen some uplift over the last 24 hours &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, CryptoQuant.com, chart from TradingView.com"
  }
]