[
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T19:52:54.000Z",
    "title": "Bitstamp to suspend trading of major altcoins for US users",
    "url": "https://cointelegraph.com/news/bitstamp-suspend-trading-major-altcoins-us-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/31836f02-afc7-41ba-ab51-0c7f96a327fa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>All the soon-to-be suspended tokens are alleged by the SEC to be securities in its lawsuit against Coinbase and Binance. </p>\n                    <p><p>Cryptocurrency exchange Bitstamp will suspend trading of Axie Infinity (AXS), Chiliz (CHZ), Decentraland (MANA), Polygon (MATIC), Near (NEAR), Sandbox (SAND), and Solana (SOL) for customers residing in the U.S. beginning August 29.</p><p>According to the Aug. 8 announcement, trading of the seven aforementioned cryptocurrencies will soon become unavailable for trading for U.S. customers due to \"recent developments.\" While the firm did not specify the reason for their suspension, all seven tokens are <a href=\"https://www.sec.gov/files/litigation/complaints/2023/comp-pr2023-101.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> by the U.S. Securities and Exchange Commission to be unregistered securities in its <a href=\"https://www.sec.gov/files/litigation/complaints/2023/comp-pr2023-102.pdf\" target=\"_blank\" rel=\"noopener nofollow\">complaints</a> against cryptocurrency exchanges Binance and Coinbase. Bitstamp wrote: </p><blockquote>\"We kindly request our users to promptly execute any desired buy or sell orders involving the affected assets before August 29, 2023. After this deadline, trading activities related to AXS, CHZ, MANA, MATIC, NEAR, SAND, and SOL will be permanently disabled on the Bitstamp platform.\"</blockquote><p>Although trading will soon be halted, Bitstamp says users can still hold the seven tokens in their accounts and withdraw them at anytime. The SEC's allegations against the tokens have not yet been proven in a court of law. However, other fintech firms, such as Revolut, have <a href=\"https://cointelegraph.com/news/revolut-us-to-delist-ada-matic-and-sol-in-september\">voluntarily delisted them</a> for U.S. residents amidst the SEC litigation against Binance and Coinbase. The Sandbox had also begun mandating <a href=\"https://cointelegraph.com/news/the-sandbox-implements-kyc-measures-protocol-staking\">Know Your Customer verification</a> for SAND staking after the event. The SEC currently alleges that <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">68 cryptocurrencies are securities</a>. </p><p>Founded in 2011 and now headquartered in Luxembourg, Bitstamp is currently the world's oldest cryptocurrency exchange. The platform offers around 30 coins and tokens for trading. Approximately $164 million worth of digital currencies were traded on Bitstamp in the past 24 hours.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Update for our US users <br><br>Starting August 29: AXS, CHZ, MANA, MATIC, NEAR, SAND, and SOL trading will be halted after evaluating recent market developments.<br><br>Execute any open trades. Holding and withdrawing tokens afterwards will be unaffected.<br><br>More info:…</p>&mdash; Bitstamp (@Bitstamp) <a href=\"https://twitter.com/Bitstamp/status/1688846041129328641?ref_src=twsrc%5Etfw\">August 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/defi-faces-stress-test-doj-fears-run-on-binance-hong-kongs-crypto-trading-hodlers-digest-july-30-aug-5/\">DeFi faces stress test, DoJ fears run on Binance, Hong Kong’s crypto trading</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-08T20:00:15.000Z",
    "title": "Argentine Peso Plunges to Historic Lows as Uncertainty Rules Before Elections",
    "url": "https://news.bitcoin.com/argentine-peso-plunges-to-historic-lows-as-uncertainty-rules-before-elections/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Argentine Peso Plunges to Historic Lows as Uncertainty Rules Before Elections\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1191495160.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The exchange rate of the Argentine peso reached historic lows Monday in a decline that took its exchange rate to almost 600 pesos per U.S. dollar. Economists state that the uncertainty of the upcoming elections caused key bagholders to hedge their portfolios with foreign currency. However, analysts fear the effect this movement might have on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:05:19.000Z",
    "title": "Bitcoin’s market price following weak China market data – how will BTC react to the CPI data?",
    "url": "https://www.cryptopolitan.com/bitcoins-reaction-to-the-aug-cpi-data/",
    "description": "Bitcoin will either break or make an effectual run this month. As equities, gold, and U.S. Treasuries offer competitive rates and reduced risk, Bitcoin&#8217;s price remains range-bound. The CPI report for this week could change things up. In addition, Tuesday&#8217;s crypto markets are posting gains as long-term government bond yields fall significantly across the globe ... <a title=\"Bitcoin&#8217;s market price following weak China market data &#8211; how will BTC react to the CPI data?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoins-reaction-to-the-aug-cpi-data/\" aria-label=\"More on Bitcoin&#8217;s market price following weak China market data &#8211; how will BTC react to the CPI data?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:05:15.000Z",
    "title": "Israel’s Bold Ascent to Navigating the AI Revolution",
    "url": "https://www.cryptopolitan.com/israels-navigating-the-ai-revolution/",
    "description": "Jerusalem in the rapidly evolving world of the 21st century, artificial intelligence (AI) stands out as a transformative force, reshaping the contours of global dynamics. At the forefront of this seismic shift is Israel, under the visionary leadership of Prime Minister Benjamin Netanyahu. In a recent dialogue with U.S. House Democrats in Jerusalem, Netanyahu unveiled ... <a title=\"Israel&#8217;s Bold Ascent to Navigating the AI Revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/israels-navigating-the-ai-revolution/\" aria-label=\"More on Israel&#8217;s Bold Ascent to Navigating the AI Revolution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:01:21.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T20:00:58.000Z",
    "title": "Litecoin Long-Term Holders Smartly Exited Before Halving, Data Shows",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-long-term-holders-smartly-exited-before-halving-data-shows/",
    "description": "Data shows that Litecoin long-term holders exited the asset before the halving, while short-term holders were left to panic on the halving day. The &#8220;halving&#8221; here refers to an event where the block rewards of Litecoin are permanently cut in half. Litecoin Long-Term Holders Sold During Price Surge Before The Halving According to data from the market intelligence platform IntoTheBlock, the long-term holders had been well-prepared for the &#8220;sell the news&#8221; halving event. The &#8220;long-term holders&#8221; (LTHs) generally include all investors who have been holding onto their coins since at least six months ago. Related Reading: These Bitcoin Metrics Are At Important Retests, Will Bullish Trend Prevail? This group includes some of the most resolute investors in the Litecoin market, who don&#8217;t easily react to whatever is going in on in the wider sector, as they usually hold through FUD or profit-taking opportunities without participating in any significant selling. Because of how rare movements from these investors can be, the few times that they do sell can be the ones to watch out for, as they may spell trouble for the market. A way to gauge whether the LTHs are participating in selling or not is through the &#8220;holding time of transacted coins&#8221; metric, which tells us about the average amount of time that coins being transferred on the blockchain had been dormant prior to this movement. When the value of this metric is high, it means that the age of coins being sold on the network is high, which can naturally be a sign that the LTHs are active right now. On the other hand, low values usually indicate that the short-term holders (STHs) are the ones selling currently. Now, here is a chart that shows the trend in the Litecoin holding time of transacted coins over the past few months: The value of the metric seems to have been relatively low in recent days &#124; Source: IntoTheBlock on X As you can see in the above graph, the Litecoin holding time of transacted coins spiked back in June, when the price of the cryptocurrency had been observing a sharp rally. During the largest of these spikes, the indicator&#8217;s value had exceeded 1 year, implying that some of the most experienced investors in the market had broken their silence. This rally had occurred as the market had started getting hyped about the halving, which was only a month and a half away at that point. This event takes place every four years, with the latest one having occurred just earlier this month. Unlike what some may have hoped for, the event didn&#8217;t prove to be bullish for LTC, as the aforementioned rally didn&#8217;t last for too long and the cryptocurrency only declined in the remaining leadup to the halving, until finally it actually sharply plunged on the day of the event itself. It would appear that the experienced LTHs had already predicted something like this may happen, so they had taken the wise decision of selling while the opportunity was there. Related Reading: Bitcoin Miners Show Accumulation Again, Bullish Sign? In the post-halving selloff, the indicator&#8217;s value has remained low, implying that it&#8217;s only the short-term holders who have been panic selling after they saw that a bullish trend couldn&#8217;t return to Litecoin with the event. LTC Price At the time of writing, Litecoin is trading around $84, down 8% in the last week. LTC has plummeted since the halving &#124; Source: LTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T20:00:06.000Z",
    "title": "Big Players Gear Up To Unload Bags of Ethereum Gaming Altcoin That Rose 316% in Less Than a Week: On-Chain Data",
    "url": "https://dailyhodl.com/2023/08/08/big-players-gear-up-to-unload-bags-of-ethereum-gaming-altcoin-that-rose-316-in-less-than-a-week-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/gear-up-to-unload.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An Ethereum (ETH) gaming altcoin exploded in price over the past week before retracing after a series of whales sent their stacks to crypto exchanges. Yield Guild Games (YGG), a blockchain-based play-to-earn gaming decentralized autonomous organization (DAO), saw its native token rally from trading at around $0.18 one week ago to a high of nearly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/big-players-gear-up-to-unload-bags-of-ethereum-gaming-altcoin-that-rose-316-in-less-than-a-week-on-chain-data/\">Big Players Gear Up To Unload Bags of Ethereum Gaming Altcoin That Rose 316% in Less Than a Week: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T19:55:43.000Z",
    "title": "Crypto Analyst Issues Bitcoin Alert, Says BTC Officially Lost $30,000 and Is on Its Way Lower",
    "url": "https://dailyhodl.com/2023/08/08/crypto-analyst-issues-bitcoin-alert-says-btc-officially-lost-30000-and-is-on-its-way-lower/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Giving-the-Bears.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning that Bitcoin (BTC) is getting ready to sink lower after losing the $30,000 price level. DataDash host Nicholas Merten tells his 511,000 YouTube subscribers that more market participants are looking to sell BTC than buy it – a trend that will drive the king crypto&#8217;s price lower. &#8220;We have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/crypto-analyst-issues-bitcoin-alert-says-btc-officially-lost-30000-and-is-on-its-way-lower/\">Crypto Analyst Issues Bitcoin Alert, Says BTC Officially Lost $30,000 and Is on Its Way Lower</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]