[
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T20:32:10.000Z",
    "title": "Price analysis 8/7: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, LTC",
    "url": "https://cointelegraph.com/news/price-analysis-8-7-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-ltc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/df1e4825-4496-4a20-88e6-63b0dfdd1ec6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s failure to rebound off strong support may open further downside as bears may be tempted to sell. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been trading near the $29,000 level for the past few days. This suggests a lack of strong demand at higher levels but the only solace for the bulls is that they have managed to sustain the price above the immediate support.</p><p>The uncertainty about the next directional move may have tempted short-term traders to book profits. CoinShares said in its latest weekly <a href=\"https://blog.coinshares.com/volume-143-digital-asset-fund-flows-weekly-report-6d46f78754c\" target=\"_blank\" rel=\"noopener nofollow\">report</a> that Bitcoin investment products witnessed $111 million in outflows, the largest weekly outflows since March.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5606ae36-52a5-4dcc-912e-6ad505aac783.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>While the short-term price action remains uninspiring, crypto bulls remain confident that Bitcoin will rally before its next halving in 2024. Blockstream CEO Adam Back said in a conversation on X (previously known as Twitter) that <a href=\"https://cointelegraph.com/news/adam-back-bitcoin-price-bet-all-time-high-halving\">Bitcoin will hit $100,000</a> by the end of March. </p><p>Could Bitcoin extend its decline in the near term or will it turn up? Will the altcoins outperform Bitcoin over the next few days? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index (SPX) is witnessing a tough battle between the bulls and the bears near the 20-day exponential moving average (4,511). Sellers pulled the price below the 20-day EMA on Aug. 2, indicating that the bullish momentum is weakening.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f8bfe36f-ee0f-4e00-9bce-56cec50c585c.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls pushed the price back above the 20-day EMA on Aug. 4 but the bears aggressively sold the rally. This suggests that the bears are pouncing on relief rallies. The index could decline to the 50-day simple moving average (4,414), which could act as a strong support.</p><p>The 20-day EMA is flattening out and the relative strength index (RSI) is near the midpoint, indicating a balance between supply and demand. If the price rebounds off the 50-day SMA, it will suggest that lower levels continue to attract buyers. The index may then swing between the 50-day SMA and 4,650 for some time.</p><h2>U.S. dollar index price analysis</h2><p>Buyers pushed the U.S. dollar index (DXY) above the 50-day SMA (102) on Aug. 2 but they could not build upon this strength.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bf08ccfc-a83f-492b-84ed-fab40d3c9485.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears pulled the price back below the 50-day SMA on Aug. 4. A minor positive is that the bulls have kept the price above the 20-day EMA (101). If buyers drive the price above the 50-day SMA, the index could retest the downtrend line. This remains the key level to watch on the upside because a break above it could open the doors for a rally to 106.</p><p>If bears want to gain the upper hand, they will have to sink and sustain the price below the 20-day EMA. The index could then slide to the strong support at 100.82.</p><h2>Bitcoin price analysis</h2><p>Bitcoin’s price is getting squeezed between the 20-day EMA ($29,387) and the horizontal support at $28,861. This low volatile period is likely to be followed by an expansion in volatility. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/033973e2-8b2d-4320-923b-470c2e0c1355.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price plunges and sustains below $28,861, it will suggest that the uncertainty has resolved in favor of the bears. The BTC/USDT pair could then start a decline to $26,000 and eventually to $24,800.</p><p>Contrarily, if the price turns up and breaks above the 50-day SMA ($29,893), it will suggest that the bulls have overpowered the bears. That could start a rally to the overhead resistance zone between $31,500 and $32,400.</p><h2>Ether price analysis</h2><p>The bulls managed to keep Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) above the immediate support at $1,816 for the past few days but they are struggling to start a strong recovery. This suggests that demand dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9cf8de60-639c-4228-af3b-fcce7fa733a1.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The downsloping 20-day EMA ($1,856) and the RSI in the negative territory indicate that bears have the upper hand. If the price slips and sustains below $1,816, the ETH/USDT pair could slump $1,700 and then to the crucial support at $1,626.</p><p>If bulls want to make a comeback, they will have to quickly kick the price above the 50-day SMA ($1,877). If they do that, the pair could start its northward march toward the overhead resistance at $2,000.</p><h2>BNB price analysis</h2><p>The price action inside a symmetrical triangle pattern is usually random and volatile. BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) has been oscillating inside the triangle with no clear advantage either to the bulls or the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/76be53f1-6d9a-4d4a-aa5a-d4d6e35ecac9.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Typically, the symmetrical triangle behaves as a continuation pattern but in some cases, it can also start a reversal.</p><p>If the price rises above the triangle, it will suggest that the bulls have the upper hand. The BNB/USDT pair could then rise to the overhead resistance at $265. If this level is cleared, the pair may surge to $288.</p><p>Another possibility is that the price tumbles below the triangle. The pair may then descend to $220. If this support cracks, the pair may fall to the pattern target of $194.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) continued its correction and dipped below the 61.8% Fibonacci retracement level of $0.64 on Aug. 4. This indicates that the bulls are losing their grip.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d52efaac-99d0-4bc3-b10b-5d603edd33b5.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The price has reached the 50-day SMA ($0.60), which is an important level to watch out for. If the price bounces off the current level, the XRP/USDT pair may reach the 20-day EMA ($0.67), which could again act as a major obstacle.</p><p>If the price turns down from the current level or the 20-day EMA and breaks below the 50-day SMA, it will indicate that bears are in command. The pair could then slide to the breakout level of $0.56 and even risk a fall to $0.45.</p><h2>Cardano price analysis </h2><p>Buyers failed to push Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) back above the uptrend line in the past few days, indicating that the bears are trying to flip the level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/96d04991-feb9-4d37-a1f8-db28415e8f2b.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears yanked the price below the support near $0.29, signaling the resumption of the pullback. The ADA/USDT pair could plummet to the next support at $0.26 and eventually to the crucial level at $0.24.</p><p>This negative view will invalidate in the near term if the price turns up and rises above the 20-day EMA ($0.30). That could indicate solid buying at lower levels. The pair may then attempt a rally to $0.32 and later to $0.34.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-spot-selling-btc-price-dips-below-28-7k\"><em>Bitcoin faces 'endless spot selling' as BTC price dips below $28.7K</em></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been correcting inside an ascending channel pattern for the past few days. Generally, in an ascending channel, traders buy near the support of the channel and sell near the resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d7aa2ab8-f7f2-48f6-9cf0-ea0db2074717.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price turns up from the support line, it will suggest that the sentiment remains positive and traders are buying on dips. The bulls will then attempt to push the price to $0.08 and thereafter to the resistance line of the channel.</p><p>Instead, if the price dives below the channel, it will suggest that the bears are back in the game. There is a strong support at the breakout level of $0.07 but if this level gives way, the pair may drop to $0.06.</p><h2>Solana price analysis</h2><p>The bulls are trying to drive Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) above the 20-day EMA ($23.58) while the bears are attempting to sink the price below the $22.30 support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/dffc1ece-dffe-4235-a44b-7578446dc57d.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price climbs and sustains above the 20-day EMA, it will suggest that the SOL/USDT pair may remain range-bound between $22.30 and $27.12 for a while longer. Buyers will have to overcome the barrier at $27.12 to seize control.</p><p>Alternatively, if the price turns down from the 20-day EMA and breaks below the 50-day SMA ($21.81), it will signal that bears are trying to flip the 20-day EMA into resistance. That could start a deeper correction to $18.</p><h2>Polygon price analysis</h2><p>Polygon’s (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) pullback has reached the first strong support at $0.64. Buyers have held this level but have failed to propel the price above the moving averages.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b9302a6c-0340-4e62-a850-f89fb4d23e13.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA ($0.69) is turning down gradually and the RSI is in the negative territory, indicating that the path of least resistance is to the downside. If the price skids below $0.64, the MATIC/USDT pair could reach $0.60.</p><p>If bulls want to prevent the decline, they will have to quickly thrust the price above the moving averages. That could start a recovery, which may first hit $0.80 and subsequently $0.90.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T20:30:00.000Z",
    "title": "FTX has a plan, but creditors are not impressed: Law Decoded",
    "url": "https://cointelegraph.com/news/ftx-has-a-plan-but-creditors-are-not-impressed-law-decoded-july-31-aug-7",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f3da311a-0057-4c1f-a82a-a92c7cd2747c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A body representing FTX customers said it is “extremely disappointed” by the company’s reorganization plan. </p>\n                    <p><p>FTX has outlined its <a href=\"https://cointelegraph.com/news/ftx-releases-restructuring-plan-offshore-exchange-reboot-planned\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-releases-restructuring-plan-offshore-exchange-reboot-planned/amp\">intended reorganization plan</a>, which will categorize claimants of the bankrupt exchange into specific classes and pave the way for it to become operational as an offshore entity. However, a body representing FTX customers said it is “extremely disappointed” by the plan. </p><p>FTX’s Official Committee of Unsecured Creditors (UCC) said despite its repeated requests and previous promises from the team, it “did not have a single call or meeting” with FTX to discuss the plan. The UCC warned it <a href=\"https://cointelegraph.com/news/ftx-creditors-ignored-draft-bankruptcy-exit-plan\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-creditors-ignored-draft-bankruptcy-exit-plan/amp\">would put forward its own plan</a> for FTX customers to vote on if it continued to be ignored.</p><p>Meanwhile, the company has filed a motion in court to <a href=\"https://cointelegraph.com/news/ftx-files-motion-to-exclude-its-dubai-unit-from-bankruptcy-proceedings\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-files-motion-to-exclude-its-dubai-unit-from-bankruptcy-proceedings/amp\">remove its Dubai unit from ongoing restructuring proceedings</a> in the United States. In the filing, the crypto exchange noted that FTX Dubai is balance sheet solvent and, therefore, a voluntary “liquidation procedure in accordance with the laws of the United Arab Emirates would allow a timely distribution of the positive cash balance after payment of all outstanding liabilities and liquidation of all assets.“</p><h3>IRS deems crypto staking reward taxable once received</h3><p>U.S. crypto investors must report crypto staking rewards as gross income in the year it was received, according to a new ruling from the country’s top tax authority. Gross income includes income realized in any form, whether in money, property, services or staking rewards. The ruling applies to cash-method taxpayers who receive any crypto as remuneration for validating transactions on proof-of-stake blockchains and applies both when staking cryptocurrency directly and through a centralized crypto exchange.</p><p><a href=\"https://cointelegraph.com/news/crypto-staking-rewards-taxable-gross-income-once-received-irs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-staking-rewards-taxable-gross-income-once-received-irs/amp\"><strong>Continue reading</strong></a></p><h3>U.S. Senators believe there are $50 billion of non-collected taxes on crypto</h3><p>Senators Elizabeth Warren, Bernie Sanders, Bob Casey and Richard Blumenthal claim there is a “$50 billion crypto tax gap,” and that the Internal Revenue Service and U.S. Treasury risk missing out on roughly $1.5 billion in tax revenue for the 2024 financial year if a tax policy update is delayed. The senators are referring to new tax laws outlined in <a href=\"https://cointelegraph.com/news/house-passes-1t-infrastructure-bill-with-crypto-tax-for-biden-s-approval\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/house-passes-1t-infrastructure-bill-with-crypto-tax-for-biden-s-approval/amp\">the Senate’s $1.2 trillion infrastructure bill</a> passed in August 2021. The bill aimed to increase the tax reporting requirements for businesses acting as crypto brokers.</p><p><a href=\"https://cointelegraph.com/news/elizabeth-warren-bernie-sanders-crypto-tax-loophole-closure\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elizabeth-warren-bernie-sanders-crypto-tax-loophole-closure/amp\"><strong>Continue reading</strong></a></p><h3>DOJ is concerned about a run on Binance in the case of fraud charges</h3><p>The U.S. Department of Justice (DOJ) is reportedly considering charging cryptocurrency exchange Binance with fraud but is hesitating due to the potential costs to consumers. DOJ officials are concerned about an indictment against Binance causing a run on the exchange similar to what happened with FTX in November 2022. Officials are reportedly considering fines or non-prosecution agreements for Binance rather than criminal charges in an effort to reduce the harm to consumers.</p><p>Binance was already reportedly the <a href=\"https://cointelegraph.com/news/us-justice-department-investigating-binance-for-violating-russian-sanctions-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-justice-department-investigating-binance-for-violating-russian-sanctions-report/amp\">target of a criminal probe</a> in the U.S. for allegedly violating the country’s sanctions on Russia. The U.S. Securities and Exchange Commission also filed a lawsuit against the crypto exchange in June for allegedly offering unregistered securities and operating illegally. In March, the Commodity Futures Trading Commission targeted the exchange and its CEO, Changpeng “CZ” Zhao, for allegedly violating trading and derivatives regulations.</p><p><a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges/amp\"><strong>Continue reading</strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T20:30:00.000Z",
    "title": "Cathie Wood predicts SEC simultaneously allowing multiple spot crypto ETFs: Report",
    "url": "https://cointelegraph.com/news/cathie-wood-predicts-sec-simultaneously-allowing-multiple-spot-crypto-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3745847f-f21c-46b2-bf43-3a2f32b03ed6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ARK Investment Management is one of many firms looking for ways to offer U.S. investors exposure to crypto through exchange-traded funds.</p>\n                    <p><p>ARK Investment Management founder and CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood\">Cathie Wood</a> has reportedly suggested that the United States Securities and Exchange Commission (SEC) will approve multiple spot Bitcoin exchange-traded funds, or ETFs, at the same time.</p><p>In an Aug. 7 interview with Bloomberg, Wood <a href=\"https://news.bloomberglaw.com/securities-law/cathie-wood-says-sec-will-approve-multiple-bitcoin-etfs-at-once\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a> the SEC would approve “more than one [ETF] at once” if it moves forward with any application currently under consideration. ARK Investment Management sent in one of the most recent spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF applications in June after <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application/amp\">amending the submission</a> to include a surveillance-sharing agreement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today on <a href=\"https://twitter.com/BloombergTV?ref_src=twsrc%5Etfw\">@BloombergTV</a>'s ETF IQ <a href=\"https://twitter.com/CathieDWood?ref_src=twsrc%5Etfw\">@CathieDWood</a> agreed with our assessment (below) that if spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> ETFs are approved by the SEC, it will be multiple at the same time and not just one. <a href=\"https://t.co/oNOeqs4HDL\">https://t.co/oNOeqs4HDL</a> <a href=\"https://t.co/K18qFNOtQL\">pic.twitter.com/K18qFNOtQL</a></p>— James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1688633785573588992?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Wood’s remarks were similar to a proposal by Grayscale, the company currently suing the SEC over its refusal to accept an application allowing its Bitcoin Trust to be converted to a spot Bitcoin ETF. In July, Grayscale’s legal team <a href=\"https://cointelegraph.com/news/grayscale-sec-approve-all-bitcoin-etfs-together\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-sec-approve-all-bitcoin-etfs-together/amp\">submitted a letter</a> to the SEC requesting the regulator approve all proposed spot Bitcoin ETFs at the same time to avoid one having an advantage over another.</p><p>The SEC has never approved a spot crypto ETF in the United States, but has <a href=\"https://cointelegraph.com/news/volatility-shares-trust-listing-leveraged-bitcoin-futures-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/volatility-shares-trust-listing-leveraged-bitcoin-futures-etf/amp\">allowed the listing</a> of crypto-linked futures ETFs as well as a leveraged Bitcoin futures ETF from Volatility Shares Trust. At the time of publication, the SEC has received crypto ETF applications from Invesco, BlackRock, Valkyrie, VanEck, Wisdom, Fidelity and ARK Invest.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/1_RCqOFYSzE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-chances-65\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spot-bitcoin-etf-approval-chances-65/amp\"><strong><em>ETF analyst raises spot Bitcoin ETF approval chances in the US to 65%</em></strong></a></p><p>Wood suggested ARK Invest’s spot BTC ETF application deadline would be extended by the SEC. The U.S. financial regulator has until Aug. 13 to either approve, reject, or delay ARK’s current application through an extension or comment period. As ARK filed the paperwork in May 2023, the SEC has a maximum of 240 days — until January 2024 — to reach a final decision.</p><p>The race to get a listing for a spot crypto ETF in the United States has become the subject of scrutiny among many in the crypto industry and media, especially <a href=\"https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review/amp\">following a submission from BlackRock</a>, the largest asset management firm in the world. Regulators in other countries including Canada have already approved similar spot ETF filings from crypto firms.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hk-crypto-etfs-binance-maverick-poly-network-hacked-asia-express/\"><strong><em>HK crypto ETFs on fire, Binance warns on Maverick FOMO, Poly hack: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-07T20:30:28.000Z",
    "title": "Hydro Expansion: Bitfarms Begins 50 MW Bitcoin Mining Farm Buildout in Paraguay",
    "url": "https://news.bitcoin.com/hydro-expansion-bitfarms-begins-50-mw-bitcoin-mining-farm-buildout-in-paraguay/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Hydro Expansion: Bitfarms Begins 50 MW Bitcoin Mining Farm Buildout in Paraguay\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/foosta.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitfarms Ltd. has started development on a new 50-megawatt (MW) Bitcoin mining facility in Paraguay, the company announced on August 7, 2023. The farm will be located in Paso Pe near Bitfarms&#8217; existing mining operations in Villarrica and is expected to be fully operational in the first quarter of 2024. Bitfarms to Pioneer Hydro-Cooled Mining [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T20:35:11.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T20:29:04.000Z",
    "title": "Singapore’s $150M pledge to transform FinTech landscape",
    "url": "https://www.cryptopolitan.com/singapores-150m-pledge-to-transform-fintech/",
    "description": "The Monetary Authority of Singapore (MAS) has made a substantial commitment of up to $150 million Singapore dollars over a span of three years through the Financial Sector Technology and Innovation Scheme. This scheme encompasses a particular focus on supporting innovative FinTech solutions that stem from emerging technologies, notably Web 3.0. In a statement, MAS ... <a title=\"Singapore&#8217;s $150M pledge to transform FinTech landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapores-150m-pledge-to-transform-fintech/\" aria-label=\"More on Singapore&#8217;s $150M pledge to transform FinTech landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T20:20:42.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  }
]