[
  {
    "source": "CoinDesk",
    "date": "2023-08-15T20:44:33.000Z",
    "title": "Altcoin Plunge Leads Crypto Lower; Bitcoin Slips 0.7% to $29,150",
    "url": "https://www.coindesk.com/markets/2023/08/15/altcoin-plunge-leads-crypto-lower-bitcoin-slips-07-to-29150/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A sharp mid-afternoon selloff upended what had been a quiet Tuesday in cryptocurrencies."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-15T20:44:41.000Z",
    "title": "Stellar Invests in MoneyGram in Bid to Be a ‘Digital-Forward’ FinTech Leader",
    "url": "https://decrypt.co/152598/stellar-invests-in-moneygram-in-bid-to-become-a-digital-forward-leader-in-fintech",
    "description": "The two money movers have been working together for years. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T21:01:19.000Z",
    "title": "Bitcoin price action is beginning to mirror BTC’s 2015-2017 pre-bull market cycle",
    "url": "https://cointelegraph.com/news/bitcoin-price-action-mirror-2015-2017-pre-bull-market-cycle",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/48a0eaaa-a431-4644-9269-403360241d42.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price action and the crypto markets’ structure is beginning to mirror the pre-bull run activity seen in previous years, according to Delphi Digital. </p>\n                    <p><p>A recent report by the research firm Delphi Digital illustrates the predictable consistency of price action and trends within the crypto market. The <a href=\"https://twitter.com/Kevin_Kelly_II/status/1691200100922724353\" target=\"_blank\" rel=\"noopener nofollow\">report</a> delves into the interconnectedness between the 4-year Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) cycle and broader economic trends. </p><p>According to Delphi Digital analysts, the ongoing consolidation at $30,000 is similar to the period between 2015 and 2017, with indicators pointing toward an impending all-time high for Bitcoin by the fourth quarter of 2024.</p><h2>Economic cycles impact on Bitcoin's performance</h2><p>Delphi's analysis draws attention to the inherent cyclical nature of the cryptocurrency market. This cyclicality is demonstrated by the timing between peak-to-trough bottoms, recovery periods to previous cycle highs and the timing of price rallies to new cycle tops. Using Bitcoin as a benchmark, Delphi outlines the general blueprint of a cryptocurrency market cycle.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/32ee8da9-6e6d-4a3e-8c95-452b216ccb0e.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price in USD (log scale) reflecting 4-year cycles. Source: Delphi Digital</em></figcaption></figure><p>These 4-year cycles include Bitcoin hitting a new ATH, experiencing an approximate 80% drawdown, followed by a bottom around one year later. This tends to be followed by a two-year recovery to prior highs, and finally, a price rally for another year leading to a new all-time high.</p><p>The research reveals a fascinating correlation between Bitcoin price peaks and changes in the business cycle, as indicated by the ISM Manufacturing Index. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a08e5e30-86cb-4f36-9917-13293f215b89.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin/USD year-over-year (orange) vs. U.S. ISM Manufacturing Index year-over-year (white). Source: Delphi Digital</em></figcaption></figure><p>During Bitcoin's price peaks, the ISM often demonstrates signs of topping out, and active addresses, transaction volumes, and fees reach their highest point. Conversely, as the business cycle signals recovery, so do network activity levels.</p><p>The report emphasizes the Bitcoin Halving's role in these cycles. The last two halvings occurred about 18 months after BTC bottomed and roughly seven months before a new ATH. This historical pattern indicates a projected new ATH for Bitcoin by the fourth quarter of 2024, aligning with the expected timing of the next halving.</p><h2>Bitcoin price action looks similar to theo 2015-2017 pre-bull run phase</h2><p>The report also suggests that the current market environment shares striking similarities with the period between 2015 and 2017. The alignment of market behavior, economic indicators, and historical trends indicates that the current phase is akin to a time of increased risk exposure and potential growth, just as was experienced during that period. </p><p>The report notes that the market's trading patterns, especially in the S&amp;P 500, closely resemble the trajectory observed during 2015-2017. Even during times of uncertainty, such as earnings recession, these patterns persist, mirroring the sentiment of that period.</p><p>The consistent pattern of Bitcoin's cycle, its synchronization with broader economic shifts, and the imminent halving in 2024 all contribute to this thesis.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4d7a876d-b603-49be-8acb-e868f1d85711.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. ISM Manufacturing Index, current (orange) vs. 2013-2019 cycle (white). Source: Delphi Digital</em></figcaption></figure><p>Delphi highlights parallels between the bleak global growth outlook during 2015-2016 and the recent period of economic uncertainty in 2021-2022. Factors such as the strength of the US dollar and changes in global liquidity cycles echo the past.</p><p>The report underscores how gold's performance around that time, influenced by currency debasement concerns, exhibits remarkable similarities to the present. These parallels bolster the argument that macroeconomic conditions are following a familiar trajectory.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1f26a233-d50e-4fb9-9922-eebed839f097.png\"  /><figcaption style=\"text-align: center;\"><em>Gold price in USD (log scale), current (orange) vs. 2015-2019 cycle(white). Source: Delphi Digital</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-low-volatility-and-decline-in-short-term-holders-a-bull-signal\"><strong><em>Is Bitcoin’s record-low volatility and decline in short-term holders a bull market signal?</em></strong></a></p><h2>The crypto market reflects an optimistic outlook, with some red flags</h2><p>Delphi's analysis provides compelling evidence that the crypto market operates within cyclical patterns that mirror broader economic changes. The report's prediction of a new all-time high by the fourth quarter of 2024 aligns with historical halving patterns. This timing, coupled with the state of indicators like the ISM and expectations of renewed liquidity cycles, strengthens the argument for a cycle akin to the one seen in 2015-2017.</p><p>The upcoming Bitcoin Halving in 2024 further adds credence to their expectations of a possible bull market by the fourth quarter of that year. While the analysis is not without its risks and uncertainties, the overall outlook for the cryptocurrency market in the next 12-18 months appears promising, given the stacking catalysts and historical precedent.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T20:54:27.000Z",
    "title": "Binance’s crypto domination opportunity slips away",
    "url": "https://www.cryptopolitan.com/binance-crypto-domination-opportunity/",
    "description": "Binance, once heralded as the crown jewel of the cryptocurrency world, finds its supremacy shaken. The swift rise and subsequent challenges faced by the company provide a panoramic view into the volatile realm of digital currencies. From Rise to Fall: The Binance Saga It seemed like only yesterday when Changpeng Zhao, the brain behind Binance, ... <a title=\"Binance&#8217;s crypto domination opportunity slips away\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-crypto-domination-opportunity/\" aria-label=\"More on Binance&#8217;s crypto domination opportunity slips away\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T21:00:55.000Z",
    "title": "THORSwap (THOR) 300% Surge In A Week: What’s The Secret Behind Its Thunderous Rise?",
    "url": "https://www.newsbtc.com/thorchain/thor-300-surge-in-a-week-whats-the-secret-behind-its-thunderous-rise/",
    "description": "In recent weeks, the native token of THORSwap, THOR, has experienced a surge, with its value increasing by nearly 300%. This surge has attracted attention within the crypto community, prompting an exploration of the factors contributing to THOR&#8217;s rapid growth.  THORSwap, a cross-chain decentralized exchange (DEX) aggregator built on the THORChain network, has been pivotal in driving this surge.  THORSwap Emerges As A Leading DEX? According to a report by crypto analytics Messari, THORSwap stands out among other automated market maker (AMM) protocols by offering a range of distinctive features.  As a DEX aggregator, it leverages the underlying THORChain network to facilitate seamless cross-chain transactions, eliminating the need for bridging or wrapped assets.  The report claims that THORSwap&#8217;s cross-chain DEX aggregation feature sets it apart by tapping into multiple liquidity sources and supporting a wide range of digital assets.  Related Reading: This Event Causes Bitcoin Traders’ Sentiment To Rise, Will BTC Surpass $30,000? By integrating with 1inch and assessing liquidity from over 50 sources on Ethereum, Polygon, and the Binance Smart Chain, THORSwap becomes an “unparalleled aggregator of aggregators,” offering users an extensive selection of native assets to swap, according to Messari. Moreover, the THOR token functions as the native utility token for THORSwap, offering traders numerous incentives. THOR holders can benefit from yields, revenue fee sharing, and trading discounts.  Moreover, THORSwap adopts continuous liquidity pools (CLPs), an innovation pioneered by protocols like Bancor. According to the report, CLPs create trustless pools of liquidity that eliminate the need for matching buyers and sellers, promoting a “well-functioning” decentralized market with limited volatility and price manipulation.  Additionally, THORSwap offers Impermanent Loss Protection (IPL) to safeguard liquidity providers from potential losses, ensuring they are better off providing liquidity than holding the underlying assets. THORChain recently introduced Synthetic Assets (&#8220;Synths&#8221;) to address the challenges of interacting with multiple blockchains.  These fully collateralized representations of assets, backed by THORChain&#8217;s liquidity pools, enable cost-effective and instant settlement without the risk of impermanent loss or liquidation.  The introduction of Synths has increased demand for THOR tokens while simultaneously boosting the network&#8217;s Total Locked Value (TVL). THORChain&#8217;s Performance Reflects Growing Interest? THORChain has reached significant milestones, solidifying its position in the industry. The report noted that the Total Value Locked metric stands impressively at $218.80 million, showcasing the trust and confidence users place in THORSwap and THORChain&#8217;s cross-chain liquidity provision capabilities.  Furthermore, the Total Volume of $11.60 billion represents the cumulative value of trades executed on the THORSwap platform. This figure reflects the increasing trading activity and demand for cross-chain swaps facilitated by THORChain&#8217;s protocol. These statistics highlight the influence and adoption of THORChain within the DeFi space. As the demand for cross-chain liquidity continues to surge, THORChain&#8217;s protocol and THORSwap&#8217;s user-friendly interface can potentially position them as industry leaders. Related Reading: Renowned Finance Author Says Bitcoin Price Will Reach $1 Million If This Happens As the THORChain ecosystem continues to evolve and demonstrate its value, the growth of the THOR token highlights the platform&#8217;s increasing adoption and recognition in the market.  Investors and crypto enthusiasts seem to recognize THORChain as a critical player in the DeFi space, leveraging its protocol to harness the benefits of cross-chain liquidity provision. As of the current market data, THOR is trading at $0.339695. Although it has experienced an 11.6% decrease in the past 24 hours, it has maintained substantial gains over the past seven and fourteen days, with impressive increases of 307% and 330%, respectively. Featured image from iStock, chart from TradingView.com"
  }
]