[
  {
    "source": "Decrypt",
    "date": "2024-02-22T00:45:08.000Z",
    "title": "NVIDIA Earnings Blow Past Estimates, Mark ‘Tipping Point’ for AI",
    "url": "https://decrypt.co/218491/nvidia-quarterly-report-massive-growth-ai-stocks-tokens",
    "description": "AI-related stocks and tokens also saw significant price jumps, fueled by the chipmaker's good news."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-22T00:59:00.000Z",
    "title": "AI Ethical Implications in the Healthcare Industry – Report",
    "url": "https://www.cryptopolitan.com/ai-ethical-implications-in-the-healthcare/",
    "description": "Artificial Intelligence (AI) is changing medical diagnosis, treatment, and patient care. AI is changing entire industries beyond the healthcare industry, where there are less stringent regulatory requirements. Video and audio content creation have changed, and adopting AI is proving a first option. The fly in the ointment is AI ethical implications. Back to the healthcare [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-22T00:41:21.000Z",
    "title": "Apple adopts post-quantum cryptography for iMessage",
    "url": "https://www.cryptopolitan.com/apple-post-quantum-cryptography-for-imessage/",
    "description": "Apple just launched PQ3, a huge step forward in making iMessage&#8217;s encryption stronger, as part of the iOS 17.4 update on February 21. This move places Apple among the few companies that have added post-quantum cryptography to their messaging apps, a kind of technology built to handle the potential power of quantum computing. Before Apple, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T01:00:55.000Z",
    "title": "Ethereum Whale Buys $187 Million ETH In 3-Day Spree, Anticipating Further Surge?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whale-buys-187-million-eth-in-3-day-spree-anticipating-further-surge/",
    "description": "In recent on-chain data from Spot On Chain, an Ethereum whale appears to have engaged in significant accumulation activity, sparking interest and speculation within the ETH community. According to the platform, the whale address in question has purchased a total of 64,501 ETH in the past three days, amounting to roughly $187 million at current market prices, Related Reading: Behind Ethereum’s Surge: Here’s How This Whale Is Taking Advantage Of The ETH Rally Ethereum Whale Accumulation Spot On Chain reported that earlier today, the whale acquired approximately 13,526 ETH at an average price of $2,947 per ETH. This accumulation, valued at over $39 million, adds to the already substantial holdings of the whale, suggesting a bullish outlook on Ethereum&#8217;s future trajectory. The platform&#8217;s data further reveals that the whale withdrew 10,136 ETH from Binance while purchasing 3,390 ETH from 1inch. These purchases have compounded the whale&#8217;s accumulation of ETH in the past three days to a total of 64,501 ETH. Additionally, Spot On Chain highlights the withdrawal of an additional 40 million USDT from Binance, prompting speculation regarding its potential use for further Ethereum purchases. According to the portfolio image above that Spot On Chain shared, the whale&#8217;s wallet holds a total of 91,321 ETH, in addition to approximately $49.8 million worth of USDT and 5,485 STETH. These assets, in total, are estimated to be $334 million. Giant whale 0x7a9 allegedly bought 13,526 $ETH ($39.85M) at ~$2,947 again! • withdrew 10,136 $ETH ($29.85M) from #Binance • bought 3,390 $ETH with 10M $USDT #1inch Overall, the whale has bought 64,501 $ETH ($185.5M) in the past 3 days! It also withdrew another 40M $USDT from… https://t.co/UHIVXfx6Wq pic.twitter.com/ySbvIv2mux — Spot On Chain (@spotonchain) February 21, 2024 Ethereum&#8217;s Price Action And Expert Sentiment Ethereum has continued to showcase bullish momentum, trading up by nearly 6% over the past week. However, despite briefly surpassing the $3,000 mark, Ethereum has retraced slightly in the past 24 hours, trading around $2,900 at the time of writing. This pullback has not dampened optimism within the crypto community, with many anticipating further upward movement. Industry experts have weighed in on Ethereum&#8217;s performance, with Stefan von Haenisch of OSL SG Pte in Singapore noting the cryptocurrency&#8217;s potential to outperform Bitcoin in the coming months. Related Reading: Ethereum Price Tops $3,000, But ‘Is Completely Detached From Reality’: Expert Haenisch attributes this optimism partly to speculation surrounding the potential approval of spot Ethereum exchange-traded funds in the US. Michaël van de Poppe, CEO of MN Trading, echoes this sentiment, forecasting a potential surge for Ethereum to $3,800 to $4,500 shortly. #Ethereum is on its way towards $3,800-4,500. pic.twitter.com/TfoBGloBsH — Michaël van de Poppe (@CryptoMichNL) February 19, 2024 Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-22T01:00:41.000Z",
    "title": "Analyst Predicts 200% Rally for AI-Related Altcoin, Eyes More Rallies for Sam Altman’s Worldcoin (WLD)",
    "url": "https://dailyhodl.com/2024/02/21/analyst-predicts-200-rally-for-ai-related-altcoin-eyes-more-rallies-for-sam-altmans-worldcoin-wld/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/rally-eyes-more-rallies.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is predicting big bursts to the upside for two artificial intelligence (AI)-related altcoins including Worldcoin (WLD). Ali Martinez tells his 46,500 followers on the social media platform X that he thinks the native asset of the decentralized storage network Filecoin (FIL) is close to witnessing a big breakout. Filecoin&#8217;s decentralized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/analyst-predicts-200-rally-for-ai-related-altcoin-eyes-more-rallies-for-sam-altmans-worldcoin-wld/\">Analyst Predicts 200% Rally for AI-Related Altcoin, Eyes More Rallies for Sam Altman’s Worldcoin (WLD)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]