[
  {
    "source": "NewsBTC",
    "date": "2023-06-26T23:00:08.000Z",
    "title": "The Blessing Of July: Can Bitcoin Climb To $36,000 In The Coming Month?",
    "url": "https://www.newsbtc.com/bitcoin-news/the-blessing-of-july-can-bitcoin-climb-to-36000-in-the-coming-month/",
    "description": "The month of June is quickly drawing to an end and although the price of Bitcoin is maintaining a bullish streak, it is still sitting well below expectations. However, all hope is not lost as the market moves into the month of July which has historically been a bullish month for the digital asset. So the question now is, will Bitcoin will able to finally break above the $36,000 level in the new month? July Could Hold The Answers For Bitcoin In a June 26 report, Markus Thielen, Head of Research at Matrixport pointed to a possible bull run for Bitcoin in the month of July. The prediction is not without merit as Bitcoin has historically done well during this month. Although there have been years where this did not hold true, the years in which it did far outweigh the latter. Related Reading: Shiba Inu Becomes 14th Largest Cryptocurrency As Bull Rally Heats Up Thielen points to the years 2020, 2021, and 2022, all of which saw the digital asset move up double-digits. Additionally, in the last decade, July has seen the price of BTC recover significantly for a total of seven years compared to only three years where it failed to rally. Given this, the head of research paints a bullish picture for the cryptocurrency that could see it reach as high as $36,000. This figure plays on the fact that over the last three years, BTC’s price in July has risen an average of 20%, so another 20% move for BTC from its current level will see it move above $36,000. Furthermore, expectations going toward the end of the year 2023 also remain very bullish as Thielen also sees a possible move up to $45,000 for the digital asset. “Bitcoin tends to move 10,000 points up, only to retrace 5,000 and then rally another 10,000 points (until we reach $45,000 by year-end,” the head of research said. July is a historically bullish month for BTC &#124; Source: Matrixport He added that: “We have seen a rally from nearly $15,000 to $25,000 only to drop back to $20,000 due to the U.S banking crisis, then rally another 10,000 points to $30,000 and sell off to $25,000 because of the Binance-SEC lawsuit. Now we appear on the way to $35,000 as the expectations for the Bitcoin ETFs approval will bring more U.S. institutions and U.S. retail into this space.” US Investors Continue To Lead BTC Rally US Investors have been participating more in the crypto market, especially when it comes to Bitcoin, as reported by NewsBTC last week, and this increased participation from the region has been fueling the digital asset’s rally so far. BTC shows strength above $30,000 &#124; Source: BTCUSD on TradingView.com The Matrixport report shows that most of the BTC rally has occurred during US trading hours. To put this in perspective, BTC prices have risen 16% during US trading hours, 1% during European trading hours, and have declined by 7% during Asian trading hours. Related Reading: Bitcoin Investor Sentiment Suggests BTC Rally Is Far From Over This suggests that US investors are currently driving the rally, fueled by the renewed positive sentiment around BlackRock and multiple asset managers filing for Bitcoin ETFs in the US. Thielen highlights that this is “a sign that U.S. institutions are buying Bitcoin while other regions are less active. Claiming that ‘Crypto is dead in the U.S.’ appears to be a misconception. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]