[
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T11:25:50.000Z",
    "title": "Elon Musk accuses Mark Zuckerberg of cheating: Twitter vs. Threads",
    "url": "https://cointelegraph.com/news/elon-musk-accuses-mark-zuckerberg-of-cheating-twitter-vs-threads",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1b792ab9-641b-43ab-adb2-6e665baa07a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Twitter lawyer Alex Spiro sent a letter to Meta CEO Mark Zuckerberg threatening legal action against the company’s “copycat” application called Threads.</p>\n                    <p><p>Twitter executive chairman Elon Musk alleged in a social media post that Meta is “cheating” over the release of Threads, a text-based social network resembling Twitter.</p><p>While Musk wrote that he is fine with competition, he made it clear that he would not tolerate cheating. The billionaire’s remarks come after Twitter lawyer Alex Spiro sent a letter to Meta CEO Mark Zuckerberg threatening legal action. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Competition is fine, cheating is not</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1677042708756439041?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On July 5, Spiro <a href=\"https://cdn.sanity.io/files/ifn0l6bs/production/27109f01431939c8177d408d3c9848c3b46632cd.pdf\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in the letter that Twitter has the intention to “strictly enforce its intellectual property rights.“ The firm also demanded that Meta immediately stop using Twitter’s trade secrets. </p><p>According to Spiro’s letter, Meta hired former Twitter employees with access to confidential information, including Twitter’s trade secrets. Spiro wrote that Meta assigned these employees to develop a “copycat” application called Threads, alleging that the company used Twitter’s trade secrets and intellectual property to speed up the development of the competitor app. </p><p>Furthermore, Spiro also highlighted that the letter serves as a formal notice to Meta to preserve any documents relevant to a dispute between Twitter and Meta, as well as former Twitter employees that Meta now employs. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/twitter-sees-less-google-exposure-from-rate-limit-change\"><strong><em>Crypto Twitter will see less exposure on Google due to rate limit slash</em></strong></a></p><p>Spiro also noted that Meta is not allowed to engage in any crawling or scraping of Twitter’s followers or following data. The lawyer wrote that this is prohibited for any reason without the company’s prior consent. </p><p>On July 5, Meta’s new text-based social network, Threads, was <a href=\"https://cointelegraph.com/news/will-crypto-community-move-to-meta-twitter-rival-threads\">released in 100 countries</a>. The app was rolled out days after Twitter’s rate limit debacle when the social platform temporarily <a href=\"https://cointelegraph.com/news/twitter-down-elon-musk-rate-limit-exceeded\">limited the number of posts</a> users could read. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction: What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T11:14:00.000Z",
    "title": "How the spot Bitcoin ETF filings affected the crypto industry in June: Report",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-filings-affect-crypto-industry-cointelegraph-research-june-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/16e056ae-7321-40ca-8e07-2c7f7c68bd81.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The competition among zk-Rollup-based scaling solutions is tightening while the security tokens market continues steadily.</p>\n                    <p><p>The news surrounding BlackRock’s application for a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (EFT) sent the asset’s price from its local lows in mid-June to a strong monthly close of +12%. To most observers, this was a sign that institutional investment into the cryptosphere is once again on the horizon. A future approval of a spot ETF combined with rate cuts from the United States Federal Reserve could provide the ideal catalysts for the next bull run.</p><p>For those keen to gain a deeper understanding of the crypto space’s various sectors and their fundamental trends, Cointelegraph Research publishes its monthly “Investor Insights Report,” which dives into venture capital, derivatives, <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, regulation and much more. This month, Cointelegraph Research examined how various sectors reacted to the bullish news surrounding BlackRock’s ETF filing with the U.S. Securities and Exchange Commission.</p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/detail/investor-insights-report-etf-filings-revitalize-the-industry-in-june\"><em>The report is available for free on the Cointelegraph Research Terminal.</em></a></p><p>While crypto-related stocks, especially those of mining ventures, immediately benefitted from the news, other sectors traditionally tied closer to altcoin activity, such as DeFi, continued in bear-market mode unperturbed.</p><h2>Zk-Rollups race heating up ahead of next bull run</h2><p>Many suspect that novel layer-2 scaling solutions for Ethereum will be among the big gainers in the next bull run. However, the competition in the space is tight. Zero-knowledge (ZK) rollup technology, which allows a shortened summary of transaction batches and smart contract executions to be submitted to the chain, will arguably be the biggest area of innovation in this crypto market cycle.</p><p><a href=\"https://cointelegraph.com/news/zksync-new-hyperchains-network-testnet-by-year-end\">ZkSync Era’s ZK Stack</a>, <a href=\"https://cointelegraph.com/news/polygon-co-founder-proposes-zkevm-validium-upgrade-to-improve-security\">Polygon zkEVM</a> and <a href=\"https://cointelegraph.com/news/starknet-evm-compatibility-scalability-zk-evm-kakarot-testnet\">StarkWare’s Starknet</a> have all been in the news for their recent or newly proposed innovations. But what does the data say about the relative success of these projects?</p><p>In June, Polygon zkEVM outperformed zkSync and Starknet in terms of growth in total value locked (TVL), gaining an impressive 71% month-over-month. However, it still lags an order of magnitude behind the dominant zero-knowledge protocol, zkSync, which currently has a TVL of $120 million. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/adaec0cd-571c-4dcc-bdde-db398fefd782.png\"  /></figure><p>The recent growth of zkEVM can be attributed to the slew of DeFi protocols it has attracted — such as QuickSwap, Balancer and SushiSwap — with many more in the pipeline. These and other recent developments are discussed every month in the DeFi section of the Cointelegraph Research Monthly Trends Report.</p><h2>Security tokens market chugs along unperturbed </h2><p>Security tokens are a remarkable sector of the industry in that they seem to have continued their modest but steady growth throughout the bear market, apparently unphased by the ETF filings that rocked the rest of the market. </p><p>During the first half of the year, the total market capitalization of security tokens rose from $14.93 billion to $16.76 billion, as seen in the figure below. The 1.65% growth seen in June was connected to several notable deals and security token offerings (STOs). </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6fda7833-3bfc-4291-9c6e-1ac4042b1276.png\"  /></figure><p>Though the development of tokenized securities is controversial in the crypto community, banks such as Citigroup and Bank of America have predicted that the tokenization of real-world assets may drive trillions of dollars to blockchains in the future. While most securities offerings currently involve real estate, other types are quickly gaining pace. With a section on STOs, Cointelegraph Research’s monthly Investor Insights Report covers this lesser-known part of the crypto industry — one that may ultimately grow into a multitrillion-dollar sector.</p><h2>The Cointelegraph Research team</h2><p>Cointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template><p>Demelza Hays, Ph.D., is the director of research at Cointelegraph. Hays has compiled a team of subject matter experts from finance, economics and technology to bring the premier source for industry reports and insightful analysis to the market. The team utilizes APIs from various sources to provide accurate, useful information and analyses. </p><p>With decades of combined experience in traditional finance, business, engineering, technology and research, the <a href=\"https://research.cointelegraph.com/\">Cointelegraph Research team</a> is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report. </p><p><em>The opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T11:30:00.000Z",
    "title": "GPT-4 API now available to all, as OpenAI goes all-in on chat",
    "url": "https://cryptoslate.com/gpt-4-api-now-available-to-all-as-openai-goes-all-in-on-chat-completions/",
    "description": "<p>The global tech industry is witnessing a milestone as the much-anticipated GPT-4 API from OpenAI becomes widely accessible to all paying customers. The GPT-4 API has been desired by developers worldwide since its introduction in March, but to date, it has only been available to select customers. Now, these developers will have the opportunity to leverage [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gpt-4-api-now-available-to-all-as-openai-goes-all-in-on-chat-completions/\">GPT-4 API now available to all, as OpenAI goes all-in on chat</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-07T11:30:17.000Z",
    "title": "Bitwage Purges USDC Payments for US Residents Due to a ‘More Strict Regulatory Climate’",
    "url": "https://news.bitcoin.com/bitwage-purges-usdc-payments-for-us-residents-due-to-a-more-strict-regulatory-climate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitwage Purges USDC Payments for US Resident Due to a &#039;More Strict Regulatory Climate&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitwage, a cryptocurrency payroll company, has announced it will remove USDC-based payments for U.S. residents. In an email sent to U.S.-based customers, Bitwage explains removing the second-largest stablecoin by market cap from its platform is related to a &#x201C;more strict regulatory climate&#x201D; in the U.S. regarding crypto. Bitwage Drops USDC Payments in the U.S. Crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T11:26:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T11:30:42.000Z",
    "title": "Fantom (FTM) Sheds 10% Following Multichain Bridge “Withdrawals”",
    "url": "https://www.newsbtc.com/fantom/fantom-ftm-sheds-10-following-multichain-bridge-withdrawals/",
    "description": "Fantom (FTM) price has been experiencing a dip in the past few days. This fall appears to have worsened in the last 24 hours due to FUD (fear, uncertainty, and doubt) spreading amongst investors. CoinGecko data shows that the FTM token has lost 10.3% of its value in the last 24 hours. This price plunge has been linked to the movement of crypto assets from Multichain’s Fantom bridge to separate wallet addresses. FTM Price Declines Amidst “Abnormal” Withdrawals From Multichain Bridge There has been some uncertainty surrounding the Fantom network lately due to the “abnormal” movement of funds from its Multichain bridge &#8211; a cross-chain bridging protocol that enables the transfer of assets between different blockchains. Related Reading: SOL Price Prediction: Solana Smashes Key Resistance, $22 Could Be Next On July 6, over $100 million worth of crypto assets were withdrawn from Multichain’s Fantom bridge. On-chain data reveals that 7,214 Wrapped Ether (WETH) tokens (worth $13.6 million), 1,024 Wrapped Bitcoin (WBTC) (equivalent to $31 million), and $58 million worth of US Dollar Coin (USDC) were removed from the network’s multichain bridge. Furthermore, the movement of funds from bridges of other blockchains has also been reported. Notably, Dogechain saw the withdrawal of more than $600,000 in USDC from its bridge. In addition, $4.8 million of USDC and $1 million worth of Tether (USDT) were withdrawn from Multichain’s Moonriver bridge. Although Multichain operates on other blockchains, it is understood that the Fantom blockchain is particularly reliant on the cross-chain protocol. According to trading firm Thanefield, nearly 40% of crypto assets on Fantom (excluding its native FTM tokens) made it to the blockchain through Multichain’s bridges.  The price of FTM has been on a decline since these on-chain activities came under focus. As of this writing, the FTM token trades at $0.269819, losing more than 10% of its value in the past day.  FTMUSD trading at $0.2692 &#124; Source: FTMUSD chart from TradingView Fantom Spreads Calm Amidst Fears Of Exploit In the early hours of today, Multichain took to Twitter to address these &#8220;abnormal&#8221; withdrawals, imploring its users to suspend the use of its platform. The protocol claims not to know what happened but assured its users that an investigation is ongoing. The lockup assets on the Multichain MPC address have been moved to an unknown address abnormally. The team is not sure what happened and is currently investigating. It is recommended that all users suspend the use of Multichain services and revoke all contract approvals… — Multichain (Previously Anyswap) (@MultichainOrg) July 6, 2023 This announcement comes after speculations of exploitation by the general online population. Specifically, security firm PeckShield tagged the Multichain team in a tweet, asking the protocol to look at Fantom bridge transactions. Five hours after its initial tweet, the security firm then said &#8220;It seems the hack is confirmed.&#8221;  It is worth noting that Multichain has been going through unspecified technical problems in the past few months. In May, the protocol’s team announced that it had lost contact with its CEO and was experiencing multiple issues due to unforeseeable circumstances. Related Reading: FUD Or Fact? Multichain Team Arrested, On-Chain Data Uncovers Fantom Exposure To Wrapped Tokens That said, Fantom has released a couple of statements on Twitter to address the issue. “We are aware of a situation unfolding on the Multichain bridge. We are actively evaluating the circumstances and will provide an update as soon as we have more to share,” the first tweet read. In another tweet, the network assured users that the FTM token was never issued or managed by Multichain. This means that WFTM (Wrapped Fantom), FTM ERC-20, and FTM on the Opera Mainnet are unaffected. Featured image from Fantom, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T11:30:41.000Z",
    "title": "Tradecurve on the path to raise 20M, Hedera, and Theta Network community take notice",
    "url": "https://www.crypto-news-flash.com/tradecurve-on-the-path-to-raise-20m-hedera-and-theta-network-community-take-notice/?utm_source=rss&utm_medium=rss&utm_campaign=tradecurve-on-the-path-to-raise-20m-hedera-and-theta-network-community-take-notice",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T115953.923.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T115953.923.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T115953.923-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market is known for its high volatility and turbulence, as many cryptocurrencies have experienced large swings in their value. However, even during market turbulence, Tradecurve is on a straight path towards raising $20 million during its presale with its current momentum. Members from the Hedera and Theta Network communities have taken notice, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T11:21:26.000Z",
    "title": "Floki and Bone Rival Pepe Price Skyrockets by 75% in 7 Days as Whales Go on a Buying Spree – Can It Turn Your $100 into a Fortune?",
    "url": "https://www.crypto-news-flash.com/floki-and-bone-rival-pepe-price-skyrockets-by-75-in-7-days-as-whales-go-on-a-buying-spree-can-it-turn-your-100-into-a-fortune/?utm_source=rss&utm_medium=rss&utm_campaign=floki-and-bone-rival-pepe-price-skyrockets-by-75-in-7-days-as-whales-go-on-a-buying-spree-can-it-turn-your-100-into-a-fortune",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Pepe has experienced an impressive surge of over 75% within the last week. Recently, a Pepe whale withdrew an astounding 2 trillion PEPE tokens from Binance, worth roughly $3.28 million. New meme coins have exploded recently, adding to the vibrant cryptocurrency market. These meme coins might confuse people outside of their online communities, but they [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-07T11:10:00.000Z",
    "title": "‘Bitcoin is the Logical Choice for AI,’ Claims BitMEX CEO",
    "url": "https://coinedition.com/bitcoin-is-the-logical-choice-for-ai-claims-bitmex-ceo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/BitMEX_Releases_2023_Crypto_Outlook_Three_Scenarios_of_Crypto-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Arthur Hayes, the American entrepreneur, and CEO of the crypto trading platform BitMEX, in his newly released article, asserted that the world’s first virtual asset, Bitcoin, would be the “currency of choice” for Artificial Intelligence (AI). The BitMEX CEO reiterated that AI would prefer BTC as the currency that denominates its economic actions. On July [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-is-the-logical-choice-for-ai-claims-bitmex-ceo/\">‘Bitcoin is the Logical Choice for AI,’ Claims BitMEX CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]