[
  {
    "source": "CryptoSlate",
    "date": "2023-07-02T11:38:52.000Z",
    "title": "Crypto ATM provider Bitcoin Depot announces Nasdaq listing for July 3",
    "url": "https://cryptoslate.com/crypto-atm-provider-bitcoin-depot-announces-nasdaq-listing-for-july-3/",
    "description": "<p>Bitcoin Depot, a leading U.S.-based Bitcoin ATM operator, and GSR II Meteora Acquisition Corp.  — a special purpose acquisition company have announced the successful closing of their business combination, according to a recent press release. The Consolidation and Future Prospects Moving forward, the merged entity will adopt the name Bitcoin Depot Inc. and will continue [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-atm-provider-bitcoin-depot-announces-nasdaq-listing-for-july-3/\">Crypto ATM provider Bitcoin Depot announces Nasdaq listing for July 3</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-02T11:26:24.000Z",
    "title": "SHIB: The ‘Profound’ Impact of Shiba Inu’s L2 Blockchain Shibarium on $BONE Token",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shib-the-profound-impact-of-shiba-inus-l2-blockchain-shibarium-on-bone-token/",
    "description": "According to “LucieShib,” a member of the official Shiba Ecosystem content marketing team, Shibarium, which is Shiba Inu’s Layer 2 scaling solution, is poised to bring about transformative changes for projects while also having a significant influence on the $BONE token, which serves as Shibarium’s gas token. The Shiba Inu cryptocurrency project, rooted in the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-02T11:09:46.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-02T11:38:00.000Z",
    "title": "Cardano releases development updates, ADA is recovering",
    "url": "https://crypto.news/cardano-releases-development-updates-ada-is-recovering/",
    "description": "Cardano has just released this week’s updates highlighting the technical developments on the network, including smart contracts, governance, Project Catalyst, and scaling. Meanwhile, its native token, ADA, has begun recovering and trades in the green. The Cardano update shows that&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-02T11:31:33.000Z",
    "title": "Merely 2.6% of Portugals own crypto assets, data shows",
    "url": "https://crypto.news/merely-2-6-of-portugals-own-crypto-assets-data-shows/",
    "description": "The number of Portuguese people investing in cryptocurrencies like bitcoin and ethereum has been gradually increasing, reaching around 268,000 individuals recently, according to Triple-A, a digital currency payment facilitator. However, compared to the global population, the interest of the Portuguese&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-02T11:21:13.000Z",
    "title": "Bittrex defies SEC’s grip in lawsuit demanding dismissal",
    "url": "https://crypto.news/bittrex-defies-secs-grip-in-lawsuit-demanding-dismissal/",
    "description": "Crypto exchange Bittrex has filed a motion to dismiss a lawsuit against them by the United States Securities and Exchange Commission (SEC). Bittrex teamed up with Coinbase to defend itself against the SEC, highlighting the need for clearer regulations in&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-02T11:16:57.000Z",
    "title": "Conflux (CFX) Sheds 16% Despite $18 Million Investment From DWF Labs",
    "url": "https://www.newsbtc.com/altcoin/conflux-shed-16-in-a-week-despite-18-million-from-dwf-labs/",
    "description": "Conflux (CFX) has had a positive run so far in 2023, placing itself amongst the best-performing altcoins in the first half of the year. However, the “Chinese Ethereum” has been trading in the red in the past few days. According to data from CoinGecko, CFX lost nearly 16% of its value in the past week.  Related Reading: Compound (COMP) Grows 33% In 7 Days As Whale Activities Soar DWF Labs Acquires $18 Million Worth Of CFX Tokens This CFX price fall comes despite the acquisition made by DWF Labs in the past week. On Wednesday, June 28, the Conflux network announced that the multi-stage Web3 investment firm purchased $18 million worth of its token. DWF Labs backs Conflux with $18M! DWF Labs, a global digital asset market maker and multi-stage Web3 investment firm, has reaffirmed its commitment to supporting the growth of Conflux.https://t.co/ogOLJHvbQH Demonstrating their commitment, DWF Labs purchased $18M worth of… — Conflux Network Official (@Conflux_Network) June 28, 2023 This latest investment is a follow-up to the initial $10 million purchase of CFX tokens in March. It is understood to be a demonstration of DWF Labs’ commitment to “supporting the growth of Conflux”. In a tweet, the head of DWF labs, Andrei Grachev, emphasized how the network is an excellent technology and his firm’s willingness to increase its CFX holdings.  @Conflux_Network is a bright example how a great team, technology, BD, GR and PR should perform. We know each other since ages and I’m more than happy to increase our $CFX holdings and support the guys with everything. Long East, Long HK, Long Web3 LFG! pic.twitter.com/hSzb3VYjfP — Andrei Grachev (@ag_dwf) June 28, 2023 Conflux has built a reputation as a cutting-edge technology thanks to its “Tree-Graph” consensus algorithm, which enables the blockchain to achieve a high transaction throughput (tps) of up to 6,000 transactions. As inferred earlier, the Conflux ecosystem has been experiencing steady growth since the turn of the year. Recently, the blockchain disclosed a partnership with dappOS, which promises mutual benefits for both entities. Conflux So Far In 2023 &#8211; Price Overview The price of CFX has been on an upward trajectory for most of the year, recording an 825% increase in the past six months. This price rally is consistent with the expansion and increased adoption of the Conflux ecosystem. During the peak of this rally, Conflux announced several strategic partnerships with some of China’s biggest companies. Notably, the tree-graph consensus algorithm Layer-1 network announced a partnership with China Telecom to develop a blockchain SIM (BSIM) card in February. However, we’ve watched the token’s price trend downward from its height earlier in the year. Since reaching its yearly peak of $0.4613 on March 20, the CFX token has lost more than 55% of its value, trading as low as $0.176 in mid-June. As of this writing, CFX changes hands at $0.204467, according to CoinGecko data. This represents a 1% increase in the last 24 hours. That said, the token&#8217;s price has declined in recent weeks, shedding more than 28% in the past month. CFXUSD trading at $0.205142 &#124; Source: CFXUSD chart from TradingView The Conflux token has a daily trading volume of $44.4 million, representing a 62.6% decline from the past day. A decrease in 24-hour trading volume signals a recent fall in market activity. Related Reading: ENS Rises 10% As Ethereum Name Service Considers Expanding To Layer-2 Featured image from SoFi, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-02T11:34:00.000Z",
    "title": "SOL Surpassed ETH in Daily NFT Sales for the First Time Ever",
    "url": "https://coinedition.com/sol-surpassed-eth-in-daily-nft-sales-for-the-first-time-ever/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/02-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SOL Surpassed ETH in Daily NFT Sales for the First Time Ever\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/02-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/02-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/02-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/02-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/02-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/02-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/02-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/02-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/02-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/02-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/02-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/02-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/02-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/02-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/02-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/02-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A Solana (SOL) data analytics platform, Step Data Insights, took to Twitter on Friday to announce that Solana flipped Ethereum (ETH) in terms of 24-hour NFT sales volume for the first time ever. The analytics platform highlighted the fact that Solana was able to achieve this in a bear market, which is an enormous feat. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sol-surpassed-eth-in-daily-nft-sales-for-the-first-time-ever/\">SOL Surpassed ETH in Daily NFT Sales for the First Time Ever</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]