[
  {
    "source": "Decrypt",
    "date": "2023-06-21T14:56:35.000Z",
    "title": "Marvel's 'Secret Invasion' Show Uses Generative AI—And Fans and Creators Are Livid",
    "url": "https://decrypt.co/145613/marvels-secret-invasion-show-uses-generative-ai-and-fans-and-creators-are-livid",
    "description": "\"It's utterly horrifying,\" said one artist of the realization that Marvel's latest comic book adaptation tapped AI tools."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T14:47:47.000Z",
    "title": "Bitcoin Cash, Stacks, and Pepe Lead Alts Parade as Bitcoin Breaks Above $29,000",
    "url": "https://decrypt.co/145590/bitcoin-cash-stacks-and-other-alts-jump-as-bitcoin-breaks-above-29000",
    "description": "Bitcoin has brought the rest of the market with it as it closes in on $30,000, as altcoins follow in its wake."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T14:55:18.000Z",
    "title": "Binance expands to Kazakhstan amid global regulatory hurdles",
    "url": "https://cryptoslate.com/binance-expands-to-kazakhstan-amid-global-regulatory-hurdles/",
    "description": "<p>Embattled crypto exchange Binance has launched a regulated digital asset platform in Kazakhstan amid its regulatory issues across multiple jurisdictions. In a June 21 statement, Binance said it had secured licensing from Kazakhstan&#8217;s AIFC Financial Services Authority (AFSA) to manage a digital asset platform and provide custodial services at the Astana International Finance Center (AIFC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-expands-to-kazakhstan-amid-global-regulatory-hurdles/\">Binance expands to Kazakhstan amid global regulatory hurdles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T15:00:00.000Z",
    "title": "PLAYA3ULL Games Enhance The Blockchain Ecosystem With A 10% Burn Mechanic And A New Dedicated Blockchain On An Avalanche Subnet",
    "url": "https://cryptodaily.co.uk/2023/06/playa3ull-games-enhance-the-blockchain-ecosystem-with-a-10-burn-mechanic-and-a-new-dedicated-blockchain-on-an-avalanche-subnet",
    "description": "Web3, Global Gaming Industry, June 21, 2023\n<p class=\"s5\">PLAYA3ULL GAMES, a front-runner in the blockchain gaming landscape, is revolutionizing the sector by launching its own blockchain on an Avalanche Subnet, strengthening security and improving integration capabilities.</p>\n<p class=\"s5\">In a significant development, the company has introduced a notable 10% burn mechanic designed to enhance the deflationary attribute of its native 3ULL coin strategically. This move guarantees to increase the coin's scarcity over time. All in-game assets in the PLAYA3ULL GAMES ecosystem are held in Non-Fungible Tokens (NFTs). The burn mechanic will apply to all NFTs sold from the PLAYA3ULL GAMES Marketplace, encouraging a cycle where heightened community activity expedites the 3ULL coin burn, boosting its rarity and value.</p>\n<p class=\"s5\">Transitioning to the Avalanche Subnet allows PLAYA3ULL GAMES to maintain the robust security of the Avalanche Blockchain while implementing its new blockchain. This independent blockchain will host all nodes essential for the daily production of 3ULL coins and will serve as the bedrock of the PLAYA3ULL GAMES ecosystem. With 4,400 nodes already sold out of a total of 50,000, each node delivers a daily reward of 1,500 3ULL coins, a substantial incentive for potential node operators, strengthening the network.</p>\n<p class=\"s5\">This movement to an Avalanche Subnet, coupled with the introduction of a deflationary coin-burn mechanic, marks a new era of growth for PLAYA3ULL GAMES. These pioneering moves reinforce PLAYA3ULL GAMES' commitment to reshaping the gaming industry by offering exceptional opportunities to its expanding community.</p>\n<p class=\"s5\">To learn more about PLAYA3ULL GAMES, visit their website at&nbsp;www.playa3ull.games&nbsp;or follow their social media channels:</p>\n<p class=\"s5\">Discord:&nbsp;https://discord.gg/playa3ull</p>\n<p class=\"s5\">Twitter:&nbsp;https://twitter.com/playa3ull_games</p>\n<p class=\"s5\">YouTube:&nbsp;https://www.youtube.com/@PLAYA3ULL_GAMES</p>\n<p class=\"s5\">PLAYA3ULL GAMES, an international gaming company established in November 2021, pioneered the first NFT generator in June 2022 and launched its native 3ULL chain in June 2023. The flagship game, NEXUS, is scheduled for release on September 3, 2023, with two additional games expected before the end of the year. PLAYA3ULL GAMES' mission is to transform gaming into an asset class that rewards gamers for their time and investment, and it is generously supported by a community that serves as the heart of the project. </p>\n<p class=\"s5\">Press Contact: Jonathan Bouzanquet Founder &amp; CSO </p>\n<p class=\"s5\">Email: jb@playa3ull.games</p>\n<p class=\"s5\">Phone:&nbsp;+971523641388</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T14:45:00.000Z",
    "title": "10 Promising AI cryptocurrencies to watch in 2023",
    "url": "https://cryptodaily.co.uk/2023/06/10-promising-ai-cryptocurrencies-to-watch-in-2023",
    "description": "<p>Cryptocurrencies, like InQubeta (QUBE), that are linked to artificial intelligence (AI) have emerged as the top altcoins to buy as crypto investors look to capitalize on what many industry experts like Bill Gates have already predicted will be the next technological revolution. Gates has already warned that the world should expect to see many major changes within a few years.</p>\n<p>The InQubeta presale is attracting lots of global investors as it&rsquo;s the first platform to create a simpler yet secure way for anyone, anywhere to buy equity in artificial intelligence startups. InQubeta isn&rsquo;t the only AI-linked altcoin that has been getting lots of attention lately. Others like Fetch.ai and Singlularity.NET are also seeing an influx of bullish investors. Even mainstream corporations that help to push innovations like Nvidia, which provides chips for AI software, have also seen a substantial increase in investment funds. Nvidia recently became a trillion-dollar corporation after announcing that the demand for chips that power AI software has increased by over 50%.</p>\nInQubeta emerges as leader of AI cryptocurrencies\n<p>Also known as machine learning, artificial intelligence is a type of software system that&rsquo;s based on neural networks. The technique was created decades ago, but couldn&rsquo;t be used to its full potential until new computing resources were developed.</p>\n<p>Thanks to AI, vehicles with self-driving capabilities are already being mass-produced and many people have smartphones with effective image and voice recognition tools. Companies like Tesla&reg; are already working on humanoid robots that can perform manual labor and domestic tasks.</p>\n<p>Even Wall Street has been firmly behind the AI revolution, with investments in the sector rising by over $100 billion from 2015 to 2022. Total investments in firms linked to AI are predicted to exceed $1.5 trillion by 2030. A large portion of these funds will go into AI-linked cryptocurrencies.</p>\n<p>The top ten ones are:</p>\n1. InQubeta (QUBE)\n<p>InQubeta (QUBE) provides a platform that allows startups that focus on artificial intelligence to connect with potential investors. It bypasses the barriers associated with conventional investment channels like needing Silicon-Valley-type connections or being able to afford minimum account deposits that exceed the average person&rsquo;s annual income.</p>\n<p>Firms raise money on the InQubeta platform by creating non-fungible tokens (NFTs) that denote equity and other bonuses in their companies. The NFTs are fractionalized, allowing investors to invest as little or as much as they want. They become equity-owning associates, while the company gets the capital it needs to innovate. Transactions are done with the platform&rsquo;s native currency, $QUBE tokens.</p>\n<p>AI is expected to be, at the very least, as disruptive as the Internet revolution was. Those who invested in companies that quickly capitalized on the new opportunities created by the internet have made substantial returns on their investments since. For example, a $10,000 investment in Amazon during its initial public offering in 1997 would be worth more than $2.2 million today.</p>\n<p>Thanks to InQubeta, everyone can now invest in companies that will push innovations in the sector.</p>\n<p>InQubeta investors can earn extra bonuses by staking their $QUBE to help secure and run the blockchain. Rewards are sent periodically from a dedicated pool that is funded with a 5% sell levy on all $QUBE transactions. $QUBE tokens also give investors access to the platform&rsquo;s governance, allowing them to suggest and vote on issues that affect the project&rsquo;s development and future.</p>\n<p>Visit InQubeta Presale &nbsp;</p>\n<p class=\"s12\">&nbsp;</p>\n2. Fetch.ai (FET)\n<p>Fetch.ai is another interesting AI-driven cryptocurrency platform that has been getting lots of attention lately. It aims to automate web transactions on its decentralized platform. Each user gets a digital version of themselves called a &lsquo;digital twin&rsquo; that learns, interacts, and negotiates with the digital twins of goods or service providers.</p>\n<p>Digital twins use set parameters given by users to negotiate on their behalf. For example, a user&rsquo;s digital twin might interact with the digital twins of concert ticket sellers to find the best deals for a specific event. These digital twins can also interact with other digital twins that have performed similar tasks in the past and learn from them. Fetch.ai digital twins can also be used for decentralized financial services. For example, a user&rsquo;s digital twin can notice price differences of a specific token on different cryptocurrency exchanges and take advantage of them autonomously. Bill Gates recently predicted that services like the ones provided by Fetch.ai would be the first to cause major disruptions as it has the potential to change how people shop online.</p>\n3. Singlularity.NET (AGIX)\n<p>Singularity.Net is a decentralized AI marketplace that uses blockchain technology to provide unrestricted access to applications and algorithms. One of the platform&rsquo;s main goals is to create Artificial General Intelligence from all the interactions between different AI algorithms.</p>\n<p>Singularity.NET hosts its platform on the Cardano (ADA) and Ethereum (ETH) blockchains and anyone can use the learning models created on it. Its native currency the AGIX is used to pay transaction fees and purchase products. Over 70 AI services are already available on the platform and the user-friendly interface makes it easy for non-developers to navigate the space.</p>\n4. The Graph (GRT)\n<p>The Graph provides a system for querying and indexing data from blockchains, much like a search engine&rsquo;s index and query data from websites. The Graph&rsquo;s platform does this by organizing data into subgraphs. It&rsquo;s built on the Ethereum blockchain and it allows anyone to build and publish APIs that applications can query with GraphQL to secure blockchain data.</p>\n<p class=\"s12\">Visit InQubeta Presale</p>\n5. Ocean Protocol (OCEAN)\n<p>Ocean Protocol provides an Ethereum-based platform that allows individuals and businesses to monetize and exchange data and data-based services. For example, it can give researchers access to the data without the data holder having to relinquish it.</p>\n<p>While many cryptocurrencies had a rough time in 2022, Ocean prices kept growing before finally coming down in early 2023.</p>\n6. Cortex (CTXC)\n<p>Cortex provides a peer-to-peer, open-source, decentralized blockchain-based platform that supports uploading and executing AI models on the distributed network. It aims for AI democratization where models can be integrated into smart contracts to create AI-powered decentralized applications.</p>\n<p>Cortex hasn&rsquo;t enjoyed the price growth many other AI-driven cryptocurrencies have recently seen, but it has the potential to create a new class of decentralized applications and smart contracts in the future.</p>\n7. iExec RLC (RLC)\n<p>IExec offers a blockchain network that users can use to monetize their computing power or access on-demand computing resources. RLC is the network's native currency and it&rsquo;s used to pay transaction fees on the blockchain.</p>\n<p>The iExec platform is currently the leading blockchain-based decentralized computing platform and it also allows users to monetize data sets and applications. iExec supports applications used in various fields like fintech, rendering, AI, and healthcare. iExec aims to reinvent the cloud computing space by creating a new blockchain-based cloud paradigm.</p>\n<p>iExec&rsquo;s platform relies on XtremWeb-HEP, which is an open-source grid software that allows for features like security, data management, private infrastructure, and the development of virtual images.</p>\n<p class=\"s12\">Visit InQubeta Presale</p>\n8. Numeraire (NMR)\n<p>Numeraire runs an AI-powered blockchain network that acts like a hedge fund on behalf of users, using machine learning and artificial intelligence to invest in global stock markets. Its native currency the Numeraire is used to pay transaction fees on the network.</p>\n<p>The Numeraire blockchain is Ethereum-based, allowing data scientists and developers to experiment and develop machine learning models. The platform aims to decentralize the data science field while allowing developers to make more effective machine-learning models.</p>\n<p>Numeraire claims the title of being the first hedge fund to launch its cryptocurrency, but unlike conventional hedge funds, it uses predictions made by users to select stocks. It heavily relies on machine learning for its investment strategies.</p>\n9. dKargo (DKA)\n<p>dKargo is a blockchain network that uses artificial intelligence to address issues in the logistics industry by providing credible data to participants. The network also helps to establish efficient logistics networks based on improved communication provided by blockchain technology.</p>\n<p>The dKargo platform helps to address trust issues created by split logistic nodes by using blockchain technology to enhance communication and create collaboration-based logistic networks that would be impossible without blockchain technology. The platform also provides Web3 logistic services. It gives users optimized routes and logistics that couldn&rsquo;t have been possible with the structure of silo logistics.</p>\n10. Phala Network (PHA)\n<p>Phala Network also provides AI-augmented blockchain-based cloud computing services, but its main focus is privacy. The platform is positioned as a decentralized alternative to traditional cloud computing providers like Google Cloud or Amazon AWS.</p>\n<p>PHA is its native currency and used for various things like purchasing computing resources, paying data exchange fees, and security guarantees. Phala Network provides users with contract-based data exchange infrastructure for standardized trading protocols, analysis, and collection. PHA also serves as the platform&rsquo;s governance tokens giving users a say in the platform&rsquo;s development and operations.</p>\nSummary\n<p>2023 has been the year of AI-linked cryptos as they emerge as the top altcoins to buy. Investors remain bullish on these tokens that are driven by artificial intelligence while generally feeling bearish about most cryptocurrencies. AI-linked cryptos are taking over the crypto space and their futures look bright with a total of $1.5 trillion expected to be funneled into the AI sector.</p>\n<p class=\"s12\">Visit InQubeta Presale</p>\n<p class=\"s12\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T15:00:39.000Z",
    "title": "Apple swiftly purges fake Trezor app from App Store",
    "url": "https://www.cryptopolitan.com/apple-swiftly-purges-fake-trezor-app-store/",
    "description": "In a response to an emergent security threat, Apple Inc., the technology behemoth, has removed a fraudulent application posing as Trezor, a reputed cryptocurrency hardware wallet, from its App Store. Despite this prompt action, investigations reveal that other counterfeit apps are still at large within the digital platform. Apple&#8217;s quick trigger action against fraudulent apps ... <a title=\"Apple swiftly purges fake Trezor app from App Store\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apple-swiftly-purges-fake-trezor-app-store/\" aria-label=\"More on Apple swiftly purges fake Trezor app from App Store\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:43:04.000Z",
    "title": "Watch: Barclays former CEO praises Bitcoin mainstream adoption",
    "url": "https://www.cryptopolitan.com/bob-diamond-bitcoin-mainstream-adoption/",
    "description": "Bitcoin&#8217;s trajectory towards mainstream adoption received a commendation from an unlikely source recently, as Bob Diamond, the former Chief Executive Officer of Barclays, shared his optimistic views on the rising digital currency during an interview on CNBC. Diamond, who has previously held conservative positions regarding emerging financial technologies, certainly surprised us with his encouraging remarks ... <a title=\"Watch: Barclays former CEO praises Bitcoin mainstream adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bob-diamond-bitcoin-mainstream-adoption/\" aria-label=\"More on Watch: Barclays former CEO praises Bitcoin mainstream adoption\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T15:00:11.000Z",
    "title": "MATIC Price Gains Momentum, But Bulls Face Uncertainty Without Breaking Vital Resistance",
    "url": "https://www.newsbtc.com/matic/matic-price-gains-momentum-but-bulls-face-uncertainty-without-breaking-vital-resistance/",
    "description": "The price of MATIC has experienced an increase in recent trading sessions, surpassing its important support level. In the past 24 hours, the MATIC price has risen by approximately 6%. However, when considering the weekly chart, the altcoin has not shown significant value growth. The technical outlook for MATIC remains bearish, indicating negative sentiment. Both the demand and accumulation for MATIC have remained relatively low, indicating a prevailing bearish influence. The volatility of Bitcoin has had a negative impact on the stability of most altcoins in recent trading sessions. So for MATIC to continue appreciating in future trading sessions, there needs to be a recovery in demand for the altcoin, and its price must trade above the resistance level of $0.70. Related Reading: Cardano Poised For Consolidation In This Price Zone Prior To Attempting Reversal Moreover, the overall strength of the broader market is also crucial for MATIC. The market capitalization of MATIC has declined, suggesting that sellers currently have control over the price. MATIC Price Analysis: One-Day Chart At the time of writing, MATIC was trading at $0.64. Following its drop below the $0.90 price level, the altcoin has been experiencing a downtrend, but there have been attempts by the bulls to reverse this trend. The key resistance level for MATIC is currently set at $0.70, and if the price manages to surpass this level, it would provide an opportunity for the bulls to gain control. However, if the price fails to breach the $0.70 resistance, it could weaken the momentum and potentially cause MATIC to fall below its immediate support line. The nearest support levels are located at $0.60 and then at $0.57. It is worth noting that MATIC has formed a symmetrical pattern, and recently broke out from it, indicating a potential incoming bullish trend. Technical Analysis Despite a slight increase in demand, MATIC is still under the influence of bearish market sentiment. This is evident in the Relative Strength Index (RSI) which is below the 50-mark and only slightly above the 30-mark. These RSI levels indicate a strong selling influence in the market. Furthermore, the altcoin has dropped below the 20-Simple Moving Average (SMA) line, which suggests that demand for the altcoin is still low. This decline below the SMA line also indicates that sellers are currently driving the price momentum in the market. On the daily chart, the altcoin has shown mixed signals, including some buy signals. The Moving Average Convergence Divergence (MACD) indicator indicates momentum and potential shifts. It has recently formed one green signal, which is tied to a buy signal for the altcoin. This suggests a possibility of bullishness in the near term. However, for the bullish scenario to strengthen, the altcoin needs to reclaim the $0.70 level. This price level is important for the altcoin to gain upward momentum. Meanwhile, the Bollinger Bands, which measure volatility and price fluctuation, are currently wide apart. This indicates an expectation of increased price volatility in the market. Related Reading: Ethereum Sets Sights On Key Levels As It Rises From Recovery Point The upper band of the Bollinger Bands coincides with the $0.74 resistance level, highlighting its significance as an important resistance level to watch for. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T14:50:52.000Z",
    "title": "New Lawyer Takes on Dogecoin Case: Will DOGE Price Skyrocket Amidst Legal Battle?",
    "url": "https://www.crypto-news-flash.com/new-lawyer-takes-on-dogecoin-case-will-doge-price-skyrocket-amidst-legal-battle/?utm_source=rss&utm_medium=rss&utm_campaign=new-lawyer-takes-on-dogecoin-case-will-doge-price-skyrocket-amidst-legal-battle",
    "description": "A new lawyer is set to take up the Dogecoin case in which Elon Musk is accused of manipulating DOGE prices. Elon Musk has denied owning DOGE acquired through insider trading despite either voluntary or involuntary influencing the prices. The Dogecoin case in which Twitter owner Elon Musk is accused of manipulating Dogecoin (DOGE) prices [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T15:01:00.000Z",
    "title": "Luna Classic Achieves Tech Parity with Cosmos Chains: Joint L1 Task Force",
    "url": "https://coinedition.com/luna-classic-achieves-tech-parity-with-cosmos-chains-joint-l1-task-force/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Terra-Classic-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Joint L1 Task Force announced on June 14, that it has finally acquired technological parity between the Luna Classic blockchain and other Cosmos blockchains. Simultaneously, the L1 Task Force Project Manager shared on Twitter that the project’s revised Q3 Proposal is live and awaiting reviews. According to the proposal, the upgrade v2.0.1 involved updating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/luna-classic-achieves-tech-parity-with-cosmos-chains-joint-l1-task-force/\">Luna Classic Achieves Tech Parity with Cosmos Chains: Joint L1 Task Force</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]