[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T21:06:50.000Z",
    "title": "South Korea’s financial supervisory service (FSS) plans to seek insights from the SEC on spot Bitcoin ETFs",
    "url": "https://www.cryptopolitan.com/south-koreas-financial-supervisory-service/",
    "description": "South Korea&#8217;s Financial Supervisory Service (FSS) has announced its intention to seek insights from the United States Securities and Exchange Commission (SEC) regarding spot Bitcoin exchange-traded funds (ETFs).&#160; This move comes after the SEC&#8217;s recent approval of spot Bitcoin ETFs in the United States. FSS Chief Lee Bok-Hyun revealed this plan as part of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T21:00:00.000Z",
    "title": "This New Crypto Achieves 500% Growth in Presale Over the Past Month, Surpassing Solana (SOL) and Ethereum (ETH)",
    "url": "https://www.cryptopolitan.com/this-new-crypto-achieves-500-growth-in-presale-over-the-past-month-surpassing-solana-sol-and-ethereum-eth/",
    "description": "Over the past month, a new cryptocurrency project called Pandoshi (PAMBO) has seen tremendous growth during its presale, increasing by over 500%. This impressive performance has propelled Pandoshi to surpass major cryptocurrencies like Solana (SOL) and Ethereum (ETH) in terms of gains. As crypto investors look for promising new projects, Pandoshi seems poised to continue [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T21:00:34.000Z",
    "title": "Bitcoin To $45,000 Or $30,000? Analyst Reveals Key Factor That Will Drive The Decision",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-45000-30000-decision/",
    "description": "The flagship cryptocurrency, Bitcoin, looks to be at a crossroads as it continues to trade flat, indecisive about whether to move downward or upward. Commenting on this current price action, crypto analyst Eric Krown Crypto reveals key factors that will decide Bitcoin’s next move.  Bitcoin In “Outlier Land” In a video posted on his YouTube channel, Eric Krown used the Stochastic indicator to analyze Bitcoin’s current price and predict what direction the crypto token was likely headed. Based on his analysis, Krown noted that the current Stochastic level was pointing to a potential correction that was well overdue for Bitcoin.  Related Reading: Why This Crypto Report Suggests Solana As A Main Focus For The Next Bull Market The analyst claimed that a correction would likely see Bitcoin drop to the $30,000 range, with him marking the $28,000 price level as the “worst-case scenario.” Meanwhile, he noted that the 5-day HPDR bands were still showing that the median was around $44,500. As such, he expects that BTC could still see a move to that price level or $45,000 in the short term.  Krown believes that Bitcoin staying below $46,000 means that the correction is likely to come at some point, hinting that Bitcoin could end up closing February in the red. However, a move above $46,000 will validate a move to the upside, with the crypto token likely to rise above $50,000 and climb to as high as $53,000, the analyst claimed.  BTC To Follow History Or Defy Expectations?  Krown also alluded to historical data to prove that Bitcoin&#8217;s monthly close in the red was imminent. He stated that Bitcoin usually averaged about three consecutive three months in the green before having a red month. The longest number of months in which Bitcoin has gone in the green is said to be seven.  Related Reading: Bitcoin Holders Moving Big: Number Of Whale Wallets Reaches Highest Count In 15 Months Therefore, he was suggesting that it wasn’t out of place for February to be a red month for the flagship crypto token, considering that it has ended every month in the green since September. Those gains came largely due to the excitement over the potential approval of the Spot Bitcoin ETFs.  Bitcoin has recently continued to defy expectations, and there is the possibility that February could still end up being a bullish month for BTC. Interestingly, data from Coinglass shows that February (alongside October) is the most bullish month for the flagship crypto token, with Bitcoin closing February in the red on just two occasions.  At the time of writing, Bitcoin is back above $43,000, up in the last 24 hours, according to data from CoinMarketCap.  BTC price trending at $43,100 &#124; Source: BTCUSD on Tradingview.com Featured image from Milk Road, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-05T21:00:18.000Z",
    "title": "Memecoin Insiders Turn $3,694 Into $1,770,000 After Rally of Solana-Based Dogecoin Rival: Lookonchain",
    "url": "https://dailyhodl.com/2024/02/05/memecoin-insiders-turn-3694-into-1770000-after-rally-of-solana-based-dogecoin-rival-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Based-Altcoin-Flashing-firm.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Insiders of a Solana (SOL)-based memecoin reportedly made seven-figure profits off a mere $3,694 investment, according to on-chain data. First reported by blockchain tracking firm Lookonchain, 12 newly created wallets sold off dogwifhat (WIF) on the Ethereum network through the decentralized exchange Uniswap (UNI), making astronomical profits on their principal. &#8220;12 fresh wallets (insiders) made [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/05/memecoin-insiders-turn-3694-into-1770000-after-rally-of-solana-based-dogecoin-rival-lookonchain/\">Memecoin Insiders Turn $3,694 Into $1,770,000 After Rally of Solana-Based Dogecoin Rival: Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-05T20:55:48.000Z",
    "title": "ARK Invest’s Cathie Wood Says ‘Substitution’ of Gold for Bitcoin (BTC) Now Underway",
    "url": "https://dailyhodl.com/2024/02/05/ark-invests-cathie-wood-says-substitution-of-gold-for-bitcoin-btc-now-underway/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/bitcoin-manipulate-gold.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>ARK Invest CEO Cathie Wood says Bitcoin (BTC) is effectively substituting gold as a store of value asset. In a new YouTube update, Wood says that she believes the crypto king is acting more as a risk-off asset and a &#8220;flight to quality&#8221; during times of economic uncertainty. &#8220;Last year, during the regional bank crisis [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/05/ark-invests-cathie-wood-says-substitution-of-gold-for-bitcoin-btc-now-underway/\">ARK Invest’s Cathie Wood Says ‘Substitution’ of Gold for Bitcoin (BTC) Now Underway</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]