[
  {
    "source": "NewsBTC",
    "date": "2023-07-04T23:00:38.000Z",
    "title": "Shiba Inu Records Accelerated Burn Rate, But Price Fails To Respond",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-records-accelerated-burn-rate-but-price-fails-to-respond/",
    "description": "Shiba Inu is one of the meme coins that has managed to maintain its popularity in the crypto market as its community remains committed to reducing the circulating supply of the asset. To this end, there has been a significant increase in the SHIB burn rate recorded over the last 24 hours. However, the SHIB price has had a hard time keeping up with this burn rate. SHIB Burn Rate Jumps 540% According to the Shiba Inu burn tracking website, Shibburn, the SHIB burn rate saw a tremendous burn over the last 24 hours. In total, over 78 million tokens were burned, accounting for a 542% increase in burn rate compared to the previous day. Related Reading: Ethereum Eyes $2,000 As Crypto Market Shakes Off SEC Woes HOURLY SHIB UPDATE$SHIB Price: $0.00000776 (1hr 0.22% ▲ &#124; 24hr 1.32% ▲ ) Market Cap: $4,579,871,751 (1.35% ▲) Total Supply: 589,349,600,558,222 TOKENS BURNT Past 24Hrs: 78,248,958 (546.18% ▲) Past 7 Days: 233,385,451 (-78.87% ▼) — Shibburn (@shibburn) July 4, 2023 Now, it is important to keep in mind that this burn rate is notable because it follows multiple days of low burn rates. In fact, the meme coin opened the new week with a drastic decline in burn rate. Shibburn data shows that over the last seven days, the SHIB burn rate is down 78.87%. This indicates a return in positive momentum for the burn rate, which is helping to permanently remove tokens from circulation. Additionally, it also shows that Shiba Inu investors are getting more positive about burning tokens, which could work to help the price recover. SHIB price down over 90% from ATH &#124; Source: SHIBUSD on TradingView.com Shiba Inu Price Fails To Follow Burn Rate Despite the rapid rise in the Shiba Inu burn rate over the last day, the price of the digital asset has not responded in kind. SHIB is still lagging behind, recording losses even at a time when digital assets such as Bitcoin and Ethereum are back on the rise. SHIB is now one of the worst-performing coins when comparing its present price to its all-time high. The meme coin is now almost 91% down from its all-time high price back in 2021 with the vast majority of investors nursing losses on their holdings. Related Reading: Here’s What Caused Bitcoin’s Flash Crash To $29,000 However, the cryptocurrency is performing well compared to its cycle low. After hitting its lowest point this cycle back on June 10, it is 34% up from that level, although this barely makes a dent in the losses of its investors. At the time of this writing, SHIB is changing hands at a price of $0.0000076, according to data from Coinmarketcap. Its market cap has declined rapidly this year, pushing it down to $4.52 billion, making it the 19th-largest cryptocurrency in the space. SHIB’s daily trade volume is currently sitting at $115 million, a 3.24% from the previous day’s figures. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]