[
  {
    "source": "Cointelegraph",
    "date": "2023-11-19T14:24:43.000Z",
    "title": "Sam Altman ousted from OpenAI, CTO Mira Murati named interim CEO",
    "url": "http://cointelegraph.com/news/sam-altman-ousted-from-open-ai-chatgpt-cto-mira-murati-named-interim-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c2e72753-8668-482c-8898-184934228b88.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The board of directors removed Altman on the grounds that he was allegedly “not consistently candid in his communications with the board.”</p>\n                    <p><p>ChatGPT developer OpenAI has <a href=\"https://openai.com/blog/openai-announces-leadership-transition\" target=\"_blank\" rel=\"noopener nofollow\">removed</a> founder Sam Altman from his CEO position, according to a Nov. 17 blog post. Chief technology officer Mira Murati will be promoted to interim CEO. According to the post, the board of directors engaged in a “deliberative review process,” which resulted in the conclusion that Altman “was not consistently candid in his communications with the board, hindering its ability to exercise its responsibilities.”</p><p>Altman could not immediately be reached for comment.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">OpenAI announces leadership transition <a href=\"https://t.co/fFYDLwGXQz\">https://t.co/fFYDLwGXQz</a></p>&mdash; OpenAI (@OpenAI) <a href=\"https://twitter.com/OpenAI/status/1725611900262588813?ref_src=twsrc%5Etfw\">November 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>OpenAI’s board said it remains committed to building artificial intelligence (AI) applications going forward:</p><blockquote>“OpenAI was deliberately structured to advance our mission: to ensure that artificial general intelligence benefits all humanity. The board remains fully committed to serving this mission. […] Mira is exceptionally qualified to step into the role of interim CEO. We have the utmost confidence in her ability to lead OpenAI during this transition period.”</blockquote><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/open-ai-halts-new-chat-gpt-plus-sign-ups\"><strong>OpenAI halts new ChatGPT Plus sign-ups amid high demand</strong></a></em></p><p>The board also stated that it is “grateful for Sam’s many contributions to the founding and growth of OpenAI” but claimed that “new leadership is necessary as we move forward.” The board’s chairman, Greg Brockman, will also be stepping down from his position. However, he will remain as an employee, “reporting to the CEO,” according to the post.</p><p>The board of directors consists of Adam D’Angelo, Tasha McCauley, Helen Toner and OpenAI chief scientist Ilya Sutskever. According to the post, the majority of board members are “independent directors” who do not hold equity in OpenAI.</p><p>The named interim CEO, Mira Murati, is an engineer with Albanian roots and a Dartmouth education, recognized for her contributions to key OpenAI products as Chief Technology Officer, and will assume the interim role of Chief Executive Officer for OpenAI. Ms. Murati has a background spanning aerospace, automotive, VR, and AR, and held a senior product manager role at Tesla, contributing to the Model X. She also worked with Leap Motion, integrating AI into real-world applications. She joined OpenAI in 2018.</p><p>Altman is also the founder of Tools for Humanity, and the developer of crypto project Worldcoin. Cointelegraph reached out to Tools for Humanity for comment but did not get a response by the time of publication.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-19T14:11:12.000Z",
    "title": "Decoding the AI Existential Risks – Unpacking Tyler Cowen’s Optimistic Perspective",
    "url": "https://www.cryptopolitan.com/ai-existential-risks-cowens-perspective/",
    "description": "In the dynamic realm of artificial intelligence, the conversation surrounding its potential existential risks has reached a crescendo. Tyler Cowen, a prominent voice in this discourse, offers a compelling perspective in his recent Bloomberg article dated November 19, 2023. As society grapples with the promises and perils of AI, Cowen&#8217;s insights serve as a guiding ... <a title=\"Decoding the AI Existential Risks &#8211; Unpacking Tyler Cowen&#8217;s Optimistic Perspective\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-existential-risks-cowens-perspective/\" aria-label=\"More on Decoding the AI Existential Risks &#8211; Unpacking Tyler Cowen&#8217;s Optimistic Perspective\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-19T14:30:15.000Z",
    "title": "Crypto Analyst Predicts XRP Price Will Reach $1.35 As These Metrics Heat Up",
    "url": "https://www.newsbtc.com/news/crypto-analyst-predicts-xrp-price-will-reach-1-35-as-these-metrics-heat-up/",
    "description": "XRP  has experienced a small decline in value over the past few days, coinciding with a period of consolidation in the broader cryptocurrency market after four weeks of consecutive price increases. Although data from CoinMarketCap at the time of writing puts XRP being up by 1.78% in the past 24 hours, a larger seven-day timeframe shows it is still down by 8.68%. On the other hand, price metrics including open interest on futures contracts and a bullish divergence with the RSI indicate the potential for a significant increase in the value of the token in the near future.  Crypto Analyst Sees Solid XRP Price Action According to crypto analyst Will Taylor known as Cryptoinsightsuk on social media, XRP is showing signs of bullish momentum that could drive the price up to his target of $1.35. The analyst took to social media platform X to point out two metrics indicating a bullish price and explain their significance. Finally, $XRP.$XRP actually looks rather different to the other charts I&#8217;ve have just discussed. We had $100m+ of OI added to the market in the highlighted spike (on the day of the fake ETF news). Since this time, price has moved down and OI has stayed relatively flat. This… https://t.co/qkruUPopJ7 pic.twitter.com/SY9pEZs5mr — Cryptoinsightuk (@Cryptoinsightuk) November 17, 2023 Exchange data shows more than $100 million of open interest on futures contracts was added to the XRP ecosystem on the day of the fake news surrounding BlackRock&#8217;s XRP ETF filing. XRP also experienced a significant price jump of 16% to $0.75 simultaneously. However, Cryptoinsightsuk pointed out that while the crypto has since lost this price spike, the amount of open interest has stayed relatively the same.  Related Reading: Dogecoin Metrics Signal Impending Breakout, How High Can The Price Go? According to the analyst, since the price of XRP has gone down, the amount of open interest on futures contracts remaining the same means they are probably short trade positions. &#8220;This shows me, there are HUGE shorts on $XRP right now,&#8221; he said. Taking a glance at the price chart that the trader provided indicates the formation of lower highs and lower lows by XRP. The recent action was a bounce up and it is now approaching the descending upper trendline formed by the lower highs. He noted that a break above the descending trendline could be the start of an uptrend for XRP. Total crypto market cap is currently at $1.3 trillion. Chart: TradingView.com This might encourage people to cover their open short positions or close them out by placing buy trades, which in turn could lead to a more aggressive breakout in the market. “This could cascade stop losses to the upside and push XRP on a fast move,” he said. Bullish Divergence With The RSI The trader also noted the recent creation of a higher low in XRP&#8217;s price created a bullish divergence with the RSI overbought/oversold indicator. This bullish divergence demonstrates that bulls are poised to regain control of the market and that bears are beginning to lose momentum.  &#8220;XRP will get sent to my target range of $0.89 &#8211; $1.35,&#8221; he predicted. Related Reading: Yearn Finance Tumbles: Rug Pull Rumors Swirl As Token Takes A 45% Hit Cryptoinsightuk had initially created a daily countdown for an XRP price blast-off to a target of $1.06. However, the countdown has ended and XRP is yet to blast off.  &#8220;I was wrong on the date, but this is inevitable I feel,&#8221; the analyst said. Featured image from Pexels"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-19T14:36:00.000Z",
    "title": "Polygon (MATIC) Aims at Another Uptick as PoS Activity Surges",
    "url": "https://coinedition.com/polygon-matic-aims-at-another-uptick-as-pos-activity-surges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon’s_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Polygons_dApp_activity_upsurge_could_mean_this_for_MATIC_in_the-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Activity on the Polygon (MATIC) scalable Proof-of-Stake (PoS) network has been surging for the last seven days. According to Sandeep Nailwal, Polygon’s founder, about 17 million transactions occurred on the network between November 17 and 18. Using data from Token Terminal, Nailwal also mentioned that the blockchain was able to generate $1.2 million in revenue [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/polygon-matic-aims-at-another-uptick-as-pos-activity-surges/\">Polygon (MATIC) Aims at Another Uptick as PoS Activity Surges</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]