[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T11:21:13.000Z",
    "title": "Someone Flash Loaned $200M From MakerDAO to Make $3 Profit",
    "url": "https://www.coindesk.com/markets/2023/06/14/someone-flash-loaned-200m-from-makerdao-to-make-3-profit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "An arbitrage bot flash loaned $200 million worth of the dai stablecoin from MakerDAO on Wednesday, making a $3.24 profit after transaction fees."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T11:30:58.000Z",
    "title": "Tick tock, next block: Bitcoin difficulty sees another positive adjustment",
    "url": "https://cryptoslate.com/insights/tick-tock-next-block-bitcoin-difficulty-sees-another-positive-adjustment/",
    "description": "<p>Quick Take Around 12:30 PM GMT, the Bitcoin network experienced another positive adjustment in difficulty, marking an increase of 2%. This adjustment represents the tenth positive change this year and, notably, the third consecutive one. This development is in tandem with a remarkable surge in the network&#8217;s hash rate, which continues to set new records. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/tick-tock-next-block-bitcoin-difficulty-sees-another-positive-adjustment/\">Tick tock, next block: Bitcoin difficulty sees another positive adjustment</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T11:30:16.000Z",
    "title": "Michael Saylor says Bitcoin dominance is headed for 80% in the long term",
    "url": "https://cryptoslate.com/michael-saylor-says-bitcoin-dominance-is-headed-for-80-in-the-long-term/",
    "description": "<p>Bitcoin&#8217;s (BTC) dominance is set to reach 80% in the long term as regulators crack down on other assets, MictraStrategy co-founder Michael Saylor told Bloomberg TV on June 13. MicroStrategy is the largest public holder of BTC. Currently, Bitcoin&#8217;s crypto market dominance is around 48%, meaning BTC accounts for nearly half of the over $1 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/michael-saylor-says-bitcoin-dominance-is-headed-for-80-in-the-long-term/\">Michael Saylor says Bitcoin dominance is headed for 80% in the long term</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T11:28:21.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T11:25:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 How much is AMP worth? Today&#8217;s live Amp price to is $0.002015 with a 24-hour trading volume of $2,442,044. Amp is up 0.15% in the last 24 hours. The current CoinMarketCap ranking is #255, with a live market cap of $85,079,867. It has a circulating supply of 42,227,702,186 AMP coins and a max. supply of 99,444,125,026 AMP ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T11:12:18.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T11:36:27.000Z",
    "title": "Polkadot Ventures Into Bearish Zone: What’s The Next Move For DOT?",
    "url": "https://www.newsbtc.com/news/polkadot-in-bearish-zone/",
    "description": "Polkadot (DOT), one of the leading cryptocurrencies in the ever-evolving blockchain ecosystem, is currently navigating a critical juncture in its recovery journey. Despite showing promising signs of rebounding from previous price corrections, DOT&#8217;s path to sustained growth is encountering significant roadblocks that could potentially lure sellers back into the market.  Related Reading: XRP Smothered In Red Despite Massive Whale Accumulation, Hinman Docs Release In this volatile landscape, one must wonder: Will DOT overcome these obstacles and reestablish its bullish momentum, or will it succumb to the pressures of the market, presenting an opportunity for sellers to seize control once again?  Let us delve into the factors that shape DOT&#8217;s recovery and explore the potential implications for market participants. Polkadot Recovery Faces Hurdles Amid SEC Lawsuit  Polkadot (DOT) has been caught in the crosshairs of a recent lawsuit involving Binance and the United States Securities and Exchange Commission. While the SEC failed to mention DOT as a security, the lawsuit still has sparked concerns and contributed to the substantial decline in its value over the past week. After the big news from yesterday about @SECGov and @binance, Crypto Twitter is floated with messages regarding those tokens the SEC mentioned and considers a Security, including SOL, ADA, MATIC, FIL, ATOM, SAND, MANA, ALGO, and AXS But what about DOT (Polkadot)&#8230; well, for… pic.twitter.com/yuGUHpf4s6 — JC Web3 Marketing .DOT (@IamJulianaC) June 6, 2023 The market&#8217;s reaction to this classification, coupled with prevailing macro headwinds, has caused DOT&#8217;s price to plummet. However, on June 10, the downward trajectory of DOT&#8217;s value showed signs of easing, giving the asset a chance to reverse some of its recent losses. Despite this glimmer of hope, the road to recovery remains challenging for Polkadot. As of now, DOT continues to face a considerable setback, with a seven-day decline of 9.31%. CoinMarketCap reports DOT&#8217;s current price at $4.65. This substantial decrease in value has raised questions about the asset&#8217;s ability to regain its previous strength. DOT 7-day price movement. Source: CoinMatketCap Although a minor 0.45% rally occurred in the past 24 hours, the overall trend for DOT remains on the downside. This raises the possibility that the recent market conditions could entice sellers to re-enter the market, further impeding DOT&#8217;s recovery efforts. Bitcoin&#8217;s Potential Impact On DOT Price: A Glimmer Of Hope? Meanwhile, Bitcoin has long held the power to sway the prices of other digital assets. As the flagship cryptocurrency, Bitcoin&#8217;s movements often have a ripple effect on the broader market. This correlation raises the possibility of a potential lifeline for DOT amidst its recent struggles. DOT market cap currently at $5.5 billion. Chart: TradingView.com Bitcoin&#8217;s recent performance has been a topic of intense speculation and analysis among traders and investors. Currently trading below the key psychological level of $26,000, Bitcoin&#8217;s journey toward reclaiming this threshold could hold significant implications for the entire cryptocurrency market, including Polkadot. Related Reading: Tether Shuffles The Deck: 750 Million USDT Shifted From Tron To Ethereum If Bitcoin manages to regain the coveted $26,000 level, it could inject renewed confidence and optimism into the cryptocurrency space. Such a resurgence in Bitcoin&#8217;s price often leads to a domino effect, with other major cryptocurrencies benefiting from the renewed market sentiment. Polkadot, being one of the prominent altcoins, could potentially ride the wave of Bitcoin&#8217;s recovery. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T11:30:39.000Z",
    "title": "TMS Network (TMSN) Immovable vs. Mask Network (MASK) and Decentraland (MANA) Market Twists",
    "url": "https://www.crypto-news-flash.com/tms-network-tmsn-immovable-vs-mask-network-mask-and-decentraland-mana-market-twists/?utm_source=rss&utm_medium=rss&utm_campaign=tms-network-tmsn-immovable-vs-mask-network-mask-and-decentraland-mana-market-twists",
    "description": "Occasionally a crypto token can offer so much that it is simply immovable, regardless of what its competitors do. This is exactly how TMS Network (TMSN) is feeling right now, planning to offer features within its platform that Mask Network (MASK) and Decentraland (MANA) simply cannot compete with.  TMS Network (TMSN) has grown by a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T11:30:15.000Z",
    "title": "SEC Responds to Coinbase Request for Crypto Clarity, Will Bitcoin Price Explode? Report",
    "url": "https://www.crypto-news-flash.com/sec-responds-to-coinbase-request-for-crypto-clarity-will-bitcoin-price-explode-report/?utm_source=rss&utm_medium=rss&utm_campaign=sec-responds-to-coinbase-request-for-crypto-clarity-will-bitcoin-price-explode-report",
    "description": "The U.S. Securities and Exchange Commission (SEC) has responded to Coinbase&#8217;s request for regulatory clarity regarding crypto regulations. The SEC has expressed the need for additional time, requesting at least four months to make a recommendation on Coinbase&#8217;s rulemaking petition. The U.S. Securities and Exchange Commission (SEC) has finally responded to Coinbase&#8217;s repeated calls for [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T11:15:47.000Z",
    "title": "Billionaire: Gary Gensler Turning US Into a Technology Wasteland, Calls for New SEC Chairman and Regulatory Approach for Bitcoin, Ethereum, and XRP",
    "url": "https://www.crypto-news-flash.com/billionaire-gary-gensler-turning-us-into-a-technology-wasteland-calls-for-new-sec-chairman-and-regulatory-approach-for-bitcoin-ethereum-and-xrp/?utm_source=rss&utm_medium=rss&utm_campaign=billionaire-gary-gensler-turning-us-into-a-technology-wasteland-calls-for-new-sec-chairman-and-regulatory-approach-for-bitcoin-ethereum-and-xrp",
    "description": "Venture capitalist and billionaire Tim Draper says the SEC chair is crippling the American technology and crypto innovation progress with damaging policies.  Draper thinks ‘America is going to be a technology wasteland in 40 years.’ Tim Draper, an American Venture capitalist, and billionaire, has responded to SEC Chair Gary Gensler calling the crypto industry &#8216;scam [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T11:25:00.000Z",
    "title": "SEC’s Proposal Threatens US Blockchain Industry, PolygonLabs Responds",
    "url": "https://coinedition.com/secs-proposal-threatens-us-blockchain-industry-polygonlabs-responds/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/013-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/013-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/013-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/013.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Rebecca Rettig, Chief Policy Officer at PolygonLabs, has come out strongly against the U.S. Securities and Exchange Commission&#8217;s (SEC) proposed rule change redefining &#8216;exchange.&#8217; In her response, Rettig declares this proposal could inadvertently outlaw permissionless blockchain networks in the US and deal a significant blow to decentralized finance (DeFi) protocols. She argues that the proposed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/secs-proposal-threatens-us-blockchain-industry-polygonlabs-responds/\">SEC’s Proposal Threatens US Blockchain Industry, PolygonLabs Responds</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]