[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T17:44:09.000Z",
    "title": "Former FTX US CEO’s New Venture Is Seeking to Harness AI for Crypto Trading",
    "url": "https://www.coindesk.com/tech/2023/07/05/former-ftx-us-ceos-new-venture-is-seeking-to-harness-ai-for-crypto-trading/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Brett Harrison’s new firm, Architect, aims to be an one-stop platform for institutional-grade crypto trading."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T17:41:51.000Z",
    "title": "BitgetX joins HKVAC as it aims for exchange license in Hong Kong",
    "url": "https://cointelegraph.com/news/bitgetx-joins-hkvac-aims-for-exchange-license-hong-kong",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/34477e49-619a-4cb1-9295-95100801e94c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Hong Kong Virtual Asset Consortium was established on May 31 to create indices and rating services for cryptocurrencies. </p>\n                    <p><p>According to a July 4 announcement, BitgetX, the Hong Kong subsidiary of cryptocurrency exchange Bitget, has joined the Hong Kong Virtual Asset Consortium (HKVAC), which provides ratings services and indices to cryptocurrencies. </p><p>Launched on May 31 with Huobi as its inaugural member, the HKVAC will produce two indices. The Cryptocurrency Large Market Cap Index will be based on the 30 highest capitalized cryptocurrencies according to a seven-day median, with other criteria and quarterly rebalancing. There will also be a Cryptocurrency Risk Rating Based Index in the future. Fiona Fan, founding member of HKVAC, commented:</p><blockquote>\"KVAC is honored to receive support from BitgetX by becoming one of our founding members. The collective goal from both parties to collaborate and promote the long-term development of the virtual asset industry in Hong Kong includes the crafting of regulatory management standards of trading platforms.\"</blockquote><p>Other points for collaboration include<strong> </strong>improving the quality of transactions and providing better risk management services for investors, as well as \"creating a secure trading environment.\"</p><p>Parallel to the news, BitgetX reiterated its commitment to obtain a Virtual Asset Licensing Regime (VASP) with Hong Kong's Securities and Futures Commission. The new regime for regulatory license was enacted in the Special Administrative Region on June 1. Patrick Pan, co-founder and CEO of BitgetX, said: \"We are dedicated to fostering a compliant and secure digital asset ecosystem for the global market, with a special focus on promoting the Web3 industry in Hong Kong.\"</p><p>Hong Kong has been actively promoting the adoption of Web3 technologies over the years. Recently, the Special Administrative Region <a href=\"https://cointelegraph.com/news/hong-kong-establishes-task-force-web3-development\">established a Web3 Task Force</a> headed by Financial Secretary Paul Chan, with Yat Siu, CEO of Animoca Brands, joining as one of its founding members. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/hk-crypto-etfs-binance-maverick-poly-network-hacked-asia-express/\">HK crypto ETFs on fire, Binance warns on Maverick FOMO, Poly hack: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-05T17:47:33.000Z",
    "title": "Binance Australia Under Fire Again as Offices Searched",
    "url": "https://cryptobriefing.com/binance-australia-under-fire-again-as-offices-searched/?utm_source=feed&utm_medium=rss",
    "description": "The global regulatory landscape is tightening around Binance, the worlds leading cryptocurrency exchange. In a recent development, the Australian Securities and Investments Commission (ASIC) conducted searches at Binances Australian offices..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T18:05:10.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T17:59:53.000Z",
    "title": "India spearheads cross-border CBDC payment solutions",
    "url": "https://www.cryptopolitan.com/india-cross-border-cbdc-payment-solutions/",
    "description": "Embracing the promise of the digital future, India is paving the way for transforming the landscape of cross-border payments. Through the ingenuity of the Reserve Bank of India (RBI), the nation is steadily making strides in implementing its Central Bank Digital Currency (CBDC), known as the &#8220;digital rupee&#8220;. India&#8217;s ambitious endeavors in the field are ... <a title=\"India spearheads cross-border CBDC payment solutions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-cross-border-cbdc-payment-solutions/\" aria-label=\"More on India spearheads cross-border CBDC payment solutions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T17:49:06.000Z",
    "title": "What to know about DBS’ digital yuan payment solution",
    "url": "https://www.cryptopolitan.com/about-dbs-digital-yuan-payment-solution/",
    "description": "In the intricate weave of today&#8217;s global finance, DBS, one of Singapore&#8217;s most influential banks, is pioneering innovative solutions for the rapidly emerging digital currency market. In particular, the bank&#8217;s recent launch of an e-CNY merchant collection solution in China, marking one of the first foreign bank endeavors in this arena, is a significant step ... <a title=\"What to know about DBS&#8217; digital yuan payment solution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/about-dbs-digital-yuan-payment-solution/\" aria-label=\"More on What to know about DBS&#8217; digital yuan payment solution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T17:47:31.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T18:00:44.000Z",
    "title": "Valkyrie Follows In BlackRock’s Footsteps, Refiles For Spot Bitcoin ETF",
    "url": "https://www.newsbtc.com/bitcoin-news/valkyrie-follows-in-blackrocks-footsteps-refiles-for-spot-bitcoin-etf/",
    "description": "The dream of a spot Bitcoin exchange-traded fund (ETF) in the US is still yet to become a reality as various investment firms continue to seek approval from the Securities and Exchange Commission (SEC) despite multiple rejections. In a recent turn of events, Valkyrie, an alternative asset management company specializing in the emerging cryptocurrency sector, refiled its application for a Spot bitcoin exchange-traded fund. Valkyrie Takes Another Swing At Bitcoin ETF Approval In a new 19b-4 form submitted by the Tennessee-based firm, the latest Bitcoin ETF filing includes some key differences that may improve its chances of approval by the SEC. Related Reading: Solana (SOL) Notches 16% Gains On Weekly Chart, Will It Cross $20? For starters, Valkyrie mentions it is now bringing on Coinbase as a partner for market surveillance in support of the fund. The company also mentions that Coinbase had &#8220;executed a term sheet with Nasdaq&#8221; to &#8220;enter into a surveillance-sharing agreement.” Given that Coinbase is the largest cryptocurrency exchange based in the United States, Valkyrie&#8217;s partnership with Coinbase is most likely going to increase the likelihood that the application will be approved. Valkyrie is, however, not new to the BTC business, as the company is majorly focused on bridging the gap between traditional finance and the rapidly evolving digital asset industry. In 2022, the company received approval from the SEC for its Bitcoin Futures Fund.  In 2021, Valkyrie filed for a Spot Bitcoin ETF, but it was outrightly rejected by the SEC for the reason of being too risky for investors for various reasons such as market manipulation. The former application proposed that the fund be listed on NYSE Arca, but now it’s moving to Nasdaq with the ticker symbol $BRRR. BTC price recovers above $30,500 &#124; Source: BTCUSD on Tradingview.com How A Spot BTC ETF Could Impact Crypto Markets Other major players in the investment world have recently filed for their own Spot Bitcoin ETFs with the SEC. Investment companies like BlackRock and Fidelity have refiled their spot Bitcoin application in the past month. This news drove the price of Bitcoin high in late June, crossing over $30,000. Although these applications were previously said by the SEC to be &#8216;inadequate&#8217;, they have now been modified and refiled. Related Reading: Dogecoin Up 5%, But Social Media Talk Remains Low: Santiment With major investment companies entering the fray and refiling their applications, the SEC will likely face mounting pressure to approve a Spot Bitcoin ETF finally. As investors’ demand for digital assets grows, a spot ETF could provide a regulated way to gain exposure to BTC and lead to even more mainstream adoption of cryptocurrencies, especially for institutional investors. If any of these filings are approved, it would be the first Bitcoin spot ETF to win approval in the US and the fund(s) will be able to offer unlimited Bitcoin ETF shares to investors. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T18:05:08.000Z",
    "title": "Parabolic Move Now Brewing for Bitcoin As Pattern From 2016 and 2020 Forms: Crypto Analyst",
    "url": "https://dailyhodl.com/2023/07/05/parabolic-move-now-brewing-for-bitcoin-as-pattern-from-2016-and-2020-forms-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/High-Bullish-Sentiment-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst says that Bitcoin’s (BTC) price action is forming a historic pattern that has preceded quick and big moves to the upside. Pseudonymous analyst TechDev tells his 413,900 Twitter followers that Bitcoin is on the edge of surging, either like early 2016 or late 2020. He shares a chart suggesting that BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/parabolic-move-now-brewing-for-bitcoin-as-pattern-from-2016-and-2020-forms-crypto-analyst/\">Parabolic Move Now Brewing for Bitcoin As Pattern From 2016 and 2020 Forms: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]