[
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T06:47:15.000Z",
    "title": "SEC appeal could amplify Ripple win, says Ripple Labs legal chief",
    "url": "https://cointelegraph.com/news/sec-appeal-could-amplify-xrp-win-ripple-labs-legal-chief",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/5edad8f5-ceb2-489e-aa6b-680c11586002.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stuart Alderoty said that an appeal on behalf of the SEC could see Ripple consolidate its victory over the regulator even further.</p>\n                    <p><p>Concerns of a potential appeal by the United States securities regulator to the landmark Ripple ruling earlier this month were shrugged off by Ripple’s chief legal officer Stuart Alderoty.</p><p>Alderoty believes if the SEC takes the case to an appeal, the court could move to consolidate Ripple Labs’ partial victory over the financial regulator even further. </p><p>Speaking on a July 26 TechCrunch <a href=\"https://techcrunch.com/2023/07/25/ripple-sec-ruling-xrp/\" target=\"_blank\" rel=\"noopener nofollow\">podcast</a>, Alderoty reiterated his position that the XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token does not constitute an investment contract and that the Ripple team would not “shy away” from any appeal brought to the courts by the SEC. </p><blockquote>“We think the judge got that right, and we think that was a faithful application of the law, and I think a court of appeals will not only affirm that but maybe even amplify that to even a greater extent.”</blockquote><p>On July 13, Judge <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">Analisa Torres ruled</a> XRP was not a security when sold to the public on crypto exchanges but can be treated as a security when sold to institutional investors.</p><p>On July 21, the SEC <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">used its ongoing case</a> against Terraform Labs founder Do Kwon to air out its grievances with the ruling and hinted that it would appeal the split-decision ruling in the future. </p><p>“Respectfully, those portions of Ripple were wrongly decided, and this Court should not follow them,” SEC lawyers wrote, asserting that retail sales of XRP should have been deemed securities.</p><p> “SEC staff is considering the various available avenues for further review and intends to recommend that the SEC seek such review,” the lawyers added. </p><p>SEC Chair Gary Gensler also <a href=\"https://cointelegraph.com/news/sec-chair-gary-gensler-reaction-to-ripple-decision-is-mixed-still-under-consideration\">expressed his disappointment</a> over the court’s decision on XRP adding the regulator would continue to assess the ruling.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-ceo-brad-garlinghouse-condemns-sec-hint-appeal-xrp\"><strong><em>Ripple CEO Brad Garlinghouse: ‘The SEC created this mess’</em></strong></a></p><p>In light of the ruling, Alderoty predicted if the SEC continues to claim that crypto assets themselves are securities it would begin to lose ongoing cases where the SEC attempts to make such claims.</p><blockquote>“Our case and the decision rendered by our judge [Torres] will provide comfort to other judges that the SEC is just misguided.”</blockquote><p>Despite his optimism, Alderoty warned the crypto sector is still a long way away from standing on solid regulatory ground. He condemned the SEC’s regulation by enforcement approach for causing crypto laws in the U.S. to fall well behind other jurisdictions.</p><p>“We still need a rational, comprehensive and understandable regulatory framework for crypto in the U.S.,” he said. “Because of the SEC’s refusal to faithfully apply the law […] the U.S. has been visibly falling behind the rest of the world.”</p><p>Currently, XRP is changing hands for around $0.70, up nearly 43% in the last month, according to Cointelegraph <a href=\"https://cointelegraph.com/xrp-price-index\">data</a>. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T06:48:43.000Z",
    "title": "Is Reinforcement Learning Set to Transform with DeepMind’s Continual Approach?",
    "url": "https://www.cryptopolitan.com/reinforcement-learning-deepminds-continual/",
    "description": "In a groundbreaking research endeavor, a team of experts at DeepMind has redefined Reinforcement Learning (RL) by providing a comprehensive, precise mathematical definition of Continual Reinforcement Learning (CRL). The paper titled &#8220;A Definition of Continual Reinforcement Learning&#8221; challenges conventional RL approaches and establishes a solid conceptual foundation for agents that perpetually adapt and learn from ... <a title=\"Is Reinforcement Learning Set to Transform with DeepMind&#8217;s Continual Approach?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/reinforcement-learning-deepminds-continual/\" aria-label=\"More on Is Reinforcement Learning Set to Transform with DeepMind&#8217;s Continual Approach?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T06:50:51.000Z",
    "title": "SEC charges Quantstamp over unauthorized ICO",
    "url": "https://crypto.news/sec-charges-quantstamp-over-unauthorized-ico/",
    "description": "In a clash between blockchain enterprise Quantstamp and the U.S. SEC, the murky legal waters of initial coin offerings and crypto regulations come to the forefront. Another legal skirmish has unfolded, this time involving the U.S. Securities and Exchange Commission&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T07:00:07.000Z",
    "title": "Ethereum (ETH) Price Prediction: Buy Signal With 78% Accuracy Flashes",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-eth-prediction-buy-signal-78-accuracy/",
    "description": "After Ethereum (ETH) once again failed to break the $2,000 level in the 1-day chart, the price has been on a downward slide in recent days. However, this could now change, as a historically accurate trend indicator shows. Crypto traders and analysts constantly seek reliable indicators to navigate the turbulent market. One such indicator gaining attention is the Tom Demark 9 (TD9), which has flashed a buy signal for Ethereum (ETH) on the daily chart. Renowned analyst Joe McCann shared his insights via Twitter, revealing an intriguing success rate of 78% for ETH&#8217;s historical TD9 buy signals. Ethereum (ETH) Buy Signal Joe McCann&#8217;s tweet brought the spotlight on ETHUSD&#8217;s TD9 buy signal, which occurred after the asset dropped 8.7% from its recent high. The TD9 indicator, an indicator that also measures whether an asset is overbought or oversold, similar to the RSI, aims to identify potential trend reversals. According to McCann, historical data showcases the TD9 buy signal&#8217;s remarkable accuracy for ETH, with a win rate of nearly 78%. Possible price targets include the July open at $1,933, the August 2022 bear market rally high at $2,031, and the year-to-date 2021 high at $2,142, according to the analyst. Digging deeper into the data, McCann highlights the impressive performance of ETH following TD9 buy signals. The statistics reveal that, on average, the asset surged by over 2.6% in the seven days following the signal, with a median return of almost 5%. These figures alone could pique the interest of traders looking for an edge in the crypto market. Related Reading: Fidelity Backs Ethereum: Wall Street’s Biggest Players Bet On Crypto’s Number 2 To provide a more nuanced picture, McCann narrowed the data to examine the year 2019, a period he deems analogous to the 2023 crypto market cycle. The results are even more captivating, showing a remarkable win rate of nearly 90% for TD9 buy signals during this period. However, if we trim the data back to starting in 2019 (a year very similar to 2023 in terms of crypto market cycles), ETH has a win rate of nearly 90% with the average return over +7%. But, as with any indicator, there are exceptions and occasional inaccuracies. McCann’s data shows several instances where the TD9 buy signal failed to predict ETH&#8217;s price movement accurately. Noteworthy is March 13, 2018, when the ETH price slid massively after the buy signal. The ETH price plummeted by 19.3% within seven days and by as much as 34.8% within the next 14 days. The signal was similarly bad on May 8, 2018, after which ETH fell by 22.1% in the following seven days and 26.7% in the following 14 days. On the other hand, the TD9 buy signal has predicted some massive rallies. For example, on December 10, 2018, following the signal, ETH initially rose by 3.7% in the first seven days, but then came a fabulous 53.0% rise in 14 days and 64.5% in 30 days. The most recent TD9 buy signal on March 11, 20223 delivered a price increase of 18.8% in the first seven days and 29.9% after 30 days. Related Reading: Ethereum Whale Transfers To Exchanges Suggest More Selling Pressure For ETH In general, it can be seen that the accuracy of the TD9 indicator decreases over time. While the indicator has a success rate of 78% in the first seven days with an average 7-day forward return of +2.65% and a median return of almost 5%, the success rate falls in the subsequent period of time. After 14 days, the TD9 indicator has a success rate of only 55.5% (mean 3.8%, median 5.7%), after 30 days of 63.0% (mean 6.9%, median 3.8%) since 2018. Federal Reserve Meeting Looms While the TD9 buy signal paints a positive picture for ETH, the crypto market remains vulnerable to external factors, including the upcoming FOMC meeting today. There is a 98.9% probability that there will be a 25 basis point rate hike. But the big question is whether this will be the last hike in this cycle. McCann writes: July 26th is the latest meeting of the Federal Reserve and Jerome Powell is expected to hike rates another 25 bps. Will Jerome Powell ruin the party for the ETH bulls at the press conference? At press time, the Ether (ETH) price stood at $1,859. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T06:47:52.000Z",
    "title": "Bitcoin Slips Under $29,000 as Bitcoin Spot ETF Hype Fades – Time to Buy BTC at a Discount or Cash Out?",
    "url": "https://www.crypto-news-flash.com/bitcoin-slips-under-29000-as-bitcoin-spot-etf-hype-fades-time-to-buy-btc-at-a-discount-or-cash-out/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-slips-under-29000-as-bitcoin-spot-etf-hype-fades-time-to-buy-btc-at-a-discount-or-cash-out",
    "description": "<img width=\"1920\" height=\"1152\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920-1024x614.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin price held on the support/resistance zone around $29.1k after teasing $28.8k on Monday. The decision on spot Bitcoin ETF has been left to the US SEC after several institutional investors led by BlackRock, and Valkyrie filed earlier this month. Bitcoin price has found a support level around $29.1k to hang on after the bulls [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-26T07:04:10.000Z",
    "title": "Horrendous News Stories Coming for Bitcoin Amid Bearish Price Action, Warns Trader Who Called 2023 Crypto Rally",
    "url": "https://dailyhodl.com/2023/07/26/horrendous-news-stories-coming-for-bitcoin-amid-bearish-price-action-warns-trader-who-called-2023-crypto-rally/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Stories-Coming-for-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who caught this year&#8217;s crypto rally says that Bitcoin&#8217;s (BTC) recent price action does not bode well for the top digital asset&#8217;s outlook. Pseudonymous analyst DonAlt tells his 497,700 Twitter followers that he&#8217;s moving his funds to yield farming for now as he believes the crypto markets are ripe for a sell-off event. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/26/horrendous-news-stories-coming-for-bitcoin-amid-bearish-price-action-warns-trader-who-called-2023-crypto-rally/\">Horrendous News Stories Coming for Bitcoin Amid Bearish Price Action, Warns Trader Who Called 2023 Crypto Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]