[
  {
    "source": "Decrypt",
    "date": "2023-06-30T20:00:00.000Z",
    "title": "DeGods Tease Next Moves With 'Early Facebook' Vibes Because 'Roadmaps Are Stupid'",
    "url": "https://decrypt.co/146939/degods-tease-next-moves-early-facebook-vibes-because-roadmaps-stupid",
    "description": "The creators of Ethereum NFT project DeGods and the Polygon-based y00ts are teasing big moves, including expanded IP rights for holders."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T20:00:00.000Z",
    "title": "Polygon proposes architecture for 'Polygon 2.0,' including aggregator bridge",
    "url": "https://cointelegraph.com/news/polygon-proposes-architecture-for-polygon-2-0-including-aggregator-bridge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8d0e024c-b800-47d6-9bbb-4863e74e00b2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The forthcoming multi-chain system will use ZK proofs to transfer assets between networks.</p>\n                    <p><p>Polygon Labs, creator of the Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) network, has proposed an architecture for its forthcoming “Polygon 2.0” project. The team <a href=\"https://polygon.technology/blog/polygon-2-0-protocol-vision-and-architecture\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> in a June 29 blog post that the new project should be made up of four different ‘layers,’ which will combine to create a web of networks ultimately connected to each other through Ethereum. If approved by validators, Polygon 2.0 will also feature an aggregator that makes bridge transactions “near-instant and atomic” the team said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Today, we are excited to propose the Polygon 2.0 architecture, designed to provide unlimited scalability and unified liquidity, thus transforming Polygon into the Value Layer of the Internet!<br><br>Read the blog  or keep scrolling <a href=\"https://t.co/sShy6R1E6R\">https://t.co/sShy6R1E6R</a> <a href=\"https://t.co/BTdwkri4nI\">pic.twitter.com/BTdwkri4nI</a></p>— Polygon (Labs) (@0xPolygonLabs) <a href=\"https://twitter.com/0xPolygonLabs/status/1674538238835343361?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The team first <a href=\"https://cointelegraph.com/news/polygon-2-0-introduces-upgrades-to-tap-into-value-layer-of-internet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-2-0-introduces-upgrades-to-tap-into-value-layer-of-internet/amp\">announced Polygon 2.0</a> on June 12, claiming that the new project would establish “the value layer” of the Internet. But details were scarce at that time. On June 20, co-founder Mihailo Bjelic <a href=\"https://cointelegraph.com/news/polygon-co-founder-proposes-zkevm-validium-upgrade-to-improve-security\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-co-founder-proposes-zkevm-validium-upgrade-to-improve-security/amp\">proposed upgrading the current Polygon network</a> to use zero-knowledge proofs, which he said was necessary in order to make the old network compatible with the “vision” of 2.0.</p><p>The June 30 post goes into greater detail about what Polygon 2.0 will look like. The foundation of the project will be the “staking layer” that currently exists. This consists of a “validator manager” contract on Ethereum plus an additional “chain manager” contract for each individual Polygon chain. In the future, new Polygon chains will be able to form by launching new chain manager contracts on Ethereum.</p><p>Connecting to this foundational staking layer will be an “interoperability layer” that contains bridges connecting each Polygon chain to each other, through Ethereum. This layer will be secured by using zero-knowledge proofs to validate all transfers.</p><p>The interoperability later will also feature an aggregator that combines individual ZK-proofs from each bridge into one proof before sending it to Ethereum. This will enable “seamless” bridge transactions and “dramatically [reduce] Ethereum gas consumption for proof verification,” the team stated.</p><p>The third layer of Polygon 2.0 will be the current execution layer which relies upon the Erigon Ethereum client, and the fourth layer will be a “proving layer” that standardizes the ZK-proof process across all Polygon chains.</p><p>The team announced that further details about each layer will be provided at a future date.</p><p>Polygon isn’t the only network trying to expand into a multi-chain ecosystem. zkSync Era has announced that it intends to create a network of “Hyperchains,” which it hopes to <a href=\"https://cointelegraph.com/news/zksync-new-hyperchains-network-testnet-by-year-end\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/zksync-new-hyperchains-network-testnet-by-year-end/amp\">launch in a testnet phase</a> by the end of the year. Optimism is also trying to create a “Superchain” in cooperation with Coinbase’s Base network, and it recently <a href=\"https://cointelegraph.com/news/optimism-successfully-completes-bedrock-hard-fork-reducing-deposit-times-layer-1-fees\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/optimism-successfully-completes-bedrock-hard-fork-reducing-deposit-times-layer-1-fees/amp\">implemented its “Bedrock” upgrade</a> to pave the way towards this transformation.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T19:55:15.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Here’s what happened in crypto today. </p><h2>South Korea passes crypto bill to tackle unfair trading</h2><p>The South Korean government is taking steps to protect cryptocurrency investors from implosions like Do Kwon’s Terra ecosystem by passing a new crypto bill.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f8066be1-09a0-4644-929d-3c2e97e36afe.jpg\"  /><figcaption style=\"text-align: center;\">Chairman Kim Do-eup <em>at the plenary meeting of the Judiciary Committee on Legislation held at the National Assembly on the morning of the 29th. Source: Yonhap News</em></figcaption></figure><p>The legislation reportedly <a href=\"https://www.bloomberg.com/news/articles/2023-06-30/south-korea-passes-inaugural-standalone-crypto-bill-after-spate-of-scandals\" target=\"_blank\" rel=\"noopener nofollow\">integrates</a> 19 crypto-related bills, providing a unified bill defining digital assets and imposing penalties for illicit trading activities like using undisclosed information, market manipulation and other unfair trading practices in crypto.</p><h2>Australian crypto association urges unified effort to fight scams</h2><p>The new CEO of Blockchain Australia, the country's peak crypto body, has called for closer collaboration between banks and the government to tackle scams that involve crypto.</p><p>Cryptocurrency exchanges and their Australian customers have had a difficult few months after two major banks imposed blocks, restrictions, and delays to payments going to crypto exchanges, citing the need for consumer protection from scams. </p><p>Simon Callaghan, who now leads Australia's 111-member blockchain lobby group, says the association's focus will now be turned toward ways for the crypto industry to assist the fight.</p><h2>US SEC deems spot Bitcoin ETFs filings as inadequate: Report</h2><p>The United States Securities and Exchange Commission (SEC) put a temporary pause on recent ETF filings from BlackRock, ARK Invest, Fidelity and others citing incomplete paperwork.</p><p>According to the SEC, the exchanges failed to provide adequate disclosure concerning which exchange partner and surveillance-sharing agreements. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">So the SEC wants the ETF proposals to specify the spot exchange with which an information sharing agreement is established with. Which is now missing. This is page 42 of the Blackrock proposal. I&#39;m guessing now not a deal breaker. But bull run on pause regardless. <a href=\"https://t.co/rsPW34wVME\">pic.twitter.com/rsPW34wVME</a></p>&mdash; Alex Krüger (@krugermacro) <a href=\"https://twitter.com/krugermacro/status/1674783671621136384?ref_src=twsrc%5Etfw\">June 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While the delay has caused some discomfort among the community, many are urging patience as the SEC has clearly indicated the companies are welcome to reapply once they’ve updated their paperwork. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-30T19:51:23.000Z",
    "title": "BTC Spot ETFs Rejected by SEC; Applications Lack Clarity",
    "url": "https://cryptobriefing.com/btc-spot-etfs-rejected-by-sec/?utm_source=feed&utm_medium=rss",
    "description": "The U.S. Securities and Exchange Commission (SEC) has reportedly found the recent applications for spot Bitcoin exchange-traded funds (ETFs) to be lacking in clarity and comprehensiveness, according to the Wall..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T19:56:24.000Z",
    "title": "Regulators target South Korean crypto lender Delio",
    "url": "https://www.cryptopolitan.com/regulators-target-crypto-lender-delio/",
    "description": "The storm clouds are gathering over Delio, the prominent South Korean cryptocurrency lending platform. In the wake of the company suspending deposits and withdrawals on June 14, the nation&#8217;s Financial Services Commission (FSC) is now launching a thorough investigation into serious allegations including fraud, embezzlement, and breach of trust involving the platform. The regulators move ... <a title=\"Regulators target South Korean crypto lender Delio\" class=\"read-more\" href=\"https://www.cryptopolitan.com/regulators-target-crypto-lender-delio/\" aria-label=\"More on Regulators target South Korean crypto lender Delio\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T19:46:50.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T19:46:49.000Z",
    "title": "Elizabeth Warren grills Goldman Sachs over SVB failure",
    "url": "https://www.cryptopolitan.com/warren-grills-goldman-sachs-over-svb-failure/",
    "description": "Tension flares as U.S. Senator Elizabeth Warren takes Goldman Sachs to task over the downfall of Silicon Valley Bank (SVB). In an escalating exchange of questions and responses, Warren places the spotlight on Goldman&#8217;s actions and potential gains during SVB&#8217;s tumble into bankruptcy. The backdrop of profits amid losses Warren outlines a narrative where Goldman ... <a title=\"Elizabeth Warren grills Goldman Sachs over SVB failure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/warren-grills-goldman-sachs-over-svb-failure/\" aria-label=\"More on Elizabeth Warren grills Goldman Sachs over SVB failure\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T20:00:45.000Z",
    "title": "Compound (COMP) Blasts Off With 113% Rise In Two-Week Rally, What’s Behind The Surge?",
    "url": "https://www.newsbtc.com/altcoin/compound-comp-blasts-off-with-113-rise-in-two-week-rally-whats-behind-the-surge/",
    "description": "Compound (COMP) has recently surged with a staggering 113% rise in just two weeks, and the reason behind the rally has been the talk of the crypto community. DeFi Ignas, a decentralized finance (DeFi) researcher, has analyzed the recent developments surrounding Compound and provided insights into the potential factors contributing to the surge. Compound Takes The Lead With Triple-Digit Growth In June This remarkable growth has been fueled by a range of factors, including the recent announcement of the launch of Superstate Funds by Compound&#8217;s founder, which aims to bridge traditional markets with blockchain ecosystems. One of the major challenges facing DeFi is the lack of integration with traditional financial markets. While the DeFi space has grown rapidly over the past few years, it is still relatively small compared to the traditional financial system.  Related Reading: XRP Dips After SEC’s ETF Blow But A Rebound Looks Likely By bridging these two worlds, Superstate could help to bring more institutional investors into the DeFi space and increase the overall liquidity and stability of DeFi protocols. Furthermore, Superstate&#8217;s focus on creating regulated financial products could help address some of the regulatory concerns raised about DeFi. While DeFi protocols are decentralized and operate on blockchain networks, they still fall under the jurisdiction of various regulatory bodies.  By creating regulated financial products that comply with existing regulations, Superstate could help to mitigate some of the risks associated with DeFi and pave the way for more widespread adoption of these protocols. Superstate aims to bridge traditional markets with blockchain ecosystems by buying short-term government debt and tokenizing it on blockchains. While it is unclear whether the tokenization will include COMP holders or lead to an airdrop, this announcement has generated excitement and speculation among the crypto community. Jump Crypto Whale Responsible For COMP Rally? While new governance proposals have been introduced, none have been significant enough to account for the sudden price increase. However, there has been a significant balance change among various Jump Crypto wallets. Jump Crypto wallets are a group of cryptocurrency wallets associated with Jump Trading, a Chicago-based trading firm specializing in high-frequency trading strategies. The wallets have been identified as significant players in the cryptocurrency market, particularly in the DeFi space, where they have been involved in market making and liquidity provision. These wallets have emerged as major players in the COMP market. One of these wallets holds many COMP tokens and has been involved in significant balance changes, including the recent withdrawal of 170,000 COMP tokens from Binance. This withdrawal amounts to $9.7 million and represents 1.7% of the total supply of COMP. Related Reading: OKX Liquid Marketplace Records Over $3 Billion In Institutional Trade Volume The actions of this particular wallet appear to be the primary reason for the recent surge in the COMP price. The withdrawal of such a large amount of tokens from Binance has significantly increased demand for COMP, driving up its price. As a result, this wallet now ranks as the ninth-largest holder of COMP tokens. Compound&#8217;s native token, COMP, is trading at $58, following its uptrend that began on June 16th. In the last 24 hours, COMP has continued to soar with a 14% gain and is currently attempting to break through the $60 level to surpass its yearly high of $64 achieved in February. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T20:00:25.000Z",
    "title": "Whales Move Over $1,282,800,000 in Bitcoin, Ethereum and Dogecoin – Here’s Where the Crypto Is Headed",
    "url": "https://dailyhodl.com/2023/06/30/whales-move-over-1282800000-in-bitcoin-ethereum-and-dogecoin-heres-where-the-crypto-is-headed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/whales-move-over-where.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Deep-pocketed crypto traders are moving around more than a billion dollars worth of Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE). New data from whale-surveying platform Whale Alert reveals that crypto whales have shifted about $1.282 billion worth of funds during the last few days, with the largest chunk of transfers involving Bitcoin. Whale Alert notes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/whales-move-over-1282800000-in-bitcoin-ethereum-and-dogecoin-heres-where-the-crypto-is-headed/\">Whales Move Over $1,282,800,000 in Bitcoin, Ethereum and Dogecoin – Here’s Where the Crypto Is Headed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T19:55:03.000Z",
    "title": "Crypto Analyst Breaks Down Bitcoin (BTC), Fantom (FTM), Litecoin (LTC) and the Altcoin Markets",
    "url": "https://dailyhodl.com/2023/06/30/crypto-analyst-breaks-down-bitcoin-btc-fantom-ftm-litecoin-ltc-and-the-altcoin-markets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/endangers-btc-cruz.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is breaking down Bitcoin (BTC) and altcoins after a week of sideways price action for crypto. Crypto trader Michaël van de Poppe tells his 659,500 Twitter followers that BTC is now moving into a &#8220;potential scenario for a long trigger.&#8221; &#8220;Well, we got the sweep for Bitcoin.&#8221; BTC is worth $30,038 at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/crypto-analyst-breaks-down-bitcoin-btc-fantom-ftm-litecoin-ltc-and-the-altcoin-markets/\">Crypto Analyst Breaks Down Bitcoin (BTC), Fantom (FTM), Litecoin (LTC) and the Altcoin Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]