[
  {
    "source": "Decrypt",
    "date": "2023-10-05T01:43:44.000Z",
    "title": "Canva Bolsters AI Toolkit with Video Generation by Runway",
    "url": "https://decrypt.co/200251/canva-ai-magic-generative-tool-runway",
    "description": "To fight deepfakes, Canva’s new platform restricts its AI from generating images of celebrities."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T02:03:09.000Z",
    "title": "Time to ‘pull the brakes’ on Ethereum and rotate back to Bitcoin: K33 report",
    "url": "https://cointelegraph.com/news/ethereum-eth-etf-launch-lackluster-bitcoin-k33-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/50f34cc2-9420-4507-bf3c-2bb60b7172f8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“The gravitational pull in crypto for the time being stays in BTC,” said K33 senior analyst Vetle Lunde.</p>\n                    <p><p>The relatively lackluster performance of nine new Ethereum futures exchange traded funds (ETFs) has prompted analysts at K33 Research to urge a “rotate back” into Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). </p><p>In an Oct. 3 market <a href=\"https://k33.com/research/articles/underwhelming-demand-for-ether-etfs\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, analysts Anders Helseth and Vetle Lunde said that it’s “time to pull the brakes on ETH and rotate back into BTC,” with the initial trading volume of Ether futures ETFs only accounting for 0.2% of what the ProShares Bitcoin Strategy ETF (BITO) amassed on its first day of trading in Oct. 2021. </p><p>While the analysts noted that no one expected to see initial trading volume on the Ether futures ETFs “come anywhere close” to that of the Bitcoin futures ETFs — launched amid a raging bull market — <a href=\"https://cointelegraph.com/news/ethereum-futures-etfs-launch-low-volume-trading-first-day\">the underwhelming first-day numbers</a> “strongly” missed expectations.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ce095f8e-1daf-4b5f-bc03-e50486a1970b.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Day one trading of ETH futures ETFs accounted for just 0.2% of what BTC futures ETFs amassed in 2021. Source: K33 Research</em></figcaption></figure><p>This lack of institutional appetite for Ether ETFs caused Lunde to walk back on his previous advice of increasing ETH allocation to best capitalize on the ETF hype. </p><p>“The ETH futures ETF launch provides an important lesson for evaluating the impact of easier access to crypto investments for traditional investors: increased institutional access will only create buying pressure if significant unsatiated demand exists,” wrote Lunde. </p><blockquote>“This is not the case for ETH at the moment.”</blockquote><p>In the section of the report titled “more chop ahead,” Lunde explained that the vast majority of the crypto market lacks any meaningful short-term price catalysts and will most likely continue on its sideways trajectory for the foreseeable future. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-bull-market-us-faces-bear-steepener-arthur-hayes\"><strong><em>Bitcoin bull market awaits as US faces ‘bear steepener’ — Arthur Hayes</em></strong></a></p><p>In Lunde’s view, this landscape is only really favorable for Bitcoin, which has a potential spot for ETF approval to look forward to early next year, as well <a href=\"https://cointelegraph.com/news/bitcoin-halving-efficient-btc-mining-costs-30k\">as the halving event which is currently</a> on track for mid-April.</p><blockquote>“The gravitational pull in crypto for the time being stays in BTC, with a promising event horizon down the line, still favoring aggressive accumulation.”</blockquote><p>Ben Laidler, global markets strategist at eToro, charted a similar path ahead for crypto assets, albeit with a slightly more bearish sentiment.</p><p>In emailed comments to Cointelegraph, Laidler pointed to current macro trends as a potential downward trigger for prices of mainstay crypto assets like Bitcoin. </p><p>“The Fed and oil prices have been consistently powerful macro influencers on the crypto market in the past couple of years,” wrote Laidler. “At the late stage of the rate hike cycle we’re in, the market is looking for further good news to push on, but with oil prices rising again, this could have a cooling effect on sentiment.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T01:57:34.000Z",
    "title": "Crypto powerhouse CMCC Global garners an astonishing $100 million for Hong Kong-based fund",
    "url": "https://www.cryptopolitan.com/cmcc-global-secures-100-million-crypto-fund/",
    "description": "Hong Kong, CMCC Global, a leading venture capital firm with a keen focus on crypto and blockchain projects, has made headlines with its recent announcement. The firm has successfully raised a staggering US$100 million for its Titan Fund, a new initiative aimed at bolstering early-stage Web3 start-ups, particularly those based in Asia and Hong Kong. ... <a title=\"Crypto powerhouse CMCC Global garners an astonishing $100 million for Hong Kong-based fund\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cmcc-global-secures-100-million-crypto-fund/\" aria-label=\"More on Crypto powerhouse CMCC Global garners an astonishing $100 million for Hong Kong-based fund\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T02:00:25.000Z",
    "title": "Celsius Commits To Massive Crypto Repayment: $2 Billion To Creditors By 2023’s End",
    "url": "https://www.newsbtc.com/news/celsius-commits-to-massive-crypto-repayment-2-billion-to-creditors-by-2023s-end/",
    "description": "Celsius Network, a bankrupt digital asset lender, has revealed plans to begin repaying creditors using billions of dollars in crypto assets before the year&#8217;s end.  The company presented a restructuring plan, outlined in a recent filing to a US bankruptcy court, which aims to generate funds for a new corporate spinoff known as &#8220;NewCo&#8221; and facilitate customer repayments. Celsius Vows To Clear $2 Billion Debt According to the filing, the plan outlines a distribution of at least $2.03 billion in cryptocurrency to creditors, with the actual amount subject to fluctuations in the cryptocurrency market.  Related Reading: FTX’s FTT Price Skyrockets 20%: Here’s Why the Rally Has Just Begun This distribution will occur as soon as reasonably practicable after the plan becomes effective, either through the NewCo transaction or an orderly wind down. The NewCo transaction, sponsored by the Fahrenheit Group, is a key component of the plan.  It involves the creation of a new cryptocurrency company owned by customers, focusing on Bitcoin mining and staking. NewCo, which aims to maximize liquidity by listing on NASDAQ, will be managed by experienced crypto-native operators from Fahrenheit.  The group has committed to injecting up to $50 million as an equity stake in NewCo, aligning the interests of Fahrenheit and creditors who will own shares in the new company. In the event that the NewCo transaction cannot be completed, the plan includes an orderly wind-down option that would provide creditors with better recoveries compared to a Chapter 7 liquidation. Celsius&#8217;s legal representative, Christopher S. Koenig, also revealed that the restructured company, expected to emerge from Chapter 11, will receive $450 million in capital and financial backing.  However, the focus remains on the successful execution of the NewCo transaction, which would mark a significant milestone as the first revival of a failed crypto platform under Chapter 11, following the industry&#8217;s wave of insolvencies last year. While the approval of Celsius&#8217;s plan is under deliberation by Judge Martin Glenn, some customers who have been unable to access their funds have expressed opposition.  Additionally, an affiliate of Lantern Ventures owed approximately $82 million, has challenged the plan, claiming overvaluation of the new business by Celsius&#8217;s advisors. Clearance from securities regulators will also be necessary for the new venture. Related Reading: Will Bitcoin Price Crash To $10,000? Bloomberg Expert Reveals When It is important to note that if the new company were to fail, liquidation could become a possibility, potentially resulting in lower repayments for customers.  Nonetheless, Celsius Network&#8217;s proposed plan represents a significant effort to repay creditors and potentially revitalize the company, providing hope for both the cryptocurrency industry and affected stakeholders. At present, the native token of the company, CEL, is trading at $0.1535, reflecting a 1.1% decline over the past 24 hours. However, it is noteworthy that the token has experienced a notable upward trend in the last 30 days, exhibiting a substantial surge of over 21% during this period. Featured image from Shutterstock, chart from TradingView.com"
  }
]