[
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T22:55:49.000Z",
    "title": "Ex-SEC chair Jay Clayton says approval for a spot Bitcoin ETF is ‘inevitable’",
    "url": "https://cryptoslate.com/ex-sec-chair-jay-clayton-calls-spot-bitcoin-etf-approval-inevitable/",
    "description": "<p>Former SEC chair Jay Clayton suggested that U.S. securities regulators will likely approve a Bitcoin ETF during an interview with CNBC on Sept. 1. Clayton nevertheless said he was not surprised that the U.S. Securities and Exchange Commission (SEC) had postponed decisions on various pending Bitcoin ETFs. He went on to explain that &#8220;the job [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ex-sec-chair-jay-clayton-calls-spot-bitcoin-etf-approval-inevitable/\">Ex-SEC chair Jay Clayton says approval for a spot Bitcoin ETF is &#8216;inevitable&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T23:08:49.000Z",
    "title": "Binance Australia’s head is optimistic about crypto regulation",
    "url": "https://www.cryptopolitan.com/binance-australia-head-on-crypto-regulation/",
    "description": "In the midst of turbulence in the crypto sector, a silver lining emerges from Down Under. Ben Rose, the General Manager of Binance Australia, displays an unwavering optimism regarding Australia&#8217;s impending regulations on digital assets. While the crypto world has faced challenges from both the financial and regulatory sectors, Rose remains steadfast in his belief ... <a title=\"Binance Australia&#8217;s head is optimistic about crypto regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-australia-head-on-crypto-regulation/\" aria-label=\"More on Binance Australia&#8217;s head is optimistic about crypto regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T22:59:49.000Z",
    "title": "UK’s travel rule enacted – Crypto industry in trouble",
    "url": "https://www.cryptopolitan.com/uks-travel-rule-crypto-industry-in-trouble/",
    "description": "It&#8217;s official. The United Kingdom, in its latest regulatory move, has placed a tight leash on the crypto industry. As of September 1, crypto-focused firms within the UK borders will find themselves contending with the Travel Rule for cryptocurrency. And while it might be named the &#8220;Travel Rule&#8221;, there&#8217;s no vacation in sight for these ... <a title=\"UK&#8217;s travel rule enacted &#8211; Crypto industry in trouble\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uks-travel-rule-crypto-industry-in-trouble/\" aria-label=\"More on UK&#8217;s travel rule enacted &#8211; Crypto industry in trouble\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T23:00:45.000Z",
    "title": "On-chain Sleuth Potentially Unveils Shiba Inu Founder With Shocking Affiliates",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-founder/",
    "description": "The identity of the mind behind the Shiba Inu meme coin has been a long-standing crypto mystery since it first debuted in 2020. So far, there has been no concrete proof as to who it might be with guesses ranging from FTX’s Sam Bankman-Fried to Ethereum’s Vitalik Buterin. Despite having little success so far, crypto investigators have not given up as a new theory has popped up as to the creator behind Shiba Inu. Has The Shiba Inu Founder Been Identified? An X (formerly Twitter) user identified by the username @boringsleuth first drew attention on Thursday, August 1, after they posted an elaborate theory as to who the founder of Shiba Inu is. In this initial thread, the researcher put forward that there was not one but two founders behind the coin. Related Reading: Grayscale Victory Sends Bitcoin Open Interest Surging After Hitting One-Year Lows Two names were put forward &#8211; Ryo Suzuki &#38; Tsuyoshi Maruyama, a combination of which the researcher believes was used to make the widely known Ryoshi moniker. Interestingly, both of the people named were identified to be advisors of B2C2, a liquidity provider. This is where the investigator makes the connection to Shiba Inu. According to Boring Sleugh, the liquidity provider’s wallet once held 25% of the total SHIB supply in its wallet. Furthermore, they linked the two alleged founders together by pointing out that Tsuyoshi Maruyama had immediately taken over as an advisor for B2C2 when Ryo Suzuki stepped down from the role in 2021. A follow-up post from the researcher digs deeper into Suzuki’s past, tying him to an internship at Microsoft when SHIB was launched, as well as a visit to the infamous MIT media lab in 2019. Wait until I show you that Ryo Suzuki, who I believe is the real founder of $SHIB, visited MIT&#8217;s media lab in 2019. Yeah, this same media lab that links Gensler, Epstein &#38; Gates? What if I told you the Canadian Ryo Suzuki was also an intern for Microsoft when Shiba Inu launched? https://t.co/H2PM5FNkLb pic.twitter.com/nwkUz27Cu4 — TruthLabs 🫡 (@BoringSleuth) August 31, 2023 Unveiling Shocking Connections After debuting the theories on Thursday, it seemed Boring Sleuth was not done as a continuation was posted on Friday morning. This time around, the on-chain sleuth presents theories that connect the alleged founder to prominent personalities and organizations. The first of these was a connection to Ethereum founder Vitalik Buterin through a series of transactions that connected the Shiba Inu deployer wallet to Buterin’s wallet. The wallet in question identified as “0x2135” was not only connected to Buterin, however. The sleuth lists out notable people and organizations the wallet has also been connected to in the tweet below: Wallet 0x2135 is connected to: Multiple Vitalik Buterin wallets CCP official Roger Lim (HATES the West) Satofishi, Binance Dev/Stakefish Founder Wanxiang (Gensler gave them special Broker Dealer license) LingLing &#38; Multichain Dev (Crypto Cartel) Maker DAO Multisig &#38; More 7/8 pic.twitter.com/eib84d1CQN — TruthLabs 🫡 (@BoringSleuth) September 1, 2023 The infamous gifting of half the total SHIB supply to Vitalik Buterin is also called into question, which one X user refers to as “a massive money laundering scheme.” In response, Boring Sleuth says that the ‘gift’ was a 100% tax write-off for the Ethereum founder. “He captured all the value without moving price down 1 cent,” the researcher added. Related Reading: Bitcoin Cash Traders Move Into Profit, But Can The Rally Continue? Despite how convincing Boring Sleuth’s theories have been for some, there is still no confirmation of who the SHIB founder(s) are. The sleuth alludes to this as well in their most recent tweet saying “If you don&#8217;t know, the Shib founder has yet to come out.” SHIB price loses $0.000008 support again &#124; Source: SHIBUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Unsplash, chart from TradingView.com"
  }
]