[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T23:40:40.000Z",
    "title": "Ethereum price hits 6-month high amid BlackRock spot ETF buzz, but where’s the retail demand? ",
    "url": "http://cointelegraph.com/news/ethereum-price-hits-6-month-high-amid-black-rock-spot-etf-buzz-wheres-retail-demand",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5d9172e4-65c6-4d85-ad5d-932d2751d49d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ETH price finally polevaulted the $2,000 resistance, but will retail demand and network use support the current bullish momentum?  </p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) experienced a surprising 8% rally on Nov. 9, breaking the $2,000 barrier and achieving its highest price level in six months. This surge, triggered by news of BlackRock registering the iShares Ethereum Trust in Delaware, resulted in $48 million worth of liquidations in ETH short futures. The initial announcement was made by @SummersThings on a social network, later confirmed by Bloomberg ETF analysts.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The iShares Ethereum Trust has just been registered in Delaware.<br><br>For context, BlackRock&#39;s iShares Bitcoin Trust was registered in a similar manner 7 days before they filed the ETF application with the SEC. Details below.<br><br>[announcement: I’m moving to <a href=\"https://twitter.com/SynopticCom?ref_src=twsrc%5Etfw\">@SynopticCom</a> soon] <a href=\"https://t.co/IYafIaxMzA\">pic.twitter.com/IYafIaxMzA</a></p>&mdash; Summers (@SummersThings) <a href=\"https://twitter.com/SummersThings/status/1722630271013675199?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The news fueled optimistic expectations regarding a potential Ether spot ETF filing by BlackRock, a $9 trillion asset manager. This speculation follows BlackRock's iShares Bitcoin Trust registry in Delaware in June 2023, a week prior to their initial <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">spot Bitcoin ETF application</a>. However, with no official statement from BlackRock, investors may have jumped the gun, though the sheer influence of the asset manager in traditional finance leaves those betting against Ether's success in a precarious position.</p><h2>Professional traders placed bullish ETH bets using derivatives</h2><p>To understand how professional traders are positioned after the surprise rally, one should analyze the ETH derivatives metrics. Normally, Ether monthly futures trade at a 5%–10% annualized premium compared to spot markets, indicating that sellers demand additional money to postpone settlement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/db336427-ba06-46dc-8782-edc6177c5806.png\"  /><figcaption style=\"text-align: center;\"><em>Ether 2-month futures premium. Source: Laevitas</em></figcaption></figure><p>The Ether futures premium, jumping to 9.5% on Nov. 9, marked the highest level in over a year and broke above the 5% neutral threshold on Oct. 31. This shift ended a two-month bearish period and low demand for leveraged long positions.</p><p>To assess whether the break above $2,000 has led to excessive optimism, traders should examine the Ether options markets. When traders anticipate a drop in Bitcoin’s price, the delta 25% skew tends to rise above 7%, while periods of excitement typically see it dip below negative 7%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c34c07a2-f0dc-4ca7-8110-8bd94947cdf5.png\"  /><figcaption style=\"text-align: center;\"><em>Ether 30-day options 25% delta skew. Source: Laevitas</em></figcaption></figure><p>The Ether options 25% delta skew shifted from neutral to bullish on Oct. 31, and the current -13% skew is the lowest in over 12 months, but far from being overly optimistic. Such a healthy level has been the norm for the past 9 days, meaning Ether investors were anticipating the bullish momentum.</p><p>There’s little doubt that Ether bulls got the upper hand regardless of the spot ETF narrative as ETH rallied 24% before the BlackRock news, between Oct. 18 and Nov. 8. This price action reflects a higher demand for Ethereum network, as reflected by the top decentralized applications (DApps) 30-day <a href=\"https://dappradar.com/rankings/protocol/ethereum?range=30d\" target=\"_blank\" rel=\"noopener nofollow\">volumes</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6aadc24d-417c-47e6-a605-b371072c85f0.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum network DApps volume rank. Source: DappRadar</em></figcaption></figure><p>Still, when analyzing the broader cryptocurrency market structure, especially the retail indicators, there’s some inconsistency with the surging optimism and demand for leverage using Ether derivatives. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etf-only-month-after-sec-approval\"><strong><em>Bitcoin ETF launch could be delayed more than a month after SEC approval</em></strong></a></p><h2>Retail indicators point to dormant demand for ETH and cryptocurrencies</h2><p>For starters, the Google searches for “Buy Ethereum”, “Buy ETH” and “Buy Bitcoin” have been stagnant for the past week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0d8f4a2b-dafa-4e3b-8e1d-0c865e59f943.png\"  /><figcaption style=\"text-align: center;\"><em>Search trend for buying Ether and cryptocurrency-related terms. Source: Google Trends</em></figcaption></figure><p>One might argue that retail traders typically lag the bull runs, usually entering the cycle a couple of days or weeks after major price marks and 6-month high have been hit. However, there has been a declining demand for cryptocurrencies, when using stablecoins premium as a gauge for Chinese crypto retail trader activity.</p><p>The stablecoin premium measures the difference between China-based peer-to-peer USD Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) trades and the United States dollar. Excessive buying demand tends to pressure the indicator above fair value at 100%, and during bearish markets, Tether’s market offer is flooded, causing a 2% or higher discount.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ca2c1d3d-315c-478a-b5ba-5c19a8ba3f41.png\"  /><figcaption style=\"text-align: center;\"><em>Tether (USDT) peer-to-peer vs. USD/CNY. Source: OKX</em></figcaption></figure><p>Currently, the Tether premium on OKX stands at 100.9%, indicating a balanced demand from retail investors. Such a level contrasts with the 102% from Oct. 13, for instance, before the crypto total market capitalization jumped 30.6% until Nov. 9. That goes on to show that Chinese investors are yet to present an excessive demand for fiat-to-crypto conversion using stablecoins.</p><p>In essence, Ether’s rally above $2,000 seems to have been driven by derivatives markets and the expectation of a spot ETF approval. The lack of retail demand is not necessarily an indicator of impending correction. However, the hype around BlackRock's Ethereum Trust registry, coupled with excessive leverage longs in ETH derivatives, raises concerns, putting the $2,000 support level to the test.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T00:00:16.000Z",
    "title": "Dogecoin Price Chart Described As ‘Beautiful’ By Crypto Analyst",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-chart-described-as-beautiful/",
    "description": "Dogecoin (DOGE) enthusiasts and investors are on the edge of their seats as prominent crypto analysts forecast an imminent breakout for the popular meme coin. Pseudonymous analyst Kaleo&#8217;s recent remarks on the promising trajectory of the meme coin have ignited a sense of anticipation within the crypto community.  Kaleo&#8217;s assertion that Dogecoin &#8211; calling its USD price chart &#8220;beautiful&#8221; &#8211; could soon experience a surge akin to other thriving altcoins in the market has brought renewed attention to the coin&#8217;s potential for substantial growth. Kaleo&#8217;s optimism stems from the encouraging trends witnessed across the altcoin market, indicating a potential squeeze out of the current trading range for Dogecoin. With a confident outlook on the USD chart, Kaleo emphasizes the possibility of a consolidation phase preceding a significant upward surge for the popular cryptocurrency. This projection has prompted fervent discussions and debates among investors, with many eagerly awaiting the speculated breakthrough. $DOGE Honestly though &#8211; look at how beautiful the USD chart is. The way alts are starting to pop off, I find it hard to believe Dogecoin doesn&#8217;t see a squeeze out of its current range. Long it with me here: https://t.co/32dHnZIFxS pic.twitter.com/cEvgKIQyJt — K A L E O (@CryptoKaleo) November 6, 2023 DOGE Draws Attention Adding to the mounting anticipation, esteemed crypto analyst Ali Martinez has also voiced support for a bullish sentiment surrounding Dogecoin&#8217;s future. Martinez, in a recent tweet on the social media platform X, emphasized the critical juncture that Dogecoin finds itself in, suggesting that the current tight zone holds significant implications for the coin&#8217;s impending trajectory. #Dogecoin is navigating a tight zone, sandwiched by two crucial supply walls. 📉 Support Wall: Spanning $0.072-$0.073, with 200K addresses holding 28.6B $DOGE. 📈 Resistance Wall: Ranging from $0.074-$0.076, where 124K addresses hold 26.95B #DOGE. Note that support outstrips… pic.twitter.com/O5FRIJ1SIl — Ali (@ali_charts) November 8, 2023 Related Reading: Bitcoin Indicator Backed By Founders Of Top Crypto Data Analytics Firm Predicts Bullish Trends Highlighting the presence of vital supply walls encompassing DOGE&#8217;s current position, Martinez underlines the pivotal roles of a support wall and a resistance wall in shaping the coin&#8217;s immediate market behavior. As investors closely monitor the developments, the current price of Dogecoin stands at $0.075 according to CoinGecko. Notably, the cryptocurrency has experienced a moderate 1.3% increase in the past 24 hours, further fueling the optimism surrounding its potential breakout. DOGE market cap currently at $10.7 billion. Chart: TradingView.com Over the span of the last seven days, Dogecoin has witnessed a notable rally of 8.4%, indicating a gradual but promising upward trend that has caught the attention of market participants and analysts alike. Factors Propelling Dogecoin&#8217;s Potential Surge Despite recent market fluctuations and the general uncertainty surrounding the cryptocurrency landscape, Dogecoin has managed to solidify its position as a prominent player in the digital currency market. The upcoming potential breakout for DOGE is underpinned by several key factors that have instilled confidence in the minds of analysts and investors alike. Related Reading: Cardano October Whale Frenzy – What Lies Ahead For November? The evolving trend of altcoins making significant strides in the market has set a favorable backdrop for Dogecoin&#8217;s anticipated surge. As other digital assets continue to garner attention and register substantial gains, the overall market sentiment appears conducive to DOGE&#8217;s upward movement. This growing momentum within the altcoin sector has created an optimistic atmosphere, with analysts anticipating that DOGE will capitalize on this trend to propel its own growth trajectory. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Kevin_Y/Pixabay"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T00:00:10.000Z",
    "title": "Polygon (MATIC) Flying: Is This Program The Primary Catalyst?",
    "url": "https://www.newsbtc.com/matic/polygon-matic-flying-is-this-program-the-primary-catalyst/",
    "description": "MATIC, the native token of Polygon, an Ethereum sidechain, is ripping higher, mirroring the general performance across the crypto scene, spearheaded by Bitcoin (BTC). As of November 9, MATIC is up roughly 5% in the past 24 hours and inching closer to July 23 highs, looking at the candlestick arrangement in the daily chart. This upswing is at the back of rising trading volume and improving sentiment, which has seen the token expand 64% from October lows, a net positive for optimistic traders. The 110 Million MATIC Grant Looking at events in the past few trading days, the MATIC rally seems to have been catalyzed by Polygon Village&#8217;s recent announcement. The team said it plans to distribute 110 million MATIC to projects aiming to deploy decentralized finance (DeFi), gaming, and social media solutions on the sidechain.  Related Reading: Ethereum Price Cracks Above $2,000 As BlackRock Eyes ETH ETF Polygon said late-stage projects can receive direct grants of up to 2 million MATIC. Meanwhile, early-stage projects and startups, can apply via quadratic funding grants.  In this funding arrangement, the amount of MATIC sent to a project will directly depend on how popular the project is. Those that are popular among crypto holders will receive more funds. Still, it remains unclear how Polygon Labs will deal with bots when deciding how popular a given project is. Voting will be on-chain on Polygon, where MATIC will be the currency through which users can support their favorite projects. Polygon Rising Stature: From POL To ZK-EVM Over the years, Polygon has emerged as a popular scaling solution for Ethereum, looking at statistics and total value locked (TVL), especially in DeFi. The platform is compatible with the Ethereum Virtual Machine (EVM). Accordingly, it allows protocols launching on its rails to easily connect with the mainnet without sacrificing security. By connecting with Polygon, projects can operate in a highly scalable environment with relatively low fees. This feature allows intensive dapps, including social media platforms or decentralized exchanges (DEXes), to operate seamlessly. Polygon is also transitioning and, subject to the community&#8217;s approval, will gradually replace MATIC with POL. This token will power the broader ecosystem, including supernets and layer-2 networks relaying on Polygon&#8217;s infrastructure. In late October, the POL contracts went live on the Ethereum mainnet as part of Polygon 2.0. This transition will see Polygon integrate zero-knowledge (ZK) technology into all its products.  Related Reading: A Chat With Paolo Ardoino: What’s Behind The Bitcoin Price Rally, New Role As CEO, And Adoption Manta Network said it would retool and integrate Polygon&#8217;s Chain Development Kit (CDK) in mid-October. Doing this, the protocol migrated from the optimistic rollup it initially launched on. Using Polygon&#8217;s CDK, Manta integrates zk Rollup technology to settle transactions faster and confidentially. Feature image from Canva, chart from TradingView"
  }
]