[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T10:18:44.000Z",
    "title": "Arpa Network Goes Live on Ethereum Mainnet ",
    "url": "https://www.coindesk.com/tech/2023/06/21/arpa-networks-goes-live-on-ethereum-mainnet/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ARPA Network will also initiate the minting of the remaining 500 million arpa (ARPA) tokens that have been reserved for staking rewards out of its max supply."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T10:24:04.000Z",
    "title": "Bitcoin up 36% YoY after China warned BTC was ‘heading to zero’",
    "url": "https://cointelegraph.com/news/bitcoin-up-36-after-china-warned-btc-zero",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7141fd18-0d12-4605-9ab8-345c0a3f33cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite warning about Bitcoin’s “worthlessness,” China has apparently never prohibited its citizens from HODLing the cryptocurrency.</p>\n                    <p><p>The government of China had been trying hard to make people believe that Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) would become worthless, but its predictions to date have been far off the mark. The original crypto currency has gained as much as 36% since official statements a year ago that it would become worthless.</p><p>Amid a wild bear market of 2022, the Chinese government attempted to capitalize on a massive market decline, warning crypto investors that Bitcoin prices were “heading to zero.”</p><p>Exactly one year ago, the Chinese national news media agency Economic Daily <a href=\"https://cointelegraph.com/news/china-warns-bitcoin-is-heading-to-zero-but-boe-looks-on-the-bright-side\">issued a warning about Bitcoin</a>, in an effort to assure citizens that BTC was a worthless “string of digital codes.”</p><p>“In the future, once investors’ confidence collapses or when sovereign countries declare Bitcoin illegal, it will return to its original value, which is utterly worthless,” the article read.</p><p>While it’s yet to be seen whether Bitcoin is heading to zero one day, Bitcoin has not lost any value since the Chinese government made the warning. On the contrary, Bitcoin has significantly increased since the article was published.</p><p>According to data from CoinGecko, Bitcoin <a href=\"https://www.coingecko.com/en/coins/bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">traded</a> at around $20,000 by the time the Economic Daily released the article in June 2022. Twelve months later, BTC is trading at $28,852, up around 36% at the time of writing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1287c8ab-ef4a-4453-b348-ad749b193ae7.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin one-year price chart. Source: CoinGecko</em></figcaption></figure><p>Despite posting notable gains, Bitcoin has seen its ups and downs over the past year. The largest cryptocurrency by market cap <a href=\"https://cointelegraph.com/news/bitcoin-price-gains-1k-in-minutes-as-cpi-data-deals-dxy-fresh-2-dip\">dropped to as low as $15,700</a> in November 2022. Then, in April 2023, <a href=\"https://cointelegraph.com/news/bitcoin-hits-30k-to-mark-highest-price-since-june-2022\">Bitcoin briefly crossed the $30,000</a> price mark.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-s-regulatory-lead-sets-it-up-to-be-major-crypto-hub\"><strong><em>Hong Kong’s regulatory lead sets it up to be major crypto hub</em></strong></a></p><p>China was one of the first countries in the world to take regulatory action against crypto. In 2017, Chinese regulators <a href=\"https://cointelegraph.com/news/breaking-all-chinese-bitcoin-exchanges-must-close-by-september-30\">banned cryptocurrency exchanges from providing services</a> in the country. Despite the ban, Bitcoin continued to hit its all-time highs, <a href=\"https://cointelegraph.com/news/bitcoin-hits-20000-per-coin-capping-year-of-enormous-growth\">surging 1,900% all the way up to $20,000</a> by the end of 2017.</p><p>In 2021, China’s central bank <a href=\"https://cointelegraph.com/news/chinese-regulators-unite-forces-to-crack-down-on-crypto\">announced a new ban on crypto</a>, uniting forces with various Chinese authorities in order to crack down on local crypto activity. Just a few months after the ban was announced, <a href=\"https://cointelegraph.com/news/clear-skies-for-bitcoin-price-discovery-if-giant-70k-btc-sell-wall-is-scaled\">Bitcoin hit its all-time highs at around $68,000</a> in November 2021.</p><p>Despite “banning” crypto in 2021, China has remained the <a href=\"https://cointelegraph.com/news/china-returns-as-2nd-top-bitcoin-mining-hub-despite-the-crypto-ban\">second-largest Bitcoin miner</a> in the world. The Chinese government also apparently <a href=\"https://cointelegraph.com/news/possession-of-bitcoin-still-legal-in-china-despite-the-ban-lawyer-says\">allows citizens to own cryptocurrency</a> and protects the rights of crypto investors.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/peter-mccormack-twitter-regret-bitcoin-bedford-football/\"><strong><em>Hall of Flame: Peter McCormack’s Twitter regrets — ‘I can feel myself being a dick’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T10:22:25.000Z",
    "title": "Invesco joins BlackRock, WisdomTree in filing for spot Bitcoin ETF",
    "url": "https://cryptoslate.com/invesco-joins-blackrock-wisdomtree-in-filing-for-spot-bitcoin-etf/",
    "description": "<p>U.S.-based investment manager Invesco re-filed its spot Bitcoin ETF application with the Securities Exchange Commission (SEC) on June 20. In conjunction with Galaxy Digital, the firm had previously filed for a spot Bitcoin ETF in September 2021. It also applied for a futures ETF product, named &#8220;The Invesco Bitcoin Strategy ETF,&#8221; in August 2021 &#8211; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/invesco-joins-blackrock-wisdomtree-in-filing-for-spot-bitcoin-etf/\">Invesco joins BlackRock, WisdomTree in filing for spot Bitcoin ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-21T10:12:57.000Z",
    "title": "Altcoin Daily on Recent and Upcoming Changes to Ethereum, Cardano, and Polygon You Should Know About",
    "url": "https://www.cryptoglobe.com/latest/2023/06/altcoin-daily-on-recent-and-upcoming-changes-to-ethereum-cardano-and-polygon-you-should-know-about/",
    "description": "In a recent video from the YouTube series “Altcoin Daily,”  upgrades to Ethereum (ETH), Cardano (ADA), and Polygon (MATIC) were discussed, providing valuable insights for investors and crypto enthusiasts alike. The video begins by highlighting the growing confidence in Bitcoin and Ethereum, as evidenced by net outflows from exchanges. This trend indicates that more of these […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T10:28:06.000Z",
    "title": "LBank Joins Forces with Seoul Meta Week 2023 as Co-Creation Partner",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-joins-forces-with-seoul-meta-week-2023-as-co-creation-partner",
    "description": "<p>Road Island, British Virgin Islands, June 21st, 2023, Chainwire</p><p>LBank, a leading global crypto exchange, is proud to announce its partnership as a co-creation partner for Seoul Meta Week 2023. The conference will take place from June 26 to 30 at the elegant COEX Auditorium in the heart of Seoul.</p><p>LBank teams up with industry giants such as Tencent, Google Cloud, Roblox, Polygon, OKX, The Sandbox, and governmental organizations including Korea's Ministry of Science and ICT, the Ministry of Trade, Industry and Energy, the Seoul Metropolitan Government, and the Seoul Tourism Organization, as co-creation partners for this week-long festival.</p><p>Seoul Meta Week 2023 brings together distinguished industry leaders, experts, and enthusiasts to explore the latest trends and advancements in blockchain technology. The conference features a diverse range of programs designed to inspire, educate, and connect participants. Attendees will have the opportunity to engage in enlightening conferences where renowned speakers exchange insights, explore captivating exhibitions by both local and international firms, participate in expert workshops, and enjoy networking opportunities with top industry players.</p><p>As a co-creation partner, LBank is excited to contribute its expertise and support to drive innovation and foster the growth of the Web3 and blockchain ecosystem. LBank's participation underscores its commitment to promoting technological advancements and facilitating the widespread adoption of digital assets. Through its presence at Seoul Meta Week 2023, LBank aims to foster collaboration, inspire industry players, and showcase the transformative potential of blockchain technology.</p>\"We are delighted to support Seoul Meta Week 2023 as a co-creation partner,\" said Eric He, Chairman of LBank. \"This partnership exemplifies our dedication to shaping the future of the Web3 industry and fostering a vibrant ecosystem. We look forward to engaging with industry leaders, sharing insights, and contributing to the success of this remarkable event.\"<p>Seoul Meta Week 2023 will take place within the COEX Convention &amp; Exhibition Center, located in the Samseong-dong ward of Seoul&rsquo;s Gangnam-gu district. The event is set to attract a diverse range of participants, including entrepreneurs, investors, Web3 developers, and crypto enthusiasts from around the globe. By providing a platform for networking, knowledge sharing, and collaboration, Seoul Meta Week 2023 aims to inspire innovative solutions to global challenges with this new breed of technology.</p><p>LBank Labs, LBank&rsquo;s venture capitalist arm and blockchain accelerator, is also set to partner up with the Seoul Metropolitan Government in late July to sponsor the Seoul Web 3.0 Festival to drive blockchain innovation in the country.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;l&nbsp;Telegram&nbsp;l&nbsp;&nbsp;Twitter&nbsp;l&nbsp;&nbsp;Facebook&nbsp;l&nbsp;&nbsp;LinkedIn&nbsp;l&nbsp;&nbsp;Instagram&nbsp;l&nbsp;&nbsp;YouTube</p>ContactGlobal PR DirectorJeremy Van der HaegenLBankpress@lbank.info"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-21T10:30:53.000Z",
    "title": "Right to Pay With Cash Enshrined in Constitution of Slovakia Amid Digital Euro Fears",
    "url": "https://news.bitcoin.com/right-to-pay-with-cash-enshrined-in-constitution-of-slovakia-amid-digital-euro-fears/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Right to Pay With Cash Enshrined in Constitution of Slovakia Amid Digital Euro Fears\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2252541329.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A member of the eurozone is amending its constitution in order to guarantee citizens the right to cash payments. The move comes amid growing fears that a digital version of the common European currency may eventually become the only means of payment in the eurozone, despite currently being touted as merely an alternative. Lawmakers in [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T10:31:32.000Z",
    "title": "Shiba Inu (SHIB) Frenzy Comes to An End, VC Spectra Takes Over the Market",
    "url": "https://nulltx.com/shiba-inu-shib-frenzy-comes-to-an-end-vc-spectra-takes-over-the-market/",
    "description": "The crypto community’s enthusiasm for meme-coin Shiba Inu (SHIB) continues to weaken as investors lose faith in the token’s future and utility. On the other hand, VC Spectra (SPCT) has begun to rapidly take over the market with its great potential and advanced real-world utility. &#62;&#62;BUY SPECTRA TOKENS NOW&#60;&#60; Dark Days on Shiba Inu’s (SHIB) [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T10:13:54.000Z",
    "title": "Shiba Inu Breaks Through Crucial Resistance Point With 10% Climb",
    "url": "https://www.newsbtc.com/news/shiba-inu-notches-10-climb/",
    "description": "Shiba Inu (SHIB) has recently experienced a significant breakthrough in its price movement. With a 10% rally, SHIB managed to surpass a crucial resistance point that had been hindering its upward momentum. This achievement has sparked excitement among SHIB investors and the wider cryptocurrency community. After a period of consolidation, Shiba Inu broke through the resistance threshold at $0.000007, marking a crucial milestone for the cryptocurrency. This resistance level had been a major barrier for SHIB&#8217;s upward movement in recent weeks. However, with its recent 10% rally, Shiba Inu demonstrated its ability to overcome obstacles and regain bullish momentum. SHIB’s Positive Price Performance Shiba Inu&#8217;s rally can be attributed to its positive price performance over the past 24 hours and the last seven days. According to CoinMarketCap, SHIB&#8217;s price currently stands at $0.00000735. Within the last 24 hours, SHIB witnessed a notable 2.78% increase, contributing to its overall upward trend. Related Reading: PEPE Jumps Nearly 10% In 24 Hours, Sparking Speculation Of A New Rally At the time of writing, SHIB data showed that the coin experienced an impressive climb of 10% in the last week, indicating sustained positive sentiment and growing interest among investors. The chart below shows the meme coin maintaining its foothold in the green zone in the last 24 hours. SHIB price movement in the last 24-hours. Source: CoinMarketCap The breakthrough of the resistance point holds several implications for Shiba Inu investors. Firstly, it instills confidence in the market, suggesting that SHIB has the potential to continue its upward trajectory. Breaking through this resistance level may attract more buyers and investors who were previously hesitant due to the barrier it presented. The rally signifies increased trading activity and liquidity for SHIB. As more investors enter the market, the trading volume for Shiba Inu is likely to surge, leading to improved market depth and reduced volatility. This can be beneficial for both short-term traders looking for price fluctuations and long-term holders seeking stability. SHIB market cap currently at $4.4 billion. Chart: TradingView.com Moreover, the successful breach of the resistance level could be seen as a bullish signal by technical analysts. It may attract attention from traders who utilize technical analysis methods to identify trends and patterns in the market. This increased attention can further contribute to SHIB&#8217;s positive price performance and potentially propel it towards new price highs. Related Reading: ApeCoin Q2 Slump Continues: Is There A Silver Lining Ahead? Meanwhile, Shiba Inu took the No. 1 spot in the wake of its solid price surge based on crypto social and market activity. According to 1-day data on June 18, SHIB&#8217;s social volume jumped to 13,100 and the total number of social engagements reached 193,858,991. Shiba Inu performing strong in the social and market activity department. Source: LunarCrush Looking Ahead As Shiba Inu continues to break through crucial resistance points and demonstrate its ability to rally, the future looks promising for the meme-inspired cryptocurrency.  This achievement has sparked optimism among SHIB investors and the wider cryptocurrency community, attracting more attention to the meme-inspired coin. With sustained positive price performance and increased trading activity, Shiba Inu continues to make its mark in the crypto space, captivating the imagination of investors and enthusiasts alike. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T10:32:18.000Z",
    "title": "Cash Cow Of The Meme Coin Market: Following Shiba Inu, Floki Inu, Caged Beasts Emerges As The Top Meme Coin",
    "url": "https://www.crypto-news-flash.com/cash-cow-of-the-meme-coin-market-following-shiba-inu-floki-inu-caged-beasts-emerges-as-the-top-meme-coin/?utm_source=rss&utm_medium=rss&utm_campaign=cash-cow-of-the-meme-coin-market-following-shiba-inu-floki-inu-caged-beasts-emerges-as-the-top-meme-coin",
    "description": "According to Coinmarketcap.com, the meme coin market is valued at over 14 billion dollars, with top meme coins Dogecoin and Shiba Inu contributing more than 80% of the market value. However, with the introduction of Pepecoin, the meme coin market has experienced revolutionary changes. Even the leading coins like Shiba Inu and Floki Inu are [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T10:28:09.000Z",
    "title": "LBank Joins Forces with Seoul Meta Week 2023 as Co-Creation Partner",
    "url": "https://www.crypto-news-flash.com/lbank-joins-forces-with-seoul-meta-week-2023-as-co-creation-partner/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-joins-forces-with-seoul-meta-week-2023-as-co-creation-partner",
    "description": "Road Island, British Virgin Islands, June 21st, 2023, Chainwire LBank, a leading global crypto exchange, is proud to announce its partnership as a co-creation partner for Seoul Meta Week 2023. The conference will take place from June 26 to 30 at the elegant COEX Auditorium in the heart of Seoul. LBank teams up with industry [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T10:10:51.000Z",
    "title": "Uniswap v4 Unleashes Game-Changing Singleton Design: A Gas-Saving Marvel That Revolutionizes Token Swapping",
    "url": "https://www.crypto-news-flash.com/uniswap-v4-unleashes-game-changing-singleton-design-a-gas-saving-marvel-that-revolutionizes-token-swapping/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-v4-unleashes-game-changing-singleton-design-a-gas-saving-marvel-that-revolutionizes-token-swapping",
    "description": "Uniswap v4 implements the Singleton design pattern, consolidating pools into one contract for significant gas savings and streamlined token transfers. Flash Accounting in v4 enables efficient balance calculations within the same contract, reducing gas costs and eliminating fee tiers, providing flexibility for users to hop between pools and set swap fees. Uniswap v4 Revolutionizes AMM [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T10:10:49.000Z",
    "title": "Bullish Surge: Grayscale Bitcoin Trust (GBTC) Rockets 25% in a Week, Marking the Start of a Majestic Bullrun",
    "url": "https://www.crypto-news-flash.com/bullish-surge-grayscale-bitcoin-trust-gbtc-rockets-25-in-a-week-marking-the-start-of-a-majestic-bullrun/?utm_source=rss&utm_medium=rss&utm_campaign=bullish-surge-grayscale-bitcoin-trust-gbtc-rockets-25-in-a-week-marking-the-start-of-a-majestic-bullrun",
    "description": "Grayscale&#8217;s GBTC stock price rallied 25% ever since BlackRock filed for spot Bitcoin ETF, and the discount on its BTC holdings dropped to 37%. If BlackRock wins the SEC approval it would step up competition in the market putting pressure on Grayscale&#8217;s valuations. Despite the crackdown by the US SEC in recent times, big players [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T10:35:00.000Z",
    "title": "Analyst Dan Gambardello Stands With Coinbase in SEC Battle",
    "url": "https://coinedition.com/analyst-dan-gambardello-stands-with-coinbase-in-sec-battle/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/SEC_vs_Coinbase_Exchange_Seeks_Clarity_Regarding_Crypto_Regulations-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Popular crypto analyst and founder of Crypto Capital Venture, Dan Gambardello lends support to leading cryptocurrency exchange Coinbase amid its legal tussle with the U.S. Securities and Exchange Commission (SEC). Commenting on a tweet by Coinbase CLO Paul Grewal, Gambardello stated: A few days back, Coinbase sought redress via Mandamus Order for the SEC’s evasive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-dan-gambardello-stands-with-coinbase-in-sec-battle/\">Analyst Dan Gambardello Stands With Coinbase in SEC Battle</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T10:15:27.000Z",
    "title": "Polygon Labs Proposes the Upgrade of PoS to zkEVM Validium",
    "url": "https://coinedition.com/polygon-labs-proposes-the-upgrade-of-pos-to-zkevm-validium/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/104.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/104.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/104-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/104-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/104-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/104-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/104-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/104-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/104-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/104-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/104-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/104-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/104-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/104-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/104-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/104-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/104-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Polygon Labs, the creative services and software solutions company, recently proposed the upgrade of Polygon’s Proof-of-Stake (PoS) sidechain to zkEVM Validium, “a first-of-its-kind decentralized L2 secured by zero-knowledge (ZK) proofs.&#8221; As per the proposal published by the platform’s engineering team, the upgrade, if approved, would be executed by the first quarter of 2024, a significant [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/polygon-labs-proposes-the-upgrade-of-pos-to-zkevm-validium/\">Polygon Labs Proposes the Upgrade of PoS to zkEVM Validium</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]