[
  {
    "source": "Cointelegraph",
    "date": "2024-01-24T09:08:27.000Z",
    "title": " MailerLite confirms hack that led to $3.3M crypto-phishing email attacks  ",
    "url": "https://cointelegraph.com/news/mailerlite-confirms-hack-crypto-phishing-email-3-3m-attacks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMWM3ZjVjNjItMWNiMS00MmMwLThiMzktMDVhMmM1NTljZWRiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The email service reveals that hackers gained control of select Web3 email accounts by targeting a customer service employee through a social engineering attack. </p>\n                    <p><p>Email marketing firm MailerLite has confirmed that hackers gained access to accounts of major Web3 companies to carry out phishing email scams that drained an estimated $3.3 million from subscribers.</p><p>Cointelegraph was among a handful of Web3 companies targeted in the attack on <a href=\"https://cointelegraph.com/news/coordinated-crypto-investor-phishing-campaign-email-alert\">Jan 23</a>, with emails sent from the official accounts of WalletConnect, Token Terminal and De.Fi containing malicious links harboring wallet-draining software.</p><p>Hours after the emails had been sent to subscribers, MailerLite released details of how its system had been compromised through a social engineering attack targeting a customer support employee. </p><p><a href=\"https://cointelegraph.com/news/mailerlite-confirms-hack-crypto-phishing-email-3-3m-attacks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-24T08:48:35.000Z",
    "title": " AI advancements could offset self-induced cyberthreat: NCSC report ",
    "url": "https://cointelegraph.com/news/ai-advancements-offset-cyberthreat-ncsc-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjEyMTg3NGUtYTY5Mi00MzNhLWIxMGUtYWMzNzJhNmQ1NDc2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The National Cyber Security Centre report highlights social engineering as a critical area where AI will significantly enhance capabilities, making phishing attacks more convincing and more challenging to spot.</p>\n                    <p><p>Artificial intelligence (AI) is set to significantly increase cyber threats, particularly ransomware attacks, over the next two years, according to a report by the United Kingdom's National Cyber Security Centre (NCSC).</p><p>In its report, NCSC <a href=\"https://www.ncsc.gov.uk/report/impact-of-ai-on-cyber-threat\" target=\"_blank\" rel=\"noopener nofollow\">outlines</a> how AI’s effect on cyber threats can be balanced by leveraging AI to strengthen cybersecurity through detection and improved design. However, it recommended further study to gauge how AI advancements in cybersecurity will mitigate the impact of threats.</p><p>A ransomware attack is a cyberattack in which malicious software is deployed to encrypt a victim’s files or entire system. The attackers then demand a ransom, typically in cryptocurrency, to provide the victim with the decryption key or tools to restore access to their data.</p><p><a href=\"https://cointelegraph.com/news/ai-advancements-offset-cyberthreat-ncsc-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-24T08:43:00.000Z",
    "title": "Surge in Bitcoin whale transactions defies market downturn",
    "url": "https://cryptoslate.com/insights/surge-in-bitcoin-whale-transactions-defies-market-downturn/",
    "description": "<p>Quick Take The digital asset landscape is seeing a noteworthy surge in Bitcoin whale activity, as signaled by CryptoSlate&#8217;s recent data analysis. Amid a 20% pullback from Bitcoin&#8217;s highs, these whales &#8211; entities holding 1k BTC or more &#8211; appear to be capitalizing on the opportunity to accumulate. A marked uptick in activity reveals a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/surge-in-bitcoin-whale-transactions-defies-market-downturn/\">Surge in Bitcoin whale transactions defies market downturn</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-24T08:43:56.000Z",
    "title": "Prominent Crypto Firms Facing Coordinated Phishing Attacks",
    "url": "https://cryptodaily.co.uk/2024/01/prominent-crypto-firms-facing-coordinated-phishing-attacks",
    "description": "A coordinated crypto hack and phishing campaign is targeting investors and flooding their inboxes with fake emails promoting token airdrops."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T08:58:44.000Z",
    "title": "Spot Bitcoin ETFs surpassed Silver in AUM; Chainlink and InQubeta bullish",
    "url": "https://crypto.news/spot-bitcoin-etfs-surpassed-silver-in-aum-chainlink-and-inqubeta-bullish/",
    "description": "Besides Bitcoin, Chainlink (LINK) and InQubeta (QUBE) are increasingly popular. In the ongoing presale, InQubeta has raised over $8.4 million"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T08:58:26.000Z",
    "title": "Canadian court rules 2022 crypto freeze on protesting truckers unconstitutional",
    "url": "https://crypto.news/canadian-court-rules-2022-crypto-freeze-on-protesting-truckers-unconstitutional/",
    "description": "The Federal Court of Canada has ruled that Prime Minister Justin Trudeau&#8217;s use of emergency legislation to suppress the &#8220;freedom convoy&#8221; protests in 2022, was &#8220;unreasonable.&#8221; On Jan. 23, a Canadian federal court ruled that Prime Minister Justin Trudeau&#8217;s decision&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T08:56:50.000Z",
    "title": "Core Scientific returns to Nasdaq following restructuring after 2022 bankruptcy",
    "url": "https://crypto.news/core-scientific-returns-to-nasdaq-following-restructuring-after-2022-bankruptcy/",
    "description": "Texas-based Bitcoin mining company Core Scientific has resumed trading on the Nasdaq today, following the firm&#8217;s restructuring process after declaring bankruptcy in 2022. In a statement issued on Jan. 23, the crypto miner stated that its restructuring plan enabled a&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T08:55:31.000Z",
    "title": "Bitcoin Cash and Cosmos holders closely tracking Kelexo",
    "url": "https://crypto.news/bitcoin-cash-and-cosmos-holders-closely-tracking-kelexo/",
    "description": "Bitcoin Cash and Cosmos holders are closely monitoring Kelexo whose presale is ongoing"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T08:54:55.000Z",
    "title": "HashKey to launch three indexes tracking digital assets",
    "url": "https://crypto.news/hashkey-to-launch-three-indexes-tracking-digital-assets/",
    "description": "Hong Kong digital asset fund manager HashKey Capital and FTSE Russell have unveiled three cryptocurrency indices. According to The Straight Times, the idea behind HashKey Capital and FTSE Russell, a division of the London Stock Exchange (LSEG), is to make&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T09:00:36.000Z",
    "title": "Real Reasons For Bitcoin Price Crash Revealed, Not GBTC: Arthur Hayes",
    "url": "https://www.newsbtc.com/news/bitcoin/real-reasons-bitcoin-price-crash-not-gbtc/",
    "description": "In his latest essay, Arthur Hayes, the founder of BitMEX, articulates a contrarian perspective on the recent downturn in Bitcoin&#8217;s price, refuting the mainstream narrative that attributes the decline to outflows from the Grayscale Bitcoin Trust (GBTC). Instead, Hayes points to macroeconomic maneuvers and monetary policy shifts as the real drivers behind Bitcoin&#8217;s volatility. Monetary Policy And Market Reactions Hayes kickstarts his analysis by shedding light on the US Treasury&#8217;s recent strategic shift in borrowing, a decision announced by Janet Yellen on November 1. This pivot towards Treasury bills (T-bills) has triggered a substantial liquidity injection, compelling money market funds to reallocate their investments from the Fed’s Reverse Repo Program (RRP) to these T-bills, offering higher yields. Hayes articulates the significance of this move, stating, &#8220;Yellen acted by shifting her department’s borrowing to T-bills, thus adding hundreds of billions of dollars&#8217; worth of liquidity so far.&#8221; However, he contrasts this tangible financial maneuver with the Federal Reserve&#8217;s mere rhetoric about future rate cuts and the tapering of quantitative tightening (QT), pointing out that these discussions have not translated into actual monetary stimulus. Related Reading: Bitcoin Price At Risk? Grayscale’s $335M Coinbase Transfer Stirs $30,000 Plunge Potential While the traditional financial markets, particularly the S&#38;P 500 and the Nasdaq 100, responded positively to these developments, Hayes argues that Bitcoin&#8217;s recent price trajectory serves as a more accurate barometer of the underlying economic currents. He remarks, &#8220;The real smoke alarm for the direction of dollar liquidity, Bitcoin, is throwing a cautionary sign.&#8221; He notes the cryptocurrency&#8217;s decline from its peak and correlates it with the fluctuations in the yield of the 2-year US Treasury, suggesting a deeper economic interplay at work. “Coinciding with Bitcoin’s local high, the 2-year US Treasury yield hit a local low of 4.14% in mid-January and is now marching upwards,” Hayes remarked. Dissecting True Reasons Behind The Bitcoin Dip Addressing the narrative surrounding GBTC, Hayes emphatically dismisses the notion that outflows from GBTC are the primary catalyst for Bitcoin&#8217;s price movements. He clarifies, &#8220;The argument for Bitcoin’s recent dump is the outflows from the Grayscale Bitcoin Trust (GBTC). That argument is bogus because when you net the outflows from GBTC against the inflows into the newly listed spot Bitcoin ETFs, the result is, as of January 22nd, a net inflow of $820 million.&#8221; This realization shifts the focus to economic mechanisms at play. The crux of Hayes&#8217;s argument lies in the anticipation surrounding the Bank Term Funding Program (BTFP)&#8216;s expiration and the Federal Reserve&#8217;s hesitancy to adjust interest rates to a range that would alleviate the financial strain on smaller, non-Too-Big-to-Fail (TBTF) banks. Related Reading: Expert Analysis: Six Factors Suggest Bitcoin Price Won’t Drop Below $37,800 Hayes elucidates, &#8220;Until rates are reduced to the aforementioned levels, there is no way these banks can survive without the government support provided via the BTFP.&#8221; He predicts a looming mini-financial crisis in the event of the BTFP&#8217;s cessation, which he believes will compel the Federal Reserve to pivot from rhetoric to tangible action—namely, rate cuts, a tapering of QT, and potentially a resumption of quantitative easing (QE). “I believe Bitcoin will dip before the BTFP renewal decision on March 12th. I didn’t expect it to happen so soon, but I think Bitcoin will find a local bottom between $30,000 and $35,000. As the SPX and NDX dump due to a mini financial crisis in March, Bitcoin will rise as it will front-run the eventual conversion of rate cuts and money printing talk on behalf of the Fed into the action of pressing that Brrrr button,” Hayes writes. Strategic Trading Moves In A Turbulent Market In a revealing glimpse into his tactical trading strategies, Hayes shares his approach to navigating the tumultuous market landscape. He discloses his positions, including the purchase of puts and the strategic adjustment of his BTC holdings. He concludes: A 30% correction from the ETF approval high of $48,000 is $33,600. Therefore, I believe Bitcoin forms support between $30,0000 to $35,000. That is why I purchased 29 March 2024 $35,000 strike puts. [&#8230;] Bitcoin and crypto in general are the last freely traded markets globally. As such, they will anticipate changes in dollar liquidity before the manipulated TradFi fiat stock and bond markets. Bitcoin is telling us to look for Yellen and not Talkin’. At press time, BTC traded at $39,963. Featured image created with DALL·E, chart from TradingView.com"
  }
]