[
  {
    "source": "Cointelegraph",
    "date": "2024-01-18T01:50:30.000Z",
    "title": " SEC struggled to argue Beanie Babies aren’t securities: Crypto lawyers ",
    "url": "https://cointelegraph.com/news/sec-argues-beanie-babies-securities-coinbase-hearing-crypto-lawyers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvY2RmZTUxNDEtYzdiYi00MjE3LWI4MTAtNjE0NzVhNDgzOTA3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto and securities lawyers weighed in on a judge’s remarks after a five-hour court hearing on Coinbase’s motion to dismiss an SEC lawsuit.</p>\n                    <p><p>The United States securities regulator apparently “failed” to effectively argue the difference between Beanie Babies and securities during a recent hearing in New York — one of a few signs that could bode well for Coinbase in its defense, according to lawyers. </p><p>The crypto exchange has been trying to have a <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">lawsuit from the United States Securities and Exchange Commission</a> against it dismissed by a New York court, with <a href=\"https://cointelegraph.com/news/coinbase-hearing-sec-arguments-highlight-court-lawsuit\">oral arguments recently heard</a> over a five-hour hearing on Jan. 17.</p><p>Reflecting on the proceedings in an X (Twitter) post, Hogan &amp; Hogan law firm partner Jeremy Hogan recounted that part of the hearing saw District Judge Katherine Polk Failla remark that the agency’s <a href=\"https://cointelegraph.com/news/what-are-the-howey-test-and-its-implications-for-cryptocurrency\">test to determine securities</a> would lead to a class-action lawsuit against the seller of Beanie Babies.</p><p><a href=\"https://cointelegraph.com/news/sec-argues-beanie-babies-securities-coinbase-hearing-crypto-lawyers\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T02:00:03.000Z",
    "title": "Crypto Exchanges Trading Volume Hit $10.3T in 2023, New Data Shows",
    "url": "https://www.newsbtc.com/all/crypto-exchanges-trading-volume-hit-10-3t-in-2023-new-data-shows/",
    "description": "CoinGecko&#8217;s 2023 Annual Crypto Industry Report has been released. It covers crypto exchanges and their current state, Bitcoin’s +155.2% and Ethereum’s +90.5% growth, analyzing NFT trading volume throughout the year, and more. Related Reading: HODLing Rewards: Average Bitcoin Long-Term Holder Now Carries 55% Profit Among the report’s highlights is the comprehensive review of the crypto trading volume in 2023 through the performance of centralized crypto exchanges (CEX) and decentralized exchanges (DEX). Centralized Crypto Exchanges Dominated Crypto saw a $36.6 trillion trading volume in 2023, with a volume increase of +53.1% from Q3 ($6.7 trillion) to Q4 ($10.3 T). The Q4 increase marked the first quarter-on-quarter (QoQ) growth of 2023 and could be attributed to the &#8220;growing bullish sentiment&#8221; in the crypto market due to the anticipation of spot Bitcoin ETFs’ approval by the SEC. Despite the market&#8217;s challenges, such as the aftermath of FTX’s collapse, the worldwide banking crisis, or Binance’s regulatory difficulties in 2023, the data presented in the report shows an overall market recovery. In December 2023, the trading volume increased sharply to $4.3 trillion, a volume not seen since March 2023. Overall 2023, centralized exchanges dominated the year despite the challenges, especially when compared to decentralized exchanges (DEX). The report details: CEXto DEX spot trading volume ratio hovered around 91.5% in Q4. CEX to DEX derivatives trading volume ratio dropped to 97.3% from 98.5%. CEX to DEX spot ratio stood at 91.4% in 2023. CEX to DEX derivatives ratio was 98.1% in 2023. Binance, Upbit, OKX, Bybit, and Coinbase are among the Top 10 centralized exchanges by trading volume. Binance managed to dominate the list despite dropping to a yearly low market share of 41% in November, following a continued loss throughout 2023. There was a +98.1% increase QoQ, after the top 10 CEXes recorded $2.20 trillion in spot trading volume in 2023 Q4. Previously, the trading volume had failed to reach above $2 trillion for two consecutive quarters. Altogether, the top 10 CEXes recorded $7.2 trillion in spot trading volume in 2023 compared to $9.4 trillion in 2022, representing a -23.4% year-on-year (YoY) decline. Monthly Top Cryptocurrencies Exchanges Trading Volumen, 2023. Source: CoingGecko.com Deep Dive Into The Spot Decentralized Exchanges (DEX) Trading Volume In 2023 The Top 10 DEXes recorded $205.3 billion in spot trading volume in 2023 Q4, indicating a +87.1% Total Trading Volume Increase QoQ. Uniswap, Pancakeswap, Orca, Curve, and THORSwap dominate the DEXes in 2023’s Top 10 spot DEX trading volume. Notably, the report names Orca and THORSwap as the biggest gainers amongst the DEXes in 2023 Q4, with Orca increasing 1,079% ($12.2 billion), while THORSwap saw a surge of 422.4% ($10.1 billion) When breaking down the 2023 spot DEX trading volume breakdown by chain, the report details that Ethereum had $99.3 billion of DEX trading volume in 2023 Q4, displaying an increase of +38.3% from 2023 Q3. However, it ended with a low 41% dominance, dropping below 50% for the first time in 2023 in November and December. Related Reading: QCP Capital Forecasts ETH’s Dominance Over Bitcoin To Persist, Ethereum ETFs In Focus It’s worth noting that Solana was the biggest gainer, with a 985.5% increase in QoQ, while THORChain took second place with a 422.4% trading volume increase in Q4. The data shows that the two chains ranked #3 and #5 in December 2023. Bitcoin is trading at $42,423.7 in the hourly chart. Source: TradingView.com Featured image from Unsplash.com, Chart from TradingView.com"
  }
]