[
  {
    "source": "CoinDesk",
    "date": "2023-11-20T20:45:09.000Z",
    "title": "The PYTH Airdrop is Finally Here. But What is Pyth Network?",
    "url": "https://www.coindesk.com/tech/2023/11/20/the-pyth-airdrop-is-finally-here-but-what-is-pyth-network/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Pyth Network's speed-focused oracle service aims to challenge Chainlink as the go-to data source for blockchain finance."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-20T20:41:05.000Z",
    "title": "Argentina's Next President Says It's OK to Sell Babies—Here's Why Bitcoin Lovers Love Him",
    "url": "https://decrypt.co/206724/argentina-next-president-says-ok-sell-babies-why-bitcoin-lovers-love-him",
    "description": "Bitcoin maximalists and crypto industry leaders are celebrating the rise of Javier Milei, in the hopes the controversial politician will benefit crypto."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T21:00:00.000Z",
    "title": "US regulators continue to discuss crypto: Law Decoded, Nov. 13–20 ",
    "url": "http://cointelegraph.com/news/us-regulators-discuss-crypto-law-decoded-nov-13-20",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ef58ac2e-2109-4f1f-a626-69c776b215e8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elizabeth Warren continues pressing for tighter regulation, and Vivek Ramaswamy promises to defend crypto from the government’s overreach if elected. </p>\n                    <p><p>The United States House Financial Services Subcommittee on Digital Assets, Financial Technology and Inclusion <a href=\"https://cointelegraph.com/news/us-house-financial-services-subcommittee-answers-cryptocurrency-crime\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-house-financial-services-subcommittee-answers-cryptocurrency-crime/amp\">received an education</a> in the uses of blockchain technology in a hearing titled “Crypto Crime in Context: Breaking Down the Illicit Activity in Digital Assets.” The meeting began with a discussion of Hamas’s use of crypto for fundraising. However, the committee’s Chair, Representative French Hill, declared that as “phone and the internet aren’t to be blamed for terror financing,” crypto shouldn’t be either. The <a href=\"https://cointelegraph.com/news/us-fsc-discuss-illicit-activity-crypto-upcoming-hearing\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-fsc-discuss-illicit-activity-crypto-upcoming-hearing/amp\">witnesses, including representatives</a> from Consensys and Chainalysis, spoke about the need for international and public-private collaboration in stopping the misuse of digital assets, the need for well-crafted legislation and the intricacies of blockchain sleuthing.</p><p>At another hearing held by the Senate Special Committee on Aging, U.S. Senator Elizabeth Warren <a href=\"https://cointelegraph.com/news/cybersecurity-expert-senator-warren-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cybersecurity-expert-senator-warren-crypto/amp\">highlighted the dangers of cryptocurrency scams</a>. Steve Weisman, a recognized expert on scams and cybersecurity as described by Warren, confirmed that unlike credit card fraud, which can be swiftly identified, stopped and traced, crypto poses greater challenges with transparency. Weisman expressed support for Warren’s Digital Asset Anti-Money Laundering Act, which seeks to ensure that digital assets are subject to the same Anti-Money Laundering laws as traditional fiat currency.</p><p>Meanwhile, the New York State Department of Financial Services (NYDFS) <a href=\"https://cointelegraph.com/news/nydfs-tightens-crypto-listing-delisting-guidance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nydfs-tightens-crypto-listing-delisting-guidance/amp\">unveiled new restrictions</a> that mandate crypto companies submit their coin listing and delisting policies for NYDFS approval. Company policies will be measured against more stringent risk assessment standards set forth by the NYDFS to protect investors. Technological, operational, cybersecurity, market, liquidity and illicit activity risks of the tokens are among the factors to be considered by the NYDFS. The incoming changes apply to all digital currency business entities licensed under the New York Codes, Rules and Regulation or limited purpose trust companies under the state’s banking law. </p><h3>Vivek Ramaswamy criticizes mixer sanctions in his crypto program</h3><p>Republican United States Presidential candidate Vivek Ramaswamy unveiled a crypto policy framework called “The Three Freedoms of Crypto.” Ramaswamy vows to “direct government prosecutors to prosecute bad actors, not the code they use and not the developers who write that code” if elected president. In an accompanying speech, Ramaswamy specifically targeted sanctions against crypto mixer Tornado Cash, stating: “The case brought against the Tornado Cash folks, for example. […] You can’t go after the developers of code.”</p><p>The presidential candidate also promises to provide regulatory clarity that gives new cryptocurrencies “safe harbor” exemptions from securities laws for a period of time after they are launched and to prevent any federal agency from creating rules that limit the use of self-hosted wallets.</p><p><a href=\"https://cointelegraph.com/news/vivek-ramaswamy-unveils-cryptocurrency-policy-platform-criticizing-mixer-sanctions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/vivek-ramaswamy-unveils-cryptocurrency-policy-platform-criticizing-mixer-sanctions/amp\"><strong>Continue reading</strong></a></p><h3>Australia will impose a capital gains tax on wrapped tokens</h3><p>The Australian Taxation Office (ATO) has issued guidance on capital gains tax (CGT) treatment of <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance</a> and wrapping crypto tokens for individuals, clarifying its intent to continue taxing Australians on capital gains when wrapping and unwrapping tokens. In May 2022, the ATO outlined <a href=\"https://cointelegraph.com/news/crypto-capital-gains-one-of-four-key-areas-for-australian-tax-office\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-capital-gains-one-of-four-key-areas-for-australian-tax-office/amp\">crypto capital gains as one of four key focus</a> areas. Building on the initiative, the Australian tax authority recently clarified a raft of taxable actions in its jurisdiction. The transfer of crypto assets to an address that the sender does not control or that already holds a balance will be regarded as a taxable CGT event, the ATO said in its statement.</p><p><a href=\"https://cointelegraph.com/news/australia-capital-gains-tax-wrapped-cryptocurrency-tokens\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/australia-capital-gains-tax-wrapped-cryptocurrency-tokens/amp\"><strong>Continue reading</strong></a></p><h3>Democratic Party of South Korea obliges its candidates to disclose crypto holdings</h3><p>The Democratic Party of Korea, which holds 167 out of 300 seats in the National Assembly, has made it mandatory for prospective candidates to disclose their digital asset holdings before the 2024 general election. The disclosure will be a part of the party’s effort to show the “high moral standards” of its candidates. In the case of false reports, the party will cancel that person’s candidature. However, there would be no consequences for holding crypto. The information on prospective candidates will be made available to the public on a separate online platform featuring details of their careers, educational background and legislative activity plans.</p><p><a href=\"https://cointelegraph.com/news/democratic-party-south-korea-compel-parliamentary-candidates-disclose-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/democratic-party-south-korea-compel-parliamentary-candidates-disclose-crypto/amp\"><strong>Continue reading</strong></a><strong> </strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-20T21:08:29.000Z",
    "title": "Bullish buys CoinDesk as crypto media shakeups continue",
    "url": "https://cryptoslate.com/bullish-buys-coindesk-as-crypto-media-shakeups-continue/",
    "description": "<p>The sale of cryptocurrency news site CoinDesk to a new owner has concluded, according to an announcement from the purchasing firm on Nov. 20. Bullish, a firm operated by former New York Stock Exchange President Tom Farley, said that it acquired the news site from its previous owner, Digital Currency Group (DCG). CoinDesk will remain [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bullish-buys-coindesk-as-crypto-media-shakeups-continue/\">Bullish buys CoinDesk as crypto media shakeups continue</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-20T21:02:21.000Z",
    "title": "Binance Deal with US DOJ Could Point Crypto Exchange to Compliant Path",
    "url": "https://cryptobriefing.com/us-doj-binance-deal-points-crypto-exchange-compliance/?utm_source=feed&utm_medium=rss",
    "description": "Multi-year DOJ investigation into Binance nears potential settlement regarding allegations of money laundering and sanctions violations."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T20:43:51.000Z",
    "title": "As Whales Make Intriguing Moves, Will Ethereum (ETH) Set New Records This Week?",
    "url": "https://cryptodaily.co.uk/2023/11/as-whales-make-intriguing-moves-will-ethereum-eth-set-new-records-this-week",
    "description": "Explore the latest dynamics in Ethereum (ETH) as it faces a crucial market phase influenced by 'whale' investors. Our analysis sheds light on strategic moves of ETH and the potential impact on its pursuit of new highs. Get expert insights on these critical developments in the crypto landscape, helping you navigate the major altcoin's fluctuating fortunes in this fast-evolving financial arena."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T21:05:41.000Z",
    "title": "U.S. wants Binance to settle for $4b in criminal case",
    "url": "https://www.cryptopolitan.com/us-wants-binance-to-settle-for-4b/",
    "description": "The United States Justice Department is reportedly in advanced stages of negotiations with Binance, the world&#8217;s largest cryptocurrency exchange, over a settlement that could significantly impact the crypto industry. According to sources familiar with the matter, the U.S. authorities are seeking more than $4 billion from Binance as part of a proposed resolution to a ... <a title=\"U.S. wants Binance to settle for $4b in criminal case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-wants-binance-to-settle-for-4b/\" aria-label=\"More on U.S. wants Binance to settle for $4b in criminal case\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T20:42:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T21:00:56.000Z",
    "title": "3 Altcoins Set To Skyrocket In Next Crypto Bull Run, According To Analyst",
    "url": "https://www.newsbtc.com/altcoin/3-altcoins-set-to-skyrocket-in-next-crypto-bull-run-according-to-analyst/",
    "description": "Several altcoins have garnered attention for their potential in the next bull run. Nick, a prominent crypto analyst and host of the Cheeky Crypto YouTube channel, has pinpointed three specific altcoins that he believes are poised for significant growth in the forthcoming market surge. Based on current market trends and developments, Nick&#8217;s analysis highlights these altcoins for their unique features and potential growth trajectories. These predictions offer insights into which could be the next big movers in the crypto world. Related Reading: Crypto Analyst Projects $7 Trillion Market Cap For Altcoins – Here’s When Three Altcoins Poised For Potential Surge Solana (SOL) is one of the three altcoins that caught Nick&#8217;s eye for its chart structures and potential scalability. Regardless of initial hesitations, the analyst acknowledges Solana&#8217;s robust technical setup, which he believes could propel its price to &#8220;phenomenally high numbers&#8221; in the next bull run. Nick predicts Solana could hit a target as high as $7,500, although he also offers a more conservative estimate of $2,000, considering potential future developments that might impact its growth. While Solana currently trades at a price nearing $60, a more practical short-term target, according to Nick, could be $600 to $700. The analyst advised investors to be cautious about the potential market impact when large amounts of SOL become available for sale after a lock-up period and to consider this in their investment strategy. Nick noted: Obviously, there are a lot of [Solana] tokens that are locked up for Solana so we basically start seeing a lot of those tokens being distributed and the lockup periods are expiring in 2025 March so this means we really want to make sure that we are out of our positions before those billionaires have the ability to dump on us. Chainlink (LINK) is also another altcoin found on Nick’s radar. The analyst appreciates Chainlink&#8217;s importance in the blockchain industry and anticipates its increasing exposure and adoption could lead to a substantial capital influx. Nick&#8217;s theoretical projection sees Chainlink reaching up to $2,300, while a more grounded expectation places it between $200 and $400 during the next crypto bull run. Related Reading: Ethereum Breakout: Analyst Explains Why The King Of The Altcoins Is Destined For $10,000 Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-20T21:00:58.000Z",
    "title": "This Catalyst Could Trigger Bitcoin Explosion to a Six-Figure Price at Neck-Breaking Pace, Says Jack Mallers",
    "url": "https://dailyhodl.com/2023/11/20/this-catalyst-could-trigger-bitcoin-explosion-to-a-six-figure-price-at-neck-breaking-pace-says-jack-mallers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Beginning-Stages-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of Lightning Network wallet Strike says one catalyst could trigger a surge for the king crypto that could swiftly see it hit a six-figure price tag. In a new interview with Fox Business, Jack Mallers says that he envisions Bitcoin (BTC) eventually being worth hundreds of thousands of dollars per coin as the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/this-catalyst-could-trigger-bitcoin-explosion-to-a-six-figure-price-at-neck-breaking-pace-says-jack-mallers/\">This Catalyst Could Trigger Bitcoin Explosion to a Six-Figure Price at Neck-Breaking Pace, Says Jack Mallers</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-20T20:55:38.000Z",
    "title": "Venture Capitalist Dan Tapiero Says Rapid Adoption of Crypto Now Underway As Trillions of Dollars Wait on the Sidelines",
    "url": "https://dailyhodl.com/2023/11/20/venture-capitalist-dan-tapiero-says-rapid-adoption-of-crypto-now-underway-as-trillions-of-dollars-wait-on-the-sidelines/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/early-adoption-wells.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Macro investor and fund manager Dan Tapiero says that a massive adoption wave of crypto technology is now underway. In a new interview with former Goldman Sachs executive Raoul Pal, Tapiero says that traditional retailers and finance giants are all moving into the digital asset space as a means to improve their business models. He [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/venture-capitalist-dan-tapiero-says-rapid-adoption-of-crypto-now-underway-as-trillions-of-dollars-wait-on-the-sidelines/\">Venture Capitalist Dan Tapiero Says Rapid Adoption of Crypto Now Underway As Trillions of Dollars Wait on the Sidelines</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]