[
  {
    "source": "CoinDesk",
    "date": "2023-08-29T18:43:35.000Z",
    "title": "The Real Reasons the Grayscale Bitcoin ETF Decision Matters",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/29/the-real-reasons-the-grayscale-bitcoin-etf-decision-matters/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Court of Appeals, in rebuking the securities watchdog, shows that Gary Gensler won’t get the last word on crypto."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-29T18:49:22.000Z",
    "title": "What's a Bitcoin Drivechain and Why Are Devs At Odds Over Its Proposal?",
    "url": "https://decrypt.co/154129/what-is-a-bitcoin-drivechain",
    "description": "A single Bitcoin upgrade could guarantee the network's victory over all other coins, proponents say. Others think it'll introduce shitcoins to the network."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T19:00:00.000Z",
    "title": "\n                        Bitcoin Price Analysis:  Monster Gains Scored – 30 August 2023\n                    ",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-monster-gains-scored-30-august-2023",
    "description": "\n                        <p class=\"MsoNormal\">Bitcoin Price Analysis:&nbsp; Monster Gains Scored &ndash; 30 August 2023</p>\n<p class=\"MsoNormal\">Bitcoin (BTC/USD) sought to add to major gains early in the Asian session as the pair rocketed higher to trade above the 28000 area for the first time in more than ten days, printing around the 28184.89 area. Stops were elected above key technical levels during the huge rally including the 27139, 27466, 27728, and 27766 areas.&nbsp; Related levels that BTC/USD could test in the short-term include the 28316, 28548, 29145, 29330, and 30183 areas.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp;&nbsp; Following the upside run, areas of technical support and potential buying pressure include the 26947, 26620, 26293, and 25828 levels.</p>\n<p class=\"MsoNormal\">Below the market, Stops are cited below the 25706, 25698, 25645, 25493, and 25363 levels, downside price objectives related to selling pressure around the 26818 and 26567 areas.&nbsp; Areas of technical support and potential buying pressure in appreciating ranges from the 15460 and 19568.52 levels include the 23661, 22793, and 21725 levels.&nbsp; The recent fresh multi-month low around the 25234.76 area represented a test of a major downside price objective around the 25128.94 area that is associated with selling pressure that increased around the 31862.21 and 30421.29 levels in July.&nbsp;&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p class=\"MsoNormal\">Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 28218.39 and the&nbsp;50-bar MA&nbsp;(Hourly) at 26131.27.</p>\n<p class=\"MsoNormal\">Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p class=\"MsoNormal\">Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p class=\"MsoNormal\">On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p class=\"MsoNormal\" style=\"tab-stops: right 6.5in;\">On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>\n<p class=\"MsoNormal\" style=\"tab-stops: right 6.5in;\">Sally Ho&rsquo;s Technical AnalysisView Yesterday&rsquo;s Trading Analysis</p>\n<p class=\"MsoNormal\">Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T19:08:26.000Z",
    "title": "Can Decentralized Waste Management Incentivize Recycling and Circular Economies?",
    "url": "https://www.cryptopolitan.com/decentralized-waste-management-incentivize/",
    "description": "In the evolving landscape of waste management, an increasingly prominent paradigm has emerged: Decentralized Waste Management. At its core, this method diverges from conventional, centralized systems, offering alternative solutions to many of the limitations and inefficiencies observed in traditional waste management methods. This guide seeks to illuminate the intricacies of Decentralized Waste Management, from its ... <a title=\"Can Decentralized Waste Management Incentivize Recycling and Circular Economies?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/decentralized-waste-management-incentivize/\" aria-label=\"More on Can Decentralized Waste Management Incentivize Recycling and Circular Economies?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T18:39:37.000Z",
    "title": "Why is Blockchain Integration Into Sovereign Wealth Funds Imperative?",
    "url": "https://www.cryptopolitan.com/blockchain-with-sovereign-wealth-funds/",
    "description": "Sovereign Wealth Funds (SWFs) represent a state-owned investment pool that manages a country&#8217;s reserves. Typically funded by revenues generated from commodities or foreign exchange reserves, these funds invest in a range of assets, such as stocks, bonds, real estate, precious metals, and even infrastructure. The primary goal of SWFs varies, encompassing stabilization of the national ... <a title=\"Why is Blockchain Integration Into Sovereign Wealth Funds Imperative?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-with-sovereign-wealth-funds/\" aria-label=\"More on Why is Blockchain Integration Into Sovereign Wealth Funds Imperative?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T19:00:54.000Z",
    "title": "Bitcoin Bullish Signal: Exchange Netflow Remains Negative",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bullish-signal-exchange-netflow-remains-negative/",
    "description": "On-chain data shows the Bitcoin exchange netflow has remained at negative values recently, which could play in the favor of the asset. Exchanges Have Been Seeing Net Bitcoin Outflows Recently An analyst in a CryptoQuant Quicktake post explained that investors have been withdrawing their coins from exchanges recently. The relevant indicator here is the &#8220;exchange netflow,&#8221; which measures the net amount of Bitcoin currently moving into or out of the wallets of all centralized exchanges. The metric&#8217;s value is calculated as the outflows subtracted from the inflows. When this indicator&#8217;s value is positive, the inflows are more significant than the outflows right now; hence, a net number of coins is moving into these platforms. As one of the main reasons holders may want to deposit their coins to exchanges is for selling-related purposes, such a trend can have bearish consequences for the cryptocurrency. On the other hand, negative values suggest the holders are making net withdrawals currently. This kind of trend, when sustained, may be a sign that accumulation is going on in the market, which can naturally have bullish effects on the price in the long term. Related Reading: CryptoQuant Discusses How Bitcoin Has Changed In Past 1 Year Now, here is a chart that shows the trend in the Bitcoin exchange netflow over the last few months: The value of the metric seems to have been red in recent days &#124; Source: CryptoQaunt As displayed in the above graph, the Bitcoin exchange&#8217;s netflow had been positive during the crash earlier in the month, implying that net deposits had occurred. These inflows would have been from the investors taking part in the selloff and from those panic selling just after the selloff had occurred. This indicator tracks the combined data for both spot and derivative platforms, so a chunk of these inflows is bound to be coming from those looking to speculate on the futures market. Related Reading: Bitcoin Bull Run Incoming? This Metric Could Suggest So It wasn&#8217;t long, however, before the netflow turned negative, and the metric has since maintained in this region. This would suggest that the holders have continuously taken their coins off these central entities during the last few days. As analyst James V. Straten has pointed out on X, many of these outflows have come from the Bybit platform alone. Looks like the metric's value has plunged recently &#124; Source: @jimmyvs24 on X The total balance on the exchange has plunged as a massive $300 million outflow has occurred. These latest withdrawals are the largest the exchange has ever witnessed. Bitcoin Surges After News Of Grayscale&#8217;s Success Grayscale has found success in its lawsuit against the US Securities and Exchange Commission (SEC). The Bitcoin market has quickly reacted, as the cryptocurrency has shot up towards the $27,500 mark. BTC has rocketed up during the past day &#124; Source: BTCUSD on TradingView If the market-wide negative netflows that had been occurring were true because of buying taking place in the market, then this sharp rebound could have holding power, as it would mean that it has built up off a strong accumulation foundation. Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-29T18:45:50.000Z",
    "title": "Sam Bankman-Fried’s Lawyers Ask for Temporary Release Ahead of Trial",
    "url": "https://dailyhodl.com/2023/08/29/sam-bankman-frieds-lawyers-ask-for-temporary-release-ahead-of-trial/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/ask-for-release-ahead.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The lawyers of disgraced former FTX head Sam Bankman-Fried are requesting his temporary release from prison ahead of his federal trial in the US. According to new court documents, Bankman-Fried’s attorneys argue that the former FTX CEO needs to be out of prison in order to properly prepare for his trial in about six weeks. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/29/sam-bankman-frieds-lawyers-ask-for-temporary-release-ahead-of-trial/\">Sam Bankman-Fried’s Lawyers Ask for Temporary Release Ahead of Trial</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-29T18:41:08.000Z",
    "title": "Analytics Firm Identifies Under-the-Radar Metric Hinting of Institutional Accumulation of Bitcoin (BTC)",
    "url": "https://dailyhodl.com/2023/08/29/analytics-firm-identifies-under-the-radar-metric-hinting-of-institutional-accumulation-of-bitcoin-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/two-cohorts-bitcoin-ftx.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top crypto analytics firm has spotted an often overlooked metric hinting that big buyers are accumulating Bitcoin (BTC). In a thread on the social media platform X, on-chain data analytics provider CryptoQuant explores the question of what has changed with BTC over the last year. &#8220;What has changed to Bitcoin in the past 1 year? US-based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/29/analytics-firm-identifies-under-the-radar-metric-hinting-of-institutional-accumulation-of-bitcoin-btc/\">Analytics Firm Identifies Under-the-Radar Metric Hinting of Institutional Accumulation of Bitcoin (BTC)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]