[
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T23:00:53.000Z",
    "title": "Crypto CEO falls victim to latest Twitter hack",
    "url": "https://www.cryptopolitan.com/crypto-ceo-falls-victim-to-twitter-hack/",
    "description": "Arthur Madrid, co-founder and CEO of The Sandbox, a metaverse project, fell victim to a Twitter account hack On May 26. Madrid, in a post made after recovering his account, informed users of The Sandbox about the incident. The hacker had allegedly used the crypto CEO&#8217;s account to promote a fraudulent &#8220;airdrop&#8221; phishing scam. Madrid ... <a title=\"Crypto CEO falls victim to latest Twitter hack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-ceo-falls-victim-to-twitter-hack/\" aria-label=\"More on Crypto CEO falls victim to latest Twitter hack\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T23:00:33.000Z",
    "title": "Bullish Case For Litecoin Grows Stronger As LTC Halving Draws Close",
    "url": "https://www.newsbtc.com/analysis/ltc/bullish-case-for-litecoin-grows-stronger-as-ltc-halving-draws-close/",
    "description": "Litecoin (LTC) is still trending low like the rest of the cryptocurrency market but one thing that separates the altcoin from the others is its obvious bullish case. Unlike the rest of the market, Litecoin looks set for another rally which will likely be propelled forward by the next halving. Litecoin Halving Presents Bullish Scenario Just like Bitcoin, the Litecoin halving happens every four years and cuts block rewards by 50%. The aim of this halving is to reduce the amount of new supply flowing into the market. And as demand rises, there is less supply to meet this demand, thus leading to scarcity and a surge in prices. Related Reading: When Is A Token Coming For Coinbase’s Base L2? Here’s What The Roadmap Says The next Litecoin halving is now around the corner with only about three months left to go. This halving, like the ones before it, carries the same promise of a rally for the digital asset. The last halving in 2019 saw LTC’s price bottom out around $62 and then rally to a local peak of $80 in the same month. LTC halving will happen in August &#124; Source: Nicehash If this year’s halving stays true to this trend, then the digital asset should be seeing some upside in the coming months. This could result in LTC clearing the $100 level once more as investors prep for the next leg-up. A 20% upside is attainable at this point, especially with the halving expected to happen in early August. So more than likely, the buyers will dominate the market for the next two months, leading to rising prices for Litecoin. LTC Outlook For 2023 Presently, the crypto market is seeing muted momentum as investors remain indecisive. For Litecoin, the upcoming halving remains a bullish event but the prospects for the months following the halving event do not look good given historical performances. Previous performance paint bull case for LTC &#124; Source: LTCUSD on TradingView.com After each halving, LTC has seen a reversal in sentiment following the initial surge and the subsequent crashes have been more brutal than the uptrends. For example in 2019, LTC’s price crashed almost 50% in the month of September, one month after the halving was completed. This was because the bull market was yet to begin and the cryptocurrency fell back into lockstep with the rest of the market again. Related Reading: Elon Musk Reveals Reason Behind Dogecoin Investment, But Why Is DOGE Down? Going by this historical performance, it would seem the best time to take profits would be toward the end of August after the asset has rallied around 30%. The window of opportunity closes with the month of September which has historically been a bearish month for cryptocurrencies. At the time of writing, LTC is trading at $87.11, up 3.22% in the last day. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]