[
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T18:45:36.000Z",
    "title": "Crypto market maker Wintermute shifts focus to Asia amid Western regulatory turmoil, plans expansion",
    "url": "https://cryptoslate.com/crypto-market-maker-wintermute-shifts-focus-to-asia-amid-western-regulatory-turmoil-plans-expansion/",
    "description": "<p>Crypto market maker Wintermute is eyeing an expansion into Singapore after co-founder Yoann Turpin revealed that he would be moving to the Asian country alongside some staff members, Bloomberg reported on July 27. Wintermute is much more focused on Asia Turpin explained that the firm was becoming more focused on Asia following the regulatory issues [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-market-maker-wintermute-shifts-focus-to-asia-amid-western-regulatory-turmoil-plans-expansion/\">Crypto market maker Wintermute shifts focus to Asia amid Western regulatory turmoil, plans expansion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T18:58:26.000Z",
    "title": "Binance Withdraws Its German Crypto License Application",
    "url": "https://cryptodaily.co.uk/2023/07/binance-withdraws-its-german-crypto-license-application",
    "description": "<p>Binance officially withdrew its application for a crypto license in Germany after regulators denied the exchange&rsquo;s application in June. </p>\n<p>Crypto exchange Binance confirmed it has &ldquo;proactively withdrawn&rdquo; its application for a crypto license in Germany.</p>\nGerman Regulators Deny Binance&rsquo;s Application\n<p>Reports indicate that Binance officially withdrew its BaFin application. Reuters cites a spokesperson for the exchange who said:</p>\n\n<p>&ldquo;Binance confirms it has proactively withdrawn its BaFin (Germany&rsquo;s financial regulator) application. The situation, both in the global market and regulation, has changed significantly.&rdquo;</p>\n\n<p>Adding,</p>\n\n<p>&ldquo;Binance still intends to apply for appropriate licensing in Germany, but it is essential that our submission accurately reflects these changes.&rdquo;</p>\n\n<p>Crypto news website CoinDesk first reported Binance&rsquo;s application withdrawal.</p>\n<p>German-based Finance Fwd website reported last month that Germany&rsquo;s Federal Financial Supervisory Authority (BaFin) either officially denied Binance crypto custody licence application or verbally informed the exchange of its decision. A spokesperson for the exchange said at the time:</p>\n\n<p>&ldquo;Even if we cannot share details of our discussions with the regulators, we will continue to work to meet Bafin&rsquo;s requirements. It is an ongoing process.&rdquo;</p>\n\n<p>Adding,</p>\n\n<p>&ldquo;We are confident that we have the right team and the appropriate measures to continue our discussions with the regulatory authorities in Germany.&rdquo;</p>\n\nRegulatory Pressure Catches Up\n<p>Binance has been met with regulatory challenges after the US SEC sued the exchange and its CEO, Changpeng &lsquo;CZ&rsquo; Zhao, alleging it violated US securities laws and operated a &ldquo;web of deception.&rdquo; The exchange and its CEO vehemently deny the SEC allegations.</p>\n<p>The exchange is facing further difficulties as it exits the Netherlands after failing to meet the requirements to obtain a virtual asset service provider (VASP) license.</p>\n<p>Binance is also under investigation by French financial regulators and has been since 2022. The investigation reported centres around &ldquo;acts of illegal exercise of the function of service provider on digital assets (PSAN), and acts of aggravated money laundering.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T19:06:57.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T18:50:03.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T18:47:07.000Z",
    "title": "Kyrgyzstan embraces crypto mining amidst energy challenges",
    "url": "https://www.cryptopolitan.com/kyrgyzstan-embraces-crypto-mining-amidst-energy-challenges/",
    "description": "In a recent move towards energy and economic optimization, Kyrgyzstan&#8217;s President Sadyr Japarov has greenlit the establishment of a cryptocurrency mining farm in the Central Asian nation. Japarov addressed claims from RFE/RL media in a candid interview with the &#8220;Kabar&#8221; agency, debunking assertions regarding the controversial prioritization of power to private mining companies over Kyrgyz ... <a title=\"Kyrgyzstan embraces crypto mining amidst energy challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kyrgyzstan-embraces-crypto-mining-amidst-energy-challenges/\" aria-label=\"More on Kyrgyzstan embraces crypto mining amidst energy challenges\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T19:00:56.000Z",
    "title": "Stanford MBA Explains Why Next Bitcoin Cycle Could Be “Bigger”",
    "url": "https://www.newsbtc.com/bitcoin-news/stanford-mba-explains-why-next-bitcoin-cycle-could-be-bigger/",
    "description": "A Stanford MBA has explained why the current Bitcoin cycle was different from the others, and why the next one could end up being bigger. This Bitcoin Cycle Faced Obstacles That May Not Be There Next Time A &#8220;cycle&#8221; for Bitcoin refers to the period between two consecutive halvings. The halvings, events where the rewards miners receive for solving blocks on the network are permanently slashed in half, are chosen as the start and end points for the cycles due to the immense significance they hold for the cryptocurrency. The rewards miners earn are essentially the only way new supply can be introduced into circulation, so since halvings cut these in half, the production rate of the asset itself gets tightened. Because of basic supply-demand dynamics, Bitcoin&#8217;s post-halving scarcity increases the asset&#8217;s valuation. It&#8217;s not a coincidence that the bull markets have always followed these special events. The halvings occur roughly every four years, with the next one being scheduled for next year. As BTC transitions towards a new cycle, Jesse Myers, a Stanford MBA, has released a new post that looks back at this cycle so far and compares it with the previous cycles. At first sight, one difference becomes immediately clear: the structure of the top during this past bull market wasn&#8217;t anything like what the previous cycles displayed. How the previous halving cycles looked like at the current stage &#124; Source: Once-In-A-Species &#8220;Instead of a parabolic advance culminating in a blow-off top, we got a bi-modal rounded top spread out over six months,&#8221; notes Myers. So, why did the BTC price behave differently during this bull market? Well, there are mainly four factors at play here. The first and undoubtedly the biggest one would be COVID-19 and the US government&#8217;s response to it. The onset of the virus and the black swan crash that came with it just preceded the cycle, meaning that the cycle kicked off in anomalous conditions. During the cycle itself, the Fed was giving out stimulus checks as a way to mitigate the economic impacts of COVID. &#8220;That Quantitative Easing (QE) undoubtedly helped fuel the 2021 Bitcoin bull market,&#8221; explains the Stanford MBA. The problem came, however, when the Fed changed its policy and switched to Quantitative Tightening (QT). Interestingly, this switch appears to be what marked the Bitcoin top in November 2021. In the middle of all this, another factor was also at play: the May 2021 China ban on Bitcoin mining. Back then, China was the biggest hub of cryptocurrency mining, so the ban naturally delivered a significant shock to the sector. The resulting selling pressure crashed the market, leading to the bull rally prematurely halting. It wasn&#8217;t until three months later that bullish winds once again returned for the asset. While these factors have been quite influential for BTC, it&#8217;s apparent that they are unlikely to repeat, meaning they shouldn&#8217;t have any presence in the next cycle. On the contrary, the other two factors that made this cycle different are likely to appear in the next cycle as well. This previous bull market was the first one where investors widely used leveraged futures trading. Probably, leverage would again come into play in the next bull market. Related Reading: PEPE Whales Load Up Their Bags As Memecoin Jumps 13% Lastly, there is the fact that platforms like FTX issue a lot of &#8220;paper Bitcoin.&#8221; Supply equivalent to 25% of the mined BTC that year was owned by FTX&#8217;s customers, but this BTC didn&#8217;t exist; it was only there on &#8220;paper.&#8221; The analyst believes that such fudging will likely be present during the upcoming cycle. While there had been some developments in this cycle that ultimately shortened the bull market, some changes can be favorable for the next cycle. The Bitcoin supply is quickly moving off exchanges, and the HODLers getting hold of the majority of the supply has often been making the news recently. Still, there is another super exciting factor. Accumulation from the small investors &#124; Source: Once-In-A-Species According to this chart from Glassnode, the relatively small entities on the network (holding less than 100 BTC) have been accumulating 275% of all Bitcoin being mined. The fact that this rate is more than 100% suggests that the smaller investors are taking coins off the likes of whales. &#8220;This has never happened before. We have reached some kind of inflection point,&#8221; says Mjers. Soon the halving will occur, and this supply shock brewing in the market will only get tighter. Perhaps the smaller investors are looking to get in before this happens. Related Reading: Bitcoin Rally May Not Resume Until This Happens Mjers mentions, however, that these individuals aren&#8217;t the only ones catching on; asset managers like Blackrock are also coming around and pushing to get themselves into the industry. As mentioned before, the QT policy proved disastrous for BTC in this cycle, but a shift back towards QE may be imminent, which would naturally boost the market instead. The analyst thinks this event might coincide with the upcoming halving of the cryptocurrency. Now, based on all these factors, these are probabilities that Mjers has assigned to the different price range predictions for the next cycle: The likeliness of each price range &#124; Source: Once-In-A-Species The Stanford MBA believes that a growth of more than 8x, a multiplier higher than what the current cycle saw, is the second most probable scenario, given all the potentially positive developments. A cycle outperforming the previous has never happened in the cryptocurrency&#8217;s history, so if this scenario happens, it would be a first. BTC Price At the time of writing, Bitcoin is trading around $29,300, down 2% in the last week. BTC continues to move sideways &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com, onceinaspecies.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T18:56:45.000Z",
    "title": "Expert Forecasts 400% Price Surge for Terra Classic (LUNC) Ahead of Anticipated Community-Owned Wallet Launch",
    "url": "https://www.crypto-news-flash.com/expert-forecasts-400-price-surge-for-terra-classic-lunc-ahead-of-anticipated-community-owned-wallet-launch/?utm_source=rss&utm_medium=rss&utm_campaign=expert-forecasts-400-price-surge-for-terra-classic-lunc-ahead-of-anticipated-community-owned-wallet-launch",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The long-awaited LUNC/USTC swaps may soon be available on TerraSwap, which would be great for the Terra Classic (LUNC) community.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />LUNC is on the verge of a breakout with positive ecosystem innovations around. The protocol has seen commitment from its developers and community, lending credence to its purported growth momentum. Terra Luna Classic (LUNC) is likely eyeing a bullish breakout looking at the price trend in the past couple of weeks. Following the news of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T18:49:56.000Z",
    "title": "Ethereum Price Prediction 2023, 2025 and 2030: ETH Poised to Reach $16,400 Driven by an Ethereum ETF Launch – Report",
    "url": "https://www.crypto-news-flash.com/ethereum-price-prediction-2023-2025-and-2030-eth-poised-to-reach-16400-driven-by-an-ethereum-etf-launch-report/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-price-prediction-2023-2025-and-2030-eth-poised-to-reach-16400-driven-by-an-ethereum-etf-launch-report",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"the quantity of Ethereum that has been staked has reached a new milestone, surpassing an all-time high (ATH) of 25.8 million ETH.\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Many experts have laid out their year-end Ether price predictions, most of which see Ether surging past $2,000 before the close of the year.  In the long term, other market players expect Ether bulls to push prices up to as high as $16,000 and $30,000. The year 2024 is only 5-months away, and price predictions [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T18:45:54.000Z",
    "title": "Tech Stock Price Jumps Boost Ethereum (ETH) More Than Bitcoin (BTC), According to New CME Group Report",
    "url": "https://dailyhodl.com/2023/07/28/tech-stock-price-jumps-boost-ethereum-eth-more-than-bitcoin-btc-according-to-new-cme-group-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/tech-stock-jumos-boost.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new report from CME Group says that tech stocks, the US dollar and Bitcoin (BTC) supply are key drivers that influence the movement of Ethereum (ETH). According to the derivatives giant, Ethereum gains more than Bitcoin when the prices of technology stocks increase. The report says that the ETH/BTC exchange rate tends to rise [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/tech-stock-price-jumps-boost-ethereum-eth-more-than-bitcoin-btc-according-to-new-cme-group-report/\">Tech Stock Price Jumps Boost Ethereum (ETH) More Than Bitcoin (BTC), According to New CME Group Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T18:41:37.000Z",
    "title": "Worldcoin (WLD) Under Investigation in France Days After Launching and Signing Up Over Two Million: Report",
    "url": "https://dailyhodl.com/2023/07/28/worldcoin-wld-under-investigation-in-france-days-after-launching-and-signing-up-over-two-million-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Investigation-Into-Bored-Ape-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto project using eye-scanning technology is reportedly under investigation in France just days after launching and signing up over two million users. According to a new report, Worldcoin (WLD) will be investigated by France’s privacy watchdog, the CNIL, over the legality of its biometric data collection, which involves iris-scanning orbs. Worldcoin was co-founded by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/worldcoin-wld-under-investigation-in-france-days-after-launching-and-signing-up-over-two-million-report/\">Worldcoin (WLD) Under Investigation in France Days After Launching and Signing Up Over Two Million: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]