[
  {
    "source": "CoinDesk",
    "date": "2023-10-18T18:01:36.000Z",
    "title": "Top U.S. Bank Regulator Faulted for Lack of Crypto Guidance to Banks",
    "url": "https://www.coindesk.com/policy/2023/10/18/top-us-bank-regulator-faulted-for-lack-of-crypto-guidance-to-banks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Federal Deposit Insurance Corp. (FDIC) has left the banks it oversees unequipped to navigate the regulator's crypto expectations, according to the agency's inspector general, so the FDIC agreed to field a new strategy by January."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T17:45:26.000Z",
    "title": "Elon Musk trials $1 subscription signup fee for new X users in New Zealand, Philippines",
    "url": "https://cointelegraph.com/news/elon-musk-trials-1-subscription-signup-fee-new-x-users-new-zealand-philippines",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/02c74f82-1ea8-4ab9-a95e-220dbe9bde67.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Mercurial CEO is on the cusp of turning X into a fully subscription-based app.</p>\n                    <p><p>X, formerly known as Twitter, is testing a signup model wherein new users will have to either pay to become a verified enterprise account, opt into an X premium subscription, or pay a $1 annual fee to prove they’re not a bot. The trial, which began on Oct. 17, is currently only applicable to new users in New Zealand and the Philippines. </p><p>The experiment, according to a post on X’s Help Center, is <a href=\"https://help.twitter.com/en/using-x/not-a-bot\" target=\"_blank\" rel=\"noopener nofollow\">called</a> “Not A Bot.” As its name implies, its purpose is reportedly to deter bot activity on the app by requiring all users (that are included in the test) to verify their phone number and payment method. </p><p>Per the Help Center post:</p><blockquote>“As of October 17th, 2023 we’ve started testing “Not A Bot”, a new subscription method for new users in two countries. This new test was developed to bolster our already significant efforts to reduce spam, manipulation of our platform and bot activity.”</blockquote><p>The post goes on to state that “new users,” who pay the $1 subscription fee, “will be able to perform certain actions on the web version of the platform: post content, Like posts, Reply, Repost and Quote other accounts’ posts, Bookmark posts.”</p><p>Those who don’t pay the fee and opt out of subscribing, “will only be able to take “read only” actions, such as: Read posts, Watch videos, and Follow accounts.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Correct, read for free, but $1/year to write. It’s the only way to fight bots without blocking real users.<br><br>This won’t stop bots completely, but it will be 1000X harder to manipulate the platform.</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1714437136575807979?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It’s unclear at this time exactly how X intends to determine the effectiveness of the “Not A Bot” trial. Our request for commentary to the company solicited an immediate response of “busy now, please check back later.”</p><p>Previous research on the nature of social media “bots” has revealed the term to be nebulous. According to one study (Gorwa, et. al., 2018), it isn’t always <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/poi3.184\" target=\"_blank\" rel=\"noopener nofollow\">obvious</a> whether accounts generating bot-like behavior are in fact bots. </p><p>There’s also the consideration that bots, and their behavior, are likely to become far more sophisticated in light of the ongoing large language model-driven revolution in consumer-facing artificial intelligence chatbot technology. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/antropic-democratic-ai-chatbot-by-letting-users-vote-for-its-values\">Anthropic built a democratic AI chatbot by letting users vote for its values</a></em></strong></p><p>According to X, the subscription is meant to chop the bots off at the knees by making it not only difficult to automate the signup process but, per the language used by X, also supposedly financially deterring the organizations and individuals responsible from deploying them.</p><p>Reaction in the crypto and finance communities — where spam bots remain an ongoing problem — has ranged from outright acceptance of the pay-to-interact model to a rejection of the premise. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">$0.08 per month is pretty affordable for no bot manipulation.<br><br>Anyone who complains about this simply wants the bot manipulation to run rampant.</p>&mdash; Colin Talks Crypto (@ColinTCrypto) <a href=\"https://twitter.com/ColinTCrypto/status/1714461235503051121?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>One user replying to a post from a popular account sharing the news called the move a value prospect at less than 10 cents U.S. per month, stating “anyone who complains about this simply wants the bot manipulation to run rampant.” Another simply <a href=\"https://twitter.com/DerektheCleric/status/1714435097011565020\" target=\"_blank\" rel=\"noopener nofollow\">opined</a> that it represented “the end of X. It had a short run.”</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T17:45:21.000Z",
    "title": "Amazon Introduces Sequoia Robotics System to Enhance Warehouse Efficiency and Safety",
    "url": "https://www.cryptopolitan.com/amazon-introduces-sequoia-robotics-system/",
    "description": "Amazon, the global e-commerce giant, is taking another leap in automation and robotics with the introduction of its latest technology, Sequoia, designed to revolutionize its warehouse operations. The implementation of this AI-powered system has the potential to significantly improve delivery times, enhance safety measures, and streamline overall operations. According to a report by the Wall ... <a title=\"Amazon Introduces Sequoia Robotics System to Enhance Warehouse Efficiency and Safety\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazon-introduces-sequoia-robotics-system/\" aria-label=\"More on Amazon Introduces Sequoia Robotics System to Enhance Warehouse Efficiency and Safety\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T17:40:15.000Z",
    "title": "Your Voice Could Reveal Diabetes Risk- Here is how",
    "url": "https://www.cryptopolitan.com/your-voice-could-reveal-diabetes-risk/",
    "description": "In a groundbreaking study, artificial intelligence (AI) has exhibited the potential to screen for Type 2 diabetes through voice analysis, offering a cost-effective and accessible preliminary screening method. Researchers at Klick Labs developed a cutting-edge AI model that achieved an 89% accuracy rate for women and an 86% accuracy rate for men in detecting the ... <a title=\"Your Voice Could Reveal Diabetes Risk- Here is how\" class=\"read-more\" href=\"https://www.cryptopolitan.com/your-voice-could-reveal-diabetes-risk/\" aria-label=\"More on Your Voice Could Reveal Diabetes Risk- Here is how\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-18T18:05:17.000Z",
    "title": "Billionaire Mike Novogratz Predicts Bitcoin (BTC) ETF Before 2024, Says Gary Gensler Feeling the Pressure",
    "url": "https://dailyhodl.com/2023/10/18/billionaire-mike-novogratz-predicts-bitcoin-btc-etf-before-2024-says-gary-gensler-feeling-the-pressure/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/One-Unfolding-Catalyst-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire Mike Novogratz is predicting that a Bitcoin (BTC) exchange-traded fund (ETF) will hit the market before 2024 as pressure mounts on Gary Gensler, the Chair of the U.S. Securities and Exchange Commission (SEC). In a new interview with CNBC, the Galaxy Digital CEO says that all signs point toward a spot market BTC ETF [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/18/billionaire-mike-novogratz-predicts-bitcoin-btc-etf-before-2024-says-gary-gensler-feeling-the-pressure/\">Billionaire Mike Novogratz Predicts Bitcoin (BTC) ETF Before 2024, Says Gary Gensler Feeling the Pressure</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]