[
  {
    "source": "NewsBTC",
    "date": "2024-01-14T08:14:07.000Z",
    "title": "ETF Frenzy: Bitcoin Takes A Dip, Ethereum Goes Hot And The Next Crypto Chapter",
    "url": "https://www.newsbtc.com/news/etf-frenzy-bitcoin-takes-a-dip-ethereum-goes-hot-and-the-next-crypto-chapter/",
    "description": "In a week etched in crypto history, the long-awaited arrival of Bitcoin ETFs in the US sent shockwaves through the market. Yet, despite the monumental achievement, the king of crypto, Bitcoin, took a step back on Saturday, dipping 6% to end the week barely above $43,000. Many analysts predicted a &#8220;sell-the-news&#8221; scenario, where investors cashed in on profits built upon anticipation of the ETF approval. Others suggest a rotation into Ethereum, which surged 15% on the week and touched highs not seen since May 2022. Related Reading: Ethereum Eclipses Bitcoin In A Crypto Coup: Has The King Been Dethroned? Ethereum ETF Speculation: Shaping Crypto Narratives This speculation is fueled by expectations of imminent Ethereum ETF decisions from the SEC, potentially mirroring the winds that propelled Bitcoin towards a 60% rally in recent months. According to Alex Saunders, a Citi analyst, the cryptocurrency market has transitioned to a new narrative, as Ethereum has outperformed Bitcoin. This surge is believed to be driven by anticipation that the second-largest cryptocurrency could receive approval for an ETF. &#8220;In our view, the crypto market has already moved to the next narrative, with ETH rallying more than bitcoin, likely on the expectation that crypto&#8217;s second largest token could also see an ETF approval,&#8221; Saunders said. While the immediate price action might paint a contrasting picture, the significance of the ETF launch for Bitcoin&#8217;s long-term trajectory remains undeniable. Market participants across the board agree that ETFs will pave the way for increased institutional adoption, a crucial step towards legitimizing Bitcoin as a serious asset class. Bitcoin slightly below the $43K level today. Chart: TradingView.com Analysts at Citi anticipate &#8220;extra prominence&#8221; for Bitcoin in diversified portfolios, although widespread inclusion is still some distance away. The road to crypto acceptance, however, isn&#8217;t paved solely with Bitcoin. Litecoin, often dubbed &#8220;silver to Bitcoin&#8217;s gold,&#8221; emerged as another bright spot this week, on track for an impressive 11% gain. This signifies diversification within the crypto landscape, a trend likely to continue with the potential influx of other crypto ETFs. BTC 24-hour price action. Source: Coingecko Crypto Equities Shake Amidst Bitcoin&#8217;s Slide Beyond the digital coins themselves, the news wasn&#8217;t as rosy for crypto-related equities and miners. Coinbase and MicroStrategy, heavily invested in Bitcoin, took tumbles of 6% and 8%, respectively. Miners, already on the back foot after suffering substantial losses on Thursday, extended their descent, with CleanSpark and Iris Energy experiencing double-digit drops. Related Reading: Bitcoin Retreats: ETF Dream Fades, Price Tumbles Under $42,000 This market snapshot illustrates the dynamic nature of the crypto ecosystem. While Bitcoin might have taken a breather after its historic week, the overall sentiment remains positive. Ethereum&#8217;s ascent and the anticipation of broader ETF access signal a shift in investor focus, suggesting a future where the crypto playing field isn&#8217;t solely Bitcoin&#8217;s domain. The dust settles on Bitcoin&#8217;s ETF debut, leaving a wobbly king and a market yearning for the next narrative. Ethereum, bathed in its own ETF hopes, gleams like a challenger. In this dance of highs and lows, understanding the evolving stories matters more than chasing fleeting profits. Bitcoin&#8217;s wobble may yet be a prelude to a high-flying future. The crypto saga, after all, has only just begun. Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-14T08:18:00.000Z",
    "title": "BlackRock Drains 13 Days’ BTC Worth, Triggering Supply Crunch Worries",
    "url": "https://coinedition.com/blackrock-drains-13-days-btc-worth-triggering-supply-crunch-worries/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock Drains 13 Days’ BTC Worth, Triggering Supply Crunch Worries\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent post on X, pro-Bitcoin advocate “InvestAnswers” unveiled a startling revelation about BlackRock&#8217;s substantial Bitcoin acquisitions, sparking concerns of a looming supply crunch. According to the post, BlackRock, one of the world&#8217;s largest asset management firms, absorbed a staggering 11,500 BTC from the market in just two days. Given that approximately 900 BTCs [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/blackrock-drains-13-days-btc-worth-triggering-supply-crunch-worries/\">BlackRock Drains 13 Days’ BTC Worth, Triggering Supply Crunch Worries</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]