[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-13T15:30:09.000Z",
    "title": "Idle No More: $11.4 Million in ‘Sleeping Bitcoins’ Wake up After Years of Dormancy",
    "url": "https://news.bitcoin.com/idle-no-more-11-4-million-in-sleeping-bitcoins-wake-up-after-years-of-dormancy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Idle No More: $11.4 Million in &#039;Sleeping Bitcoins&#039; Wake up After Years of Dormancy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sleepingcoins.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Hovering just above the $29,000 mark, bitcoin&#x2019;s value remained relatively stable while an interesting event occurred on Saturday afternoon: a dormant cache of 195.79 bitcoins, untouched for over seven years, was transferred for the first time since 2016. This action was followed by another sequence of events; when a batch of slumbering bitcoins from 2014 [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-13T15:16:13.000Z",
    "title": "SEC to appeal Ripple’s victory, Binance aims for growth, PayPal launches stablecoin | Weekly Recap",
    "url": "https://crypto.news/sec-to-appeal-ripples-victory-binance-aims-for-growth-paypal-launches-stablecoin-weekly-recap/",
    "description": "Amid ongoing regulatory efforts, the U.S. Securities and Exchange Commission (SEC) is poised to contest Ripple&#8217;s recent victory. Binance captures attention with ambitious growth moves, while PayPal introduces its very own stablecoin.&#160; Greater scrutiny in the U.S. This week, government&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-13T15:20:17.000Z",
    "title": "Toncoin (TON) Throws Weight Around To Lead Weekend Top 20 With 22% Rally",
    "url": "https://www.newsbtc.com/all/toncoin-explodes-with-15-rally/",
    "description": "The dynamic and ever-evolving blockchain community has shown a great deal of interest in and enthusiasm for Toncoin (TON). Due to its technological underpinnings and innovative answers to the long-standing problems that have plagued the field of decentralized finance, this digital money has risen to popularity very quickly. At the time of writing, TON was trading at $1.46, registering an impressive 10.4% increase in the last 24 hours. Equally impressive is the crypto&#8217;s price rally in the last week, when it registered a 22% climb, data from crypto market tracker Coingecko shows. TON price action today. Source: Coingecko Just lately, the price of Toncoin broke out in a big way, separating itself from a 30-day consolidation. During this period of consolidation, prices moved inexactly between $1.31 and $1.49, showing a restricted and steady trading range. Toncoin Shows Signs Of Resilience Several times throughout this period of consolidation, the cryptocurrency showed signs of trying to rise beyond the $1.50 barrier, which may have suggested a possible upward trend. However, bullish market forces were unable to push the price over the $1.50 level, and the price ultimately closed below that level. The continuation of these adverse influences indicates that traders and investors are currently exercising caution. The bears&#8217; stubbornness implies there&#8217;s a widespread view that the market can&#8217;t handle a prolonged rise above $1.50 just yet. As of today, cryptocurrencies reached a market cap of $1.13 trillion. Chart: TradingView.com Toncoin At A Glance The Open Network, or TON for short, is a layer-1 blockchain that is both decentralized and fast. Established in 2018, it is a proof-of-stake (PoS) network that has gained massive adoption among crypto users for its lightning-fast transactions. TON set out to do some very big things, like simplifying transactions inside of Telegram. However, it encountered difficulty at every turn of its path. Despite the project&#8217;s initial focus on Gram, its native digital currency, it ran into trouble when the US Securities and Exchange Commission pointed out Telegram&#8217;s failure to register a substantial preliminary $1.7 billion Gram token sale. Source: Currency.com Possible Revisit Of Resistance Level This regulatory worry caused a brief halt in Gram sales, and the unrevealed offering ultimately led to a legal setback. Simultaneously, a slew of cyberattacks cast a pall over the TON&#8217;s appeal. Meanwhile, the present market structure indicates that the Toncoin price may revisit the resistance level of $1.49 if bulls can push prices above the support turned resistance of $1.31. For this to be even remotely credible, a candle closure over $1.31 would be required. If the TON price, however, rejects $1.31, it may return to the current support level of $1.17. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Hello Subscription"
  }
]