[
  {
    "source": "Decrypt",
    "date": "2023-11-27T23:58:30.000Z",
    "title": "Gaming Tokens Keep Rising as Axie Infinity, Ronin, and Illuvium Pump",
    "url": "https://decrypt.co/207660/gaming-tokens-keep-rising-axie-infinity-ronin-illuvium-pump",
    "description": "Video game tokens including AXS, RON, and ILV had a strong week, plus ApeCoin hit a three-month high over the weekend."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T23:53:32.000Z",
    "title": "Coinbase shares hit 18-month high after Binance charges",
    "url": "http://cointelegraph.com/news/coinbase-stock-share-price-high-binance-plead-guilty-charges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b772c8e0-e34b-43f5-8c8f-8882e163df43.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The price high comes after rival exchange Binance pleaded guilty and traders seemingly priced in Coinbase’s custodian agreements for a slate of spot crypto ETFs.</p>\n                    <p><p>Crypto exchange Coinbase (COIN) shares have hit an 18-month high after rival exchange Binance and its former CEO Changpeng Zhao pleaded guilty to money laundering and sanctions violations in the United States.</p><p>On Nov. 27, Coinbase closed at $119.77, its highest since May 5, 2022, when it closed at $114.25, according to TradingView <a href=\"https://www.tradingview.com/chart/?symbol=NASDAQ%3ACOIN\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. It has seen little movement in after-hours trading.</p><p>The number puts Coinbase shares up around 256.5% year-to-date, although is still down 65% from its Nov. 12, 2021, all-time high of nearly $343.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/19301b28-f0f7-4acd-b83c-e14e7f6d2b72.png\"  /><figcaption style=\"text-align: center;\"><em>Coinbase share price since May 2022. Source: TradingView</em></figcaption></figure><p>Coinbase’s share surge comes just shy of a week since Binance and founder Changpeng “CZ” Zhao <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">pleaded guilty</a> to money laundering, violating U.S. sanctions and running an unlicensed money-transmitting business.</p><p>Zhao and Binance settled with the U.S. for $4.3 billion, which included Zhao stepping down as CEO and Binance agreeing to DOJ and Treasury compliance monitors for up to five years.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-charges-prove-following-rules-right-decision-coinbase-ceo\"><strong><em>Binance charges prove ‘following the rules’ was the right decision — Coinbase CEO</em></strong></a></p><p>Over the past year Coinbase has also secured a significant windfall with to-be-approved U.S. spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded funds (ETFs).</p><p>Analysis from Bloomberg ETF analyst James Seyffart <a href=\"https://twitter.com/JSeyff/status/1729255493045309566\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> Coinbase is custodian to 13 of the 19 spot crypto ETFs currently pending with the Securities and Exchange Commission.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d0af4ba0-c01d-4694-9706-4c17b20e461d.png\"  /><figcaption style=\"text-align: center;\"><em>Coinbase is the custodian of 70% of the 19 spot crypto funds. Source: James Seyffart/X</em></figcaption></figure><p>Coinbase, however, faces a <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">lawsuit from the SEC</a> which claims the exchange didn’t register with the regulator and listed several tokens that violated U.S. securities laws.</p><p>Coinbase had <a href=\"https://cointelegraph.com/news/coinbase-disputes-sec-authority-last-suit-dismissal-bid\">attempted to dismiss</a> the suit and called into question the SEC’s authority to police crypto.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/plunge-web3-games-2023-real-hits-shrapnel-26m-nfl-rivals-nft-web3-gamer/\"><strong><em>Web3 Gamer: 65% plunge in Web3 Games in ’23 but ‘real hits’ coming, $26M NFL Rivals NFT</em></strong></a><strong><em>|</em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T00:00:51.000Z",
    "title": "Santiment Reveals Trigger Behind Bitcoin Rally: Will This Signal Reignite?",
    "url": "https://www.newsbtc.com/bitcoin-news/santiment-trigger-bitcoin-rally-signal-reignite/",
    "description": "The on-chain analytics firm Santiment has explained how Tether (USD) and USD Coin (USDC) exchange inflows preceded the recent Bitcoin rally. Bitcoin Rally May Restart If Stablecoins See Further Exchange Deposits In a new post on X, Santiment discussed the trend in the supply of exchanges of various assets in the cryptocurrency sector. The &#8220;supply on exchanges&#8221; is an indicator that keeps track of the percentage of the total circulating supply of the given coin currently sitting in the wallets of all centralized exchanges. Related Reading: Analyst Sets $47,000 Target For Bitcoin If This Happens The below chart shows the trend in this indicator for Bitcoin (BTC), Ethereum (ETH), Chainlink (LINK), Polygon (MATIC), Tether (USDT), and USD Coin (USDC) over the past few months. The data for the exchange supply of the different coins &#124; Source: Santiment on X Depending on what type of asset it is, the significance of the supply on exchanges can differ. In the case of volatile assets like Bitcoin, the supply being stored on these platforms may be considered the available selling supply of the asset, as one of the main reasons investors may deposit their coins to the exchanges is for selling. Thus, when this indicator trends up for these cryptocurrencies, it&#8217;s a potential sign that selling pressure in the sector is going up. The graph shows that Polygon has seen 0.7% of its supply move to exchanges in the past month, which could be a bearish sign for its price. On the other hand, Bitcoin has observed withdrawals equivalent to 0.33% of its supply during the same period. Such a decline in the indicator can suggest that investors may participate in accumulation, as they are taking their coins off towards self-custodial wallets. As for the stablecoins, an increase in the supply on exchanges also suggests that investors wish to swap these tokens. This selling of stables, though, actually provides a buying boost to the volatile side of the market, as the investors may use these assets to shift into Bitcoin and others. As the chart shows, both Tether and USD Coin saw the exchange supply rise between August and October. More specifically, USDT and USDC observed 3.54% and 0.72% of their supplies moving into these platforms, respectively. &#8220;These transfers were the predecessor to the crypto-wide rally from late October to mid-November,&#8221; explains Santiment. Related Reading: Bitcoin Spot ETF Will Bring $70 Billion In New Money To Trigger Price Rally – Glassnode In the past month, however, 3.1% of the Tether supply has left these platforms, while the USD Coin has observed the metric move sideways. This would suggest that buying pressure has stopped rising, and the opposite may occur. &#8220;After a cooldown, USDT &#38; USDC returning to exchanges will be crucial to seeing market caps continuing to increase for a big final 5 weeks of 2023,&#8221; notes the analytics firm. BTC Price Bitcoin has registered some drawdown today as the asset&#8217;s price has now slipped under the $36,800 mark. Looks like the asset has been going down recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  }
]