[
  {
    "source": "Cointelegraph",
    "date": "2024-03-01T03:54:15.000Z",
    "title": " SEC’s Hester Pierce wants more decentralization in the financial system ",
    "url": "https://cointelegraph.com/news/sec-hester-pierce-wants-more-decentralization-in-financial-system",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYTJhNGRjZGYtODI2NC00MjQ2LThhZjMtZDcxZDE5YTY0MmI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>“Centralization means that you have concentrated risks,” said Hester Pierce speaking at ETH Denver. </p>\n                    <p><p>United States Securities and Exchange Commission Commissioner Hester Pierce has advocated for more decentralization in the U.S. financial system, along with a softer approach to crypto regulation and enforcement. </p><p>Hester Pierce, also known as ‘Crypto Mom,’ closed her fireside chat with CNBC’s MacKenzie Sigalos at the ETHDenver conference on Feb. 29 by stating that decentralization benefits the U.S. financial system.</p><p>“Centralization means that you have concentrated risks,” she <a href=\"https://twitter.com/EthereumDenver/status/1763364159150829862\" target=\"_blank\" rel=\"noopener nofollow\">said</a> before adding: </p><p><a href=\"https://cointelegraph.com/news/sec-hester-pierce-wants-more-decentralization-in-financial-system\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-01T04:00:38.000Z",
    "title": "Peter Schiff Predicts Bitcoin ETF Bubble — Expects BTC to Crash When Gold Breaks Out",
    "url": "https://news.bitcoin.com/peter-schiff-predicts-bitcoin-etf-bubble-expects-btc-to-crash-when-gold-breaks-out/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Peter Schiff Predicts Bitcoin ETF Bubble — Expects BTC to Crash When Gold Breaks Out\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-gold-schiff1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Gold advocate and vocal bitcoin critic Peter Schiff has warned of a bubble in bitcoin exchange-traded funds (ETFs) that will burst when gold rallies. Schiff argues that gold will &#8220;inevitably&#8221; break out, and the price of bitcoin will crash as investors withdraw from bitcoin ETFs. &#8220;Bitcoin has basically become a bet against gold,&#8221; he stressed. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-01T04:08:42.000Z",
    "title": "Ethereum Price Uptrend To Continue? These Could Be The Factors To Watch",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-uptrend-3500/",
    "description": "Ethereum price climbed to a new multi-month high above $3,500. ETH is correcting gains like Bitcoin and might find strong bids near the $3,250 zone. Ethereum extended its increase above the $3,500 resistance zone. The price is trading above $3,300 and the 100-hourly Simple Moving Average. There is a major bullish trend line forming with support at $3,260 on the hourly chart of ETH/USD (data feed via Kraken). The pair could correct lower, but dips might be limited below the $3,260 support zone. Ethereum Price Eyes Fresh Increase Ethereum price gained pace after it broke the $3,200 resistance zone, like Bitcoin. ETH cleared many hurdles near the $3,320 and $3,400 levels. Finally, it spiked above the $3,500 level. A new multi-month high was formed near $3,515 before there was a downside correction. The price declined below the $3,420 and $3,400 levels. It even tested the 50% Fib retracement level of the upward wave from the $3,110 swing low to the $3,515 high. Ethereum is now trading above $3,300 and the 100-hourly Simple Moving Average. There is also a major bullish trend line forming with support at $3,260 on the hourly chart of ETH/USD. The trend line is close to the 61.8% Fib retracement level of the upward wave from the $3,110 swing low to the $3,515 high. Immediate resistance on the upside is near the $3,420 level. The first major resistance is near the $3,450 level. The next major resistance is near $3,500, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com If there is a move above the $3,500 resistance, Ether could even rally toward the $3,620 resistance. Any more gains might call for a test of $3,800. Are Dips Supported In ETH? If Ethereum fails to clear the $3,420 resistance, it could start a downside correction. Initial support on the downside is near the $3,310 level. The first major support is near the $3,260 zone or the trend line. The next key support could be the $3,250 zone. A clear move below the $3,250 support might send the price toward $3,120. Any more losses might send the price toward the $3,050 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $3,260 Major Resistance Level – $3,420"
  }
]