[
  {
    "source": "CryptoSlate",
    "date": "2023-12-14T14:20:39.000Z",
    "title": "Bitcoin inscriptions near 50M milestone as trend continues",
    "url": "https://cryptoslate.com/insights/bitcoin-inscriptions-near-50m-milestone-as-trend-continues/",
    "description": "<p>Quick Take As the total number of inscriptions teeters at the edge of a significant milestone &#8211; 50 million, currently at 47.4 million &#8211; a fascinating trend emerges. The cumulative fees miners have harvested since the onset of inscriptions at the start of the year stand at an astounding 3,588 BTC. This intriguing development prompts [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-inscriptions-near-50m-milestone-as-trend-continues/\">Bitcoin inscriptions near 50M milestone as trend continues</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-14T14:33:00.000Z",
    "title": "Altcoins Including ADA, BONK and DOT Outshine Bitcoin as Crypto Market Adds $60 Billion in a Day",
    "url": "https://www.cryptoglobe.com/latest/2023/12/altcoins-including-ada-bonk-and-dot-outshine-bitcoin-as-crypto-market-adds-60-billion-in-a-day/",
    "description": "Amid a wider cryptocurrency market rally that has helped the price of the flagship cryptocurrency Bitcoin (BTC) near $43,000, altcoins including Polkadot (DOT), BONK, and Cardano (ADA) have outperformed most other assets as the market added over $60 billion in market capitalization. The price of Bitcoin is, at the time of writing, trading at $42,900 […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-14T14:38:05.000Z",
    "title": "Best Meme Coins That Can Surge In 2024",
    "url": "https://cryptodaily.co.uk/2023/12/best-meme-coins-that-can-surge-in-2024",
    "description": "Explore the most promising meme coins poised for potential growth in 2024. This comprehensive guide highlights top contenders in the cryptocurrency market, offering insights into their unique features, market trends, and investment potential. Perfect for crypto enthusiasts and investors seeking emerging opportunities."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-14T14:30:19.000Z",
    "title": "Lolli Secures $8M in Series B Funding to Boost Crypto Adoption Through Innovative Rewards System",
    "url": "https://news.bitcoin.com/lolli-secures-8m-in-series-b-funding-to-boost-crypto-adoption-through-innovative-rewards-system/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lolli Secures $8M in Series B Funding to Boost Crypto Adoption Through Innovative Rewards System\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_583149112.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With a fresh infusion of $8 million in Series B funding, Lolli aims to be well positioned to continue improving upon and growing the cryptocurrency rewards sector. Lolli Secures $8 Million for Crypto Rewards Market Expansion Lolli, a prominent player in the bitcoin and cashback rewards arena, today announced the successful closure of an $8 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T14:32:23.000Z",
    "title": "Mistral AI Partners with Google Cloud and Releases New Open Source LLM",
    "url": "https://www.cryptopolitan.com/mistral-ai-partners-with-google-cloud-and-releases-new-open-source-llm/",
    "description": "Mistral AI, a rising star in the artificial intelligence (AI) industry, has made significant strides in the wake of its recent $415 million Series A funding round. The French-based company, now valued at an impressive $2 billion, has not only unveiled a powerful new open-source Large Language Model (LLM) but has also entered into a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T14:27:02.000Z",
    "title": "Crypto custody firm Taurus partners with Teylor to tokenize German SME credit portfolio",
    "url": "https://www.cryptopolitan.com/taurus-partners-teylor-tokenize-german-sme/",
    "description": "Taurus, a Swiss firm specializing in crypto custody, has partnered with Teylor, a Zurich-based fintech lending platform. This collaboration marks a notable development in the tokenization of assets, particularly focusing on the German small and medium-sized enterprises (SME) market. Innovative tokenization of SME loans The partnership involves the tokenization of Teylor&#8217;s credit portfolio, a process [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T14:17:16.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T14:12:29.000Z",
    "title": "Requisite regulatory measures for fostering the growth of an AI ecosystem in Pakistan",
    "url": "https://www.cryptopolitan.com/ai-revolution-pakistans-rapid-advancements/",
    "description": "In a recent statement to WealthPK, Babur Majid, CEO of the National Information Technology Board (NITB), highlighted the transformative potential of artificial intelligence (AI) in Pakistan. With a projected 22.30% growth in the AI market from 2023 to 2030, reaching a market volume of US$2693.00 million, Pakistan is rapidly positioning itself as a key player [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T14:38:42.000Z",
    "title": "Ledger library flaw affects SushiSwap, Revoke.cash dapps",
    "url": "https://crypto.news/ledger-library-flaw-affects-sushiswap-revoke-cash-dapps/",
    "description": "SushiSwap Chief Technical Officer Mathew Lilley has disclosed the compromise of a widely employed web3 connector within Ledger's delivery network."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T14:15:00.000Z",
    "title": "Flare and Kinetic partner to expand defi capabilities",
    "url": "https://crypto.news/flare-and-kinetic-partner-to-expand-defi-capabilities/",
    "description": "Flare, a blockchain optimized for data, is partnering with Kinetic to bolster the development of defi applications on the Flare network"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-14T14:30:06.000Z",
    "title": "Ethereum Supply Turns Deflationary Post-Merge, Here’s How Much ETH Has Left Circulation",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-eth-has-left-circulation/",
    "description": "Ethereum has seen its deflationary status once again in the limelight as the network continues to see a significant decline in the number of ETH tokens in circulation. This comes on the back of the belief that the bull run and some other factors could help uphold this trend.  More ETH Goes Out Of Circulation According to data from Ultrasound Money, Ethereum has seen a decrease in its circulating supply in the last seven days, with over 14,160 ETH going out of circulation. This is a result of over 30,700 being burned during this period while only just over 16,500 ETH have been issued during this same timeframe.  Related Reading: Shiba Inu Bucks Bearish Trend: Large Holder Netflow Rises 1079% To 4.68 Trillion SHIB This development continues a growing trend where the number of tokens being burned outpaces the number of tokens being issued. NewsBTC had reported earlier this month how over 106,000 ETH had been burned in the last 30 days (between November 4 and December 4). At the same time, only just over 70,000 ETH had been issued.  This deflationary trend has been attributed to the increasing number of validators exiting the Ethereum ecosystem. This trend is said to have begun at the start of October. Glassnode noted that the average number of validators exiting per day surged from 309 to 1018 validators per day at the start of October.  This isn’t the only contributing factor, as network activity on Ethereum has picked up significantly. According to data from Etherscan, the daily number of transactions on the network has stood over a million in the last seven days. This has caused a spike in gas fees, causing more ETH to be burned with the EIP-1559 protocol.   ETH price rises above $2,200 &#124; Source: ETHUSD on Tradingview.com Ethereum Deflationary Trend Expected To Continue It is no coincidence that network activity on Ethereum has picked up as many continue to position themselves ahead of the imminent bull run, which is projected to kickstart in 2024. The recent surge in the trading volume of non-fungible tokens (NFTs) on Ethereum has also been a big factor. This is expected to continue once the bull market takes its full course.  Related Reading: Crypto Pundit Predicts That XRP Price Will Rise “Dramatically,” Here’s When Another factor to consider is the fact that more liquidity is expected to flow into the Ethereum ecosystem if the pending Ethereum Spot ETFs applications get approved. This would likely spark a further increase in the trading activity on the network as many will look to invest in the second-largest cryptocurrency by market cap.  ETH investors will undoubtedly be delighted at the fact that the future trajectory of ETH looks bullish. One can expect the crypto token’s value to rise as it continues to maintain this deflationary status. The less ETH in circulation, the more valuable it likely will be.  At the time of writing, Ethereum is trading at around $2,270, up by over 4% in the last 24 hours, according to data from CoinMarketCap.  Featured image from Coinpedia, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-14T14:33:36.000Z",
    "title": "BlackRock’s Standoff: Will Bitcoin ETFs Yield to SEC’s Cash Demand?",
    "url": "https://www.crypto-news-flash.com/blackrocks-standoff-will-bitcoin-etfs-yield-to-secs-cash-demand/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-standoff-will-bitcoin-etfs-yield-to-secs-cash-demand",
    "description": "<img width=\"1280\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-1024x639.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-768x479.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-163x102.png 163w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The US SEC has been pushing Bitcoin spot ETF applicants to follow the path of cash redemption instead of in-kind settlement plans. Analysts still hold the January 10 deadline as the expected timeline when the US SEC will approve the batch spot Bitcoin ETFs.  The debate on the spot Bitcoin exchange-traded funds (ETFs) in the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-14T14:20:57.000Z",
    "title": "Looking for the Next Big Rally? Experts Point to This Coin’s 70% Surge After Shiba Inu & Dogecoin’s Rise",
    "url": "https://www.crypto-news-flash.com/looking-for-the-next-big-rally-experts-point-to-this-coins-70-surge-after-shiba-inu-dogecoins-rise/?utm_source=rss&utm_medium=rss&utm_campaign=looking-for-the-next-big-rally-experts-point-to-this-coins-70-surge-after-shiba-inu-dogecoins-rise",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-106.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-106.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-106-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />During the past bull markets, some altcoins have always outperformed the rest of the market. Shiba Inu ($SHIB) and Dogecoin ($DOGE) were previously the best altcoins during bull markets. They have, however, grown beyond the parabolic rise stages. So, if you are looking for the best cryptocurrency investment for this new bull market, you&#8217;re in luck. Top analysts have [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-14T14:24:46.000Z",
    "title": "Analysts Spots Significant Patterns on the Polygon (MATIC) Price Chart",
    "url": "https://coinedition.com/analysts-spots-significant-patterns-on-the-polygon-matic-price-chart/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon MATIC Price Chart\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>JB, an analyst on the Cheeky Crypto YouTube channel, has spotted significant patterns in multiple time frames on the Polygon (MATIC) price chart. The analyst identified a 5-wave pattern on the MATIC weekly chart that suggests a potentially significant rally under certain conditions. In an uploaded video, JB explained that MATIC performed well recently, with [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analysts-spots-significant-patterns-on-the-polygon-matic-price-chart/\">Analysts Spots Significant Patterns on the Polygon (MATIC) Price Chart</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]