[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T08:18:50.000Z",
    "title": "Total Value of Cardano DeFi Ecosystem Nears $450M Amid Layer 1 Push; ADA Rockets 17%",
    "url": "https://www.coindesk.com/markets/2023/12/14/total-value-of-cardano-defi-ecosystem-nears-450m-amid-layer-1-push-ada-rockets-17/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The total value locked (TVL) of all Cardano-based tokens jumped to over $440 million late earlier this week, crossing a previous peak of $330 million set in April."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T08:16:04.000Z",
    "title": " Blockchain media authentication app eyes news journalism as primary use case ",
    "url": "https://cointelegraph.com/news/blockchain-media-authentication-app-eyes-news-journalism-as-primary-use-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYmI0NWIyY2QtYzFlZS00NWQ4LWFmNzUtNDYyMjRlYjc1Zjc0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Tapping into underlying blockchain infrastructure, Nodle’s Click application allows users to authenticate media content for various use cases. </p>\n                    <p><p data-ct-non-breakable=\"true\">Decentralized infrastructure network provider Nodle has released the first version of its blockchain-based media authentication application called Click, which could prove useful in combatting artificially generated media and fake news. </p><p>As previously reported by Cointelegraph, Nodle has <a href=\"https://cointelegraph.com/news/blockchain-to-verify-real-world-media-authenticity-nodle\">developed a software development kit (SDK)</a> for its ContentSign solution, which cryptographically proves the integrity of data captured by mobile devices using blockchain technology.</p><p>The Click application supports the Coalition for Content Provenance and Authenticity (C2PA) and is a member of the Content Authenticity Initiative (CAI). The latter is a project led by Adobe and the Linux Foundation to create a future standard for media attestation.</p><p><a href=\"https://cointelegraph.com/news/blockchain-media-authentication-app-eyes-news-journalism-as-primary-use-case\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T08:24:13.000Z",
    "title": "Russia’s Ministry of Finance proposes to export mined crypto as gas",
    "url": "https://www.cryptopolitan.com/russia-plans-to-export-mined-crypto-as-gas/",
    "description": "Russia&#8217;s Ministry of Finance is considering exporting cryptocurrency generated by mining operations in the nation. According to the Ministry, this method would work similarly to the country&#8217;s natural gas exports. &#160;The announcement was made at a recent roundtable discussion by Russia’s Deputy Finance Minister Ivan Chebeskov. Chebeskov noted at the &#8220;Cryptocurrency and the Future of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T08:33:10.000Z",
    "title": "Regulatory void shackles web3 startups in Ukraine, report says",
    "url": "https://crypto.news/regulatory-void-shackles-web3-startups-in-ukraine-report-says/",
    "description": "New research supported by Ukraine&#8217;s Ministry of Digital Transformation says the lack of regulation forces web3 startups to incorporate in foreign jurisdictions. A new research report conducted by the Ukrainian Web3 Institute, titled &#8220;Web3 for Ukraine: Talk to Founders,&#8221; has&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T08:25:09.000Z",
    "title": "Bitnomial receives CFTC nod for derivatives clearing in US",
    "url": "https://crypto.news/bitnomial-receives-cftc-nod-for-derivatives-clearing-in-us/",
    "description": "Crypto derivatives firm Bitnomial has received approval from the Commodity Futures Trading Commission to register as a derivatives clearing organization in the U.S., enabling it to settle margined futures and options contracts. The approval, secured by a four-to-one vote at&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T08:10:15.000Z",
    "title": "Bitcoin and Solana holders considering this crypto project",
    "url": "https://crypto.news/bitcoin-and-solana-holders-considering-this-crypto-project/",
    "description": "BorroeFinance (ROE), is being monitored by Bitcoin and Solana bulls looking to diversify their portfolios"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T08:09:53.000Z",
    "title": "Yearn Finance lost $1.4m due to a multisig script error",
    "url": "https://crypto.news/yearn-finance-lost-1-4m-due-to-a-multisig-script-error/",
    "description": "Decentralized protocol Yearn Finance lost $1.4 million due to a multisig script error. Information about this appeared on the project&#8217;s GitHub page, which led to significant price slippage and arbitrageurs making money from the error. The Yearn Finance team appealed&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-14T08:25:21.000Z",
    "title": "Banking On Ethereum: JPMorgan Says Ether Will Rise Above Bitcoin In 2024",
    "url": "https://www.newsbtc.com/news/banking-on-ethereum-jpmorgan-says-ether-will-rise-above-bitcoin-in-2024/",
    "description": "JPMorgan analysts, while maintaining an overall cautious stance on the cryptocurrency market, foresee Ethereum (ETH) surpassing Bitcoin (BTC) and other digital currencies in market price performance by 2024. This bullish outlook for Ethereum reflects a distinctive perspective within the institution, suggesting that the analysts see unique potential and favorable prospects for Ethereum relative to other digital assets, even amid an overall cautious sentiment towards the broader crypto landscape. In a published note on Wednesday, a team of analysts headed by Nikolaos Panigirtzoglou conveyed their expectation that Ethereum (ETH) will reclaim its prominence and regain market share within the cryptocurrency ecosystem in the upcoming year. Ethereum Will Overtake Bitcoin &#8211; JPMorgan Source: Coingecko &#8220;We believe that next year Ethereum will re-assert itself and recapture market share within the crypto ecosystem,&#8221; Panigirtzoglou wrote in a note. The analysts underscored the pivotal role of the EIP-4844 upgrade, popularly known as Protodanksharding, as the primary catalyst for Ethereum&#8217;s anticipated resurgence. Related Reading: Immutable Momentum: IMX Rockets To $2.21, Scaling Heights Unseen Since 2022 This crucial upgrade, scheduled for implementation in the first half of 2024, is poised to bring about substantial improvements in Ethereum&#8217;s network activity. Danksharding is a more efficient sharding method for Ethereum, and protodanksharding is the first step toward its complete implementation. Danksharding sidesteps the tedious procedure of dividing Ethereum into several shard chains, as contrast to the initially intended sharding method. ETH market cap currently at $273 billion. Chart: TradingView.com Data blobs, which are connected to blocks and can hold more data than blocks but are not permanently stored or accessible by the Ethereum virtual engine, are instead introduced. Meanwhile, JPMorgan&#8217;s optimistic forecast aligns with Standard Chartered&#8217;s, as they previously stated in a communication that Ether might experience a 400% surge within a few years, followed by a more sustained upward movement towards $35,000. Geoff Kendrick, the Head of FX Research, West, and Digital Assets Research, expressed the viewpoint that the upward trajectory for Ether might unfold at a more gradual pace compared to Bitcoin. Related Reading: OKX DEX Loses Over $400,000 To Hackers – What Happens To Customer Funds? Ethereum Price Prediction: 5x Increase Despite this potentially more extended timeframe, Kendrick envisions Ethereum eventually attaining a higher price multiple than Bitcoin relative to their current levels. Specifically, he anticipates Ethereum reaching a price multiple of 5.0x, surpassing Bitcoin&#8217;s expected 3.5x multiple. Layer 2 networks, such as Optimism (OP) and Arbitrum (ARB), would gain the most from the upgrade, according to the JPMorgan analysts. Ether seen rising to $2,426 this month. Source: Coincodex Layer 2 networks on Ethereum would benefit from the increased temporary data space, which would increase network throughput and decrease transaction fees. Data blobs improve Layer 2 network efficiency without changing the size of an Ethereum block. In the meantime, as ether discovers new applications, demand for it will rise, and cryptocurrency-related trends will only grow. For example, the most common Ethereum use case is NFT transactions, which Kendrick believes will grow. At the time of writing, Ether was trading at $2,281, up 5.0% in the last 24 hours, while Bitcoin was exhanging hands at $42,910, with a 2.3% increase in the same timeframe. Featured image from Pixabay"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-14T08:22:00.000Z",
    "title": "Russia’s Bid to Legalize Exporting Mined Cryptocurrency Like Gas",
    "url": "https://coinedition.com/russias-bid-to-legalize-exporting-mined-cryptocurrency-like-gas/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Russian Ruble Monthly Volume On Binance\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Russian-Ruble-Monthly-Volume-On-Binance-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Russian officials are exploring the idea of treating mined cryptocurrencies as exportable goods, similar to the country&#8217;s approach with natural gas, Russian media RBC reported. The Deputy Minister of Finance, Ivan Chebeskov, revealed the proposal, explaining that they have developed a concept allowing miners to sell the digital assets they mine as an export product. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/russias-bid-to-legalize-exporting-mined-cryptocurrency-like-gas/\">Russia&#8217;s Bid to Legalize Exporting Mined Cryptocurrency Like Gas</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]