[
  {
    "source": "Crypto Daily",
    "date": "2023-10-28T10:00:06.000Z",
    "title": "Zeebu (ZBU) Announces Listing on BitForex",
    "url": "https://cryptodaily.co.uk/2023/10/zeebu-zbu-announces-listing-on-bitforex",
    "description": "Zeebu (ZBU) Announces Listing on BitForex"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-28T10:01:49.000Z",
    "title": "Crypto Mom bemoans SEC scorched earth approach to LBRY crypto token",
    "url": "https://cryptodaily.co.uk/2023/10/crypto-mom-bemoans-sec-scorched-earth-approach-to-lbry-crypto-token",
    "description": "After the SEC won its case against LBRY, SEC Commissioner Hester Peirce published her statement of dissent against her own agency's actions on its public website."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T10:03:07.000Z",
    "title": "Harnessing AI: Five Ways to Tackle the Mental Health Crisis",
    "url": "https://www.cryptopolitan.com/ai-five-ways-to-tackle-the-mental-health/",
    "description": "Artificial intelligence (AI) is revolutionizing healthcare, offering innovative solutions to address the growing mental health crisis that affects millions worldwide. With depression as the leading cause of disability globally and significant economic costs, there is an urgent need for scalable and accessible mental health support.&#160; Reducing symptoms of anxiety and depression AI-powered mental health solutions, ... <a title=\"Harnessing AI: Five Ways to Tackle the Mental Health Crisis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-five-ways-to-tackle-the-mental-health/\" aria-label=\"More on Harnessing AI: Five Ways to Tackle the Mental Health Crisis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T09:55:31.000Z",
    "title": "Ghostrunner 2 is Supercharging the Cyberpunk Gaming World",
    "url": "https://www.cryptopolitan.com/ghostrunner-2-elevates-cyberpunk-gaming/",
    "description": "Explore the immersive world of Ghostrunner 2 and discover how the sequel builds on the original's intense gameplay, offering engaging cyberpunk narrative.\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T09:49:15.000Z",
    "title": "Robert Kiyosaki blasts Sam Bankman-Fried Over FTX collapse fallout",
    "url": "https://www.cryptopolitan.com/robert-kiyosaki-blasts-sam-bankman-fried/",
    "description": "Renowned financial expert Robert Kiyosaki recently voiced his concerns regarding the controversial downfall of the crypto exchange FTX and its founder, Sam Bankman-Fried. The “Rich Dad, Poor Dad” author, with a significant following on social media, highlighted the former FTX head&#8217;s deceptive prowess, noting how he misled seasoned investors like Jim Cramer of CNBC’s Mad ... <a title=\"Robert Kiyosaki blasts Sam Bankman-Fried Over FTX collapse fallout\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robert-kiyosaki-blasts-sam-bankman-fried/\" aria-label=\"More on Robert Kiyosaki blasts Sam Bankman-Fried Over FTX collapse fallout\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T09:45:38.000Z",
    "title": "Mortal Kombat 1 Halloween DLC Sparks Controversy Within Playerbase",
    "url": "https://www.cryptopolitan.com/mortal-kombat-1-dlc-sparks-controversy/",
    "description": "In the aftermath of Mortal Kombat 1&#8217;s inaugural balance patch, Netherrealm Studios has unveiled a Halloween-themed DLC featuring a new pumpkin-based fatality. While fans of the iconic fighting game franchise have traditionally welcomed fresh content, this particular DLC has left the community in a state of unrest due to its hefty price tag of $10. ... <a title=\"Mortal Kombat 1 Halloween DLC Sparks Controversy Within Playerbase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mortal-kombat-1-dlc-sparks-controversy/\" aria-label=\"More on Mortal Kombat 1 Halloween DLC Sparks Controversy Within Playerbase\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T09:40:05.000Z",
    "title": "Highlights of Lugano’s Plan B 2023: The Premier Bitcoin Conference",
    "url": "https://www.cryptopolitan.com/highlights-of-luganos-plan-b-2023-the-premier-bitcoin-conference/",
    "description": "The second edition of Lugano’s Plan B Forum, the premier Bitcoin conference hosted in the City of Lugano, Switzerland, was yet another success filled with engaging discussions and highlights, including Bitcoin Bazaar, Masterclasses, Keynotes, Sponsor Exhibitions and Bitcoin Art Gallery, topped off with a drone light show.&#160; The 2023 conference was hosted for two days, ... <a title=\"Highlights of Lugano’s Plan B 2023: The Premier Bitcoin Conference\" class=\"read-more\" href=\"https://www.cryptopolitan.com/highlights-of-luganos-plan-b-2023-the-premier-bitcoin-conference/\" aria-label=\"More on Highlights of Lugano’s Plan B 2023: The Premier Bitcoin Conference\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T09:50:39.000Z",
    "title": "Aptos TVL Soars To A Record $74 Million, Reflecting Growing Investor Confidence",
    "url": "https://www.newsbtc.com/news/aptos-tvl-soars-to-a-record-74-million-reflecting-growing-investor-confidence/",
    "description": "Since the second week of October, there was a noticeable surge in demand for Aptos’ native cryptocurrency APT. This increased interest led to a robust phase of Total Value Locked (TVL) growth. Ultimately, this surge in demand for APT resulted in Aptos achieving its highest-ever TVL value of $74 million during the trading session on Thursday, October 26th. This surge in TVL is a crucial metric for decentralized finance (DeFi) platforms, showcasing the total value of assets, tokens, or cryptocurrencies locked within the platform&#8217;s smart contracts. Related Reading: Injective (INJ) Rules Weekend Top 50 Crypto Ranking With 60% Hike – Here’s Why Aptos TVL. Source: DefiLlama Aptos Surges Amidst Rising Investor Confidence The increase in demand for Aptos&#8217; native cryptocurrency, APT, further demonstrates growing investor confidence and interest in the platform&#8217;s utility, potentially indicating an expanded user base or enhanced use case scenarios within the Aptos ecosystem. At the time of writing, APT was trading at $6.69, up 4.5% in the last 24 hours, and etching a notable 31.5% increase in the last seven days, according to figures by crypto market tracker Coingecko. Source: Coingecko This rally can be partially due to Aptos&#8217; distinct position as a proof-of-stake blockchain that uses a cutting-edge smart contract programming language, to facilitate quicker and less expensive transactions on its network. For this reason, a lot of cryptocurrency fans frequently associate Aptos with certain decentralized Web3 applications, with a focus on the domain of non-fungible tokens (NFTs). 1/ 🎉 Aptos Community, we&#8217;re celebrating #AptosOne in style! Introducing Graffio: a unique canvas where YOUR art shapes a special commemorative NFT. Dive in and be a part of Aptos history! 🎨🌐 pic.twitter.com/pKAaQtwhi3 — Aptos (@Aptos_Network) October 18, 2023 AptosOne recently launched Graffio, an NFT-based art display platform. This tool simplifies NFT art creation, with standout features including waived gas fees for social media logins and the creation of an exclusive Graffio wallet. Related Reading: Bitcoin Braces For $50 Billion Influx Following ETF Launch, Bitwise CEO Says APTUSDT currently trading at $6.80 billion on the daily chart: TradingView.com APT Price On Bullish Run With 24% Gain  The announcement led to a surge in Aptos (APT) price from $4.88 to $6.03 between October 20 and 23, a nearly 24% increase, prompting experts to predict a bullish trend continuing to $7.20 around end of next month. Its current value of $6.69 reflects a notable climb of 36% since mid-October, demonstrating a robust upward trend. The increase in price underscores the promising prospects for the future of Aptos and its indigenous digital currency, APT. APT seven-day price action. Source: Coingecko As Aptos achieves its all-time high in Total Value Locked (TVL), the soaring trajectory of APT&#8217;s price and the platform&#8217;s advancements in NFT technology have sparked significant optimism. The recent market surge and robust momentum hint at the potential for sustained growth and increased interest in APT. Despite concerns looming over a possible market retraction, the record-breaking TVL and the remarkable rise in APT&#8217;s value prompt a hopeful outlook, suggesting that Aptos and its native token may be well-positioned to weather potential market fluctuations and maintain their upward trajectory in the near future. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-28T09:44:10.000Z",
    "title": "Binance Is Contributing to Making a Positive Global Impact: CZ",
    "url": "https://coinedition.com/binance-is-contributing-to-making-a-positive-global-impact-cz/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance CEO believes the crypto exchange is contributing significantly to making a positive impact in the lives of millions of people. Read more.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Binance-CEO-plan-to-seek-dismissal-of-CFTC-complaint-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance CEO believes the crypto exchange is impacting the lives of millions of people. CZ spoke at a fireside chat during the Fintech Forward 2023 event in Bahrain. According to CZ, everyone has a responsibility to contribute to global advancement. Binance CEO Changpeng Zhao (CZ) believes the crypto exchange is contributing significantly to making a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-is-contributing-to-making-a-positive-global-impact-cz/\">Binance Is Contributing to Making a Positive Global Impact: CZ</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]