[
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T08:13:54.000Z",
    "title": "The First Real World Asset Product stUSDT Launches on the TRON Blockchain",
    "url": "https://cryptodaily.co.uk/2023/07/the-first-real-world-asset-product-stusdt-launches-on-the-tron-blockchain",
    "description": "<p>Geneva, Switzerland, July 4th, 2023, Chainwire</p><p>Today, the TRON ecosystem welcomes its first Real World Asset (RWA) product, stUSDT, which is operating through the decentralized platform JustLend. TRON founder and member of Huobi's global advisory board, Justin Sun, has voiced his belief that stUSDT will evolve into the crypto version of Alipay&rsquo;s Yu&rsquo;e Bao, a money market fund product offered by Alibaba. Sun is convinced that it will serve as a bridge connecting traditional markets to blockchain ecosystems while empowering crypto users with more options. From July 10 to August 10, 2023, the stUSDT platform is set to launch a welcome campaign offering an increased APY of up to 10% (normally expected to be around 5%) to enhance users&rsquo; first experience with RWAs on TRON. Users can also enjoy discounts on redemption fees of stUSDT from July 3 to August 10. Please refer to Medium for daily updates on the RWA fund allocation and rebases.</p><p>With a vast global user base and a $50 billion stablecoin market cap, stUSDT, a TRON-based RWA product, has sparked considerable industry excitement upon its introduction. It is primed to serve as a cornerstone for TRON's RWA endeavors and towards building a financial gateway that aims to empower 8 billion people worldwide.</p><p>TRON's RWA product unleashes new opportunities</p><p>Today, RWA is a popular concept in the crypto industry. The stUSDT platform is dedicated to narrowing the divide between retail and institutional investors while connecting the crypto realm with the real world. stUSDT ensures equal opportunities for all to invest in RWAs. This is the first endeavor in the TRON ecosystem to tokenize RWAs and introduce them to the community.</p><p>stUSDT, the TRON ecosystem's answer to stETH on the Lido protocol, is a decentralized token that serves as proof of investment in RWAs and its holders can earn passive incomes from real world assets. stUSDT introduces more decentralized and robust asset management mechanisms. The ultimate goal of stUSDT is to optimize return opportunities for on-chain users from real world assets. Launched by RWA DAO, stUSDT is operated by JustLend DAO under the custody agreement between the two parties. JustLend DAO boasts the highest TVL on TRON and ranks among the top DeFi projects. In addition, TRON hosts the largest circulating supply of USDT (over $46 billion) and a TVL second only to Ethereum, which will also drive the organic growth of stUSDT. The stUSDT team is confident to see an influx of new users and wider expansion of the TRON ecosystem at large.</p><p>Create the Web3 counterpart of Yu&rsquo;e Bao, combining the physical world with Web3</p><p>Current market participants are consistently devoting time and effort to stay ahead of the curve regarding any new tech or product developments in the crypto sphere, and the sheer size of market expansion over the past few years speaks volumes. The inception of liquidity mining during the \"DeFi Summer\" of 2020 has given rise to a booming decentralized lending market. Back then, in the realm of USD-pegged stablecoins, a deposit rate of 10% was hardly a surprise. When the real world interest rates were low, liquidity gravitated towards on-chain DeFi lending markets.</p><p>However, with a shift in market trends, some real world assets have now regained a much stronger position. For example, the US Fed Funds Rate has surged past 5%, making the dollar a sought-after risk-free asset. Under this latest macroeconomic backdrop, the DeFi sector has its eyes on RWAs in an attempt to venture into new markets. In traditional finance, Yu&rsquo;e Bao, Alipay's money market fund product, has become a handy investment vehicle. The TRON-based stUSDT is positioned as the Yu&rsquo;e Bao of Web3, whose debut unveils a new chapter for the TRON ecosystem to potentially replicate the success story of Alipay. Just as Alipay cracked the market open with its payment services before expanding its user base with Yu&rsquo;e Bao, TRON has solidified its leading position in Web3 on-chain payment infrastructure across the globe, before the ecosystem ventures to new heights via the launch of stUSDT.</p><p>Similar to Alipay&rsquo;s Yu&rsquo;e Bao, stUSDT enables users to engage with passive incomes and withdraw their assets at any time while enjoying the transparency, security, and immutability brought by blockchain technology. stUSDT provides a wide range of opportunities for users by connecting on-chain assets with real-world assets. Supported by TRON's robust ecosystem, the platform commits to a user-centric approach and serves as a dynamic bridge between traditional finance and blockchain. It is poised to attract a new mass of blockchain enthusiasts, further expanding the TRON DAO community. By further facilitating the integration of blockchain with traditional finance, stUSDT aims to propel the next stage of growth in the blockchain industry.</p><p></p><p>About stUSDT</p><p>The stUSDT.io platform is the first RWA platform on the TRON network, providing a secure and equitable channel for every blockchain user to engage with real world assets through decentralized smart contracts. Its goal is to establish a decentralized RWA investment and management mechanism, bringing real world assets into the TRON ecosystem.</p><p>The platform token of stUSDT.io, stUSDT, is a decentralized token that serves as proof of investment in real world assets, enabling its holders to earn passive incomes.</p>ContactSam Changcontact@stusdt.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T08:21:15.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? As of today, the price of WazirX is set at $0.09881. Over the last 24 hours, it has experienced a trading volume of $3.26 million. With a market capitalization of $37.75 million, its market dominance is currently 0.00%. In the past day, the WRX price has ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T08:10:47.000Z",
    "title": "Regulating AI Chatbots is Imperative to Patient Safety in Healthcare",
    "url": "https://www.cryptopolitan.com/regulating-ai-chatbots-for-patient-safety/",
    "description": "LLM-based generative chat tools, such as ChatGPT and Google&#8217;s MedPaLM, show great promise in the medical field. However, the unregulated use of AI chatbots poses inherent risks. A recent article delves into the urgent international issue of regulating Large Language Models (LLMs) in general and specifically within healthcare. Professor Stephen Gilbert, an Medical Device Regulatory ... <a title=\"Regulating AI Chatbots is Imperative to Patient Safety in Healthcare\" class=\"read-more\" href=\"https://www.cryptopolitan.com/regulating-ai-chatbots-for-patient-safety/\" aria-label=\"More on Regulating AI Chatbots is Imperative to Patient Safety in Healthcare\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T08:34:50.000Z",
    "title": "Crypto Advocate John Deaton Critiques SEC’s Lawsuit Against Ripple",
    "url": "https://www.crypto-news-flash.com/crypto-advocate-john-deaton-critiques-secs-lawsuit-against-ripple/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-advocate-john-deaton-critiques-secs-lawsuit-against-ripple",
    "description": "Top XRP advocate John Deaton remain curious as to the true intent behind the SEC suing Ripple Labs. Expectations of the lawsuit coming to an end is growing across the board. Pro-XRP attorney and Crypto Law founder John Deaton has expressed concerns and is beginning to raise questions about the true intent of the Securities [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T08:30:05.000Z",
    "title": "Crypto Price Analysis: Ethereum To $2,000, VeChain Eyes 50% Pump, Tradecurve to 100X",
    "url": "https://www.crypto-news-flash.com/crypto-price-analysis-ethereum-to-2000-vechain-eyes-50-pump-tradecurve-to-100x/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-price-analysis-ethereum-to-2000-vechain-eyes-50-pump-tradecurve-to-100x",
    "description": "The crypto market has been getting incredibly bullish lately, especially with Wall Street eager to take a slice of the pie. This new wave of interest has sent prices on a steady rise, with the likes of Ethereum (ETH) and VeChain (VET) being among the biggest beneficiaries. But the most bullish sentiment is surrounding Tradecurve, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T08:35:00.000Z",
    "title": "Data Reveals Lackluster Growth of ETH Reserves on Exchanges",
    "url": "https://coinedition.com/data-reveals-lackluster-growth-of-eth-reserves-on-exchanges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/074.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/074.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/074-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/074-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/074-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/074-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/074-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/074-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/074-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/074-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/074-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/074-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/074-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/074-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/074-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/074-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/074-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from the on-chain analytics platform CryptoQuant that was shared earlier this morning indicated that some of the most well-known crypto exchanges have not added much to their Ethereum (ETH) reserves over the past two years. This is in stark contrast to the massive Bitcoin (BTC) accumulation by exchanges leading up to the 2024 halving [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/data-reveals-lackluster-growth-of-eth-reserves-on-exchanges/\">Data Reveals Lackluster Growth of ETH Reserves on Exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T08:12:32.000Z",
    "title": "Three Arrows Capital Founders Unveil a Shadow Recovery Process",
    "url": "https://coinedition.com/three-arrows-capital-founders-unveil-a-shadow-recovery-process/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Three-Arrows-Capital-withdrew-2,000\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Three-Arrows-Capital-withdrew-2000-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In one of the most recent updates given by Three Arrows Capital (3AC) founders, the bankrupt crypto hedge fund has shared plans to donate the future earnings from their newly launched exchange to creditors. Kyle Davies, who is one of the founders, spoke about the initiative for the creditors who lost money in a Twitter [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/three-arrows-capital-founders-unveil-a-shadow-recovery-process/\">Three Arrows Capital Founders Unveil a Shadow Recovery Process</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]