[
  {
    "source": "Crypto Daily",
    "date": "2023-11-10T18:57:47.000Z",
    "title": "Why Chainlink (LINK) May Be Worth More Than You Think",
    "url": "https://cryptodaily.co.uk/2023/11/why-chainlink-link-may-be-worth-more-than-you-think",
    "description": "Discover the ever-evolving landscape of Chainlink (LINK) in the crypto sphere. Our in-depth analysis delves into the recent remarkable achievements of LINK and its role in shaping market trends. Uncover the potential for upward momentum and the challenges that lie ahead in this dynamic crypto environment with our expert perspectives"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-10T18:42:53.000Z",
    "title": "Near Foundation and Eigen Labs partner to enhance Ethereum rollups",
    "url": "https://crypto.news/near-foundation-and-eigen-labs-partner-to-enhance-ethereum-rollups/",
    "description": "The Near Foundation and Eigen Labs are joining forces to improve the efficiency and reduce the cost of transactions on Ethereum rollups."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T19:00:58.000Z",
    "title": "Algorand (ALGO) NFT Rewards Skyrocket: Transactions Surge 320% In Q3",
    "url": "https://www.newsbtc.com/algorand/algorand-algo-nft-rewards-skyrocket-transactions-surge-320-in-q3/",
    "description": "Algorand (ALGO), a smart contract platform employing the Proof-of-Stake (PoS) consensus mechanism, has showcased notable progress in the third quarter (Q3) of the year, as reported by Messari.  Despite facing some challenges, the platform has seen remarkable growth in its ecosystem and significant developments in various aspects of its platform. Algorand Witnesses Surge In Transaction Volume In Q3 Per the report, the non-fungible token (NFT) Rewards program implemented by Algorand garnered notable success, leading to a significant increase of 321% in NFT-related transactions compared to the previous quarter.  This program, initiated through a governance vote in Q2, allocated 500,000 ALGO in rewards to NFT marketplace users to stimulate activity. Related Reading: $5 Million Reward: Justin Sun’s Bold Move Against Poloniex Attackers Furthermore, during Q3, Algorand experienced a surge in user adoption, adding 1.1 million new addresses and witnessing a 2% increase in total daily average transactions compared to the previous quarter.  However, Algorand&#8217;s total stablecoin market cap faced a decline of 58% in Q3, largely attributed to the decreasing market caps of stablecoins on the platform. Despite this, USDC (USD Coin) surpassed USDT (Tether), accounting for 76% of the stablecoin market cap. In the decentralized finance (DeFi) space, Algofi, Algorand&#8217;s largest DeFi protocol by Total Value Locked (TVL), began winding down operations in July.  As a result, Folks Finance emerged as the dominant DeFi protocol on Algorand, capturing 55% of the DeFi TVL in Q3. Algorand&#8217;s quarterly revenue, including fees collected by the protocol, grew by 25% in ALGO terms; however, it declined by 23% in USD terms due to the daily average ALGO price. Algorand&#8217;s governance participation experienced a decline of 8% in Q3, accounting for 30% of the circulating supply. The platform&#8217;s network upgrade in Q3 allowed for increased throughput, lower blocktime, and support for quantum-secure interoperability via State Proofs. Looking ahead, Algorand has announced plans to launch AlgoKit 2.0, a developer-focused tooling that aims to simplify the developer experience. It also intends to shift its network topology to a peer-to-peer design and transition to an incentivized consensus economic model in 2024. ALGO Struggles To Break Key Resistance Regarding price action, ALGO, currently ranked 53rd among the largest cryptocurrencies in the market, has faced challenges amid the recent bullish surge in most cryptocurrencies.  The token is currently trading at $0.1217, experiencing a decline of over 7% in the past 24 hours. Despite this retracement, ALGO has shown impressive gains across other time frames. Related Reading: Ethereum At $2,100: Why Path To $2,500 Is Now All Clear Over 7 and 14 days, ALGO has recorded significant gains of 10% and 21%, respectively. The best performance was seen in the 30 days, with a surge of 28%.  However, ALGO has faced a year-to-date decline of over 62%, in contrast to most of the crypto market, where major cryptocurrencies have nearly doubled in value since the end of the crypto winter. Moreover, ALGO has struggled to surpass its 200-day moving average (MA), a significant resistance level. This has resulted in the recent pullback, preventing the token from reaching levels not seen since July, where it reached $0.1364. The future trajectory of ALGO remains uncertain. It will depend on continued developments and growth in its ecosystem to propel the token towards its yearly high of $0.2898, reached in February. Alternatively, ALGO may consolidate below its moving averages. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T18:50:00.000Z",
    "title": "BTC Soars as Binance’s CEO Shares It Traded at $15,588 a Year Ago",
    "url": "https://coinedition.com/btc-soars-as-binances-ceo-shares-it-traded-at-15588-a-year-ago/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Urges Users to Convert BUSD\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Binance-Urges-Users-to-Convert-BUSD-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance CEO Changpeng Zhao, “CZ”, highlighted the impressive performance of Bitcoin (BTC) over the past year in an X post earlier today. According to the post, the market leader was trading hands at $15,588 a year ago today. At press time, BTC’s price stood at $36,670.30 according to the cryptocurrency market tracking website CoinMarketCap. This [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/btc-soars-as-binances-ceo-shares-it-traded-at-15588-a-year-ago/\">BTC Soars as Binance’s CEO Shares It Traded at $15,588 a Year Ago</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T19:05:48.000Z",
    "title": "Crypto Trader Issues Warning on Bitcoin, Says a ‘Brief Correction Is Brewing’ – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/11/10/crypto-trader-issues-warning-on-bitcoin-says-a-brief-correction-is-brewing-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto trader Ali Martinez is warning that Bitcoin (BTC) will likely soon undergo a short-lived market correction. Martinez tells his 32,300 followers on the social media platform X that he expects Bitcoin to pull back after nearing $38,000. &#8220;Actually, a brief correction is brewing.” The trader uses the Tom DeMark (TD) Sequential indicator to predict that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/crypto-trader-issues-warning-on-bitcoin-says-a-brief-correction-is-brewing-here-are-his-targets/\">Crypto Trader Issues Warning on Bitcoin, Says a ‘Brief Correction Is Brewing’ – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]