[
  {
    "source": "CoinDesk",
    "date": "2023-08-16T10:42:40.000Z",
    "title": "Coinbase Finally Wins Approval to List Crypto Futures in U.S.",
    "url": "https://www.coindesk.com/business/2023/08/16/coinbase-finally-wins-approval-to-list-crypto-futures-in-us/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The approval makes Coinbase the first crypto-first platform to offer regulated and leveraged crypto futures alongside alongside traditional spot trading."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T11:03:58.000Z",
    "title": "FBI seizes almost $2M in crypto assets in three months",
    "url": "https://cointelegraph.com/news/crypto-fbi-seizes-almost-2-m-in-crypto-assets-in-three-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/196fd3ff-8f39-48c0-829e-fd88a4477194.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto assets seized by the Federal Bureau of Investigation included Bitcoin, Ether, Tether, Monero and DAI. </p>\n                    <p><p>A public filing released by the United States Federal Bureau of Investigation (FBI) shows that around $1.7 million worth of digital assets were seized by the law enforcement agency from March to May.</p><p>According to the Filing, the FBI <a href=\"https://www.forfeiture.gov/pdf/FBI/OfficialNotification.pdf\" target=\"_blank\" rel=\"noopener nofollow\">seized</a> $147,000 in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), $800,000 in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), $307,000 in Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), 469,000 in DAI (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) and $20,000 in Monero (<a href=\"https://cointelegraph.com/xmr-price-index\">XMR</a>). The assets were confiscated from various sources including Binance exchange wallets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/24cf426c-36d4-4cf5-9d23-ca53702b132f.png\"  /><figcaption style=\"text-align: center;\"><em>An excerpt from the FBI filing released on August 16, 2023. Source: FBI</em></figcaption></figure><p>In the Eastern District of Virginia, the agency confiscated a total of 428.5 ETH, which is the largest amount seized so far. One of the Ether seizures was worth around $463,000. </p><p>Within the filing, the FBI also highlighted that the seizures of the assets were a result of various breaches in federal regulations. The FBI wrote:</p><blockquote>“The Federal Bureau of Investigation (FBI) gives notice that the property listed below was seized for federal forfeiture for violation of federal law.”</blockquote><p>Apart from cryptocurrencies, the FBI also listed the seizure of various items including United States Dollars (USD) from bank accounts, sports cars, luxury bags, clothes and shoes. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/fbi-search-kraken-founder-jesse-powell-home\"><strong><em>FBI searched Kraken co-founder’s home in March: Report</em></strong></a></p><p>Meanwhile, the FBI has been constantly <a href=\"https://cointelegraph.com/news/fbi-warns-of-phishing-scams-and-social-media-account-hijackers\">reminding the crypto community</a> that there are various scammers posing as legitimate people within the <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible token (NFT)</a> space. On Aug. 6, the FBI warned about account hijackers who take advantage of victims by creating a \"sense of urgency\" and lead them to fake websites used to steal their assets. The FBI said that criminals either hack official social accounts or create new ones that look similar to the official ones to perform theft and fraud. </p><p>Apart from phishing scams and social media hijacking, the FBI also warned about fake crypto job advertisements earlier this year. On May 23, the agency noted that U.S. citizens should be aware of false job advertisements related to job trafficking, where victims are forced to commit crypto investment fraud. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T10:50:00.000Z",
    "title": "What is Bitcoin’s fee-to-reward ratio?",
    "url": "https://cointelegraph.com/explained/what-is-bitcoins-fee-to-reward-ratio",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/347c0f08f71f770958a781469f2cf7b0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bitcoin network’s fee-to-reward ratio refers to the proportion of the miner’s income coming from transaction fees compared to the total block reward.</p>\n                    <p><h2>Will the fee-to-reward ratio continue to impact Bitcoin transactions in a post-mining era?</h2><p></p><p><em>Although the ratio’s dynamics will change from being dependent on newly created BTC to transaction fees, its importance in controlling transaction prioritization and network efficiency will persist in the Bitcoin ecosystem.</em></p><p>The fee-to-reward ratio in relation to freshly created BTC will become obsolete once all Bitcoin has been mined and the block reward hits 0. By then, miners will not be compensated with a block reward for successfully adding a new block to the blockchain.</p><p>Instead, the only factor affecting the fee-to-reward ratio will be the transaction fees users pay to have their transactions included in blocks. The ratio will remain significant since it will reflect user competition to validate transactions promptly. Users will modify their fee offerings based on their urgency and prevailing network conditions, and miners will prioritize higher fee transactions.</p><p>The fee-to-reward ratio will still impact how quickly and reliably transactions are confirmed <a href=\"https://cointelegraph.com/news/what-happens-when-21-million-bitcoin-are-fully-mined-expert-answers\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-happens-when-21-million-bitcoin-are-fully-mined-expert-answers/amp\">during the post-mining stage</a>. Users who pay higher fees may receive faster transaction processing, while those who choose lower fees may see slower confirmation delays.</p><p>The fee-to-reward ratio will still impact how quickly and reliably transactions are confirmed during this post-mining stage. Users who pay higher fees may receive faster transaction processing, while those who choose lower fees may see slower confirmation times.</p><h2>Is a higher Bitcoin fee-to-reward ratio essential for the economic sustainability of the Bitcoin network?</h2><p></p><p><em>The sustainable future of the Bitcoin network rests on the delicate balance between miner incentives, network security and user-friendly transaction costs.</em></p><p>The multidimensional issue of whether a higher Bitcoin fee-to-reward ratio is necessary for the financial viability of the Bitcoin network has sparked discussions within the cryptocurrency industry. </p><p>On one hand, supporters contend that stronger short-term incentives for miners to actively participate in transaction validation and network security are provided by a bigger block reward and reduced transaction costs. This strategy balances the miner’s labor and rewards by focusing on their immediate cash gains.</p><p>On the other hand, views favoring a balanced fee-to-reward ratio assert that the continuous drop in block rewards mandated by <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">Bitcoin halving events</a> is a deliberate move toward a fee-centric network sustainability model. </p><p>This methodical strategy tries to avoid abrupt network shocks while encouraging a gradual transition toward transaction fees as the main source of income for miners. Higher transaction fees can balance off decreasing block rewards as transaction volumes rise and user reliance on the Bitcoin network grows, ensuring miner profitability and fostering a healthy fee market.</p><h2>The importance of Bitcoin’s fee-to-reward ratio</h2><p></p><p><em>The Bitcoin fee-to-reward ratio is significant because it captures the shifting economic incentives present in the network. This ratio is essential to the network’s operation, affecting users, miners, and the general stability and security of the blockchain. </em></p><h3>Miner incentives and security</h3><p>Miners are essential to the security and validity of transactions on the Bitcoin network. They use processing power and resources to mine new blocks to <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-a-beginners-guide-to-blockchain-technology\">solve challenging mathematical puzzles</a>. Transaction fees and the block reward (newly created BTC) are incentives for miners. Faster confirmation times and greater network security can be achieved by miners prioritizing transactions with significant fees when the fee-to-reward ratio is higher.</p><h3>Prioritizing transactions</h3><p>The fee-to-reward ratio becomes very important when there is a lot of network traffic, with many transactions vying for a small amount of block space. Users who want their transactions to be confirmed quickly may probably charge more. Miners are more inclined to include <a href=\"https://cointelegraph.com/learn/the-history-of-bitcoin-when-did-bitcoin-start\">transactions with higher fees</a> in the blocks they mine because of the possibility of increased profits. This guarantees that transactions are completed quickly and aids in controlling network congestion.</p><h3>Sustainability post-halving</h3><p>The block reward is halved as part of the Bitcoin protocol roughly every four years. This occurrence is programmed into the protocol. Transaction fees account for more and more of the miner’s income as the block reward declines over time. As the block reward drops, the fee-to-reward ratio helps assess if miners can support their operations exclusively through transaction fees.</p><h3>Network resilience</h3><p>The Bitcoin fee-to-reward ratio provides insight into the network’s financial stability. A healthy ratio shows that users are prepared to pay fair transaction fees, supporting the security and continued operation of the network. Consistently low ratios could deter miners, compromising network security and diminishing transaction processing power.</p><h3>Market sentiment</h3><p>User behavior and the fee-to-reward ratio can both be indicators of market sentiment. High transaction costs could mean more people are interested in using the Bitcoin network during such times. Low fees, on the other hand, might imply diminished network demand and activity.</p><h3>Adapting incentives</h3><p>The fee-to-reward ratio adapts to changing market conditions, technological developments and user preferences. The variables affecting the ratio change, along with the crypto environment, offer insights into the network’s reactivity and flexibility.</p><h2>Bitcoin fee-to-reward ratio, explained</h2><p></p><p><em>The Bitcoin fee-to-reward ratio represents the proportion of total block rewards from transaction fees paid by users in the Bitcoin network.</em></p><p>Transaction fees allow users to offer compensation to miners to encourage the inclusion of their Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) transactions in a block. To increase their profits, miners frequently prioritize transactions with higher fees. However, the fee amount may vary depending on variables, including network congestion and the size of a user’s transaction in bytes.</p><p>By resolving challenging mathematical riddles to validate transactions and secure the network, miners play a critical role in <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\">the Bitcoin network</a>. Miners receive newly created BTC (block reward, often referred to as block subsidy) and any fees from the transactions they include in the blocks as a reward for their work.</p><p><img alt=\"What constitutes miner income\" src=\"https://s3.cointelegraph.com/storage/uploads/view/f655e8d9743a83ff9b9ee7760259e66c.jpg\" title=\"What constitutes miner income\"></p><p>To retain their income, miners increasingly rely on transaction fees as the block subsidy diminishes over time due to halvings. As Bitcoin gets closer to reaching its <a href=\"https://cointelegraph.com/explained/can-bitcoins-hard-cap-of-21-million-be-changed\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/can-bitcoins-hard-cap-of-21-million-be-changed/amp\">maximum supply of 21 million coins</a>, this dynamic is anticipated to persist.</p><p>Here’s how to calculate the Bitcoin fee-to-reward ratio:</p><p><img alt=\"Calculate bitcoin fee-to-reward ratio\" src=\"https://s3.cointelegraph.com/storage/uploads/view/c364d22127dc26b38da5eb79e8203016.jpg\" title=\"Calculate bitcoin fee-to-reward ratio\"></p><p>To understand what this ratio indicates, consider three scenarios where the Bitcoin fee-to-reward ratio is greater than 1, equal to 1 and less than 1.</p><h3>Bitcoin fee-to-reward ratio greater than 1</h3><p>Consider a scenario in which users transact often, the block reward is 6.25 BTC, and there is a huge demand for block space. In this situation, users are prepared to pay higher fees to validate their transactions more promptly. Let’s assume miners received 7 BTC in transaction fees for the included transactions in the block.</p><p><img alt=\"A scenario when Bitcoin fee-to-reward ratio is greater than 1\" src=\"https://s3.cointelegraph.com/storage/uploads/view/30c81c54c466fbd5303e1b66370a64cc.jpg\" title=\"A scenario when Bitcoin fee-to-reward ratio is greater than 1\"></p><p>In this case, the fee-to-reward ratio is greater than 1 (1.12), demonstrating that the total miner fees earned are greater than the block reward. When users want their transactions to be confirmed quickly, a situation like this arises since transaction fee bidding is competitive.</p><h3>Bitcoin fee-to-reward ratio equal to 1</h3><p>Let’s now explore a case in which the block reward and the total amount of transaction fees miners earn for including transactions in the block are the same. Assume the total fees collected are 6.25 BTC, using the same block reward of 6.25 BTC.</p><p><img alt=\"A scenario when Bitcoin fee-to-reward ratio is equal to 1\" src=\"https://s3.cointelegraph.com/storage/uploads/view/8799e70d0aba787304beb255e3c18b43.jpg\" title=\"A scenario when Bitcoin fee-to-reward ratio is equal to 1\"></p><p>In this case, fees and the block reward contribute equally to the miner’s revenue.</p><h3>Bitcoin fee-to-reward ratio less than 1</h3><p>Now imagine that there is less demand for transactions on the network and that users are unwilling to pay high fees to validate their transactions. Assume that miners have received 4 BTC in transaction fees, but the block reward is still 6.25 BTC.</p><p><img alt=\"A scenario when Bitcoin fee-to-reward ratio is less than 1\" src=\"https://s3.cointelegraph.com/storage/uploads/view/099b1ec6af5b6f1a12236d35531b6971.jpg\" title=\"A scenario when Bitcoin fee-to-reward ratio is less than 1\"></p><p>In this case, the fee-to-reward ratio is 0.64, suggesting that the block reward is greater than the sum of transaction fees collected by miners. This might occur when there are fewer transactions in the mempool, lower network congestion or when users aren’t vying as hard to add their transactions to the next block.</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T11:08:48.000Z",
    "title": "PayPal suspends Crypto sales in Light of UK FCA new rules",
    "url": "https://cryptodaily.co.uk/2023/08/paypal-suspends-crypto-sales-in-light-of-uk-fca-new-rules",
    "description": "<p>From October 1st onwards, PayPal will temporarily halt its cryptocurrency sales in the United Kingdom. This decision can be attributed to the shifting regulatory environment in the UK.</p>\n<p>The underlying motive behind this suspension appears to be twofold. Firstly, it underscores PayPal&rsquo;s commitment to adhering strictly to local regulations. By suspending sales temporarily, the company is ensuring that it remains in compliance with the UK's dynamic regulatory framework on cryptocurrency transactions. This move demonstrates a precautionary measure to prevent any potential regulatory discord.</p>\n<p>Secondly, the pause can be seen as a measure to safeguard users. As the UK refines its stance on crypto activities, there might be potential uncertainties and implications for users. By taking this proactive step, PayPal aims to shield its clientele from potential pitfalls and uncertainties until the regulatory landscape is clearer.</p>\n<p>A significant driver behind these changes in the UK is the Financial Conduct Authority (FCA). The body has been proactive, focusing on establishing clearer guidelines and stricter regulations for cryptocurrency operations. The Authority&rsquo;s stated goal is to bring clarity to the sector, protect investors, and mitigate the inherent risks associated with digital assets.</p>\n<p>In the US, PayPal has a lot more challenges on its plate. The recent supervisory letter issued by the Federal Reserve was a warning to banks that are doing business with crypto companies, or who are thinking of such a move. The letter reminds the banks of exactly what their due diligence entails, and adds that all Federal Reserve controlled banks must first gain permission from the Fed before engaging with any crypto-related entity.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T11:01:40.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T10:46:39.000Z",
    "title": "SEC Chair Gary Gensler’s Tech Neutrality Claims Trigger Crypto Twitter Backlash Amid AI Promotion",
    "url": "https://www.cryptopolitan.com/sec-chair-gary-genslers-tech-neutrality/",
    "description": "In a surprising move, Gary Gensler, the chair of the U.S. Securities and Exchange Commission (SEC), has ignited a storm of controversy within the crypto community with his claims of &#8220;tech neutrality&#8221; while promoting the transformative potential of artificial intelligence (AI). Gensler&#8217;s assertions were met with skepticism and roasting on Crypto Twitter, as many users ... <a title=\"SEC Chair Gary Gensler&#8217;s Tech Neutrality Claims Trigger Crypto Twitter Backlash Amid AI Promotion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-chair-gary-genslers-tech-neutrality/\" aria-label=\"More on SEC Chair Gary Gensler&#8217;s Tech Neutrality Claims Trigger Crypto Twitter Backlash Amid AI Promotion\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T11:08:58.000Z",
    "title": "Crypto on alert as Michael Burry goes short on US Markets",
    "url": "https://crypto.news/crypto-on-alert-as-michael-burry-goes-short-on-us-markets/",
    "description": "Michael Burry, famous for predicting the 2008 crisis, stuns the market with a massive bet against the S&#38;P 500 and Nasdaq 100. But will it affect crypto? Remember Michael Burry? If you&#8217;ve watched or read &#8220;The Big Short,&#8221; his name&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T10:59:02.000Z",
    "title": "Dubai offering 90% license fee discount to web3 projects ",
    "url": "https://crypto.news/dubai-offering-90-license-fee-discount-to-web3-projects/",
    "description": "Dubai now offers web3 and artificial intelligence (AI) projects a 90% license-fee discount. The city of Dubai in the United Arab Emirates is offering a 90% subsidy on commercial licenses for artificial intelligence (AI) and web3 businesses. The tech hub&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T10:51:48.000Z",
    "title": "India probes betting platforms for crypto tax evasion",
    "url": "https://crypto.news/india-probes-betting-platforms-for-crypto-tax-evasion/",
    "description": "Indian authorities are intensifying their crackdown on gaming and betting applications using cryptos and offshore companies to evade taxes.  According to a report from The Economic Times, several agencies are investigating networks of dummy companies that allegedly use crypto assets&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-16T11:00:32.000Z",
    "title": "Crypto Telegram Bots Taking Over, Will QUBE Surpass BNB in Profits?",
    "url": "https://www.crypto-news-flash.com/crypto-telegram-bots-taking-over-will-qube-surpass-bnb-in-profits/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-telegram-bots-taking-over-will-qube-surpass-bnb-in-profits",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />InQubeta (QUBE) is expected to enjoy more growth than the Binance Coin (BNB) this year as its presale generates over $2.2 million in its early stages. Meanwhile BNB holders hope Telegram bots will be able to bring prices out of their current slump. Telegram bots have become increasingly popular in cryptocurrency spaces as it serves [...]"
  }
]