[
  {
    "source": "Cointelegraph",
    "date": "2023-08-20T05:56:31.000Z",
    "title": "Gemini files brief in lawsuit against SEC, requests to keep it simple ",
    "url": "https://cointelegraph.com/news/gemini-reply-brief-dismiss-sec-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ba399be6-f6e4-4f73-bdc7-17ed03ac3555.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a recent court filing, Gemini continues to press for dismissal in its lawsuit against the SEC, citing unclear allegations and shifting arguments. </p>\n                    <p><p>Cryptocurrency exchange Gemini has filed a reply brief as part of its effort to dismiss the lawsuit it is facing against the United States Securities and Exchange Commission (SEC).</p><p>The lawsuit alleges that “Gemini Earn” – a service enabling customers to lend crypto assets like Bitcoin (BTC) to Genesis – breached securities regulations by <a href=\"https://cointelegraph.com/news/gemini-files-to-dismiss-sec-s-lawsuit-over-its-earn-product\">offering unregistered</a> securities. </p><p>According to Aug. 18 court documents, <a href=\"https://jfblegal.egnyte.com/dl/AEuO1xtt7t/2023-08-18_(Dkt._042)_Gemini_Reply_ISO_MTD.pdf_\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> in the U.S District Court for the Southern District of New York, Gemini has argued that the SEC has failed to state a claim. </p><p>“Section 5 of the securities act is not hard to understand” the filing stated, while arguing that the SEC has not clearly pointed out the requirements for claiming a violation of the act:</p><blockquote>“The fact that the SEC cannot decide what is the security at issue only underscores the weakness of its position.”</blockquote><p>It further argued that the court shouldn't tackle the \"convoluted analyses\" presented by the SEC, but rather pose straightforward questions to determine if it qualifies as a security or not.</p><p>It prompted questions including: When was the alleged security sold? Who was the buyer? Who was the seller? What price was offered or charged?</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f088ed52-34c7-4920-8bc3-b0b386b0cc17.png\"  /><figcaption style=\"text-align: center;\"><em>Extract from the Aug. 18 court filing. Source: <a href=\"https://jfblegal.egnyte.com/dl/AEuO1xtt7t/2023-08-18_(Dkt._042)_Gemini_Reply_ISO_MTD.pdf_\" target=\"_blank\" rel=\"noopener nofollow\">JFB Legal</a></em></figcaption></figure><p><a href=\"https://cointelegraph.com/news/gemini-plans-asia-pacific-expansion-as-part-of-next-wave-of-growth-for-crypto\">Gemini also</a> contended that the SEC needs to pinpoint the unregistered security first, and then identify the sale or the offer to sell that security. Gemini claimed that the SEC has failed to fulfill this requirement. </p><p>“However, the SEC has not met that burden, and its opposition avoids the question before the court,” the filing stated.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\"><strong><em>SEC lawsuits: 68 cryptocurrencies are now seen as securities by the SEC</em></strong></a></p><p>On May 27, Gemini argued in a court filing that transactions carried out within the Gemini Earn program were essentially loans, and for the SEC to dismiss the complaint. </p><p>On Aug. 19, Jack Baugham, a founding partner of JFB Legal, which represents Gemini,  made a <a href=\"https://twitter.com/JackBaughman27/status/1692639161734369755\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> on X (formerly Twitter), suggesting that the SEC is changing its argument as the lawsuit goes on. </p><p>“The SEC is floundering. They can’t even decide what the security is,” Baugham stated, noting the confusing nature of its argument:</p><blockquote>“On the one hand, they claim that the Loan Agreement was a security. On the other hand, they claim that the entire Gemini Earn program was itself a security — an argument absurd on its face.”</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]