[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T12:00:00.000Z",
    "title": "Cross-Chain Bridge deBridge Launches App For Trading Without Liquidity Pools",
    "url": "https://www.coindesk.com/tech/2023/06/15/cross-chain-bridge-debridge-launches-app-for-trading-without-liquidity-pools/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The DLN app is now live with support for Ethereum, Arbitrum, Polygon, Fantom, BNB Chain, and Avalanche."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-15T12:00:00.000Z",
    "title": "Colombia’s Central Bank Partners with Ripple to Explore Blockchain Use Cases",
    "url": "https://www.coindesk.com/policy/2023/06/15/colombias-central-bank-partners-with-ripple-to-explore-blockchain-use-cases/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Latin American country will conduct a pilot to test Ripple's technology for its high-value payments system."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T11:57:28.000Z",
    "title": "Crypto market cap down $41B: CryptoSlate wMarket update",
    "url": "https://cryptoslate.com/crypto-market-cap-down-41b-cryptoslate-wmarket-update/",
    "description": "<p>The cryptocurrency market saw net outflows of $41.5 billion over the last 24 hours and currently stands at $1.01 trillion — down 3.9% from $1.06 trillion. During the reporting period, the market caps of Bitcoin (BTC) and Ethereum (ETH) fell 4.2% and 6.5% to $482.59 billion and $196.32 billion, respectively. Over the last 24 hours, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-market-cap-down-41b-cryptoslate-wmarket-update/\">Crypto market cap down $41B: CryptoSlate wMarket update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T12:00:00.000Z",
    "title": "Delio Suspends Withdrawals Amid Haru's Financial Irregularities",
    "url": "https://cryptodaily.co.uk/2023/06/delio-suspends-withdrawals-amid-harus-financial-irregularities",
    "description": "<p class=\"md-end-block md-p\">Korean-based cryptocurrency lending service, Delio, has temporarily suspended customer withdrawals as a consequence of financial irregularities involving crypto investment firm, Haru.</p>\n<p class=\"md-end-block md-p\">In an update on its website, Delio revealed that it had paused withdrawals due to its funds being inaccessible in Haru. This follows the recent suspension of deposits and withdrawals by Haru itself on June 13, in response to undisclosed complications with one of its service providers.</p>\n<p class=\"md-end-block md-p\">Haru, a platform that offers users up to a 12% return on its Earn Plus product, has yet to provide a detailed explanation regarding the ongoing issues with its service provider. This lack of communication and the subsequent suspension of services have led to speculation and concerns among its users, resulting in a significant surge in withdrawal requests.</p>\n<p class=\"md-end-block md-p\">Delio's CEO, Jung Sang-ho, confirmed this increase in a recent interview with Money Today. He noted that the difficulties Delio was facing resulted from a rapid increase in withdrawal requests following Haru's suspension. Jung Sang-ho also acknowledged a transactional relationship between Delio and Haru, but he refrained from commenting on the specific details, including the total amount involved.</p>\n<p class=\"md-end-block md-p\">Delio's platform offers a range of cryptocurrency lending and borrowing services, with advertised returns of up to 10.7%. According to the claims made on its website, Delio has processed transactions involving significant volumes of cryptocurrencies including 41,700 Bitcoin (valued at approximately $1 billion), 118,000 ether (valued at around $205 million), and $6.2 million worth of various altcoins.</p>\n<p class=\"md-end-block md-p\">The temporary suspension of Delio's withdrawal services has come as a shock to many in the Korean cryptocurrency market, highlighting once again the inherent risks and volatility associated with the industry. The move follows a string of similar incidents involving cryptocurrency platforms globally, underscoring the need for increased transparency, regulation, and security within the cryptocurrency market.</p>\n<p class=\"md-end-block md-p\">These incidents have drawn increased scrutiny from regulatory authorities and have prompted calls for more robust oversight and legislation to protect investors. In many parts of the world, regulators are already working on new frameworks to address these issues and ensure greater security for investors.</p>\n<p class=\"md-end-block md-p\">The events involving Delio and Haru also demonstrate the interconnected nature of many cryptocurrency platforms and services. Problems at one platform can quickly spread to others, causing a ripple effect throughout the industry. This connectivity means that issues at a single platform can lead to broader instability and lack of trust in the market as a whole.</p>\n<p class=\"md-end-block md-p\">As Delio works to resolve the current situation, users of the platform are left in a state of uncertainty, with their funds temporarily locked. The incident underscores the importance of due diligence and careful risk assessment when choosing a cryptocurrency platform, especially those offering higher-than-average returns.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p class=\"md-end-block md-p md-focus\">&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T12:11:02.000Z",
    "title": "Brazil’s new legislation sets the stage for cryptocurrency success under president Lula",
    "url": "https://www.cryptopolitan.com/brazils-new-legislation-sets-the-stage-for-cryptocurrency-success-under-president-lula/",
    "description": "In recent developments, Luiz Inácio Lula da Silva, the current president of Brazil, has emerged as a prominent figure in cryptocurrency. His recent actions have captured the public&#8217;s attention, as he has taken significant steps toward bringing clarity to the regulatory landscape surrounding digital assets in the country. One of his noteworthy achievements is the ... <a title=\"Brazil&#8217;s new legislation sets the stage for cryptocurrency success under president Lula\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brazils-new-legislation-sets-the-stage-for-cryptocurrency-success-under-president-lula/\" aria-label=\"More on Brazil&#8217;s new legislation sets the stage for cryptocurrency success under president Lula\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T11:52:30.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda&#8217;s research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T11:48:04.000Z",
    "title": "Voyager Digital set to reopen app for fund withdrawals",
    "url": "https://crypto.news/voyager-digital-set-to-reopen-app-for-fund-withdrawals/",
    "description": "Voyager Digital, the crypto brokerage firm that filed for Chapter 11 bankruptcy almost a year ago, is preparing to reopen its app and enable customers to withdraw their funds. After a long wait, users will have the opportunity to initiate withdrawals between June 20 and July 5."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T11:43:55.000Z",
    "title": "Binance goes for bitcoin cloud mining despite regulatory uncertainty",
    "url": "https://crypto.news/binance-goes-for-bitcoin-cloud-mining-despite-regulatory-uncertainty/",
    "description": "Amidst stringent regulatory scrutiny in the US, Binance is diving headfirst into the crypto mining landscape with a new subscription-based cloud mining service for bitcoin. As of June 15, the company unveiled its novel cloud mining services, catering specifically to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T12:05:18.000Z",
    "title": "Here’s Why The Tether FUD Could Be Good For Bitcoin",
    "url": "https://www.newsbtc.com/news/bitcoin/heres-why-tether-fud-could-be-good-for-bitcoin/",
    "description": "The Bitcoin market is once again in turmoil, and the reason is an old acquaintance: no, not the US Federal Reserve, but the worries and rumors about Tether&#8217;s stablecoin, USDT. Anyone who has been active in the Bitcoin and crypto market for a while knows that rumors about USDT&#8217;s lack of backing are part of every bear market. And this bear market seems to mean it particularly &#8220;well&#8221; as the Tether FUD is now making a reappearance in this cycle. As NewsBTC reported earlier today, USDT has slightly lost its peg to the US dollar as the Curve 3Pool has lost its balance. The reason for this is that whales are selling USDT and trading it for USDC as well as DAI. However, according to Tether CTO Paolo Arduino, the company is &#8220;ready to redeem any amount 1:1 against US dollars&#8221;. Historically, the de-pegging of USDT is not an uncommon occurrence. Samson Mow, CEO of Bitcoin focused company JAN3, writes: Tether FUD is always the FUD bottom. It&#8217;s what they pull out when there&#8217;s nothing left. Up soon. Analyst Miles Deutscher has a similar view. He explained: &#8220;Fun Fact: Stablecoin FUD often marks local bottoms,&#8221; and shared the following chart. Bottom Signal For The Bitcoin Price? As can be seen in the chart, the Tether FUD first surfaced at the end of June 2022. At the time, news emerged that hedge fund Fir Tree Capital Management was shorting Tether after the Terra ecosystem stablecoin Terra USD collapsed. Contrary to speculation, however, Tether was able to process all USDT redemptions, even though the value of USDT had fallen to $0.9520 temporarily. Related Reading: Tether (USDT) De-Pegs As Crypto Market Stumbles, More Downside Coming? In mid-November 2022, the cryptocurrency exchange FTX went bankrupt after its competitor Binance backed out of a purchase agreement. The Tether FUD hit a 6-month high and the price of USDT fell to $0.9970. Again, Tether was able to handle all redemptions, while the market found a local bottom. Most recently, USDC depegging provided the local bottom signal in March this year. The event was caused by the collapse of the counterparty from stablecoin issuer Circle, Silicon Valley Bank (SVB). Crypto whales had also tried to take profits from the situation at the time, while other USDC holders sold out of panic. Related Reading: Bitcoin Price Hammered Below $25,000 Amid Fed’s Hawkish Tone, SEC Lawsuits Tether emerged as the clear winner from the latter situation and was able to capture large market shares from USDC since then. Most recently, Tether reported huge profits, some of which they are investing in Bitcoin, as NewsBTC reported. This is another reason why crypto expert Thor Hartvigsen believes that the likelihood of Tether not having enough funds to settle all USDT redemptions is &#8220;pretty low&#8221;, adding: &#8220;According to Tether, the company made $1.48b in profits in Q1 alone which brought the reserve surplus to $2.44b. They&#8217;ve further been winding down bank deposits (hold less than $0.5b here) and acquired over $53b in US treasuries throughout 2022.&#8221; Remarkably, the price of USDT has already returned to its default level at press time. After the USDC/ USDT price on Binance climbed temporarily to $1.0042, it was now already back at $1.0019. As of press time, the Bitcoin price was bucking the Tether FUD and holding slightly above $25,000. However, the drop below the 200-day EMA (blue line) is somewhat critical. Most recently, BTC fell below this indicator which is known as the &#8220;bull line&#8221; during the USDC de-pegging. Therefore, Bitcoin bulls are advised to stage a similar reaction as in March to prevent a further plunge. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T12:00:09.000Z",
    "title": "35x Growth Collateral Network Is Set To Surpass Aptos and Hedera by 2024",
    "url": "https://www.crypto-news-flash.com/35x-growth-collateral-network-is-set-to-surpass-aptos-and-hedera-by-2024/?utm_source=rss&utm_medium=rss&utm_campaign=35x-growth-collateral-network-is-set-to-surpass-aptos-and-hedera-by-2024",
    "description": "In the dynamic world of cryptocurrencies, Collateral Network (COLT) is making waves with its upcoming presale. This Ethereum-based lending platform is set to disrupt the crypto market, potentially outperforming established projects like Aptos (APT) and Hedera (HBAR).  &#62;&#62;BUY COLT TOKENS NOW&#60;&#60; Aptos &#8211; A Rising Star in the Crypto Space Aptos, a project that has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T11:42:35.000Z",
    "title": "Coinbase in Rage as SEC Delays Response – Regulatory Clarity for Crypto Industry Postponed Again",
    "url": "https://www.crypto-news-flash.com/coinbase-in-rage-as-sec-delays-response-regulatory-clarity-for-crypto-industry-postponed-again/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-in-rage-as-sec-delays-response-regulatory-clarity-for-crypto-industry-postponed-again",
    "description": "The U.S. Securities and Exchange Commission (SEC) responded to Coinbase&#8217;s request for regulatory clarity, indicating that it would take at least four months to provide a recommendation on Coinbase&#8217;s rulemaking petition. Coinbase&#8217;s chief of Legal Paul Grewal slammed the SEC stating that &#8220;they have no intent to issue new rules, and instead conflate the evidence&#8221;. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T11:50:12.000Z",
    "title": "BYDFi Exchange Review 2023: Features, Trading Options, Fees, and More",
    "url": "https://coinedition.com/bydfi-exchange-review/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BYDFi-Exchange-Review-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BYDFi-Exchange-Review\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BYDFi-Exchange-Review-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BYDFi-Exchange-Review-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BYDFi-Exchange-Review.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Introduction In the dynamic realm of cryptocurrencies, navigating the complexities and uncertainties can be a significant challenge for traders and investors. From limited trading options to security concerns, the industry poses various obstacles that demand innovative solutions. This review aims to shed light on BYDFi, a centralized crypto exchange that strives to redefine how traders [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bydfi-exchange-review/\">BYDFi Exchange Review 2023: Features, Trading Options, Fees, and More</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T11:46:57.000Z",
    "title": "USDT Pressured as USDC/USDT Pair on Binance Hits 2022 Highest Level",
    "url": "https://coinedition.com/usdt-pressured-as-usdc-usdt-pair-on-binance-hits-2022-highest-level/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/binance4-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/binance4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/binance4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/binance4.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In recent developments, the USDC/USDT trading pair on Binance has been experiencing a remarkable upward trend, reaching $1.0034, marking the highest level since June 13, 2022. Concurrently, USDT saw a slight decline of 0.3%. This surge in the USDC/USDT pair comes alongside a shifting market landscape as USDT’s dominance within the Curve 3pool diminishes. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/usdt-pressured-as-usdc-usdt-pair-on-binance-hits-2022-highest-level/\">USDT Pressured as USDC/USDT Pair on Binance Hits 2022 Highest Level</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T11:45:10.000Z",
    "title": "One Catalyst Will Trigger Bitcoin To Explode by Over 900%, Predicts MicroStrategy Founder Michael Saylor",
    "url": "https://dailyhodl.com/2023/06/15/one-catalyst-will-trigger-bitcoin-to-explode-by-over-900-predicts-microstrategy-founder-michael-saylor/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>MicroStrategy founder and executive chairman Michael Saylor says he&#8217;s bullish on Bitcoin (BTC) following the U.S. Securities and Exchange Commission’s (SEC) claims that a number of high-profile crypto assets are securities. In a new Bloomberg interview, Saylor says that a massive rise in value is likely in the cards for Bitcoin now that the general public [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/one-catalyst-will-trigger-bitcoin-to-explode-by-over-900-predicts-microstrategy-founder-michael-saylor/\">One Catalyst Will Trigger Bitcoin To Explode by Over 900%, Predicts MicroStrategy Founder Michael Saylor</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]