[
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T05:15:57.000Z",
    "title": "31% of young Aussies hold crypto despite being ‘risk averse’ — ASX survey",
    "url": "https://cointelegraph.com/news/31-percent-young-australians-hold-crypto-asx-survey",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/bbd3b566-80a3-4835-a4b9-ef636ea09eb4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While young Australians are more interested in crypto, it’s the 25 to 49 year-olds who own the most. </p>\n                    <p><p>Despite seeing themselves as more “risk averse” than their older counterparts, nearly a third of all young Australian investors hold or have traded cryptocurrencies over the last year, a new study has found.</p><p>In an Australian investor <a href=\"https://www2.asx.com.au/content/dam/asx/blog/asx-australian-investor-study-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">study</a> from the Australian Securities Exchange (ASX), 46% of “next generation investors” — the report’s terminology for investors aged 18 to 24 — described themselves as preferring “stable returns” — yet 31% of them invested substantially in crypto.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/780fb93a-c175-4adf-b9a1-017cd1f73812.png\"  /><figcaption style=\"text-align: center;\"><em>Attitude towards investment risk by age group. Source: ASX.</em></figcaption></figure><p>“The apparent financial conservatism of younger investors is at odds with their level of investment in cryptocurrency,” the report wrote. </p><p>Researchers said the reason that younger people invested in crypto boiled down to a desire to do things differently from their parents combined with the observation that “many of the 1.2 million new investors who've taken up investing since 2020 are tech-savvy and connected to social media.”</p><p>According to ASX’s study, which was undertaken by financial research firm Investment Trends, the median holding of cryptocurrency for “next generation” investors stands at $2,700, representing a 6% weight in their total portfolio, double that of the 3% crypto allocation for all other investor age groups. </p><p>However, while young investors owned the most crypto relative to their portfolios, it was the “wealth accumulators” — investors aged 25 to 49 — who owned the most cryptocurrency overall, accounting for 69% of the total investment in digital assets. Investors aged 50+ accounted for just 19% of overall crypto ownership. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/51e11393-54ab-45b3-91b2-74088ba36da7.png\"  /><figcaption style=\"text-align: center;\"><em>Overall crypto investment snapshot for Australian investors. Source: ASX.</em></figcaption></figure><p>This report marked the first time that cryptocurrency had been included as an asset class in the ASX’s Australian Investor Study. As such, the report approached the subject with a degree of caution, saying it’s still up for debate whether cryptocurrencies can become “fully accepted in mainstream investing.”</p><p>Still, the study admitted that despite its volatility, cryptocurrency remains a popular choice among investors, revealing that 29% of all “intending investors” — people who don’t currently invest in any capacity — are considering some type of crypto investment within the next 12 months. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/australia-crypto-regulations-lag-emerging-markets-think-tank\"><strong><em>Australia's crypto laws risk being outpaced by emerging markets: Think tank</em></strong></a></p><p>Notably, centralized crypto exchanges were singled out as a potential “handbrake” for the growth of crypto investment in the future. </p><p>The United States Securities and Exchange Commission’s <a href=\"https://cointelegraph.com/news/sec-charges-binance-coinbase-terrible-defi\">recent spate of legal action</a> against exchange giants <a href=\"https://cointelegraph.com/tags/coinbase\">Coinbase</a> and <a href=\"https://cointelegraph.com/tags/binance\">Binance</a> in the United States stands as a clear example of challenges facing centralized exchanges.</p><p>Australia's crypto exchanges have also faced challenges in recent months. In May, <a href=\"https://cointelegraph.com/news/binance-suspends-aud-services\">Binance Australia announced it is suspending</a> all Australian Dollar-denominated services in June after its local payments provider was ordered to halt support for the exchange. On the same day, Australia's second-largest bank Westpac banned customers from transacting with the exchange. </p><p>The following month, Commonwealth Bank — Australia's largest bank — said it may decline certain payments to crypto exchanges citing a \"high risk\" of scams. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The biggest bank in Australia, <a href=\"https://twitter.com/CommBank?ref_src=twsrc%5Etfw\">@CommBank</a> has just taken a giant step backward. They are blocking crypto transactions &quot;for our safety&quot;. <a href=\"https://t.co/4tsddbNPg8\">pic.twitter.com/4tsddbNPg8</a></p>&mdash; Charles Edwards (@caprioleio) <a href=\"https://twitter.com/caprioleio/status/1669225244463353858?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The research for the ASX’s report was conducted in November 2022, and based its findings on an in-depth online survey of a sample of 5,519 Australian adults. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction — What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T05:30:35.000Z",
    "title": "Bangladesh Eyes BRICS Invite as Rumors Swirl of Formal Request",
    "url": "https://news.bitcoin.com/bangladesh-eyes-brics-invite-as-rumors-swirl-of-formal-request/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bangladesh Eyes BRICS Invite as Rumors Swirl of Formal Request\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bang.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In mid-May, several reports indicated that Bangladesh and India were engaging in currency trading using their respective currencies in order to address U.S. dollar liquidity challenges. Recent sources now reveal that Bangladesh is welcoming a formal invitation to join the BRICS bloc. Speaking to reporters on Monday, AK Abdul Momen, the foreign minister of Bangladesh, [&#8230;]"
  }
]