[
  {
    "source": "CoinDesk",
    "date": "2023-06-29T08:48:20.000Z",
    "title": "FTX Customers Have Until End-September to Submit Bankruptcy Claims",
    "url": "https://www.coindesk.com/business/2023/06/29/ftx-customers-have-until-end-september-to-submit-claims/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Former customers will receive an email containing a link to the Customer Claims Portal."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-29T09:03:50.000Z",
    "title": "Tether partners with Georgia to foster digital asset ecosystem",
    "url": "https://cryptodaily.co.uk/2023/06/tether-partners-with-georgia-to-foster-digital-asset-ecosystem",
    "description": "<p>Tether has recently inked a Memorandum of Understanding (MOU) with the Government of Georgia which will position Georgia as a central nucleus for blockchain and peer-to-peer technology.&nbsp;</p>\n<p>Paolo Ardoino, Tether's visionary Chief Technology Officer, expressed his enthusiasm for the alliance with the Government of Georgia, underscoring the shared ambition of cultivating a thriving environment for peer-to-peer technology. Ardoino remarked,&nbsp;</p>\n\n<p>\"This remarkable collaboration not only signifies a significant milestone for Tether but also bolsters its standing as a pioneering infrastructure partner for cities and nations worldwide. In an ever-evolving digital realm, Tether recognizes the vital importance of embracing change and expanding its offerings beyond stability. Armed with a profound comprehension of cryptocurrencies' potential, Tether seeks to empower cities and facilitate the widespread adoption of cutting-edge blockchain technologies like bitcoin, as well as innovative peer-to-peer solutions such as Keet and Holepunch.\"</p>\n\n<p>The partnership will place considerable focus on cultivating a thriving startup ecosystem within Georgia. By showcasing the nation's favourable working conditions and good quality of life, Tether and the Government of Georgia aspire to attract international attention and investment, thereby stimulating the growth and success of groundbreaking startups operating in the blockchain arena.</p>\n<p>Irakli Nadareishvili, the Deputy Minister of Economy and Sustainable Development, highlighted Tether's keen interest in investing in Georgia and revealed the organisation's plans to establish a special fund dedicated to supporting local startups in their pursuit of developing innovative blockchain technologies.&nbsp;</p>\n\n<p>Nadareishvili explained, \"Furthermore, we have reached an agreement to collaborate in the educational sphere, particularly in the domain of blockchain technology. This collaboration will significantly contribute to the growth of local blockchain technologies within the country, as well as the influx of companies operating in this sector to Georgia.\"</p>\n\n<p>The partners plan to establish a dedicated fund that will provide investments and grants to startups focused on developing blockchain-based services, aiming not only to bolster domestic startups but also to foster extensive international collaborations.</p>\n<p>Tether and the Government of Georgia are committed to exploring the development and implementation of an independent communication and financial system.&nbsp;</p>\n<p>By leveraging the inherent transparency and security of blockchain systems, this dynamic partnership aspires to revolutionise public administration and the private sector, guaranteeing the delivery of effective and dependable services to citizens.</p>\n<p>In addition, Tether and the Georgian government will collaborate closely with local academic institutions, including the BTU&mdash;a technological university and research centre in Georgia.&nbsp;</p>\n<p>The collaborative efforts will be directed towards the development of educational programs on blockchain technology, stablecoins, and peer-to-peer systems.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T08:57:16.000Z",
    "title": "Biden’s crypto crackdown escalates with traders’ loopholes slashed to promote fair tax",
    "url": "https://www.cryptopolitan.com/biden-crypto-crackdown-to-promote-fair-tax/",
    "description": "The U.S. President, Joe Biden, pledged to target cryptocurrency traders and hedge fund managers in his economic policy speech where he talked about Bidenomics. The president&#8217;s speech in Chicago yesterday highlighted the vision for &#8220;Bidenomics,&#8221; a catchall term referring to his investment strategy to boost the middle class and increase competition to reduce the costs ... <a title=\"Biden&#8217;s crypto crackdown escalates with traders&#8217; loopholes slashed to promote fair tax\" class=\"read-more\" href=\"https://www.cryptopolitan.com/biden-crypto-crackdown-to-promote-fair-tax/\" aria-label=\"More on Biden&#8217;s crypto crackdown escalates with traders&#8217; loopholes slashed to promote fair tax\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-29T08:54:23.000Z",
    "title": "US president Biden hints at crypto regulation in latest speech",
    "url": "https://crypto.news/us-president-biden-hints-at-crypto-regulation-in-latest-speech/",
    "description": "US President Joe Biden pointed out the loopholes in the crypto industry at the Bidenomics in Chicago, Illinois, on June 28. In the first part of his speech, the US president emphasized the country’s infrastructure and the creation of 13.4&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T09:04:00.000Z",
    "title": "$62.9B Industry Giant to Add Shiba Inu Trading to Their Platform – Can SHIB Eliminate Another Zero and Surge to $0.0001?",
    "url": "https://www.crypto-news-flash.com/62-9b-industry-giant-to-add-shiba-inu-trading-to-their-platform-can-shib-eliminate-another-zero-and-surge-to-0-0001/?utm_source=rss&utm_medium=rss&utm_campaign=62-9b-industry-giant-to-add-shiba-inu-trading-to-their-platform-can-shib-eliminate-another-zero-and-surge-to-0-0001",
    "description": "SBI Group, a prominent industry giant valued at $62.9 billion, plans to introduce Shiba Inu (SHIB) trading on their platform. The addition of SHIB trading on the platform signifies a significant development for the cryptocurrency, increasing its accessibility and potential market value. Exciting news has emerged from the crypto market as SBI Group, a prominent [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T09:00:19.000Z",
    "title": "Bitcoin Exchange-Traded Fund Pushes Bitcoin (BTC) Over $30,000, As DigiToads Presale (TOADS) Generates Major Buzz",
    "url": "https://www.crypto-news-flash.com/bitcoin-exchange-traded-fund-pushes-bitcoin-btc-over-30000-as-digitoads-presale-toads-generates-major-buzz/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-exchange-traded-fund-pushes-bitcoin-btc-over-30000-as-digitoads-presale-toads-generates-major-buzz",
    "description": "Investing in cryptocurrencies has improved the financial stage as Bitcoin (BTC), the giant of digital currencies, smashes through the long-anticipated $30,000 threshold. This price rally is due to the recent rush for the Spot Bitcoin Exchange-Traded Fund (ETF). In a display of its dominance, Bitcoin continues to convince skeptics and investors, but the rush doesn&#8217;t [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-29T09:02:38.000Z",
    "title": "Top 4 EXPLOSIVE Crypto in Injective Ecosystem",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-4-explosive-crypto-in-injective-ecosystem/",
    "description": "<p>500% up. Isn&#8217;t that Huge? And that makes Injective one of the best-performing assets of the year 2023. What makes Injective even more interesting is that it is expected to maintain its bullish momentum. In fact, CoinCodex has made a bold prediction of INJ rallying 126% in the next 29 days.  All this is happening due [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-4-explosive-crypto-in-injective-ecosystem/\">Top 4 EXPLOSIVE Crypto in Injective Ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-29T08:54:22.000Z",
    "title": "Smart Whale’s Ethereum (ETH) Sell-off Impacts the Altcoin’s Price",
    "url": "https://coinedition.com/smart-whales-ethereum-eth-sell-off-impacts-the-altcoins-price/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/05-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/05-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/05-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/05-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/05-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/05-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/05-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/05-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/05-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/05-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/05-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/05-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/05-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/05-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/05-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/05-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/05-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The on-chain analysis platform, Lookonchain, shared in a twitter post yesterday that a whale deposited 25K Ethereum (ETH) to Binance. In a separate post from Lookonchain, the platform explained that ETH’s price drop over the past 11 hours was most likely caused by a sell-off performed by this particular whale. It is estimated that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/smart-whales-ethereum-eth-sell-off-impacts-the-altcoins-price/\">Smart Whale’s Ethereum (ETH) Sell-off Impacts the Altcoin’s Price</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]