[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T19:50:21.000Z",
    "title": "Gary Gensler’s Evolving Position on Crypto – in Quotes",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/06/gary-genslers-evolving-position-on-crypto-in-quotes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC chair has gone from supporting the technology at MIT to a full-swing offensive on the crypto industry."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T19:52:45.000Z",
    "title": "Ignoring Disruptive Blockchain Companies Is a 'Fundamental Mistake': Amplify ETFs",
    "url": "https://decrypt.co/143591/ignoring-disruptive-blockchain-companies-fundamental-mistake-amplify-blok-etf",
    "description": "As crypto markets see another dramatic turn of events, some digital asset managers are still betting on Bitcoin miners and other tech disruptors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T19:45:00.000Z",
    "title": "Crypto traders avoid risk and shelter in stablecoins as the market reaches a turning point",
    "url": "https://cointelegraph.com/news/crypto-traders-avoid-risk-and-shelter-in-stablecoins-as-the-market-reaches-a-turning-point",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/bff56e37-009d-4834-a211-427b42521c5c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On-chain data from Glassnode shows market participants averting risk and seeking shelter in stablecoins and BTC as the crypto market nears a decisive move.</p>\n                    <p><p>On-chain analytics firm Glassnode <a href=\"https://insights.glassnode.com/the-week-onchain-week-23-2023/\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a report hinting that investors are rotating capital toward risk-off assets like stablecoins and Bitcoin. Technicals show that altcoins are at a crucial turning point between a positive and a negative breakout.</p><p>Glassnode’s analysis of Uniswap and futures trading volumes reveals that the uptrend that began in <a href=\"https://cointelegraph.com/news/bitcoin-price-briefly-hits-29k-despite-regulatory-crackdowns\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-briefly-hits-29k-despite-regulatory-crackdowns/amp\">the first quarter of 2023</a> began cooling off in April, with regulatory concerns and a <a href=\"https://cointelegraph.com/news/bitcoin-liquidity-drops-to-10-month-low-amid-us-bank-run\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-liquidity-drops-to-10-month-low-amid-us-bank-run/amp\">lack of liquidity</a> promoting risk-off tendencies among traders.</p><p>The report stated that while it might appear that memecoins caused a surge in Uniswap’s trading volume, a closer look at Uniswap’s pools reveals that the majority of volume was for top cryptocurrencies in Wrapped BTC, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and stablecoins. </p><p>Moreover, <a href=\"https://cointelegraph.com/news/subway-themed-trading-bot-makes-millions-using-sandwich-attacks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/subway-themed-trading-bot-makes-millions-using-sandwich-attacks/amp\">sandwich attacks</a><a href=\"https://cointelegraph.com/news/subway-themed-trading-bot-makes-millions-using-sandwich-attacks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/subway-themed-trading-bot-makes-millions-using-sandwich-attacks/amp\"> and bot trading</a> accounted for a significant amount of this trading activity. The report read:</p><p>“If we take into account that many bots engage in arbitrage or sandwich attacks, the degree of ‘organic’ trading volume on Uniswap may well account for over two-thirds of all DEX activity.”</p><p>The futures trading volumes for Ether on centralized exchanges contracted in May, with 30-day average trading volumes dropping to $12 billion per day against a yearly average of $21.5 billion. </p><p>Glassnode analysts suggested that the decline in futures trading volumes is a sign that “institutional trading interest and liquidity remains quite weak.”</p><p>Similarly, the market share for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) perpetuals versus their Ether counterparts shows a huge discrepancy, with 65.5% dominance for Bitcoin. In 2022, the two assets had equal shares in the perpetual swap space. However, the trend has shifted significantly in the last year. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/acf58e35-b060-4339-8191-eeae1b2ca60b.JPG\"><figcaption style=\"text-align: center;\"><em>BTC vs ETH perpetual volume dominance. Source: Glassnode</em></figcaption></figure><p>Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) has absorbed a significant proportion of outflows from Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>) and Circle’s USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>), pushing USDT to a new all-time high supply of $83.1 billion.</p><p>In the crypto market, capital usually flows from the majors, like Bitcoin and Ether, into altcoins. However, the above trends show that, lately, the capital rotation is happening away from high-risk altcoins toward low-risk assets like stablecoins and Bitcoin.</p><h2>Bitcoin’s relative strength versus altcoin price momentum </h2><p>Technically, Bitcoin’s dominance percentage over the crypto market, which measures the share of Bitcoin’s market capitalization in the total crypto valuation, experienced an uptrend in 2023 before encountering resistance at the 48.35% level.</p><p>If Bitcoin buyers are unable to break out above this resistance, the market can expect an altcoin rally relative to Bitcoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5872cec6-3c3e-48d5-b90f-64d1622629e4.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin dominance over the crypto market. Source: TradingView</em></figcaption></figure><p>On the other hand, the TOTAL2 chart, which measures the market capitalization of the cryptocurrency market excluding Bitcoin, had its positive breakout from the triangle pattern reversed, pushing the index back into a bearish triangle pattern that started forming in October 2022. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-gas-fees-cool-down-after-may-memecoin-frenzy\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-gas-fees-cool-down-after-may-memecoin-frenzy/amp\"><strong><em>Ethereum gas fees cool down after May memecoin frenzy</em></strong></a></p><p>Currently, the total market capitalization of altcoins is bound by a bearish descending triangle pattern with lower highs and a parallel support level of $433.39 billion. The selling would likely accelerate below this level. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bedb7bb9-705f-4a76-9aa3-209d62b7dbaa.png\"><figcaption style=\"text-align: center;\"><em>The market capitalization of cryptocurrencies excluding Bitcoin. Source: TradingView</em></figcaption></figure><p>If buyers push higher by building support above the parallel resistance at $616.35 billion by weekly closing, altcoins could continue to head higher over the next few weeks.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T19:40:37.000Z",
    "title": "Google Cloud launches free courses to help users build their own GPT-style AI",
    "url": "https://cointelegraph.com/news/google-cloud-launches-free-courses-to-help-users-build-their-own-gpt-style-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/137f48a7-f98b-4888-aa17-02520036d5de.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new corpus includes nine courses and a set of labs that students can complete to earn a Google Cloud skills badge.</p>\n                    <p><p>Google Cloud recently <a href=\"https://www.cloudskillsboost.google/paths/118\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> a suite of free online educational courses designed to teach the fundamentals of generative artificial intelligence (AI) systems, as well as provide an introduction to the Generative AI Studio development environment.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Learn more about <a href=\"https://twitter.com/hashtag/generativeAI?src=hash&ref_src=twsrc%5Etfw\">#generativeAI</a> at no cost! <br><br>This Google Cloud Skills Boost learning path will teach you the foundational knowledge to understand Generative AI and Google Cloud’s approach to this transformative technology → <a href=\"https://t.co/uLeaKNpq67\">https://t.co/uLeaKNpq67</a> <a href=\"https://t.co/nRW1kcMZCR\">pic.twitter.com/nRW1kcMZCR</a></p>— Google Cloud (@googlecloud) <a href=\"https://twitter.com/googlecloud/status/1665389703619641345?ref_src=twsrc%5Etfw\">June 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Generative AI systems have become a global industry <a href=\"https://cointelegraph.com/news/this-ai-chatbot-is-either-an-exploiter-s-dream-or-their-nightmare\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/this-ai-chatbot-is-either-an-exploiter-s-dream-or-their-nightmare/amp\">since the launch of OpenAI’s ChatGPT system</a> in November 2022. In the time since, Microsoft, Google, Amazon, Baidu and countless other tech outfits have sought to capitalize on the public fervor for large language models and image generators. </p><p>The new Google Cloud corpus comprises nine separate modules, including introductory courses in generative AI, large language models, responsible AI, image generation and Generative AI Studio. It also takes students on a deeper dive into important generative AI concepts such as encoder-decoder architecture, attention mechanism, transformer and BERT models, and how to create image captioning models. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/7-chatgpt-plugins\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/7-chatgpt-plugins/amp\"><strong><em>7 ChatGPT plugins to enhance productivity</em></strong></a></p><p>The offerings end with a “quest” featuring labs and timed assignments, which students can complete in order to earn a Generative AI Explorer–Vertex AI badge. </p><p>According to Google Cloud, the courses should provide a sufficient introduction to the topic of generative AI to teach users the fundamentals and set them on the path to creating, training and deploying their own foundational models:</p><blockquote>“This learning path guides you through a curated collection of content on Generative AI products and technologies, from the fundamentals of Large Language Models to how to create and deploy generative AI solutions on Google Cloud.”</blockquote><p>Generative AI models have become a mainstay in the cryptocurrency and blockchain sectors recently. While their <a href=\"https://cointelegraph.com/news/elliptic-chat-gpt-crypto-risk-detection\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elliptic-chat-gpt-crypto-risk-detection/amp\">use cases as trading bots and data management assistants</a> are well-documented, ChatGPT and other models also serve as educational conduits. </p><p>According to <a href=\"https://cointelegraph.com/news/ai-related-crypto-returns-rose-up-to-41-after-chatgpt-launched-study\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ai-related-crypto-returns-rose-up-to-41-after-chatgpt-launched-study/amp\">researchers from the Blockchain Research Lab</a> in Hamburg, Germany, the proliferation of ChatGPT and similar AI systems may be a contributing factor in the ongoing rise in global cryptocurrency adoption, thanks to their ability to explain complex concepts to the general public.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T20:05:24.000Z",
    "title": "Do Kwon Released on Bail After Request Approved",
    "url": "https://cryptodaily.co.uk/2023/06/do-kwon-released-on-bail-after-request-approved",
    "description": "<p>Terra founder Do Kwon has been released on bail after a Montenegrin court handling his passport forgery case accepted his 400,000-euro request. </p>\n<p>According to an announcement, a Montenegro High Court granted Do Kwon bail after accepting his 400,000-euro request. The decision comes after a previous approval was overturned on May 25. &nbsp;</p>\n<p>An official release from the Basic Court in Podgorica stated that an appeal against an earlier bail agreement by the State Prosecutor&rsquo;s Office was set aside. The decision means that Kwon and his fellow accused, Han Chang-Joon, can await further legal proceedings under house arrest in Montenegro.</p>\n<p>The value of their property has complicated the decisions regarding the defendant&rsquo;s bail request. During the initial bail hearing on May 11, Kwon and Chang-Joon told the court that they had &ldquo;property worth millions.&rdquo; A High Court, however, disputed the value, and their bail was revoked. The High Court argued that the lower court could not accept the property&rsquo;s value &ldquo;based on their statements, but only concrete evidence.&rdquo;</p>\n<p>The value of the property has been verified after evaluation using a sales contract, bank account statements, and invoices.</p>\n<p>The Court said:</p>\n\n<p>The court appreciated the fact that they are persons who are not Montenegrin citizens, which is why it accepted their statements about the value of the property they own, which were supported by concrete evidence.</p>\n\n<p>It concluded by saying:</p>\n\n<p>The possibility of losing the security deposit in the amount of EUR 400,000.00 each had a sufficiently discouraging effect on the defendants to dissuade them from any desire to escape.</p>\n\nKwon and Chang-Joon Arrested in Montenegro\n<p>The pair were arrested at an airport in the capital of Podgorica on March 23 as they tried to board a flight to Dubai using falsified travel documents. Kwon and Chang-Joon were charged with forging official documents.</p>\n<p>Shortly after their arrest, the United States and South Korean authorities announced that they were seeking the extradition of Kwon. US federal prosecutors indicted Kwon with two counts each of securities fraud, wire fraud, commodities fraud, and conspiracy.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T20:03:40.000Z",
    "title": "Louis Vuitton digitizes iconic trunk as NFT",
    "url": "https://www.cryptopolitan.com/louis-vuitton-digitizes-iconic-trunk-as-nft/",
    "description": "The fusion of the physical and digital world, known as the &#8220;phygital&#8221; realm, has been increasingly embraced by the fashion industry. The latest notable stride in this direction is Louis Vuitton&#8217;s reimagining of its quintessential travel trunk as a nonfungible token (NFT), named the VIA Treasure Trunk. Blockchain technology, characterized by its transparency and irrefutable ... <a title=\"Louis Vuitton digitizes iconic trunk as NFT\" class=\"read-more\" href=\"https://www.cryptopolitan.com/louis-vuitton-digitizes-iconic-trunk-as-nft/\" aria-label=\"More on Louis Vuitton digitizes iconic trunk as NFT\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T20:00:49.000Z",
    "title": "Bitcoin (BTC) Rollercoaster Ride: Is $23,000 The End Of The Line?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-btc-rollercoaster-ride-is-22800-the-end-of-the-line/",
    "description": "Bitcoin (BTC) has experienced a negative reaction following the SEC&#8217;s continued crackdown on the crypto industry. The regulatory body recently filed a complaint against the largest exchange in the industry, Binance, contributing to Bitcoin&#8217;s decline.  However, there may be a glimmer of hope for the cryptocurrency, as it has managed to recover the $26,000 level. This is an important threshold for Bitcoin, as it must maintain this level if it hopes to continue its uptrend. Despite visiting lower lows of $25,300, Bitcoin has managed to bounce back from the 200-day Moving Average (MA). This is significant because the 200-day MA has historically been a strong support level for Bitcoin. In other words, when BTC&#8217;s price has dropped to this level, it has often bounced back up. This suggests bullish sentiment in the market, as traders continue to see value in buying Bitcoin at this price point. Related Reading: KAVA Holds In Green Despite Bears Taking Control Of Crypto Market Expert Discuss Potential Bottoms At $24,000 And $23,000 However, renowned crypto analyst, Altcoin Sherpa, has weighed in on the current state of the Bitcoin market, sharing insights into where the bottom might be. According to Altcoin Sherpa, Bitcoin has been experiencing a lot of support at the $25,000 level, holding up well despite recent market fluctuations. However, he believes there could be even lower levels of liquidity in the market, which could impact Bitcoin&#8217;s price shortly. Altcoin Sherpa points out interesting support areas at the $23,000 and $24,000 levels, potentially serving as a bottom for Bitcoin. However, he advises investors to be patient and wait for the market to find some consolidation before making any investment decisions. The analyst notes that the &#8216;bottom&#8217; should take time, and investors should look for signs of consolidation before making any moves. He also suggests that it may not be the right time to buy alts or BTC at the current level and that a more cautious approach may be warranted. Bitcoin Faces Critical Test Following the same line, crypto analyst Justin Bennet said the $26,500 level had become resistance after yesterday&#8217;s breakdown. The key support area for the week ahead is $25,200, a level that served as resistance for Bitcoin. Bennet expects this to be a significant test for the market, with the potential for ranging price action between $25,200 and $26,500. Bennet advises traders to wait for a confirmed deviation below the $25,200 support level, with channel support near $24,300 serving as a potential technical catalyst. If Bitcoin reclaims the $25,200 level, traders can consider longing BTC within the range. Alternatively, an immediate retest of $26,500 could offer a favorable short opportunity with targets of $25,200 and $24,000. Related Reading: Gateway Issues Cause Withdrawal And Deposit Delays For Kraken Exchange Furthermore, Bennet notes that the path for Bitcoin remains uncertain, but a reclaim of $26,500 would confirm a deviation and expose $27,500.  Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T20:03:34.000Z",
    "title": "Litecoin’s Halving Hype and Ethereum’s Breakout Potential: Analyst Sets Ambitious Targets for Crypto Giants",
    "url": "https://www.crypto-news-flash.com/litecoins-halving-hype-and-ethereums-breakout-potential-analyst-sets-ambitious-targets-for-crypto-giants/?utm_source=rss&utm_medium=rss&utm_campaign=litecoins-halving-hype-and-ethereums-breakout-potential-analyst-sets-ambitious-targets-for-crypto-giants",
    "description": "<p>The potential of Litecoin to retest new highs was analyzed by analyst, Michaël van de Poppe. The analysis also extends to Ethereum following the breakout of DeFi and NFTs. While Litecoin (LTC) halving has grabbed headlines, renowned analyst Michaël van de Poppe has predicted that both Litecoin and Ethereum (ETH) are on the verge of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/litecoins-halving-hype-and-ethereums-breakout-potential-analyst-sets-ambitious-targets-for-crypto-giants/\">Litecoin&#8217;s Halving Hype and Ethereum&#8217;s Breakout Potential: Analyst Sets Ambitious Targets for Crypto Giants</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T19:57:31.000Z",
    "title": "Render (RNDR) And Cosmos Hub (ATOM) Experience A Surge As Uwerx Presale Keeps Climbing",
    "url": "https://www.crypto-news-flash.com/render-rndr-and-cosmos-hub-atom-experience-a-surge-as-uwerx-presale-keeps-climbing/?utm_source=rss&utm_medium=rss&utm_campaign=render-rndr-and-cosmos-hub-atom-experience-a-surge-as-uwerx-presale-keeps-climbing",
    "description": "<p>The latest cryptocurrency market trends can overwhelm or confuse investors looking for tokens with the highest potential for gains. This article will discuss three crypto coins with the potential for long-term gains and how their current positions in the market affect investors. Render (RNDR) Is Still Keeping Investors Happy Render (RNDR) is a blockchain protocol [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/render-rndr-and-cosmos-hub-atom-experience-a-surge-as-uwerx-presale-keeps-climbing/\">Render (RNDR) And Cosmos Hub (ATOM) Experience A Surge As Uwerx Presale Keeps Climbing</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T20:00:32.000Z",
    "title": "Largest Bitcoin Whales ‘Aggressively’ Accumulating BTC, Says Analytics Firm Glassnode – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/06/06/largest-bitcoin-whales-aggressively-accumulating-btc-says-analytics-firm-glassnode-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest non-exchange Bitcoin (BTC) whales have been &#8220;aggressively&#8221; accumulating the top digital asset for the last month and a half, according to the crypto analytics platform Glassnode. Glassnode also notes, however, that all other sizes of non-exchange BTC owners have been unloading their Bitcoin holdings across that same time period. &#8220;An interesting dichotomy across the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/largest-bitcoin-whales-aggressively-accumulating-btc-says-analytics-firm-glassnode-but-theres-a-catch/\">Largest Bitcoin Whales ‘Aggressively’ Accumulating BTC, Says Analytics Firm Glassnode – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T19:55:53.000Z",
    "title": "‘Institutions Have Entered the Chat’ As CFTC Approves Chicago Board Options Exchange for Leveraged Crypto Products",
    "url": "https://dailyhodl.com/2023/06/06/institutions-have-entered-the-chat-as-cftc-approves-chicago-board-options-exchange-for-leveraged-crypto-products/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/institutions-bullish-july.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Commodity Futures Trading Commission (CFTC) has approved leveraged crypto derivatives products for the Chicago Board Options Exchange (CBOE). According to a press release, the CFTC has given approval to Cboe Clear Digital to provide clearing services for digital asset futures on a margined basis. &#8220;The Commodity Futures Trading Commission today approved an amended order [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/institutions-have-entered-the-chat-as-cftc-approves-chicago-board-options-exchange-for-leveraged-crypto-products/\">‘Institutions Have Entered the Chat’ As CFTC Approves Chicago Board Options Exchange for Leveraged Crypto Products</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]