[
  {
    "source": "Decrypt",
    "date": "2023-12-23T18:01:02.000Z",
    "title": "'Minecraft' Cracked Down on Crypto and NFTs—But Worldcoin Integration Is Fine, Microsoft Says",
    "url": "https://decrypt.co/210792/minecraft-cracked-down-crypto-nfts-worldcoin-integration-fine-microsoft-says",
    "description": "despite the game's usually prickly stance on blockchain, Worldcoin's new Minecraft integration gets a pass."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-23T18:04:18.000Z",
    "title": "Nigeria ends years-long restrictions on crypto transactions",
    "url": "https://cryptoslate.com/nigeria-ends-years-long-restrictions-on-crypto-transactions/",
    "description": "<p>The Central Bank of Nigeria (CBN) has lifted the ban on cryptocurrency transactions in the country in a significant reversal of its previous stance. The change was announced through a circular on Dec. 22. It allows Nigerian banks and other financial institutions to resume operations with cryptocurrency service providers. The initial ban, imposed in February [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/nigeria-ends-years-long-restrictions-on-crypto-transactions/\">Nigeria ends years-long restrictions on crypto transactions</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-23T18:02:20.000Z",
    "title": "Former Goldman Sachs Exec Predicts Ethereum and Solana’s Dominance in 2024’s Crypto Market",
    "url": "https://www.cryptoglobe.com/latest/2023/12/former-goldman-sachs-exec-predicts-ethereum-and-solanas-dominance-in-2024s-crypto-market/",
    "description": "Raoul Pal, a former Goldman Sachs executive and CEO of Real Vision, has made a bold prediction about the performance of Ethereum (ETH) and Solana (SOL) in 2024. Addressing his one million followers on a social media platform on December 21, Pal suggested that Ethereum might replicate its 2021 bull market pattern against Bitcoin (ETH/BTC) […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-23T17:58:24.000Z",
    "title": "Top 3 Trending Altcoins to Buy Right Now",
    "url": "https://cryptodaily.co.uk/2023/12/top-3-trending-altcoins-to-buy-right-now",
    "description": "Meta Description: Explore our expert analysis of the top three trending altcoins that are making waves in the cryptocurrency market right now. Discover which digital currencies offer promising growth potential and innovative features for savvy investors."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T18:07:12.000Z",
    "title": "Tech Leaders in 2024: Navigating the AI Landscape",
    "url": "https://www.cryptopolitan.com/tech-leaders-in-navigating-the-ai-landscape/",
    "description": "In the fast-evolving landscape of tech, the allure of artificial intelligence (AI) looms large over businesses, promising transformative impacts on both society and the bottom line. As we approach 2024, the question of which companies will emerge as true tech leaders hinges on their ability to not only leverage AI but also demonstrate tangible financial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T18:00:29.000Z",
    "title": "Deloitte Leverages AI to Optimize Workforce Allocation, Potentially Averting Layoffs",
    "url": "https://www.cryptopolitan.com/deloitte-leverages-ai-to-optimize-workforce/",
    "description": "In a strategic move to harness the power of artificial intelligence (AI), consulting giant Deloitte has revealed plans to explore AI technology to reshuffle its workforce, aiming to maximize the utilization of existing staff and potentially sidestep the need for layoffs. This groundbreaking approach comes at a time when businesses worldwide are seeking innovative solutions [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-23T18:09:14.000Z",
    "title": "Solana breaks $90, flips BNB as new altcoin posts gains",
    "url": "https://crypto.news/solana-breaks-90-flips-bnb-as-new-altcoin-posts-gains/",
    "description": "Solana (SOL) is proving to be a tough Ethereum (ETH) competitor after flipping BNB to fourth. Bitcoin Minetrix is also garnering investor attention"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-23T18:00:07.000Z",
    "title": "$10 Million Worth Of Dogecoin Exit Robinhood – What This Could Mean For Price",
    "url": "https://www.newsbtc.com/news/dogecoin/10-million-worth-of-dogecoin-exit-robinhood-what-this-could-mean-for-price/",
    "description": "On-chain data has revealed more than 112 million Dogecoin tokens recently made their way out of Robinhood into an unknown wallet. DOGE transfers into crypto exchanges have seen an uptick in the past few days, as the crypto continues to struggle to keep up pace compared to other top cryptocurrencies. However, according to Whale Alerts, 112 million DOGE which was valued at roughly $10.4 million at the time of the transfer, was sent from Robinhood into a private wallet. Related Reading: Social Frenzy: Stacks (STX) Hits 8-Month High, But It Unveiled An Intriguing Twist Massive Dogecoin Transfer Out Of Robinhood According to Whale Alerts, the 112 million DOGE tokens were transferred from the Robinhood-linked address &#8220;DHQsfy&#8221; into the private address &#8220;DEndnp.&#8221; The tokens were then transferred to another private wallet address &#8220;DF8jRK&#8221; four hours later. A further look through on-chain transaction data shows earlier large DOGE transactions between the Robinhood address and private wallet &#8220;DEndnp.&#8221; On Dec 21, 17.5 million DOGE tokens made their way from Robinhood into &#8220;DEndnp.&#8221;. At the time of the transaction, this tranche of coins was worth approximately $1.6 million. Again, the tokens were then transferred to &#8220;DF8jRK&#8221; four hours later. At the time of writing, &#8220;DF8jRK&#8221; holds 111 million DOGE tokens, and the pattern of transfers points to the transactions being made by the same entity. On the other hand, various social media posts from Whale Alerts have shown large DOGE transfers from private addresses into Robinhood over the week. On December 18, a single transaction of over $7 million worth of DOGE was sent into Robinhood. DOGE market cap currently at $13.189 billion. Chart: TradingView.com Crypto whales, or investors holding very large amounts, are always worth keeping an eye on. When whales make big moves, it often means something. They also tend to show general sentiment among whales. However, in this case, $10 million worth of Dogecoin exiting Robinhood could signal that the whale is opting to keep the tokens in self-custody in anticipation of a long-awaited DOGE price surge. Future Outlook For Dogecoin Dogecoin is currently trading at $0.09312, over a newly found support at the $0.092 level. DOGE went on a run earlier in the month that saw its price reach a yearly high of $0.0151 on December 11. This growth has since slowed down, and DOGE is now down by %0.6 in a 7-day timeframe.  Related Reading: BONK Crashes 31% After A Solid Month – Is the Success Story Ending? DOGE whales have increased their holdings by a substantial amount in the past month. According to IntoTheBlock&#8217;s Balance By Holdings metric, the balance of addresses holding between $100,000 to $1 million, $1 million to $10 million, and more than $10 million worth of DOGE has increased by 23.28%, 16.41%, and 27% in the past 30 days. Collectively, these large addresses have increased their holdings by $1.32 billion since December 1.  Dogecoin is currently trading 87% below its all-time high of $0.74. As a meme token, DOGE&#8217;s value is mostly tied to hype among traders, particularly retail investors. If the current bullish momentum among DOGE whales rolls over into retail investors, we could see the cryptocurrency&#8217;s strong bullish run in 2024. The first step in its journey to a new high is to find a strong footing over the $0.1 price level. Featured images from Shutterstock"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-23T17:55:20.000Z",
    "title": "Paxos Becomes Multi-Chain Stablecoin Issuer, Expands to Solana (SOL) Blockchain",
    "url": "https://dailyhodl.com/2023/12/23/paxos-becomes-multi-chain-stablecoin-issuer-expands-to-solana-sol-blockchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/paxos-becomes-mutli-issuer.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Stablecoin issuer Paxos is expanding into the Solana (SOL) network, becoming the first multi-chain platform to be regulated across multiple jurisdictions. In a new press release, the New York-based crypto firm says that after exclusively working with top smart contract platform Ethereum (ETH), it will now be releasing its dollar-pegged crypto asset, Pax Dollar (USDP), [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/23/paxos-becomes-multi-chain-stablecoin-issuer-expands-to-solana-sol-blockchain/\">Paxos Becomes Multi-Chain Stablecoin Issuer, Expands to Solana (SOL) Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]