[
  {
    "source": "NewsBTC",
    "date": "2023-11-02T01:00:57.000Z",
    "title": "Cardano: More ADA Delegators Staking, But Why Are Bears Dominant?",
    "url": "https://www.newsbtc.com/news/cardano/ada-delegators-staking-cardano-bears-dominant/",
    "description": "Citing Messari data, one user on X, @JaromirTesar, notes that despite the effects of the crypto bear market, which has adversely affected valuation and activity, there are more Cardano (ADA) holders willing to stake their assets, helping secure the network and earn staking rewards at the same time.   More Delegators Staking ADA, Confidence Remains High Sharing a screenshot on November 1, the user notes that roughly 250 ADA holders have opted to stake their coins daily for the past year. By the end of Q3 2023, there were 1.31 million delegators, up from 1.22 million recorded around the same time last year. This means that despite the harsh crypto market conditions, ADA holders seem to have been unfazed and choose to lock their coins instead of exiting for other coins like Bitcoin (BTC) or stablecoins, including USDT. Cardano uses the proof-of-stake (PoS) consensus mechanism, which the team, Input Output Global (IOG), claims to be more scalable and efficient than other consensus systems, including Bitcoin&#8217;s proof-of-work (PoW). In Cardano, Stake Pool Operators (SPOs) are tasked with validating a block of ADA transactions where they receive rewards after every epoch.  Related Reading: Bull Season: Analyst Outlines Breakout That Could Send Solana To $100 SPOs eradicate the need for miners. Since anyone with a Cardano wallet can participate in the consensus process, the platform is thought to be more decentralized. ADA holders who choose not to run SPOs can delegate their coins through their favorite validator and receive staking rewards.   More Stakers Engaging, What Happens To Price Next? As of November 1, there are 2,888 SPOs with stake, meaning they manage ADA from delegators. Meanwhile, there were 1.31 million unique delegators by the end of Q3 2023, an increase from the previous year. In total, 65.33% of all ADA is engaged, actively participating in consensus and helping keep the network decentralized. Even so, this is down from 71.57% recorded in Q3 2023. The active stake translates to 22.9 billion ADA, down from 25 billion in Q3 2023. According to trackers, there are 35.2 billion ADA in circulation. Despite the confidence among ADA holders, prices are relatively subdued. The coin is still trending below July 2023 highs of around $0.37. Even so, prices have been on an uptrend, breaking above the $0.27 high of October. A close above $0.40 could open up ADA for more gains towards 2023 highs of around $0.46. Conversely, any sell-off from spot rates may push the coin closer to 2023 lows of $0.24. Related Reading: XRP Price Rally Threatened As Ripple Unlocks 1 Billion Tokens Feature image from Canva, chart from TradingView"
  }
]