[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T10:00:00.000Z",
    "title": "Crypto Exchange OKX Wins Preparatory License in Dubai, Set to Boost Staff",
    "url": "https://www.coindesk.com/business/2023/06/15/crypto-exchange-okx-wins-preparatory-license-in-dubai-set-to-boost-staff/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Once the so-called MVP license becomes operational, OKX Middle East will offer spot, derivatives, and fiat services, including U.S. dollar and UAE dirham deposits and withdrawals."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-15T10:00:00.000Z",
    "title": "Crypto Exchange Bybit Integrates ChatGPT Into Trading Tools",
    "url": "https://www.coindesk.com/tech/2023/06/15/crypto-exchange-bybit-integrates-chatgpt-into-trading-tools/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Traders will be able to analyze market data with the tool."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T09:59:03.000Z",
    "title": "Ethereum, Cardano, and Dogecoin Lead Weekly Crypto Losses",
    "url": "https://decrypt.co/144741/ethereum-cardano-dogecoin-lead-weekly-crypto-losses",
    "description": "After the largest altcoins, Bitcoin is also shedding value as the crypto market continues to digest yesterday’s fed notes. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T10:00:00.000Z",
    "title": "Exchanges pledged $2.5B to user protection funds amid FTX’s collapse: Report",
    "url": "https://cointelegraph.com/news/exchanges-pledged-2-5b-to-user-protection-funds-amid-ftx-s-collapse-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5b1cea5b-7f71-4f67-9e89-06a3f95262fb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Not all exchanges have disclosed wallet addresses for the funds, however. </p>\n                    <p><p>According to a new report published by blockchain analytics firm Nansen on June 14, most reputable cryptocurrency exchanges adopted user protection funds amid the collapse of FTX. Together, exchanges such as Binance, OKX and Bitget have more than $2 billion combined in nominal fiat protection funds. Meanwhile, Huobi’s insurance fund is collateralized by 20,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), while Coinbase grants up to 150,000 British pounds ($189,140) worth of insurance to U.K. customers’ accounts. The Nansen researchers wrote:</p><blockquote>“Proof of Reserves should become the minimum standard in the exchange industry, However, as stated above, these are both positive indicators for an exchange but do not guarantee its solvency.”</blockquote><p>Among other items, Binance has maintained the top spot with regard to both spot and derivatives trading volume. In the spot sector, the exchange had an overall market share of 69% and a monthly trading volume of $209.5 billion in May. In the spot markets, Kraken’s trading volume increased the most, gaining 14.35% to reach $18.9 billion in the six months following FTX’s collapse, compared with the preceding six months. Meanwhile, Bitfinex’s trading volume fell the most, dropping 59.5% to $5 billion in the same period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1dd430d2-2f3a-4eb4-84e7-0cb7ab137ca5.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Although many exchanges have user protection funds, not all have disclosed their on-chain addresses. Source: Nansen</em></figcaption></figure><p>As for crypto derivatives, all exchanges saw declines amid FTX’s collapse except for Bitget, whose average six-month trading volume increased by 4.85% sequentially to $204.1 billion. Bitget, Bybit and Binance have performed relatively well since the FTX collapse, the researchers wrote. Nevertheless, Nansen cautioned that the uncertain regulatory environment in the United States casts a shadow on exchanges’ growth:</p><blockquote>“The SEC Chair Gary Gensler has posited that nearly all tokens are securities. This has prevented many exchanges from operating in the US. If the US takes this official position, it could cause significant issues throughout the world for CEXs. It will be worth carefully monitoring the position taken here.”</blockquote><p><strong><em>Magazine: <a href=\"https://www.google.com/search?q=binance+cointelegraph+magazine&oq=binance+cointelegraph+magazine+&aqs=chrome..69i57j69i60l3.4139j0j1&sourceid=chrome&ie=UTF-8&bshm=nce/1\" target=\"_blank\" rel=\"noopener nofollow\">Binance humiliated, HK needs 100K crypto workers, China’s AI unicorn</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T10:00:00.000Z",
    "title": "ByBit plugs into ChatGPT for AI-powered trading tools ",
    "url": "https://cointelegraph.com/news/bybit-plugs-into-chatgpt-for-ai-powered-trading-tools",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e941b424-6e6d-40c4-80f1-76c9aef8b9ae.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ToolsGPT marries ByBit’s market data with ChatGPT’s AI to generate technical analysis, price data and trading metrics. </p>\n                    <p><p>Cryptocurrency exchange ByBit will look to leverage artificial intelligence (<a href=\"https://cointelegraph.com/tags/ai\">AI</a>) to provide a host of new trading tools and metrics for users through an integration with ChatGPT.</p><p>OpenAI’s highly acclaimed large language model chatbot has been used by a myriad of industries to provide innovative solutions and services. The cryptocurrency trading space could stand to benefit from the service as ByBit unveils its own AI-powered offering to cryptocurrency traders using the Dubai-based exchange.</p><p>ByBit’s ToolsGPT combines ChatGPT’s machine learning technology with the exchange’s market data to provide technical analysis, price data and metrics. The integration also allows ToolsGPT to generate bespoke answers to traders’ inquiries.</p><p>The exchange touts the new offering to provide insights and predictions to various cryptocurrency trading scenarios. ToolsGPT will be able to analyze price trends based on market data for a number of cryptocurrencies.</p><p>According to ByBit, this includes providing price trends for a host of tokens and takes into account technical indicators to forecast future market movements. The service is set to cater to traders of varying experience levels and is freely accessible to all users of the exchange.#</p><p><a href=\"https://cointelegraph.com/news/here-s-how-chatgpt-4-spends-100-in-crypto-trading\"><strong><em>Related: Here’s how ChatGPT-4 spends $100 in crypto trading</em></strong></a></p><p>A statement from ByBit CEO Ben Zhou highlighted the integration of ChatGPT as an innovative move aimed to help traders make informed decisions based on historical and real-time market data and AI-generated advice: </p><blockquote>“By integrating ChatGPT into Bybit Tools, we are able to give users more comprehensive information when making their decisions. ToolsGPT is a testament to our commitment to empowering traders with advanced tools and insights.”</blockquote><p>ByBit is not the only cryptocurrency exchange to have explored using ChatGPT to give users unique insights into token prices, market movements and projects.</p><p>Crypto.com<a href=\"https://cointelegraph.com/news/crypto-com-chatgpt-based-ai-user-assistant-amy\"> launched its own</a> ChatGPT-powered user assistant in May 2023 dubbed Amy while Binance <a href=\"https://cointelegraph.com/news/binance-integrates-chatgpt-into-the-web3-academy\">also integrated OpenAI’s chatbot</a> into its Binance Academy platform to generate responses from its database of articles and information on the wider web3 ecosystem.</p><p>OKX is another exchange that is <a href=\"https://cointelegraph.com/news/okx-launches-ai-integration-to-monitor-market-volatility\">exploring the potential of AI</a> after integrating EndoTech’s AI tools to analyze market volatility and trading opportunities. </p><p>Solana Labs <a href=\"https://cointelegraph.com/news/solana-labs-chatgpt-plugin-allows-ai-to-fetch-blockchain-data\">also launched a ChatGPT-powered plugin</a> that will allow the large language model to check wallet balances, transfer Solana-native tokens and trade nonfungible tokens (NFTs). </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\">AI Eye: Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</a></em></strong></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T09:40:22.000Z",
    "title": "Curve pool imbalance triggers USDT depeg concerns, Tether CTO calls it FUD",
    "url": "https://cointelegraph.com/news/curve-pool-imbalance-usdt-depeg-concerns-tether-cto-calls-it-fud",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f79ea277-706f-484c-afde-882f8e613a88.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The stablecoin pool ideally has a weightage of 33.3% of each USDT, USDC and DAI, however, on June 15, the USDT weightage rose above 70% in the pool. </p>\n                    <p><p>Tether-issued USDT (<a href=\"https://cointelegraph.com/tether-price-index\">USDT) </a>stablecoin slightly deviated from its dollar peg value on June 15 due to an imbalance in the Curve 3pool. The price of USDT fell by 0.3% to around 0.997 as the USDT weightage in the curve 3pool increased to over 70% from the ideal 33.1%.</p><p>Curve's 3pool is a stablecoin pool for decentralized finance that holds a massive amount of liquidity of the three top stablecoins in DeFi- USDT, USDC and DAI. A significant rise in a particular stablecoin weightage in the curve pool indicates a heavy selling of that stablecoin. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/96ff7ccb-8c7c-4721-804e-2b99bd943472.jpg\"  /><figcaption style=\"text-align: center;\"><em>USDT price depeg, Source: TradingView</em></figcaption></figure><p>With USDT weightage at around 73.8%, it means traders are increasingly selling their USDT for DAI or USDC. USDT concentration in Curve 3pool exceeded over 50% last in November 2022 at the time of FTX collapse.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ae716fe4-2b45-4e8d-8587-b95ab140bbd9.png\"  /><figcaption style=\"text-align: center;\"><em>Curve's 3 pool stablecoin weightage. Source: Curve.</em></figcaption></figure><p>The main cause of the imbalance was attributed to a whale address called CZSamSun that borrowed 31.5 million USDT and swapped it for Circle issued USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) leding to slight deviation in USDT’s dollar-peg value. With the help of 17,000 ETH and 14,000 stETH as collateral and then converted the borrowed sum into USDC using 1inch. </p><p>The borrower then made deposits to V2 and V3 totaling $10 million and $21 million, respectively. Following that, the borrower took out a USDT loan of 12 million from V3 and deposited it into V2. </p><p>Approximately 20 minutes after czsamsun.eth borrowed USDT, another address (0xd2...0701) mortgaged 52,200 stETH through Aave V2 and borrowed 50 million USDC. Using the USDC&gt;USDT de-peg, with a few million USDC, </p><p>The slight deviation for USDT price helped the USDC/USDT trading pair on Binance to rise to a new yerly high of $1.0034. USDT accounted for 73.79% of Curve 3pool, DAI accounted for 13.05%, and USDC accounted for 13.16%.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-cpi-and-a-strong-rebound-5-things-to-know-in-bitcoin-this-week\"><strong><em>SEC, CPI and a ‘strong rebound’ — 5 things to know in Bitcoin this week</em></strong></a></p><p>Tether’s chief technical officer Paolo Ardoino took to Twitter to <a href=\"https://twitter.com/paoloardoino/status/1669223742831042562?s=20\" target=\"_blank\" rel=\"noopener nofollow\">assure </a>the crypto community that the de-peg scare is nothing to worry about and they are ready to redeem any amount. Later Ardoino also shared a \"FUD meme\" as well addressing the market rumours around Tether depeg.</p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/QmHyYDNgwX\">pic.twitter.com/QmHyYDNgwX</a></p>&mdash; Paolo Ardoino  (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1669264734879641602?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The latest stablecoin de-peg scare comes within months of the USDC depeg that ran havoc on many investors' portfolios. The USDC <a href=\"https://cointelegraph.com/news/usdc-depegs-as-circle-confirms-3-3b-stuck-with-silicon-valley-bank\">depegged below $0.9 in March</a> earlier this year as Circle confirmed they had over $3 billion stuck with Silicon Valley Bank. Although Circle managed to gather enough capital to repeg USDC value to the dollar within two days, the panic set in by the de-pegging led to many traders exiting USDC at a loss.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T10:07:51.000Z",
    "title": "Crypto prime broker FPG loses $15M+ in cyber attack, halts trading and withdrawals",
    "url": "https://cryptoslate.com/crypto-prime-broker-fpg-loses-15m-in-cyber-attack-halts-trading-and-withdrawals/",
    "description": "<p>Crypto prime brokerage Floating Point Group (FPG) lost over $15 million in cryptocurrencies to a June 11 cyber security incident, according to a June 14 statement. FPG announced that it had halted trading, deposits, and withdrawal activities in response to the incident and has contacted law enforcement agencies for assistance. FPG stated it had immediately [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-prime-broker-fpg-loses-15m-in-cyber-attack-halts-trading-and-withdrawals/\">Crypto prime broker FPG loses $15M+ in cyber attack, halts trading and withdrawals</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T09:54:59.000Z",
    "title": "Depicting Powell’s speech: Higher for longer",
    "url": "https://cryptoslate.com/insights/depicting-powells-speech-higher-for-longer/",
    "description": "<p>Quick Take The Fed was somewhat clear with their projections suggesting two further 25 bps rate hikes this year. However, the market is currently pricing in one 25bps hike in July and then holding for the remainder of the year. A chart created by hedge fund project manager, Super_Macro shows the Summary of Economic Projections, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/depicting-powells-speech-higher-for-longer/\">Depicting Powell&#8217;s speech: Higher for longer</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T10:00:15.000Z",
    "title": "LBank Labs Maintains Long-Standing Investment in SevenX Ventures, Expanding Ecosystem Partnership",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-labs-maintains-long-standing-investment-in-sevenx-ventures-expanding-ecosystem-partnership",
    "description": "<p>Road Town, British Virgin Islands, June 15th, 2023, Chainwire</p><p>LBank Labs, the leading venture fund, has disclosed details of its investment in SevenX Ventures, a research-driven venture capital firm in Web3. The two funds aim to provide comprehensive support for blockchain projects and entrepreneurs worldwide, fueling innovation and fostering global collaboration in Web3.</p><p>With $100 million assets under management (AUM), LBank Labs has a strong track record of nurturing startups and helping them thrive. The venture capitalist arm of LBank, the global cryptocurrency exchange, LBank Labs is committed to supporting projects through direct funding, acceleration, incubation, and extensive networking. In addition to direct investments, the fund aims to build a robust network by investing in top global funds, providing financial and resource value-add support to portfolios within the network.</p><p>Czhang Lin, IC board member of Labs, has personally contributed as a limited partner (LP) to NGC, Blockchain Founders Fund, and Lemniscap. Eric He, Co-Founder of LBank, has been an LP to SevenX Ventures fund I, II, III and FOF from the very beginning, as well as IOSG Ventures.</p><p>SevenX Ventures, headed by seasoned veterans with an average industry experience of six years, manages three main funds and a Fund of Funds (FOF), totaling approximately $300 million AUM.</p><p>&ldquo;SevenX is dedicated to helping our portfolio and partners build a trustless network to make the value of organizations and individuals come true in crypto and Web3,&rdquo; explained Jon, Founding Partner at SevenX Ventures.</p><p>SevenX Ventures has already weathered three bull and bear cycles, with a portfolio of nearly 100 projects spanning infrastructure, middleware, DeFi, gaming, and social applications. Notable portfolio companies include Near, Arweave, Zerion, YGG, Mask Network, AI Arena, Space and Time, CyberConnect, Debank, and DODO. Furthermore, SevenX Ventures plays a pivotal role in bridging infrastructures and decentralized applications (dapps) between Western and Eastern markets, making the fund an indispensable partner in Asia.</p><p>LBank Labs has brought extensive financial resources and a vast global network to SevenX Ventures over the years, while SevenX Ventures has reciprocated by contributing significant value and knowledge to LBank Labs. As part of their commitment, LBank Labs aims to build a comprehensive network of Fund of Funds, enhancing portfolio performance and diversification while emphasizing the inherent value of their ecosystem network. With Labs' presence in seven global regions, they are a powerhouse for fostering collaboration and innovation cross-borders.</p><p>In addition to its partnership with SevenX Ventures, LBank Labs has recently announced investments in Sparkle Ventures and Collab+Currency, two notable venture funds dedicated to supporting and nurturing projects in the Web3 ecosystem.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrency.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram&nbsp;l&nbsp;Twitter&nbsp;l&nbsp;Facebook&nbsp;l&nbsp;LinkedIn&nbsp;l&nbsp;Instagram&nbsp;l&nbsp;YouTube&nbsp;</p><p></p>ContactGlobal PR DirectorJeremy Van der HaegenLBankpress@lbank.info"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T09:57:35.000Z",
    "title": "Fed pauses as crypto market continues slide",
    "url": "https://cryptodaily.co.uk/2023/06/fed-pauses-as-crypto-market-continues-slide",
    "description": "<p>The Federal Reserve did not raise rates for the first time since the inflation-inspired start of its rapid interest rate expansion. However, crypto continues its downward slide.</p>\nFed intervention\n<p>A Fed pivot is on the horizon even though it may not start to actually reduce interest rates until next year. This was certainly coming given that the current mad series of interest rate hikes is forcing the economy into recession.</p>\n<p>Never before has the Fed tightened as quickly and as harshly as this following Biden and Yellen&rsquo;s claims back in July of 2021 that inflation was only &ldquo;temporary&rdquo;.</p>\n<p>History tells us that our boom and bust cycles are caused by government and central bank manipulation of credit, and that government intervention in the markets is always a bad thing and could probably be said to be axiomatic.</p>\nAttempted eradication of crypto\n<p>In such a chaotic world where the dollar and all other fiat currencies are being debased like crazy, it appears that the last thing the US government needs is the slightest hint of competition to its currency.</p>\n<p>It could be argued that the government sees this competition coming on two fronts. It is now understanding the full import of cryptocurrencies - which might be classified as a type of private money.</p>\n<p>After huge successes for some cryptocurrencies, admittedly mostly driven by hype and speculation, the US government has probably decided to try and eradicate them through the auspices of its enforcement agencies (SEC and CFTC).</p>\n<p>A systemic attack on the crypto ecosystem is now taking place and lacking liquidity and with many crypto investors fleeing the sector the market is bleeding out.</p>\nBitcoin unassailable?\n<p>However, there is one cryptocurrency that even the US government would have the devil of a job in taking down, and that is bitcoin. Bitcoin is the most decentralised and secure private money that exists in the world today, and given that it runs purely on code there is nothing any government or agency can do to stop it.</p>\n<p>Be that as it may, the rest of the market is obviously having an effect on bitcoin as large crypto businesses run into difficulties with sizable chunks of bitcoin on their books, and Mt Gox and the US government are selling their bitcoin into the market.</p>\n<p>Once this selling pressure is gone though it might be expected that bitcoin would begin a dramatic rise as investors rush out of a worsening dollar, to say nothing of the rest of the fiat currencies.</p>\nBRICS currency on the horizon\n<p>The other front where the US can expect huge competition is from the BRICS nations. In August, at a Summit in South Africa, these nations are expected to announce a new currency which could be backed by gold and/or other commodities, or could even become a rival reserve currency to the dollar by having its own deep and liquid bond market, with the bonds bought by citizens in 20 or so countries that are in or on the point of joining the BRICS nations.</p>\n<p>So whether it be Bitcoin or the BRICS nations, the dollar is likely to undergo the most profound and serious rivalry since it came into existence. With the unpayable debts owed by the US government and nothing but thin air and promises backing the currency, a new world order may be on the way.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T10:06:51.000Z",
    "title": "OKX Middle East Receives MVP Preparatory License From VARA in Dubai",
    "url": "https://www.cryptopolitan.com/okx-middle-east-receives-mvp-preparatory-license-from-vara-in-dubai/",
    "description": "Dubai, United Arab Emirates, June 15th, 2023, Chainwire UAE to serve as strategic global and regional business hub, OKX to expand to 30 staff OKX, the second-largest crypto exchange by trading volume and a leading Web3 technology company, today announced that OKX Middle East Fintech FZE (OKX Middle East) has received a Minimal Viable Product ... <a title=\"OKX Middle East Receives MVP Preparatory License From VARA in Dubai\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-middle-east-receives-mvp-preparatory-license-from-vara-in-dubai/\" aria-label=\"More on OKX Middle East Receives MVP Preparatory License From VARA in Dubai\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T10:00:00.000Z",
    "title": "Cryptocurrency safe havens: digitoads, ethereum, and bitcoin",
    "url": "https://crypto.news/cryptocurrency-safe-havens-digitoads-ethereum-and-bitcoin/",
    "description": "DigiToads, boosted by its features such as P2E gaming and NFT staking, is a safe haven like bitcoin and ethereum"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T10:00:27.000Z",
    "title": "LBank Labs Maintains Long-Standing Investment in SevenX Ventures, Expanding Ecosystem Partnership",
    "url": "https://www.crypto-news-flash.com/lbank-labs-maintains-long-standing-investment-in-sevenx-ventures-expanding-ecosystem-partnership/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-maintains-long-standing-investment-in-sevenx-ventures-expanding-ecosystem-partnership",
    "description": "Road Town, British Virgin Islands, June 15th, 2023, Chainwire LBank Labs, the leading venture fund, has disclosed details of its investment in SevenX Ventures, a research-driven venture capital firm in Web3. The two funds aim to provide comprehensive support for blockchain projects and entrepreneurs worldwide, fueling innovation and fostering global collaboration in Web3. With $100 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T10:04:54.000Z",
    "title": "A Smart Whale Buys 9,641 ETH for 16.26M After Recent Price Dip",
    "url": "https://coinedition.com/a-smart-whale-buys-9641-eth-for-16-26m-after-recent-price-dip/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ETH-2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ETH-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/ETH-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ETH-2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The smartmoney onchain analytical platform, Lookonchain, has identified a whale who spent 16.26 million USDT to buy 9,641 ETH at $1,687 following the recent price drop. According to Lookonchain, the same whale bought 8,701 ETH at $1,589 on March 13 and exchanged 928 WBTC, equivalent to $ 22.86 million for 13,731 ETH on March 15, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/a-smart-whale-buys-9641-eth-for-16-26m-after-recent-price-dip/\">A Smart Whale Buys 9,641 ETH for 16.26M After Recent Price Dip</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]