[
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T09:29:36.000Z",
    "title": "FTX founder’s parents sued, accused of stealing millions from crypto exchange",
    "url": "https://cointelegraph.com/news/ftx-founder-parents-sued-accused-stole-millions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/fd92f1a1-3ad2-40a3-87e3-0dca1b2b7a47.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the allegations, Sam Bankman-Fried’s father Joseph Bankman was a “de facto officer” at the FTX Group. </p>\n                    <p><p>Debtors of the bankrupt cryptocurrency exchange FTX have launched action against the parents of FTX founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, alleging that they misappropriated millions of dollars through their involvement in the exchange’s business.</p><p>The counsel for FTX debtors and debtors-in-possession, represented by the law firm Sullivan &amp; Cromwell, on Sept. 18 <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjUyNzIzOA==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a lawsuit against SBF’s parents, Joseph Bankman and Barbara Fried.</p><p>The plaintiffs argued that Bankman and Fried exploited their access and influence within the FTX empire to enrich themselves at the expense of the debtors in the FTX bankruptcy estate. The debtors alleged that SBF’s parents were “very much involved” in the FTX business from inception to collapse, contrary to what SBF has claimed.</p><p>“As early as 2018, Bankman described Alameda as a ‘family business’ — a phrase he repeatedly used to refer to the FTX Group. Even as the FTX Group descended into insolvency, Bankman and Fried profited handsomely from this ‘family business’,” the complaint reads.</p><p>According to plaintiffs, SBF’s father, a Stanford Law School professor, had broad authority to make decisions for the FTX Group as its “de facto officer.” Bankman also held executive positions on the FTX Group’s management team, the debtors argued.</p><p>SBF’s mother — also a Stanford Law School professor — was actively involved in FTX’s political donations, the plaintiffs wrote. According to the allegations, Fried served as the “single most influential advisor” in <a href=\"https://cointelegraph.com/news/sam-bankman-fried-superseding-indictment-includes-campaign-finance-allegations\">FTX Group’s political contributions</a>, repeatedly calling upon FTX to donate millions directly to Mind the Gap (MTG), a political action committee that she co-founded.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/cecf02a2-2d3b-4e81-8bd4-480f45c408e8.png\"  /><figcaption style=\"text-align: center;\"><em>Joseph Bankman and Barbara Fried. Source: The New York Post</em></figcaption></figure><p>According to the complaint, Bankman and Fried extracted significant unearned rewards from their involvement in the FTX Group, including a <a href=\"https://cointelegraph.com/news/sam-bankman-fried-is-paying-for-legal-defense-using-previously-gifted-funds-from-alameda-report\">$10 million cash gift</a> and a <a href=\"https://cointelegraph.com/news/sbf-ftx-execs-reportedly-spend-millions-on-properties-in-the-bahamas\">$16.4 million luxury property in The Bahamas</a>. Bankman also siphoned off FTX Group’s money to cover costs including privately-chartered jets and $1,200 per night hotel stays, the plaintiffs alleged.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-security-claims-portal-cyberbreach\"><strong><em>FTX bolsters claims portal security measures following cyber breach</em></strong></a></p><p>By draining FTX Group’s funds to their benefit, Bankman and Fried either knew or ignored red flags revealing that their son was orchestrating a fraudulent scheme to promote their personal and charitable interests at debtors’ cost, the plaintiffs said. The debtors called on the court to hold Bankman and Fried accountable for their misconduct and recover assets for the debtors’ creditors, stating:</p><blockquote>“Award plaintiffs punitive damages in an amount to be determined at trial resulting from defendants’ conscious, willful, wanton, and malicious conduct, which exhibits a reckless disregard for the interests of plaintiffs and their creditors.”</blockquote><p>As previously reported, Bankman and Fried began <a href=\"https://cointelegraph.com/news/sam-bankman-fried-s-parents-no-longer-on-the-stanford-law-school-roster\">facing professional issues</a> at the Stanford Law School soon after FTX collapsed. In late 2022, SBF’s parents also reportedly <a href=\"https://www.wsj.com/articles/sam-bankman-frieds-parents-were-there-for-ftxs-rise-and-now-its-fall-11670841001\" target=\"_blank\" rel=\"noopener nofollow\">told</a> friends that their son’s legal bills will likely wipe them out financially.</p><p>Once a major cryptocurrency exchange, FTX stopped operating and <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\">filed for Chapter 11 bankruptcy</a> in mid-November 2022. FTX founder and former CEO <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-arrested-and-in-custody-attorney-general\">SBF was subsequently arrested</a> and <a href=\"https://cointelegraph.com/news/sam-bankman-fried-superseding-indictment-includes-campaign-finance-allegations\">charged with 13 counts</a>, including fraud, money laundering as well as bribing officials. SBF's first of two trials is scheduled to start on Oct. 3, where he will face seven charges related to fraudulent activities involving user funds at FTX and Alameda Research.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>Big Questions: What’s with all the crypto deaths? </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T09:22:02.000Z",
    "title": "Thailand to start taxing overseas income next year, including from crypto  ",
    "url": "https://cointelegraph.com/news/crypto-thailand-tax-overseas-income",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1fae8bcd-5e11-4cd6-9afc-422151ba85e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Any person who resides in Thailand for up to 180 days, would be subject to personal income tax on foreign assets, including crypto. </p>\n                    <p><p>Thailand’s Revenue Department is planning to impose personal income tax on the foreign revenues, including those made from crypto trading, of any person who resides in Thailand for more than 180 days. </p><p> According to the Sept 19 <a href=\"https://www.bangkokpost.com/business/general/2649138/overseas-earnings-targeted\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from the Bangkok Post, the new rule will take effect on Jan. 1, 2024, with the first tax forms, including overseas income to be delivered in 2025. </p><p>Under the previous regulation, only the foreign income, remitted to Thailand in the year of earning, was taxed. The new rule closes this loophole and will oblige an individual to declare any income, earned overseas, even if it wasn't going to be used in the local economy. A Finance Ministry official explained this logic to journalists: </p><blockquote>“The principle of tax is that you must pay tax on income you earn from abroad no matter how you earn it and regardless of the tax year in which the money is earned”. </blockquote><p>According to other Bangkok Post sources, the policy specifically targets residents trading in foreign stock markets through foreign brokerages, cryptocurrency traders, and Thais with offshore accounts. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ai-second-largest-thai-bank-creates-100-million-ai-fund\"><strong><em>Second-largest Thai bank creates $100-million AI fund</em></strong></a></p><p>In July, Thailand’s Securities and Exchange Commission (SEC) obliged digital asset service providers to offer adequate warnings highlighting risks associated with cryptocurrency trading. It has also <a href=\"https://cointelegraph.com/news/crypto-thai-sec-bans-the-use-of-customer-crypto-assets-for-lending-and-investment\">prohibited any forms</a> of crypto lending services. </p><p>However, the trend for tight scrutiny over the crypto industry might change with the recent election of t<a href=\"https://cointelegraph.com/news/crypto-thailands-next-prime-minister-srettha-thavisin-has-crypto-history\">he new prime minister</a>. Real estate tycoon Srettha Thavisin, elected to lead the Thai parliament, <a href=\"https://cointelegraph.com/news/thailand-s-xspring-capital-raises-225m-to-build-integrated-financial-marketplace\">participated in a $225 million raise</a> for a crypto-friendly investment management firm XSpring Capital and even issued its own token through XSpring in 2022. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-thailand-tax-overseas-income&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions. Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T09:34:56.000Z",
    "title": "Experts Pick Three Gaming Tokens for Q4 2023: Axie Infinity, The Sandbox, Kangamoon",
    "url": "https://www.cryptopolitan.com/experts-pick-three-gaming-tokens-for-q4-2023-axie-infinity-the-sandbox-kangamoon/",
    "description": "As we draw close to the last quarter of 2023, experts have singled out three gaming cryptos with great potential. They include Axie Infinity (AXS), The Sandbox (SAND), and Kangamoon (KANG). Experts have forecasted these tokens to experience bullish price movements before the end of Q4 2023. Don&#8217;t Miss Out On The Kangamoon (KANG) Presale ... <a title=\"Experts Pick Three Gaming Tokens for Q4 2023: Axie Infinity, The Sandbox, Kangamoon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/experts-pick-three-gaming-tokens-for-q4-2023-axie-infinity-the-sandbox-kangamoon/\" aria-label=\"More on Experts Pick Three Gaming Tokens for Q4 2023: Axie Infinity, The Sandbox, Kangamoon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T09:34:55.000Z",
    "title": "Which Tokens Can Stand the Next Economic Crisis? – The Graph, Aptos, or Kangamoon",
    "url": "https://www.cryptopolitan.com/which-tokens-can-stand-the-next-economic-crisis-the-graph-aptos-or-kangamoon/",
    "description": "The last economic crisis in 2022 saw the prices of top cryptocurrencies crumble. Analysts and market experts have picked three tokens that offer great utility and could withstand the next economic crisis. They include The Graph (GRT), Aptos (APT), and Kangamoon (KANG). Don&#8217;t Miss Out On The Kangamoon (KANG) Presale &#8211; Reserve Your Spot! The ... <a title=\"Which Tokens Can Stand the Next Economic Crisis? – The Graph, Aptos, or Kangamoon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/which-tokens-can-stand-the-next-economic-crisis-the-graph-aptos-or-kangamoon/\" aria-label=\"More on Which Tokens Can Stand the Next Economic Crisis? – The Graph, Aptos, or Kangamoon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T09:29:39.000Z",
    "title": "Bitcoin ETF Approval Hype: Watch Out for Potential Surges in Stacks (STX), Optimism (OP), and Tradecurve Markets (TCRV)",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-approval-hype-watch-out-for-potential-surges-in-stacks-stx-optimism-op-and-tradecurve-markets-tcrv/",
    "description": "Stacks (STX), Optimism (OP), and Tradecurve Markets (TCRV) have all gained attention in the lead-up to the Bitcoin ETF approval decision. This approval is causing a buzz in the crypto market as it may start a ripple effect in the entire sphere. While all eyes are on Bitcoin, seasoned crypto enthusiasts also closely watch the ... <a title=\"Bitcoin ETF Approval Hype: Watch Out for Potential Surges in Stacks (STX), Optimism (OP), and Tradecurve Markets (TCRV)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etf-approval-hype-watch-out-for-potential-surges-in-stacks-stx-optimism-op-and-tradecurve-markets-tcrv/\" aria-label=\"More on Bitcoin ETF Approval Hype: Watch Out for Potential Surges in Stacks (STX), Optimism (OP), and Tradecurve Markets (TCRV)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T09:24:42.000Z",
    "title": "Sui Launches zkLogin, Near Protocol Adds USDC Support, Tradecurve Markets Dominates the Trading Market with Hybrid Model",
    "url": "https://www.cryptopolitan.com/sui-launches-zklogin-near-protocol-adds-usdc-support-tradecurve-markets-dominates-the-trading-market-with-hybrid-model/",
    "description": "The Sui (SUI) ecosystem is consistently expanding, and the team regularly introduces new elements. Recently, the project received a lot of attention with the introduction of &#8220;zkLogin.&#8221; As a result, many are diversifying with the altcoin. However, Near Protocol (NEAR) is also grabbing attention, and Circle launched the USDC stablecoin on top of the network. ... <a title=\"Sui Launches zkLogin, Near Protocol Adds USDC Support, Tradecurve Markets Dominates the Trading Market with Hybrid Model\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-launches-zklogin-near-protocol-adds-usdc-support-tradecurve-markets-dominates-the-trading-market-with-hybrid-model/\" aria-label=\"More on Sui Launches zkLogin, Near Protocol Adds USDC Support, Tradecurve Markets Dominates the Trading Market with Hybrid Model\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T09:19:03.000Z",
    "title": "Seoul to Host Esports Festival During League of Legends World Championship Final",
    "url": "https://www.cryptopolitan.com/seoul-to-host-esports-festival/",
    "description": "The Seoul Metropolitan Government is set to host a groundbreaking Esports festival at Gwanghwamun Square in central Seoul, coinciding with the much-anticipated League of Legends (LoL) World Championship final. This initiative aims to position the city as a thriving hub for Esports, leveraging the global popularity of the tournament. The League of Legends World Championship ... <a title=\"Seoul to Host Esports Festival During League of Legends World Championship Final\" class=\"read-more\" href=\"https://www.cryptopolitan.com/seoul-to-host-esports-festival/\" aria-label=\"More on Seoul to Host Esports Festival During League of Legends World Championship Final\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T09:25:38.000Z",
    "title": "Google Bard previews Ethereum, Arbitrum, Kangamoon’s potential",
    "url": "https://crypto.news/google-bard-previews-ethereum-arbitrum-kangamoons-potential/",
    "description": "Ethereum (ETH), Arbitrum (ARB), and Kangamoon (KANG) are three coins that Google Bard, the AI chatbot, has singled out"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T09:22:48.000Z",
    "title": "Crypto trader turns $3.2k investment into $313k in three weeks",
    "url": "https://crypto.news/crypto-trader-turns-3-2k-investment-into-313k-in-three-weeks/",
    "description": "Blockchain analysis reveals a 19-day journey of an anonymous crypto wallet that turned $3.2k into $313k by investing in ICOs and meme tokens. In a stunning 19-day run, an anonymous crypto wallet owner turned an initial investment of $3,200 into&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T09:30:49.000Z",
    "title": "Ripple CTO Explains Company’s Stance On Debunking Outrageous XRP Price Predictions",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-cto-xrp-price-predictions/",
    "description": "Over the last few months, there have been a number of XRP price predictions that have taken the crypto market by surprise. While some of these have looked to be attainable, others have carried price ranges that seem impossible for the current vantage point. A s a result of community members questioning what Ripple can do about these predictions, Ripple CTO David Schwartz has come forward to explain why the company is not debunking the predictions. Ripple CTO Says It’s Hard An X (formerly Twitter) user drew the attention of the Ripple CTO toward the numerous XRP price predictions that have been making the rounds on social media. The X user who goes by Darkhorse called out Ripple and its founders for not debunking these outrageous price predictions that have gone as high as $50,000, saying that “Ripple have let people suffer, while Ripple founders hit the rich list &#38; post $2m porches.” Related Reading: Incoming Milestone Could Be Very Bullish For XRP Price, Here’s Why To round off the post, Darkhorse explained that they could’ve easily debunked these XRP price predictions to prevent this. “Would of taken 1 post to correct the BS just 1,” the user said. Schwartz who was mentioned in the tweet responded to Darkhorse’s complaints to explain why the crypto firm has not necessarily come forward to debunk the XRP price predictions. He starts out by saying that while he understands how the user felt, “it’s a lot harder than you think.” The Ripple CTO explains that debunking everything could open up a chance that the company ends up debunking something that actually turns out to be true. He further added; “If we call out everything we know is false, we&#8217;ll be seen to be enforcing things we don&#8217;t know aren&#8217;t fake because we won&#8217;t can them out.” Lastly, the CTO points to the possibility of legal risks arising from trying to debunk all of the price predictions. I completely understand why you feel this way, I do sometimes too. But it&#8217;s a lot harder than you think. We don&#8217;t know everything, and even a small chance we &#8220;debunk&#8221; something true is worrisome. If we call out everything we know is false, we&#8217;ll be seen to be enforcing things we… — David &#8220;JoelKatz&#8221; Schwartz (@JoelKatz) September 17, 2023 XRP Price Predictions Are Still Rampant The XRP price predictions are still coming in hot over the last few weeks. Some of the most notable ones include the $10,000 forecast put forward by an analyst who goes by Lord XRP on X (formerly Twitter). The prediction follows one from a Wells Fargo Manager placing the XRP price at $500. Related Reading: Coinbase’s BASE Shows Teeth As TVL Nears Solana Both of these price predictions actually follow the expectation that Ripple will begin to capture a larger share of the payments market. When this happens, the analysts expect the XRP price to rise exponentially as a result of the share of the market cap commanded by Ripple. Smaller price predictions have also included a predicted run to $130 by pseudonymous crypto analyst XRP Captain. However, the appearance of a death cross in the price trend over the last few days suggests none of these predictions would be happening anytime soon. Token price holding $0.5 support &#124; Source: XRPUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T09:29:10.000Z",
    "title": "Built-In SHIB Burn Using Shibarium Could Propel Shiba Inu Price to a New All-Time High Once Billion-Dollar Companies Start Using It",
    "url": "https://www.crypto-news-flash.com/built-in-shib-burn-using-shibarium-could-propel-shiba-inu-price-to-a-new-all-time-high-once-billion-dollar-companies-start-using-it/?utm_source=rss&utm_medium=rss&utm_campaign=built-in-shib-burn-using-shibarium-could-propel-shiba-inu-price-to-a-new-all-time-high-once-billion-dollar-companies-start-using-it",
    "description": "<img width=\"1280\" height=\"711\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-300x167.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-1024x569.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-768x427.png 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Lucie stressed that SHIB token burns are driven by the community&#8217;s engagement, not a demand for action from developers. Shibarium, Shiba Inu&#8217;s Layer-2 network, is approaching a significant milestone with nearly three million total transactions. In a recent tweet, Lucie, representing the Shiba Inu community, addressed a crucial matter circulating among SHIB token enthusiasts. The [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-19T09:22:57.000Z",
    "title": "Is This Is the Easiest Way to Stake DOT?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/is-this-is-the-easiest-way-to-stake-dot/",
    "description": "<p>Polkadot hardly needs any introduction within the crypto space, especially in the DeFi market. In simple terms, Polkadot is a protocol that connects blockchains. This way, it allows blockchains like Bitcoin and Ethereum, which were previously incompatible, to share data. In this article, you will discover DOT use cases and a new way to stake [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/is-this-is-the-easiest-way-to-stake-dot/\">Is This Is the Easiest Way to Stake DOT?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-19T09:15:15.000Z",
    "title": "Billionaire Ray Dalio Warns More Money Printing Coming for US Amid Rapid Debt Accumulation",
    "url": "https://dailyhodl.com/2023/09/19/billionaire-ray-dalio-warns-more-money-printing-coming-for-us-amid-rapid-debt-accumulation/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Warns-More-Money-Printing.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire investor Ray Dalio says that the US will likely turn on the money printers again as it takes on more debt. Speaking at the All-In Summit, Dalio says that the United States will eventually struggle to pay off its financial obligations as it piles on more debt. With the country&#8217;s rising debt levels, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/19/billionaire-ray-dalio-warns-more-money-printing-coming-for-us-amid-rapid-debt-accumulation/\">Billionaire Ray Dalio Warns More Money Printing Coming for US Amid Rapid Debt Accumulation</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]