[
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T20:19:28.000Z",
    "title": "Bitcoin options data highlights traders’ belief in further BTC price upside",
    "url": "http://cointelegraph.com/news/bitcoin-options-highlights-traders-belief-in-btc-price-upside",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ed806237-bcdd-4daf-8998-9059d5ee965d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Open interest on Bitcoin options recently hit a year-to-date high, but what is fueling this newfound bullish sentiment?  </p>\n                    <p><p>The recent gains are a rare sight in 2023, even considering Bitcoin's impressive 108% year-to-date performance. Notably, the last instance of such price action occurred on March 14 when Bitcoin surged from $20,750 to $26,000 in just two days, marking a 25.2% price increase.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/32d5458b-6433-467b-85f1-04aea46f5c1d.png\"><figcaption style=\"text-align: center;\"><em>Deribit BTC options daily volume, in BTC. Source: Deribit</em></figcaption></figure><p>It's worth noting the significance of the fact that a staggering 208,000 contracts changed hands in a mere two days. To put this into perspective, the prior peak, which occurred on August 18, saw a total of 132,000 contracts exchanged, but that was during a period when Bitcoin's price plummeted by 10.7% from $29,090 to $25,980 in just two days. Interestingly, Bitcoin's options open interest, which measures outstanding contracts for every expiry, reached its highest level in over 12 months on Oct. 26.</p><p>This surge in activity has led some analysts to emphasize the potential \"gamma squeeze\" risk. This theoretical analysis seeks to capture the need for option market makers to cover their risk based on their likely exposure.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">the <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&ref_src=twsrc%5Etfw\">#bitcoin</a> gamma squeeze from last week could happen again <br><br>if BTCUSD moves higher to $35,750-36k, options dealers will need to buy $20m in spot BTC for every 1% upside move, which could cause explosiveness if we begin to move up towards those levels<br><br>more  <a href=\"https://t.co/OA9tJ0ZaK9\">pic.twitter.com/OA9tJ0ZaK9</a></p>— Alex Thorn (@intangiblecoins) <a href=\"https://twitter.com/intangiblecoins/status/1718789234398556416?ref_src=twsrc%5Etfw\">October 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to estimates from Galaxy Research and Amberdata, BTC options market makers may need to cover $40 million for every 2% positive move in Bitcoin's spot price. While this number may seem substantial, it pales in comparison to Bitcoin's staggering daily adjusted volume of $7.8 billion.</p><p>Another aspect to consider when assessing Bitcoin options volume and total open interest is whether these instruments have primarily been used for hedging purposes or neutral-to-bullish strategies. To address this ambiguity, one should closely monitor the demand difference between call (buy) and put (sell) options.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/31d0f1f0-6975-4727-a45a-1d5f42f77329.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin options put-to-call volume ratio. Source: Laevitas.ch</em></figcaption></figure><p>Notably, the period from Oct. 16 to Oct. 26 saw a predominance of neutral-to-bullish call options, with the ratio consistently remaining below 1. Consequently, the excessive volume observed on Oct. 23 and 24 was skewed towards call options. </p><p>However, the landscape changed as investors increasingly sought protective put options, reaching a peak of 68% higher demand on Oct. 28. More recently, the metric shifted to a neutral 1.10 ratio on Oct. 30, indicating a balanced demand between put and call options.</p><h2>How confident are Bitcoin option traders?</h2><p>To gauge whether investors using options have grown more confident as Bitcoin's price held above $34,000 on Oct. 30, one should analyze the Bitcoin options delta skew. When traders anticipate a drop in Bitcoin's price, the delta 25% skew tends to rise above 7%, while periods of excitement typically see it dip below negative 7%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/fd888a8e-fc32-45d4-af70-940a0e6564fb.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas</em></figcaption></figure><p>The Bitcoin options' 25% delta skew shifted to a neutral position on Oct. 24 after residing in bullish territory for five consecutive days. However, as investors realized that the $33,500 support level proved more resilient than anticipated, their confidence improved on Oct. 27, causing the skew indicator to re-enter the bullish zone below negative 7%.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-bull-move-not-over-here-are-3-reasons-why\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-bull-move-not-over-here-are-3-reasons-why/amp\"><strong><em>Bitcoin’s bull move might not be over yet — Here are 3 reasons why</em></strong></a></p><h2>Extraordinary options premiums and continued optimism</h2><p>Two noteworthy observations emerge from this data. Bitcoin bulls utilizing options contracts prior to the 17% rally that began on Oct. 23 were paying the highest premium relative to put options in over 12 months. A negative 18% skew is highly uncommon and signifies extreme confidence or optimism, likely fueled by expectations of the spot Bitcoin ETF.</p><p>What stands out most, however, is the present negative 13% skew after Bitcoin's price surged by 26.7% in the 15 days leading up to Oct. 27. Normally, investors would seek protective puts to hedge some of their gains, but this did not occur. Consequently, even if the initial demand for call options was primarily driven by ETF expectations, the prevailing optimism has endured as Bitcoin soared above $34,000.</p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) options volumes experienced a significant surge on Oct. 23 and Oct. 24, marking the highest level in over six months. This activity coincided with a remarkable 17% BTC price rally over two days. Traders are now pondering whether the increased activity in the BTC options market can be solely attributed to the<a href=\"https://cointelegraph.com/news/sec-bitcoin-etf-position-inconsistent-gary-gensler-mit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-bitcoin-etf-position-inconsistent-gary-gensler-mit/amp\"> anticipation of a Bitcoin spot exchange-traded fund (ETF)</a> or if the optimism has dwindled following the recent price surge above $34,000.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-30T20:30:37.000Z",
    "title": "Bank of Spain Report: Most Spaniards Don’t Want Digital Euro, 65% Would Not Use It",
    "url": "https://news.bitcoin.com/bank-of-spain-report-most-spaniards-dont-want-digital-euro-65-would-not-use-it/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bank of Spain Report: Spaniards Despise the Digital Euro, 65% Would Not Use It\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-a-digital-euro-token-with-a-flag-of-spain-in-the-background-27489-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A recent report issued by the Bank of Spain that inquires about how Spaniards use cash for payments has revealed the low degree of confidence they have in a hypothetical digital euro. 65% of the citizens surveyed reported that they would not use the digital euro as they feel comfortable with the payment options available [&#8230;]"
  }
]