[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T15:44:42.000Z",
    "title": "Sizing the Massive Spot Bitcoin ETF Opportunity",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/06/sizing-the-massive-spot-bitcoin-etf-opportunity/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The likely imminent approval of spot exchange-traded funds for bitcoin could be a game-changing moment for the digital assets industry. Brian Rudick and Matt Kunke, at GSR, explain why."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-06T15:49:27.000Z",
    "title": "XRP Leads Crypto Market Rally, Soaring 12% Overnight",
    "url": "https://decrypt.co/204439/xrp-leads-crypto-market-rally-soaring-overnight",
    "description": "XRP is right now the biggest winner out of the top 20 biggest coins and tokens. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-06T16:00:40.000Z",
    "title": "Gold remains stable while volatility rocks Bitcoin and Ethereum’s 2023",
    "url": "https://cryptoslate.com/volatility-marks-btc-and-eth-while-gold-remains-stable-in-2023/",
    "description": "<p>Gold, historically viewed as a store of value and a hedge against economic turbulence, is often the benchmark asset against which many others are gauged. In the crypto age, Bitcoin (BTC) and Ethereum (ETH) have emerged as contenders to gold&#8217;s throne, not as direct replacements but as modern alternatives representing a new breed of digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/volatility-marks-btc-and-eth-while-gold-remains-stable-in-2023/\">Gold remains stable while volatility rocks Bitcoin and Ethereum&#8217;s 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-06T16:02:40.000Z",
    "title": "Lado Okhotnikov and Meta Force Presented an Updated Program for NFT Operations",
    "url": "https://www.cryptoglobe.com/latest/2023/11/lado-okhotnikov-and-meta-force-presented-an-updated-program-for-nft-operations/",
    "description": "Lado Okhotnikov’s Meta Force proves that NFT are still in demand and can be successfully used.  The Meta Force team presented an updated Tactile program, optimized for NFT operations in digital space of Meta Force Metaverse. Extended trade and financial operations available to users. Tactile has advanced functionality to work with NFT like real objects. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-06T15:48:37.000Z",
    "title": "Maestro Trading Bot Refunds 610 ETH to Users Following Router Exploit",
    "url": "https://cryptodaily.co.uk/2023/11/maestro-trading-bot-refunds-610-eth-to-users-following-router-exploit",
    "description": "MaestroBots, a prominent cryptocurrency trading bot on the Telegram messenger app, has swiftly taken action to refund users who were affected by a recent smart contract exploit. In an incident that unfolded on October 24, a total of 280 ETH was targeted."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T15:45:00.000Z",
    "title": "Mauritius collecting feedback for inclusion of the metaverse",
    "url": "https://crypto.news/mauritius-collecting-feedback-for-inclusion-of-the-metaverse/",
    "description": "A consultation paper dated October 2023 shares the Financial Services Commission (FSC) of East African country Mauritius started collecting feedback about the inclusion of metaverse within the financial services industry."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T15:42:57.000Z",
    "title": "Is Ripple’s XRP headed for a new peak? Current trends and predictions",
    "url": "https://crypto.news/is-ripples-xrp-headed-for-a-new-peak-current-trends-and-predictions/",
    "description": "As XRP continues its steady ascent, we dissect the factors contributing to its sustained growth, from legal victories to strategic partnerships that shape its market standing."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T16:00:04.000Z",
    "title": "Can The ADA Price Climb Above $20 In The Bull Market? Analyst Provides Answers",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-20-bull-market/",
    "description": "The ADA price has always performed incredibly well in the bull market cycles with price rallies that have put millions of holders in profit in the past. However, like any other cryptocurrency, it can be hard to pinpoint how high the price will climb in the next bull market. Nevertheless, one crypto analyst is taking the bull by the horns to reveal where they expect the altcoin’s price to reach in the next bull market. ADA Price Could Rise As High As $24 In an analysis posted to TradingView, crypto analyst masoud_paydarsani outlines how the ADA price could rise to double-digits. First, the analyst points to Cardano’s ADA token being a long-term upward channel on the weekly time frame, albeit a rather slow uptrend. Related Reading: Shiba Inu Whales Bet Big As Shibarium Grows – Road To $0.1? However, this does not invalidate its bullish tendencies, especially when it comes to ADA repeating its previous bull market cycles. Masoud points to the fact that the past crypto market cycles saw approximately 108 weeks of the bear market before 66 weeks of the bull market, and it is within these 66 weeks that ADA shines. Source: Tradingview.com The analyst believes that if the upward channel is validated, then the next ADA bull run could turn out like the rest. Using the previous performances of the altcoin, eg, the run-up in the year 2021, the ADA price could rise to as high as $24 following the same trend. Also, going by historical performance, the crypto analyst reveals that this could happen sometime in the next 66 weeks. So it could lead up to 2025 before this rally is complete. Being Bullish For ADA Above $20 Interestingly, the expectation for the ADA price to cross the $20 mark is not unique to Masoud alone. Another crypto analyst, @LucidCiC on X (formerly Twitter) also believes that this double-digit level is possible for ADA. Related Reading: Why This Fidelity Investments Director Believes Bitcoin Is ‘Exponential Gold’ Lucid actually has an even higher price target for the altcoin compared to Masoud. Where Masoud sees the ADA price reaching $24, Lucid’s forecast goes as high as $30. Lucid compares Cardano to the Ethereum network which was able to reach a $500 billion market cap despite going through multiple hurdles. Given this, the analyst believes Cardano will also be able to rise as well while expecting the crypto market cap to cross $10 trillion in a decade. Cardano is also seeing a good amount of interest from institutional investors. Grayscale Investments, the company behind the largest Bitcoin trust in the world, recently announced new crypto indices featuring ADA in response to this rising interest. If these large investors continue to double down on their investments, this newfound inflow could drive the price to the double-digit mark predicted by the analysts. ADA recovers above $0.34 &#124; Source: ADAUSD on Tradingview.com Featured image from VOI, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-06T16:07:12.000Z",
    "title": "FTX Makes a Move to Cash In: Seeks Approval to Sell $744 Million in Trust Assets",
    "url": "https://www.crypto-news-flash.com/ftx-makes-a-move-to-cash-in-seeks-approval-to-sell-744-million-in-trust-assets/?utm_source=rss&utm_medium=rss&utm_campaign=ftx-makes-a-move-to-cash-in-seeks-approval-to-sell-744-million-in-trust-assets",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />FTX is seeking court approval to sell $744 million worth of trust assets to pay off creditors during its bankruptcy. The company&#8217;s strategy involves quick sales to multiple buyers to avoid delays and maximize returns. FTX and its associated debtors have petitioned the Delaware bankruptcy court to approve liquidating trust assets valued at roughly $744 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-06T16:05:00.000Z",
    "title": "South Korea Bans Short Selling Ahead of Upcoming Election",
    "url": "https://coinedition.com/south-korea-bans-short-selling-ahead-of-upcoming-election/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"South Korea Bans Short Selling Ahead of Upcoming Election\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/South_Korea_Eyes_Lifting_Short_Selling_Ban_to_Entice_Foreign_Investors-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>South Korea has banned short-selling until at least June 2024. Shares in South Korea rose Monday morning, with the country’s benchmark Kospi gaining 4%. The reason for the ban is to appease retail investors by curbing unfair trading practices. South Korea has banned short-selling until at least June 2024. According to multiple reports, the reason [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/south-korea-bans-short-selling-ahead-of-upcoming-election/\">South Korea Bans Short Selling Ahead of Upcoming Election</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]