[
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T11:57:30.000Z",
    "title": "UK publishes plans for stablecoins regulation ",
    "url": "http://cointelegraph.com/news/uk-plans-stablecoins-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9f11fb0a-0d23-4370-a112-b1bb1de4aa69.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Non-fiat-backed types of stablecoins will not be allowed into regulated payment chains.</p>\n                    <p><p>The United Kingdom government presented an update on its plans to regulate fiat-backed stablecoins. The document, <a href=\"https://assets.publishing.service.gov.uk/media/653a82b7e6c968000daa9bdd/Update_on_Plans_for_Regulation_of_Fiat-backed_Stablecoins_13.10.23_FINAL.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on Oct. 30, aims to facilitate and regulate the use of fiat-backed stablecoins in U.K. payment chains.</p><p>According to the document, His Majesty’s Treasury intends to introduce specific legislation to parliament in 2024, bringing the regulation of fiat-backed stablecoins under the Financial Conduct Authority’s (FCA) mandate. </p><p>Notably, the Treasury is looking into making the local companies, “arrangers of payment,” authorized by the FCA, responsible for ensuring the overseas stablecoin meets the local standards. </p><p>Non-fiat-backed types of stablecoins — a definition that includes the algorithmic ones — will not be allowed into regulated payment chains. However, the document doesn’t impose a direct ban but makes a reservation that “these transactions will remain unregulated.” Moreover, HM Treasury considers them subject to the same requirements as unbacked cryptoassets.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/uk-bill-seize-bitcoin-passed\"><strong><em>UK passes bill to enable authorities to seize Bitcoin used for crime</em></strong></a></p><p>As for the standard stablecoins, the FCA will get the authority to demand from the stablecoin issuers to hold all the reserve funds in a statutory trust. The terms of the trust will be set out in the FCA’s rules, including the redemption obligations in the case of the firm’s failure. In the latter scenario, the UK stablecoin issuers will face procedures under the Insolvency Act 1986. </p><p>The central framework for all kinds of crypto, the Financial Services and Markets Act, passed the upper Chamber of the British Parliament <a href=\"https://cointelegraph.com/news/uk-crypto-bill-reaches-final-stage-on-track-for-passage\">in June 2023</a>. The Treasury’s document repeatedly refers to the bill, naming it the FCMA 2023. It is under the FCMA 2023 that the Treasury, the Bank of England and the FCA get their powers to regulate crypto and stablecoins in particular. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking. Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T11:53:57.000Z",
    "title": "G7 countries to launch AI code of conduct: Report ",
    "url": "http://cointelegraph.com/news/g7-countries-ai-code-of-conduct-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7e479ac6-185a-44b8-ba3b-54a0a3b3ea47.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Group of Seven (G7) countries will agree on a voluntary AI code of conduct for companies developing AI to reference for mitigating risks and benefits of the technology.</p>\n                    <p><p>The Group of Seven (G7) industrial countries are scheduled to agree upon an artificial intelligence (AI) code of conduct for developers on Oct. 30, according to a report by Reuters. </p><p>According to the <a href=\"https://www.reuters.com/technology/g7-agree-ai-code-conduct-companies-g7-document-2023-10-29/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, the code has 11 points that aim to promote “safe, secure, and trustworthy AI worldwide” and help “seize” the benefits of AI, while still addressing and troubleshooting the risks it poses.</p><p>The plan was <a href=\"https://subscriber.politicopro.com/article/2023/10/g7-countries-agree-on-guidelines-for-artificial-intelligence-00120583\" target=\"_blank\" rel=\"noopener nofollow\">drafted</a> by G7 leaders back in September. It says it offers voluntary guidance of actions for \"organizations developing the most advanced AI systems, including the most advanced foundation models and generative AI systems.”</p><p>Additionally, it suggests that companies should publicize reports on the capabilities, limitations, use and misuse of the systems being built. Robust security controls for said systems are also recommended. </p><p>Countries involved in the G7 include Canada, France, Germany, Italy, Japan, the United Kingdom, the United States and the European Union. </p><p>Cointelegraph has reached out to the G7 for confirmation of the development and additional information. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/new-data-poisoning-tool-punish-ai-scraping-art-without-permission\"><strong><em>New data poisoning tool would punish AI for scraping art without permission</em></strong></a></p><p>This year’s G7 took place in Hiroshima, Japan, and a <a href=\"https://www.g7hiroshima.go.jp/ministerialmeetings/pdf/takasaki_en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">meeting</a> was held between all participating Digital and Tech Ministers on April 29 and 30.</p><p>Topics covered in the meeting included emerging technologies, digital infrastructure and AI, with an agenda item specifically dedicated to responsible AI and global AI governance. </p><p>The G7’s AI code of conduct comes as governments across the world are trying to navigate the emergence of AI with its useful capabilities and its concerns. The EU was among one of the first governing bodies to establish guidelines with its landmark EU AI Act, which had its <a href=\"https://cointelegraph.com/news/european-union-ai-act-passes-in-parliament\">first draft passed</a> back in June. </p><p>On Oct. 26, the United Nations established a <a href=\"https://cointelegraph.com/news/un-launches-international-effort-ai-governance-challenges\">39-member advisory committee</a> to tackle issues related to the global regulation of AI. </p><p>The Chinese government also <a href=\"https://cointelegraph.com/news/china-s-new-ai-regulations-begin-to-take-effect\">launched its own AI regulation</a>, which began to take effect back in August. </p><p>From within the industry, the developer of the popular AI chatbot ChatGPT, OpenAI, announced that it plans to create <a href=\"https://cointelegraph.com/news/chatgpt-openai-new-team-ai-risks\">a \"preparedness\" team</a> which will assess a range of AI-related risks. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/\"><strong><em>AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T11:51:32.000Z",
    "title": "Stars Arena CEO quits after $3M cyber heist",
    "url": "https://www.cryptopolitan.com/stars-arena-ceo-quits-after-3m-cyber-heist/",
    "description": "In a recent development, the CEO of Stars Arena, Chill Pill, has officially resigned from his position, marking a significant change in the leadership of the social finance app operating within the Avalanche ecosystem. The resignation was announced by Stars Arena leaving the community and investors in anticipation of the project&#8217;s future direction. Stars Arena, ... <a title=\"Stars Arena CEO quits after $3M cyber heist\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stars-arena-ceo-quits-after-3m-cyber-heist/\" aria-label=\"More on Stars Arena CEO quits after $3M cyber heist\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T12:03:57.000Z",
    "title": "Bitcoin mining difficulty reached new ATH",
    "url": "https://crypto.news/bitcoin-mining-difficulty-reached-new-ath/",
    "description": "On Oct. 30, Bitcoin (BTC) mining difficulty increased by 2.35%, setting a new all-time high. This is the fourth increase in a row, according to BTC.com. At the time of writing, Bitcoin mining difficulty is 62.46 T. The average Bitcoin&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T11:51:23.000Z",
    "title": "PEPE jumps 60% in a week, emerges as top gainer",
    "url": "https://crypto.news/pepe-jumps-60-in-a-week-emerges-as-top-gainer/",
    "description": "Pepe (PEPE) has appreciated 60% over the past week, securing the top gainer spot weekly, as social volume sees a remarkable upswing. Amid a promising October, the asset has leveraged the ongoing market-wide rally to recover the values it lost&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T12:00:44.000Z",
    "title": "XRP Price Breakout Soon? Analyst Points To Bullish Structural Signs",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-breakout-soon-analyst-bullish-structural-signs/",
    "description": "In a detailed analysis shared on social media today, renowned crypto analyst Egrag points to several bullish indicators in the XRP price structure, suggesting the potential for an imminent breakout. Egrag evaluated various timeframes, identifying a series of technical patterns and formations that bolster the bullish outlook. XRP Shows Strong Bullish Structural Signs &#8220;Last week&#8217;s candle closed within the confines of the Yellow structural formation,&#8221; Egrag tweeted with regard to the weekly XRP/USD chart, emphasizing the significance of recent movements within the timeframe. This observation is instrumental in understanding the underlying market structures influencing the upcoming price action. Related Reading: SEC Demands $700 Million Settlement From Ripple, Pro-XRP Lawyer Reveals Next Steps The implication? If another weekly candle were to affirm its position within this formation, the odds of a bullish trend continuation could significantly increase. “To confirm a bullish trend continuation, we need to see another weekly candle close with a full body inside this structure,” Egrag added. Next, his insights extend further to the three-day chart, where he keenly observes, “In just 16 hours, XRP is poised to complete the second full body candle within the structural formation, signaling a strong bullish sentiment.&#8221; This near-term projection underscores a sense of momentum that appears to be building within the XRP market. The 1-day chart, too, garnered Egrag&#8217;s scrutiny. He highlighted the imminent completion of the seventh full-body candle within the current structure, stating this indicates an &#8220;extremely bullish trend.&#8221; This observation suggests that XRP&#8217;s bullish behavior isn&#8217;t just a fleeting phenomenon but has consistency across varying timeframes. For traders with a penchant for shorter timeframes, Egrag’s insights into the 12-hour chart are particularly salient. While there have been multiple closures within the structural formation, he singled out the importance of the ongoing momentum: “The current candle and the next one are pivotal as they form a symmetrical triangle.” Related Reading: XRP Price Could Blast Off In 18 Days, Here’s Why He elaborated on the implications of this pattern, saying, “Typically, symmetrical triangle breakouts have a 50/50 chance, making this a decision point for XRP.” XRP Price Targets Circling back to a tweet from October 27, Egrag had demarcated significant price zones, highlighting the “$0.54 to $0.58” range as a make-or-break threshold. Beyond this, he indicated the &#8220;$0.63-$0.70&#8221; range as a pivotal indicator of market sentiment shifts. For those with an eye on the psychological dimensions of trading, Egrag’s mention of the &#8220;0.93-$1&#8221; bracket is noteworthy. He cautioned traders about this zone, advising them to “Stick to your plan and resist the temptation to let emotions or impatience dictate your actions.” In sum, Egrag&#8217;s comprehensive analysis blends technical data with trader sentiment and psychology, providing a nuanced and detailed perspective for those invested in XRP. The coming days are likely to be watched with bated breath as traders anticipate the next big move. At press time, XRP traded at $0.5595. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T12:09:02.000Z",
    "title": "Uphold’s Open Market XRP Purchase Fuels Speculation on XRP Hitting $1000",
    "url": "https://www.crypto-news-flash.com/upholds-open-market-xrp-purchase-fuels-speculation-on-xrp-hitting-1000/?utm_source=rss&utm_medium=rss&utm_campaign=upholds-open-market-xrp-purchase-fuels-speculation-on-xrp-hitting-1000",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Uphold partners with Ripple to use XRP for cross-border transactions in the United States, addressing regulatory concerns. Uphold clarifies it won&#8217;t use customers&#8217; XRP deposits for transactions, opting to purchase XRP from the open market. Uphold, the U.S.-based trading platform has revealed its intent to acquire XRP from the open market for Ripple Payments transactions [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T11:55:41.000Z",
    "title": "Dogecoin Poised for Fresh Uptrend, DOGE Technical Indicator Signals 13% Rally for DOGE ",
    "url": "https://www.crypto-news-flash.com/dogecoin-poised-for-fresh-uptrend-doge-technical-indicator-signals-13-rally-for-doge/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-poised-for-fresh-uptrend-doge-technical-indicator-signals-13-rally-for-doge",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Doge\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Dogecoin is expected to complete a 13 percent surge to hit $0.07 despite facing resistance along the way.  The asset was trading at $0.061 at the time of this prediction, indicating that the analyst is almost right  Dogecoin (DOGE) was one of the best-performing crypto assets in the recent rally. Although its current market sentiment [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-30T12:08:47.000Z",
    "title": "Discovering Bitcoin’s Ordinals with Great Potential",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/discovering-bitcoins-ordinals-with-great-potential/",
    "description": "<p>One fascinating aspect of this digital realm is the concept of Bitcoin ordinals. These are unique and rare digital assets that have been generated from the Bitcoin blockchain. In this article, we will delve into the realm of Bitcoin&#8217;s ordinals. Also, I will discuss how to discover those with great potential. We will also explore [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/discovering-bitcoins-ordinals-with-great-potential/\">Discovering Bitcoin&#8217;s Ordinals with Great Potential</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T11:49:00.000Z",
    "title": "Search Engines Provide Fertile Ground for Fake Crypto Wallets: Research",
    "url": "https://coinedition.com/search-engines-provide-fertile-ground-for-fake-crypto-wallets-research/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/SCAM-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/SCAM-9.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/SCAM-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/SCAM-9-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/SCAM-9-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/SCAM-9-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The prominent blockchain security firm Bitrace has disclosed that the proliferation of counterfeit wallet apps downloaded through search engines is a leading cause of cryptocurrency losses. The firm revealed this finding in a recent report underscoring the “disappearing coin” phenomenon, which crypto investors often lamented. Bitrace argued that search engines provide a thriving environment for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/search-engines-provide-fertile-ground-for-fake-crypto-wallets-research/\">Search Engines Provide Fertile Ground for Fake Crypto Wallets: Research</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-30T11:45:30.000Z",
    "title": "Here’s When Bitcoin (BTC) Could Reach All-Time Highs, According to Crypto Analyst Jason Pizzino",
    "url": "https://dailyhodl.com/2023/10/30/heres-when-bitcoin-btc-could-reach-all-time-highs-according-to-crypto-analyst-jason-pizzino/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-explode-900.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Closely followed crypto analyst Jason Pizzino is laying out a timeline for when Bitcoin (BTC) could see its next all-time high above the $69,000 level. In a new strategy session, Pizzino tells his 292,000 YouTube subscribers that Bitcoin has historically entered its own bear markets and accumulation phases after the S&#38;P 500 has topped out. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/30/heres-when-bitcoin-btc-could-reach-all-time-highs-according-to-crypto-analyst-jason-pizzino/\">Here’s When Bitcoin (BTC) Could Reach All-Time Highs, According to Crypto Analyst Jason Pizzino</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]