[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-15T09:30:43.000Z",
    "title": "Kim Dotcom-Backed Crypto Startup Bitcache Liquidated in New Zealand",
    "url": "https://news.bitcoin.com/kim-dotcom-backed-crypto-startup-bitcache-liquidated-in-new-zealand/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kim Dotcom-Backed Crypto Startup Bitcache Liquidated in New Zealand\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1721205958.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcache, a crypto startup backed by Kim Dotcom, has been liquidated, reportedly over unpaid legal fees. Phil Creagh, an Auckland lawyer who acted as Bitcache’s director until Sept. 2020, is reported to have applied for the startup’s liquidation on May 24. Bitcache&#8217;s Unpaid Legal Fees A New Zealand-based crypto startup previously promoted by prominent crypto [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T09:38:22.000Z",
    "title": "SEC accepts bitcoin ETF applications from BlackRock, Fidelity, Galaxy Digital",
    "url": "https://crypto.news/sec-accepts-bitcoin-etf-applications-from-blackrock-fidelity-galaxy-digital/",
    "description": "The SEC has initiated the acknowledgment process for spot bitcoin ETF applications. This sets the stage for the potential acceptance of the first such funds in the United States. The SEC has begun acknowledging these spot bitcoin ETF applications. ETF&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-15T09:28:27.000Z",
    "title": "BNB Chain Inks New Record With Soaring User Activity – A Boost For Price?",
    "url": "https://www.newsbtc.com/news/bnb-chain-enjoys-soaring-user-activity/",
    "description": "BNB Chain, the blockchain platform powering the Binance ecosystem, has recently emerged as a formidable force in the crypto world, surpassing its competitors in terms of daily active users. This surge in user engagement has coincided with a surge in the value of the BNB token, which has experienced a steady increase of over 5% within a single week.  As BNB&#8217;s daily active users continue to soar, one can&#8217;t help but question the overall impact of this unprecedented growth. What lies behind BNB&#8217;s ability to outshine its rivals and attract a growing user base? Is there a hidden catalyst propelling its value upwards?  Moreover, as these metrics diverge from the norm, skeptics begin to raise valid concerns about the sustainability and potential risks associated with BNB&#8217;s rise. BNB Chain Surpasses BTC, ETH In Daily Active Users In the ever-evolving landscape of blockchain technology, BNB Chain has recently achieved a significant milestone, surpassing renowned chains such as Bitcoin (BTC) and Ethereum (ETH) in terms of daily user activity. According to a BNB analysis, the chain secured the second position, solidifying its position as a formidable player in the crypto world. Related Reading: Cardano Development Activity Dropping – What Does It Mean For ADA Price? Token Terminal&#8217;s data also revealed that BNB Chain boasts an impressive count of over 1 million daily active users, a testament to the platform&#8217;s growing popularity and appeal. This notable achievement is even more remarkable considering the longstanding dominance of Bitcoin and Ethereum, which have traditionally held the top positions in the cryptocurrency market. Source: Token Terminal The BNB token has also made waves in the market. Currently priced at $248.78, it experienced a slight setback with a 3.5% slump in the past 24 hours. However, the token quickly bounced back with a decent 5.4% increase in the last week. Source: CoinMarketCap Mixed Signals While the BNB Chain has garnered widespread enthusiasm and positioned itself as a competitive player in the crypto market, recent data from Santiment reveals a nuanced picture. Despite the chain&#8217;s impressive user base, as measured by daily active addresses, the level of excitement appears to be relatively consistent without any notable spikes, according to Santiment&#8217;s analysis. &#160; Source: Santiment Related Reading: Optimism (OP) Rides The Wave Of Today’s Crypto Surge With 15% Rally When examining the Total Value Locked (TVL) metric, which indicates the amount of assets held within a blockchain protocol, BNB Chain falls behind Ethereum and Tron, occupying the third position. As of the latest data, the TVL for BNB Chain stands at approximately $3.4 billion, highlighting room for growth in this area. Total cryptocurrencies market cap at $1.18 trillion. Chart: TradingView.com Similarly, the stablecoin market cap on the BNB Chain has exceeded $5 billion. However, Santiment&#8217;s charts indicate that both the TVL and market cap metrics have yet to exhibit a significant upward trend, despite the chain&#8217;s growing user base. This suggests that while BNB Chain boasts a higher number of active users, the overall TVL and market cap have not fully reflected this growth. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Gadgets 360"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-15T09:15:55.000Z",
    "title": "XRP Has High Likelihood of a Second Pump, Predicts Crypto Analytics Firm Santiment – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/07/15/xrp-has-high-likelihood-of-a-second-pump-predicts-crypto-analytics-firm-santiment-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/a-Second-Pump-xrp.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics platform Santiment is laying out the path forward for XRP after a court ruled that Ripple Labs&#8217; automated, open-market XRP sales did not constitute a sale of securities. In a new Santiment Insights blog post, the firm&#8217;s director of marketing, Brian Quinlivan, says that XRP, which rallied by over 70% after the court [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/15/xrp-has-high-likelihood-of-a-second-pump-predicts-crypto-analytics-firm-santiment-but-theres-a-catch/\">XRP Has High Likelihood of a Second Pump, Predicts Crypto Analytics Firm Santiment – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]