[
  {
    "source": "Decrypt",
    "date": "2023-07-25T18:45:51.000Z",
    "title": "Dogecoin Surges 9% After Cryptic Elon Musk Tweets Link DOGE and X",
    "url": "https://decrypt.co/149992/dogecoin-surges-on-elon-musk-tweet-will-it-be-integrated-into-x-com",
    "description": "Bitcoin, Ethereum, and other digital assets aren't moving much today. But Dogecoin is after Musk tweeted about it."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T19:00:00.000Z",
    "title": "Frostsnap Method Developed For Bitcoin Multisig Wallets",
    "url": "https://cryptodaily.co.uk/2023/07/frostsnap-method-developed-for-bitcoin-multisig-wallets",
    "description": "<p class=\"md-end-block md-p\">A team of Bitcoin developers and enthusiasts have introduced what's been dubbed the \"Frostsnap\" method, one that is set to provide multisig wallets with a range of new capabilities, transforming them from a static tool to a flexible, adaptive system.</p>\n<p class=\"md-end-block md-p\">With this new development, Bitcoin multisig wallets, known for their secure nature, are getting a significant upgrade. Multisignature or multisig wallets have always been a go-to for safeguarding funds on the Bitcoin network. Their modus operandi requires multiple signers to authorize any transaction, which adds a layer of security. But one of the limitations with traditional multisigs is that they can't add signers without creating a new wallet, an action that calls for transferring funds.</p>\nThe Solution\n<p class=\"md-end-block md-p\">The newly-introduced Frostsnap method proposes a solution to this inconvenience. It allows for the replacement of hardware wallets such as Ledgers, Trezors, ColdCards, or other similar permutations, without the need for additional on-chain transactions. It's also capable of adding new signers to a key after the initial private key generation event and rendering stolen hardware wallets incompatible with every other device of the multisig. Adam Mashrique, the project's hardware lead, affirmed the team's ambition to create an open standard that vendors could implement, thereby enabling different devices to be part of a FROST multisig wallet.</p>\nReshaping the Multisig Landscape\n<p class=\"md-end-block md-p\">Frostsnap has already drawn comparisons to a \"Bitcoin multisig centipede\" due to its flexibility and adaptability. Like a centipede, Frostsnap-compatible devices can be replaced, modify the required number of devices to confirm a transaction if a device is compromised, and efficiently facilitate data transfer to Bitcoin nodes with Taproot signatures. The name Frostsnap is a nod to the acronym Flexible Round-Optimized Schnorr Threshold signatures (FROST).</p>\n<p class=\"md-end-block md-p md-focus\">The remarkable aspect of this system is that it's fully in consensus with the Bitcoin network today, requiring no fork or proprietary node software. Despite plans to introduce a Bitcoin Improvement Proposal (BIP) for on-chain FROST support, devices supporting FROST can manage an on-chain Frostsnap wallet today. The development of Frostnap, in an of itself, is FOSS (Free and Open Source Software).</p>\n\n<p dir=\"ltr\" lang=\"en\">Each person is a unique combination of things they know, objects they own, places they can access, and people they trust.How individuals secure their #Bitcoin should reflect this.Introducing Frostsnap, hardware and software evolving Bitcoin ownershiphttps://t.co/Vo111j4p5J</p>\n&mdash; Frostsnap ❄ (@FrostsnapTech) July 20, 2023\n\nSecurity and Flexibility\n<p class=\"md-end-block md-p\">In addition to improved flexibility and security, Frostsnap offers a handful of benefits. Users can back up information onto new devices, making future device swaps easier. It also allows multisig signers to dismiss any stolen device with a threshold number of signatures, providing further security against thieves.</p>\n<p class=\"md-end-block md-p\">Frostsnap provides increased privacy through Taproot, which erfectively conceals the existence or attributes of a Frostsnap wallet. Thanks to Taproot, Frostsnap can also consolidate signature-related data, reducing on-chain fees. Moreover, it can obscure whether a wallet involves Nostr, a federated mint, Bitcoin Script smart contract, or Lightning Network channel.</p>\n<p class=\"md-end-block md-p\">The Frostsnap method stands to offer Bitcoiners a means to sign documents, verify identities, maintain privacy, and secure an organization's bitcoin against the risk of rogue employees or a lost signing device. </p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p class=\"md-end-block md-p md-focus\">&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T19:00:55.000Z",
    "title": "Examining Worldcoin’s Concentrated Supply at Token Launch",
    "url": "https://news.bitcoin.com/examining-worldcoins-concentrated-supply-at-token-launch/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Examining Worldcoin&#039;s Concentrated Supply at Token Launch\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the Monday, July 24, launch of the worldcoin (WLD) token, the cryptocurrency quickly peaked at $3.30 per coin but has since depreciated by over 35%. Despite 18 months of beta testing and claims of more than 2 million sign-ups, the token has a scant 164,195 holders with its circulating supply exceeding 100 million WLD [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T18:49:56.000Z",
    "title": "Grimace deploys on DogeChain, plans to launch DEX and P2E game",
    "url": "https://crypto.news/grimace-deploys-on-dogechain-plans-to-launch-dex-and-p2e-game/",
    "description": "Grimace Coin is a meme coin project on DogeChain. It launched following a light-hearted exchange on Twitter between Elon Musk and McDonald's"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T19:00:38.000Z",
    "title": "UK Regulator To Enquire About Worldcoin, As WLD Declines By 17% One Day Post-Launch",
    "url": "https://www.newsbtc.com/altcoin/uk-regulator-to-enquire-about-worldcoin-as-wld-declines-by-17-one-day-post-launch/",
    "description": "UK data regulator, the Information Commissioner Office (ICO), has laid out intentions to probe the newly launched crypto project Worldcoin.  According to a report by Reuters on July 25, the ICO has taken notice of WorldCoin’s launch in the UK and will now proceed to “making further inquiries.” Launched on Monday, Worldcoin is an Ethereum-based project founded by the CEO of OpenAI, Sam Altman. On the protocol’s official website, it states that Worldcoin aims to be “the world&#8217;s largest identity and financial public network.” To achieve its aim, the network utilizes a digital identification system known as “World ID,” designed to differentiate humans from artificial intelligence online.  Interested Worldcoin users are required to undergo a physical iris scan process at one of the project’s “Orb” locations before being granted a WorldID, prompting much concern over the user’s privacy. Currently, there are three Worldcoin Orb locations in the UK, all of which are based in London. Globally, the crypto project has already managed to establish 125 orbs locations in 20 countries across 5 continents.  Related Reading: Binance Announces Listing Of Sam Altman’s Worldcoin, Opens Deposits Worldcoin Under Criticism Over Privacy Concerns. Although the launch of Worldcoin was greeted with much anticipation and goodwill, the project has also received heavy criticism, especially in relation to its World ID system, which requires users to undergo an in-person iris scan procedure.  Popular crypto lawyer John Deaton, along with many others, believes the process is a threat to users&#8217; freedom and privacy, terming it as “Orwellian.”  In addition, Ethereum Founder Vitalik Buterin also highlighted concerns about the World ID system. In a recent blog post, he stated that an iris scan is likely to reveal more information about users than originally designed.  WLD Declines By 17% A Day After Launch  Following the launch of Worldcoin on Monday, its native token, WLD, had an impressive debut in the market, rising by 88% and hitting a peak price of $3.31. However, the WLD token has since then recorded an overall negative price movement. Based on data from CoinMarketCap, WLD is currently down by 16.76% in the last 24 hours, trading as low as $1.92 within this period.  According to Worldcoin’s whitepaper, WLD is primarily designed as a utility token for network governance. However, the token also serves as a payment medium for specific services in the World App or other crypto wallets.  Related Reading: Countdown To FOMC: What Bitcoin And Crypto Traders Must Brace For At the time of writing, WLD is exchanging hands at $2.13, with a 0.57% gain in the last hour. The token’s 24-hour trading volume is also up by 34.56% and is valued at $403.35 million. With a market cap of $231.09 million, WLD ranks as the 124th largest cryptocurrency in the market.  WLD Trading At $2.2432 On The Hourly Chart &#124; Source: WLDUSDT Chart On Tradingview.com Featured Image From Worldcoin, Chart From Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T18:50:14.000Z",
    "title": "Bitcoin Coinbase Premium Turns Red, US Institutions Disinterested?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-coinbase-premium-red-institutionals-disinterested/",
    "description": "Data shows the Bitcoin Coinbase Premium Gap has turned negative recently, a sign that large US-based investors may be selling currently. Bitcoin Coinbase Premium Gap Has Remained Near Neutral For A While Now As pointed out by an analyst in a CryptoQuant post, the interest from US investors in the asset has declined during the last couple of months. The indicator of interest here is the &#8220;Coinbase Premium Gap,&#8221; which keeps track of the difference between the Bitcoin price listed on Coinbase (USD pair) and that on Binance (USDT pair). The Coinbase exchange is popularly known to be used by US-based investors (especially large institutions), while the Binance platform has a more global audience. Thus, the Coinbase Premium Gap can provide us with hints about the buying or selling pressure differences between these two user bases. When the value of this indicator is positive, it means that the price listed on Coinbase is more than that on Binance. This suggests that American users are potentially participating in a higher amount of buying than global investors currently. On the other hand, negative values of the metric suggest the US-based holders may be doing a higher amount of selling than the worldwide users (or alternatively, they are just buying less of the asset). Related Reading: Will Bitcoin Rebound? This Metric May Be The One To Watch Now, here is a chart that shows the trend in the Bitcoin Coinbase Premium Gap over the last few months: The value of the metric seems to have been around the neutral line in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin Coinbase Premium Gap has turned slightly red recently, implying that the price on Coinbase has become lesser than on Binance. This discount implies that the US-based institutional investors have been participating in a heavier amount of selling than the global users during the latest downward move in the cryptocurrency&#8217;s price. Even before this shift towards the small negative values, the indicator&#8217;s value had been mostly around the neutral mark during the last few months, meaning that American investors didn&#8217;t have any interest in accumulating the asset any more than the rest of the world. Related Reading: Bitcoin Sharks Continue Accumulation, But Whales Stagnate Back during the selloff in June, the US-based holders had even been applying notable selling pressure, as the metric&#8217;s value had been negative. This selloff was due to US-focused FUD from the SEC cases against Binance and Coinbase, so it makes sense that this side of the market was selling to a higher degree. Earlier during the year, though, the US institutional investors had seemed very much interested in the asset, as they had been participating in a high amount of accumulation, which had resulted in the metric turning highly positive. At present, however, it would appear that large American investors continue to be disinterested in Bitcoin, considering that the Premium Gap is still floating near the neutral line. This low level of interest could translate to further downward movement for the digital asset as it struggles to hold above $29,000. BTC Price At the time of writing, Bitcoin is trading around $29,200, down 3% in the last week. BTC has observed a plunge recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T19:03:03.000Z",
    "title": "Ripple Works With Republic of Palau to Mint First Palau Stablecoin (PSC) – Report",
    "url": "https://www.crypto-news-flash.com/ripple-works-with-republic-of-palau-to-mint-first-palau-stablecoin-psc-report/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-works-with-republic-of-palau-to-mint-first-palau-stablecoin-psc-report",
    "description": "<img width=\"512\" height=\"279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71-300x163.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Palau Stablecoin is built on the XRP Ledger (XRPL), showcasing Ripple&#8217;s technology as the foundation of this financial venture.  Ripple and the Republic of Palau initiated their partnership in late December of the previous year.   The Republic of Palau has joined forces with Ripple Labs to create its inaugural stablecoin, the Palau Stablecoin (PSC). [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T19:01:23.000Z",
    "title": "Governments Forge Ahead in Development of CBDCs Despite Being Unpopular and Risky – Monero, ZCash, and Dash Embraced by Millions",
    "url": "https://www.crypto-news-flash.com/governments-forge-ahead-in-development-of-cbdcs-despite-being-unpopular-and-risky-monero-zcash-and-dash-embraced-by-millions/?utm_source=rss&utm_medium=rss&utm_campaign=governments-forge-ahead-in-development-of-cbdcs-despite-being-unpopular-and-risky-monero-zcash-and-dash-embraced-by-millions",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Dash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Dash.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Dash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Dash-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Dash-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The clamor for the development of CBDCs by Central Banks is growing. The distrust is pushing more crypto-centric users toward privacy coins like Monero, ZCash and Dash. Many governments including the United States are still working on developing their Central Bank Digital Currency (CBDC) despite the challenges that the solution currently faces. In March 2022, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T19:00:57.000Z",
    "title": "Stellar (XLM) & Alex The Doge (ALEX): Breaking Down the Key Differences",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-alex-the-doge-alex-breaking-down-the-key-differences/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-alex-the-doge-alex-breaking-down-the-key-differences",
    "description": "<img width=\"1280\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_21-55-05.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_21-55-05.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_21-55-05-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_21-55-05-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-25_21-55-05-768x461.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Cryptocurrency has been a hot topic for years, and with the rise of decentralized finance (De-Fi) and play-to-earn gaming (P2E), the industry is continually evolving. Two popular cryptocurrencies, Alex The Doge (ALEX) and Stellar (XLM), have recently gained attention in the market. While both have similarities in their blockchain technology and goals of financial inclusion, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T19:00:42.000Z",
    "title": "As Pepecoin (PEPE) Hype Wanes, This New Memecoin Sends Shockwaves with Staggering $6.2M Funding Raised",
    "url": "https://www.crypto-news-flash.com/as-pepecoin-pepe-hype-wanes-this-new-memecoin-sends-shockwaves-with-staggering-6-2m-funding-raised/?utm_source=rss&utm_medium=rss&utm_campaign=as-pepecoin-pepe-hype-wanes-this-new-memecoin-sends-shockwaves-with-staggering-6-2m-funding-raised",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T115020.576.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T115020.576.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T115020.576-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T115020.576-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The past few years have seen a remarkable and meteoric rise in popularity and growth of memecoins in the crypto landscape. Internet meme-inspired cryptocurrencies have now become a vital part of the crypto world due to their potential for explosive growth, which has attracted both investors and enthusiasts.  While Pepe experienced a tremendous rise after [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T18:45:10.000Z",
    "title": "Federal Reserve Bank of San Francisco Seeking ‘Crypto Architect’ for CBDC Project",
    "url": "https://dailyhodl.com/2023/07/25/federal-reserve-bank-of-san-francisco-seeking-crypto-architect-for-cbdc-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/san-seeking-crypto-architect.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Federal Reserve Bank of San Francisco is looking for a senior crypto architect to perform research and development relating to a central bank digital currency (CBDC). The Fed&#8217;s western regional bank posted a job ad for the position on LinkedIn and Indeed. &#8220;As part of the Federal Reserve’s mission to promote accessible, safe, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/federal-reserve-bank-of-san-francisco-seeking-crypto-architect-for-cbdc-project/\">Federal Reserve Bank of San Francisco Seeking ‘Crypto Architect’ for CBDC Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T18:41:34.000Z",
    "title": "CFTC Charges Couple for Running Illegal Crypto Pool and Commingling With Personal Funds",
    "url": "https://dailyhodl.com/2023/07/25/cftc-charges-couple-for-running-illegal-crypto-pool-and-commingling-with-personal-funds/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/cftc-charges-man-behind.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Commodity Futures Trading Commission (CFTC) has filed a complaint against a Tennessee couple for allegedly defrauding over 100 people in a crypto pool scheme. In a new press release, the CFTC announced that they are filing a complaint against Michael and Amanda Griffis for allegedly running a multi-million dollar pool that defrauded investors. The alleged [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/cftc-charges-couple-for-running-illegal-crypto-pool-and-commingling-with-personal-funds/\">CFTC Charges Couple for Running Illegal Crypto Pool and Commingling With Personal Funds</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T18:41:21.000Z",
    "title": "Venom Blockchain Surpasses One Million Registered Wallets in Record Time",
    "url": "https://dailyhodl.com/2023/07/25/venom-blockchain-surpasses-one-million-registered-wallets-in-record-time/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Venom-Foundation-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Venom-Foundation-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/02/Venom-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/02/Venom-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Venom-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/02/Venom-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 25, 2023 – Abu Dhabi, United Arab Emirates Venom Foundation, a pioneering force in the adoption of blockchain technology within regulated markets, has surpassed one million registered wallets as of July 25, 2023. The momentous accomplishment came in a remarkably short span of time since the launch of Venom&#8217;s testnet on April 26. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/venom-blockchain-surpasses-one-million-registered-wallets-in-record-time/\">Venom Blockchain Surpasses One Million Registered Wallets in Record Time</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]