[
  {
    "source": "CoinDesk",
    "date": "2023-07-18T13:25:11.000Z",
    "title": "Arkham's Token Debuts at $0.75 After Being Sold for $0.05 in Binance Launchpad",
    "url": "https://www.coindesk.com/business/2023/07/18/arkhams-token-debuts-at-075-after-being-sold-for-005-in-binance-launchpad/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Blockchain analytics firm Arkham Intelligence's native token (ARKM) is trading at $0.74 with a $107 million market cap after it was issued to beta testers and Binance launchpad participants."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-18T13:30:20.000Z",
    "title": "Payments to 'High Risk' Crypto Exchanges Banned by National Australia Bank",
    "url": "https://decrypt.co/148893/payments-to-high-risk-crypto-exchanges-banned-by-national-australia-bank",
    "description": "National Australia Bank has seen a significant uptick in payment-related scams, which amount to over $270 million between March and July."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T13:34:01.000Z",
    "title": "EU stays on top of Web3 with metaverse, AI and crypto strategies",
    "url": "https://cointelegraph.com/news/eu-web3-metaverse-ai-crypto-strategy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a302fd6a-3ddc-4919-b930-34ca5ac5bf36.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Over the last year, leaders in the European Union have been vocal about their desire to stay on top of the latest developments in Web3.</p>\n                    <p><p>The European Union has been vocal about its place in the rapidly expanding ecosystem of emerging technologies. </p><p>It has been a leader in establishing clear crypto regulations with its long-awaited <a href=\"https://cointelegraph.com/news/eu-officials-sign-markets-in-crypto-assets-framework-into-law\">Markets in Crypto-Assets (MiCA) framework</a> signed into law in late May. The EU has also been pushing forward on creating regulations for <a href=\"https://cointelegraph.com/news/the-eu-receives-open-letter-from-160-tech-execs\">the development and deployment</a> of artificial intelligence (AI) systems. </p><p>Most recently, on July 11, the European Commission <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_23_3718\" target=\"_blank\" rel=\"noopener nofollow\">released</a> its latest plan to <a href=\"https://cointelegraph.com/news/extended-reality-to-create-thousands-of-jobs-by-2025-eu-commission\">take the lead in metaverse</a> development and prevent Big Tech from becoming too dominant in an economically viable sector.</p><h3>A European vision of the metaverse </h3><p>The latest EU proposal estimated that the global market size for metaverse developments will exceed 800 billion euro by 2030, compared with its end-of-year value of 27 billion in 2022. McKinsey’s latest <a href=\"https://www.mckinsey.com/~/media/mckinsey/business%20functions/marketing%20and%20sales/our%20insights/value%20creation%20in%20the%20metaverse/Value-creation-in-the-metaverse.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> on the state of the metaverse even has an estimated value of $5 trillion in the same timeframe. </p><p>According to the commission’s initiative, it wants to get ahead on metaverse development to reflect EU values and fundamental rights, along with a push for openness and interoperability. </p><p>Margrethe Vestager, the vice president of the European Commission, said the EU needs to have “people at the center” in order to shape it according to its principles. </p><blockquote>“We want to make sure Web 4.0 becomes an open, secure, trustworthy, fair and inclusive digital environment for all.” </blockquote><p>The commission held European Citizens’ Panels in February and April of 2023, which focused on the metaverse. It aimed to formulate suggestions for a “vision, principles, and actions” that ensure EU-based virtual worlds are fair. </p><p>According to the commission, 140 EU citizens were randomly selected for participation, which resulted in 23 recommendations that guided the strategy. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Integrating digital and real worlds is no longer science fiction.<br><br>Early this year, 140 European citizens put forward 23 recommendations to guide the development of human-centric, secure and trusted virtual worlds.<br><br>See how they helped shape our new strategy on virtual worlds ↓</p>&mdash; European Commission (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/1678784137065558016?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The current pillars that the EU has decided on for its metaverse strategy include empowerment and reinforcing skills to create a pool of specialists in the field of virtual worlds, supporting an EU Web4 on a business level, supporting societal progress and virtual public services, and shaping standards for open and interoperable virtual worlds.</p><h3>But wait, what is Web4? </h3><p>The European Commission’s <a href=\"https://twitter.com/EU_Commission/status/1678771461086117896\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a> about its pillars for virtual worlds and Web4 strategy garnered a mixed response from users, with many asking what Web4 means, and other’s joking about developing Web5 and Web6 already. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bbc69f32-13b5-4d49-a052-27b2fbd85c94.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Users respond to the European Commission’s tweet. Source: Twitter</em></figcaption></figure><p>According to the strategy, Web4 is distinguished from Web3 by integration with the real world. The commission’s statement recognizes that Web3 is still “currently developing,” with its main features being openness, decentralization and user empowerment.</p><blockquote>“The next generation, Web 4.0, will allow an integration between digital and real objects and environments, and enhanced interactions between humans and machines.”</blockquote><p>For the EU, Web4 could look like the introduction of smart cities with the right underlying infrastructure in place. </p><p>It is already investing in initiatives such as Destination Earth (DestinE) and Local Digital Twins for smart communities, as well as the European Digital Twin of the Ocean, which is said to allow researchers to advance science for the development of precision applications and help public authorities to make informed public-policy decisions on related issues. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\"><strong><em>Animoca still bullish on blockchain games, awaits license for metaverse fund</em></strong></a></p><p>The commission also included “advanced artificial and ambient intelligence, the internet of things, trusted blockchain transactions, virtual worlds and XR capabilities, digital and real objects and environments” as full integrations in Web4 that will set it apart from Web3.</p><p>It claims this will enable a “truly intuitive, immersive experience, seamlessly blending the physical and digital worlds.”</p><p>On July 5, the European Blockchain Sandbox, which is part of its smart cities initiative, <a href=\"https://cointelegraph.com/news/eu-blockchain-sandbox-unveils-first-20-use-cases-after-wave-applications\">unveiled its first 20</a> use cases.</p><h3>EU regulations in place</h3><p>At the moment, Vestager said there are no current metaverse regulations drafted. However, she expects various other rules already in place to affect it, such as privacy, market power and forthcoming AI regulations. </p><p>As previously mentioned, the EU has recently signed its groundbreaking MiCA regulations into law, which became one of the world’s first comprehensive sets of rules to regulate the crypto industry. </p><p>On July 12, the European Securities and Markets Authority announced that it plans to release <a href=\"https://cointelegraph.com/news/esma-european-regulator-releases-consultative-paper-mica-standards-for-crypto-asset-service-providers\">three consultative papers on its MiCA standards</a> for crypto asset service providers while it fulfills its mandate under MiCA regulations.</p><p>There are already questions regarding the regulations’ <a href=\"https://cointelegraph.com/news/eu-mica-stablecoin-cap-could-stifle-crypto-adoption\">policies on stablecoins</a> and the exclusion of <a href=\"https://cointelegraph.com/news/de-fi-european-trade-body-warns-against-the-exclusion-of-de-fi-from-mi-ca\">decentralized finance in the published</a> regulations. </p><p>In addition to its recently published crypto legislation, the EU has been working on regulations that will affect the AI industry. On June 14, the European Parliament passed the <a href=\"https://cointelegraph.com/news/european-union-ai-act-passes-in-parliament\">EU AI Act</a>, which would force tools like ChatGPT to <a href=\"https://cointelegraph.com/news/us-senator-pushes-companies-to-label-ai-generated-content\">disclose all AI-generated content</a> and other measures against illegal content. </p><h3>The race against big tech</h3><p>All of these initiatives with virtual worlds and regulations for emerging technologies come as Big Tech companies like Meta Platforms, Microsoft, Apple and Google work on their own versions of the metaverse and AI tools. </p><p>The EU clearly stated in its metaverse strategy that virtual worlds will not be “dominated by a few big players” and should be “driven by open technologies.”</p><p>Meta, the parent company of Facebook, was <a href=\"https://cointelegraph.com/news/facebook-became-meta-one-year-ago-here-s-what-it-s-achieved\">openly committed to developing its own metaverse</a> world accessible through its virtual reality headsets. However, by the end of 2022, the company lost billions due to its metaverse division.</p><p>In 2022, Microsoft announced a $69 billion acquisition of Activision Blizzard, one of the gaming industry’s key players. </p><p>Most recently, Apple dropped its latest version of its <a href=\"https://cointelegraph.com/news/apple-vision-pro-headset-wwdc-no-mention-metaverse\">virtual reality goggles</a>, the Vision Pro. However, instead of positioning them for use in the metaverse, it chose to use the wording “spatial computing.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T13:17:04.000Z",
    "title": "Vitalik Buterin shares account abstraction challenges in Ethereum: EthCC ",
    "url": "https://cointelegraph.com/news/vitalik-buterin-ethereum-ethcc-paris-account-abstraction-ethereum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d8a83952-2d0c-4f96-969c-2069c0b1e75e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Vitalik Buterin explained how an account abstraction extension called “paymasters” can allow users to pay for gas fees using “whatever coins that they are transferring.” </p>\n                    <p><p>While account abstraction in Ethereum is perceived to be a catalyst that <a href=\"https://cointelegraph.com/news/eth-smart-accounts-drive-billion-asia-users-consensys-exec\">could onboard a billion users</a>, Ethereum co-founder Vitalik Buterin shared some challenges in implementing the new feature on the blockchain. </p><p>Buterin, speaking on July 18 at the Ethereum Community Conference (EthCC) event in Paris, explained some of the key innovations that modern account abstracting brings and the current hurdles that the community is facing when it comes to the concept. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d78e0bac-365a-42a3-ba0a-d15a13c4f5df.png\"  /><figcaption style=\"text-align: center;\"><em>Vitalik Buterin at the EthCC event held in Paris. Source: EthCC</em></figcaption></figure><p>At the moment, when Ethereum users are transferring ERC-20 tokens, they are required to hold Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) to pay for the transaction fees within the network. According to Buterin, account abstraction extensions , generally called “paymasters,” can allow users to pay their fees with “whatever coins that they are transferring.” Apart from this, the extension can also allow <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized applications (DApps)</a> to sponsor transactions for their users. </p><p>Moreover, Buterin also talked about another extension called signature aggregation. According to the Ethereum founder, by compiling signatures with the feature, developers can save money on gas and save on data. He explained: </p><blockquote>“This is actually especially a big deal on rollups because in a rollup a big or on because a big part of the size of a transaction is the signature on a rollup.”</blockquote><p>Along with the potential benefits of account abstraction for users, Buterin also recognized that there are still challenges that developers need to overcome. This includes needing an Ethereum Improvement Proposal (EIP) to upgrade current Ethereum’s externally-owned accounts (EOAs) — normal user accounts into smart contracts and making sure that the protocol works similarly in layer-2 solutions. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/polygon-crypto-lost-keys-have-already-cost-billions-of-dollars-many-more-at-risk-polygon-exec\"><strong><em>Lost keys have already cost billions of dollars, many more at risk — Polygon exec</em></strong></a></p><p>Buterin also highlighted that there are additional challenges when it comes to integrating with existing technologies such as biometrics and integration with existing wallets. </p><p>Despite the obstacles faced in the account abstraction endeavor, the Ethereum co-founder expressed excitement about its progress. “Account abstraction has made a lot of progress, and I'm excited about all of the progress that we'll continue making in the future,” he said. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/account-abstraction-supercharges-ethereum-wallets-dummies-guide/\"><strong><em>‘Account abstraction’ supercharges Ethereum wallets: Dummies guide</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T13:12:54.000Z",
    "title": "Bitcoin miners’ changing strategies: from hoarding to selling",
    "url": "https://cryptoslate.com/insights/bitcoin-miners-changing-strategies-from-hoarding-to-selling-according-to-anthony-power/",
    "description": "<p>Quick Take According to Accountant and Bitcoin Mining Analyst at Compass Mining, Anthony Power, throughout 2021, we saw a trend of Bitcoin miners retaining most of their Bitcoin production as the cryptocurrency&#8217;s price experienced significant growth. However, the subsequent decrease in Bitcoin&#8217;s price in 2022 forced a number of miners, burdened with substantial debt, to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-miners-changing-strategies-from-hoarding-to-selling-according-to-anthony-power/\">Bitcoin miners&#8217; changing strategies: from hoarding to selling</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-18T13:11:16.000Z",
    "title": "Bitcoin Mining Activity Surges Amid High Difficulty: Bitfinex",
    "url": "https://cryptobriefing.com/bitcoin-mining-activity-surges/?utm_source=feed&utm_medium=rss",
    "description": "Bitcoin miners activities continue to pique global interest, showing a rise in BTC mining activity, according to a report from Bitfinex. One particular development is the Bitcoin mining difficulty hitting..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T13:15:38.000Z",
    "title": "Vitalik to Headline Ethereum Foundation’s Dev-Focused Ethcon Korea 2023 in Seoul this September",
    "url": "https://cryptodaily.co.uk/2023/07/vitalik-to-headline-ethereum-foundations-dev-focused-ethcon-korea-2023-in-seoul-this-september",
    "description": "<p>SEOUL, SOUTH KOREA, July 18th, 2023, Chainwire</p><p class=\"ql-align-justify\">Ethcon Korea 2023 is a highly anticipated Ethereum Developer Conference sponsored by the Ethereum Foundation, returning this year to provide an idea sharing space for Ethereum developer talent.</p><p class=\"ql-align-justify\">The headline guest for Ethcon 2023 is Vitalik Buterin, co-founder of Ethereum, who will appear with a keynote address highlighting the latest in Ethereum development updates, as well as the future roadmap of the project.</p><p class=\"ql-align-justify\">The Ethereum Foundation has been supporting Ethcon since its first edition in 2019, recognizing the importance of diffusing knowledge in the developer community. Due to the non-commercial nature of the event, the Foundation&rsquo;s support is critical to maintaining Ethcon as the premier developer conference in Korea, which is fully volunteer-driven, with local community members dedicating their time pro-bono to organize and run the event.&nbsp;</p><p class=\"ql-align-justify\">Spanning three days from September 1 to September 3, 2023, it immediately precedes the anticipated Korea Blockchain Week 2023, a Web3 conference organized by FactBlock and Hashed, running from September 4 to September 10.</p><p class=\"ql-align-justify\">As a developer-focused conference, Ethcon Korea&nbsp; 2023 will primarily feature developers from across the globe and local to South Korea, who will show insightful research results and innovative projects to benefit Ethereum and the Web3 space as a whole.</p><p class=\"ql-align-justify\">The event will run alongside an exciting three-day hackathon, which will bring together developer talent to work on interesting new projects and research, which they will then have the opportunity to present at a live-streamed demo day at the event&rsquo;s close.</p><p class=\"ql-align-justify\">True to the community spirit, the Hackathon will use Quadratic Funding, a democratic public good funding and evaluation method, conceptualized by Vitalik and first pioneered in practice by Gitcoin. Quadratic Funding is a weighted voting and resource allocation method, which will combine votes from judges, sponsors and attendees to participate in the selection based on their contribution. Quadratic Funding is designed to combine community support for new ideas with the interests of larger contributors in a synergistic process.&nbsp;</p><p class=\"ql-align-justify\">Ethcon Korea is accepting submissions for proposals and talks until July 18, aiming to foster a diverse background of active researchers and lesser known developers, with the key goal of sharing useful experiences with each other.</p><p class=\"ql-align-justify\">The event will be held at Platz2 (&#54540;&#46972;&#52768;2) in Seoul, a cozy and spacious co-working space in the middle of Seoul.</p><p class=\"ql-align-justify\">About Ethcon Korea 2023</p><p class=\"ql-align-justify\">Ethcon is an annual developer-focused conference and hackathon held in Seoul, South Korea. As the largest developer event in the country, it brings together global and local talent to discuss exciting new research and development in the Ethereum ecosystem. For more information, please visit the official website at https://ethcon.kr/.</p><p></p><p></p>ContactTaeyeon Kimsorumfactory@gmail.com"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-18T13:30:43.000Z",
    "title": "Polygon Labs Unveils ‘Hyperproductive’ Token POL, Poised to Replace MATIC and Boost Ecosystem Rewards",
    "url": "https://news.bitcoin.com/polygon-labs-unveils-hyperproductive-token-pol-poised-to-replace-matic-and-boost-ecosystem-rewards/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Polygon Labs Unveils ‘Hyperproductive’ Token POL, Poised to Replace MATIC and Boost Ecosystem Rewards\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/pol.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Polygon Labs, the team behind the Polygon blockchain network, has introduced a third-generation token that could replace the native cryptocurrency, MATIC, with a &#8220;hyperproductive&#8221; digital currency named POL. If the POL concept gains approval, validators can earn rewards from staking and also accumulate rewards from multiple Polygon chains. Polygon Labs Introduces Next-Gen Crypto With POL, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T13:34:31.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T13:29:51.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T13:28:55.000Z",
    "title": "How Kilobots Can Navigate Inaccessible Places For Exciting Medical Applications",
    "url": "https://www.cryptopolitan.com/how-kilobots-can-navigate-inaccessible/",
    "description": "Scientists at the University of Sheffield have significantly advanced in developing Kilobots or stretchable robotic fabrics, which can change size, shrink, and move with exceptional precision. Led by Dr. Roderich Gross from the Department of Automatic Control and Systems Engineering, the research team has successfully demonstrated the feasibility of creating intelligent robotic fabrics by coupling ... <a title=\"How Kilobots Can Navigate Inaccessible Places For Exciting Medical Applications\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-kilobots-can-navigate-inaccessible/\" aria-label=\"More on How Kilobots Can Navigate Inaccessible Places For Exciting Medical Applications\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T13:15:29.000Z",
    "title": "Vitalik to Headline Ethereum Foundation’s Dev-Focused Ethcon Korea 2023 in Seoul this September",
    "url": "https://www.cryptopolitan.com/vitalik-to-headline-ethereum-foundations-dev-focused-ethcon-korea-2023-in-seoul-this-september/",
    "description": "SEOUL, SOUTH KOREA, July 18th, 2023, Chainwire Ethcon Korea 2023 is a highly anticipated Ethereum Developer Conference sponsored by the Ethereum Foundation, returning this year to provide an idea sharing space for Ethereum developer talent. The headline guest for Ethcon 2023 is Vitalik Buterin, co-founder of Ethereum, who will appear with a keynote address highlighting ... <a title=\"Vitalik to Headline Ethereum Foundation’s Dev-Focused Ethcon Korea 2023 in Seoul this September\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vitalik-to-headline-ethereum-foundations-dev-focused-ethcon-korea-2023-in-seoul-this-september/\" aria-label=\"More on Vitalik to Headline Ethereum Foundation’s Dev-Focused Ethcon Korea 2023 in Seoul this September\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T13:20:39.000Z",
    "title": "Coinbase’s regulatory woes in US far from over, analysts opine ",
    "url": "https://crypto.news/coinbases-regulatory-woes-in-the-us-far-from-over-analysts-opine/",
    "description": "Berenberg Capital analysts opine that Coinbase still faces significant regulatory challenges in the United States despite Ripple's recent legal victory"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T13:30:10.000Z",
    "title": "SUI Surges 11% In Just 24 Hours, Is It Still Worth Buying?",
    "url": "https://www.newsbtc.com/news/sui-surges-11-just-24-hours-still-worth-buying/",
    "description": "After the launch of the mainnet on May 3, the SUI token fell into a deep downtrend, which has caused the price to drop by more than 87%. Low user numbers and poor on-chain data have severely clouded the outlook. However, a few days ago, there was a surprise that gave a big boost to the SUI price. The SUI network made waves in the crypto space by surpassing its competitor Solana in daily transactions. However, with a sudden record of 29 million transactions in 24 hours, SUI has left many crypto enthusiasts questioning the validity and sustainability of this sudden surge. Renowned analyst and crypto whale Andrew Kang, known for his insightful commentary, has raised concerns about the authenticity of these transactions, suggesting that SUI may be artificially inflating its numbers. Kang writes today: Sui pumping their numbers up. Chart looks good, market does not seem to be discerning about validity of transactions. Fake it til you make it. Is SUI Still Worth Buying? As Kang argues, the question is: Are the numbers legitimate and can drive a sustainable upward trend, or will the hype quickly die down because of fake numbers? Related Reading: SUI Continues Rally As Sui 8192 Web3 Game Fuels Blockchain Activity To Hit New Peak The recent surge in transactions can be primarily attributed to the introduction of the on-chain game, &#8220;Sui 8192.&#8221; Developed by the team behind the wallet provider, Ethos Wallet, this casual game has captured the attention of users with its gameplay reminiscent of the classic puzzle game &#8220;2048.&#8221; Each move within the game triggers a transaction, resulting in the state of the game being recorded on the blockchain. With the integration of a pre-approval mechanism in Ethos Wallet, players can optimize their gameplay experience by setting a token amount before each game. It&#8217;s Important to know that the SUI Foundation has allocated $5 million to further stimulate activity within the game, offering players the opportunity to earn rewards in the form of SUI tokens by competing against others or completing tasks. However, this could call into question the sustainability of this increase in transaction activity. Related Reading: Sui Foundation Refutes Claims Of Dumping Locked Staking Rewards On Binance Perhaps the game is only experiencing a short hype at the moment because players want to grab the free tokens. Once the marketing budget is exhausted, the hype could quickly be over. SUI traders and investors should therefore be cautious. Prior to this transaction surge, the project had been marred by negative headlines, including allegations of suspicious token movements, concerns about venture capital influence, and opaque tokenomics. These controversies have left some investors wary of the project&#8217;s long-term prospects. Price Analysis However, as stated by Kang, the SUI chart looks promising at the moment. The price has broken out of the downward trend that existed since the mainnet launch. The bulls also managed to defend the 23.6 Fibonacci retracement level in a retest. Currently, the price is contending with the 38.2% retracement level at $0.76. If it manages to break above this resistance, $0.84 and $0.92 could be the next price target. Featured image from Boxmining, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T13:33:06.000Z",
    "title": "Smart Contract Kill Switch Controversy: EU Lawmakers Disregard Pleas from Polygon, Stellar, and Cardano on New Data Act",
    "url": "https://www.crypto-news-flash.com/smart-contract-kill-switch-controversy-eu-lawmakers-disregard-pleas-from-polygon-stellar-and-cardano-on-new-data-act/?utm_source=rss&utm_medium=rss&utm_campaign=smart-contract-kill-switch-controversy-eu-lawmakers-disregard-pleas-from-polygon-stellar-and-cardano-on-new-data-act",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"EU Europe\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/09/europe-1395913_1280-48x32.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The European Union (EU) New Data Act is a source of great concern for crypto industry leaders. The text of the Act may streamline innovation according to certain concerns A close look at the latest release of the new European Union Data Act reveals that the appeal of the blockchain industry may have successfully been [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T13:10:37.000Z",
    "title": "Shiba Inu Memecoin Price Dips but TCRV Pumps, Can You Get Rich Quick With Tradecurve?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-memecoin-price-dips-but-tcrv-pumps-can-you-get-rich-quick-with-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-memecoin-price-dips-but-tcrv-pumps-can-you-get-rich-quick-with-tradecurve",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T113557.098.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T113557.098.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T113557.098-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T113557.098-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrency buyers have one thing on their minds &#8211; return on investment (ROI). While Shiba Inu (SHIB) has provided that to them in the past, recent trends have made its price dip. However, when one token plummets, another one rises. Tradecurve (TCRV) &#8211; the rising presale star is pumping as its value soared by 80% [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-18T13:10:17.000Z",
    "title": "How to Use Arkham to Get On-chain Analytics",
    "url": "https://www.altcoinbuzz.io/reviews/how-to-use-arkham-to-get-on-chain-analytics/",
    "description": "<p>Access to on-chain analytics tools can give you a head start. For example, you may be able to find an x100 token. Also, it allows you to set up and develop strategies. The new kid on the block in this playing field is Arkham. So, in this article, we take a closer look at how [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/how-to-use-arkham-to-get-on-chain-analytics/\">How to Use Arkham to Get On-chain Analytics</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]