[
  {
    "source": "CoinDesk",
    "date": "2023-11-09T11:00:00.000Z",
    "title": "SBF Trial: The Last Day of Summer Camp",
    "url": "https://www.coindesk.com/policy/2023/11/09/sbf-trial-the-last-day-of-summer-camp/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "We weren't really sure if it was the last day or not. The jury determining Sam Bankman-Fried's fate had begun deliberating the charges just a few hours before, after Judge Lewis Kaplan had spent much of the morning and some time after lunch reading out a 60-page charging document. Surely a case of this complexity – seven different charges, billions of dollars allegedly stolen, questions about whether witnesses were telling the truth – would take a while."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-09T10:48:40.000Z",
    "title": "Huobi Token Jumps 25% as HT Trading Volume Surges Overnight",
    "url": "https://www.coindesk.com/business/2023/11/09/huobi-token-jumps-25-as-ht-trading-volume-surges-overnight/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Huobi token [HT], the native token of cryptocurrency exchange HTX, has surged to a five-month high of $2.95 following a rapid increase in trading volume."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-09T10:55:46.000Z",
    "title": "FTT Token Jumps 84% Following Gensler's FTX Revival Comments",
    "url": "https://decrypt.co/205306/ftt-token-jumps-following-genslers-ftx-revival-comments",
    "description": "FTX's token surged following reports that the exchange could be revived—though there's no indication the token would be part of that revival."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T11:00:11.000Z",
    "title": "Ark Invest and 21Shares partner to launch digital asset ETF suite",
    "url": "http://cointelegraph.com/news/bitcoin-etf-ethereum-ark-invest-21shares",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1c949843-64de-4169-8367-563cce29741e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Five digital asset ETF products will be listed on the Chicago Board Options Exchange and are scheduled to start trading next week. </p>\n                    <p><p>Investment management firm Ark Invest, led by pro-Bitcoin investment veteran Cathie Wood, has collaborated with exchange-traded product (ETP) provider 21Shares to launch a new suite of digital asset exchange-traded funds (ETFs). The move aims to provide a “robust set of options\" for investors looking to get digital assets into their trading portfolio. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The countdown begins: today, 21Shares and ARK Invest announce the upcoming launch the ARK and 21Shares Digital Asset ETF Suite.<br><br>The ETF suite uses crypto-specific insights alongside traditional indicators. <a href=\"https://t.co/dkg8aTCtVR\">pic.twitter.com/dkg8aTCtVR</a></p>&mdash; 21Shares Funds (@21shares_funds) <a href=\"https://twitter.com/21shares_funds/status/1722267366409826654?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the 21Shares website, the companies will <a href=\"https://21shares-funds.com/\" target=\"_blank\" rel=\"noopener nofollow\">utilize</a> on-chain signals and their crypto-native experience to deliver “long-term capital appreciation” by investing in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures contracts.</p><p>According to the prospectuses released by the companies, five products are scheduled to start trading in the next week. Furthermore, these ETFs will be listed on the Chicago Board Options Exchange (CBOE). </p><p>The company also underscored that it will not be offering investors a chance to invest directly in “spot” BTC. In a disclaimer, the company highlighted that investors seeking exposure to the price of BTC should consider other forms of investments. </p><p>Apart from Bitcoin and Ethereum futures, one product called the<em> \"ARK 21Shares Blockchain and Digital Economy Innovation ETF\"</em> is also designed to invest in public equities of companies within the blockchain industry. According to 21Shares, this provides investors with what it describes as a \"holistic exposure” to the growth of blockchain technology.  </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etf-excitement-returns-btc-price-37k\"><strong><em>Bitcoin ETF excitement returns as BTC price nears $37K</em></strong></a></p><p>Meanwhile, Bloomberg analysts speculate that the United States Securities and Exchange Commission (SEC) has a window to <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">approve Bitcoin ETF filings</a>. On Nov. 8, analysts James Seyffart and Eric Balchunas wrote that there was a possibility that the SEC could approve all 12 ETF filings if the agency decides to allow the concept. However, the analysts also stressed that this was only a possibility and that there was nothing concrete yet. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-incredible-rags-riches-tale-polygon-sandeep-nailwal/\"><strong><em>Slumdog billionaire: Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T10:51:56.000Z",
    "title": "Frankfurt Stock Exchange includes crypto trading facility in strategy-2026 ",
    "url": "http://cointelegraph.com/news/deutsche-borse-adds-crypto-trading-facility-strategy-2026",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5882223f-ca84-4ec9-a520-942841162e39.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Deutsche Börse, the largest stock exchange in Germany, says it will accelerate the development of its blockchain-backed D7 digital securities registry and build a trading platform for digital assets.</p>\n                    <p><p>Deutsche Börse AG, the German stock exchange headquartered in Frankfurt, has included crypto in its strategic priorities for the next few years. </p><p>According to the strategic report “Horizont 2026”, <a href=\"https://deutsche-boerse.com/dbg-de/media/pressemitteilungen/Neue-Strategie-Horizon-2026-weiterhin-zweistelliges-Umsatz-und-Ergebniswachstum-pro-Jahr-3729688\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on Nov. 7, Deutsche Börse seeks “an expansion of the leading position in the area of ​​digital platforms for existing and new asset classes.” </p><p>The company believes that, in the long run, there is “further growth potential from new technologies through the digitalization of existing or new asset classes.” Hence, it intends to accelerate the development of its blockchain-backed D7 digital securities registry and build a trading platform for digital assets. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/dz-bank-crypto-custody-institutional-investors\"><strong><em>DZ Bank, third-largest German bank, to start crypto custody for institutional investors</em></strong></a></p><p>The digital asset platform will serve only institutional investors and facilitate tokenization, trading, settlement and custody services for securities, alternative assets and cryptocurrencies. The presentation also <a href=\"https://deutsche-boerse.com/resource/blob/3726750/f882d558bc62e4938d45d7605f8e0242/data/presentation-investor-day-2023_de.pdf\" target=\"_blank\" rel=\"noopener nofollow\">mentions</a> stablecoins and central bank digital currencies (CBDCs), although their status on the potential platform is not specified. </p><p>Deutsche Börse won’t be the first stock exchange to delve into digital assets trading. Germany’s second-largest stock exchange, Boerse Stuttgart, started <a href=\"https://www.volksbank-kurpfalz.de/private-banking/beratung-private-banking/kryptowaehrung-blockchain.html\" target=\"_blank\" rel=\"noopener nofollow\">offering</a> its customers cryptocurrency trading in April 2022. London Stock Exchange Group <a href=\"https://cointelegraph.com/news/london-stock-exchange-may-provide-clearing-services-for-btc-derivatives-starting-in-q4\">is set to provide</a> clearing services for dollar-denominated, cash-settled Bitcoin index futures and options contracts in 2024. </p><p>The Frankfurt stock exchange is in no way a novice to crypto. In 2021, its digital exchange, Deutsche Börse Xetra, listed the <a href=\"https://cointelegraph.com/news/german-digital-stock-exchange-will-list-physical-litecoin-etp\">Litecoin exchange-traded product</a> (ETP) from a London-based ETC Group. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T10:45:53.000Z",
    "title": "Bitcoin’s market cap surpasses Tesla as ETF-fuelled rally pushes it closer to $37k",
    "url": "https://cryptoslate.com/bitcoins-market-cap-surpasses-tesla-as-etf-fuelled-rally-pushes-it-closer-to-37k/",
    "description": "<p>Bitcoin&#8217;s market capitalization has eclipsed that of Tesla, the electric car giant led by Elon Musk, fueled by its recent rally near $37,000 during the early hours of Nov. 9. As of press time, BTC&#8217;s market cap stands at $717.23 billion, surpassing Tesla&#8217;s $706.06 billion by $11 billion, according to data from CompaniesMarketCap. BTC increased [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-market-cap-surpasses-tesla-as-etf-fuelled-rally-pushes-it-closer-to-37k/\">Bitcoin&#8217;s market cap surpasses Tesla as ETF-fuelled rally pushes it closer to $37k</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T10:40:09.000Z",
    "title": "Dogecoin ($DOGE) Poised for Rally? Crypto Analyst Highlights ‘Beautiful’ Chart Patterns",
    "url": "https://www.cryptoglobe.com/latest/2023/11/dogecoin-doge-poised-for-rally-crypto-analyst-highlights-beautiful-chart-patterns/",
    "description": "A popular crypto strategist, followed by over 600,000 enthusiasts, has forecasted a potential steep ascent for Dogecoin (DOGE), the leading meme-inspired cryptocurrency. The analyst, known as Kaleo, shared his insights with his vast following on social media platform X, suggesting that DOGE is set to emulate the recent bullish trends observed in other altcoins. In […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:45:24.000Z",
    "title": "Spot BTC ETF approval by the SEC to begin the first window on November 9",
    "url": "https://www.cryptopolitan.com/spot-btc-etf-sec-approval-to-start-nov-9/",
    "description": "There has been a buzz on the awaited spot Bitcoin Exchange-Traded Funds (ETFs) that have influenced Bitcoin&#8217;s price in the market, and recent developments have showcased a 90% chance of approval by the SEC. The regulatory authority has been holding back approval of the ETF applications by major crypto players like Grayscale, BlackRock, and VanEck.&#160; ... <a title=\"Spot BTC ETF approval by the SEC to begin the first window on November 9\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spot-btc-etf-sec-approval-to-start-nov-9/\" aria-label=\"More on Spot BTC ETF approval by the SEC to begin the first window on November 9\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:41:44.000Z",
    "title": "Youth Vision vs. UK Government Stagnation",
    "url": "https://www.cryptopolitan.com/youth-vision-vs-uk-government-stagnation/",
    "description": "While Europe&#8217;s youth demand truth, free movement, and community, the UK government appears out of touch with these priorities. The divide between the government&#8217;s actions and the aspirations of younger voters is widening, and the UK risks falling behind. Parliament&#8217;s idle weeks The UK government&#8217;s decision to limit parliamentary sitting weeks frustrates MPs like Chris ... <a title=\"Youth Vision vs. UK Government Stagnation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/youth-vision-vs-uk-government-stagnation/\" aria-label=\"More on Youth Vision vs. UK Government Stagnation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T11:00:34.000Z",
    "title": "Cardano October Whale Frenzy – What Lies Ahead For November?",
    "url": "https://www.newsbtc.com/news/cardano-october-whale-frenzy-what-lies-ahead-for-november/",
    "description": "Cardano (ADA) experienced a significant shift in its ownership landscape during the month of October. Large holders, defined as addresses holding over 0.1% of a cryptocurrency&#8217;s circulating supply, accumulated nearly 1.89 billion ADA coins. But is this development good news or bad news for the Cardano ecosystem? Large Holders Netflow is a metric that measures the number of inflows minus outflows pertaining to addresses held by large ADA investors. This metric provides valuable insights into the behavior of major stakeholders and their impact on the ADA market. Related Reading: Bitcoin Indicator Backed By Founders Of Top Crypto Data Analytics Firm Predicts Bullish Trends When large holders accumulate more ADA than they are selling, it suggests a bullish sentiment among the biggest investors. In this case, it indicates that they believe in the long-term potential of Cardano and are willing to hold onto their assets, possibly anticipating future price appreciation. $ADA got a strong vote of confidence last month. Big holders accumulated 1.89 billion ADA last month, translating to over $600 million at current prices. The majority of the accumulation took place between $0.249 and $0.271. 🔗https://t.co/FCp16WINDG pic.twitter.com/cIRpSDC1fR — IntoTheBlock (@intotheblock) November 7, 2023 Conversely, if large holders were offloading their ADA holdings in large quantities, it could be perceived as a bearish sign, signaling a lack of confidence in the project or an impending market downturn. However, the data suggests that they are accumulating, which could be seen as a positive indicator. ADA&#8217;s Current Price And Recent Performance As of the latest data from CoinGecko, Cardano (ADA) is trading at $0.369344. Over the past 24 hours, the ADA price has experienced a 3.3% increase, and it has surged by 20.4% in the last seven days. These price movements suggest a growing interest and confidence in ADA among investors. ADA market cap reaches $13 billion today. Chart: TradingView.com In addition to the large holders&#8217; accumulation, Cardano has been making waves in the blockchain development sphere. According to Santiment, a prominent analytics firm, Cardano ranks as the top blockchain in terms of development activity over a 30-day period. The project has recorded an impressive 502.57 GitHub commits during this timeframe. Source: Santiment Related Reading: Exploring The Resurgence Of BNB: Unveiling The Force Behind Renewed Interest Cardano&#8217;s Strong Development Activity Santiment has previously emphasized that heavy development activity is a strong positive indicator for a cryptocurrency project. It signifies that developers believe in the protocol&#8217;s potential for success and are actively working on improving the technology. Such activity also reduces the likelihood that the project is an &#8220;exit scam&#8221; or a token without substance. The recent accumulation of ADA by large holders, coupled with its positive price performance, suggests growing confidence in the Cardano ecosystem. Additionally, the blockchain&#8217;s active development and commitment to enhancing its technology indicate a bright future for ADA. While the crypto market is known for its volatility, these factors point towards a favorable outlook for Cardano in the eyes of investors and developers alike. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T10:53:54.000Z",
    "title": "XRPL Accelerator Announces Second Cohort with 11 Forward-Looking Projects – A Deep Dive",
    "url": "https://www.crypto-news-flash.com/xrpl-accelerator-announces-second-cohort-with-11-forward-looking-projects-a-deep-dive/?utm_source=rss&utm_medium=rss&utm_campaign=xrpl-accelerator-announces-second-cohort-with-11-forward-looking-projects-a-deep-dive",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XUMM\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />The XRPL Accelerator program has selected 11 new projects to support the development of innovative applications on the XRP Ledger, each receiving $50,000 and expert mentorship. Selected projects like Frii, Phi Wallet, and Kaiju Labs are set to revolutionize payment systems, gold tokenization, and blockchain gaming. The XRP Ledger Foundation has announced the latest ensemble [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T10:48:31.000Z",
    "title": "90% Chance of Bitcoin ETF Approval by January 10, Analyst Predicts",
    "url": "https://coinedition.com/90-chance-of-bitcoin-etf-approval-by-january-10-analyst-predicts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"First Bitcoin ETF in Europe Receives an ESG Label, Sparking Debate\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, Bloomberg analyst James Seyffart claimed that there is a 90% probability of spot Bitcoin ETF approvals by January 10. However, the market can soon enter a period during which a surge of approval orders for all existing applicants might potentially materialize if the approval process accelerates. According to a chart Seyffart tweeted, &#8220;window [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/90-chance-of-bitcoin-etf-approval-by-january-10-analyst-predicts/\">90% Chance of Bitcoin ETF Approval by January 10, Analyst Predicts</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]