[
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T09:53:25.000Z",
    "title": "Bitcoin Ordinals volume hits $210M in Q2 - DappRadar ",
    "url": "https://cointelegraph.com/news/bitcoin-ordinals-volume-hits-210-million-in-q2-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1718af61-2718-4ce9-be29-808c0581c978.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The advent of Bitcoin Ordinals NFT inscriptions led to more $210 million in trading volume through the first half of 2023. </p>\n                    <p><p>The creation of nonfungible token inscriptions on the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) blockchain has led to over $210 million of trading volume for <a href=\"https://cointelegraph.com/explained/what-are-bitcoin-ordinals\">Bitcoin Ordinals</a>, according to the latest quarterly report from DappRadar.</p><p>The data, which has been independently verified by Cointelegraph, shows that Bitcoin Ordinals' booming popularity led to a sharp increase in trading volume through the second quarter of 2023.</p><p>Bitcoin Ordinal trading volume increased from $7.18 million in the first quarter of the year, before a significant increase in trading value left the total trading volume for the Bitcoin-based NFTs at $210.7 million. DappRadar pins the quarterly increase at 2834%.</p><p>The report also notes that all-time Bitcoin Ordinals trades amounted to over 550,000 in Q2, with some 150,000 unique traders contributing to the inflated trading volume midway through 2023. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bf5d8722-9324-41fe-be5b-b6f8d6f87ed0.png\"  /><figcaption style=\"text-align: center;\">Bitcoin Ordinals marketplace data. Source: Dune analytics</figcaption></figure><p>A Dune blockchain analytics <a href=\"https://dune.com/domo/ordinals-marketplaces\" target=\"_blank\" rel=\"noopener nofollow\">dashboard</a> reflecting a number of Bitcoin Ordinals marketplace metrics from user @domo also shows that unique users increased sharply from May 2023. UniSat, an open source Chrome browser extension for Bitcoin Ordinals &amp; brc-20 tokens, Magic Eden and Ordinals Wallet account for the majority of unique users by marketplace.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8a9c82e0-0bb6-4cd4-90a7-dacb301c0354.png\"  /><figcaption style=\"text-align: center;\">Bitcoin Ordinals unique users by marketplace. Source: Dune analytics</figcaption></figure><p>The rise in popularity in Bitcoin Ordinals has had an interesting effect on the NFT landscape. Near the end of May 2023, Bitcoin surpassed Solana to become <a href=\"https://cointelegraph.com/news/bitcoin-surpasses-solana-to-become-second-most-popular-nft-blockchain\">the second-most popular NFT blockchain</a>, leaving the preeminent cryptocurrency blockchain behind Ethereum alone in terms of facilitating NFT trading volumes.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-surpass-inscription-as-casey-rodarmor-steps-down\"><strong><em>Related: Bitcoin Ordinals surpass 10M inscriptions as creator Rodarmor steps down</em></strong></a></p><p>Ordinals <a href=\"https://cointelegraph.com/news/bitcoin-miners-raked-millions-in-fees-q2-amid-ordinals\">have also been a boon</a> to the Bitcoin mining industry. BTC miners have netted around $184 million through the first half of 2023, with Coin Metrics highlighting Ordinals and BRC-20 tokens for their role in the boost to fees which has already surpassed the 2022 total for BTC miners.</p><p>Ethereum co-founder Vitalik Buterin also credited Bitcoin Ordinals for reigniting a <a href=\"https://cointelegraph.com/news/vitalik-buterin-ordinals-revived-developers-on-bitcoin\">“builder culture”</a> in the Bitcoin ecosystem in a Twitter Space <a href=\"https://twitter.com/i/spaces/1DXxyvDYZqgKM\" target=\"_blank\" rel=\"noopener nofollow\">broadcast </a>on July 6.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\">Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T09:40:09.000Z",
    "title": "Canadian regulator explains stance on crypto staking, lending for investment funds",
    "url": "https://cointelegraph.com/news/bitcoin-ether-best-support-canadian-regulator-explains-stance-on-crypto-staking-lending-for-investment-funds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/83f01b40-ce19-419b-bd18-36ad93541273.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Staking is still allowed, while the lending opportunities are limited and the proportion of \"illiquid\" assets is restricted. </p>\n                    <p><p>The chief financial authority of Canada, the Canadian Securities Administrators (CSA), has confirmed its trust in the regulated futures market for crypto, which “promotes greater price discovery”. Apart from the United States, the Canadian market hosts a number of crypto exchange-traded funds (ETFs). </p><p>On July 6, the CSA issued <a href=\"https://www.asc.ca/-/media/ASC-Documents-part-1/Regulatory-Instruments/2023/07/6104091-Guidance-on-Crypto-Asset-Investment-Funds-that-are-Reporting-Issuers.ashx\" target=\"_blank\" rel=\"noopener nofollow\">guidance</a> to help fund managers comply with law requirements for investment funds holding crypto assets. A 15-page document defends the very existence of crypto ETFs in Canada, emphasizing that ETFs possess the necessary tools to hedge against the price fluctuations of particular crypto assets. </p><p>The CSA named the markets for Bitcoin and Ether as providing the best support to the public crypto asset funds without compromising investor protection. It also lays restrictions on the proportion of “illiquid assets”, i.e. the assets that couldn’t be swiftly disposed of directly through the open market, in the funds. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ripple-expands-canadian-engineering-activities-with-u-of-toronto-xrp-validator\"><strong><em>Ripple expands Canadian engineering activities with U of Toronto XRP validator</em></strong></a></p><p>The regulator expects investment funds to determine themselves (after proper due diligence) whether or not the crypto assets they propose to invest in are securities or derivatives. It also reminds investment managers that they’re prohibited from lending assets that are not securities.</p><p>The document also lays out “the minimum expectations” for the crypto assets custody. Among them are primary storage in cold wallets, segregation of assets, visible on the blockchain, insurance for corporate crime, and providing the reports to funds’ auditors. </p><p>Another issue mentioned is crypto staking. CSA confirms that it doesn’t prohibit staking per se, but expects funds managers to stay alert about the possible turning of liquid crypto assets into “illiquid” during the staking — they still should comply with the “illiquidity” restrictions. </p><p>In the spring of 2023, some major crypto exchanges froze their operations in Canada due to the “regulatory climate”. In April, decentralized exchange dYdX <a href=\"https://cointelegraph.com/news/decentralized-exchange-dydx-announces-winding-down-of-services-for-canadian-users\">announced a “winding down” of its services</a> for Canadian users. In May, Binance <a href=\"https://cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules\">“proactively withdrew” from </a>the country along <a href=\"https://cointelegraph.com/news/crypto-exchange-bybit-exits-canada-citing-recent-regulatory-development\">with another platform</a>, Bybit. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-07T10:01:33.000Z",
    "title": "Ripple’s Head of Policy Discusses the Digital Pound (GBP) and the Global Impact of CBDCs",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ripples-head-of-policy-discusses-the-digital-pound-gbp-and-the-global-impact-of-cbdcs/",
    "description": "In a recent interview with the Digital Pound Foundation, which is an independent forum supporting the implementation of a well-designed digital Pound, Susan Friedman, Head of Policy at Ripple, offered her perspective on the future of Central Bank Digital Currencies (CBDCs) and the role of the Digital Pound in this transformative journey. Friedman’s role at […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-07T09:44:00.000Z",
    "title": "Bitfinex Recovers Assets Stolen During Infamous 2016 Bitcoin Hack",
    "url": "https://cryptodaily.co.uk/2023/07/bitfinex-recovers-assets-stolen-during-infamous-2016-bitcoin-hack",
    "description": "<p>Crypto Exchange Bitfinex has announced that it has recovered some of the stolen assets from the 2016 Bitcoin hack but stated that a considerable number of assets are still yet to be recovered.&nbsp;</p>\n<p>The exchange stated in a press release that it had received the assets in question from the United States Department of Homeland Security.&nbsp;</p>\nTip Of The Iceberg&nbsp;\n<p>According to the announcement, the exchange revealed that it had managed to recover $312,219 in cash and 6.9 in Bitcoin Cash (BCH) worth around $1951 at today&rsquo;s prices. The assets, stolen during the 2016 hack, were returned by the United States Department of Homeland Security. US authorities seized control of the funds in 2022 after arresting two individuals in connection with the Bitfinex hack. The exchange has been working with authorities to recover the assets stolen during the hack and return them to customers.&nbsp;</p>\n<p>Bitfinex stated in its blog post that the United States government was continuing to make progress in prosecuting the individuals involved with the breach. The United States Customs and Border Protection agency conducted the seizure of the recovered assets. This agency is the law enforcement agency of the US Department of Homeland Security. Paolo Ardoino, the Chief Technology Officer at Bitfinex, thanked the authorities, stating,&nbsp;</p>\n<p>&ldquo;We are extremely pleased to be able to reach another successful milestone in the recovery of assets stolen from Bitfinex in 2016. This specific seizure demonstrates the commitment of law enforcement officials to diligently track all the proceeds of the crime committed against Bitfinex almost seven years ago. We look forward to recovering as much of the stolen bitcoin as we possibly can and redistributing that to holders of the tokens that were issued in response to the hack in 2016.&rdquo;</p>\nThe Bitfinex Hack&nbsp;\n<p>The Bitfinex hack was one of the biggest hacks to hit crypto at the time, with the hackers managing to steal around 119,756 Bitcoin (BTC) from the exchange thanks to a security breach. At the time, the stolen assets were worth around $71.8 million. However, at current prices, their valuation stands at a staggering $3.6 billion. On several occasions, the hackers had moved the stolen crypto around to launder the funds.&nbsp;</p>\n<p>However, US authorities were tracking the assets and managed to arrest the hackers in 2022. The culprits, Ilya Lichtenstein and Heather Morgan were a married couple from New York. Both were subsequently charged with conspiracy to commit money laundering. The arrest also led to the seizure of most of the stolen funds, totaling around $3.6 billion worth of Bitcoin. Deputy Attorney General Lisa O. Monaco stated at the time,&nbsp;</p>\n\n<p>&ldquo;Today&rsquo;s arrests, and the department&rsquo;s largest financial seizure ever, show that cryptocurrency is not a safe haven for criminals. In a futile effort to maintain digital anonymity, the defendants laundered stolen funds through a labyrinth of cryptocurrency transactions; thanks to the meticulous work of law enforcement, the department once again showed how it can and will follow the money, no matter what form it takes.&rdquo;</p>\n\n<p>Bitfinex had issued a statement as well, expressing gratitude for the recovery, adding,&nbsp;</p>\n\n<p>&ldquo;We&rsquo;re pleased that the DOJ has recovered a significant portion of the bitcoin stolen during the 2016 hack. We have been cooperating extensively with DOJ since its investigation of this incident began.&rdquo;</p>\n\nRedemption Of Stolen Assets&nbsp;\n<p>Ardoino had stated that Bitfinex was looking forward to recovering as much of the stolen assets as possible and redistributing them to holders of the Recovery Right Tokens (RRt), which were issued after the hack. The tokens were intended to act as an IOU, and holders could exchange them for cash or iFinex capital stock at a later date. Currently, around 30 million RRT tokens are in circulation, which means that the amount recovered is insufficient to redeem all RRT tokens.&nbsp;</p>\n<p>Under Bitfinex&rsquo;s contractual obligations, RRT token holders were to be redeemed at $1, after which up to 80% of any recovered assets were to be paid to SED, UNUS, and LEO token holders. According to Bitfinex, RRT token holders will have their tokens redeemed pro rata today, based on the size of their RRT holdings, on the 6th of July, 2023.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T09:59:27.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T10:00:00.000Z",
    "title": "Advancements in AI to spark broader adoption of InQubeta and Bittensor ",
    "url": "https://crypto.news/advancements-in-ai-to-spark-broader-adoption-of-inqubeta-and-bittensor/",
    "description": "InQubeta and Bittensor are two AI-based projects in today's decentralized finance (DeFi) market that can find mass adoption in the days ahead. QUBE presale is also in progress"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T09:58:16.000Z",
    "title": "Union Finance unveils permissionless credit protocol at ETHBarcelona",
    "url": "https://crypto.news/union-finance-unveils-permissionless-credit-protocol-at-ethbarcelona/",
    "description": "Jacob Shiach, CEO of Union Finance, introduced Union Finance&#8217;s permissionless credit protocol, which aims to facilitate decentralized lending by leveraging trust and coordination among individuals, DAOs, and contracts. Shiach presented a speech on uncollateralized lending and leveraging friendships for fun&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T10:04:28.000Z",
    "title": "Crypto Analytics Firm Santiment Bullish on Shiba Inu (SHIB) Despite Recent Price Drop",
    "url": "https://www.crypto-news-flash.com/crypto-analytics-firm-santiment-bullish-on-shiba-inu-shib-despite-recent-price-drop/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analytics-firm-santiment-bullish-on-shiba-inu-shib-despite-recent-price-drop",
    "description": "<img width=\"1280\" height=\"711\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1-300x167.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1-1024x569.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Shiba Inu may have its weaknesses, but analysts remain bullish on its long-term growth potential. Consistent embrace and the emergence of Shibarium can be positive triggers. As the frenzy around memecoins begins to drop, Dogecoin (DOGE) rival Shiba Inu (SHIB) has started paring off its price gains, however, crypto analytics firm Santiment claims that the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T10:00:42.000Z",
    "title": "Golteum’s GLTM Token: The Key for Diversifying Your Investment Portfolio",
    "url": "https://www.crypto-news-flash.com/golteums-gltm-token-the-key-for-diversifying-your-investment-portfolio/?utm_source=rss&utm_medium=rss&utm_campaign=golteums-gltm-token-the-key-for-diversifying-your-investment-portfolio",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T110359.778.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T110359.778.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T110359.778-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T110359.778-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With the volatility in the Cryptocurrency market, investors are constantly scouting for projects that can diversify their portfolios.  One such project that has caught the interest of investors and cryptocurrency enthusiasts alike is Golteum.  It offers a unique platform that is revolutionizing the concept of tokenized precious metals, so it is no surprise that it [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T09:39:54.000Z",
    "title": "Tradecurve (TCRV) Price Increases 20% Shows No Signs Of Slowdown, While ApeCoin (APE) Price Underperforms",
    "url": "https://www.crypto-news-flash.com/tradecurve-tcrv-price-increases-20-shows-no-signs-of-slowdown-while-apecoin-ape-price-underperforms/?utm_source=rss&utm_medium=rss&utm_campaign=tradecurve-tcrv-price-increases-20-shows-no-signs-of-slowdown-while-apecoin-ape-price-underperforms",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T111053.939.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T111053.939.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T111053.939-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T111053.939-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Recently, ApeCoin and Tradecurve have garnered attention in the cryptocurrency market. While ApeCoin&#8217;s price performance has been lackluster, Tradecurve has shown remarkable growth, with a 20% price increase and more expected price hikes. Today, we will look into the reasons behind ApeCoin&#8217;s underperformance and explore the factors driving Tradecurve&#8217;s bullish trend. &#62;&#62;BUY TCRV TOKENS NOW&#60;&#60; [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T09:39:48.000Z",
    "title": "Uniswap (UNI) Achieves Historic Milestone with $391 Million in 24-hour Trading Volume",
    "url": "https://www.crypto-news-flash.com/uniswap-uni-achieves-historic-milestone-with-391-million-in-24-hour-trading-volume/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-uni-achieves-historic-milestone-with-391-million-in-24-hour-trading-volume",
    "description": "<img width=\"1201\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-1024x512.png 1024w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />Uniswap&#8217;s network has outpaced Bitcoin (BTC) and Cardano (ADA) in the volume of cryptocurrency traded during the past 24 hours. Uniswap has said that its achievement is primarily attributed to liquidity.  In a new twist of events, a bullish attitude is shown by the trading volume on Uniswap, which includes UNI among the select networks [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-07T09:40:01.000Z",
    "title": "The Next 30X Early Altcoin Gems",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-next-30x-early-altcoin-gems/",
    "description": "<p>We are in the early bull market. Nonetheless, most altcoins are still down around 90%. It seems to be the best time to identify and accumulate these altcoins that can give us an easy 30x return or even more.  I call them early gems. In this article, you will discover 3 very interesting altcoin gems that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-next-30x-early-altcoin-gems/\">The Next 30X Early Altcoin Gems</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]