[
  {
    "source": "CoinDesk",
    "date": "2023-10-05T21:52:55.000Z",
    "title": "A Better Way to Distribute Crypto Ecosystem Grants",
    "url": "https://www.coindesk.com/consensus-magazine/2023/10/05/a-better-way-to-distribute-crypto-ecosystem-grants/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Token project treasuries, foundations and grant programs are a necessary lifeline during the bear market. But this funding could be more fairly disbursed, Lunar Strategy's Tim Haldorsson writes."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-05T21:50:44.000Z",
    "title": "Report finds that Binance only distributed 10% of promised BNB tokens during ICO",
    "url": "https://cryptoslate.com/report-finds-that-binance-only-distributed-10-of-promised-bnb-tokens-during-ico/",
    "description": "<p>An investigative report published in Forbes on Oct. 5 found that Binance may have significantly overstated the success of its initial coin offering (ICO) for Binance Coin (BNB) in 2017. According to the reporting, Binance founder and CEO Changpeng Zhao began to conceptualize BNB and circulate a white paper for the asset in June 2017. Binance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/report-finds-that-binance-only-distributed-10-of-promised-bnb-tokens-during-ico/\">Report finds that Binance only distributed 10% of promised BNB tokens during ICO</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-05T22:00:56.000Z",
    "title": "Tales From the FTX Bean Bag: Witness Reveals Bankman-Fried’s Financial Missteps and Personal Entanglements",
    "url": "https://news.bitcoin.com/tales-from-the-ftx-bean-bag-witness-reveals-bankman-frieds-financial-missteps-and-personal-entanglements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Tales From the FTX Bean Bag: Witness Reveals Bankman-Fried&#039;s Financial Missteps and Personal Entanglements\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bean.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />During the Sam Bankman-Fried trial this week, Adam Yedidia, a close friend and former employee of the ex-FTX chief, delivered his testimony. Yedidia had a brief stint as an intern at Alameda Research, a quantitative trading firm linked to FTX, before he transitioned to FTX&#8217;s Hong Kong office in early 2021. Additionally, he was part [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T22:00:12.000Z",
    "title": "Binance Faces Scrutiny Over Alleged ICO Missteps And Token Distribution Discrepancies",
    "url": "https://www.newsbtc.com/binance/binance-faces-scrutiny-over-alleged-ico-missteps-and-token-distribution-discrepancies/",
    "description": "Binance, the world&#8217;s largest cryptocurrency exchange, is currently grappling with challenges that have raised concerns about its credibility and market performance.  Recent reports by Forbes shed light on Binance&#8217;s initial coin offering (ICO) and the subsequent distribution of its native cryptocurrency, Binance Coin (BNB).  Behind The Curtain The investigation reveals allegations of undisclosed token retention, discrepancies in the ICO process, and the accumulation of a significant token reserve by Binance.  Related Reading: This Ethereum Metric Is Retesting The Bear-Bull Junction, Will Break Happen? Per the report, in June 2017, Binance initiated its ICO, aiming to raise $15 million by selling 100 million BNB tokens. However, the Forbes investigation, conducted with the assistance of crypto forensic firms, suggests that only around 10.78 million BNB tokens were transferred to investors during the ICO.  An additional 20 million tokens were “quietly” allocated to angel investors, doubling their initial allocation to 40 million tokens. Consequently, according to Forbes, Binance likely raised less than $5 million during the ICO, contrary to the $15 million claimed by founder Changpeng Zhao.  The Forbes report indicates that Binance&#8217;s white paper did not disclose the company&#8217;s plans for unsold tokens in the event of an undersold ICO. While it is not illegal for issuers to retain unsold tokens, transparency is crucial in such cases, Forbes alleges.  Binance founders and insiders reportedly ended up with 145 million BNB tokens instead of the originally planned 80 million. These tokens, initially valued at less than $10 million, are now estimated to be worth approximately $14 billion. Furthermore, Binance implemented a token buyback and burn program to reduce the total supply of BNB tokens over time.  According to Binance&#8217;s website, approximately 48 million tokens have been burned as of August 31, 2023. However, Forbes suggests that Binance controls nearly 117 million tokens, accounting for 76% of the total outstanding supply.  The analysis combines disclosed tokens issued to the founding team with a proprietary probabilistic analysis that identifies previously undisclosed wallets holding customer funds and serving other corporate purposes. Forbes concludes discrepancies and lack of transparency surrounding Binance&#8217;s ICO and token distribution raise questions about the integrity of reported trading volumes and the adequacy of consumer protections.  Binance CEO Maintains Silence Amid Ongoing Forbes Allegations  Changpeng Zhao (CZ), the Chief Executive Officer of Binance, has remained silent in the face of recent allegations and ongoing investigations brought forth by Forbes.  The prolonged exchange of statements between the cryptocurrency firm and the renowned news outlet has endured for a significant period. Binance had taken legal action against Forbes in 2020, filing a defamation lawsuit in the US District Court in New Jersey.  The lawsuit stemmed from Forbes&#8217; publication of “false statements” that Binance allegedly used deceptive practices to deceive regulators and participated in money laundering activities. Forbes published a series of articles that made damaging claims about Binance&#8217;s corporate structure, asserting that it was deliberately designed to deceive regulators and engaged in activities characteristic of money laundering. Binance vehemently denied these allegations, deeming them false and highly defamatory.  Binance&#8217;s attorney, Charles J. Harder, has emphasized the harm caused to Binance&#8217;s reputation by Forbes&#8217; misleading story. Binance had requested a retraction or correction from Forbes, which was refused, leading to the necessity of the defamation lawsuit.  Related Reading: XRP, Polygon See Month-High Volumes As Investors Show FOMO Overall, Binance and Forbes have been embroiled in contentious claims and disputes, with both parties accusing each other of disseminating inaccurate information.  As the situation unfolds, it remains uncertain how the cryptocurrency exchange will respond to the latest allegations put forth by Forbes. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-05T22:01:45.000Z",
    "title": "DOJ Seeks To Seize Two Luxury Jets Allegedly Owned by Sam Bankman-Fried As FTX Trial Enters Third Day",
    "url": "https://dailyhodl.com/2023/10/05/doj-seeks-to-seize-two-luxury-jets-allegedly-owned-by-sam-bankman-fried-as-ftx-trial-enters-third-day/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/doj-seizes-over-28.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Department of Justice (DOJ) is looking to seize two luxury jets that are allegedly owned by former FTX chief executive Sam Bankman-Fried. In a new court filing, the government says that the defendants’ charges will allow them to seize a Bombardier Global 5000 BD-700-1A11 aircraft and an Embraer Legacy EMB-135BJ aircraft – two [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/05/doj-seeks-to-seize-two-luxury-jets-allegedly-owned-by-sam-bankman-fried-as-ftx-trial-enters-third-day/\">DOJ Seeks To Seize Two Luxury Jets Allegedly Owned by Sam Bankman-Fried As FTX Trial Enters Third Day</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]