[
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T23:00:30.000Z",
    "title": "Speculation on potential Bitcoin ETF rejection causes market stir as focus shifts to ordinals’ potential: SlateAsia Episode #4",
    "url": "https://cryptoslate.com/podcasts/speculation-on-potential-bitcoin-etf-rejection-causes-market-stir-as-focus-shifts-to-ordinals-potential-slateasia-episode-4/",
    "description": "<p>The recent episode of SlateAsia brought together prominent voices in the space to discuss the tumultuous start of 2024 for Bitcoin and the rising interest in Ordinals. The podcast featured Liam Wright, Senior Editor of CryptoSlate, Nate Whitehill, the CEO of CryptoSlate, and Jason Fang from Sora Ventures. Their conversation centered on the SEC&#8217;s potential [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/podcasts/speculation-on-potential-bitcoin-etf-rejection-causes-market-stir-as-focus-shifts-to-ordinals-potential-slateasia-episode-4/\">Speculation on potential Bitcoin ETF rejection causes market stir as focus shifts to ordinals&#8217; potential: SlateAsia Episode #4</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T23:06:51.000Z",
    "title": "Matrixport predicts SEC’s spot Bitcoin ETF rejection",
    "url": "https://www.cryptopolitan.com/matrixport-sec-spot-bitcoin-etf-rejection/",
    "description": "In a bold and somewhat grim forecast, Matrixport, a leading digital finance firm, has projected that the U.S. Securities and Exchange Commission (SEC) will reject all spot Bitcoin ETF (Exchange-Traded Fund) applications in January. This prediction, outlined in their latest report, is not just a routine market analysis. It’s a siren call that echoes through [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T23:00:39.000Z",
    "title": "Crypto Analyst Predicts 100% Surge For Shiba Inu, But There’s A Roadblock",
    "url": "https://www.newsbtc.com/shiba-inu/100-surge-for-shiba-inu/",
    "description": "Through the rips and dips of the crypto market, the Shiba Inu price has been able to maintain a rather consistent bullish momentum, something that cannot be said for a lot of cryptocurrencies. Given this sustained bullish sentiment, the meme coin is primed to be one of the assets to see a massive rally as the market inches toward another bear market. In the short term alone, pseudonymous crypto analyst MMBTtrader is predicting that the price will mount a 2x rally. Shiba Inu Price Ready To Rise 100% In a recent analysis, crypto analyst MMBTtrader reveals why they believe that the Shiba Inu price is set to double.  As the chart shows, there has been a steady uptrend in the Shiba Inu price over the last few months, and even when the uptrend seemed to have come to an end, the SHIB price maintained a relatively high price compared to its October lows. Related Reading: 3 Under The Radar Altcoins Expected To Hit $100 Before The Bitcoin Halving This outperformance has continued into the new year as SHIB was able to still maintain the $0.00001 level despite dips rocking the crypto market. This suggests that bulls have been able to successfully turn $0.00001 into support. In this scenario, it could easily become a launchpad for the price. Source: TradingView.com The crypto analyst’s prediction suggests that it could begin to range at its current price. However, once this ranging ends and accumulation is complete, this is where the real fun begins for the SHIB price when the rally is expected to begin. A bounce from here would see SHIB easily clear the $0.000014 level with no hassle. However, the first roadblock lies just above here. In the event that Shiba Inu is quickly able to surmount the resistance at $0.0000143, another pump is expected that could lead up to $0.000018. Since there is no such thing as a single continuous upward movement, resistance is expected just below $0.000018. Nevertheless, this is the last resistance and if Shiba Inu climbs above this level, then it is expected to shoot above $0.00002, completing a 100% move from its current price. SHIB price at $0.0000094 &#124; Source: SHIBUSD on Tradingview.com SHIB Sways Amid Market Uncertainty In the weeks leading up to January, confidence around the potential approval of a Spot Bitcoin ETF was at an all-time high, with experts giving it a 95% chance of approval. However, this sentiment has begun to sway especially as BlackRock revealed it will be delaying its $10 million BTC purchase. Related Reading: Dogecoin, Cardano, And Chainlink Get Special Listing From Binance As a result, the price of cryptocurrencies across the space declined rapidly and the Shiba Inu price was not left out. SHIB finally lost its footing at $0.00001 for the first time in over two weeks, falling to the $0.000009 region once again. However, this is not out of the ordinary and could lead to the SHIB ranging and accumulation that the crypto analyst outlines. In such a case, this could present a setup for a bigger price rally as expectations for a bull market grow high. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from DMARGE, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T23:01:04.000Z",
    "title": "New Crypto Tax Law That’s ‘Impossible To Comply With’ Now in Effect, Says Coin Center – Here’s What It Is",
    "url": "https://dailyhodl.com/2024/01/03/new-crypto-tax-law-thats-impossible-to-comply-with-now-in-effect-says-coin-center-heres-what-it-is/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/imf-regulatory-regime.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" /><p>A prominent crypto advocacy group says that new crypto tax regulations have come into effect that are impossible to comply with. In a new press release, Coin Center says that The Infrastructure Investment and Jobs Act, which passed Congress in 2021, came into effect on January 1st and will force anyone who receives more than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/new-crypto-tax-law-thats-impossible-to-comply-with-now-in-effect-says-coin-center-heres-what-it-is/\">New Crypto Tax Law That’s ‘Impossible To Comply With’ Now in Effect, Says Coin Center – Here’s What It Is</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]