[
  {
    "source": "Decrypt",
    "date": "2023-08-14T19:26:35.000Z",
    "title": "Crypto Sleuth ZachXBT Avoids Lawsuit After Backing Off Claims Against NFT Trader",
    "url": "https://decrypt.co/152463/crypto-sleuth-zachxbt-avoids-lawsuit-after-backing-off-claims-against-nft-trader",
    "description": "Jeffrey \"Machi Big Brother\" Huang has withdrawn his defamation suit against ZachXBT, but only after the sleuth softened his published accusations."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T19:25:18.000Z",
    "title": "Zimbabwe central bank close to introducing gold-backed digital tokens into retail",
    "url": "https://cointelegraph.com/news/zimbabwe-central-bank-close-introducing-gold-backed-digital-tokens-retail",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dd64ec20-b499-499a-af6d-f0740acc6f07.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Physical and digital gold tokens have been a big success as investments and an inflation hedge in Zimbabwe, which continues to face triple-digit inflation.</p>\n                    <p><p>The Reserve Bank of Zimbabwe (RBZ) expects to launch its gold-backed digital token (GBDT) for retail use soon, the RBZ has stated. This follows the token’s success with investors, which the bank described as “commendable” in a recent report.</p><p>The RBZ <a href=\"https://cointelegraph.com/news/zimbabwe-s-central-bank-to-issue-gold-backed-digital-currency-report\">announced the introduction</a> of the GBDT in April and had conducted 11 issuances representing 325 kg. of gold by July 21, according to a mid-term financial report the bank <a href=\"https://www.rbz.co.zw/documents/mps/2023/Mid-Term_Monetary_Policy_Statement_2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> on Aug. 9. The tokens are backed by physical gold held by the RBZ.</p><p>Now the GBDT “shall be scaled up to be used for transactional purposes by the public.” The RBZ said:</p><blockquote>“The Bank is at an advanced stage in preparations for the rolling out of GBDTs for transactional purposes in Phase II of the project. […] It is envisaged that the transactional phase will see GBDTs complimenting [sic] the demand for the US dollar in domestic transactions as retailers will be offered a safer, more convenient, and value-preserving medium of exchange.” </blockquote><p>The GBDT issuance came after the RBZ began issuing physical gold coins last year. Those were snatched up by investors and only 2% of them have been redeemed, the RBZ said. The GBDT offers the advantages of divisibility and increased security, the bank claimed.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-offers-africa-lifeline-inflation-corruption\">Crypto offers Africans a ‘lifeline’ from inflation and corruption, say execs</a></em></strong></p><p>Inflation in Zimbabwe <a href=\"https://www.bloomberg.com/news/articles/2023-06-26/zimbabwe-inflation-back-at-three-digits-after-currency-crashes\" target=\"_blank\" rel=\"noopener nofollow\">reached</a> 175.8% in June after the bank adopted a new benchmarking index. The RBZ set its interest rate at 150% that month. The U.S. dollar is heavily used in local trade.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/42182740-a7ec-4e0a-b912-9ee153f507a5.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Annual inflation in Zimbabwe. Source RBZ/ZIMSTAT</em></figcaption></figure><p>The RBZ has been pursuing a central bank digital currency (CBDC) since July 2022 and said it is making steady progress. It conducted a survey that found 71.7% of respondents would be willing to use it. The GBDT would “form the basis for the development” of a CBDC as it “exhibits most of the characteristics of a CBDC.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today&#39;s <a href=\"https://twitter.com/hashtag/Fintech?src=hash&amp;ref_src=twsrc%5Etfw\">#Fintech</a> Digest includes the Reserve Bank of Zimbabwe preparing to roll out its gold-backed digital tokens for transactions, and some fake news about <a href=\"https://twitter.com/hashtag/Ripple?src=hash&amp;ref_src=twsrc%5Etfw\">#Ripple</a> working with the Reserve Bank of New Zealand on <a href=\"https://twitter.com/hashtag/CBDC?src=hash&amp;ref_src=twsrc%5Etfw\">#CBDC</a> development on the <a href=\"https://twitter.com/hashtag/XRP?src=hash&amp;ref_src=twsrc%5Etfw\">#XRP</a> Ledger. <a href=\"https://t.co/SFR6O90maT\">https://t.co/SFR6O90maT</a> <a href=\"https://t.co/aw8IeCkiSj\">pic.twitter.com/aw8IeCkiSj</a></p>&mdash; John Kiff (@Kiffmeister) <a href=\"https://twitter.com/Kiffmeister/status/1691116259235266560?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\">Bitcoin in Senegal: Why is this African country using BTC?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T19:21:23.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>A Chinese man has reportedly been arrested for buying and transferring stablecoins. Payments giant PayPal is set to roll out a Cryptocurrencies Hub for some users, allowing for the sale and purchase of cryptocurrencies, among other functionalities. Meanwhile, yield platform Zunami Protocol has suffered a flash loan exploit, with over $2.1 million in funds stolen, according to blockchain security firms.</p><h2>China enforcing crypto ban with latest arrest</h2><p>China’s crackdown on cryptocurrency transactions remains in full swing, as evidenced by the latest enforcement actions in Fujian province.</p><p>According to local media, a man described only as <a href=\"https://cointelegraph.com/news/chinese-man-sentenced-9-months-prison-buying-13-thousand-in-tether-usdt\">Mr. Chen was convicted</a> by the Fuzhou Mawei People’s Procuratorate on charges of “concealmant and concealment of crime” for purchasing $13,067 worth of Tether’s USDT stablecoin. Mr. Chen reportedly received a request from his acquaintance, Mr. Lin, to purchase the USDT on his behalf. Prosecutors seemed to imply that the transaction was used for money laundering.</p><p>“Con artists use virtual currency to transfer and launder stolen money,” the Fuzhou Mawei People’s Procuratorate said, according to a Google translation. “This kind of online money laundering in the name of purchasing virtual currency, knowing that others use the information network to commit crimes and providing assistance to them, has violated the law.”</p><p>Mr. Chen was sentenced to nine months in prison and fined 5,000 yuan, or $689.</p><p>China has been cracking down on cryptocurrencies since at least 2017 and has <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">expanded its enforcement actions</a> recently. Multichain was shut down in July after Chinese police arrested the protocol’s CEO.</p><h3>PayPal to roll out Cryptocurrencies Hub for select users</h3><p>Payments giant PayPal, which recently launched the dollar-backed stablecoin PayPal USD (PYUSD), updated its terms and conditions to introduce Cryptocurrencies Hub — a feature that allows users to hold and interact with Bitcoin and cryptocurrencies in their PayPal account.</p><p>The latest PayPal terms and conditions detail the prerequisites for crypto users interested in using the platform for cryptocurrencies. According to the company, the Cryptocurrencies Hub service will allow for the sale and purchase of crypto. In addition, it will facilitate the payment for purchases via PayPal using the money stored after the sale of cryptocurrencies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/98b429a1-eb0e-4bbe-b2ec-30493870eec8.png\"  /></figure><p>The Cryptocurrencies Hub will also be crucial to convert between PYUSD and other crypto assets. PayPal further clarified:</p><blockquote>“Any balance in your Cryptocurrencies Hub represents your ownership of the amount of each Crypto Asset shown. You will not hold the digital Crypto Assets themselves in your Crypto Asset balance.”</blockquote><p>However, not all PayPal users will get to explore the new feature as the company will decide its access from person to person. For starters, to be eligible for Cryptocurrencies Hub, a PayPal user must have “a personal PayPal account and a Balance Account in good standing.” </p><p>In addition, PayPal will also verify the required identifying information, which includes name, physical address, date of birth and taxpayer identification number provided by the users: </p><blockquote>“You can only use your Cryptocurrencies Hub as part of your Balance Account by accessing it through your personal PayPal account. If you are a Hawaii resident, we will not allow you to establish a Cryptocurrencies Hub at this time.”</blockquote><p>Upon rollout of the feature, Cryptocurrencies Hub will be directly linked to the user’s PayPal account and can be accessed using the existing credentials.</p><h3>Zunami Protocol suffers estimated $2.1 million flash loan exploit</h3><p>Decentralized finance protocol Zunami Protocol has confirmed on Aug. 13 it has suffered an exploit on its “zStables” pools on Curve Finance. </p><p>Blockchain security firm PeckShield estimates over $2.1 million was stolen from Zumani’s Curve Pool via a flash loan, which has affected both its Zumani ETH (zETH) and Zumani USD (UZD).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Please do not buy zETH and UZD at the moment, their emission has been attacked.</p>&mdash; Zunami Protocol (@ZunamiProtocol) <a href=\"https://twitter.com/ZunamiProtocol/status/1690885809639948288?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>CertiK, another blockchain security firm, said the attacker was able to manipulate prices on the pairs that its UZD balance depends, with the profits swapped for 1178 ETH, which has already been sent to crypto mixer Tornado Cash.</p><p>Zunami is a decentralized revenue aggregator protocol that allows users to stake stablecoins for yield, with its largest stable <a href=\"https://cointelegraph.com/news/binance-invests-5-million-curve-crv-token-hacker-partially-returns-funds\">pools on Curve.</a></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-14T19:30:39.000Z",
    "title": "Dormant Since 2010, Bitcoin Address Awakens to Move 1,005 BTC Worth $29.7 Million",
    "url": "https://news.bitcoin.com/dormant-since-2010-bitcoin-address-awakens-to-move-1005-btc-worth-29-7-million/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Dormant Since 2010, Bitcoin Address Awakens to Move 1,005 BTC Worth $29.7 Million\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/20102.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On the morning of Monday, August 14, 2023, at the precise block height of 803,135, a dormant bitcoin address &#x2014; created on November 9, 2010 &#x2014; stirred to life. After lying in slumber for an exacting 12.9 years, it awoke to spend a staggering 1,005 bitcoin, a sum swelling to an impressive value of more [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T19:30:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T19:17:21.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T19:11:51.000Z",
    "title": "Coinbase empowers the crypto world with groundbreaking advocacy group",
    "url": "https://www.cryptopolitan.com/coinbase-pro-crypto-advocacy-group/",
    "description": "Leading crypto exchange Coinbase has taken an innovative leap forward by introducing a novel nonprofit venture to champion pro-crypto regulations on a global scale. The newly-established Stand With Crypto Alliance, spearheaded by the leading exchange, aims to drive legislative measures in the U.S. that are beneficial for the broader crypto industry, fostering both innovation and ... <a title=\"Coinbase empowers the crypto world with groundbreaking advocacy group\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-pro-crypto-advocacy-group/\" aria-label=\"More on Coinbase empowers the crypto world with groundbreaking advocacy group\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T19:10:36.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T19:25:53.000Z",
    "title": "Michael Burry’s Massive $1.6 Billion Short: Is A $DXY Collapse The Catalyst For A Crypto Bloodbath?",
    "url": "https://www.newsbtc.com/news/michael-burrys-massive-1-6-billion-short-is-a-dxy-collapse-the-catalyst-for-a-crypto-bloodbath/",
    "description": "Michael Burry, renowned investor, and hedge fund manager, has once again made headlines with his significant short position in the traditional market, which could impact the nascent crypto industry if his bet is to materialize. Burry, known for accurately predicting the subprime mortgage crisis, recently went mega-short with over $1.6 billion in S&#38;P 500 (SPY) and Nasdaq 100 (QQQ) puts. These indexes often record a high correlation with the crypto market as they attract similar investors.  Burry&#8217;s $1.6 Billion Short Signals Potential Implications For Crypto Market Burry&#8217;s track record as an astute investor lends weight to his latest bet. By predicting and profiting from the subprime mortgage crisis, he gained a reputation as an investor capable of identifying market trends before they unfold.  It is important to consider that Burry has established himself as a prognosticator who is often ahead of the curve and is willing to wait for the anticipated market changes to come to fruition. Related Reading: HBAR Token Spikes 16% In One Day, Can Bulls Sustain the Momentum? On this matter, Yan Alleman, co-founder of Glassnode, has supported Burry&#8217;s approach, suggesting that while the short-term effects may not be immediately evident, the long-term payoff is likely to be significant. Alleman also highlighted the potential impact of the US Dollar Index (DXY) on the cryptocurrency market, specifically Bitcoin. According to Alleman, the recent renewed strength of the DXY could exert pressure on Bitcoin. The DXY measures the value of the U.S. dollar against a basket of major currencies.  On The Verge Of A Final Leg Up? As Burry predicts, a drop in the DXY could result in a significant surge in crypto assets, including Bitcoin, as investors seek alternative stores of value. This surge would represent a final leg up before a presumed deep correction across financial markets. While the correlation between the DXY and Bitcoin has been subject to debate, the potential consequences of Burry&#8217;s short position on the market cannot be ignored.  If his prediction were to come true, it could trigger a domino effect, leading to a substantial downturn in traditional markets and a subsequent surge in crypto assets. Nevertheless, the implications for Bitcoin and the broader crypto market in such a scenario are twofold. On the one hand, Bitcoin has often been hailed as a digital store of value and a hedge against traditional market downturns.  Burry&#8217;s short position on the market could reinforce this narrative, attracting more investors to Bitcoin as a safe haven asset. On the other hand, the cryptocurrency market&#8217;s extreme volatility could magnify the potential crypto bloodbath if Burry&#8217;s bet materialized.  A sudden surge in selling pressure for Bitcoin and other cryptocurrencies, coupled with a widespread market correction, could result in a sharp decline in the crypto market, causing substantial losses for investors who entered the market at its peak. Related Reading: Winds Of Change: Bitcoin Miner Riot Sees Substantial Increase In BTC Holdings As the market unfolds in the coming weeks and months, all eyes will be on Michael Burry&#8217;s $1.6 billion short position and its potential impact on traditional markets and crypto.  Only time will tell if Burry&#8217;s bet proves prescient once again or if the market defies his expectations, leaving investors to navigate the ever-changing landscape of investment opportunities. As of the current writing, Bitcoin (BTC) is trading at $29,300, indicating a marginal 0.3% decline over the past 24 hours. The cryptocurrency has continued to be in a consolidation phase since the start of August. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-14T19:32:00.000Z",
    "title": "SEC Becoming Unpopular in Crypto Circles Since XRP Victory",
    "url": "https://coinedition.com/sec-becoming-unpopular-in-crypto-circles-since-xrp-victory/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto community might be tired of the ongoing regulatory onslaught against crypto institutions by the U.S. Securities and Exchange Commission. Notably, the SEC’s recent lawsuit against crypto exchange Coinbase seems to be drawing dislike from all quarters. In a Twitter post, crypto advocate and lawyer John Deaton referred to the agency as “arrogant” and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-becoming-unpopular-in-crypto-circles-since-xrp-victory/\">SEC Becoming Unpopular in Crypto Circles Since XRP Victory</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]