[
  {
    "source": "CoinDesk",
    "date": "2023-10-09T21:06:00.000Z",
    "title": "Blocknative Reduces Headcount by Third, After Suspending Work on Relay Project",
    "url": "https://www.coindesk.com/tech/2023/10/09/blocknative-reduces-headcount-by-third-after-suspending-work-on-relay-project/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company completed a restructuring in the wake of its decision to exit services related to its MEV-Boost Relay, a type of software used by Ethereum network validators."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T21:34:25.000Z",
    "title": "Why is Ethereum (ETH) price down today? ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-12/765169f9-a0f0-417e-80a7-e46c62d58f26.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum price is down today as heavy selling from notable wallets and general disinterest in the recent ETH futures ETF weigh on investor sentiment.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), the native token of the Ethereum network, has experienced an 8.2% decline between Oct. 2 and Oct. 9. This price drop can be attributed to an increase in coin issuance resulting from its regular monetary policy, relevant sales by Vitalik Buterin, and a disappointing first week for the futures-based exchange-traded fund (ETF) instrument.</p><h2>Ether supply increase shatters the “ultrasound” theory</h2><p>Throughout 2022, the Ethereum network underwent significant upgrades, which altered its coin issuance mechanism. This overhaul resulted in a substantial reduction in the number of new Ether tokens issued to secure the network and introduced a burn mechanism to further decrease the supply of ETH.</p><p>Ethereum enthusiasts have affectionately referred to this new supply schedule as \"ultrasound money.\" This is because, for most of 2023, the number of coins burned has exceeded the number issued, effectively causing a net decrease in the total ETH supply. However, what many failed to grasp is the inherent unpredictability of this monetary policy.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/c7751cf1-d487-4749-915f-09784e55a5ae.png\"  /><figcaption style=\"text-align: center;\"><em>Ether annualized burn, issuance and supply, 30 days. Source: ultrasound.money</em></figcaption></figure><p>In September 2023, the coin issuance equation experienced an inversion as dynamic base fees decreased due to reduced network activity. According to data from the Ethereum analytics provider ultrasound.money, the supply of ETH has increased by 30,064 ETH in the past 30 days due to decreased activity in the burn mechanism.</p><p>It's important to note that Ethereum's mechanisms are functioning as designed, and there were no unexpected triggers for the reduced demand in transactions. Part of the issue lies in the high fees resulting from persistent network congestion, a problem only partially addressed by layer-2 scaling solutions.</p><h2>Vitalik and the Ethereum Foundations’ sale are bad optics </h2><p>Data from the Arkham analytics <a href=\"https://platform.arkhamintelligence.com/explorer/address/0xD04daa65144b97F147fbc9a9B45E741dF0A28fd7\" target=\"_blank\" rel=\"noopener nofollow\">reveals</a> that an address associated with Vitalik Buterin has sent 3,999 ETH to exchanges in the past five weeks, with a total value of approximately $6.4 million. This significant movement has sparked speculation within the community regarding its reasons, given the magnitude of the sale.</p><p>The most recent transaction on Oct. 7 suggests that the ETH was likely exchanged for fiat currency on Bitstamp. Notably, the address 0xD04daa65144b97F147fbc9a9B45E741dF0A28fd7 still holds 36,000 ETH, equivalent to $57.2 million.</p><p>The Ethereum Foundation has also recently made a sale, converting 1,700 ETH into $2.74 million worth of stablecoins on Oct. 9 using Uniswap. However, in this case, analysts have pointed out that the foundation's actions align with its regular requirements for operational expenses, grants, and incentives.</p><h2>Dwindling demand for the ETH futures ETF </h2><p>A crypto wallet address linked to the FTX exploiter, initially holding 175,496 ETH, has <a href=\"https://cointelegraph.com/news/ftx-exploiter-moves-36-8-m-ether-sam-bankman-fried-trial\">moved a significant portion to the THORChain router</a> and subsequently converted it into Threshold Network's tBTC, an ERC-20 tokenized version of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). Interestingly, this move prompted <a href=\"https://cointelegraph.com/news/thorswap-goes-into-maintenance-mode-to-counter-illicit-funds-movement\">THORSwap to suspend conversion</a> transactions on Oct. 6 following consultations with advisors, legal counsel, and law enforcement.</p><p>Numerous hypotheses could be formulated to explain the on-chain activity of the FTX hacker, but there seems to be no reason for converting ETH into a wrapped version of Bitcoin other than anticipating higher returns in fiat currency terms. Despite the recent increase in Ether's supply, its price trend against Bitcoin has been unfavorable since November 2022.</p><p>Ether has underperformed Bitcoin by 25.7% in the last 11 months, causing the ETH/BTC ratio to breach the 0.06 support level. Therefore, several factors can be attributed to the negative sentiment surrounding Ether's price, including the U.S. Securities and Exchange Commission's <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">lawsuits against Binance and Coinbase</a> in June 2023.</p><p>More recently, the launch of <a href=\"https://cointelegraph.com/news/ethereum-futures-etfs-launch-low-volume-trading-first-day\">Ethereum futures-based Ether ETFs</a> on the Chicago Mercantile Exchange (CME) and Chicago Board Options Exchange (CBOE) on Oct. 2 <a href=\"https://twitter.com/David_Dierking/status/1711412529346249210\" target=\"_blank\" rel=\"noopener nofollow\">brought in</a> less than $10 million in aggregate assets under management during the first week of trading.</p><p>Overall, the news surrounding Ether has been predominantly negative, which accounts for its recent poor performance. Factors contributing to this trend include increased regulatory risks for tokens and exchanges, the resumption of net coin issuance, sales by Vitalik and the Ethereum Foundation, and weaker-than-expected demand for the futures-based ETF.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T21:30:00.000Z",
    "title": "Pro-crypto RFK Jr. leaves Democrats to campaign for U.S. president as independent",
    "url": "https://cointelegraph.com/news/pro-crypto-rfk-jr-leaves-democrats-to-campaign-u-s-president-independent",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4d61eb3d-be46-4155-824d-911cffb52eae.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Robert F. Kennedy Jr. is starting his presidential candidacy as an independent with a strong showing of 19%, according to the super PAC supporting him. That’s far behind Biden and Trump. </p>\n                    <p><p>Pro-crypto candidate for the United States presidency Robert F. Kennedy, Jr., often known simply as RFK Jr., <a href=\"https://www.youtube.com/watch?v=A9opkWJn5aE\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Oct. 9 at a rally in Philadelphia that he was dropping his bid for nomination in the Democratic primary to run as an independent instead. “I’m here to declare myself an independent candidate,” he said.</p><p>Kennedy has been a supporter of crypto, and he <a href=\"https://fortune.com/crypto/2023/07/19/robert-f-kennedy-jr-bitcoin-no-capital-gains-back-treasury-bonds-policy-proposals/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://fortune-com.cdn.ampproject.org/c/s/fortune.com/crypto/2023/07/19/robert-f-kennedy-jr-bitcoin-no-capital-gains-back-treasury-bonds-policy-proposals/amp/\">stated</a> that one of the goals of his administration would be “making America the global hub of cryptocurrency, particularly Bitcoin.” He revealed plans in July <a href=\"https://cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president/amp\">to back the USD with “hard currency,”</a> such as gold, silver, platinum and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>Kennedy <a href=\"https://cointelegraph.com/news/white-house-hopeful-rfk-jr-says-instant-payments-may-lead-to-financial-slavery\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/white-house-hopeful-rfk-jr-says-instant-payments-may-lead-to-financial-slavery/amp\">was also a vocal opponent</a> of the Federal Reserve’s FedNow instant payment system, equating it with a central bank digital currency (CBDC) and stating in a Twitter (now X) post that “CBDCs grease the slippery slope to financial slavery and political tyranny” and there was an “obvious danger that this is the first step in banning and seizing bitcoin.” The U.S. Federal Reserve Board later <a href=\"https://cointelegraph.com/news/federal-reserve-service-not-related-to-cbdcs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/federal-reserve-service-not-related-to-cbdcs/amp\">launched a public-awareness campaign</a> to differentiate FedNow from CBDC.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I’m ready for tomorrow, are you? Catch my livestream from 12-2pm tomorrow:<a href=\"https://t.co/r40WRqz8zw\">https://t.co/r40WRqz8zw</a> <a href=\"https://t.co/bSxVuNPL2U\">pic.twitter.com/bSxVuNPL2U</a></p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1711181357794074755?ref_src=twsrc%5Etfw\">October 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kennedy had been teasing his decision for several days. The super-PAC (political action committee) supporting him, American Values 2024, <a href=\"https://www.prnewswire.com/news-releases/new-poll-shows-rfk-jr-can-win-as-independent-301944416.html\" target=\"_blank\" rel=\"noopener nofollow\">released</a> polling results on Oct. 2 that, it claimed, showed he would be the strongest independent candidate in the modern history of U.S. elections, with the support of 19% of the electorate. That is compared to 38% support for U.S. President Joe Biden and former president Donald Trump.</p><p>Hundreds of independent candidates have <a href=\"https://ballotpedia.org/Presidential_candidates,_2024#List_of_registered_2024_presidential_candidates\" target=\"_blank\" rel=\"noopener nofollow\">declared</a> their candidacy in the 2024 presidential race, but few of them have attracted widespread notice. The only remaining democratic party challenger to Biden is now writer Marianne Williamson. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bobby might share the same name as our father, but he does not share the same values, vision or judgment. Today's announcement is deeply saddening for us. We denounce his candidacy and believe it to be perilous for our country. <a href=\"https://twitter.com/roryekennedy?ref_src=twsrc%5Etfw\">@roryekennedy</a> <a href=\"https://twitter.com/joekennedy?ref_src=twsrc%5Etfw\">@joekennedy</a> <a href=\"https://twitter.com/KKT_Kennedy?ref_src=twsrc%5Etfw\">@KKT_Kennedy</a> <a href=\"https://t.co/WJfGwSxN1z\">pic.twitter.com/WJfGwSxN1z</a></p>— Kerry Kennedy (@KerryKennedyRFK) <a href=\"https://twitter.com/KerryKennedyRFK/status/1711419719683559659?ref_src=twsrc%5Etfw\">October 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Kennedy name has been closely associated with the Democratic Party for generations, but RFK Jr.’s positions on a variety of issues, such as his opposition to vaccines, have alienated him from the party mainstream and his own family. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/one-less-crypto-friendly-candidate-miami-mayor-ends-us-presidential-run\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/one-less-crypto-friendly-candidate-miami-mayor-ends-us-presidential-run/amp\">One less crypto-friendly candidate — Miami mayor ends US presidential run</a></em></strong></p><p>Kennedy’s views on crypto were often comparable to those of Republican presidential contender and Florida governor Ron DeSantis. DeSantis <a href=\"https://cointelegraph.com/news/presidential-hopefuls-rfk-jr-and-desantis-rally-against-fednow\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/presidential-hopefuls-rfk-jr-and-desantis-rally-against-fednow/amp\">shared Kennedy’s antipathy</a> for FedNow <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us/amp\">and CBDC</a>, as well as <a href=\"https://cointelegraph.com/news/republican-candidate-end-president-biden-war-on-bitcoin-if-elected\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/republican-candidate-end-president-biden-war-on-bitcoin-if-elected/amp\">his support for Bitcoin</a>. Polls <a href=\"https://abcnews.go.com/538/538-new-state-level-republican-primary-polling-averages/story?id=103764425\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://abcnews-go-com.cdn.ampproject.org/c/s/abcnews.go.com/amp/538/538-new-state-level-republican-primary-polling-averages/story?id=103764425\">show</a> DeSantis running a distant second to Trump for the Republican primary nomination. </p><p>With Biden and Trump leading the polls for the two main U.S. parties, it seems possible the next president <a href=\"https://cointelegraph.com/news/cbdc-supporter-likely-white-house-next-term-crypto-divide-not-red-v-blue-grayscale\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cbdc-supporter-likely-white-house-next-term-crypto-divide-not-red-v-blue-grayscale/amp\">will be a crypto opponent</a> who supports CBDC, despite <a href=\"https://cointelegraph.com/news/dc-doesnt-realize-how-powerful-crypto-voting-is-brian-armstrong\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/dc-doesnt-realize-how-powerful-crypto-voting-is-brian-armstrong/amp\">suggestions within the industry</a> that crypto <a href=\"https://cointelegraph.com/news/democrats-crypto-war-alienate-youth-voters-winklevoss\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/democrats-crypto-war-alienate-youth-voters-winklevoss/amp\">will be a decisive issue</a> for voters in the 2024 presidential election.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T21:16:41.000Z",
    "title": "Brazilian securities regulator plans sandbox for tokenization in 2024",
    "url": "https://cointelegraph.com/news/brazilian-securities-regulator-sandbox-tokenization",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/2c0584de-bd6b-46ca-a5f1-18a60dbb856f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Daniel Maeda with Brazil's CVM said during Rio Innovation Week the regulator plans to explore a regulatory sandbox for use cases of tokenization potentially starting in 2024.</p>\n                    <p><p>The Comissão de Valores Mobiliários (CVM) of Brazil is planning to start a second regulatory sandbox program in 2024.</p><p>Speaking at Rio Innovation Week on Oct. 4, the superintendent of institutional investor supervision with the CVM, Daniel Maeda, <a href=\"https://br.cointelegraph.com/news/cvm-advances-in-tokenization-and-plans-new-sandbox-to-2024\" data-amp=\"https://br-cointelegraph-com.cdn.ampproject.org/c/s/br.cointelegraph.com/news/cvm-advances-in-tokenization-and-plans-new-sandbox-to-2024/amp\">said</a> the regulator will be exploring a regulatory sandbox for use cases of tokenization potentially starting in 2024. According to Maeda, the regulator’s efforts to launch the second sandbox followed positive experiences tokenizing roughly $36 million in assets.</p><p>“We do not define specific cases, because we want to let innovation reach the CVM, without prior limitations,” Maeda said to Cointelegraph Brazil. “But some areas for the application of tokenization certainly catch our attention, such as agribusiness and [Environmental, Social, and Governance].”</p><p>The superintendent added that the CVM planned to wait for changes to be implemented related to Brazil’s crypto market including those for the <a href=\"https://cointelegraph.com/news/brazilian-cbdc-drex-official-name-and-logo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/brazilian-cbdc-drex-official-name-and-logo/amp\">country’s central bank digital currency</a>, the Drex. According to Maeda, both the securities regulator and central bank should consider developments in the digital asset space as well as how other countries have handled regulation.</p><p>“I have a lot of respect for the [United States SEC}, and I don’t think it’s up to me to point out their stance as right or wrong,” said Maeda. “What I can say is that we, at CVM, saw many benefits in this market to leverage processes. Through tokenization, the investor gains in transparency and lower costs, in addition to increasing the democratization of investments, which are values ​​that the commission carries.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-friendly-brokerage-orama-acquired-btg-pactual-bank\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-friendly-brokerage-orama-acquired-btg-pactual-bank/amp\"><strong><em>Brazil BTG Pactual bank buys Bitcoin-friendly brokerage Orama for $99M</em></strong></a></p><p>Brazil’s central bank <a href=\"https://cointelegraph.com/news/crypto-surge-brazil-central-bank-to-tighten-regulation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-surge-brazil-central-bank-to-tighten-regulation/amp\">announced a tightening of regulations</a> in October amid a significant surge of crypto adoption in the country. Governor Campos Neto specifically called out connections between using crypto and tax evasion or illicit activities. </p><p>Brazilian President Luiz Inácio Lula da Silva <a href=\"https://cointelegraph.com/news/brazil-president-signs-law-central-bank-regulate-crypto-firms\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/brazil-president-signs-law-central-bank-regulate-crypto-firms/amp\">signed a framework</a> into law in June establishing the different roles the country’s central bank and CVM would have in regulating digital assets. In November, Brazil <a href=\"https://cointelegraph.com/news/brazil-rolls-out-blockchain-based-digital-id\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/brazil-rolls-out-blockchain-based-digital-id/amp\">plans to roll out a program</a> issuing identification documents through a private blockchain as part of efforts to protect personal data and prevent fraud. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/questions-thiago-cesar-transfero/\"><strong><em>6 Questions for Thiago Cesar of Transfero</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-09T21:00:36.000Z",
    "title": "Ethereum experiences rocky trading day after Ethereum Foundation selloff",
    "url": "https://cryptoslate.com/ethereum-experiences-rocky-trading-day-after-ethereum-foundation-selloff/",
    "description": "<p>The Ethereum Foundation exchanged 1700 ETH on Uniswap for $2.738 million worth of USD Coin (USDC) today, Oct. 9., at an average price of $1,611, according to on-chain data. In the trading day since, ETH saw its price tumble as low as $1,553 before seeing a slight recovery to $1,577, where it stood at press [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ethereum-experiences-rocky-trading-day-after-ethereum-foundation-selloff/\">Ethereum experiences rocky trading day after Ethereum Foundation selloff</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T21:02:26.000Z",
    "title": "NFT platform will launch for Chinese government-owned newspaper",
    "url": "https://crypto.news/nft-platform-will-launch-for-chinese-government-owned-newspaper/",
    "description": "China Daily, affiliated with the Publicity Department of the Chinese Communist Party, has announced plans to develop its own metaverse and NFT platform."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T21:00:32.000Z",
    "title": "Bitcoin And XRP Set To Shine: Shock $8 Trillion Predicted Amid US Dollar ‘Collapse’",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-and-xrp-set-to-shine-shock-8-trillion-predicted-amid-us-dollar-collapse/",
    "description": "Despite initial expectations of a robust rally, major cryptocurrencies Bitcoin (BTC), Ethereum (ETH), and XRP have encountered a slowdown in momentum following a promising start in 2023. However, a prominent tech company&#8217;s leaked disclosure can alter this trajectory. With the Federal Reserve (Fed) grappling with a staggering $33 trillion US &#8220;debt death spiral,” investment banking firm Jefferies analysts have warned that the Fed may be compelled to restart its money printing presses.  This move could trigger the collapse of the US dollar and ignite a significant price boom for Bitcoin, rivaling the value of gold. Expert Advocates For Bitcoin As An Inflationary Safeguard A recent Forbes report indicates that Bitcoin&#8217;s highly anticipated halving event, expected to cause price volatility, is imminent.  Christopher Wood, Jefferies&#8217; global head of equity strategy, emphasized in a note to clients seen by CNBC that G7 central banks, including the Federal Reserve, are unlikely to withdraw from unconventional monetary policies smoothly. Notably, Wood considers Bitcoin and gold as &#8220;critical hedges&#8221; against the resurgence of inflation. Related Reading: Bitcoin Trader Shares The “Only Chart” You Need To Profit From BTC In 2024 Since spring of 2022, the Federal Reserve embarked on reducing its ballooning balance sheet of nearly $9 trillion, which expanded significantly during the COVID-19 pandemic and subsequent economic downturn.  This process, known as quantitative tightening, involves draining liquidity from the financial system and shifting the burden of newly issued debt onto the private sector. US Dollar Caught In &#8216;Death Spiral&#8217;  In addition to balance sheet reductions, the Fed has implemented rapid interest rate hikes to rein in soaring inflation. However, this approach has raised concerns about a potential counterproductive &#8220;death spiral&#8221; for the US dollar, potentially bolstering the value of Bitcoin.  Wood suggests that the Fed may be forced to adopt a more accommodating stance in response to a US recession. This shift would occur due to a larger-than-usual lag in the Fed&#8217;s interest rate hikes aimed at curbing inflation following the significant expansion of the money supply in 2020 and 2021.  Wood further explains:  Such a failure to exit from unorthodox monetary policy in a benign manner is likely to culminate in the collapse of the US dollar paper standard to the benefit of both gold bullion owners and also owners of Bitcoin. Meanwhile, Bitcoin, along with Ethereum and XRP to a lesser extent, has witnessed a surge in institutional interest, driven by the world&#8217;s largest asset manager, BlackRock.  The CEO of BlackRock, Larry Fink, who had previously expressed skepticism towards Bitcoin, made a notable shift in June. Fink&#8217;s endorsement of Bitcoin sparked a rush among Wall Street investors toward cryptocurrencies.  With custodian arrangements in place for digital assets, Bitcoin has gained credibility as an investable option for institutional investors, presenting itself as an alternative store of value to gold.  Related Reading: Shiba Inu-Based BONE Gearing Up For Massive Rally, Here’s Why In conclusion, the Federal Reserve&#8217;s monetary policy challenges and the growing institutional interest in Bitcoin and other major cryptocurrencies have created a perfect storm, propelling their prices to new heights.  Per the report, investors increasingly turn to digital currencies as potential hedges against inflation and storehouses of value as the US dollar faces uncertainty. When writing, the leading cryptocurrency in the market is trading at $27,300, reflecting a decrease of over 2% in the past 24 hours. This decline follows an overall downtrend in the market since the beginning of the new trading week. Notwithstanding the recent drop, BTC is positioned above its critical 50-day and 200-day Moving Averages (MAs). This favorable positioning may support a rebound in the cryptocurrency&#8217;s value and prevent further decline, helping it maintain the crucial $27,000 milestone. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T20:46:55.000Z",
    "title": "Shiba Inu’s Meteoric Rise: 353% Surge in 2.6 Trillion SHIB Transactions Stuns Crypto World",
    "url": "https://www.crypto-news-flash.com/shiba-inus-meteoric-rise-353-surge-in-2-6-trillion-shib-transactions-stuns-crypto-world/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-meteoric-rise-353-surge-in-2-6-trillion-shib-transactions-stuns-crypto-world",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The Shiba Inu (SHIB) ecosystem experienced a sudden 353% surge in large transactions, with $18.62 million traded daily, raising the daily volume to $26.02 million. SHIB&#8217;s price remained in a narrow range, causing uncertainty, while a falling wedge pattern signaled potential bearish trends. In a surprising twist, the Shiba Inu (SHIB) ecosystem has experienced a [...]"
  }
]