[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T10:13:51.000Z",
    "title": "Google responds to accusations of ads tracking data of children",
    "url": "https://cointelegraph.com/news/google-ads-child-data-tracking-response",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e8bc61de-81a9-4e84-b130-1747403b368e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After an in-depth report surfaced over YouTube advertisers potentially harvesting data from children, Google responded by saying it has “strict policies” over children’s content.  </p>\n                    <p><p>Google, the parent company of YouTube, responded to a report that suggested YouTube advertisers are sourcing data from children viewing videos on the platform. </p><p>On Aug. 18, a day after the report surfaced, Google <a href=\"https://blog.google/products/ads-commerce/our-strict-privacy-standards-around-made-for-kids-content/\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> a blog reinstating its “strict privacy standards around made for kids content,” which is content marked on YouTube that is created to be viewed by children. </p><p>The BigTech giant said it has focused on creating kid-specific products like YouTube Kids and supervised accounts. </p><blockquote>“We’ve invested a great deal of time and resources to protect kids on our platforms, especially when it comes to the ads they see…” </blockquote><p>It also said it launched a restriction worldwide for personalized ads and age-sensitive ad categories for its users under 18.</p><p>It also said it launched a restriction worldwide for personalized ads and age-sensitive ad categories for its users under 18. Additionally, the post clarified that it does not allow third-party trackers on ads that appear on kids' content. </p><p>Nonetheless, Adalytics, a data analysis and transparency platform, on Aug. 17 published the 206-page <a href=\"https://adalytics.io/blog/are-youtube-ads-coppa-compliant\" target=\"_blank\" rel=\"noopener nofollow\">report</a> alleging that advertisers on YouTube could be “inadvertently harvesting data from millions of children.”</p><p>Some of the claims made by the report include the presence of cookies indicating a “breakdown” of privacy and YouTube creating an “undisclosed persistent, immutable unique identifier” that gets transmitted to servers even on made-for-kids videos with no clarity on why it's collecting it. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/universal-music-google-negotiate-ai-deep-fakes\"><strong><em>Universal Music and Google in talks over deal to combat AI deep fakes: Report</em></strong></a></p><p>An <a href=\"https://www.nytimes.com/2023/08/17/technology/youtube-google-children-privacy.html\" target=\"_blank\" rel=\"noopener nofollow\">article</a> from the New York Times also reported on the research from Adalytics, specifically highlighting an instance where an adult-targeted ad from a Canadian bank was shown to a viewer on a video label for kids. </p><p>Adalytics reported that since that viewer clicked on the ad, tracking software from Google, Meta, and Microsoft, along with companies, was tagged on the user’s browser. </p><p>Concerns around Google’s<a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\"> privacy and data collection standards</a> have been raised in recent months, as the company has been releasing more products with artificial intelligence (AI) incorporated. </p><p>On July 11, Google was hit with <a href=\"https://cointelegraph.com/news/google-hit-with-lawsuit-over-ai-privacy-policy\">a lawsuit over its new AI data-scraping</a> privacy policy updates, with the prosecutors saying its representing millions of users who have had their privacy and property rights violated due to the changes. </p><p>Less than a month later, a report was published that analyzed AI-powered extensions for Google’s internet browser Chrome, which said <a href=\"https://cointelegraph.com/news/ai-google-chrome-extensions-could-endanger-user-security-data\">two-thirds could endange</a>r user security. </p><p>Most recently, on Aug. 15, Google introduced <a href=\"https://cointelegraph.com/news/google-upgrades-search-engine-with-ai-powered-enhancements\">a series of enhancements</a> for its search engine that incorporate advanced generative AI features. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\"><strong><em>Should we ban ransomware payments? It’s an attractive but dangerous idea</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-21T10:17:20.000Z",
    "title": "XRP’s Remarkable Year-to-Date Performance Despite Everything the SEC Has Thrown at It",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrps-remarkable-year-to-date-performance-despite-everything-the-sec-has-thrown-at-it/",
    "description": "So far in 2023, XRP has emerged as a top performer and a symbol of resilience. This report delves into XRP’s impressive Year-to-Date (YTD) performance, juxtaposes it with other leading cryptoassets, and sheds light on the factors driving its bullish trend. As of 9:40 a.m. UTC on 21 August 2023, XRP, the fifth most valuable […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T10:25:00.000Z",
    "title": "\n                        US Federal Court Denies Appeal To Lift Tornado Cash Sanctions\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/us-federal-court-denies-appeal-to-lift-tornado-cash-sanctions",
    "description": "\n                        <p dir=\"ltr\">US District Judge Robert Pitman has dismissed an appeal filed by six Tornado Cash users who sought to lift sanctions placed on the controversial cryptocurrency mixer.&nbsp;</p>\n<p dir=\"ltr\">The United States Treasury&rsquo;s Office of Foreign Assets Control had added Tornado Cash to its SDN list in August 2022, alleging it had enabled billions in illicit funds.&nbsp;</p>\nCourt Upholds Treasury Department&rsquo;s Sanctions&nbsp;\n<p dir=\"ltr\">A federal court has upheld the Treasury Department&rsquo;s decision to impose sanctions on cryptocurrency mixer Tornado Cash, throwing out the legal challenge brought by several users of the mixing service. The judge sided with the government and the Treasury Department on all of its claims and also granted summary judgment in the case. This reinforced the fact that the Treasury&rsquo;s Office of Foreign Assets Control is entitled to sanction Tornado Cash under current sanction statutes. Furthermore, the court denied the summary judgment requested by the plaintiffs. The court filing stated,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;The Court finds that Tornado Cash is an association within the ordinary meaning of the term and is, therefore, an entity that may be designated per OFAC regulations.&rdquo;</p>\n\nThe Plaintiff&rsquo;s Argument&nbsp;\n<p dir=\"ltr\">The plaintiffs in the case, six users of Tornado Cash, had stated that the government&rsquo;s action to sanction the cryptocurrency mixer was unlawful because it violated the first amendment. The plaintiffs argued that because of the decision, they were being denied the ability to engage in socially valuable speech. This is because they would have used Tornado Cash to donate to several social and political causes.&nbsp;</p>\n<p dir=\"ltr\">However, Judge Pitman disagreed with this argument, stating that the plaintiffs had failed to show that the action taken by the government had, in any way, implicated the first amendment. The plaintiffs also pointed out that there is significant confusion regarding what Tornado Cash really is, stating,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;The parties disagree on how to characterize Tornado Cash. Plaintiffs contend that Tornado Cash is a decentralized, open-source software project comprised of a subset of smart contracts, or &ldquo;pools,&rdquo; on the Ethereum blockchain.&rdquo;</p>\n\n<p dir=\"ltr\">The plaintiffs also argued against classifying Tornado Cash as an association, claiming that the designation would exclude individual founders, developers, DAO members, and users involved in supporting the application. The plaintiffs asserted that Tornado Cash users rely on smart contracts that are immutable, autonomous, and self-executing. If Tornado Cash was recognized as an autonomous software instead of an association, it would be exempted from the SDN requirements.&nbsp;</p>\n<p dir=\"ltr\">The OFAC has classified Tornado Cash as an entity that operates a cryptocurrency mixing service. It has also stated that the service was being used to launder virtual currencies, including those by the dreaded hacker group Lazarus.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;OFAC determined that the DPRK&rsquo;s malicious cyber-enabled activities threaten the United States and the broader international community and pose a significant threat to the international financial system. OFAC also observed that the DPRK has increasingly relied on cybercrime to generate revenue for its weapons of mass destruction and ballistic missile programs.&rdquo;</p>\n\nCourt Disagrees With Plaintiffs&nbsp;\n<p dir=\"ltr\">Judge Pitman concluded that Tornado Cash operates as an association and hence, can be sanctioned by the authorities as an entity under the International Emergency Economic Powers Act. The judge also determined that smart contracts deployed by Tornado Cash were subject to sanctions under regulatory definitions outlined by the OFAC.&nbsp;</p>\n<p dir=\"ltr\">Interestingly, the judge also noted that the plaintiffs could have made a case stating that their inability to access Ethereum trapped in Tornado Cash smart contract pools violated the fifth amendment. The fifth amendment guarantees protection against the taking of any property by the government without fair compensation. However, the judge noted that the plaintiffs did not pursue their fifth amendment claim.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Plaintiffs did not pursue their Fifth Amendment claim, even after the government raised the issue of waiver in its cross-motion. Because Plaintiffs failed to pursue their Fifth Amendment claim, they have waived it.&rdquo;</p>\n\nCoinbase Backing Lawsuit&nbsp;\n<p dir=\"ltr\">The chief legal officer at Coinbase, Paul Grewal, stated that the exchange continues to believe in the plaintiffs&rsquo; challenge against the OFAC action and that the issues require Fifth Circuit appellate review. Coinbase is also backing the lawsuit.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;We continue to believe Plaintiffs&rsquo; challenge to OFAC&rsquo;s Tornado Cash action is right. We&rsquo;ve always known that Fifth Circuit review is required to resolve these issues, and we continue to support them on appeal.&rdquo;</p>\n\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T10:33:40.000Z",
    "title": "U.S. Treasury’s sanctions on Tornado Cash upheld by Federal Court",
    "url": "https://www.cryptopolitan.com/u-s-treasurys-sanctions-tornado-cash-upheld-federal-court/",
    "description": "A federal court has affirmed the U.S. Treasury Department&#8217;s authority to impose sanctions on Tornado Cash, a well-known cryptocurrency mixing service, rejecting a legal challenge brought by six users of the platform. The decision, presided over by U.S. District Judge Robert Pitman, sided with the government on all claims, granting summary judgment in the case ... <a title=\"U.S. Treasury&#8217;s sanctions on Tornado Cash upheld by Federal Court\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-treasurys-sanctions-tornado-cash-upheld-federal-court/\" aria-label=\"More on U.S. Treasury&#8217;s sanctions on Tornado Cash upheld by Federal Court\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T10:31:56.000Z",
    "title": "Mouser Launches AI Content Hub to Empower Engineers",
    "url": "https://www.cryptopolitan.com/mouser-launches-ai-content-hub/",
    "description": "Mouser Electronics, a leading electronic components, and technology solutions distributor, has unveiled a comprehensive AI Content Hub to empower engineers and designers with valuable insights into Artificial Intelligence (AI). This hub serves as a go-to resource center, equipping professionals with the knowledge and skills necessary to navigate the intricacies of AI and its diverse applications. ... <a title=\"Mouser Launches AI Content Hub to Empower Engineers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mouser-launches-ai-content-hub/\" aria-label=\"More on Mouser Launches AI Content Hub to Empower Engineers\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T10:25:19.000Z",
    "title": "Boost Your Yield: How to Stake $LUNA Alliance Assets on Station – Terra Luna and Classic Update",
    "url": "https://www.crypto-news-flash.com/boost-your-yield-how-to-stake-luna-alliance-assets-on-station-terra-luna-and-classic-update/?utm_source=rss&utm_medium=rss&utm_campaign=boost-your-yield-how-to-stake-luna-alliance-assets-on-station-terra-luna-and-classic-update",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The long-awaited LUNC/USTC swaps may soon be available on TerraSwap, which would be great for the Terra Classic (LUNC) community.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Crypto enthusiasts can now stake $LUNA Alliance assets on Station, boosting yields through an Alliance and Station integration.  Happy Catty Crypto&#8217;s proposal seeks Terra Luna Classic&#8217;s revival, emphasizing transparency, smart contract-based payments, and improved security measures. Crypto enthusiasts looking to maximize their yields and actively participate in the evolving blockchain ecosystem have a new opportunity [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T10:18:47.000Z",
    "title": "Bitcoin’s Dramatic Drop: Will September’s First Week Spark a Rally to $28,000?",
    "url": "https://www.crypto-news-flash.com/bitcoins-dramatic-drop-will-septembers-first-week-spark-a-rally-to-28000/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-dramatic-drop-will-septembers-first-week-spark-a-rally-to-28000",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-6288863_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-6288863_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-6288863_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-6288863_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-6288863_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-6288863_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Some analysts are hopeful that US SEC&#8217;s update on spot Bitcoin ETFs in early September could help BTC price to recover. Bitcoin shows major weakness on the technical chart after slipping under the 200-day moving average. Bitcoin (BTC) entered into a sharp correction last week following the news that SpaceX has liquidated its 4373 million [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-21T10:12:37.000Z",
    "title": "Crypto Altcoin Tier List Highest 2025 returns",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-altcoin-tier-list-highest-2025-returns/",
    "description": "<p>50X, 40X, 30X. In this article, I am covering 6 coins. As per my recent research, these coins are highly capable of doing 50,40, and 30X from their present price by 2025.  In fact, Coin number 3 on my list which shows a potential of 40X altcoin is being heavily bought by crypto whales. Don&#8217;t [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-altcoin-tier-list-highest-2025-returns/\">Crypto Altcoin Tier List Highest 2025 returns</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T10:38:00.000Z",
    "title": "Less Than 221 Users Hold About 30% of XRP Circulating Supply",
    "url": "https://coinedition.com/less-than-221-users-hold-about-30-of-xrp-circulating-supply/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Those_other_ownership_figures_show_221_accounts_which_may_represent-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bill Morgan, lawyer and digital asset enthusiast, thinks more users need to buy XRP. According to Morgan, figures show only 221 accounts, which may represent less than 221 separate users, now hold about 30% of the entire XRP circulating supply. He stated this in response to an XRP price behavior analysis presented by an XRP [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/less-than-221-users-hold-about-30-of-xrp-circulating-supply/\">Less Than 221 Users Hold About 30% of XRP Circulating Supply</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T10:20:12.000Z",
    "title": "XRP Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a Twitter post, David Schwartz, the Chief Technology Officer of Ripple Labs, highlighted a recent development concerning an appeal by the United States Securities and Exchange Commission (SEC). The SEC&#8217;s decision to seek an appeal at this particular juncture is grounded in their interpretation that the ongoing legal case has not reached its conclusion. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/\">XRP Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T10:14:05.000Z",
    "title": "Hedera Boasts Speed and Low Fees – Is It Enough to Topple Solana?",
    "url": "https://coinedition.com/hedera-boasts-speed-and-low-fees-is-it-enough-to-topple-solana/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Millions-Coming-to-Hedera-Will-HBAR-Beat-Solana-SOL-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto YouTube channel Altcoin Buzz recently dropped a video talking about the capabilities of Hedera Hashgraph and the possibility of it beating Solana. Talking about Hedera, Altcoin Buzz highlighted that it offers some compelling capabilities that set it apart. Created by academics and researchers, it utilizes the hashgraph distributed consensus algorithm enabling fast, fair ordering [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hedera-boasts-speed-and-low-fees-is-it-enough-to-topple-solana/\">Hedera Boasts Speed and Low Fees – Is It Enough to Topple Solana?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]