[
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T03:15:58.000Z",
    "title": "Optimism OP token slips 10% in week ahead of $30M token unlock",
    "url": "https://cointelegraph.com/news/optimism-op-slides-before-scheduled-token-unlock",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e00af4a9-bef7-40f8-b10c-68fdbde7ed06.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Optimism slid as much as 10% in the week leading up to a scheduled token unlock that will see 24 million OP tokens released onto the market. </p>\n                    <p><p>The price of Optimism’s native OP token is leading losses among the top 50 cryptocurrencies, falling as far as 10% on the week ahead of a $30 million token unlock.</p><p>According to <a href=\"https://token.unlocks.app/optimism\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from tokenomics platform Token Unlocks, 24.16 million OP tokens, which account for roughly 3% of the circulating supply — are scheduled to be unlocked on Sept. 30. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b98f1ddc-b35a-49bb-b0a7-972e41d3777a.png\"  /><figcaption style=\"text-align: center;\"><em>The next OP token unlock is scheduled for Sept. 30. Source: Token Unlocks</em></figcaption></figure><p>At current prices, the unlock will see a little more than $30 million worth of OP tokens hit the market, with $15.49 million going to core contributors and $14.26 million set aside for investors. </p><p>Token unlocking events form a core part of many main cryptocurrency projects, with many teams choosing to gradually release tokens to the market instead of unleashing them all at once. Typically however, unlocking events are viewed by investors as likely to put pressure on prices, as a new supply of tokens becomes available for sale.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a0c062ce-c5b9-4500-90b8-68f86cc718c9.png\"  /><figcaption style=\"text-align: center;\"><em>The price of OP token has rebounded slightly in the past five hours. Source: CoinGecko</em></figcaption></figure><p>The price of the OP token is currently trading flat on the day at $1.26, after experiencing a brief 3% rally in the past 5 hours, according to price <a href=\"https://www.coingecko.com/en/coins/optimism\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from CoinGecko. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/optimism-transactions-surpass-arbitrum-but-what-s-behind-the-uptick-in-users\"><strong><em>Optimism transactions surpass Arbitrum, but what’s behind the uptick in users?</em></strong></a></p><p>Last week on Sept. 21, Optimism revealed that it would be selling $160 million worth of the OP token to private sellers as part of a planned sale. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Starting today, there will be several transactions totaling approximately 116M OP tokens. We’re sharing as a heads up to our community that these are planned transactions.</p>&mdash; Optimism (✨_✨) (@optimismFND) <a href=\"https://twitter.com/optimismFND/status/1704557196506173468?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Sept. 19, Optimism <a href=\"https://twitter.com/optimismFND/status/1703837786703335672?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1703837786703335672%7Ctwgr%5Effad86cd7521238bfd715c956d4e00a05ba54ec5%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fcointelegraph.com%2Fnews%2Foptimism-private-token-sale-op-token-price\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its third airdrop, where 19.4 million OP tokens were allocated to more than 31,000 addresses that took part in delegation activities relating to the network’s decentralized autonomous organization (DAO), Optimism Collective.</p><p><strong><em>Asia Express: </em></strong><a href=\"https://cointelegraph.com/magazine/jpex-staff-flee-token2049-scandal-mt-gox-decade-delay-dcs-singapore-asia-express/\"><strong><em>JPEX staff flee event as scandal hits, Mt. Gox woes, Diners Club crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T03:27:21.000Z",
    "title": "Ethereum Price Hints At Potential Correction But Faces Uphill Task",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-uphill-task-1600/",
    "description": "Ethereum price is attempting a recovery wave from $1,565 against the US Dollar. ETH could struggle to recover above $1,600 and might resume its decline. Ethereum is slowly moving higher toward the $1,600 resistance zone. The price is trading below $1,600 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $1,595 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it fails to clear the $1,600 resistance zone. Ethereum Price Struggles Below $1,600 Ethereum’s price started a fresh decline below the $1,620 and $1,600 levels. ETH even declined to a new weekly low below the $1,580 level, unlike Bitcoin. It traded as low as $1,565 and recently started a short-term upside correction. There was a move above the $1,580 level. The price climbed above the 50% Fib retracement level of the recent drop from the $1,600 swing high to the $1,565 low. However, the bears are still active near the $1,600 resistance. The price is struggling to clear the 76.4% Fib retracement level of the recent drop from the $1,600 swing high to the $1,565 low. Ether is now trading below $1,600 and the 100-hourly Simple Moving Average. There is also a major bearish trend line forming with resistance near $1,595 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,595 level. Source: ETHUSD on TradingView.com The next major resistance is $1,600. A push above $1,600 might send Ethereum toward $1,620. If the bulls succeed in clearing the $1,620 hurdle, the price could start a decent increase toward the $1,650 resistance. Any more gains might open the doors for a move toward $1,700. More Losses in ETH? If Ethereum fails to clear the $1,600 resistance, it could start another decline. Initial support on the downside is near the $1,580 level. The next key support is $1,565, below which the price could test the $1,540 support. A downside break below $1,540 might push the price further into a bearish zone. In the stated case, there could be a drop toward the $1,500 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,565 Major Resistance Level – $1,600"
  }
]