[
  {
    "source": "Decrypt",
    "date": "2023-08-01T08:52:08.000Z",
    "title": "Industry Still Isn’t ‘Close’ to Solving the Blockchain Trilemma: Offchain Labs Chief Strategy Officer",
    "url": "https://decrypt.co/150816/industry-still-isnt-close-solving-the-blockchain-trilemma-offchain-labs-chief-strategy-officer",
    "description": "Solving the famed trilemma “would be a huge breakthrough,” but it would also need to inspire developers, said the Offchain Labs’ exec."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-01T08:49:29.000Z",
    "title": "XRP: A Security or Not? Crypto Lawyer Mike Selig Clears the Air",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-a-security-or-not-crypto-lawyer-mike-selig-clears-the-air/",
    "description": "The recent ruling in the SEC vs. Ripple case has stirred up a whirlwind of interpretations, misinterpretations, and downright confusion. Enter Michael Selig, Counsel at NYC-based law firm Willkie Farr &amp; Gallagher LLP, who’s taken to the Twitterverse to set the record straight. Contrary to what some commentators have been suggesting, Selig explains that Judge […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T08:45:00.000Z",
    "title": "Has The Curve Finance Exploit Put Aave And DeFi At Risk?",
    "url": "https://cryptodaily.co.uk/2023/08/has-the-curve-finance-exploit-put-aave-and-defi-at-risk",
    "description": "<p>Curve Finance suffered a significant exploit over the weekend, with attackers managing to siphon off around $70 million worth of assets from users.&nbsp;</p>\n<p>Curve founder Michael Egorov has a loan of around $70 million in USDT on Aave v2, using CRV as collateral.&nbsp;</p>\nCurve Chaos Could Have Major Implications&nbsp;\n<p>The exploit at Curve Finance resulted in the price of the protocol&rsquo;s CRV token experiencing a sharp decline. This decline has put a $168 million lending position held by Curve founder Michael Egorov at risk of liquidation. If the position gets liquidated, it could have disastrous implications across the decentralized finance (DeFi) ecosystem. The Curve founder has around $168 million worth of CRV, which he has used to secure loans from several DeFi protocols, according to data from the blockchain analytics site DeBank. This amount equals nearly 34% of CRV&rsquo;s total market capitalization.&nbsp;</p>\n<p>The exploit has led to a decline of over 20% in the CRV price, putting Egorov&rsquo;s position in danger of liquidation.&nbsp;</p>\nA Major Blow&nbsp;\n<p>A forced liquidation would be a devastating blow to Curve after its weekend exploit. As a result of the exploit, the total value of assets locked on the DeFi protocol dropped from $3.7 billion to $2.1 billion, with investors pulling their funds as a precaution. Thanks to DeFi&rsquo;s interconnected nature, the liquidation of Egorov&rsquo;s position could put significant pressure on CRV&rsquo;s price and other decentralized lending protocols. The CRV token is extremely popular on Uniswap and Sushiswap and is used as collateral on platforms such as Aave.&nbsp;</p>\nAave&rsquo;s Exposure&nbsp;\n<p>Michael Egorov has a $70 million loan in USDT on Aave v2, for which he has used CRV as collateral. Based on risk parameters set by Aave, if the CRV token&rsquo;s price drops below $65%, it would be at risk of liquidation. When liquidations occur, the collateral the borrower deposits is sold in exchange for the borrowed asset. In the case of Aave, the CRV would be sold for Aave, leading to considerable bad debt.&nbsp;</p>\n<p>The concerns around bad debt were already flagged by Gauntlet, who recommended freezing CRV and setting its loan-to-value to zero on Aave v2.&nbsp;</p>\n\n<p>&ldquo;The amount of CRV concentrated on Aave, relative to the circulating supply of CRV, is already high. Given the limitations of V2 mechanisms, including the possibility of circumventing an LTV of 0, the only way to truly prevent more risk of this position is to prevent borrowing of all assets on V2.&rdquo;</p>\n\n<p>However, this proposal failed to pass.&nbsp;</p>\n<p>Aave&rsquo;s GHO stablecoin also lost its peg for a few hours on the 31st of July. The stablecoin subsequently regained its peg, with analysts working to determine why the de-pegging occurred. According to most, the de-pegging was a result of the reentrancy attack on Curve Finance. The GHO stablecoin had dropped to $0.96 on the 31st, losing its $1 peg for a few hours. However, it regained its peg and is currently trading at $0.98.&nbsp;</p>\nOther Protocols At Risk&nbsp;\n<p>Aave is not the only protocol that the Curve Finance fiasco could impact. Egorov has also borrowed $17 million worth of the FRAX stablecoin, putting $32 million worth of CRV as collateral. Since the exploit, Egorov has made several transactions to repay part of the amount he borrowed on Fraxlend. According to DeBank data, Egorov also has an $18 million loan on DeFi protocol Abracadabra.&nbsp;</p>\n<p>Egorov has moved to shore up his capital by selling LDO, the governance token for liquid staking protocol Lido, in exchange for the USDC stablecoin. These transactions have been done in several batches valued at between $10,000 and $50,000, according to data from EtherScan. The developments have raised several questions for decentralized lending protocols, and whether they should implement measures to prevent large positions, such as the ones taken by Egorov, that could potentially introduce systemic risk.&nbsp;</p>\n<p>Egorov came under fierce criticism in 2020 after he took control of over two-thirds of a Curve voting token, veCRV. He later apologized and called the move an overreaction to what he thought was a takeover attempt by Yearn.Finance.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T09:05:50.000Z",
    "title": "Sam Bankman-Fried’s links to BALD liquidity rug pull exposed",
    "url": "https://www.cryptopolitan.com/sbf-links-to-bald-liquidity-rug-pull-exposed/",
    "description": "On Monday, an unidentified developer drained all the liquidity from the BALD meme coin on the Ethereum layer-2 network Base. Certain observers in the blockchain community suggest that the wallets utilized by the responsible party seem to be linked to Sam Bankman-Fried(SBF), the previous CEO of FTX, who is currently under house arrest. SBF links ... <a title=\"Sam Bankman-Fried&#8217;s links to BALD liquidity rug pull exposed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-links-to-bald-liquidity-rug-pull-exposed/\" aria-label=\"More on Sam Bankman-Fried&#8217;s links to BALD liquidity rug pull exposed\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T09:02:14.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T09:00:37.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1193, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.42% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T08:50:24.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T08:40:57.000Z",
    "title": "New meme coin raises over $6.5 million and could dethrone Shiba Inu",
    "url": "https://crypto.news/new-meme-coin-raises-over-6-5-million-and-could-dethrone-shiba-inu/",
    "description": "DigiToads, a new meme coin project, has raised over $6.5 million in its ongoing presale, drawing the attention of investors and enthusiasts"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T09:00:59.000Z",
    "title": "Litecoin (LTC) Halving: Market Sell-off Looms – Don’t Miss the Opportunity to Join DigiToads (TOADS) Presale",
    "url": "https://www.crypto-news-flash.com/litecoin-ltc-halving-market-sell-off-looms-dont-miss-the-opportunity-to-join-digitoads-toads-presale/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-ltc-halving-market-sell-off-looms-dont-miss-the-opportunity-to-join-digitoads-toads-presale",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103940.188.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103940.188.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103940.188-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103940.188-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Litecoin halving is just days away, and the market is bracing for volatility. The halving is a scheduled event that reduces the reward for mining new blocks by half. This will make it more difficult to mine LTC, and could lead to a sell-off as miners sell their coins to cover costs. Some analysts [...]"
  }
]