[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-10T01:58:00.000Z",
    "title": "XRP Could Hit $1.1 Soon Based on Bullish Pattern, Analyst Says",
    "url": "https://www.cryptoglobe.com/latest/2024/01/xrp-could-hit-1-1-soon-based-on-bullish-pattern-analyst-says/",
    "description": "The price of the native token of the XRP Ledger, XRP, could surge to a high of $1.1 in the near future, based on its governing price pattern that has been around for more than a year and a half since June 2022. According to popular cryptocurrency analyst Ali Martinez, since June 2022, XRP has […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-10T02:00:55.000Z",
    "title": "SEC Chair Gary Gensler Issues Crypto Investing Advice — Lawyers See as Prelude to Spot Bitcoin ETF Approval",
    "url": "https://news.bitcoin.com/sec-chair-gary-gensler-issues-crypto-investing-advice-lawyers-see-as-prelude-to-spot-bitcoin-etf-approval/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Chair Gary Gensler Issues Crypto Investing Advice — Lawyers See as Prelude to Spot Bitcoin ETF Approval\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gary-gensler-crypto-advice.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler has advised investors to be cautious when considering crypto investments. His advice followed a series of warnings he issued the day before regarding the risks of crypto investing. The SEC is expected to green-light multiple spot bitcoin exchange-traded funds (ETFs) on Wednesday. Gary Gensler&#x2019;s Advice to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-10T02:00:51.000Z",
    "title": "Epic Rally Alert: Solana Hourly Chart Reveals Bull Flag Formation, SOL Targets $163",
    "url": "https://www.newsbtc.com/news/solana/epic-rally-alert-solana-hourly-chart-reveals-bull-flag-formation-sol-targets-163/",
    "description": "Solana (SOL), the fifth largest cryptocurrency by market capitalization, has experienced a significant surge after undergoing a correction from its 20-month high of $125, reached on December 25. Following a dip to the $85 level on Monday, January 8, SOL reclaimed the $100 level again, demonstrating a 6.4% surge in the past 24 hours.  Moreover, technical analysis indicates a potential bullish continuation pattern known as a bull flag in Solana&#8217;s 1-hour chart, which suggests the possibility of further price gains beyond the previous high.  Solana Optimism For Price Breakout Technical analyst Ali Martinez has identified a bullish pattern known as a bull flag formation on Solana&#8217;s hourly chart. A bull flag is characterized by a consolidation period following a strong upward move.  In this case, the dip to the $85 level could be considered the consolidation phase. The formation suggests that SOL may experience another significant upward move shortly. As seen in the chart above, to confirm the validity of the bull flag pattern, SOL needs to achieve a decisive close above the $110 resistance level. Such a breakthrough could catalyze upward momentum and propel the price to new highs. Related Reading: Global Mega Bank Standard Chartered Releases Bullish Forecast For Spot Bitcoin ETFs If the bull flag pattern holds, Ali Martinez anticipates that SOL could aim for an ambitious target of $163. However, Solana faces multiple resistance levels that it must overcome to reach the potential target indicated in Ali Martinez&#8217;s hourly chart analysis.  The $110 resistance, the $120 mark, and the previous 20-month high of $125 present significant hurdles for Solana&#8217;s price action. These levels have the potential to impede further upward movement, as they have previously acted as resistance during the bear market of 2022.  Additionally, the $132 and $137 levels are anticipated to provide additional resistance, as they were the price points from which Solana&#8217;s price decreased in April 2022.  Lastly, the $151 and $154 levels will serve as the final thresholds for Solana&#8217;s bears to hold if they aim to halt any potential price increase before reaching the $163 target. Solana’s Ecosystem Consistent Growth  Despite the volatility in SOL&#8217;s price over the past month, Token Terminal data reveals consistent growth in Solana&#8217;s blockchain ecosystem.  According to the data, Solana&#8217;s circulating market cap has surged impressively to $43.54 billion, representing a substantial 20.08% increase in value over the last 30 days. Moreover, the fully diluted market cap has surged to $57.13 billion, reflecting an 18.82% growth, which illustrates a strong investor interest in Solana and its potential for future growth. Solana&#8217;s revenue has also experienced substantial growth over the past 30 days, with a staggering increase of 217.18% to reach $5.68 million. On an annual basis, the revenue has reached an impressive $69.12 million, exhibiting a remarkable surge of 142.15%. Related Reading: These Altcoins Are Showing Most Bullish &#38; Bearish Divergences: Santiment Ultimately, Solana&#8217;s fees have significantly increased over the past 30 days, with an increase of 217.18% to $11.36 million. On an annualized basis, the fees amount to $138.24 million, marking a substantial growth of 142.15%, reflecting the network&#8217;s growing usage and transactional activity. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-01-10T02:02:32.000Z",
    "title": "Điều khoản & Thể thức cuộc thi “Trade Xuân Thưởng Tết” cùng Bitfinex /The Lunar New Year Competition Terms and Conditions",
    "url": "https://blog.bitfinex.com/announcements/dieu-khoan-the-thuc-cuoc-thi-trade-xuan-thuong-tet-cung-bitfinex-the-lunar-new-year-competition-terms-and-conditions/",
    "description": "<p>Cuộc thi Trade Xuân Thưởng Tết chỉ dành cho người dùng Bitfinex tại Việt Nam, có quốc gia đăng ký tài khoản là Việt Nam. Để tham gia, người chơi phải đăng ký qua biểu mẫu sau. Cuộc thi Trade Xuân Thưởng Tết bắt đầu...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/announcements/dieu-khoan-the-thuc-cuoc-thi-trade-xuan-thuong-tet-cung-bitfinex-the-lunar-new-year-competition-terms-and-conditions/\">Điều khoản &#038; Thể thức cuộc thi “Trade Xuân Thưởng Tết” cùng Bitfinex /The Lunar New Year Competition Terms and Conditions</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]