[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T09:57:22.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T09:56:21.000Z",
    "title": "OpenSea Makes Shift To Optional Royalty Model – A Deal-Breaker For Yuga Labs?",
    "url": "https://www.newsbtc.com/nft/opensea-shift-to-optional-royalty-deal-breaker-for-yuga-labs/",
    "description": "Yuga Labs &#8211; creators of the popular Bored Ape Yacht Club (BAYC) NFT collection &#8211; has unveiled its plans to cut ties with NFT marketplace OpenSea. This comes as a response to the platform’s proposed shift to an optional royalty system. On Thursday, August 17, OpenSea announced that it is changing its creator fees framework, making royalties optional for new collections after August 31, 2023. The NFT marketplace also disclosed that it would disable the Operator Filter, a feature that enforces creator royalties. According to the announcement, NFT collections that utilized the Operator Filter up until August 31 will have their creator royalties enforced till February 29, 2024, when the fees will become optional.  In the blog post, OpenSea explained the rationale behind its decision, saying the Operator Filter was designed to empower creators with greater control. However, the marketplace claims that it has not received the much-needed acceptance in the web3 ecosystem. Related Reading: Shibarium Launch Saga: Block Production Resumes Despite Stuck ETH Yuga Labs Responds To OpenSea’s Decision  On Friday, August 18, Yuga Labs published an open letter on X (formerly Twitter), subtly criticizing OpenSea’s decision to make creator fees optional on all secondary sales for all collections by February 2024. The BAYC creator also disclosed its plans to wind down support for OpenSea’s SeaPort, a marketplace protocol that enables the buying and selling of NFTs. Daniel Alegre, CEO of Yuga Lab, said in the response: Yuga Labs will begin the process of sunsetting support for OpenSea’s SeaPort for all upgradable contracts and any new collections, with the aim of this being complete in February 2024 in tandem with OpenSea’s approach. Alegre noted that while the purpose of NFTs has been to revolutionize true ownership of digital assets, it has also been about empowering artists and creators. “Yuga believes in protecting creator royalties so creators are properly compensated for their work,” he added. Yuga Labs’ stance will likely be a significant blow to OpenSea, but perhaps not one the marketplace wouldn&#8217;t have foreseen. In January, the BAYC creators blacklisted about four marketplaces &#8211; with an optional royalty model &#8211; from its Sewer Pass collection. OpenSea Halts Support For The BNB Smart Chain OpenSea also recently announced its decision to disable the minting and listing of NFTs on the BNB smart chain. According to the post on X, this move was informed by the marketplace&#8217;s “need to align resources with the most promising efforts”. Related Reading: Ethereum Price Trend Overwhelmingly Negative As Bears Aim $1,500 The NFT platform wrote in the announcement: Starting today (August 18, 2023), you will no longer be able to create new listings for or make new offers on BSC NFTs. However, you will still be able to view, discover, and transfer BSC NFTs on our site. This latest development brings OpenSea’s total supported chains down to 10, including Arbitrum, Avalanche, Ethereum, Optimism, Polygon, Solana, and the recently-added Base and Zora. Crypto total market cap at $1.03 trillion &#124; Source: daily TOTAL chart on TradingView Featured image from NFT Culture, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-19T10:00:04.000Z",
    "title": "Millionaires Abandon Polkadot (DOT) and Ripple (XRP): Uncovering the New Altcoin That’s Stealing the Spotlight",
    "url": "https://www.crypto-news-flash.com/millionaires-abandon-polkadot-dot-and-ripple-xrp-uncovering-the-new-altcoin-thats-stealing-the-spotlight/?utm_source=rss&utm_medium=rss&utm_campaign=millionaires-abandon-polkadot-dot-and-ripple-xrp-uncovering-the-new-altcoin-thats-stealing-the-spotlight",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-75.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-75.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-75-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-75-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The spotlight has shifted from popular altcoins like Polkadot (DOT) and Ripple (XRP) as millionaires move their investments to the Pomerdoge (POMD) presale. But why is this mass exodus happening, and why is Pomerdoge attracting so many millionaires? Let&#8217;s answer each of these questions to uncover the hype. Click Here To Find Out More About [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-19T09:45:46.000Z",
    "title": "XRP’s Intrinsic Value Is Not Being Reflected in Its Current Price",
    "url": "https://coinedition.com/xrps-intrinsic-value-is-not-being-reflected-in-its-current-price/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Intrinsic Value\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Intrinsic-Value-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The international best seller Linda P. Jones stated that investors and traders should not focus all their attention on price when investing in cryptocurrencies but should rather pick projects with intrinsic value. More specifically, the author mentioned that Ripple (XRP) is one such cryptocurrency with a high underlying value. This was in response to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrps-intrinsic-value-is-not-being-reflected-in-its-current-price/\">XRP’s Intrinsic Value Is Not Being Reflected in Its Current Price</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]