[
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T12:53:21.000Z",
    "title": "HECO Chain bridge compromised, over $86.6M sent to suspicious addresses",
    "url": "http://cointelegraph.com/news/heco-chain-bridge-hack-86-million-lost",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ee21001a-3998-4c30-88f8-b69b5d65630e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain security firm PeckShield reported that assets like stablecoins, ETH, SHIB, LINK and more were transferred from the bridge. Withdrawals and deposits have been suspended, and Justin Sun has said HTX will fully compensate users for any losses.</p>\n                    <p><p>Data shared by blockchain security platform PeckShield shows that more than $86.6 million in digital assets were transferred from the HECO Chain bridge to suspicious addresses. The security firm suggests that the bridge is compromised and an exploit is ongoing. </p><p>In response to the incident, Tron founder Justin Sun announced that HTX will fully compensate users for any losses incurred in the hack. The company has also temporarily suspended deposits and withdrawals as they investigate the incident. The executive said services will resume after the investigation is completed.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">HTX and Heco Cross-Chain Bridge Undergo Hacker Attack. HTX Will Fully Compensate for HTX&#39;s hot wallet Losses. Deposits and Withdrawals Temporarily Suspended. All Funds in HTX Are Secure, and the Community Can Rest Assured. We are investigating the specific reasons for the hacker…</p>&mdash; H.E. Justin Sun 孙宇晨 (@justinsuntron) <a href=\"https://twitter.com/justinsuntron/status/1727304656622326180?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Initially, PeckShield published an alert pointing out a transaction where 10,145 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth around $19 million, was transferred from the bridge. Several other transactions followed, with digital assets like USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>), Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>), Shiba INU (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) and more, were transferred to other addresses.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/PeckShieldAlert?src=hash&amp;ref_src=twsrc%5Etfw\">#PeckShieldAlert</a> Suspicious huge withdrawal of 10,145 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> (~$19m) from <a href=\"https://twitter.com/hashtag/Heco_Bridge?src=hash&amp;ref_src=twsrc%5Etfw\">#Heco_Bridge</a>.   <a href=\"https://twitter.com/justinsuntron?ref_src=twsrc%5Etfw\">@justinsuntron</a><br><br>Note the tx is initiated by the operator. Looks like a compromised operator?<a href=\"https://t.co/thBVveuL6X\">https://t.co/thBVveuL6X</a> <a href=\"https://t.co/th4Ui0FO3A\">pic.twitter.com/th4Ui0FO3A</a></p>&mdash; PeckShieldAlert (@PeckShieldAlert) <a href=\"https://twitter.com/PeckShieldAlert/status/1727286692489679360?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>HTX Eco Chain (HECO) was officially launched on Dec. 21, 2020, to provide a cross-chain experience with lower gas fees. The project was a merger between Tron and BitTorrent’s bridge ecosystem, as Sun combined both ecosystems into HECO in 2022. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/poloniex-hacker-identity-confirmed-10-million-bounty\"><strong><em>Poloniex says hacker’s identity is confirmed, offers last bounty at $10M</em></strong></a></p><p>The recent HECO Chain hack is the second exploit happening to a project related to Sun. On Nov. 10, an exchange acquired by Sun in 2018, Poloniex, <a href=\"https://cointelegraph.com/news/poloniex-exchange-hack-60-million-drained-5-percent-bounty\">suffered a $100 million exploit</a>. Security analysts believe that the incident may have resulted from private keys being compromised. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin: The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T12:51:00.000Z",
    "title": "Setting new standards for crypto exchanges in the post-FTX era: Report",
    "url": "http://cointelegraph.com/news/setting-new-standards-crypto-exchanges-after-ftx-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/827964fb-446e-446f-aa6f-25233f33104a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In an industry that is growing increasingly wary of financial malpractice, which exchange is the most trustworthy? </p>\n                    <p><p>The year 2022 saw a historic breakdown of trust in exchanges and other crypto service providers. The collapses of Sam Bankman-Fried’s FTX and <a href=\"https://cointelegraph.com/news/everything-that-s-happened-with-celsius-and-alex-mashinsky-so-far\">Alex Mashinsky’s Celsius</a> are still fresh in the community’s memory, <a href=\"https://cointelegraph.com/news/jury-finds-sbf-guilty-on-all-charges-sentencing-set-for-march-2024-law-decoded-oct-30-to-nov-6\">SBF’s trial only recently having concluded</a>. These cases serve as a painful reminder that fraud and bad business practices can happen in corporations of any size and that crypto as a nascent industry is especially susceptible. A sleek website, high trading volume or prime-time television ads are no guarantee that a customer’s savings will be safe. </p><p>To advance the industry, it is imperative to set new standards for centralized third party service providers in crypto. To this end <a href=\"https://research.cointelegraph.com/\">Cointelegraph Reseach’</a>s new report conducted a survey of 9 major crypto exchanges (Binance, Bit2Me, Bitfinex, Bitstamp, Bybit, Coinbase, HTX, Kraken, OKX) and compared them with a special focus on consumer and funds protection.</p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/new-crypto-exchange-standards\"><em>Download a PDF of the Report for free from the Cointelegraph Research Terminal.</em></a></p><h2>Looking into the facts</h2><p>The report analyzed whether companies are located in a tax haven or in a pro-customer jurisdiction, the transparency of their corporate finances, and how they ensure the user’s assets are secure and well-handled. These considerations are especially relevant for risk-averse individuals and businesses — those who are willing to compromise on fees and trading volume to ensure that the funds they hold on an exchange have all possible protections. </p><p>Some jurisdictions, often those that are notorious for being tax havens, offer companies leeway to do less for consumer protection and regulatory compliance. This ranges from the safekeeping of personal data to responsible risk disclosure. All other things being equal, it can sometimes be a red flag if an exchange seeks out a less regulated environment. The map below presents how safe the customer is in some of the most popular jurisdictions among centralized exchanges.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/b2297306-db5d-4753-955a-46f1112467b6.jpg\"  /></figure><p>Based on the analysis conducted, Bit2Me and Kraken stand out in all the examined categories. They are both headquartered in jurisdictions with strong customer protection regulations and have credible third-party Proof of Reserves audits and payment infrastructure. Besides, they provide extensive risk disclosure to their consumers through their interfaces.</p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/new-crypto-exchange-standards\"><em>Download a PDF of the full Report for free from the Cointelegraph Research Terminal.</em></a></p><p>To achieve true mass adoption, crypto needs to be brought into regulatory frameworks. This doesn’t mean giving up on the principles of decentralization and privacy, but rather finding a balance where these principles can coexist with legal and financial safeguards. </p><p>Regulatory clarity and compliance, especially those directed to protect customers, would increase trust among potential users and open opportunities for institutional investors and businesses to enter the crypto space. The crypto community should strive to create an ecosystem where the benefits of crypto are accessible to everyone while minimizing the risks of fraud, money laundering and bad business practices that might put personal cryptocurrency savings in jeopardy.</p><p class=\"post-content__disclaimer\">The opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.\n</p><p class=\"post-content__disclaimer\">Cointelegraph does not endorse the content of this article nor any product mentioned herein. Readers should do their own research before taking any action related to any product or company mentioned and carry full responsibility for their decisions.\n</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-22T13:01:20.000Z",
    "title": "Navigating Blockchain Frontier: A Comparative Exploration of Solana, Cardano and Revolutionary Euler Network",
    "url": "https://cryptodaily.co.uk/2023/11/navigating-blockchain-frontier-a-comparative-exploration-of-solana-cardano-and-revolutionary-euler-network",
    "description": "Discover about SolanaCardanot and the revolutionary Euler Network"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-22T13:00:36.000Z",
    "title": "Bitcoin Technical Analysis: BTC Holds Steady After Binance Settlement and Fed Minutes",
    "url": "https://news.bitcoin.com/bitcoin-technical-analysis-btc-holds-steady-after-binance-settlement-and-fed-minutes/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Technical Analysis: BTC Holds Steady After Binance Settlement and Fed Minutes\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/totts.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The price of bitcoin is coasting along under the $37K range following the recent settlement between the U.S. Department of Justice (DOJ) and Binance. At the same time, the U.S. Federal Reserve&#x2019;s minutes were released on Tuesday showing no signs of any possible rate cuts or monetary easing. Fed officials stressed at their most recent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T13:03:48.000Z",
    "title": "Gen.G Shakes Up Roster After Disappointing Worlds 2023 Performance",
    "url": "https://www.cryptopolitan.com/gen-g-shakes-up-roster/",
    "description": "Gen.G, one of South Korea&#8217;s most prominent esports organizations, has decided to make significant changes to its roster following a somewhat underwhelming performance in the 2023 League of Legends competitive season.&#160; Despite high hopes and a star-studded lineup, Gen.G fell short of securing a world championship title, and as they prepare for the 2024 season, ... <a title=\"Gen.G Shakes Up Roster After Disappointing Worlds 2023 Performance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gen-g-shakes-up-roster/\" aria-label=\"More on Gen.G Shakes Up Roster After Disappointing Worlds 2023 Performance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T12:57:27.000Z",
    "title": "Genesis accuses Gemini of foul play in massive $689m lawsuit",
    "url": "https://www.cryptopolitan.com/genesis-accuses-gemini-of-foul-play/",
    "description": "In a recent development, cryptocurrency lender Genesis Global Capital has taken legal action against the Gemini cryptocurrency exchange, seeking the return of more than $689 million in alleged preferential transfers. This legal dispute stems from the aftermath of the collapse of the major cryptocurrency exchange FTX last November, which has triggered a series of legal ... <a title=\"Genesis accuses Gemini of foul play in massive $689m lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/genesis-accuses-gemini-of-foul-play/\" aria-label=\"More on Genesis accuses Gemini of foul play in massive $689m lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T12:49:18.000Z",
    "title": "Cardano Foundation votes yes on crucial CIP-1694 proposal",
    "url": "https://www.cryptopolitan.com/cardano-foundation-votes-yes-on-crucial-cip/",
    "description": "The Cardano Foundation, a pivotal entity in the Cardano ecosystem, has significantly moved to decentralize the network further. It recently announced its support for CIP-1694, a critical governance proposal, by voting &#8220;YES&#8221; in a crucial poll. This decision underscores the Foundation&#8217;s commitment to enhancing user participation and decentralizing decision-making on the Cardano blockchain. CIP-1694 stands ... <a title=\"Cardano Foundation votes yes on crucial CIP-1694 proposal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-foundation-votes-yes-on-crucial-cip/\" aria-label=\"More on Cardano Foundation votes yes on crucial CIP-1694 proposal\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T12:42:18.000Z",
    "title": "Trading crypto on Binance gets tough- Order Book liquidity tanks 25%",
    "url": "https://www.cryptopolitan.com/trading-crypto-on-binance-gets-tough/",
    "description": "The capacity to place trades quickly on crypto quoted prices, otherwise termed as the order book liquidity, has dropped in Binance. This incident can be linked to specific events in the crypto world, especially news on the CZ stepping down from his CEO position in the exchange platform.&#160; The move has seen a drop in ... <a title=\"Trading crypto on Binance gets tough- Order Book liquidity tanks 25%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/trading-crypto-on-binance-gets-tough/\" aria-label=\"More on Trading crypto on Binance gets tough- Order Book liquidity tanks 25%\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T13:00:47.000Z",
    "title": "Has Bitcoin Reached “Euphoria” Yet? What On-Chain Data Says",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-reached-euphoria-what-on-chain-data/",
    "description": "Here&#8217;s what on-chain data says regarding if the latest Bitcoin rally has hit the overheated &#8220;euphoria&#8221; stage where past bull runs topped out. Bitcoin Percent Supply In Profit Has Now Hit The 83% Mark In its latest weekly report, the on-chain analytics firm Glassnode has discussed about the &#8220;euphoric&#8221; BTC phase from the angle of investor profitability. Euphoria basically refers to that period of the market where the investors have started embracing greed and the rally is becoming heated. Historically, the major rallies in the asset have attained their tops in such market conditions. To define what constitutes euphoria, Glassnode has referred to the &#8220;percent supply in profit&#8221; metric. This indicator keeps track of the percentage of the total circulating Bitcoin supply that&#8217;s currently being held at a profit. Related Reading: Analyst Predicts Chainlink Rally To $20 Based On This Pattern Here is a chart that shows the trend in this indicator over the past decade: The value of the metric seems to have observed a large spike in recent days &#124; Source: Glassnode's The Week Onchain - Week 47, 2023 As displayed in the above graph, the Bitcoin percent supply in profit has naturally shot up as the latest rally in the cryptocurrency has occurred and the metric&#8217;s value is now floating around the 83% mark. The all-time mean of the metric is 74%, so the current levels are notably above this level. In the chart, the analytics firm has also marked the +1 standard deviation line for the indicator, above which the market can be thought to have entered into the early stages of the euphoria phase. The +1 standard deviation line for the metric is around 90%, so the current profitability levels are still below the mark but are nonetheless quickly closing in the gap. As mentioned before, these profitability levels are in terms of the supply or the coins, calculated by checking for the number of tokens that have their cost basis below the current spot price. There is another way to gauge profitability, however, and it&#8217;s the magnitude of the profits that these coins are combined are seeing right now. This unrealized profit is naturally calculated by subtracting the cost basis of each coin from the current spot price and summing up these differences for the entire supply in profit. The data for the unrealized profit over the past decade &#124; Source: Glassnode's The Week Onchain - Week 47, 2023 &#8220;For the analysis of investor behavior, often the unrealized profit is a more critical variable as it relates back to the USD-denominated profit of investor positions,&#8221; explains Glassnode. Related Reading: Solana Forms Sell Signal, Decline To $30 Ahead? From the graph, it&#8217;s visible that the +1 standard deviation line for this Bitcoin indicator is still quite a distance away from the current value, meaning the coin is far from reaching the euphoric state of the bull market. &#8220;This suggests that whilst a significant volume of the supply is in profit, most have a cost basis, which is only moderately below the current spot price,&#8221; notes the report. BTC Price Bitcoin has gone through some volatility over the past day following the news of Changpeng Zhao (CZ) stepping down as Binance&#8217;s CEO. The asset had earlier slipped below the $36,000 level but has since recovered back to $36,600. Looks like BTC has been mostly trading sideways recently &#124; Source: BTCUSD on TradingView Featured image from Yiğit Ali Atasoy on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T12:48:45.000Z",
    "title": "Crypto Conspiracy? Suspicion Mounts as Community Points Finger at BlackRock in Binance’s Fate",
    "url": "https://www.crypto-news-flash.com/crypto-conspiracy-suspicion-mounts-as-community-points-finger-at-blackrock-in-binances-fate/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-conspiracy-suspicion-mounts-as-community-points-finger-at-blackrock-in-binances-fate",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"opBNB\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-48x27.png 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />CZ&#8217;s resignation triggers mixed reactions within the crypto community, reflecting the prevailing fear, uncertainty, and doubt (FUD) in response to the evolving situation. Industry analysts speculate on BlackRock&#8217;s potential influence in recent crypto developments, especially in regard to a Bitcoin ETF. In a significant turn of events within the cryptocurrency realm, Changpeng Zhao (CZ), a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-22T13:07:05.000Z",
    "title": "Maximizing Opportunities in Crypto Volatility: Leverage Trading in the Current Scenario",
    "url": "https://coinedition.com/maximizing-opportunities-in-crypto-volatility-leverage-trading-in-the-current-scenario/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Maximizing_Opportunities_in_Crypto_Volatility_Leverage_Trading_in-2-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Introduction In the ever-changing landscape of cryptocurrencies, the current market presents a unique playground for traders, especially in leverage trading using CFDs. This approach allows traders to magnify their potential gains from even the smallest market movements. A case in point is Solana (SOL), whose recent price activity exemplifies the lucrative opportunities in leverage trading [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/maximizing-opportunities-in-crypto-volatility-leverage-trading-in-the-current-scenario/\">Maximizing Opportunities in Crypto Volatility: Leverage Trading in the Current Scenario</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-22T12:53:08.000Z",
    "title": "WLD Bounces Back, Eyes New ATH As Altman Reinstated At OpenAI",
    "url": "https://coinedition.com/wld-bounces-back-eyes-new-ath-as-altman-reinstated-at-openai/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Worldcoin (WLD) Set To Undergo 900+% Emission Increase in the Next Year\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>One hour after OpenAI posted that former CEO Sam Altman had returned to the company, the price of Worldcoin (WLD) quickly ran to $2.55. Last week, Coin Edition reported how the cryptocurrency project co-founded by Altman nosedived after he was ousted by the same firm. The CEO Returns, WLD Pumps Altman, in a post on [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/wld-bounces-back-eyes-new-ath-as-altman-reinstated-at-openai/\">WLD Bounces Back, Eyes New ATH As Altman Reinstated At OpenAI</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-22T12:45:10.000Z",
    "title": "Trader Unveils Bull Market Price Targets for Bitcoin, Ethereum, Solana and Two Additional Altcoins",
    "url": "https://dailyhodl.com/2023/11/22/trader-unveils-bull-market-price-targets-for-bitcoin-ethereum-solana-and-two-additional-altcoins/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Unveils-Bull-Market-Price.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst is sharing his price targets for Bitcoin (BTC) and four other digital assets. Pseudonymous analyst Inmortal tells his 201,000 followers on the social media platform X that Bitcoin could soar by more than 255% from its current value in the next bull market. He also says that Ethereum (ETH) could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/trader-unveils-bull-market-price-targets-for-bitcoin-ethereum-solana-and-two-additional-altcoins/\">Trader Unveils Bull Market Price Targets for Bitcoin, Ethereum, Solana and Two Additional Altcoins</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]