[
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T08:55:51.000Z",
    "title": "Stanford to return millions in crypto donations from FTX ",
    "url": "https://cointelegraph.com/news/stanford-returns-all-crypto-donations-from-ftx",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/0d0c81dd-95bb-4eb1-8b30-9391997d7478.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The university said it intends to return the “entirety” of funds received from former cryptocurrency exchange FTX, which it claims were mainly for pandemic-related prevention and research.</p>\n                    <p><p>The California-based university Stanford University said it plans to return all funds it received from the now defunct cryptocurrency exchange FTX, according to a <a href=\"https://www.bloomberg.com/news/articles/2023-09-19/stanford-says-will-return-entirety-of-gifts-received-from-ftx?sref=323RPL5z\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg. </p><p>Stanford received a total of $5.5 million in gifts from FTX-related entities in the timespan between November 2021 and May 2022. In an email statement on Sept. 19, a university spokesperson said: </p><blockquote>“We have been in discussions with attorneys for the FTX debtors to recover these gifts and we will be returning the funds in their entirety.”</blockquote><p>The statement from Stanford clarified that it “received gifts from the FTX Foundation and FTX-related companies largely for pandemic-related prevention and research.”</p><p>Both parents of former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried (SBF)</a>, Allan Joseph Bankman and Barbara Fried, are legal scholars who have taught at Stanford’s law school. </p><p>Stanford’s renouncement of the monetary support from FTX comes as SBF’s parents are accused of stealing millions from the crypto exchange.</p><p>FTX debtors <a href=\"https://cointelegraph.com/news/ftx-founder-parents-sued-accused-stole-millions\">launched a lawsuit on Sept. 18</a> against the two, alleging they misappropriated funds via their involvement with the exchange to, “enrich themselves, directly and indirectly, by millions of dollars,” according to the court papers. Bankman has been alleged to have been a “de facto officer” at FTX Group.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ftx-security-claims-portal-cyberbreach\"><strong><em>FTX bolsters claims portal security measures following cyber breach</em></strong></a></p><p>Court documents from these latest accusations claim that Bankman included Fried, when <a href=\"https://cointelegraph.com/news/sam-bankman-fried-father-dragged-mother-ftx-salary-dispute\">he raised concerns</a> regarding his annual salary of $200,000 that were not addressed by SBF or FTX US. </p><p>According to the documents, Bankman was expecting an annual salary of $1 million. </p><p>On Sept. 19, SBF’s lawyers argued in front of a three-judge panel for <a href=\"https://cointelegraph.com/news/judges-weigh-early-release-sam-bankman-fried-lawyers-push-first-amendment\">early release from jail</a> in order to prepare for his upcoming trial scheduled to begin in October. </p><p>One of the judges in the hearing reportedly said the argument played by SBF’s legal team regarding his First Amendment rights “has no play anymore” due to his <a href=\"https://cointelegraph.com/news/things-sam-is-freaking-out-about-caroline-ellison-diary\">attempts to intimidate</a> witness and former CEO of Alameda Research Caroline Ellison.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T08:48:00.000Z",
    "title": "Cross margin and isolated margin in crypto trading, explained",
    "url": "https://cointelegraph.com/explained/cross-margin-and-isolated-margin-in-crypto-trading-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/670e02eb0de81cd0f60de1a016d809ba.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cross margin uses whole balance, and isolated margin allocates specific collateral for each trade, encouraging diversification. </p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-116923-0\">            <h2 data-ct-widget=\"explained-block-title\">                            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In contrast to isolated margin, which offers greater control and diversification but necessitates more active management, cross-margin trading simplifies risk management while increasing overall risk.</em></p><p>Cross-margin trading offers streamlined risk management but may expose the entire account to significant losses because it uses the whole account balance as collateral for all positions. Isolated margin, on the other hand, allows traders to assign particular amounts of collateral to individual positions, giving them precise risk control and facilitating diversification.</p><p>Cross margining can cause holdings to be prematurely liquidated in volatile markets, whereas isolated margin reduces the possibility of one position’s losses affecting others. Additionally, isolated margin offers more flexible alternatives for leverage, albeit with increased complexity in managing multiple positions and collateral allocations.</p><p>Here’s a quick summary of the differences between cross and isolated margins:</p><p><img alt=\"Cross margin vs. Isolated margin\" src=\"https://s3.cointelegraph.com/storage/uploads/view/f62f4364415e0b6d3d3a98c37dcdbbb2.jpg\" title=\"Cross margin vs. Isolated margin\"></p>The decision between cross and isolated margin ultimately depends upon one’s level of risk tolerance, trading approach and diversification objectives.            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116923-1\">            <h2 data-ct-widget=\"explained-block-title\">                Pros and cons of isolated margin            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Isolated margin trading provides for precise risk control and diversification, but it also necessitates careful monitoring of trading positions and may require more funds than cross-margin trading.</em></p><p>Isolated margin trading allows traders to precisely manage risk by enabling them to assign particular collateral amounts to individual transactions. This granularity lowers the possibility that one trade can negatively impact others by ensuring that losses are restricted to the collateral supplied to each trade.</p><p>Additionally, isolated margin trading encourages efficient diversification by allowing traders to distribute their assets across various positions and assets, reducing the danger of concentration.</p><p>The isolated margin trading strategy does have some complexities, though, particularly for traders with numerous open transactions. Managing collateral for multiple positions can be difficult and may require constant attention. Additionally, compared to cross-margin trading, where the total account amount acts as collateral for all positions, allocating collateral individually may require more money.</p><p>Insufficient collateral for any particular position may lead to margin calls or partial position closures, necessitating constant monitoring and precise risk management; thus, traders must remain watchful. Isolated margin provides customized risk management, but meticulous position handling and monitoring are necessary.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116923-2\">            <h2 data-ct-widget=\"explained-block-title\">                Pros and cons of cross margin            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Cross-margin trading simplifies risk management but poses the risk of substantial losses by using the entire account balance as collateral.</em></p><p>On the positive side, cross-margining makes risk management straightforward by using the full account amount as collateral and may help restrict individual holdings from being prematurely liquidated.</p><p>It also provides the opportunity for higher profits due to greater leverage. However, every trade involving the entire account balance could result in huge losses or account liquidation. Furthermore, the lack of granularity in risk control and the possibility of margin calls can make it challenging to implement precise risk management strategies and diversify effectively.</p><p>In addition, because traders could be unwilling to invest their whole account balance in several positions, cross-margining may hinder diversification and expose them to concentrated risk. For instance, if a trader invests their whole account balance in a single, extremely volatile cryptocurrency and that particular asset experiences a significant price drop, the trader’s entire account balance could be wiped out, illustrating the risk of not diversifying across different assets or positions.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116923-3\">            <h2 data-ct-widget=\"explained-block-title\">                What is an isolated margin in crypto trading?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In the world of cryptocurrencies, isolated margin trading is a risk management strategy where traders allocate a certain amount of collateral to each individual position they open.</em></p><p>In addition to protecting other positions and the overall account balance from potential losses in any one trade, this method enables exact control over the risk involved with<a href=\"https://cointelegraph.com/learn/how-to-trade-cryptocurrencies-the-ultimate-beginners-guide\"> each trade</a>. A set amount of collateral backs each position, and only the collateral assigned to that particular position is at risk if a trade goes against the trader.</p><p>By isolating the risk, losses from one position are prevented from spreading to other holdings or the account’s total balance. Leverage is still allowed with isolated margin, but traders can fine-tune the leverage for each position, enabling a more personalized risk management strategy.</p><p>In isolated margin trading, it is essential to carefully manage position sizes and collateral allocation to avoid overleveraging or underfunding positions and protect the trader’s entire portfolio. Additionally, certain exchanges may put margin calls in place that require traders to increase their collateral or modify their position size if losses reach a specified threshold.</p><h3>How isolated margin is used in crypto trading</h3><p>To understand how isolated margin works in crypto trading, let’s say Alice chooses to engage in isolated margin trading and maintains a trading account with $10,000. She wishes to trade Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and BTC separately, each with a distinct and isolated margin.</p><p>She sets aside $2,000 as a reserve in her account and allocates $5,000 as collateral for her BTC trade and $3,000 for her ETH trade. This strategy separates her BTC and ETH positions from one another, limiting any potential losses to the assigned collateral for each trade.</p><p>If the<a href=\"https://cointelegraph.com/learn/bull-vs-bear-crypto-market-what-is-the-difference-and-how-to-handle-both\"> price of Bitcoin falls</a> while her BTC position is open, for example, her losses are limited to the $5,000 set up as collateral for that trade. Losses in one trade won’t have an impact on her other positions because she hasn’t touched the $3,000 set aside for the ETH position. This fine-grained control over risk enables Alice to handle each trade on her own.</p><p>Even if the BTC position has losses that are greater than the $5,000 in collateral, a margin call wouldn’t be issued and her ETH trade wouldn’t be impacted. An isolated margin allows Alice to proactively manage risks and protect her entire portfolio, thanks to the specific collateral allocation for each position. However, careful risk management and position size monitoring are essential for ensuring a balanced and secure trading approach.</p><p><strong><em>Related:<a href=\"https://cointelegraph.com/learn/day-trading-vs-long-term-cryptocurrency-hodling-benefits-and-drawbacks\"> Day trading vs. long-term cryptocurrency hodling: Benefits and drawbacks</a></em></strong></p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116923-4\">            <h2 data-ct-widget=\"explained-block-title\">                What is cross margin in crypto trading?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Cross-margin trading is a risk management tactic in cryptocurrency trading whereby traders utilize the whole balance of their accounts as collateral for their open positions.</em></p><p>Using account balance as collateral implies that the entire amount of the account is at risk in order to cover future trading losses.<a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\"> </a>Cross margining makes <a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\">higher leverage</a> possible, allowing traders to open larger positions with less money. It bears more risk but prevents individual position liquidation by acting as a buffer with the account balance.</p><p>To reduce risk, margin calls may be made, and traders must carefully monitor their positions and put<a href=\"https://cointelegraph.com/learn/crypto-trading-basics-a-beginners-guide-to-cryptocurrency-order-types\"> stop-loss orders</a> in place to limit losses. For seasoned traders, cross margining is a potent strategy, but it should be utilized with caution and a solid risk management plan. Novices and those with little prior trading experience should completely understand the platform’s margin rules and policies.</p><h3>How cross margin is used in crypto trading</h3><p>To understand how cross-margin trading works, let’s consider a scenario where Bob, a trader, chooses cross margining as his risk management strategy with $10,000 in his account. This<a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-cryptocurrency-trading-strategies\"> trading strategy</a> involves using the whole balance of his account as security for open trades.</p><p>Bob chooses to<a href=\"https://cointelegraph.com/explained/long-and-short-positions-explained\"> go long</a> when Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is trading at $40,000 per BTC and buys 2 BTC using 10x leverage, giving him control over a 20 BTC position. However, it is important to note that he is using the first $10,000 as collateral.</p><p>Fortunately, the price of Bitcoin soars to $45,000 per BTC, making his 2 BTC worth $90,000. Bob chooses to<a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-taking-crypto-profits-and-reinvesting\"> lock in his profits</a> and sell his two BTC at this higher price. As a result, he ends up with $100,000 in his account — $10,000 at the start plus the $90,000 profit.</p><p>However, if the price of Bitcoin had dropped significantly, let’s say to $35,000 per BTC, Bob’s 2 BTC position would now be worth $70,000. Sadly, in this instance, Bob’s account balance would not be enough to offset the losses brought on by the declining price.</p><p>The position would have been secured with his initial $10,000 in collateral, but he would now have an unrealized loss of $30,000 (the difference between the purchase price of $40,000 and the current value of $35,000 per BTC). Bob would be in a precarious situation with no more money in his account.</p><p>In many cryptocurrency trading platforms, a margin call could happen if the losses are greater than the available collateral. A margin call is a request made by the exchange or broker that the trader deposits more money to offset losses or shrink the size of their position. To prevent future losses, the exchange might automatically close a portion of Bob’s position if he couldn’t fulfill the margin call requirements.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T08:48:01.000Z",
    "title": "Developer Leverages ChatGP4 and AI for Autonomous Token deployment on Ethereum",
    "url": "https://www.cryptopolitan.com/chatgp4-ai-autonomous-token-deployment/",
    "description": "In a remarkable display of ingenuity and technological prowess, a developer has achieved an unprecedented feat by harnessing the power of ChatGP4 and AI to autonomously launch an ERC-20 token on the Ethereum blockchain. This groundbreaking endeavor not only pushes the boundaries of what AI can achieve in the world of blockchain technology but also ... <a title=\"Developer Leverages ChatGP4 and AI for Autonomous Token deployment on Ethereum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgp4-ai-autonomous-token-deployment/\" aria-label=\"More on Developer Leverages ChatGP4 and AI for Autonomous Token deployment on Ethereum\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T09:09:06.000Z",
    "title": "SBF’s father was unhappy with $200k salary at FTX",
    "url": "https://crypto.news/sbfs-father-was-unhappy-with-200k-salary-at-ftx/",
    "description": "Initially offered $200,000 annually at FTX, Bankman sought $1 million, even involving SBF’s mother in the negotiations. A new court filing reveals that Sam Bankman-Fried’s (SBF) father was unhappy with his salary at FTX, so he dragged SBF’s mother into&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T09:02:04.000Z",
    "title": "BNB, Uniswap, and Kangamoon can rally in September",
    "url": "https://crypto.news/bnb-uniswap-and-kangamoon-can-rally-in-september/",
    "description": "Binance is expanding with opBNB as bulls expect Uniswap to break above $4.5. Meanwhile, investors expect Kangamoon to register gains by the end of the presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T08:57:07.000Z",
    "title": "Defi protocol Balancer suffers frontend hack",
    "url": "https://crypto.news/defi-protocol-balancer-suffers-frontend-hack/",
    "description": "The team behind the protocol has confirmed the attack and urged users to avoid interaction with the project&#8217;s interface. Balancer (BAL), an automated market maker on the Ethereum (ETH) blockchain, has become the latest decentralized finance protocol to suffer from&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T08:43:19.000Z",
    "title": "Stanford University to return millions received from FTX",
    "url": "https://crypto.news/stanford-university-to-return-millions-received-from-ftx/",
    "description": "Stanford University intends to return all funds donated by the crypto trading company and related entities like Bankman-Fried&#8217;s hedge fund Alameda Research. A spokesperson for the prestigious California-based university told Bloomberg lawyers wanted to return millions received from Sam Bankman-Fried’s&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T08:49:13.000Z",
    "title": "BNB Trading Sideways In Last 30 Days – Is Stagnation Likely Until October?",
    "url": "https://www.newsbtc.com/all/bnb-trading-sideways-in-last-30-days-is-stagnation-likely-until-october/",
    "description": "Binance Coin (BNB) finds itself in a state of limbo as it extends its sideways pattern on the lower timeframes. BNB has been treading water for nearly a month, caught in a tight range between the support at $205 and a stubborn resistance zone spanning $220 to $225.  While on-chain metrics hint at the potential for a short-term price surge, BNB bulls are grappling with the challenge of breaking free from this extended sideways pattern. As of the latest data from CoinGecko, BNB is currently priced at $216.74, with a modest 0.1% gain in the last 24 hours and a seven-day rally of 2.8%. Investors and traders are eagerly awaiting a decisive move in either direction, but the market seems hesitant to make a commitment. Related Reading: Halving Hype: Bitcoin Gearing Up For A Parabolic Ride, Analyst Says BNB Bulls And Bears At Loggerheads Bulls and bears have been entrenched in a battle, with $205 serving as a crucial support and the $220-$225 range as the formidable resistance. This scenario has paved the way for a prolonged period of range-bound price action in the short term, leaving traders on the edge of their seats. Price analysis shows that the On Balance Volume (OBV) indicator&#8217;s relatively muted movement presents two possible scenarios for the days ahead. The first scenario entails bulls launching a concerted effort to catch short sellers off guard by breaking above the $220 barrier and potentially surging toward the $240 mark. Such a move would inject renewed optimism into the BNB market. BNB market cap currently at $33 billion. Chart: TradingView.com On the flip side, a bearish rejection could usher in a third test of the $205 support level, with the ominous prospect of a breakdown toward the $188 support level, as seen on the weekly timeframe. This scenario could see the bears exerting their influence and pushing BNB lower. Related Reading: Arbitrum: What’s In Store For ARB Token After Unlock? Long-Term Prospects Hang In The Balance Zooming out to the larger timeframes, the situation remains tense, with BNB trading far from key levels. To regain control, another analysis points out that buyers must strive to push the price above the nearest resistance at $221.7. Only then can hopes for a potential bull run begin to materialize. BNB seven-day price action. Source: Coingecko While on-chain metrics hint at potential upward momentum, the resilience of the resistance zone is a formidable challenge.   Traders and investors will be keeping a keen eye on the evolving OBV dynamics, as they hold the key to whether BNB breaks free from its current sideways drift or succumbs to further downward pressure as October approaches. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from VectorStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T09:00:49.000Z",
    "title": "Bitcoin Cash ($BCH) On-Chain Activity Takes A Hit, Traders Place Huge Bets On $QUBE",
    "url": "https://www.crypto-news-flash.com/bitcoin-cash-bch-on-chain-activity-takes-a-hit-traders-place-huge-bets-on-qube/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-cash-bch-on-chain-activity-takes-a-hit-traders-place-huge-bets-on-qube",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-96.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-96.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-96-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-96-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The dynamic crypto space is constantly shifting as tokens gain or lose traction. In recent developments, Bitcoin Cash ($BCH) has experienced a decline in on-chain activity, resulting in concerns among traders. Amidst this decline, traders are placing huge bets on $QUBE for its potential success. This article will explore the factors contributing to the decrease [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T08:59:23.000Z",
    "title": "Shiba Inu Reaches Historic Utility Milestone with 2,940,738 Transactions and 1,246,741 Wallet Addresses",
    "url": "https://www.crypto-news-flash.com/shiba-inu-reaches-historic-utility-milestone-with-2940738-transactions-and-1246741-wallet-addresses/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-reaches-historic-utility-milestone-with-2940738-transactions-and-1246741-wallet-addresses",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The Shiba Inu Layer-2 platform, Shibarium, nears 3 million transactions and has amassed over 1.2 million wallet addresses. Shibarium network&#8217;s daily transactions recently declined, but the platform continues to contribute to Shiba Inu burns as a community effort. According to the daily transactions noted on the Shibarium explorer, Shibarium, the Layer-2 network of Shiba Inu, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T08:41:36.000Z",
    "title": "Stanford University to Return $5.5 Million in FTX Donations Amid Allegations ",
    "url": "https://www.crypto-news-flash.com/stanford-university-to-return-5-5-million-in-ftx-donations-amid-allegations/?utm_source=rss&utm_medium=rss&utm_campaign=stanford-university-to-return-5-5-million-in-ftx-donations-amid-allegations",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />An amount of $5.5 million sent from FTX to Stanford University as a donation for pandemic-related prevention and research is set to be returned.  FTX&#8217;S Sam Bankman-Fried allegedly purchased a 3000-square-foot home valued at $16.4 million for his parents.  In 2022, one of the most renowned crypto projects, FTX, owned by Sam Bankman-Fried filed for [...]"
  }
]