[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T20:40:57.000Z",
    "title": "AI-Related Tokens Hold Gains After Nvidia's Big Beat Solidifies Bullish Outlook",
    "url": "https://www.coindesk.com/business/2023/08/23/ai-related-tokens-rise-after-nvidias-big-beat-solidifies-bullish-artificial-intelligence-outlook/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The tokens such as FET, GRT, AGIX rose/fell tktk"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T20:59:56.000Z",
    "title": "Cypher announces recovery plan, says it will 'socialize' losses in initial stage",
    "url": "https://cointelegraph.com/news/cypher-announces-recovery-plan-says-it-will-socialize-losses-in-initial-stage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9efd06ef-e581-455d-8956-32b949fb84c9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cypher announced that losses from the exploit will be distributed among users in an initial stage, then compensated through protocol revenue when the platform relaunches.</p>\n                    <p><p>Crypto trading platform Cypher protocol has published a plan to recover from its $1 million exploit, stating it will “socialize” losses across the platform in an initial stage of the recovery. In the first stage of the plan, the Solana-based trading platform will produce a “pro rata redemption package” of current assets it possesses, which will become withdrawable by users through a web interface. However, the platform does not currently have enough funds to pay back all depositors, so losses <a href=\"https://cypherlabs.notion.site/Detailed-next-steps-for-cypher-9a2ccc13af394fd58318a406a39ec5cf\" target=\"_blank\" rel=\"noopener nofollow\">will</a> be distributed across all accounts in this initial stage rather than being borne by any particular individual or group.</p><p>In a second stage of the recovery process, the protocol will raise funds through an initial DEX offering (IDO), and these funds will be used to pay for audits and further development. At the same time that the IDO is occurring, users will be issued a “debt token” representing the remaining assets they are owed by the protocol. This debt token will grant them the right to USDC profits generated by Cypher in the future, allowing the protocol’s losses from the exploit to eventually be paid back to users.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In response to our recent exploit, Cypher is fast tracking an IDO.<br><br>Here’s the game plan. <a href=\"https://t.co/DFnJFvj4zD\">pic.twitter.com/DFnJFvj4zD</a></p>&mdash; cypher ©️ (@cypher_protocol) <a href=\"https://twitter.com/cypher_protocol/status/1694406842481549402?ref_src=twsrc%5Etfw\">August 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Our foremost priority is to direct funds towards impacted users, underscoring our dedication to rectify their financial losses,” the team stated. After these funds are paid back, the team will engage auditors Otter Sec and Mad Shield to perform public audits on the patched version of Cypher, in an attempt to discover any further bugs before they can become a problem.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/palo-alto-networks-ceo-hackers-getting-faster-breach-cybersecurity\"><strong>Firms have mere hours to deflect cyberattacks, warns cybersecurity CEO</strong></a></p><p>The protocol will only resume “after a meticulous evaluation, ensuring every potential vulnerability is addressed.” In the meantime, the app’s smart contracts will remain frozen, the plan stated.</p><p>The $1 million Cypher exploit <a href=\"https://cointelegraph.com/news/cypher-protocol-solana-hack-exploited-smart-contract\">occurred on August 8</a>. Security researchers have yet to determine its cause. $600,000 worth of crypto drained in the attack <a href=\"https://cointelegraph.com/news/cypher-protocol-half-stolen-funds-frozen-on-exchanges\">was frozen by various centralized exchanges</a>, preventing the attacker from cashing them in. Cypher has announced that it will attempt to recover these funds for users through cooperation with exchanges or through seizure warrants issued by law enforcement.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-23T21:07:46.000Z",
    "title": "Crypto Inflows Soar After BlackRock’s ETF Move",
    "url": "https://cryptobriefing.com/crypto-inflows-soar-after-blackrocks-etf-move/?utm_source=feed&utm_medium=rss",
    "description": "Crypto exchange investment products gained momentum after BlackRock's Bitcoin filing in June."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T20:50:26.000Z",
    "title": "UK’s economy can’t catch a break — It just keeps plunging",
    "url": "https://www.cryptopolitan.com/uk-economy-just-keeps-plunging/",
    "description": "The UK&#8217;s hopes for economic resilience continue to shatter as alarming indicators roll in. An influential economic health survey brings bleak news, signaling a downturn. Just when we thought there might be some semblance of economic recovery, the data hammers home a different reality. High-Interest Rates Dampen Economic Spirits The rising interest rates, which one ... <a title=\"UK&#8217;s economy can&#8217;t catch a break — It just keeps plunging\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-economy-just-keeps-plunging/\" aria-label=\"More on UK&#8217;s economy can&#8217;t catch a break — It just keeps plunging\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T20:49:50.000Z",
    "title": "Federal Government’s Generative AI Consultation Criticized for Lack of Transparency and Rushed Process",
    "url": "https://www.cryptopolitan.com/federal-generative-ai-criticized/",
    "description": "Critics are voicing concerns over the Canadian federal government&#8217;s consultation process regarding a proposed code of conduct for generative artificial intelligence (AI) systems similar to ChatGPT. Critics argue that the process lacks transparency, democratic engagement, and public education, raising questions about the government&#8217;s commitment to regulating AI technology effectively. The consultation, which aims to establish ... <a title=\"Federal Government&#8217;s Generative AI Consultation Criticized for Lack of Transparency and Rushed Process\" class=\"read-more\" href=\"https://www.cryptopolitan.com/federal-generative-ai-criticized/\" aria-label=\"More on Federal Government&#8217;s Generative AI Consultation Criticized for Lack of Transparency and Rushed Process\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T20:55:22.000Z",
    "title": "Policymaker: US doesn’t need a retail CBDC",
    "url": "https://crypto.news/policymaker-us-doesnt-need-a-retail-cbdc/",
    "description": "Republican Congressman French Hill is against Federal Reserve's plans to launch a retail CBDC"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T21:00:18.000Z",
    "title": "Whale Moves 2,910 Bitcoin (BTC) To Exchange Amid FBI Warnings, A Bearish Signal?",
    "url": "https://www.newsbtc.com/news/bitcoin/whale-moves-bitcoin-to-exchange-amid-fbi-warnings/",
    "description": "Substantial Bitcoin (BTC) transfers have been reported again, often setting the stage for market speculation. Over the past 24 hours, there have been two significant BTC transactions. This transaction has sparked debate within the crypto community, especially since it comes shortly after the US Federal Bureau of Investigations (FBI) warned crypto firms that funds associated with North Korean hacker organizations, Lazarus Group and APT38, are on the move. Related Reading: Bitcoin Teetering On The Edge: Here’s Why BTC Could Plunge Below $26,000 A Potential Bitcoin Sell-Off On The Horizon? Earlier today, Whale Alert&#8217;s notifications drew attention to a roughly 4,800 BTC (approximately $124.95 million) transfer between two undisclosed wallets. 🚨 🚨 🚨 🚨 🚨 4,800 #BTC (124,954,585 USD) transferred from unknown wallet to unknown wallethttps://t.co/Zz4W6H9Z5d — Whale Alert (@whale_alert) August 23, 2023 Within two hours, another post from the platform reported the movement of 2,910 BTC, valued at close to $76 million. 🚨 🚨 🚨 🚨 2,910 #BTC (75,810,489 USD) transferred from unknown wallet to #Coinbasehttps://t.co/Jlw4lUhGnq — Whale Alert (@whale_alert) August 23, 2023 What caught the eyes of many was that this large sum was directed to Coinbase, one of the leading US cryptocurrency exchange platforms. It is worth noting that, historically, such transfers to exchanges have occasionally heralded selloffs, thereby causing speculations about a potential dip in Bitcoin&#8217;s value. BTC, North Korean Affiliations, And The FBI Warning While significant Bitcoin movements aren&#8217;t uncommon, the timing of these transfers has coincided with a pressing alert from the US Federal Bureau of Investigations (FBI), as mentioned above. The agency has warned crypto platforms of movements associated with the North Korean hacker groups, Lazarus Group and APT38. The Bureau also conveyed concerns that North Korea might try to liquidate Bitcoin. The funds allegedly totaling nearly $40 million, linked to these cybercriminal factions, have been shifted in the past day alone. The alert underscored the importance for private sector entities to vigilantly examine the blockchain data connected with these addresses. The statement noted: Private sector entities should examine the blockchain data associated with these addresses and be vigilant in guarding against transactions directly with, or derived from, the addresses. However, it&#8217;s important to note that so far, there has been no clarification that a direct connection has been established between the Bitcoin transactions reported by Whale Alert and the North Korean hacker-linked BTC movements. Yet, the coincidental timing of these significant transfers cannot be ignored. Should both sets of movements be inclined towards selling, Bitcoin&#8217;s price could experience a notable impact that could potentially result in the asset&#8217;s further decline. Related Reading: Bitcoin Speculators Retreat As Long-Term Holders Double Down Since $69,000 Peak Regardless, Bitcoin has seen quite an uptrend in the past 24 hours, adding a 2.1% gain to its value with a current market price of $26,386, at the time of writing and a trading volume of $17 billion. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T21:09:00.000Z",
    "title": "XRP Surpasses Ethereum as South Korea’s Most Popular Altcoin",
    "url": "https://coinedition.com/xrp-surpasses-ethereum-as-south-koreas-most-popular-altcoin/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Surpasses Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Surpasses-Ethereum-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>XRP, the world&#8217;s fifth-ranked cryptocurrency, has dethroned Ethereum, the world&#8217;s second-largest cryptocurrency, as the most popular altcoin in South Korea. According to a South Korean news outlet report, cryptocurrency users in the country now prefer XRP as an investment choice above other altcoins such as Ethereum. Based on data from the South Korean cryptocurrency exchange [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-surpasses-ethereum-as-south-koreas-most-popular-altcoin/\">XRP Surpasses Ethereum as South Korea’s Most Popular Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]