[
  {
    "source": "CoinDesk",
    "date": "2024-01-17T17:39:47.000Z",
    "title": "Bernstein Says Buy the Dip in Bitcoin Mining Stocks Ahead of BTC Price 'Inflection'",
    "url": "https://www.coindesk.com/business/2024/01/17/bernstein-says-buy-the-dip-in-bitcoin-mining-stocks-ahead-of-btc-price-inflection/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The broker says it prefers outperform rated mining stocks Riot Platforms (RIOT) and CleanSpark (CLSK)."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-17T18:03:10.000Z",
    "title": "Ethereum Moves One Step Closer Toward Major Scalability Upgrade",
    "url": "https://decrypt.co/213208/ethereum-dencun-upgrade-live-testnet",
    "description": "Ethereum’s Dencun upgrade today went live on the Goerli testnet in a move that aims solve the network's scalability issues."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T17:55:00.000Z",
    "title": " Ethereum Dencun upgrade goes live on testnet after 4-hour delay ",
    "url": "https://cointelegraph.com/news/ethereum-dencun-upgrade-goes-live-testnet-after-4-hour-delay",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZTE2NDEwNTYtN2M0Zi00YzQ1LTgyNTktYjBlMDMzYjM2N2YwLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Dencun upgrade was implemented on Ethereum’s Goerli testnet, but a bug in Prysm kept the network from finalizing for nearly four hours.</p>\n                    <p><p>The newest upgrade to the Ethereum network, codenamed “Cancun-Deneb” or “Dencun,” has gone live on the Goerli testnet for the first time, according to a Jan. 17 social media post from Ethereum developer Parithosh Jayanthi. </p><p>According to Jayanthi, a bug delayed the network’s launch for approximately four hours. But once this problem was fixed through a patch, the network came back up.</p><p>Once implemented on mainnet, the Dencun upgrade will <a href=\"https://cointelegraph.com/news/ethereum-dencun-upgrade-testing-scheduled-jan-17\">significantly lower the cost of transactions</a> on Ethereum layer-2s such as Optimism, Base, Polygon zkEVM, and others, developers have claimed. It will also limit self-destruct operations and allow for new bridge and staking pool features.</p><p><a href=\"https://cointelegraph.com/news/ethereum-dencun-upgrade-goes-live-testnet-after-4-hour-delay\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T17:45:00.000Z",
    "title": " Gemini approved to operate in France, will debut within weeks ",
    "url": "https://cointelegraph.com/news/gemini-approved-operate-france-debut-within-weeks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTA1NjdhNDUtNGYzYi00MTcyLTk0NDQtODcxYjgyMmZlZDA2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>French markets regulator Autorité des marchés financiers granted Gemini registration, reportedly making it the 105th company to receive it. </p>\n                    <p><p>Cryptocurrency exchange Gemini has received approval to operate in France as a digital asset services provider (DASP). The new registration brings the total number of European jurisdictions where Gemini operates to “over a dozen,” the company <a href=\"https://www.gemini.com/blog/gemini-secures-french-crypto-registration-continuing-global-expansion\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Jan. 17</p><p>Gemini services should be available there in the coming weeks, making over 70 cryptocurrencies available to institutional and retail traders, it said. Institutional traders will also have access to Gemini eOTC electronic over-the-counter trading. Gemini head of the European Union and Ireland Gillian Lynch said:</p><p>French media <a href=\"https://www.bfmtv.com/crypto/regulation/les-deux-geants-des-cryptos-okx-et-gemini-debarquent-en-france_AV-202312140397.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> in December that financial markets regulator Autorité des marchés financiers (AMF) was granting Gemini and crypto exchange OKX PSAN (DASP) registration simultaneously, and Gemini was its 105th registrant. </p><p><a href=\"https://cointelegraph.com/news/gemini-approved-operate-france-debut-within-weeks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T18:11:58.000Z",
    "title": "NEAR Protocol (NEAR) Defies Odds with Epic Rally – Is Optimism (OP) Next in Line for a Massive Breakout?",
    "url": "https://cryptodaily.co.uk/2024/01/near-protocol-near-defies-odds-with-epic-rally-is-optimism-op-next-in-line-for-a-massive-breakout",
    "description": "Embark on the latest dynamics in the crypto world with our in-depth analysis of NEAR Protocol's (NEAR) remarkable growth and Optimism's (OP) strategic maneuvering in the Ethereum L2 landscape. Dive into this compelling article to explore how NEAR's impressive resilience and gains contrast with OP's fluctuating fortunes, shaping the future of blockchain technology in 2024."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T17:40:20.000Z",
    "title": "Bitcoin ETF Surge Fuels Dogecoin (DOGE) and Shiba Inu (SHIB) Momentum",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-etf-surge-fuels-dogecoin-doge-and-shiba-inu-shib-momentum",
    "description": "Discover how the surge in Bitcoin ETFs, attracting over $1 billion in just two days, impacts the cryptocurrency market. Explore Dogecoin (DOGE) and Shiba Inu (SHIB) as they gain momentum alongside Bitcoin. Get insights into DOGE's high-profile backing and SHIB's whale-driven price surge. Stay updated on the dynamic crypto landscape."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T18:11:59.000Z",
    "title": "Regulating AI: Feasible Approaches to Address Growing Concerns",
    "url": "https://www.cryptopolitan.com/regulating-ai-feasible-approaches-to-address/",
    "description": "As the influence of generative artificial intelligence (AI) technologies continues to expand, so does the apprehension surrounding their potential consequences. These concerns encompass various issues, from the proliferation of disinformation and job displacement to the loss of creative control and even existential threats posed by superintelligent AI.&#160; In response to these mounting fears, governments worldwide [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T18:07:55.000Z",
    "title": "Binance launches AltLayer on Launchpool, expands crypto investment options",
    "url": "https://crypto.news/binance-launches-altlayer-on-launchpool-expands-crypto-investment-options/",
    "description": "Binance has added AltLayer as the latest project on its Binance Launchpool platform, offering users new opportunities for cryptocurrency staking and trading."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T18:00:34.000Z",
    "title": "Sam Bankman-Fried’s parents seeking dismissal of FTX lawsuit",
    "url": "https://crypto.news/sam-bankman-frieds-parents-seeking-dismissal-of-ftx-lawsuit/",
    "description": "Sam Bankman-Fried's parents have filed a motion to dismiss FTX's lawsuit, denying involvement in the exchange's downfall."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T17:52:08.000Z",
    "title": "Grayscale moved $1.3b Bitcoin to Coinbase since ETF approval",
    "url": "https://crypto.news/grayscale-moved-1-3b-bitcoin-to-coinbase-since-etf-approval/",
    "description": "Following the approval of spot Bitcoin ETFs, Grayscale has transferred some 31,638 BTC within its dedicated Coinbase accounts."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T18:00:37.000Z",
    "title": "QCP Capital Forecasts ETH’s Dominance Over Bitcoin To Persist,  Ethereum ETFs In Focus",
    "url": "https://www.newsbtc.com/ethereum-news/qcp-capital-forecasts-eths-dominance-over-bitcoin-to-persist-ethereum-etfs-in-focus/",
    "description": "Over the past 30 days, Ethereum (ETH), the second-largest cryptocurrency, has experienced a notable surge of 17%, outperforming Bitcoin (BTC), which has recorded a surge of 2.5% over the same period.  This comes as the initial excitement surrounding the approval of the exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC) appears to have waned, with BTC witnessing a 5% drop in the past seven days.  Interestingly, according to crypto trading firm QCP Capital, following the approval of Bitcoin ETFs, the focus has shifted to the potential launch of an ETH spot ETF, which could be one of the factors for Ethereum outperforming BTC.   Ethereum Gains Ground Against BTC  According to QCP Capital, the total volumes transacted across all 11 ETFs in the past week have reached $9.8 billion. The Grayscale Bitcoin Trust (GBTC) alone accounted for $4.6 billion.  Since converting from a Trust to an ETF, GBTC has experienced outflows of $1.17 billion. This is “unsurprising” for the firm, considering GBTC had been trading at a discount since 2020, offering investors an opportunity to exit at par value.  Related Reading: Chiliz (CHZ) Jumps Over 40%: Reasons Behind The Hot Streak BTC initially surged to a high of $49,100 upon ETF approval but has since seen a decline, consolidating above the $40,000 support level. Volumes have slowed since the initial launch, and market attention is focused on GBTC outflows.  Meanwhile, ETHBTC, which traded below 0.05, has seen an upward trend to 0.06. According to QCP Capital, Ethereum is anticipated to continue to outperform Bitcoin in the medium term as the narrative shifts towards potential ETH Spot ETF approvals. Bitcoin Forward Contract Yields Decrease Following the launch of the BTC spot ETF, BTC forward contracts have experienced a greater decline compared to ETH forward contracts. BTC 1-month forward fell from 32% annualized to 9% (-23%), while ETH 1-month forward decreased from 28% to 12% (-16%).  According to QCP Capital, despite declining yields, ETH forwards still appear attractive, offering 11-13% annualized returns. Additionally, selling ETH 1-month 2200 Puts presents a viable option with yields above 21% annually, and it could be a suitable level to buy in the event of a dip upon potential ETH spot ETF approvals. Related Reading: Shibarium Shatters Records: 2 Million Transactions In A Day – Details Ultimately, the crypto firm suggests that the forthcoming BTC halving in mid-April and the potential approval of ETH Spot ETFs from May are anticipated to be significant events for the crypto market.  In the interim, market movements may also be influenced by macroeconomic events. The January Federal Open Market Committee (FOMC) meeting, as well as the February Non-Farm Payrolls (NFP) and Consumer Price Index (CPI) reports, are being closely monitored for insights.  The pace of the balance sheet runoff, discussed briefly in December 2023, is expected to provide further clarity during the January FOMC meeting. The market consensus suggests a slowdown in quantitative tightening (QT), but the timing and extent of these changes remain uncertain. Overall, the potential launch of an Ethereum spot ETF has sparked speculation and could have a transformative impact on the Ethereum ecosystem. As the market grapples with changing dynamics, attention remains on key events, such as the BTC halving and potential ETH Spot ETF approvals. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-17T17:55:20.000Z",
    "title": "Tether Protests UN Accusations of USDT Being Used in Crime, Argues Blockchains Are Impractical for Illicit Use",
    "url": "https://dailyhodl.com/2024/01/17/tether-protests-un-accusations-of-usdt-being-used-in-crime-argues-blockchains-are-impractical-for-illicit-use/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-illicit-crime-use.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Tether is pushing back against recent accusations from a United Nations agency that its stablecoin, USDT, is used extensively for money laundering and fraud in Asia. In a new report, the United Nations Office on Drugs and Crime (UNODC) claims criminals in East and Southeast Asia prefer to use USDT on the Tron (TRON) blockchain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/17/tether-protests-un-accusations-of-usdt-being-used-in-crime-argues-blockchains-are-impractical-for-illicit-use/\">Tether Protests UN Accusations of USDT Being Used in Crime, Argues Blockchains Are Impractical for Illicit Use</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]