[
  {
    "source": "Decrypt",
    "date": "2024-04-01T23:51:02.000Z",
    "title": "Sam Bankman-Fried ‘Haunted’ by FTX Mistakes After 25-Year Prison Sentence: Report",
    "url": "https://decrypt.co/224369/sam-bankman-fried-haunted-bad-manager-victims-abc-news-email",
    "description": "In an email exchange with ABC News, the disgraced crypto mogul said he’s trying to make things right from prison."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-02T00:05:13.000Z",
    "title": "Hedge Fund Manager Predicts When Bitcoin Price Will Reach $150,000",
    "url": "https://www.newsbtc.com/news/bitcoin/when-bitcoin-price-150000/",
    "description": "Founder and Chief Executive Officer (CEO) of Morgan Creek Capital Management, Mark Yusko has predicted a massive price increase for Bitcoin during the 2024 bull cycle. Emphasizing  Bitcoin’s immense potential, the hedge fund manager has crowned it as the unrivaled “King” among digital assets. $150,000 Price Target Set For BTC Appearing in a recent interview with CNBC Television on March 27, Yusko shared a bold forecast of Bitcoin, predicting that the cryptocurrency will see a significant rise to $150,000 in 2024.  When asked why he believes the cryptocurrency would have such an astronomical price increase, Yusko cited the impacts of the upcoming Bitcoin halving and Spot Bitcoin Exchange Traded Fund (ETF), on the price of BTC. The hedge fund manager has revealed that historically after a BTC halving cycle is completed, the fair value of the cryptocurrency rises.  Related Reading: Dogecoin Price Breaks New 3-Year High – Here Are Factors That Could Drive The Price To $1 He explained that when the upcoming 2024 Bitcoin halving occurs in April, BTC miners will face challenges, with transaction fees poised to soar, consequently driving a price increase to $75,000.  After the Bitcoin halving event, the cryptocurrency is expected to surge two times its fair value to $150,000. The hedge fund manager cited factors like increased interest from investors and Fear of Missing Out (FOMO) as triggers for this price spike.  Yusko also revealed that after the Bitcoin halving, there would be a surge in demand for Spot Bitcoin ETFs, while the supply of new coins would decrease from 900 BTC to 450 BTC a day.  “If there’s more demand than supply, price has to rise,” the hedge fund manager stated.  The investment management CEO has expressed a strong belief in BTC&#8217;S value as one of the world’s leading digital assets. He envisions the cryptocurrency “easily” skyrocketing by 10x over the next decade.  “Bitcoin is the king, it is the dominant token. It is a better form of gold or digital property. And I do think it will be the best,” Yusko said.  Bitcoin Price Top Expected By Year’s End During his interview, Yusko predicted that Bitcoin could reach its peak price value by the end of 2024. The hedge fund manager disclosed that historically, nine months after a Bitcoin halving event, sometime in December, BTC undergoes a surge to its peak value before entering the next bear market.  Related Reading: Shiba Inu Dips Below $0.00003 Again – Can Bulls Reverse The Bullish Momentum? During this time, the investment management CEO has stated that smaller crypto projects could potentially experience substantial increases, surpassing the gains witnessed by BTC. He disclosed several altcoins and investment assets that his company, Morgan Creek Capital Management, typically buys and HODLs, including Solana, Avalanche and Coinbase. BTC bulls and bears vie for control &#124; Source: BTCUSD on Tradingview.com Featured image from Crypto News, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-02T00:00:35.000Z",
    "title": "Analyst Predicts Breakout Rallies for Dogecoin (DOGE) and Two Solana-Based Memecoins – Here’s His Forecast",
    "url": "https://dailyhodl.com/2024/04/01/analyst-predicts-breakout-rallies-for-dogecoin-doge-and-two-solana-based-memecoins-heres-his-forecast/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/majority-doge-holders-now.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist thinks that three memecoins are gearing up to witness breakout surges. Pseudonymous analyst Altcoin Sherpa tells his 213,200 followers on the social media platform X that he sees top memecoin Dogecoin (DOGE) igniting an over 50% rally from current levels after moving above its resistance at $0.195. &#8220;DOGE: On its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/01/analyst-predicts-breakout-rallies-for-dogecoin-doge-and-two-solana-based-memecoins-heres-his-forecast/\">Analyst Predicts Breakout Rallies for Dogecoin (DOGE) and Two Solana-Based Memecoins – Here’s His Forecast</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]