[
  {
    "source": "NewsBTC",
    "date": "2024-03-30T14:00:27.000Z",
    "title": "Dogecoin Price Breaks New 3-Year High – Here Are Factors That Could Drive The Price To $1",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-breaks-new-3-year-high-here-are-factors-that-could-drive-the-price-to-1/",
    "description": "The price of Dogecoin (DOGE) recently broke a 3-year high after rising to $0.22. This move continues the remarkable run made by the foremost meme coin and has strengthened the belief that DOGE could increase to $1 before the end of this bull run.  Related Reading: Bullish Winds Blow: Bitcoin Bull Flag Points To New $77,000 ATH: Analyst Interest In Dogecoin Set To Skyrocket With Coinbase Listing  Bitcoinist reported that the foremost US crypto exchange, Coinbase, had finalized plans to introduce the meme coin to its futures contract offerings. Coinbase’s institutional arm also recently confirmed that Coinbase Derivatives will launch the first leveraged and CFTC-regulated futures contracts for Dogecoin in April.  This means that institutional investors will have the opportunity to trade DOGE futures starting in April. This could be huge for the meme coin, considering the amount of capital this class of investors could inject into its ecosystem. As noted by Coinbase, DOGE has become more than just a meme coin and is sure to attract interest from these investors. Meanwhile, the derivatives market is known to have a massive impact on a crypto token’s price. Therefore, depending on the sentiment among these investors, DOGE’s price could experience a lot of upside volatility on its way to $1.  Bitcoin is now trading at $ 69.964. Chart: TradingView Dogecoin’s New Wallet Set To Enhance Its Utility Dogecoin Foundation recently revealed in an X (formerly Twitter) post that the Dogecoin GigaWallet v1.0 has been released. The foundation further explained that the GigaWallet “provides a convenient integration API for platforms such as online shops, exchanges, social media platforms etc, to programmatically transact Dogecoin.&#8221; The GigaWallet launch is undoubtedly significant as it could play a primary role in expanding DOGE’s adoption. An increase in the number of users could reflect positively on DOGE’s price. The wallet launch is also timely, as it comes at a time when retail investors are turning their attention again to the crypto market.  As highlighted by Crypto expert Scott Melker, DOGE was known to have attracted this category of investors in the last bull run, and developments like this could make DOGE their preferred choice once more with such accessibility. Moreover, those who couldn’t possibly invest in the meme coin then would find it much easier to do so now.  Related Reading: Dogecoin Jumps 37% – How High Can DOGE Go This April? Interestingly, GigaWallet also sets the stage for the integration of DOGE payments into the X platform. There continue to be speculations that the social media platform could include DOGE in its payment service, considering Elon Musk’s fondness for the meme coin. If that happens, Gigawallet could help make the process more seamless and enhance DOGE’s utility.  At the time of writing, DOGE was trading at around $0.21, down in the last 24 hours, according to data from CoinMarketCap.  Featured image from Pexels, chart from TradingView "
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-30T14:00:27.000Z",
    "title": "With Hedera’s UK Crypto Council Entry, Spotlight Falls on this New Shiba Inu Challenger",
    "url": "https://www.crypto-news-flash.com/with-hederas-uk-crypto-council-entry-spotlight-falls-on-this-new-shiba-inu-challenger/?utm_source=rss&utm_medium=rss&utm_campaign=with-hederas-uk-crypto-council-entry-spotlight-falls-on-this-new-shiba-inu-challenger",
    "description": "<img width=\"1200\" height=\"752\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-30T083352.700.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-30T083352.700.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-30T083352.700-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-30T083352.700-768x481.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-30T083352.700-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-30T083352.700-450x282.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />In the ever-evolving cryptocurrency landscape, strategic alliances and partnerships often dictate the trajectory of emerging projects. With Hedera&#8217;s recent entry into the United Kingdom Crypto Asset Business Council (UKCBC), attention has shifted towards innovative projects like Rebel Satoshi ($RBLZ), positioning itself as a potential challenger to established meme coins like Shiba Inu. Hedera&#8217;s UK Crypto [...]"
  }
]