[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T18:28:55.000Z",
    "title": "Nike Brings .SWOOSH to Fortnite's 240M Users With 'Airphoria' Virtual Experience",
    "url": "https://www.coindesk.com/web3/2023/06/20/nike-brings-swoosh-to-fortnites-240m-users-with-airphoria-virtual-experience/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "All Fortnite players who play this island for 10 minutes or more will receive the Air Max 1 '86 Back Bling digital sneaker."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-20T18:28:34.000Z",
    "title": "Polygon Proposes POS Chain To Become ZK Compatible",
    "url": "https://www.coindesk.com/tech/2023/06/20/polygon-proposes-pos-chain-to-become-zk-compatible/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In a pre-proposal discussion post, Polygon co-founder Mihailo Bjelic argues why the mainchain should go through a major upgrade."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-20T18:32:26.000Z",
    "title": "Fortnite's Collab With Nike's NFT Platform Doesn't Include In-Game NFTs",
    "url": "https://decrypt.co/145441/fortnites-collab-with-nikes-nft-platform-doesnt-include-in-game-nfts",
    "description": "The Nike-themed Fortnite world doesn't feature the use of in-game NFTs, but it's still tied into Nike's .Swoosh NFT user IDs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T18:30:00.000Z",
    "title": "Tether and Bitfinex pledge $100K grant for private operating system",
    "url": "https://cointelegraph.com/news/tether-and-bitfinex-pledges-100k-grant-for-private-operating-system",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3faa1c85-ba9b-49d6-a975-21e1eebeb73c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“If you’re serious about security, @QubesOS is the best OS available today,\" commented Edward Snowden in a previous tweet. </p>\n                    <p><p>On June 20, Tether Operations Limited, the firm behind United States dollar stablecoin Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), along with cryptocurrency exchange Bitfinex <a href=\"https://tether.to/en/tether-and-bitfinex-announce-public-grant-to-support-qubes-os/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the allocation of a 100,000 USDT grant to support open-source privacy operating system Qubes OS.<strong> </strong>Paolo Ardoino, chief technology officer of Tether and Bitfinex, commented: </p><blockquote>“We recognize the paramount importance of privacy and security in the digital age. We are pleased to support the development of Qubes OS, which is a cutting-edge operating system renowned for its iron clad security.\"</blockquote><p>As told by developers, Qubes OS has garnered significant recognition from Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) enthusiasts and libertarians for its security architecture and approach to protecting user privacy. The OS uses Xen-based virtualization to isolate different tasks and applications within separate virtual machines, dubbed “qubes,\" to provide additional security for applications in financial transactions, accessing sensitive information or secure communications.</p><p>In a post dated Sept. 29, 2016, American-Russian intelligence consultant and whistleblower Edward Snowden <a href=\"https://twitter.com/Snowden/status/781493632293605376\" target=\"_blank\" rel=\"noopener nofollow\">commented</a>: “If you're serious about security, @QubesOS is the best OS available today. It’s what I use, and free. Nobody does VM isolation better.\" The OS is known for isolating different software as if they were installed on separate physical machines using advanced virtualization techniques to protect privacy. According to its website:</p><blockquote>“Qubes eliminates this [security] concern by allowing us to divide a device into many compartments, much as we divide a physical building into many rooms. Better yet, it allows us to create new compartments whenever we need them, and it gives us sophisticated tools for securely managing our activities and data across these compartments.\"</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Proud to join forces with <a href=\"https://twitter.com/bitfinex?ref_src=twsrc%5Etfw\">@bitfinex</a> we&#39;re donating 100,000 USDt to support Qubes OS development. Qubes, a revolutionary free and open-source OS, enhances desktop computing security with isolated qubes. Keep up the great work, <a href=\"https://twitter.com/QubesOS?ref_src=twsrc%5Etfw\">@QubesOS</a>!<br><br>Learn more: <a href=\"https://t.co/QgaCRCKJtA\">https://t.co/QgaCRCKJtA</a> <a href=\"https://t.co/2CwHjpz58z\">pic.twitter.com/2CwHjpz58z</a></p>&mdash; Tether (@Tether_to) <a href=\"https://twitter.com/Tether_to/status/1671126730994593792?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/binance-coinbase-head-to-court-and-the-sec-labels-67-crypto-securities-hodlers-digest-june-4-10/\">Binance, Coinbase head to court, and the SEC labels 67 crypto-securities</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T18:27:25.000Z",
    "title": "Bitcoin miner Iris Energy’s shares surge 20% on expansion announcement",
    "url": "https://cryptoslate.com/bitcoin-miner-iris-energy-shares-surge-20-on-9-1-eh-s-expansion-announcement/",
    "description": "<p>Bitcoin (BTC) miner Iris Energy IREN shares have jumped by nearly 20% following news of its planned 9.1 exahashes/second (EH/s) expansion. Data from Nasdaq shows that miner shares rose to $4.09 from $3.53 during early trading hours of June 20. Expansion plans According to a July 20 press statement, Iris plans to expand its capacity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-miner-iris-energy-shares-surge-20-on-9-1-eh-s-expansion-announcement/\">Bitcoin miner Iris Energy&#8217;s shares surge 20% on expansion announcement</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T18:38:38.000Z",
    "title": "Here’s what Cristiano Ronaldo thinks of Binance CEO – CZ ",
    "url": "https://www.cryptopolitan.com/what-cristiano-ronaldo-thinks-of-binances-cz/",
    "description": "Cristiano Ronaldo is arguably one of the most influential people of our time. He has often been branded the greatest footballer of all time. In recent times, he began his NFT journey in partnership with Binance. According to recent reports, Portuguese soccer superstar Cristiano Ronaldo is not enthusiastic about the possibility of Binance CEO Changpeng ... <a title=\"Here&#8217;s what Cristiano Ronaldo thinks of Binance CEO &#8211; CZ \" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-cristiano-ronaldo-thinks-of-binances-cz/\" aria-label=\"More on Here&#8217;s what Cristiano Ronaldo thinks of Binance CEO &#8211; CZ \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T18:35:52.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T18:27:43.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T18:20:18.000Z",
    "title": "Former Binance payment partner Cuscal imposes new restrictions on Australian exchanges",
    "url": "https://www.cryptopolitan.com/cuscal-imposes-new-restrictions-on-exchanges/",
    "description": "Cuscal, an Australian payment provider that recently cut ties with Binance, has announced new banking restrictions for the remaining digital currency exchanges on its platform through its partner Zepto. Blockchain Australia, the country&#8217;s industry body, released a statement criticizing the move, adding that though it supports efforts to secure digital transactions, Australians should be able ... <a title=\"Former Binance payment partner Cuscal imposes new restrictions on Australian exchanges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cuscal-imposes-new-restrictions-on-exchanges/\" aria-label=\"More on Former Binance payment partner Cuscal imposes new restrictions on Australian exchanges\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T18:30:14.000Z",
    "title": "Cardano Poised For Consolidation In This Price Zone Prior To Attempting Reversal",
    "url": "https://www.newsbtc.com/news/cardano/cardano-poised-for-consolidation-in-this-price-zone-prior-to-attempting-reversal/",
    "description": "After losing the crucial $0.34 price support, Cardano (ADA) has experienced a significant downtrend. In the past 24 hours, ADA has declined by 1.6%. On the weekly chart, ADA has struggled to recover from an over 8% depreciation. The technical outlook indicates that bears have control of the price, with low demand and accumulation. Although ADA has started rebounding from the $0.20 level, a strong bullish influence has yet to be observed. If buying strength does not recover in the upcoming trading sessions, ADA may break below its immediate support line. The volatility of Bitcoin makes it challenging for other altcoins to stabilize their prices. Related Reading: Bitcoin Whales Continue To Accumulate As BTC Makes Recovery Push ADA&#8217;s potential to reach the $0.30 level depends on consistent demand and support from the broader market. However, even if these conditions are met, ADA may encounter strong resistance at the $0.30 price mark. The decrease in market capitalization suggests that sellers are currently dominating the ADA market. Cardano Price Analysis: One-Day Chart As of the time of writing, ADA was trading at $0.25. Since being rejected at the $0.30 level, ADA has lost several support lines. The coin currently faces overhead resistance at $0.27, and if it manages to breach this level, it may aim for a target of $0.29. If buying strength does not recover, ADA is expected to experience a consolidation phase within the range of $0.22 to $0.28 before attempting a breakout. The local support level is currently situated at $0.22. In the event of a fall from $0.22, the price may further decline to $0.20. The trading volume of ADA in the last session has declined, indicating a decrease in buying strength and overall market activity. Technical Analysis At the time of writing, ADA has struggled to regain investor confidence and show signs of recovery. The Relative Strength Index (RSI) has dipped below the 30-mark, indicating an oversold condition. This suggests that selling pressure persists and investor sentiment remains weak. Additionally, the ADA price has moved below the 20-Simple Moving Average (SMA) line, highlighting low demand and indicating that sellers are currently driving the price momentum. In terms of demand, another significant indicator has generated sell signals on the ADA chart. The Moving Average Convergence Divergence (MACD) displayed red histograms, indicating sell signals for the coin. This suggests a bearish momentum for ADA. Related Reading: XRP Price Could Regain Strength If It Clears This Resistance Additionally, the Bollinger Bands, which measure price volatility and fluctuations, showed wide bands indicating potential significant volatility for ADA in the upcoming trading sessions after it breaks out of its consolidation phase. Given these indicators, the next few trading sessions are critical for determining the direction of the Cardano price. Featured Image From UnSplash, Charts From TradingVew.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T18:35:22.000Z",
    "title": "New ICO Presale For Golden Inu Poised For  Incredible +10,000% Yields, & May Kill Dogecoin & Shiba Inu",
    "url": "https://www.crypto-news-flash.com/new-ico-presale-for-golden-inu-poised-for-incredible-10000-yields-may-kill-dogecoin-shiba-inu/?utm_source=rss&utm_medium=rss&utm_campaign=new-ico-presale-for-golden-inu-poised-for-incredible-10000-yields-may-kill-dogecoin-shiba-inu",
    "description": "Shiba Inu and Dogecoin have been at the top of the meme coin charts for some time.  Their supremacy has sustained years of errors, but for the first time their dominance may be challenged.   Lacking actual crypto products to give the $DOGE &#38; $SHIB tokens true utility, a former investor in the two has [...]"
  }
]