[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T16:23:02.000Z",
    "title": "Binance says it 'continues to serve' Belgian users via Poland entity",
    "url": "https://cointelegraph.com/news/binance-continues-serving-belgian-users-shifts-poland-entity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8b264803-390b-409e-a097-3a63b6f58a58.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In June, Belgium’s financial regulator ordered Binance to stop offering crypto exchange and custody wallet services, citing violations of the country’s AML and CFT requirements.</p>\n                    <p><p>After an order from the Belgian Financial Services and Markets Authority (FSMA), crypto exchange Binance announced its Poland entity would be providing services to residents of Belgium.</p><p>In an Aug. 28 announcement, Binance said Binance Poland sp. z o.o. — an entity the exchange <a href=\"https://cointelegraph.com/news/binance-registers-as-virtual-assets-service-provider-in-poland\">registered with Polish regulatory authorities</a> in January — would comply with “regulatory obligations” for residents of Belgium looking for services on the exchange. According to Binance, some users may need to submit documentation in accordance with Know Your Customer requirements for Poland rather than Belgium.</p><p>The announcement came roughly two months after Belgium’s financial regulator <a href=\"https://cointelegraph.com/news/belgian-financial-regulator-orders-binance-cease-virtual-currency-services\">ordered Binance to stop offering</a> crypto exchange and custody wallet services, citing violations of the country’s Anti-Money Laundering and Combating the Financing of Terrorism requirements. At the time, FSMA suggested Binance could operate in Belgium via a “legal entity governed by the law of another member state of the European Economic Area [EEA] that is duly authorized by its home member state”. The EEA includes Poland.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-to-delist-privacy-tokens-in-france-italy-spain-and-poland\"><strong><em>Binance to delist privacy tokens in France, Italy, Spain and Poland</em></strong></a></p><p>A global crypto exchange operating in many countries through various entities, Binance has had a number of regulatory entanglements since its launch. The crypto exchange halted its services for Dutch users in July, citing a failure to obtain a virtual asset service provider license. In addition, Binance, Binance.US, and Binance CEO Changpeng Zhao are <a href=\"https://cointelegraph.com/news/binance-sec-lawsuit-could-dent-crypto-exchange-s-global-plans\">facing a lawsuit</a> from the United States Securities and Exchange Commission.</p><p>The Markets in Crypto Assets legislation, a bill aimed at establishing a consistent regulatory framework for crypto assets among the European Union member states, is expected to take effect in 2024 following passage by policymakers. The framework is currently <a href=\"https://cointelegraph.com/news/esma-european-regulator-releases-consultative-paper-mica-standards-for-crypto-asset-service-providers\">moving through a consultative phase</a> for feedback on technical standards.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-28T16:25:06.000Z",
    "title": "Shibarium Resumes Ethereum Bridge Withdrawals After Botched Launch",
    "url": "https://cryptobriefing.com/shibariumupdatefinal-resumes-ethereum-bridge-withdrawals/?utm_source=feed&utm_medium=rss",
    "description": "Shibarium has successfully relaunched its Ethereum bridge, resolving user accessibility issues and releasing $2.5 million in trapped assets."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-28T16:20:45.000Z",
    "title": "Binance Finds Path Back to Belgium Via Polish Entity",
    "url": "https://cryptobriefing.com/binance-returns-to-belgium-via-polish-entity/?utm_source=feed&utm_medium=rss",
    "description": "Binance shifts its Belgian clientele to operate under its Polish unit, seeking compliance with European standards."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T16:30:00.000Z",
    "title": "\n                        Bitcoin Price Analysis:  Bears Eyeing 25363 – 29 August 2023\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bitcoin-price-analysis-bears-eyeing-25363-29-august-2023",
    "description": "\n                        <p class=\"MsoNormal\">Bitcoin Price Analysis:&nbsp; Bears Eyeing 25363 &ndash; 29 August 2023</p>\n<p class=\"MsoNormal\">Bitcoin (BTC/USD) retained a bearish bias early in the Asian session as the pair continued to plumb lows following selling pressure that intensified around the 26171.87 area after sellers emerged around the 26818.28 area, representing the 23.6% retracement of the depreciating range from 31862.21 to 25234.76.&nbsp;&nbsp; Some selling pressure reversed around the 25850 area, just above the 25842 area that represents a recent upside price objective related to buying pressure around the 25350 area.&nbsp;&nbsp; Stops are cited below the 25706, 25698, 25645, 25493, and 25363 levels, downside price objectives related to selling pressure around the 26818 and 26567 areas.&nbsp; Areas of technical support and potential buying pressure in appreciating ranges from the 15460 and 19568.52 levels include the 23661, 22793, and 21725 levels.&nbsp;&nbsp; Following recent selling pressure, areas of technical resistance and potential selling pressure include the 27139, 27728, 27766, 28316, 28548, 29154, 29330, and 30443 levels.&nbsp; </p>\n<p class=\"MsoNormal\">The recent fresh multi-month low around the 25234.76 area represented a test of a major downside price objective around the 25128.94 area that is associated with selling pressure that increased around the 31862.21 and 30421.29 levels in July.&nbsp;&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp;&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p class=\"MsoNormal\">Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 26081.67 and the&nbsp;50-bar MA&nbsp;(Hourly) at 26037.53.</p>\n<p class=\"MsoNormal\">Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p class=\"MsoNormal\">Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p class=\"MsoNormal\">On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p class=\"MsoNormal\" style=\"tab-stops: right 6.5in;\">On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>\n<p class=\"MsoNormal\" style=\"tab-stops: right 6.5in;\">Sally Ho&rsquo;s Technical AnalysisView Yesterday&rsquo;s Trading Analysis</p>\n<p class=\"MsoNormal\">Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T16:28:16.000Z",
    "title": "\n                        Supra Introduces a Cross-chain Bridgeless Technology — HyperNova — that Enables Secure Blockchain Interoperability\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/supra-introduces-a-cross-chain-bridgeless-technology-hypernova-that-enables-secure-blockchain-interoperability",
    "description": "\n                        <p>Zug, Switzerland, August 28th, 2023, Chainwire</p>\n<p>Supra, a leading blockchain organization that provides Oracle and Verifiable Random Function (VRF) services, today announced the creation of HyperNova, its new bridgeless technology that facilitates cross-chain communication directly via L1 consensus. This groundbreaking new methodology allows blockchains to connect interoperably without the need for a centralized bridge.</p>\n&ldquo;HyperNova is a major breakthrough for the blockchain industry,&rdquo; said Joshua Tobkin, CEO of Supra. &ldquo;It eliminates the need for centralized bridges, which can be a single point of failure and a major vulnerability in Web3. HyperNova&rsquo;s bridgeless technology makes blockchain connections more secure, reliable, and scalable via L1 to L1 cryptographic consensus.&rdquo;\n<p>HyperNova bridgeless technology works by using Supra&rsquo;s novel, low-latency, consensus algorithm, known as Moonshot Consensus, to understand the underlying cryptographic signatures of interacting chains. This allows Supra to provide a secure, reliable, and scalable cross-chain consensus that is strictly better than traditional bridge designs.</p>\n<p></p>\nBenefits of Supra&rsquo;s HyperNova Bridgeless Tech\n<p>Supra&rsquo;s HyperNova offers a number of benefits over traditional centralized bridges, including:</p>\n<ul>\n<li>Increased security: HyperNova eliminates the need for a centralized bridge, which can be a single point of failure. Instead, Supra directly verifies that cryptographic signatures of the source and destination chains, which provides L1 to L1 security guarantees.&nbsp;</li>\n<li>Improved scalability: Bridgeless tech is more scalable than traditional centralized bridges. This is because Supra itself is a high-throughput IntraLayer that can handle many cross-chain consensus requests simultaneously.&nbsp;</li>\n<li>Enhanced capabilities: Supra&rsquo;s HyperNova multi-chain solution enables novel cross-chain use cases that are not possible in bilateral (one-to-one) solutions.</li>\n</ul>\nUse Cases for Supra&rsquo;s HyperNova\n<p>Bridgeless tech can be used for a variety of use cases, including:</p>\n<ul>\n<li>Cross-chain DeFi: HyperNova can be used to enable cross-chain DeFi, which allows users to transfer assets and interact with DeFi applications across different blockchains.</li>\n<li>Cross-chain gaming: Bridgeless tech can be used to enable cross-chain gaming, which allows players to transfer their in-game assets or NFTs across different blockchain-based games.</li>\n<li>Cross-chain oracles: HyperNova can be used to enable cross-chain oracles, which provide secure and reliable data feeds to DeFi applications across many ecosystems.</li>\n</ul>\nAbout Supra\n<p>Supra is building a low-latency interoperability infrastructure to provide Web3 capabilities that traditional blockchain designs lack. Supra, as a vertically integrated IntraLayer&trade;, enables a shared security paradigm across a variety of oracle services. This includes securing external data on-chain, cross-chain consensus via their bridgeless HyperNova, automation, VRF, smart contract execution, and more.&nbsp;</p>\n<p>After thousands of hours of R&amp;D and simulations, Supra&rsquo;s technical breakthroughs are solving the Oracle Dilemma and optimizing network performance across the board in terms of security, throughput, time to finality, composability, and programmability. Supra has taken an academic approach to development, which has been an integral part of the organization&rsquo;s commitment to advancing Web3 performance and security. This is characterized by a commitment to deep research, transparency, and going through a rigorous peer-review process in every design and product released.</p>\n<p>Dr. Aniket Kate, inventor of KZG Commitments utilized in Ethereum L2 Data Availability solutions, and the Supra team are diligently composing new whitepapers, so there are still many novel solutions in the pipeline soon to be publicized. To learn more about Supra and participate in their gamified learn-to-earn program, visit Countdown to Blastoff. Lastly, sign up for the whitelist for an opportunity to be notified in advance of any possible future token offerings and for more alpha.&nbsp;</p>\nContact\n<p>Eli PhoenixSupramarketing@supraoracles.com</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T16:17:51.000Z",
    "title": "\n                        Staynex Announces Exclusive Partnership with Miss Grand International in Vietnam\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/staynex-announces-exclusive-partnership-with-miss-grand-international-in-vietnam",
    "description": "\n                        <p>HCMC, Vietnam, August 28th, 2023, Chainwire</p>\n<p>&nbsp;</p>\n<p>Staynex has officially announced its collaboration with the highly-acclaimed Miss Grand International in Vietnam. Spanning across major cities, this event promises to be an exhilarating fusion of culture, beauty, and hospitality.</p>\n\"Established based on the goal of 'elevating the travel-resort experience', Staynex hopes that collaborating with a global ambassador will quickly spread the unique and different experiences brought by the platform to customers worldwide.\" says Tim Duong, COO at Staynex.&nbsp;\n<p>&nbsp;</p>\nHighlights of the Partnership:\n<p>- Pan-Country Presence: The beauty pageant, renowned globally, will be hosted in major cities across Vietnam. Staynex's platform will serve as the hospitality backbone, with its affiliated hotels providing premium accommodations for pageants and organizers.</p>\n<p>- Global Representation: The event boasts of participation from many countries, celebrating the diverse tapestry of beauty and culture from every corner of the globe.</p>\n<p>- Innovative Engagement: Upping the ante in audience engagement, each contestant will be provided with a unique referral code. Their followers can utilize these codes to register for a Staynex subscription. This not only offers the followers a 12-month subscription at the price of 10 months ($10 a year or $1 a month), but they also get 2 additional months absolutely free.&nbsp;</p>\n<p>- Empowering Votes: Staynex is weaving its user acquisition drive seamlessly into the pageant process. Every successful referral and subscription through the contestant's code will be counted as one vote. This adds a fresh dynamic to the traditional voting mechanism, allowing fans to directly influence the competition's outcome while benefiting from Staynex's offerings.</p>\n<p>\"We are excited to provide a platform where fans can actively participate in the success of their favorite contestants. This initiative is not just about crowning a winner, but also about expanding the Staynex community in a meaningful and engaging manner,\" adds Tim Duong, COO at Staynex.</p>\n<p>With beauty, talent, and hospitality coming together under one banner, the Miss Grand International in Vietnam promises to be a truly grand spectacle. Staynex's partnership further cements its commitment to promoting exceptional experiences and forging community ties on a global scale.</p>\n<p>---</p>\nAbout Staynex&trade;\n<p>Staynex&trade;, operating as part of the Labs Group Ecosystem, is a global vacation club platform aiming to reshape the travel and hospitality industry. It utilizes advanced technologies like artificial intelligence and Web3 to improve individual travel experiences and streamline corporate travel bookings. Staynex&trade; is committed to continuous service enhancement and global expansion, fostering a vision of making travel more accessible, efficient, and enjoyable for everyone.</p>\n<p>---</p>\nAbout Miss Grand International\n<p>Miss Grand International (MGI) Pageant is a world-class center of creativity and entertainment, raising the level of the world&rsquo;s beauty pageant industry, creating Soft Power to be the leader in the international beauty pageant arena, and expanding branding to all over the world. Miss Grand International (MGI) is regarded as an international beauty pageant with an increasing number of followers and popularity on social media and the fastest growing beauty pageant. Miss Grand International (MGI) has now become the world&rsquo;s leading international beauty pageant and one of the 5 Gland Slam Beauty Pageants along with Miss Universe, Miss World, Miss International and Miss Supranational.</p>\n<p>For Partnerships &amp; Investing: partnerships@staynex.com</p>\nContact\n<p>CEO of Staynex&trade;Bernard Laucontact@staynex.com</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T16:37:18.000Z",
    "title": "Robinhood unveiled as third-largest Bitcoin holder with $3 billion in assets",
    "url": "https://www.cryptopolitan.com/robinhood-unveiled-as-third-largest-bitcoin-holder-with-3-billion-in-assets/",
    "description": "Robinhood, the widely-used trading and investment platform, has been identified as the third-largest holder of Bitcoin, boasting about $3 billion in BTC assets. The revelation comes from wallet data provided by Arkham Intelligence and places Robinhood behind only Binance and Bitfinex, which hold $6.4 billion and $4.3 billion in Bitcoin, respectively. For months, the crypto ... <a title=\"Robinhood unveiled as third-largest Bitcoin holder with $3 billion in assets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robinhood-unveiled-as-third-largest-bitcoin-holder-with-3-billion-in-assets/\" aria-label=\"More on Robinhood unveiled as third-largest Bitcoin holder with $3 billion in assets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T16:31:35.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-28T16:33:32.000Z",
    "title": "Ceffu Launches Newest Off-Exchange Settlement Solution MirrorX for Binance Institutional Users",
    "url": "https://dailyhodl.com/2023/08/28/ceffu-launches-newest-off-exchange-settlement-solution-mirrorx-for-binance-institutional-users/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Ceffu-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Ceffu-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/08/Ceffu-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/08/Ceffu-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Ceffu-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/08/Ceffu-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>August 28, 2023 – Vilnus, Lithuania Ceffu, the institutional crypto custodian and partner of Binance – the world’s largest cryptocurrency exchange by trading volume – announced today the release of its newest off-exchange settlement solution, MirrorX. Launched as an evolution of its predecessor, this innovative custody solution provides institutional investors with the fastest gateway to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/28/ceffu-launches-newest-off-exchange-settlement-solution-mirrorx-for-binance-institutional-users/\">Ceffu Launches Newest Off-Exchange Settlement Solution MirrorX for Binance Institutional Users</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]