[
  {
    "source": "Bitcoin.com",
    "date": "2023-05-28T10:00:41.000Z",
    "title": "Blockchain-Based Re-Usable KYC ‘Particularly Valuable in Web3’ — Cheqd CEO Fraser Edward",
    "url": "https://news.bitcoin.com/blockchain-based-re-usable-kyc-particularly-valuable-in-web3-cheqd-ceo-fraser-edward/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blockchain-Based Re-Usable KYC &#039;Particularly Valuable in Web3&#039; — Cheqd CEO Fraser Edward\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/cheqdddddd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Fraser Edward, the CEO and co-founder of the public permissionless network, Cheqd, one of the main hurdles faced when attempting to move data stored on Web2 servers to Web3 is &#8220;establishing a clear and scalable revenue model.&#8221; Edward however suggested overcoming this hurdle will unlock new use cases which facilitate economic activities within [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-28T09:50:23.000Z",
    "title": "Sui (SUI) Continues Downward Trend As Bears Maintain Control",
    "url": "https://www.newsbtc.com/altcoin/sui-sui-continues-downward-trend-as-bears-maintain-control/",
    "description": "The crypto market once again experienced a sell-off this week, leading to a plunge in the price of many crypto assets. The impact of this market downturn is not limited to Bitcoin alone, as it has affected various cryptocurrencies, including Sui (SUI), a Layer 1 smart contract platform. Sui has witnessed a significant decline of 15% in its value over the past seven days, reflecting the broader negative sentiment prevailing in the market. Sui Dips Below $1 Support Levels SUI experienced a significant setback this week, breaching its crucial support level at $1. This support had been maintained since early May, providing stability for the token during that period. However, after enduring two weeks of downward-sloping resistance from above, SUI finally succumbed to selling pressure. Related Reading: Shiba Inu Burn Rate Surges 1500% In 24 Hours, Yet Price Continues To Struggle In Red The token&#8217;s decline reached a low point of $0.95 on Wednesday, marking an all-time low for SUI since its launch at the beginning of the month. This sharp drop highlights the prevailing bearish sentiment surrounding the token and its challenges in the current market conditions. Technical Indicators Point To Potential Bearish Path Sui, a layer 1 smart contract platform, distinguishes itself with its unique programming language called &#8216;Move.&#8217; Developed by the lead executives of Meta&#8217;s now-defunct Diem stablecoin project, Sui aims to address common pain points of first-generation blockchains, such as scalability and programmability. Despite its innovative approach, Sui has struggled to generate substantial gains since its inception in the trading market. In the short term, the coin may continue to experience lower lows. According to technical analysis on TradingView, the current conditions indicate that asset selling might be prudent. Seven of the 11 daily technical indicators are signaling a &#8216;strong sell,&#8217; with no indicators displaying buy signals. Related Reading: Aptos Hackathon, Partnerships Set APT Bulls Up For A Strong Run Additionally, the relative strength index (RSI) for SUI is currently hovering slightly above 40. With the RSI above 40, it suggests that there is a moderate level of buying pressure, but the overall sentiment remains uncertain. To counteract this bearish trend, Sui would need to reclaim the $1.05 level as support, which could provide a foothold for potential recovery. However, if Bitcoin fails to maintain its support at $26,000, Sui will likely face further downward pressure, potentially sinking as low as $0.90. Given the current market conditions and technical indicators, investors and traders should exercise caution and closely monitor Sui&#8217;s performance. Evaluating factors such as market sentiment, trading volume, and overall market dynamics will be crucial in determining the future trajectory of Sui and whether it can reverse its bearish trend. At press time, SUI price was $0.987 $ with a 24-hour trading volume of $89,278,135 USD. -Featured image from iStock, charts from CoinMarket and TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-28T09:55:00.000Z",
    "title": "BTC’s Network Activity Has Started Recovering From Its May Lows",
    "url": "https://coinedition.com/btcs-network-activity-has-started-recovering-from-its-may-lows/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC’s Network Activity Has Started Recovering From Its May Lows\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/BTCs-Network-Activity-Has-Started-Recovering-From-Its-May-Lows.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Santiment recently tweeted that the number of active addresses for BTC has climbed back to 960K. BTC was able to flip the key resistance level at $26,960 into support over the past 24 hours. Technical indicators suggested that BTC’s price would break above $27,480 in the next 24-48 hours. Address activity for Bitcoin (BTC) has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btcs-network-activity-has-started-recovering-from-its-may-lows/\">BTC’s Network Activity Has Started Recovering From Its May Lows</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]