[
  {
    "source": "CoinDesk",
    "date": "2023-07-17T16:55:34.000Z",
    "title": "Ron DeSantis Promises to Ban CBDCs if Elected President",
    "url": "https://www.coindesk.com/policy/2023/07/17/ron-desantis-promises-to-ban-cbdcs-if-elected-president/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "DeSantis in March signed a bill as Florida’s governor to prohibit the use of CBDC’s within his state."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-17T16:55:04.000Z",
    "title": "Binance Slashes Worker Benefits as Profit Falls: WSJ",
    "url": "https://www.coindesk.com/business/2023/07/17/binance-slashes-worker-benefits-as-profit-falls-wsj/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance has stopped offering certain benefits to its employees on June 19 as the company’s profits continue to decline, according to former employees and internal company messages viewed by the Wall Street Journal."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T16:55:37.000Z",
    "title": "Ripple eyes US bank partnerships following SEC victory, as XRP volume surpasses Bitcoin",
    "url": "https://cryptoslate.com/ripple-eyes-us-bank-partnerships-following-sec-ruling-victory/",
    "description": "<p>Ripple&#8217;s (XRP) general counsel, Stuart Alderoty, has voiced optimism that Ripple&#8217;s recent partial victory against the U.S. Securities and Exchange Commission (SEC) might encourage U.S. banks and other financial institutions to consider adopting XRP, according to a July 17 CNBC report. &#8220;I think we’re hopeful that this decision would give financial institution customers or potential [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ripple-eyes-us-bank-partnerships-following-sec-ruling-victory/\">Ripple eyes US bank partnerships following SEC victory, as XRP volume surpasses Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-17T16:53:24.000Z",
    "title": "Bitcoin’s 2024 Halving: Market Catalyst or Mining Consolidation",
    "url": "https://cryptobriefing.com/bitcoins-2024-halving-market-catalyst/?utm_source=feed&utm_medium=rss",
    "description": "In a matter of months, the world of Bitcoin and digital currencies will be experiencing another historic event  the fourth Bitcoin Halving expected in April 2024. This moment of..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T17:00:00.000Z",
    "title": "Private token sale for funds and partners from Autentic",
    "url": "https://cryptodaily.co.uk/2023/07/private-token-sale-for-funds-and-partners-from-autentic",
    "description": "<p>Autentic, the ecosystem of digital financial assets, has announced its native token AUt presale for institutional and private funds, partners, and investment companies. It is scheduled for September 1st and will last only a few weeks. During this period, major investors will have the opportunity to buy AUt at a special price of $0.20.</p>\n\n<p>\"At the initial token sale stage, we focus on large institutional and private investors, as well as on our partners who have supported the project development. They will get special purchase terms with a minimum vesting period of 9 months. We also limit the average trade within $3,000 and the number of presale participants,&rdquo; stated the company.</p>\n\n<p>In total, Autentic plans to issue 100 million AUt, which will be used as an internal settlement for accessing platform services, paying fees, and serving as an investment instrument. The company will launch a Savings feature in the fall, providing the opportunity to earn up to 25% APY. Other benefits the company provides to its investors: predictable investment returns, 24/7 trading, low fees, and full decentralization without regulatory pressure.</p>\n\n<p>&ldquo;By the end of this year we plan to launch Autentic Pay payment system, Autentic Capital platform for Security Token Offerings (STO) and initial asset offerings, Autentic Market - a marketplace for digital assets. In 2024, the company will list AUt on centralized cryptocurrency exchanges and launch decentralized platform Block DEX &nbsp;for secondary asset trading,&rdquo; shared the company.</p>\n\n<p>In the near future, the release of the following digital assets will be available to users:</p>\n<p>Autentic DAO token (ADT), EIP-20 token that essentially serves as a match to company shares. It grants holders the right to receive distributed profits from &nbsp;ecosystem activities and participate in decision-making processes that determine the overall direction of the company development. A total of 2.5 million ADT tokens will be released. But there will be no public sale for these tokens.</p>\n<p>AUtentic Gold (AuG), EIP-20 token - a digitized version of real gold, pegged to the precious metal quotes on Shanghai Stock Exchange. Token holders can have the opportunity to get gold bars from 1000 grams at the offices of partner banks.</p>\nCurrency tokens\n<p>Within the Autentic ecosystem, currency tokens of BRICS, SCO, and EAEU countries will be released following EIP-20 standard. These tokens will reflect the amount of fiat currency held in Autentic bank accounts in various currency locations. These tokens will be released at 1:1 ratio based on Proof of Reserves (PoR) consensus, combined with financial audits that serve as a proof of financial funds corresponding to the number of issued tokens in Autentic accounts. Currency tokens will be utilized as key components in creating smart contracts within Autentic ecosystem. They will serve for internal accounting, calculation and investment in the system, facilitating fund transfers and payment procedures via Autentic PAY. Deposit, withdrawal, exchange and redemption of currency tokens for real funds will be made via smart contracts.</p>\nThe ecosystem will also include:\n<p>Autentic DAO, decentralized autonomous organization (DAO), where participants can vote for particular decision-making, ecosystem development and receive distributed profits from company activities.</p>\n<p>Autentic Capital, platform for initial listing of crypto assets, equity raising for issuing companies in Autentic platform, investing in promising projects and businesses.</p>\n<p>Autentic Market, marketplace for real digitized goods and services that can be purchased using currency and metal tokens like RUR.s, CNY.s, SAR.s, AuG, or any other currency tokens representing BRICS, SCO, and EAEU countries available on the platform.</p>\n<p>Autentic PAY, blockchain payment system, designed for fund transferring and without fee transactions, using any cryptocurrencies, approved for circulation within Autentic ecosystem, as well as issued currency tokens based on Proof of Reserves (PoR) protocol and pegged to real fiat currencies held in company accounts.</p>\n<p>Autentic ID, unique system for verifying transactions and confirming identity with the built-in rating system based on SoulBound technology.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T16:49:48.000Z",
    "title": "LFG Market Integrates Portal to Offer Trustless Cross-chain Ordinals Trading",
    "url": "https://cryptodaily.co.uk/2023/07/lfg-market-integrates-portal-to-offer-trustless-cross-chain-ordinals-trading",
    "description": "<p>San Francisco, US, July 17th, 2023, Chainwire</p><p>Portal, a self-hosted wallet and true cross-chain Layer-2 DEX built on Bitcoin, is thrilled to announce that LFG Market, a marketplace for Ordinal NFTs and Bitcoin-based BRC-20 tokens, has chosen to integrate the Portal DEX protocol to offer users cross-chain trading of Ordinals and BRC-20 tokens. The integration of Portal DEX will make cross-chain transactions between Bitcoin and other digital assets fast, secure, and private.&nbsp;</p><p>With this, LFG users will be able to purchase the Ordinal NFTs and BRC-20 tokens using assets from other chains such as Ethereum without bridges or custodians. Utilizing Portal&rsquo;s &ldquo;cross-chain Atomic Swaps&rdquo; technology for payments in any NFT marketplace is a monumental &ldquo;first&rdquo; in the NFT ecosystem.</p><p>&ldquo;LFG is looking for solutions that allow ETH and other NFT collectors seamless access to Ordinal trading, and we found Portal to be the best solution available. So it makes total sense to integrate Portal&rsquo;s DEX protocol,&rdquo; said LFG Market Co-founder Jason Rosenstein.&nbsp;</p><p>The creation of Ordinal inscriptions on the Bitcoin blockchain has led to over $210 million in Ordinals trading volume, according to the latest quarterly report by DappRadar. With DEXes gaining a stronger foothold in the crypto industry, the interest in NFTs on Bitcoin is only expected to shoot up in the future. According to Nansen, 4% of the US population owns an NFT; but it was almost non-existent on Bitcoin until the Ordinals revolution in 2023.</p><p>For Ordinals to truly take off as the value layer for data and information, cross-chain solutions are needed to bring the much bigger non-Bitcoin NFT audiences from across the blockchain space to access Bitcoin Ordinals with security and trust-minimization. Whether it&rsquo;s Eth NFT fans or Solana NFT fans, there still is no ability to exchange their treasured NFTs in a trust-minimized way across chains. &ldquo;Bridge&rdquo; solutions and wrappers are cumbersome, often custodial, and highly vulnerable to security threats.</p><p>Portal&rsquo;s &ldquo;cross-chain Atomic Swaps&rdquo; functionality being built into LFG Market and other DEXes allows for stablecoin payments &ndash; that today only exist on EVM-compatible chains &ndash; seamless access to Bitcoin BRC-20 and Ordinal purchases.</p><p>While the LFG Market currently accepts payments only in BTC, other tokens such as ETH, USDC, USDT, and even tokens on Layer 2 EVMs like Arbitrum and others will be accepted after integrating the Portal DEX protocol. Since Portal&rsquo;s Atomic Swaps operate at Layer 2 without bridging, it is both the safest and least-expensive way to trade cross-chain. Portal is working on supporting as many compatible blockchains, wallets, and DeFi apps as possible.</p><p>Portal CEO Chandra Duggirala said, &ldquo;Based on our research, we know that marketplace and DEX operators value UX and liquidity. We've worked tirelessly to ensure that our infrastructure integrates smoothly with their existing setups, minimizing engineering overhead, while cross-chain liquidity aggregation helps them increase volumes and offer more assets and features to their users.&rdquo;</p><p>Portal believes that blockchains are &ldquo;specialized&rdquo; and that each chain is optimized to do one thing, at the expense of other tradeoffs. Bitcoin is purpose-designed to be sound, peer-to-peer money with superior censorship resistance. Ethereum, on the other hand, was designed for composable utility. By enabling seamless swapping of assets between incompatible chains, Portal helps aggregate liquidity across many chains, ending the fragmentation problem, and helping marketplaces like LFG and others grow their user bases and value propositions.&nbsp;</p><p></p>About LFG Market<p>LFG&rsquo;s mission is to create a platform that simplifies and enhances the trading process of Ordinals and BRC-20 tokens. LFG is a seamless and efficient trading environment that enriches the digital asset ecosystem and facilitates novel financial interactions on top of Bitcoin.</p><p>For further information, visit: Website&nbsp;|&nbsp;Twitter&nbsp;|&nbsp;Discord</p><p></p>About Portal<p>Portal is building the cross-chain DEX protocol and ecosystem tools to help DEXes and users seamlessly own, exchange and contract across blockchains while minimizing custodial risk. With Portal, DeFi becomes a service that anyone can provide, maintaining anonymity within open, transparent markets with a security model as robust as Bitcoin mining.&nbsp;</p><p>For media inquiries, please contact: press@portaldefi.com</p><p>For further information, visit: Website&nbsp;|&nbsp;Twitter&nbsp;|&nbsp;Telegram</p>ContactCEOChandra DuggiralaPortalhello@portaldefi.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T16:47:07.000Z",
    "title": "The altcoins that moved today",
    "url": "https://cryptodaily.co.uk/2023/07/the-altcoins-that-moved-today",
    "description": "<p>With bitcoin flat and slightly down on the day, the same could be said of the altcoins, with the exception of just a few.</p>\nA flat bitcoin\n<p>Bitcoin remains in its sideways accumulation as it has done for the last three days. The market is waiting for that next big move, and whether this is to the upside or the downside is still to be decided.</p>\n<p>The fact that the king of the cryptocurrencies made another higher high is all to the good, and even if there is a dip to $28,000 or thereabouts a higher low will have easily been put in.</p>\nOthers.D\n<p>The high end of the crypto market has had a flat day so far, but this is not the case for certain altcoins lower down. The Others.Dominance chart is the market cap of cryptos excluding the top ten cryptocurrencies.&nbsp;</p>\n<p>This chart is 13.3% up for the day so far compared with slightly negative percentages for other Total market caps. So with such a good move to the upside for this section of the market, which were the alts that made the most percentage gains?</p>\n$SUSHI\n<p>Sushi ($SUSHI), one of the main competitors to Uniswap, has put on 11.9% thus far. A double bottom looks to have been found at $0.48, and today&rsquo;s rise to $0.76 has met $0.80 but has since returned to hopefully flip resistance into support at $0.76.</p>\n$CELO\n<p>Celo ($CELO), the mobile, carbon negative, EVM-compatible blockchain ecosystem has also risen just over 11% up to now. The decent move upwards here is probably due to the announcement that Celo devs will migrate the blockchain from a layer1 to a layer2-based on OP stack, improving security and bringing more use cases to ethereum.</p>\n<p>Celo has found its own double bottom which fell as far as $0.34. An uptrend has still not formed, but a range between $0.41 and $0.91 is currently being adhered to.</p>\n$1INCH\n<p>1inch ($1INCH), another decentralised swaps exchange like Sushi and Uniswap, was perhaps the biggest mover of the day, reaching $0.59, which equated to a 36.8% rise before retracing nearly all of those gains back down at $0.43. This surge came on the back of a 29% growth over the previous two days, so perhaps traders decided to take profits on this one.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T16:59:57.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T16:59:43.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T16:56:30.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T16:49:42.000Z",
    "title": "LFG Market Integrates Portal to Offer Trustless Cross-chain Ordinals Trading",
    "url": "https://www.cryptopolitan.com/lfg-market-integrates-portal-to-offer-trustless-cross-chain-ordinals-trading/",
    "description": "San Francisco, US, July 17th, 2023, Chainwire Portal, a self-hosted wallet and true cross-chain Layer-2 DEX built on Bitcoin, is thrilled to announce that LFG Market, a marketplace for Ordinal NFTs and Bitcoin-based BRC-20 tokens, has chosen to integrate the Portal DEX protocol to offer users cross-chain trading of Ordinals and BRC-20 tokens. The integration ... <a title=\"LFG Market Integrates Portal to Offer Trustless Cross-chain Ordinals Trading\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lfg-market-integrates-portal-to-offer-trustless-cross-chain-ordinals-trading/\" aria-label=\"More on LFG Market Integrates Portal to Offer Trustless Cross-chain Ordinals Trading\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T16:48:38.000Z",
    "title": "Modular Agents Boost AI Learning, Enhancing Decision-Making and Adaptability",
    "url": "https://www.cryptopolitan.com/modular-agents-boost-ai-learning/",
    "description": "Understanding how and why humans make decisions has been extensively studied across various disciplines. Researchers at the Princeton Neuroscience Institute have explored decision-making in machine learning and proposed an approach that improves upon traditional single-agent processes. Their study demonstrates enhanced AI learning capabilities and adaptability by utilizing modular multi-AI agent systems. The researchers conducted a ... <a title=\"Modular Agents Boost AI Learning, Enhancing Decision-Making and Adaptability\" class=\"read-more\" href=\"https://www.cryptopolitan.com/modular-agents-boost-ai-learning/\" aria-label=\"More on Modular Agents Boost AI Learning, Enhancing Decision-Making and Adaptability\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-17T17:01:22.000Z",
    "title": "Solana Price Bullish, will SOL Surpass $40? Analysts Forecasts 8,000% Rally for Tradecurve",
    "url": "https://nulltx.com/solana-price-bullish-will-sol-surpass-40-analysts-forecasts-8000-rally-for-tradecurve/",
    "description": "The crypto space is consistently evolving, and projects aim to be at the forefront. Recently, Solana (SOL) has experienced a price recovery, showing the potential to surpass $40. On the other hand, Tradecurve has recently introduced features that can completely reshape how traders interact in the trading market. That’s why analysts have forecasted a rally [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T17:02:59.000Z",
    "title": "Revving Up the Crypto Frenzy: Gear Up for Ripple’s XRP, Polygon’s MATIC, and Chainlink’s LINK in the Epic Rally Ahead",
    "url": "https://www.crypto-news-flash.com/revving-up-the-crypto-frenzy-gear-up-for-ripples-xrp-polygons-matic-and-chainlinks-link-in-the-epic-rally-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=revving-up-the-crypto-frenzy-gear-up-for-ripples-xrp-polygons-matic-and-chainlinks-link-in-the-epic-rally-ahead",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The positive XRP ruling may stir a massive upside for the coin in the long term per Michaël van de Poppe. The top analyst also foresees upside for MATIC and LINK. Renowned analyst Michaël van de Poppe has given an epic bullish projection for certain altcoins including Ripple&#8217;s XRP, Polygon (MATIC) and Chainlink (LINK). Speaking [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T17:00:52.000Z",
    "title": "Missed Pepe Coin Early Days? DigiToads Offers Exciting Opportunities for Investors",
    "url": "https://www.crypto-news-flash.com/missed-pepe-coin-early-days-digitoads-offers-exciting-opportunities-for-investors/?utm_source=rss&utm_medium=rss&utm_campaign=missed-pepe-coin-early-days-digitoads-offers-exciting-opportunities-for-investors",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T173123.014.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T173123.014.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T173123.014-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T173123.014-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto markets received a boost in 2023 after a period of slump. High-interest rates within many economies caused these slumps, which have cooled and pushed budding projects like Pepe and DigiToads. In its infancy, PEPE went for a paltry $0.000000001. As of this writing, the project is worth billions. While the figures are mouthwatering, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T16:50:00.000Z",
    "title": "LFG Market Integrates Portal to Offer Trustless Cross-chain Ordinals Trading",
    "url": "https://www.crypto-news-flash.com/lfg-market-integrates-portal-to-offer-trustless-cross-chain-ordinals-trading/?utm_source=rss&utm_medium=rss&utm_campaign=lfg-market-integrates-portal-to-offer-trustless-cross-chain-ordinals-trading",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Hero_Image_-_LFG_Integration_PR_2_-_1200x720_1689611787lB1OQHMyxb.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Hero_Image_-_LFG_Integration_PR_2_-_1200x720_1689611787lB1OQHMyxb.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Hero_Image_-_LFG_Integration_PR_2_-_1200x720_1689611787lB1OQHMyxb-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Hero_Image_-_LFG_Integration_PR_2_-_1200x720_1689611787lB1OQHMyxb-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Hero_Image_-_LFG_Integration_PR_2_-_1200x720_1689611787lB1OQHMyxb-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />San Francisco, US, July 17th, 2023, Chainwire Portal, a self-hosted wallet and true cross-chain Layer-2 DEX built on Bitcoin, is thrilled to announce that LFG Market, a marketplace for Ordinal NFTs and Bitcoin-based BRC-20 tokens, has chosen to integrate the Portal DEX protocol to offer users cross-chain trading of Ordinals and BRC-20 tokens. The integration [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T16:49:58.000Z",
    "title": "TerraUSD Classic (USTC) Rallies as Investors Hope for Re-Pegging to $1",
    "url": "https://www.crypto-news-flash.com/terrausd-classic-ustc-rallies-as-investors-hope-for-re-pegging-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=terrausd-classic-ustc-rallies-as-investors-hope-for-re-pegging-to-1",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T172744.646.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T172744.646.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T172744.646-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T172744.646-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />TerraUSD Classic (USTC) and Terra Classic (LUNC) record a significant surge in the last 24 hours in an attempt to retest $1. The community in support of Binance is also working to burn a portion of the asset to boost its values.  TerraUSD Classic (USTC) has gained traction with an incredible surge in the last [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-17T16:55:29.000Z",
    "title": "CBDCs Will Be Nixed on ‘Day One’ of Ron DeSantis’ First Term, According to Presidential Candidate",
    "url": "https://dailyhodl.com/2023/07/17/cbdcs-will-be-nixed-on-day-one-of-ron-desantis-first-term-according-to-presidential-candidate/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Global-CBDC-That-Surveils.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Florida Governor Ron DeSantis says that the agenda to bring in a central bank digital currency (CBDC) will be nixed on his first day in office if he is to be elected president. In a discussion with popular news personality Tucker Carlson at the Family Leadership Summit, DeSantis says that he&#8217;s expecting the Federal Reserve [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/17/cbdcs-will-be-nixed-on-day-one-of-ron-desantis-first-term-according-to-presidential-candidate/\">CBDCs Will Be Nixed on ‘Day One’ of Ron DeSantis’ First Term, According to Presidential Candidate</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-17T16:47:23.000Z",
    "title": "Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing",
    "url": "https://dailyhodl.com/2023/07/17/kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Kalima-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Kalima-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/07/Kalima-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/07/Kalima-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Kalima-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/07/Kalima-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 17, 2023 – Dubai, United Arab Emirates Delegated proof-of-stake blockchain Kalima has entered into an agreement with ABO Digital, a private alternative funding group based in the Bahamas and Dubai. This significant partnership involves a commitment of $10 million into the French-based blockchain company. Kalima has also released details of its KLX token sale. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/17/kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing/\">Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]