[
  {
    "source": "Decrypt",
    "date": "2023-09-27T22:15:04.000Z",
    "title": "Is a Tokenized Pokémon Card a Security? SEC Chair Gary Gensler Responds—Kinda",
    "url": "https://decrypt.co/199009/tokenized-pokemon-card-security-sec-chair-gary-gensler-responds-kinda",
    "description": "U.S. Representative Ritchie Torres questioned Gensler, using Pokémon cards as an example—and told Decrypt the SEC Chair's responses were \"incoherent.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T22:30:53.000Z",
    "title": "Curve (CRV) Is Up 20%, But This Whale May End The Run",
    "url": "https://www.newsbtc.com/altcoin/curve-crv-up-20-but-whale-may-end-run/",
    "description": "Curve has observed gains of more than 20% in the past week, but this rally may not continue for long, as a whale has made a large move to exchanges. Curve Has Enjoyed A Sharp Rally Over The Past Week CRV has gone against the grain recently as it has registered some sharp bullish momentum during a period where the largest coins in the sector, like Bitcoin and Ethereum, have struggled. Following this latest uptrend, the Curve DAO token&#8217;s price has risen above the $0.52 mark. Here is a chart that shows how the cryptocurrency has performed over the past month: Looks like the value of the coin has significantly gone up in recent days &#124; Source: CRVUSD on TradingView In the past week, CRV is up more than 20%, which makes it the best-performing coin among the top 100 cryptocurrencies by market cap. The outperformance is by quite a distance, too, as many of the assets are in the red for the period. Now, the main question on the minds of the Curve DAO token holders is: can the asset keep up its rally? In the sharp surge a few days back, the asset had briefly managed to breach the $0.56 level, but the asset had quickly returned to the current level. Related Reading: Bitcoin Mining Now Most Sustainably-Powered Global Industry: Data Since then, CRV has been moving sideways, suggesting a slowdown in the buying pressure. While the asset has continued to hold at the current levels positive, some investors may be becoming restless, like a certain whale. CRV Whale Has Made A Sizeable Deposit To Binance Today According to data from the cryptocurrency transaction tracker service Whale Alert, a large CRV transfer has been spotted on the Ethereum blockchain during the past day. The transaction in question involved the movement of about 33.3 million CRVs, worth approximately $17.3 million at the time the transfer took place on the network. Given the large size of the move, it&#8217;s likely that a whale entity is behind it. As for what this humongous holder may have wanted to accomplish with the transfer, the full details may reveal some context. This massive transfer appears to have only needed a fee of $0.56 to go through &#124; Source: Whale Alert It would seem like the sending address in the case of this transaction was an unknown wallet, meaning that it was unattached to any known centralized platform and was likely the whale&#8217;s personal, self-custodial wallet. Related Reading: Bitcoin Mega Whales Return To Selling Mode, More Downside Soon? The destination of the move was the Binance exchange. As one of the main reasons investors use these platforms is for selling-related purposes, there is a chance that the deposit has been made for dumping. If this is truly the whale losing patience and taking profits at the current price level, then the Curve DAO token may observe at least a temporary pullback in the coming days. Featured image from Todd Cravens on Unsplash.com, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T22:33:00.000Z",
    "title": "BNB Bulls Surge as Binance CEO Sparks 25% Trading Discount Frenzy",
    "url": "https://coinedition.com/bnb-bulls-surge-as-binance-ceo-sparks-25-trading-discount-frenzy/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/BNB-Chain-Third-Quarter-Report.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BNB Bulls Surge\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/BNB-Chain-Third-Quarter-Report.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/BNB-Chain-Third-Quarter-Report-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/BNB-Chain-Third-Quarter-Report-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/BNB-Chain-Third-Quarter-Report-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/BNB-Chain-Third-Quarter-Report-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish momentum has returned to the BNB market after a prolonged bear run that lowered the price below a support level of $210.88. This bullish momentum is attributed to Binance&#8217;s CEO Changpeng Zhao&#8217;s assertion that holders of Binance&#8217;s native token, BNB, would benefit from a 25% trading discount on CommEX after Binance&#8217;s total withdrawal from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bnb-bulls-surge-as-binance-ceo-sparks-25-trading-discount-frenzy/\">BNB Bulls Surge as Binance CEO Sparks 25% Trading Discount Frenzy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]