[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T03:04:40.000Z",
    "title": "Munich Forum Spotlight – Drone Warfare and AI Risks Top the Agenda",
    "url": "https://www.cryptopolitan.com/munich-drone-warfare-and-ai-risks-agenda/",
    "description": "The intersection of drone warfare and AI risks took center stage at the annual Munich Security Conference, as world leaders and military experts gathered to address pressing global security concerns. Amidst discussions on Ukraine&#8217;s utilization of drones to counter Russian aggression, the potential risks associated with advancements in artificial intelligence emerged as a prominent talking [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-19T03:06:49.000Z",
    "title": "FTX, Alameda allegedly schemed to cash in on Tether: lawsuit",
    "url": "https://crypto.news/ftx-alameda-deltec-bank-scheme-cash-in-tether-lawsuit/",
    "description": "FTX's legal drama continues with a new lawsuit, alleging how the firm secretly created and sold Tether stablecoins as part of a profit-making scam. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T03:05:23.000Z",
    "title": "Bitcoin Price Rally In Jeopardy? Decoding Key Hurdles To More Upsides",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rally-52800/",
    "description": "Bitcoin price is attempting a fresh increase above the $52,000 resistance. BTC must clear the $52,800 resistance to continue higher in the near term. Bitcoin price is gaining pace above the $52,800 resistance zone. The price is trading above $52,000 and the 100 hourly Simple moving average. There was a break above a key bearish trend line with resistance at $51,880 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move up if it clears the $52,800 resistance zone. Bitcoin Price Eyes More Gains Bitcoin price started a downside correction from the $52,800 resistance zone. BTC corrected lower below the $52,000 and $51,500 levels. However, the bulls were active above the $50,500 zone. A low was formed near $50,581 and the price is now attempting a fresh increase. There was a move above the $51,200 and $51,500 resistance levels. The price cleared the 50% Fib retracement level of the downward move from the $52,843 swing high to the $50,581 low. Besides, there was a break above a key bearish trend line with resistance at $51,880 on the hourly chart of the BTC/USD pair. Bitcoin is now trading above $52,000 and the 100 hourly Simple moving average. Source: BTCUSD on TradingView.com Immediate resistance is near the $52,300 level. It is near the 76.4% Fib retracement level of the downward move from the $52,843 swing high to the $50,581 low. The next key resistance could be $52,800, above which the price could extend its rally. The next stop for the bulls may perhaps be $53,200. A clear move above the $53,200 resistance could send the price toward the $54,000 resistance. The next resistance could be near the $55,000 level. Another Decline In BTC? If Bitcoin fails to rise above the $52,300 resistance zone, it could start another downside correction in the near term. Immediate support on the downside is near the $51,850 level and the trend line. The first major support is $51,300. If there is a close below $51,300, the price could gain bearish momentum. In the stated case, the price could decline toward the $50,500 support zone. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $51,850, followed by $51,300. Major Resistance Levels – $52,300, $52,800, and $54,000."
  }
]