[
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T03:22:02.000Z",
    "title": " Marathon Digital revenue surges 452% in Q4 amid ‘banner year’ ",
    "url": "https://cointelegraph.com/news/marathon-digital-bitcoin-mining-revenue-surges-results-q4-earnings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzMyNDM5M2UtY2JiMi00MzQ2LWEyNTctNmJhNGJlNjY3ZTYzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Company stock dipped slightly despite the bumper earnings report, though MARA has gained 300% over the past 12 months.</p>\n                    <p><p>United States Bitcoin mining giant Marathon Digital saw revenues surge in 2023 as it swung to a profit, however, company stock dipped following the release of its fourth-quarterly revenue report. </p><p>Marathon Digital released its fourth-quarter and annual earnings <a href=\"https://ir.mara.com/news-events/press-releases/detail/1345/marathon-digital-holdings-reports-fourth-quarter-and-fiscal\" target=\"_blank\" rel=\"noopener nofollow\">report</a> on Feb. 28, revealing that the firm made a record $387.5 million in revenue in 2023, increasing 229% from the previous year.</p><p>“2023 was a record-breaking year for Marathon, during which we achieved our primary objectives of energizing our fleet of previously purchased mining rigs and optimizing our performance,” said Marathon CEO Fred Thiel.</p><p><a href=\"https://cointelegraph.com/news/marathon-digital-bitcoin-mining-revenue-surges-results-q4-earnings\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T03:13:52.000Z",
    "title": "Is Baidu’s Profit Drop a Reflection of the High Costs of AI Development?",
    "url": "https://www.cryptopolitan.com/baidus-profit-drop-high-costs-ai-development/",
    "description": "In a stark revelation of the challenges inherent in navigating the rapidly evolving tech landscape, Baidu Inc. reported a staggering 48% plunge in profit in its latest quarterly results. This downturn, which outpaced initial projections, underscores the formidable costs associated with advancing artificial intelligence technologies in a bid to stay ahead in the competitive arena [&#8230;]"
  }
]