[
  {
    "source": "Decrypt",
    "date": "2023-06-08T12:59:02.000Z",
    "title": "You Can Earn Bitcoin for Using This Twitter Alternative",
    "url": "https://decrypt.co/143776/you-can-earn-bitcoin-for-using-social-media-zebedee-app",
    "description": "\"Say goodbye to meaningless likes and embrace the opportunity to earn money for your online contributions,\" said Zebedee co-founder Andre Neves. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:03:00.000Z",
    "title": "HyperPlay raises $12M in Series A funding round",
    "url": "https://cointelegraph.com/news/hyperplay-raises-in-series-a-funding-round",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/008012cd-8c78-4e6c-a6fe-0719c554fbf0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Griffin Gaming Partners and Bitkraft co-lead investors in a $12 million Series A funding round for MetaMask and Game7’s HyperPlay.</p>\n                    <p><p>On June 8, HyperPlay — a Web3-native game launcher — said it closed its Series A funding round after raising $12 million from investors, including co-leaders Griffin Gaming Partners and Bitkraft Ventures. </p><p>Other investors include MetaMask’s parent company ConsenSys, Ethereal Ventures, Delphi, Game7, Mirana Ventures and Monoceros Ventures.</p><p>HyperPlay, which was established in November 2022 by MetaMask and Game7 DAO, says its platform tackles the Web3 gaming interoperability challenge “head-on,” providing interoperability for Web3 gaming, and allowing developers to work without being bound by centralized entities like Apple, Google and Steam. </p><p>The platform says it aims to enable interoperability across all Web3 games through a wallet overlay on top of games that allows players to carry their MetaMask wallet inside native or browser-based games. HyperPlay’s game store currently offers over 33 Web3 titles, the company said.</p><p>“Since announcing HyperPlay in November of last year, we’ve been focused on building a platform that empowers both developers and users to effortlessly navigate the Web3 gaming realm,” said JacobC.eth, founder of HyperPlay.</p><p>The platform touts itself as serving both developers and users alike, and says its “developer loyal” focus means it “charges no taxes on in-game economies, instead monetizing optional features like on-ramping or token swaps.”</p><p>For users, HyperPlay says it supports all Ethereum Virtual Machine-compatible chains, enabling players to bring their wallets, tokens and nonfungible tokens (NFTs) into every native or browser game. HyperPlay’s launcher integrates an in-game wallet overlay, so users don’t need to leave the game and use a separate website for NFT transactions, the company said.</p><p>Web3 gaming, or blockchain gaming, uses<em> </em><a href=\"https://cointelegraph.com/news/what-is-the-difference-between-blockchain-and-dlt\">distributed ledger technology</a><em> </em>to offer greater transparency, security, democratization and user control over in-game assets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/709dc3c1-61c9-48c4-9ff7-2ae92424f86b.png\"  /><figcaption style=\"text-align: center;\"><em>Unique active blockchain wallets per activity. Source: DappRadar</em></figcaption></figure><p><a href=\"https://dappradar.com/blog/dapp-industry-report-2022-dapp-industry-proves-resilient-in-crypto-winter\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a report from DappRadar, Web3 gaming <a href=\"https://cointelegraph.com/news/how-web3-gaming-can-reach-mainstream-adoption\"></a><a href=\"https://cointelegraph.com/news/how-web3-gaming-can-reach-mainstream-adoption\">accounted for almost half of all blockchain transactions</a> in 2022. This positions gaming as the fastest-growing sector in the blockchain space, well ahead of decentralized finance (DeFi) and NFTs.</p><p>That momentum has continued into 2023, with the sector experiencing consistent growth in the first quarter of 2023, <a href=\"https://dappradar.com/blog/state-of-blockchain-gaming-in-q1-2023\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to another DappRadar report. Blockchain games and metaverse projects <a href=\"https://cointelegraph.com/news/web3-gaming-gets-competitive-qorpo-game-studio-joins-cointelegraph-accelerator\">received $739 million of funding</a> in the period.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:01:00.000Z",
    "title": "EOS turns 5, celebrates the community’s effort to rebuild",
    "url": "https://cointelegraph.com/news/eos-turns-5-celebrates-the-community-s-effort-to-rebuild",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/125558b1-33a8-4b09-953f-297c47b28d6a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After setting the record for having the largest initial coin offering in history, the EOS network suffered various setbacks, including fines and allegations of market manipulation. </p>\n                    <p><p>Celebrating the 5th anniversary of the EOS Network, the team behind the protocol highlighted the importance of the community as it looked back on the many challenges it had to face to revive the scalability protocol. </p><p>After being <a href=\"https://cointelegraph.com/news/fifth-largest-cryptocurrency-eos-blockchain-set-to-launch\">launched in 2018</a>, the EOS became known for its network’s performance and for conducting the largest initial coin offering (ICO) in history, with <a href=\"https://cointelegraph.com/news/eos-about-to-secure-a-record-4-bln-in-year-long-ico\">over $4 billion raised during the year-long fundraising process</a>. Despite this, the project did not live up to the hype and expectations and <a href=\"https://www.sec.gov/news/press-release/2019-202\" target=\"_blank\" rel=\"noopener nofollow\">encountered</a> troubles with the United States Securities and Exchange Commission.</p><p>In September 2021, the protocol also faced allegations of market manipulation, with research claiming that the ICO <a href=\"https://cointelegraph.com/news/new-research-claims-21-accounts-pumped-the-4-4b-eos-ico-with-wash-trades\">was pumped by wash trades</a>. Frustrated with the developments, the community formed the EOS Network Foundation (ENF) to attempt to rebuild the project. </p><p>The members of the EOS ecosystem <a href=\"https://cointelegraph.com/news/eos-community-ramps-up-battle-for-organization-control-against-former-developer-block-one\">expressed their dissatisfaction</a> with the project’s developers and decided to fight for control over the network as they believed that they could no longer rely on Block.one. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/eos-network-foundation-reveals-plans-to-pursue-a-4-1b-lawsuit-against-block-one\"><strong><em>EOS Network Foundation reveals plans to pursue a $4.1B lawsuit against Block.one</em></strong></a></p><p>According to ENF founder Yves La Rose, the community's resilience played a huge role in putting the platform back on track. He explained: </p><blockquote>“As we commemorate the 5th anniversary of the launch of the EOS Network, I am profoundly inspired by the resilience of our community. We have endured much uncertainty standing against corporate greed in defense of our network.”</blockquote><p>La Rose added that they have now emerged as champions of free and open-source software and are now on the way to advocating for innovation. In 2023, the protocol has seen positive developments like the <a href=\"https://cointelegraph.com/news/eos-evm-to-allow-interoperability-across-ethereum-eos\">launch of its EVM mainnet</a> and <a href=\"https://cointelegraph.com/news/eos-network-lands-60m-investment-and-partnership-from-dwf-labs\">securing a $60 million investment</a>. </p><p>According to the team, the platform continues to cater to 100 million transactions per day. The team says that EOS has proven that it’s one of the most reliable blockchain networks, with more than 1,800 days of uptime since launch.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/whatever-happened-eos-community-aims-grassroots-comeback/\"><strong><em>Whatever happened to EOS? Community shoots for unlikely comeback</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:00:00.000Z",
    "title": "MetaMask Institutional to integrate with Fireblocks MPC platform",
    "url": "https://cointelegraph.com/news/metamask-institutional-to-integrate-with-fireblocks-mpc-platform",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/96f8aaf9-0900-42c9-bb37-1aa7adbbb5b9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Fireblocks will be added to the list of MetaMask Institutional custody technology providers, allowing its users to perform token swaps and stake ETH using the app’s dashboard.</p>\n                    <p><p>Web3 wallet MetaMask will integrate with Fireblocks’ multi-party computation (MPC) platform, allowing Fireblocks users to access the wallet’s portfolio dashboard, according to a June 6 announcement. The integration will be part of the MetaMask Institutional product aimed at institutional investors. It will go live on June 12.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b9e6701b-12d8-440b-9131-ce70c9ce7a19.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Map of prior MetaMask Institutional custody provider integrations. Source: MetaMask</em></figcaption></figure><p>MetaMask Institutional is wallet software that offers institutions a variety of features, including the ability to stake and lend crypto. It does not custody funds for institutions. Instead, it allows institutions to choose between multiple custody technology providers. Fireblocks is the latest provider to join the list, which includes BitGo, Gnosis Safe, Parfin, Hex Trust and others.</p><p>Fireblocks uses <a href=\"https://cointelegraph.com/news/multi-party-computation-could-offer-increased-protection-for-crypto-wallets\">multi-party computation</a>, a process that splits the user’s private key into shards and distributes the shards across a decentralized network. This can help to prevent any one node from having access to the full key, potentially making the wallet more secure. The company claims that over 1,800 institutions use its service to secure their crypto.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/new-tech-could-make-crypto-and-web3-wallets-more-convenient\"><strong>New tech could make crypto and Web3 wallets more convenient</strong></a></em></p><p>The new integration will give Fireblocks users access to MetaMask Institutional’s portfolio management capabilities and all-in-one dashboard, letting them do native token swaps and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) staking directly from the dashboard. The dashboard also enables users to view performance and profit and loss data for particular tokens and decentralized finance protocols.</p><p>According to Johann Bornman, global product lead for MetaMask Institutional, the integration was made partially in response to growing demand from institutions to get into the Web3 market:</p><blockquote>“With the exponentially increasing demand from organizations to enter web3, MetaMask Institutional is focused on providing the most expansive ecosystem access. […] This integration brings together two marquee products and further supports our goal to bridge every organization into web3.\"</blockquote><p>Fireblocks was one of the earliest MPC wallet providers, along with ZenGo. It <a href=\"https://cointelegraph.com/news/fireblocks-launches-crypto-payment-engine-with-checkout-com-and-worldpay-as-pilot-partners\">launched Payments Engine</a> in October, which is used by payment providers Checkout.com and Worldpay. In August, Fireblocks <a href=\"https://cointelegraph.com/news/enterprise-crypto-custody-firm-fireblocks-integrates-tokeny-for-token-minting\">implemented a token minting feature</a> by integrating with Tokeny.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:00:00.000Z",
    "title": "Ankr–Microsoft partnership continues with blockchain creator tool debut",
    "url": "https://cointelegraph.com/news/ankr-microsoft-partnership-continues-with-blockchain-creator-tool-debut",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/36e1fba1-7e9b-43cc-a051-0b87eb26cce3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The partnership was preceded by the launch of an enterprise node hosting service on Microsoft Azure. </p>\n                    <p><p>On June 8, decentralized blockchain infrastructure provider Ankr announced the launch of its enterprise blockchain creator tool on Microsoft’s Azure Marketplace. Dubbed “AppChains,” the solution will enable companies to quickly launch a dedicated and customizable blockchain to power various Web3 strategies. Developers can deploy the Polygon Supernet on its first iteration, with more choices thereafter.</p><p>According to Ankr, AppChains has been available for a year with use in launching application-specific blockchains to power their decentralized applications. However, Ankr’s developers said they are witnessing strong demand from institutional clients for using AppChains in areas such as banking, central bank digital currencies and gaming. The firm wrote:</p><blockquote>“Making the AppChain solution available on Microsoft’s Azure Marketplace provides an easy path for businesses to find a vetted solution and go to market with use cases like the above. AppChains ensure fast and affordable transactions, seamless user experiences, regulatory compliance, and end-to-end engineering.”</blockquote><p>Peter Stewart, head of infrastructure at Ankr, said that the firm would continue to improve the tool based on user feedback and performance metrics under the guidance of Microsoft. Meanwhile, Daniel An, director of Web3 and artificial intelligence business development at Microsoft, said that partnering with Ankr is an essential step in “testing, deploying, and scaling Web3 projects seamlessly.<em>\"</em></p><p>Cointelegraph previously reported on Feb. 21 that <a href=\"https://cointelegraph.com/news/ankr-partners-with-microsoft-to-offer-enterprise-node-services\">Ankr and Microsoft partnered</a> to offer enterprise node hosting services on the Azure Marketplace. The service relays transactions, deploys smart contracts, and can read or write blockchain data, saving time for developers to spend otherwise on scaling their applications. Currently, Ankr’s Web3 developer hub and software development kits power connections to over 30 blockchains. It is the approved infrastructure partner for building on the BNB Chain, Polygon and Avalanche ecosystems.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/make-500-from-chatgpt-stock-tips-bard-leans-left-100m-ai-memecoin-ai-eye/\">Make 500% from ChatGPT stock tips? Bard leans left, $100M AI memecoin: AI Eye</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T12:42:48.000Z",
    "title": "Bitcoin traders weigh next move with BTC price at crucial 200-week trendline",
    "url": "https://cointelegraph.com/news/bitcoin-traders-weigh-next-move-with-btc-price-at-crucial-200-week-trendline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d220d5d8-35b6-4e1e-a328-a7f2a1ce26ed.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin keeps the market guessing over how it will treat the 200-week moving average at $26,500.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) cooled the volatility into the June 8 Wall Street open as market participants waited for signals</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/374d582d-71e0-4e31-983e-ec3f49329559.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour candle chart on Bitstamp with 200WMA. Source: TradingView</em></figcaption></figure><h2>BTC spot clings to 200-week moving average</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC/USD circling a key long-term trend line near $26,500.</p><p>After flash volatility surrounding industry news events, the pair returned to sideways trading after <a href=\"https://cointelegraph.com/news/bitcoin-og-keeps-faith-in-bull-market-as-btc-price-bounces-8\">bouncing from three-month lows</a>.</p><p>Now, the 200-week moving average (WMA) formed a critical focus.</p><p>“We are currently sitting right on the 200WMA,” trading suite Decentrader wrote in part of the day’s analysis. </p><p>Decentrader opted for a conservative view of short timeframes, warning over an increasing long/short ratio on exchanges and that the U.S. trading session may open with selling.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The LTF bear case for <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>:<br><br>The Long/Short ratio is continuing to increase.<br><br>We are currently sitting right on the 200WMA.<br><br>The US market tends to sell when they wake up, especially if there&#39;s more negative news. <a href=\"https://t.co/NqhnbMZ5BL\">https://t.co/NqhnbMZ5BL</a> <a href=\"https://t.co/ajorEbYr7n\">pic.twitter.com/ajorEbYr7n</a></p>&mdash; Decentrader (@decentrader) <a href=\"https://twitter.com/decentrader/status/1666728070617677826?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Popular traders, including Crypto Tony, were on the sidelines until a more pronounced trend became apparent.</p><p>“This is the structure i am currently going by on Bitcoin and i remain out of a position while we are mid range,” he <a href=\"https://twitter.com/CryptoTony__/status/1666699579595603975/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers on the day. </p><blockquote>“No point rushing nay entries when things are not crystal clear. We had a good short before, now we prepare for the next entry.”</blockquote><p>An accompanying chart showed a potential downside target in a “support zone” at just below $26,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0bf54a18-995b-4d23-86ad-05f070d6fffd.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Crypto Tony/Twitter</em><a href=\"https://servedbyadbutler.com/redirect.spark?MID=169476&amp;plid=2032566&amp;setID=592928&amp;channelID=0&amp;CID=743589&amp;banID=520952491&amp;PID=0&amp;textadID=0&amp;tc=1&amp;type=tclick&amp;mt=1&amp;hc=cf3bd9099fbeb259be18478ef5cf3396552e3e54&amp;location=\" target=\"_blank\" rel=\"noopener nofollow\"></a></figcaption></figure><p>“Unchanged view on Bitcoin. Consolidation, falling wedge. Not overly interesting until we get a breakout,” fellow trader Jelle <a href=\"https://twitter.com/CryptoJelleNL/status/1666716088439013377\" target=\"_blank\" rel=\"noopener nofollow\">agreed</a>.</p><p>More optimistic takes came from popular trader King La Crypto among others, who eyed a potential repeat of upside from early March. This, as Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-price-spikes-above-31k-as-ethereum-gains-spark-altseason-calls\">reported</a>, ultimately resulted in highs of $31,000.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It&#39;s happening again.<a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> <a href=\"https://t.co/so3Jyj23QL\">https://t.co/so3Jyj23QL</a> <a href=\"https://t.co/MfO67SMzU0\">pic.twitter.com/MfO67SMzU0</a></p>&mdash; King La Crypto (@kinglacrypto) <a href=\"https://twitter.com/kinglacrypto/status/1666541135295029259?ref_src=twsrc%5Etfw\">June 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>DXY heads to support</h2><p>Prior to the Wall Street open, meanwhile, pronounced weakness in the U.S. dollar formed a potential reason for bullishness on crypto markets.</p><p>The U.S. dollar index (DXY) fell to its lowest in several days, targeting support from the monthly open and late May.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/fe9fec9b-4925-4317-81c3-1a80194f3ac2.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index (DXY) 1-hour candle chart. Source: TradingView</em></figcaption></figure><p>Popular trader Mikybull Crypto was among those inferring apositive outcome for BTC.</p><p>\"Correlating Dollar Index DXY and Bitcoin, we can see the market makers model in play,\" he explained alongside a comparative chart.</p><blockquote>\"BTC still have one more leg up.\"</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a1a5e5fa-68bb-4349-aa44-c5c84d26bb07.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC vs. DXY annotated chart. Source: Mikybull Crypto/Twitter</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\">Home loans using crypto as collateral: Do the risks outweigh the reward?</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T12:45:00.000Z",
    "title": "Bitcoin Price Analysis:  Volatility Below 27000 - 8 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-volatility-below-27000-8-june-2023",
    "description": "<p>BTC/USD Fading Below 27000:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 8 June 2023</p>\n<p>Bitcoin (BTC/USD) remained highly volatile early in the Asian session as the pair continued to fade below the 27000 figure after being lifted to the 27402.79 area, an appreciation that represented a test of the 27466.83 area.&nbsp; Stops were recently elected below the 25474.18 area by bears as BTC/USD was pushed lower to the 25351.92 area, its weakest print since mid-March.&nbsp; This move lower also represents a test of the 25309.26 area, a level that represents the 50% retracement of the appreciating range from 19568.52 to 30825.30.&nbsp; Stops are cited below major retracement levels linked to the 19568.52 and 15460 levels, including the 25309, 25094, 23954, 23255, 22278, 22025, 21415, 19139, and 18796 areas.</p>\n<p>Additional downside price objectives include the 24705, 24440, 23208, and 22769 levels.&nbsp; Following recent price activity, areas of technical resistance and potential selling pressure include the 26088, 26544, 29813, 26696, 26912, 27281, 27528, 27737, 27805, 28200, 28473, and 28873 levels.&nbsp; Upside retracement levels in recent depreciating ranges include the 28700, 28741, 28868, 29243, 29299, and 29284 levels.&nbsp; Above the market, upside price objectives include the 30420.74, 31237.11, 31477.37, 32501.23, 32556.73, 32989.19, 34583.96, 34658.69, 35222.66, 37765.28, and 38403.97 levels.&nbsp; &nbsp;Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 200-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;100-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;100-bar MA&nbsp;(4-hourly) at 26912.19 and the&nbsp;50-bar MA&nbsp;(Hourly) at 26299.19.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T12:58:00.000Z",
    "title": "Arbitrum blockchain overcomes software bug, restores seamless transaction processing",
    "url": "https://www.cryptopolitan.com/arbitrum-blockchain-overcomes-software-bug-restores-seamless-transaction-processing/",
    "description": "Arbitrum (ARB) network grappled with a critical software bug on Wednesday, temporarily suspending on-chain transaction processing for an extended duration. The glitch, identified within Arbitrum&#8217;s sequencer, which assumes the crucial responsibility of receiving user transactions, amalgamating them into transaction batches, and subsequently posting them on-chain, was revealed by the official Twitter account of Arbitrum developers. ... <a title=\"Arbitrum blockchain overcomes software bug, restores seamless transaction processing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-blockchain-overcomes-software-bug-restores-seamless-transaction-processing/\" aria-label=\"More on Arbitrum blockchain overcomes software bug, restores seamless transaction processing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T12:55:51.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T12:51:44.000Z",
    "title": "Bitcoin Plummets to $26,300 Amid Market Panic: Will BTC Price Sink to $20,000 or Rebound to $30,000? Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-plummets-to-26300-amid-market-panic-will-btc-price-sink-to-20000-or-rebound-to-30000-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-plummets-to-26300-amid-market-panic-will-btc-price-sink-to-20000-or-rebound-to-30000-report",
    "description": "<p>Bitcoin experiences volatility and selling pressure due to SEC lawsuits against Binance and Coinbase. The market shows a brief recovery but remains uncertain. The decrease in stablecoin balances held in exchange addresses suggests lower buying demand in the crypto market. Higher-than-usual volatility is expected as trading volumes increase. The world&#8217;s largest cryptocurrency Bitcoin (BTC) continues [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-plummets-to-26300-amid-market-panic-will-btc-price-sink-to-20000-or-rebound-to-30000-report/\">Bitcoin Plummets to $26,300 Amid Market Panic: Will BTC Price Sink to $20,000 or Rebound to $30,000? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T12:45:28.000Z",
    "title": "Polkadot’s Progress Unveiled: Milestones, Interoperability, and DeFi Dominance Shape the Future of Blockchain",
    "url": "https://www.crypto-news-flash.com/polkadots-progress-unveiled-milestones-interoperability-and-defi-dominance-shape-the-future-of-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-progress-unveiled-milestones-interoperability-and-defi-dominance-shape-the-future-of-blockchain",
    "description": "<p>Polkadot Q1 2023 report shows some incredible progress on the network.  The total DOT staked saw a steady increase. Polkadot has in its first quarter report disclosed interesting progress in its price and the ecosystem at large. According to the report, the native token, DOT, recorded a sharp rise earlier this year, then took a [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polkadots-progress-unveiled-milestones-interoperability-and-defi-dominance-shape-the-future-of-blockchain/\">Polkadot&#8217;s Progress Unveiled: Milestones, Interoperability, and DeFi Dominance Shape the Future of Blockchain</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T12:52:00.000Z",
    "title": "Bybit Secures Crypto Trading, Custody Services License in Kazakhstan",
    "url": "https://coinedition.com/bybit-secures-crypto-trading-custody-services-license-in-kazakhstan/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Bybit_Secures_Crypto_Trading_Custody_Services_License_in_Kazakhstan-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Bybit_Secures_Crypto_Trading_Custody_Services_License_in_Kazakhstan-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Bybit_Secures_Crypto_Trading_Custody_Services_License_in_Kazakhstan-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Bybit_Secures_Crypto_Trading_Custody_Services_License_in_Kazakhstan.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bybit, the third most visited crypto exchange, has achieved a significant milestone in its global expansion efforts. On June 7, 2023, the firm announced that it had been granted a license to operate a digital asset trading facility and provide custody services by the Astana Financial Service Authority (AFSA) in Kazakhstan. This authorization positions Bybit [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bybit-secures-crypto-trading-custody-services-license-in-kazakhstan/\">Bybit Secures Crypto Trading, Custody Services License in Kazakhstan</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-08T12:58:55.000Z",
    "title": "Bitfinex Securities and Astana International Exchange (AIX) agree on terms of cooperation",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-securities-and-astana-international-exchange-aix-agree-on-terms-of-cooperation/",
    "description": "<p>ASTANA, Kazakhstan June 8, 2023 &#8211; Bitfinex Securities Ltd, the leading platform for the issuance and trading of tokenized securities, &#8211; is pleased to announce the signing of a Memorandum of Understanding (MOU) with Astana International Exchange (AIX),&#160; to establish a collaborative partnership in various...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-securities-and-astana-international-exchange-aix-agree-on-terms-of-cooperation/\">&lt;strong&gt;Bitfinex Securities and Astana International Exchange (AIX) agree on terms of cooperation&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]