[
  {
    "source": "Decrypt",
    "date": "2023-06-15T16:01:06.000Z",
    "title": "Arbitrum's New 'Layer-3' Xai Network Is Built to Power Web3 Games",
    "url": "https://decrypt.co/144775/arbitrums-new-layer-3-xai-network-built-power-web3-games",
    "description": "Dedicated gaming network Xai is launching with support from Offchain Labs, with games like Final Form and LAMOverse up first."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T15:55:13.000Z",
    "title": "Coinbase redeems $65M in convertible notes at 29% discount",
    "url": "https://cointelegraph.com/news/coinbase-redeems-65m-convertible-notes-29-discount",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e6875bc6-6e20-4e48-97cd-1ca1b8bf2266.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The cryptocurrency exchange estimates it will only need $45.5 million in cash to redeem the instruments. </p>\n                    <p><p>According to a June 15 announcement, cryptocurrency exchange Coinbase has <a href=\"https://investor.coinbase.com/news/news-details/2023/Coinbase-Announces-Repurchase-of-0.50-Convertible-Senior-Notes-Due-2026/default.aspx\" target=\"_blank\" rel=\"noopener nofollow\">entered</a> into an agreement for the redemption of $64.5 million in 0.50% Convertible Senior Notes due 2026. However, the company estimates it will only need $45.5 million in cash to consummate the agreement due to the notes' 29% discount to par value. Coinbase wrote: </p><blockquote>\"The Repurchases are expected to close on or about June 20, 2023, subject to the satisfaction of customary closing conditions. Following such closings, approximately $1.373 billion principal amount of the Notes will remain outstanding.\"</blockquote><p>Alesia Haas, Coinbase's chief financial officer, described the transaction as an \"opportunistic repurchase\" and said the firm would continue to look for such opportunities in the future. Many of Coinbase's debt instruments have been trading at discounts since the onset of the cryptocurrency bear market. </p><p>Investor fears were exacerbated by a <a href=\"https://cointelegraph.com/news/coinbase-junk-bonds-tank-amid-market-rout-and-creditors-fears\">May 2022 disclosure</a> that if the company were to go bankrupt, users’ digital assets held on the platform may “be subject to bankruptcy proceedings” and could see them treated as “unsecured creditors.”</p><p>In one instance, the Coinbase Global Inc. DL-Notes 2021(21/31) <a href=\"https://markets.businessinsider.com/bonds/coinbase_global_incdl-notes_202121-31_regs-bond-2031-usu19328ab62\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> in September 2021 is currently trading for 54 cents on the dollar. Over $1 billion of this debt was issued with a coupon rate of 3.625% and a maturity date of October 2023. The bond's current yield is 15.2%. </p><p>It appears that investors haven't been enticed by the discounts, however. On June 6, the U.S. Securities and Exchange Commission charged Coinbase for operating an unregistered securities exchange and the sale of unregistered securities from its staking-as-a-service program. The litigation is ongoing.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T15:52:46.000Z",
    "title": "3 Bitcoin price metrics showing 'insane' similarities to 2020 breakout",
    "url": "https://cointelegraph.com/news/bitcoin-price-metrics-similarities-2020-breakout",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/56c11883-37b3-4246-acab-6755a75efe98.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin remains bullish — and arguably more so than ever — depending on which BTC price metrics are used to assess it.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is copying the prelude to its 2020 breakout to an “insane” extent, the co-founders of Glassnode have said.</p><p>In a <a href=\"https://twitter.com/Negentropic_/status/1669113674504478721/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a> on June 15, Yann Allemann and Jan Happel highlighted three BTC price metrics which are anything but bearish.</p><h2>Metrics echo Bitcoin's \"major reversals and rallies\"</h2><p>BTC/USD reached <a href=\"https://cointelegraph.com/news/bitcoin-price-spikes-above-31k-as-ethereum-gains-spark-altseason-calls\">local highs of $31,000</a> in April, but since then has dipped around 20%. Sentiment has taken a beating in the process, with downward price predictions becoming the norm in the intervening weeks.</p><p>While recent events have placed additional pressure on the market, Allemann and Happel see at least three good reasons for optimism. </p><p>Several on-chain indicators, they revealed, now look uncannily like they did in Q3 2020, just before BTC/USD beat its old 2017 all-time high of $20,000.</p><p>“The resemblance to Sep 04, 2020, is insane…,” they wrote in part of commentary.</p><p>Leading the line-up is the classic <a href=\"https://cointelegraph.com/news/here-s-3-ways-the-relative-strength-index-rsi-can-be-used-as-a-sell-signal\">relative strength index (RSI)</a>, which measures how overbought or oversold BTC/USD is at a specific price point.</p><p>Daily RSI currently measures 35, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> confirms. This is its lowest reading since early March, just before Bitcoin’s most recent uptick which resulted in the $31,000 peak a month later.</p><p>“RSI is at levels that led to major reversals and rallies,” the post explained.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/824a2623-64c9-4d1c-aa40-cb15a1d1b826.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day candle chart on Bitstamp with RSI. Source: TradingView</em></figcaption></figure><p>Continuing, Allemann and Happel flagged the Cipher B readings for Bitcoin, these coming from a collection of algorithms that converge to offer signals of, among other things, when to buy dips during bull markets.</p><p>“Cipher b wave trends are at levels that led to major reversals and rallies,” they repeated.</p><p>Finally, the appropriately-named Bitcoin Risk Signal is back at its September 4, 2020 position. Risk Signal predicts the likelihood of a major BTC price drawdown, and at that time saw a spike to “high risk” before receding.</p><p>What happened next was a flat Risk Signal reading for successive months while BTC/USD broke higher.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9b637b63-0e62-4aa4-9040-920e7f146233.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Risk Signal chart. Source: Glassnode</em></figcaption></figure><h2>Hodlers big and small increase BTC exposure</h2><p>Elsewhere, Glassnode flagged encouraging signs suggesting investors keeping the faith long term.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-analyst-believes-fed-will-favor-bulls\">‘Pick your targets’ — Bitcoin analyst believes Fed will favor bulls</a></em></strong></p><p>For lead on-chain analyst Checkmate, accumulation among existing hodlers remained impressive.</p><p>\"Pretty doomy out there,\" he <a href=\"https://twitter.com/_Checkmatey_/status/1669182945138204674/photo/2\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> about sentiment on June 15.</p><blockquote>\"Meanwhile, Bitcoin Shrimp, Crabs, and Fish (wallets &lt; 100 $BTC) are adding to their balance at a rate of 248% times the amount freshly minted by miners. Sharks (100 to 1k $BTC) adding an additional 38%. Coins are coming out of exchanges. Halving is ~310 days away.\"</blockquote><p>Accompanying charts showed so-called \"Absorption Rates\" for various hodler cohorts by wallet size. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ed82f2f8-20c4-4afe-b3ae-a2bd56057497.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Absorption Rates charts. Source: Checkmate/Twitter</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T16:00:00.000Z",
    "title": "Binance Launches Bitcoin Cloud Mining Services",
    "url": "https://cryptodaily.co.uk/2023/06/binance-launches-bitcoin-cloud-mining-services",
    "description": "<p class=\"md-end-block md-p\">Binance, the world's largest cryptocurrency exchange by daily trading volume, has announced the launch of its new subscription-based Bitcoin cloud mining services. The move comes as a surprise amidst the ongoing regulatory challenges Binance is facing in the United States.</p>\n<p class=\"md-end-block md-p\">Binance's Bitcoin Cloud Mining Service</p>\n<p class=\"md-end-block md-p\">Binance announced the launch on Twitter, claiming that users who are interested in Bitcoin mining but lack the necessary hardware can subscribe to these new cloud mining services and purchase hashrates. Currently, Binance offers 1 Terahash per second (Th/s) at a rate of $10.7280. An increase in the purchased hashrate corresponds to an increased probability of higher Bitcoin earnings through mining.</p>\n<p class=\"md-end-block md-p\">The BTC mining subscription service will remain active for six months. During this 180-day period, for every TH/s purchased, users could potentially earn 0.0004338 BTC. However, as of now, this product is only available on Binance's global website, indicating that users from the United States cannot access it.</p>\n<p class=\"md-end-block md-p\">Current Regulatory Trouble</p>\n<p class=\"md-end-block md-p\">Binance's decision to launch these cloud mining services comes at a particularly challenging time for the cryptocurrency exchange. In the United States, the Securities and Exchange Commission (SEC) has taken legal action against Binance, alleging violations of securities laws. Alongside this, the SEC has filed for a temporary restraining order to freeze the assets of Binance.US.</p>\n<p class=\"md-end-block md-p\">The SEC has accused Binance of operating as an unregistered securities exchange, and CZ has been accused of failing to prevent U.S. customers from using the platform and providing misleading information about its market surveillance measures. According to the lawsuit, Binance and CZ were involved in an \"elaborate scheme\" to evade U.S. federal securities laws, which included creating separate U.S. entities and diverting billions of dollars in customer funds to Merit Peak Limited, a separate company under Zhao's control.</p>\n<p class=\"md-end-block md-p\">In a press release, SEC Chair Gary Gensler stated that the charges against CZ and Binance detail an \"extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law.\" He further accused the defendants of misrepresenting their risk controls, manipulating trading volumes, and actively concealing crucial information, such as the platform's operations, manipulative trading by its affiliated market maker, and the custody of investor funds and crypto assets.</p>\n<p class=\"md-end-block md-p\">Binance Building Forward</p>\n<p class=\"md-end-block md-p\">In the wake of these accusations, CZ has remained unfazed, choosing to dismiss the charges with a tweet stating \"4\", a reference used within the Binance community to encourage users to ignore fear, uncertainty, and doubt (FUD). He assured the community that Binance's systems remain stable and that deposits and withdrawals are operating as normal.</p>\n<p class=\"md-end-block md-p\">In preparation for the legal proceedings, Binance.US has already added former SEC enforcement co-director George Canellos to its legal team. Meanwhile, last week, Binance.US revealed that it has suspended USD deposits on its platform, a significant step in its transition to becoming an exclusively crypto-based exchange. </p>\n<p class=\"md-end-block md-p\">Binance is not the only crypto exchange facing regulatory pressures. Coinbase, another prominent cryptocurrency exchange, also found itself on the receiving end of a lawsuit from the SEC for alleged failure to register as a broker, national securities exchange, or clearing agency.</p>\n<p class=\"md-end-block md-p md-focus\">Binance's cloud mining services launch amid such regulatory challenges is a notable step, reflecting the exchange's commitment to advancing its services, even as it grapples with legal and regulatory issues. </p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T16:01:55.000Z",
    "title": "Why Mark Cuban feels 99% of crypto tokens will go broke?",
    "url": "https://www.cryptopolitan.com/cuban-feels-99-of-crypto-tokens-go-broke/",
    "description": "An impassioned exchange unfolded recently in the Twitter universe, featuring two influential personalities with contrasting views on the promising yet controversial domain of cryptocurrencies. The sparring partners: former Chief SEC Office of Internet Enforcement, John Reed Stark, and entrepreneur, investor, and anticipated presidential candidate, Mark Cuban. In a dialogue touching on numerous aspects of crypto ... <a title=\"Why Mark Cuban feels 99% of crypto tokens will go broke?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cuban-feels-99-of-crypto-tokens-go-broke/\" aria-label=\"More on Why Mark Cuban feels 99% of crypto tokens will go broke?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T16:05:07.000Z",
    "title": "Ripple works with Colombia’s central bank for CBDC development",
    "url": "https://crypto.news/ripple-works-with-colombias-central-bank-for-cbdc-development/",
    "description": "Ripple is pressing forward by partnering with Banco de la República, Colombia's central bank, to probe the potential applications of blockchain technology in the financial sector, and a CBDC."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T16:00:27.000Z",
    "title": "XRP Exhibits Bearish Chart Pattern – Where Could The Price Head Next?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-exhibits-bearish-chart-pattern-where-could-the-price-head-next/",
    "description": "In the past 48 hours, the price of XRP has experienced notable volatility, dropping below $0.50. The crypto market is closely focused on XRP due to a recent favorable development in the Securities and Exchange Commission (SEC) vs. Ripple lawsuit. The emergence of the Hinman documents has sparked inquiries into the actions of the Securities and Exchange Commission. Although XRP witnessed positive price action earlier this year, the altcoin has faced challenges due to ongoing market volatility. This has led to a break below significant support levels. Related Reading: Ethereum Plunges Below $1,700, Here’s The Metric That Signaled This In Advance Over the last 24 hours, XRP has seen a close to 7% dip. There has been an 8% depreciation on the weekly chart. Both the demand and accumulation of the asset have remained low. This indicated a dominant bearish trend. The fear index remains high in the market, contributing to a decline in investor confidence. Failure to surpass the $0.50 level may result in a significant loss of value for XRP during the next trading session. Furthermore, the decrease in the altcoin&#8217;s market capitalization reinforces the weak buying power reflected on the chart. XRP Price Analysis: One-Day Chart As of the time of writing, the altcoin XRP was trading at $0.47. Following the rejection of the bulls at $0.50, XRP has been experiencing a downward trend. The coin faced resistance at $0.50, and it is anticipated that it may encounter even stronger resistance at $0.55. If the altcoin fails to surpass the $0.55 mark, it will likely dip to its local support level of $0.46 and potentially further down to $0.43. Moreover, the altcoin has formed a bearish double-top pattern, indicating a potential reversal in its price trend as it moves downward on the chart. The trading volume of XRP has also declined in the last session, suggesting that sellers have taken control of the asset. Technical Analysis During the majority of this month, XRP witnessed a decline in demand. This was reflected by the Relative Strength Index (RSI) falling below the half-line, indicating that sellers had taken control of the asset. Additionally, XRP fell below the 20-Simple Moving Average (SMA), suggesting low demand and indicating that sellers were driving the price momentum in the market. However, if the altcoin trades near the $0.50 price mark, it can potentially bring the price back above the 20-SMA line. This would essentially indicate a resurgence in demand for the asset. In addition to the mentioned technical indicators, other signals on the chart for the altcoin indicate selling pressure. The Moving Average Convergence Divergence (MACD) formed red histograms, signalling sell signals for the altcoin and indicating a bearish sentiment in the market. Related Reading: Ethereum Bears Set Their Sights On Next Downside Target If $1,700 Support Breaks Furthermore, the Bollinger Bands have widened, indicating increased volatility and potential price fluctuations for the altcoin in the upcoming trading sessions. This suggests that the price of XRP may experience significant changes and unpredictability in the near term. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T16:05:36.000Z",
    "title": "DWF Labs and TRON Forge Strategic Partnership to Boost Ecosystem With 165M Accounts And 5,8B Transactions",
    "url": "https://www.crypto-news-flash.com/dwf-labs-and-tron-forge-strategic-partnership-to-boost-ecosystem-with-165m-accounts-and-58b-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=dwf-labs-and-tron-forge-strategic-partnership-to-boost-ecosystem-with-165m-accounts-and-58b-transactions",
    "description": "TRON, a leading blockchain network, has partnered with DWF Labs, a digital asset investment firm. TRON is celebrating a significant accomplishment as it marks five years since the launch of its MainNet. According to Bloomberg, TRON, a prominent blockchain network primarily focusing on decentralizing the Internet through decentralized applications (dApps), has partnered with DWF Labs, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T16:00:51.000Z",
    "title": "AI Crypto, ChatGPT, AiDoge, is ApeMax Next Crypto to Explode in 2023",
    "url": "https://www.crypto-news-flash.com/ai-crypto-chatgpt-aidoge-is-apemax-next-crypto-to-explode-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=ai-crypto-chatgpt-aidoge-is-apemax-next-crypto-to-explode-in-2023",
    "description": "The crypto world and in particular the altcoin space has been buzzing with innovation and the introduction of highly promising new coins. Artificial Intelligence or AI as a growing trend has become more apparent in crypto, with the introduction of new AI centric coins such as Aidoge, and with the increased use of tools like [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T15:47:17.000Z",
    "title": "Brazil Central Bank Charts Path to CBDC and Tokenization in Roadmap, Will Ethereum be the Base Layer? Report",
    "url": "https://www.crypto-news-flash.com/brazil-central-bank-charts-path-to-cbdc-and-tokenization-in-roadmap-will-ethereum-be-the-base-layer-report/?utm_source=rss&utm_medium=rss&utm_campaign=brazil-central-bank-charts-path-to-cbdc-and-tokenization-in-roadmap-will-ethereum-be-the-base-layer-report",
    "description": "Brazil&#8217;s Central Bank is set to introduce a Central Bank Digital Currency (CBDC). Banco Central do Brasil (BCB) stands out by placing a strong emphasis on supporting domestic startups. Brazil&#8217;s Central Bank, Banco Central do Brasil (BCB), has made a noteworthy advancement in its efforts to introduce a Central Bank Digital Currency (CBDC). The BCB has [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T16:01:00.000Z",
    "title": "3AC Co-Founder Kyle Davies Fails to Respond to Subpoena",
    "url": "https://coinedition.com/3ac-co-founder-kyle-davies-fails-to-respond-to-subpoena/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/This_Week_in_Crypto_FOMO_Returns_3AC_Founders_Seek_Funding_Podcast-2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/This_Week_in_Crypto_FOMO_Returns_3AC_Founders_Seek_Funding_Podcast-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/This_Week_in_Crypto_FOMO_Returns_3AC_Founders_Seek_Funding_Podcast-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/This_Week_in_Crypto_FOMO_Returns_3AC_Founders_Seek_Funding_Podcast-2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to recent documents filed by the bankrupt crypto hedge fund Three Arrows Capital’s (3AC) estate, 3AC co-founder Kyle Davies is asked to be held in contempt of court for his failure to comply with a subpoena regarding the collapse of 3AC. As per reports, the filing requests the New York court to impose a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/3ac-co-founder-kyle-davies-fails-to-respond-to-subpoena/\">3AC Co-Founder Kyle Davies Fails to Respond to Subpoena</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]