[
  {
    "source": "Decrypt",
    "date": "2023-08-07T22:30:38.000Z",
    "title": "Elon Musk-Backed Brain Hacking Firm Neuralink Raises $280 Million",
    "url": "https://decrypt.co/151652/neuralink-elon-musk-brain-interface-funding-peter-thiel",
    "description": "The biotechnology firm obtained significant financial support for its brain-computer interface development from Peter Thiel’s Founders Fund."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-07T22:30:22.000Z",
    "title": "Central Banks Resumed Gold Purchases in June",
    "url": "https://news.bitcoin.com/central-banks-resumed-gold-purchases-in-june/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Central Banks Resumed Gold Purchases in June\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1294027336.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Central banks ramped up gold purchases in June, according to statistics from the International Monetary Fund (IMF). In this period, central banks added 55 tonnes of gold to their reserves after three months of net selling, with China purchasing the most gold (21 tonnes). Central Banks Back to Purchasing Gold in June The world&#8217;s central [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T22:10:54.000Z",
    "title": "Top crypto tweets of the day – August 7th",
    "url": "https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-7th/",
    "description": "Ethereum whale sends 2500eth to burn address after finding out his gf cheated on him A crypto investor who lost 800 ETH is asking for 90% of it back Curve Finance places a bounty on exploiter Paypal launches dollar-backed stablecoin Justin Sun asks Paypal to deploy PYUSD on Tron US Rep issues statement on Paypal’s ... <a title=\"Top crypto tweets of the day &#8211; August 7th\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-7th/\" aria-label=\"More on Top crypto tweets of the day &#8211; August 7th\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T22:10:37.000Z",
    "title": "Best Twitter threads of the day – August 7th",
    "url": "https://www.cryptopolitan.com/best-twitter-threads-of-the-day-august-7th/",
    "description": "Is Huobi insolvent? What happened in the NFT world this week? $113 million has now been bridged to Coinbase’s Base"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T22:26:12.000Z",
    "title": "Why Low Volatility Bitcoin Could Last A Lot Longer",
    "url": "https://www.newsbtc.com/bitcoin-news/why-low-volatility-bitcoin-could-last-a-lot-longer/",
    "description": "Much has been said in recent weeks regarding how uncharacteristically calm Bitcoin has been. On weekly timeframes, volatility measures are at their lowest ever. Unfortunately, despite the record-setting lull, directionless sideways price action could continue for a lot longer. Record-Breaking Low Volatility State Could Continue Longer Bitcoin price is at a standstill compared to its usually explosive self. It’s remained locked in a tight trading range, to the point where even a $300 move to either side might feel like a major breakout. Related Reading: Crypto Storm Brewing: Bitcoin Vortex Indicator Flashes Buy Alert Few points throughout history on lower timeframes have ever been this quiet. This is according to the weekly Bollinger Bands and Bollinger Band Width readings. Extreme tightening in the Bollinger Bands suggests what’s a called a Squeeze setup — a situation where following a low volatility phase of narrowing, the bands then expand and release a wave of volatility. It could be a lot longer until that happens, however. The monthly bands might need further tightening &#124; BTCUSD on TradingView.com Examining Monthly Bollinger Band Width While the weekly is at record tightness, using the very same tool on the monthly timeframe, shows that that there could be a lot further to go. The Bollinger Band Width isn’t as low as it has been prior to past bull runs — notably to the lows of early 2016 and late 2020. This could suggest the possibility of months more sideways before a meaningful breakout to new all-time highs or a collapse back to lows. Related Reading: This Long-Term Bitcoin Price Average Is Setting ATHs None of this says much about direction thus far, but %B might hint at a move to the upside. The tool is plotted depending on price’s percentage relation to the upper, middle, and lower Bollinger Bands. As long as %B remains above 0.5 it means price is above the Bollinger Band basis — which is a 20-month simple moving average Although we don’t know which direction Bitcoin ultimately moves, we do know that one thing is for certain: volatility will return in a major way. It’s just a matter of when, and how long we have to wait. The #Bitcoin 1W Bollinger Bands have been the &#34;tightest in its history&#34; for several weeks nowhttps://t.co/1Oux6TB537 But there is a lot more going on if you turn on Bollinger Band Width and %B – two ancillary technical tools related to the BB itself John Bollinger created the… pic.twitter.com/iGVwoBPWrg &#8212; Tony &#34;The Bull&#34; (@tonythebullBTC) August 7, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]