[
  {
    "source": "Decrypt",
    "date": "2024-03-19T22:52:10.000Z",
    "title": "Bitcoin ETFs Lose Ground for First Time in Weeks, Weighed Down by Grayscale",
    "url": "https://decrypt.co/222470/bitcoin-etf-negative-flow-grayscale-trust",
    "description": "Investors are still cashing out of GBTC. Does this indicate diminished demand for spot Bitcoin ETFs?"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T23:00:03.000Z",
    "title": "Record-Breaking GBTC Outflows Send Bitcoin Down 14% To $62,000",
    "url": "https://www.newsbtc.com/bitcoin-news/record-breaking-gbtc-outflows-send-bitcoin-down-14-to-62000/",
    "description": "As reported by Fortune Magazine, the cryptocurrency market has been experiencing significant volatility as Bitcoin (BTC) has experienced a sharp decline that has had a domino impact on other cryptocurrencies. The recent drop in the price of Bitcoin, coupled with outflows from Grayscale&#8217;s GBTC, has raised concerns among investors.  Bitcoin Sees 14% Correction From ATH Bitcoin suffered a 14% drop since reaching its all-time high (ATH) of $73,700 last week, briefly touching $62,483 on Tuesday morning. However, it recovered and stabilized around $64,900, just below the $65,000 mark.  Related Reading: AVAX Price Soars To Highest In Nearly 2 Years, Over 80% Of Holders In Profit The decline was attributed to record outflows of over $640 million from Grayscale&#8217;s Bitcoin Trust (GBTC). In comparison, other spot Bitcoin ETFs saw inflows of less than $500 million, resulting in a net outflow of $15 million on Monday, according to Bloomberg ETF expert James Seyffart.  This outflow from GBTC, combined with the cautious sentiment surrounding the Federal Open Market Committee (FOMC) meeting in the US, has had a significant impact on Bitcoin&#8217;s performance. As recently reported by NewsBTC, investors exhibited caution ahead of the FOMC meeting, closely monitoring the potential changes in interest rates. Recent higher-than-expected inflation data, as indicated by the US Consumer Price Index (CPI) and Producer Price Index (PPI), dampened expectations of interest rate cuts.  According to Fortune, the CME FedWatch Tool projected a 99% likelihood of rates remaining unchanged, further affecting market sentiment. Per the report, investors were keen to gauge the Federal Reserve&#8217;s stance on monetary policy, contributing to the cautious trading environment. In the same context, the Bank of Japan raised its key interest rate from -0.1% to 0% to 0.1% in response to rising consumer prices. This was the first rate increase in 17 years. Crypto Futures Traders Take A Hit The drop in Bitcoin&#8217;s price had a cascading effect on other cryptocurrencies. Major altcoins like Ethereum (ETH) and Solana (SOL) experienced significant declines of 8.1% and 12.5% over the past 24 hours, respectively.  Meme coins, including Floki Inu (FLOKI), Bonk Inu (Bonk), and Dogecoin (DOGE), also suffered losses of 34%, 28.5%, and 24.8%, respectively, during the past week.  Related Reading: Dogecoin Growth Hits Roadblock As Holder Activity Enters Dreaded Period Of Stagnancy The decline in cryptocurrency prices resulted in over $440 million worth of liquidations for traders of crypto futures. Traders who had leveraged positions betting on higher prices faced significant losses. Most of these liquidations occurred on Binance, totaling $212 million, followed by OKX at $170 million.  Despite its price correction, BTC retains substantial gains of over 26% and 132% in the past thirty days and year-to-date timeframe, respectively. Featured image from Shutterstock, chart from TradingView.com"
  }
]