[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T21:07:20.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $4.10USD, with a 24-hour trading volume of $101,148,403. Filecoin is down 0.12% in the last 24 hours. The current CoinMarketCap ranking is #30, with a market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and the max. ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T21:07:19.000Z",
    "title": "New York attorney general investigates DCG’s Genesis ties",
    "url": "https://www.cryptopolitan.com/ny-ag-investigates-dcg-genesis-ties/",
    "description": "The recent waves created by the cryptocurrency giant Digital Currency Group, famously known as DCG, have now hit the shores of New York&#8217;s justice system. The Empire State&#8217;s top law enforcement officer, Attorney General Letitia James, has now thrown her hat into the ring, joining the ongoing investigations into DCG&#8217;s dealings with its subsidiary, Genesis ... <a title=\"New York attorney general investigates DCG&#8217;s Genesis ties\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ny-ag-investigates-dcg-genesis-ties/\" aria-label=\"More on New York attorney general investigates DCG&#8217;s Genesis ties\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T20:48:38.000Z",
    "title": "Zuck’s Threads about to have search and web features",
    "url": "https://www.cryptopolitan.com/threads-about-to-have-search-web-features/",
    "description": "Mark Zuckerberg&#8217;s brainchild, Threads, is about to experience an upgrade. In an effort to combat dwindling user engagement and maximize its competitive edge, Meta is preparing to roll out search functionality and web accessibility features for the Twitter-like app. With Zuckerberg&#8217;s confidence and strategic foresight propelling the project forward, the world is watching to see ... <a title=\"Zuck&#8217;s Threads about to have search and web features\" class=\"read-more\" href=\"https://www.cryptopolitan.com/threads-about-to-have-search-web-features/\" aria-label=\"More on Zuck&#8217;s Threads about to have search and web features\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-05T21:00:55.000Z",
    "title": "XRP Whales Trigger Price Decline With Large Selling",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-whales-trigger-price-decline/",
    "description": "Massive XRP whale wallets are at it again as recently, some of the largest holders of XRP have dumped over 100 million tokens, putting major selling pressure on the XRP price.  On-chain data shows that since July 19, the overall supply in addresses holding between 100,000-1,000,000 coins has decreased from 6.85 billion to 6.75 billion. Whales Taking Profit After Pump The actions of whales or large holders of cryptocurrencies seem to always tell the nature of general market sentiment. When whales sell off chunks of their holding, it often triggers a cascade of smaller holders selling in response, driving the price down.  Related Reading: These Are The Factors That Could Lead To Another Bitcoin Rally: ARK Invest While retail investors and smaller holders often get caught up in the excitement of price rises and buy-in at the top, whales are more likely to sell off after massive price jumps and buy back in after the pullback. Right now, XRP whales may be taking some profits after the recent pump in price following news of partial victory in the SEC case. The price of XRP rose over 70% in less than 24 hours to $0.85 on the back of the news but has since declined about 15% from the yearly high. Data shows that the price decline started two weeks ago, around the same time when XRP whales started selling off their holdings. Token price falls to $0.62 following whale dumps &#124; Source: XRPUSD on Tradingview.com What&#8217;s Next For XRP? The XRP ecosystem faced a similar selloff in June, as whales dumped around 120 million XRP after Ripple unlocked its escrow to add another 1 billion tokens into circulation. Sell-offs are likely to trigger more selloffs. So In the short term, we’re likely to see some price volatility and fluctuations as the market absorbs the impact of such a large amount of tokens entering circulation.  The price of XRP, on the other hand, is doing well compared to the overall market. It was reported earlier last month that whales have been amassing more than $500 million in XRP since February in anticipation of positive developments within the ecosystem.  Ripple, the company behind the altcoin, says it is now eyeing the tokenized assets market as it hopes to unlock trillions of dollars of value in the global financial system. Related Reading: Bank Of Canada Study Shows Crypto Ownership In The Country Fell In The Last 2 Years However, Ripple&#8217;s partial victory in court seems to be standing on one foot, as analysts expect an appeal from the SEC. If this happens, it could negatively impact the price of XRP, leading to a downtrend. In such a case, the altcoin&#8217;s gains from last month could quickly be wiped out. XRP is currently trading at $0.6253 and has risen by 31.52% in the last 30 days. Featured image from iStock, chart from Tradingview.com"
  }
]