[
  {
    "source": "CoinDesk",
    "date": "2023-12-15T10:42:11.000Z",
    "title": "Qredo’s Ankex Crypto Exchange Shutters, CEO Michael Moro Leaves",
    "url": "https://www.coindesk.com/business/2023/12/15/qredos-ankex-crypto-exchange-shutters-ceo-michael-moro-leaves/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The hybrid exchange unveiled last year was headed by ex-Genesis CEO Michael Moro, who appears to have departed."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-15T11:02:44.000Z",
    "title": " OpenAI announces second round of AI startup fund ",
    "url": "https://cointelegraph.com/news/open-ai-announces-second-round-ai-startup-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzlmOTdkNTQtMzhmMC00OWJkLWE0OTItM2FjYWZiZDljYjI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>OpenAI said the startup fund initiative is an effort to do its part to help push the boundaries of applied AI in essential domains.</p>\n                    <p><p>OpenAI has opened applications for the second cohort of its six-week program for <a href=\"https://cointelegraph.com/tags/ai\">artificial intelligence (AI)</a> startups, Converge 2, through which it will invest $1 million into each of the 15 successful participants selected. </p><p>The organization behind ChatGPT <a href=\"https://openai.fund/news/converge-2\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that the initiative, accessible worldwide, is aimed at individuals like engineers, designers, researchers, and product builders utilizing AI for innovative purposes. OpenAI founded the Startup Fund on the idea that robust AI systems will fuel a new era of groundbreaking startups.</p><p>The rapid proliferation of AI tools and solutions has ignited support from industry experts and investors alike. Generative AI startups have <a href=\"https://cointelegraph.com/news/ai-startup-helsing-raises-223-million-in-series-b-funding-for-defense-solutions\">received considerable funding</a> from various companies and organizations this year alone. </p><p><a href=\"https://cointelegraph.com/news/open-ai-announces-second-round-ai-startup-fund\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-15T10:47:41.000Z",
    "title": " AI-generated news anchors to present personalized reports on Channel 1 AI in 2024  ",
    "url": "https://cointelegraph.com/news/ai-generated-news-anchors-to-present-personalized-reports-on-channel-1-ai-in-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGI0ZmNmZmEtNWVjYy00YTZjLWE0YmItNTFiNDQ3NjhiOTFkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p> A new AI-generated newsroom plans to launch its programming in early 2024 with AI-generated news anchors delivering AI-generated personalized news - what could possibly go wrong?</p>\n                    <p><p>The media company “Channel 1 AI” is rolling out a brand new newsroom in 2024, but with a catch - it’s powered by generative artificial intelligence (AI) and manned by AI-generated news anchors who will deliver personalized AI-generated content. </p><p>On Dec. 12, the channel released a teaser video of its upcoming segments on the social media platform X, formerly Twitter, with AI-generated news anchors delivering the company’s mission. </p><p>The 22-minute pilot introduced the content as “AI native news” and clarified that it would not constitute stories generated by AI, i.e. fake news, but rather take “trusted news sources” from across the globe to gather and synthesize information into its segments. It claims its goal is to provide “accurate, unbiased news.” </p><p><a href=\"https://cointelegraph.com/news/ai-generated-news-anchors-to-present-personalized-reports-on-channel-1-ai-in-2024\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-15T11:00:24.000Z",
    "title": "Powell’s dovish stance aligns with Federal Reserve’s balance sheet increase",
    "url": "https://cryptoslate.com/insights/powells-dovish-stance-aligns-with-federal-reserves-balance-sheet-increase/",
    "description": "<p>Quick Take Since March 2022, the Federal Reserve, under the leadership of Chairman Powell, has been executing a quantitative tightening policy. The policy, which involves the sell-off of assets, has witnessed the balance sheet of the Federal Reserve shrink by approximately $1.2 trillion, dropping from $8.9 trillion to $7.7 trillion. However, a granular analysis of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/powells-dovish-stance-aligns-with-federal-reserves-balance-sheet-increase/\">Powell&#8217;s dovish stance aligns with Federal Reserve&#8217;s balance sheet increase</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-15T10:41:54.000Z",
    "title": "Solana-based memecoin BONK adds $1B to market cap following exchange listings",
    "url": "https://cryptoslate.com/solana-based-memecoin-bonk-adds-1b-to-market-cap-following-exchange-listings/",
    "description": "<p>The Solana-based memecoin BONK surged by over 100%, reaching a new all-time high in the past 24 hours. This remarkable ascent contributed more than $1 billion to its market capitalization, per CryptoSlate data. With this surge, BONK now ranks as the third-largest memecoin by market capitalization, trailing only Dogecoin and Shiba Inu. BONK&#8217;s market cap [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-based-memecoin-bonk-adds-1b-to-market-cap-following-exchange-listings/\">Solana-based memecoin BONK adds $1B to market cap following exchange listings</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-15T10:44:27.000Z",
    "title": "Crypto Market Set to Rise in 2024 Even if the U.S. SEC Does Not Approve Any Spot Bitcoin ETFs, Sys Matrixport",
    "url": "https://www.cryptoglobe.com/latest/2023/12/crypto-market-set-to-rise-in-2024-even-if-the-u-s-sec-does-not-approve-any-spot-bitcoin-etfs-sys-matrixport/",
    "description": "In the latest issue of crypto financial services firm Matrixport’s “Market Overview” (#2023-62), Markus Thielen, the Head of Research, provides a comprehensive analysis of the crypto market’s future, particularly for the year 2024. He emphasizes the critical role of understanding macroeconomic environments and liquidity considerations in tandem with crypto market structures and fundamentals to accurately […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-15T11:00:58.000Z",
    "title": "Coinbase Reveals ‘Project Diamond’ Initiative, Targets Institutions Issuing Native Digital Assets",
    "url": "https://news.bitcoin.com/coinbase-reveals-project-diamond-initiative-targets-institutions-issuing-native-digital-assets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase Reveals &#039;Project Diamond&quot; Initiative, Targets Institutions Issuing Native Digital Assets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/50e62cda-5c27-46eb-9e9c-c2ca23c88dd9.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Coinbase, the largest U.S.-based crypto exchange, has revealed Project Diamond, an initiative that seeks to provide the tools for institutions to issue native digital assets. The project, which integrates several technologies, including Coinbase&#8217;s layer 2 product Base, the USDC stablecoin, Coinbase Prime custody services, and its Web3 wallet, has received approval from the Financial Services [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T11:06:57.000Z",
    "title": "First Trust Submits Filing for Innovative Bitcoin Buffer ETF",
    "url": "https://www.cryptopolitan.com/first-trust-submit-filing-bitcoin-buffer-etf/",
    "description": "First Trust, an asset management firm, has filed for the first-ever Bitcoin Buffer Exchange-Traded Fund (ETF). The ETF is designed to offer a unique form of protection for investors involved in Exchange Traded Products (ETP) trading in the United States. The submission of the filing to the United States Securities and Exchange Commission (SEC) marks [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T10:55:57.000Z",
    "title": "Neochromosome’s AI Tool Revolutionizes Enzyme Engineering in Collaboration with University of Edinburgh",
    "url": "https://www.cryptopolitan.com/ai-tool-revolutionizes-enzyme-engineering/",
    "description": "In a collaboration, Neochromosome, Inc., a leading biotechnology company specializing in genome-scale cell engineering, announced a pioneering partnership with Dr. Giovanni Stracquadanio of the University of Edinburgh. The collaboration leverages the power of artificial intelligence (AI) and machine learning to propel the development of designer enzymes. This cutting-edge approach aims to enhance the engineering processes [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T10:41:33.000Z",
    "title": "OpenAI’s GPT-4.5 Leak Sparks Speculation; Sam Altman Responds",
    "url": "https://www.cryptopolitan.com/openais-gpt-4-5-leak-sparks-speculation-sam-altman-responds/",
    "description": "In a recent turn of events, a purported leak surrounding OpenAI&#8217;s highly anticipated GPT-4.5 has stirred up excitement and speculation within the tech community. The saga unfolded when a screenshot began circulating on various online platforms, claiming to reveal details about GPT-4.5&#8217;s capabilities and models. However, OpenAI CEO Sam Altman swiftly debunked these claims, leaving [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-15T11:00:00.000Z",
    "title": "This defi project may reshape crypto, investors circling",
    "url": "https://crypto.news/this-defi-project-may-reshape-crypto-investors-circling/",
    "description": "Apart from Ethereum (ETH) and XRP, investors have been exploring BorroeFinance (ROE)"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-15T10:45:03.000Z",
    "title": "Ethereum’s dominance to persist despite Solana’s investor appeal, Coinbase says",
    "url": "https://crypto.news/ethereums-dominance-to-persist-despite-solanas-investor-appeal-coinbase-says/",
    "description": "Although investors &#8216;have been heavily&#8217; allocating to Solana throughout 2023, Ethereum will still be the top smart contracts platform in 2024, Coinbase says. In a new report titled &#8220;2024 Crypto Market Outlook,&#8221; Coinbase noted that throughout 2023 net fund inflows&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-15T10:41:39.000Z",
    "title": "Buy XRP: analyst advises",
    "url": "https://crypto.news/buy-xrp-analyst-advises/",
    "description": "Crypto analyst Austin Hilton predicts the XRP token price will dip further before surging higher based on his proprietary indicators."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T11:00:34.000Z",
    "title": "Crypto Analyst Who Predicted Bitcoin 2023 Bull Run Releases New Target",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-2023-bull-run-new-target/",
    "description": "A crypto analyst who correctly predicted that Bitcoin would hit the heights it is currently enjoying has once again given projections as to Bitcoin’s future trajectory. As part of his predictions, he highlighted the best and worst-case scenarios for the flagship cryptocurrency going forward.  Bitcoin Could Ride To $60,000 In a live stream on his TechnicalRoundup YouTube channel, crypto analyst DonAlt noted that Bitcoin could rise to the resistance level of $60,000 based on historical patterns. The analyst had highlighted a bullish setup on the quarter timeframe, which had occurred both in 2018 and 2021. He also mentioned that the current quarterly is strikingly similar to those periods.  Related Reading: Ethereum Supply Turns Deflationary Post-Merge, Here’s How Much ETH Has Left Circulation The analyst believes that the road to $60,000 would be fuelled by the Spot Bitcoin ETF rumors (as has been the case so far) before an approval possibly comes in January. However, it is not all good news from the $60,000 price level, as DonAlt believes that the approval will be a ‘sell-the-news’ event. If that were to be the case, he predicts that Bitcoin will drop to $35,000 before it trends upward afterward. He also provided a bearish side to the quarterly timeframe setup as he suggested that this is more likely to happen as it is more “accurate.”  For the bearish setup, he projects a close below the resistance level of $35,000.  He stated that this would suggest a bearish restest and that investors could expect lower prices as a result of this.  BTC price looks to retest $43,000 &#124; Source: BTCUSD On Tradingview.com Why An ETF Approval Will Be A ‘Sell-The-News’ Event DonAlt further elaborated on his stance of a possible Spot Bitcoin ETF approval in January being a ‘sell-the-news’ event. He explained that the reason for this belief is because Bitcoin has ridden high (up about 3x from the bottom) on the back of these rumors. As such, this would naturally suggest that it is already priced in. He further noted that he would have had a different opinion if Bitcoin had, for example, traded at around $25,000 and then an approval came. He believes that would have been an easy trade as the flagship cryptocurrency will undoubtedly fly high on the back of such development.  Related Reading: Crypto Analyst Predicts Cardano (ADA) Price Will Rise 1700% To $11, Gives Reasons Why Renowned Economist Peter Schiff shares similar sentiments as he once noted how Bitcoin has rallied significantly on the back of the ETF rumor. According to him, there will be no more “good news” to spark a Bitcoin rally once the pending Spot Bitcoin ETFs are approved. However, trading firm QCP Capital recently highlighted what could prevent this from happening. The firm stated that a significant amount of inflows into these ETFs in the first few weeks of trading could prevent the classic sell-the-news event from happening. If these funds see enough liquidity, they project that Bitcoin could hit its all-time high (ATH) of $69,000 instead.  Featured image from The Block, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-15T11:08:19.000Z",
    "title": "Bitcoin Game-Changer: First Trust’s BTC Butter ETF Opens the Floodgates for Trillion-Dollar Banks to Invest in Bitcoin and Push It to $80,000",
    "url": "https://www.crypto-news-flash.com/bitcoin-game-changer-first-trusts-btc-butter-etf-opens-the-floodgates-for-trillion-dollar-banks-to-invest-in-bitcoin-and-push-it-to-80000/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-game-changer-first-trusts-btc-butter-etf-opens-the-floodgates-for-trillion-dollar-banks-to-invest-in-bitcoin-and-push-it-to-80000",
    "description": "<img width=\"640\" height=\"426\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/kanchanara-jM1sLPJnzqE-unsplash-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"bitcoin ETFs may occur within a three-day period in January\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/kanchanara-jM1sLPJnzqE-unsplash-1.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/kanchanara-jM1sLPJnzqE-unsplash-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/kanchanara-jM1sLPJnzqE-unsplash-1-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />The innovative First Trust Bitcoin Buffer 30 ETF, set to launch soon, offers unique protection against initial losses, marking a novel approach in crypto investments. With the SEC reviewing multiple Bitcoin ETF proposals and experts predicting BTC&#8217;s significant price surge, a major shift in the cryptocurrency investment landscape is imminent. The First Trust Bitcoin Buffer [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-15T11:06:14.000Z",
    "title": "BONK Overtakes Shiba Inu: Trading Volume Soars Over 110% in 24 Hours",
    "url": "https://www.crypto-news-flash.com/bonk-overtakes-shiba-inu-trading-volume-soars-over-110-in-24-hours/?utm_source=rss&utm_medium=rss&utm_campaign=bonk-overtakes-shiba-inu-trading-volume-soars-over-110-in-24-hours",
    "description": "<img width=\"1280\" height=\"910\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-300x213.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-1024x728.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-768x546.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-269x192.png 269w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-24x17.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-36x26.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-48x34.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Solana (SOL)-based dog-themed asset Bonk made a 106 percent surge in the last 24 hours. Its trading volume surpasses that of Shiba Inu while its market cap also makes a 58.7 percent increase.  Bonk has made a whopping 24-hour surge of 106.54% to trade at $0.00003. This overnight performance puts it in the race for [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-15T10:50:28.000Z",
    "title": "Top Privacy Coins for the Next Bull Run – Part 2",
    "url": "https://www.altcoinbuzz.io/reviews/altcoin-projects/top-privacy-coins-for-the-next-bull-run-part-2/",
    "description": "<p>AIs will meticulously track and correlate your every move with superhuman efficiency. Governments, corporations, and hackers will wield the ability to rewind your life, unveiling a complete timeline of your every joy, sorrow, and every place you&#8217;ve ever been. The conventional year-end tax ritual will evolve into a continuous obligation, with transactions triggering real-time tax [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/reviews/altcoin-projects/top-privacy-coins-for-the-next-bull-run-part-2/\">Top Privacy Coins for the Next Bull Run &#8211; Part 2</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-15T11:06:54.000Z",
    "title": "Polygon’s Founder Says Chainlink Integration Is a “Game-Changer for DeFi”",
    "url": "https://coinedition.com/polygons-founder-says-chainlink-integration-is-a-game-changer-for-defi/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/LINK-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/LINK-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Sandeep Nailwal, founder of Polygon, took to X (formerly Twitter) to share his optimism following Chainlink’s Data Feeds integration on Polygon zkEVM, highlighting it as one of the significant strides on the blockchain heading into 2024.    Nailwal, in a tweet, noted that the recent development underscored the continued partnership between Chainlink and Polygon since 2021. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/polygons-founder-says-chainlink-integration-is-a-game-changer-for-defi/\">Polygon’s Founder Says Chainlink Integration Is a “Game-Changer for DeFi”</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-15T10:48:30.000Z",
    "title": "Ripple’s CTO Clarifies Rationale Behind 100 Billion XRP Total Supply",
    "url": "https://coinedition.com/ripples-cto-clarifies-rationale-behind-100-billion-xrp-total-supply/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Over Support From XRP Community\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Over-Support-From-XRP-Community-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent Twitter exchange, lawyer Bill Morgan sparked a thoughtful discussion about the decision behind issuing 100 billion coins on the XRPL (XRP Ledger) and its implications for tokenomics. The conversation unfolded in response to a user&#8217;s observation about SOL&#8217;s circulating supply being significantly smaller than XRP&#8217;s, prompting Morgan to delve into the rationale [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ripples-cto-clarifies-rationale-behind-100-billion-xrp-total-supply/\">Ripple’s CTO Clarifies Rationale Behind 100 Billion XRP Total Supply</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]