[
  {
    "source": "Decrypt",
    "date": "2024-02-07T15:01:16.000Z",
    "title": "Pyth’s Airdrop Put $140 Million Into Crypto Users' Wallets—Now Round 2 Is Here",
    "url": "https://decrypt.co/216210/pyth-airdrop-140-million-round-2-solana-dapps",
    "description": "The second phase of the DeFi oracle network’s Solana token airdrop will benefit the makers of dapps that utilize Pyth data. "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T14:52:08.000Z",
    "title": " Bitcoin is likely to be flat until summer — so trade bravely ",
    "url": "https://cointelegraph.com/news/bitcoin-flat-until-summer-trade-bravely",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYzJlMjNlOWUtMTIyZi00MWYwLWE0NmMtMzBkZjY5ODJiM2M2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto market hasn't moved much since the launch of Bitcoin ETFs, and data indicates it may stay that way for the first half of 2024.</p>\n                    <p><p>Since the end of January, the market has experienced a remarkable U-turn on its interest rate expectations, and that’s no surprise. On Jan. 31, we saw the first United States Federal Open Market Committee (FOMC) meeting of the year and, contrary to expectations, policymakers <a href=\"https://cointelegraph.com/news/bitcoin-price-stumbles-fomc-federal-reserve-dashes-hopes-rate-cuts\">took a decidedly hawkish stance</a>, all but ruling out the chances of an interest rate cut in March. Then, on the subsequent Friday, U.S. labor data came in far stronger than expected. </p><p>Now, 83.5% of market participants expect the Federal Reserve to hold rates at their current level of 5.25%-5.5% in March, according to the CME FedWatch Tool: a remarkable change of heart from just a week ago, when more than half of market participants were convinced that rate cuts were imminent. Indeed, even a May rate cut appears less certain now, with 70% of respondents to a recent CNBC Fed Survey <a href=\"https://www.cnbc.com/2024/01/30/the-fed-will-cut-rates-fewer-times-and-start-them-later-than-market-hopes-according-to-cnbc-fed-survey.html\" target=\"_blank\" rel=\"noopener nofollow\"></a><a href=\"https://web.archive.org/web/20240000000000*/https://www.cnbc.com/2024/01/30/the-fed-will-cut-rates-fewer-times-and-start-them-later-than-market-hopes-according-to-cnbc-fed-survey.html\" target=\"_blank\" rel=\"noopener nofollow\">forecasting</a> a cut no earlier than June. </p><p>With the labor market as strong as it has been, this gradual loss of confidence in a March rate cut is to be expected. The January unemployment report revealed that the U.S. economy added a whopping 353,000 jobs for the month, nearly doubling analysts' expectations of 185,000. Unemployment is sitting at 3.7%, a multi-year low. And while there’s some anecdotal talk of layoffs, we have yet to see any meaningful weakness filter through to the broader employment metrics.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-flat-until-summer-trade-bravely\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-07T14:58:34.000Z",
    "title": "Korean FSC mandates crypto exchanges keep 80% in cold storage, criminals face up to life in prison",
    "url": "https://cryptoslate.com/korean-fsc-mandates-crypto-exchanges-keep-80-in-cold-storage-criminals-face-up-to-life-in-prison/",
    "description": "<p>The Financial Services Commission of South Korea has announced that the implementation date of its Virtual Asset User Protection Law is July 19, 2024. Last year, the law was established to safeguard users in the digital asset market and instill a regulated environment. This legislation embodies provisions aimed at curtailing unfair trading practices and enforcing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/korean-fsc-mandates-crypto-exchanges-keep-80-in-cold-storage-criminals-face-up-to-life-in-prison/\">Korean FSC mandates crypto exchanges keep 80% in cold storage, criminals face up to life in prison</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-07T14:57:57.000Z",
    "title": "Optimism Rallies Ahead of Token Unlock, Fantom and KangaMoon Set for Massive Price Gains",
    "url": "https://cryptodaily.co.uk/2024/02/optimism-rallies-ahead-of-token-unlock-fantom-and-kangamoon-set-for-massive-price-gains",
    "description": "The Optimism (OP) community is buzzing with anticipation for one of the biggest token unlocks in February. The altcoin price has continued to rise, despite the potential sell-off that the 24 million OP tokens due to be released in the next weeks could inject."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-07T14:53:44.000Z",
    "title": "Ripple Price Decline — Solana Experiences Price Fluctuation While Meme Moguls Investors Enjoy 90% ROI",
    "url": "https://cryptodaily.co.uk/2024/02/ripple-price-decline-solana-experiences-price-fluctuation-while-meme-moguls-investors-enjoy-90-roi",
    "description": "The cryptocurrency market has been oscillating between bullish and bearish sentiments, with top coins like Solana (SOL) and Ripple (XRP) experiencing a bearish trend."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-07T14:48:56.000Z",
    "title": "Analyst Michaël Van De Poppe Remains Bullish for Ethereum (ETH), Pullix (PLX) Presale Close To Finish, Monero (XMR) Still a Top Gaining Altcoin",
    "url": "https://cryptodaily.co.uk/2024/02/analyst-michael-van-de-poppe-remains-bullish-for-ethereum-eth-pullix-plx-presale-close-to-finish-monero-xmr-still-a-top-gaining-altcoin",
    "description": "Prominent crypto analyst Michaël Van De Poppe has a lot of hope for the future growth of Ethereum (ETH). Meanwhile, Pullix (PLX), now in Stage 7 of its presale, has just two stages before its launch. Many analysts have pegged this altcoin as the next 20x token in 2024. Not only that, Monero (XMR) has shown tremendous growth recently."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:05:58.000Z",
    "title": "Financial Institutions Boost AI Adoption to Combat Money Laundering",
    "url": "https://www.cryptopolitan.com/ai-adoption-to-combat-money-laundering/",
    "description": "In response to escalating geopolitical tensions and the persistent threat of terrorism financing, financial institutions are ramping up efforts to prevent money laundering. The Securities and Exchange Commission (SEC) has identified money laundering as a top risk area for 2024, urging enhanced compliance measures, particularly in customer due diligence and beneficial ownership tracking. Regulatory focus [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:05:06.000Z",
    "title": "Friendzone to launch on Polygon PoS, pioneering Web3 social media transformation",
    "url": "https://www.cryptopolitan.com/friendzone-to-launch-on-polygo-web3-social/",
    "description": "Friendzone, a decentralized social marketplace, has announced its entry into the Polygon PoS ecosystem, marking a significant milestone in the evolution of Web3 social applications. Spearheaded by veterans from Band Protocol, Synthetix, and Koinly, Friendzone aims to revolutionize the social media landscape through decentralized technologies.&#160; The strategic collaboration with Polygon PoS signifies a commitment to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:04:04.000Z",
    "title": "OpenAI Introduces a metadata Image feature for ChatGPT",
    "url": "https://www.cryptopolitan.com/openai-metadata-image-feature-for-chatgpt/",
    "description": "OpenAI, a leading artificial intelligence research laboratory, has announced a significant enhancement to its ChatGPT model. The latest development involves the integration of metadata for images, aiming to enrich the conversational capabilities of the AI. This innovation marks a substantial stride in bridging the gap between textual and visual understanding within AI systems. With the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T14:53:53.000Z",
    "title": "Apple Unveils Revolutionary AI Model for Image Editing",
    "url": "https://www.cryptopolitan.com/apple-unveils-ai-model-for-image-editing/",
    "description": "Apple recently introduced a groundbreaking AI model for instruction-based image editing called MGIE. This open-source project aims to enhance the controllability and flexibility of image manipulation through natural language commands. The model, spotted by VentureBeat, is poised to revolutionize how users interact with and edit images. MGIE: Redefining image editing with natural language instructions The [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T15:07:37.000Z",
    "title": "$100 Million Worth of XRP (XRP) Moved from Co-founder Wallet, Solana (SOL) Shows Rallying Signs While Meme Moguls (MGLS) Prepares for Uniswap Listing",
    "url": "https://www.crypto-news-flash.com/100-million-worth-of-xrp-xrp-moved-from-co-founder-wallet-solana-sol-shows-rallying-signs-while-meme-moguls-mgls-prepares-for-uniswap-listing/?utm_source=rss&utm_medium=rss&utm_campaign=100-million-worth-of-xrp-xrp-moved-from-co-founder-wallet-solana-sol-shows-rallying-signs-while-meme-moguls-mgls-prepares-for-uniswap-listing",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T142219.001.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T142219.001.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T142219.001-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T142219.001-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T142219.001-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A report making waves in the crypto industry highlights the recent theft of over $100 million worth of XRP (XRP) to trigger a further price decline. On the other hand, Solana is showing faint signs of a bullish resurgence amid a dip in price value. Meanwhile, Meme Moguls (MGLS), one of the top meme coins [...]"
  }
]