[
  {
    "source": "Decrypt",
    "date": "2024-02-06T16:59:39.000Z",
    "title": "Bitcoin Halving Nears and BTC Miner CleanSpark Is Preparing for Lower Fees",
    "url": "https://decrypt.co/216101/bitcoin-halving-nears-and-btc-miner-cleanspark-is-preparing-for-lower-fees",
    "description": "The new acquisitions will bump up CleanSpark's Bitcoin mining capacity to 2.4 exahashes per second, says the company."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-06T16:41:27.000Z",
    "title": "Farcaster Explained: The Blockchain-Powered Decentralized Social Media Protocol",
    "url": "https://decrypt.co/resources/farcaster-explained-the-blockchain-powered-decentralized-social-media-protocol",
    "description": "Farcaster leverages blockchain technology to provide a framework on which multiple social media apps can be built."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-06T16:41:18.000Z",
    "title": "Robinhood Adds MetaMask for Easier Ethereum Buys",
    "url": "https://decrypt.co/216091/robinhood-metamask-crypto-ethereum",
    "description": "The integration aims to make buying digital coins and tokens a seamless experience."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T17:05:00.000Z",
    "title": " Meta may apply ‘penalties’ to users who fail to disclose use of generative AI for images ",
    "url": "https://cointelegraph.com/news/meta-may-apply-penalties-generative-ai-artificial-intelligence-images",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNjYyYjVmMTMtZjg0MC00YTQxLWIxNTItODM4YzFhNjIxYTZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The company says “AI-generated content is also eligible to be fact-checked.” </p>\n                    <p><p>Meta will roll out new standards surrounding AI-generated content on Facebook, Instagram and threads over the coming months, according to a Jan. 6 company blog post.</p><p>Content that’s <a href=\"https://about.fb.com/news/2024/02/labeling-ai-generated-images-on-facebook-instagram-and-threads/\" target=\"_blank\" rel=\"noopener nofollow\">identified</a> as AI-generated, due to metadata or other intentional watermarking, will be given a visible label. Users on Meta platforms will also get the option to flag unlabeled content suspected of being AI-generated. </p><p>If any of this sounds familiar, it’s because it mirrors Meta’s early content moderation practices. Prior to the onset of the era of AI-generated content, the company (then Facebook), developed a user-facing system for reporting content that violated the platform’s terms of service.</p><p><a href=\"https://cointelegraph.com/news/meta-may-apply-penalties-generative-ai-artificial-intelligence-images\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T17:04:09.000Z",
    "title": "Satoshi Trial: Craig Wright confronted on fake evidence, ‘I am better at code than words’ – Day 2",
    "url": "https://cryptoslate.com/satoshi-trial-craig-wright-confronted-on-fake-evidence-i-am-better-at-code-than-words-day-2/",
    "description": "<p>Bitcoin&#8217;s origin story took center stage on day two as Dr. Craig Wright, who claims to be Satoshi Nakamoto, took the witness stand under oath. Wright faces allegations of presenting forged documents to support his identity claim by the Crypto Open Patent Alliance (COPA). In the initial morning session, Justice Mellor explicitly stated the difficulty [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/satoshi-trial-craig-wright-confronted-on-fake-evidence-i-am-better-at-code-than-words-day-2/\">Satoshi Trial: Craig Wright confronted on fake evidence, &#8216;I am better at code than words&#8217; &#8211; Day 2</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-06T16:48:49.000Z",
    "title": "Sei (SEI) Might Be Losing Its Spark, Is Optimism (OP) the Next Crypto Giant?",
    "url": "https://cryptodaily.co.uk/2024/02/sei-sei-might-be-losing-its-spark-is-optimism-op-the-next-crypto-giant",
    "description": "Uncover the contrasting trajectories of Optimism (OP) and Sei (SEI) in the cryptocurrency market. OP shows a promising uptrend, while SEI faces bearish trends amid anticipations of the Sei v2 upgrade. Our analysis dives into their current positions, technical indicators, and potential future scenarios in the volatile crypto space."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T17:00:00.000Z",
    "title": "Polygon (MATIC) Has A New Competitor Set To Outperform It",
    "url": "https://www.cryptopolitan.com/polygon-matic-has-a-new-competitor-set-to-outperform-it/",
    "description": "Polygon (MATIC) faces new competition from Pandoshi (PAMBO), a cryptocurrency that&#8217;s quickly gaining momentum and showing signs it could outshine its rival. With its innovative approach to decentralized finance (DeFi) and a presale that&#8217;s drawing attention across the crypto community, Pandoshi is emerging as a serious contender. Pandoshi (PAMBO): The Polygon Killer? Launching new cryptocurrencies [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T17:00:00.000Z",
    "title": "Diversifying Crypto Portfolio: Assessing the Growth Potential of Borroe Finance, Bitcoin, and Chainlink",
    "url": "https://www.cryptopolitan.com/diversifying-crypto-portfolio-assessing-the-growth-potential-of-borroe-finance-bitcoin-and-chainlink/",
    "description": "If you are keen to diversify your crypto portfolio, experts suggest three cryptocurrencies &#8211; Borroe Finance ($ROE), Bitcoin (BTC), and Chainlink (LINK). Despite being one of the new DeFi projects, $ROE is poised for unprecedented growth. On the other hand, BTC offers an intense positive outlook before halving, and LINK shows great resilience in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T16:56:45.000Z",
    "title": "Zora Expands to Arbitrum, Unveils ‘Arb Zorb’ Commemorative NFT",
    "url": "https://www.cryptopolitan.com/zora-arbitrum-arb-zorb-commemorative-nft/",
    "description": "In a significant move that enriches the landscape of the digital art and collectibles market, Zora, a prominent NFT (Non-Fungible Token) marketplace, has officially extended its platform to the Arbitrum network. This expansion is marked by the launch of a special commemorative NFT named &#8216;Arb Zorb,&#8217; symbolizing the collaboration between the two dynamic ecosystems. Moreover, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-06T16:59:52.000Z",
    "title": "Haru Invest CEO, two others arrested in South Korea for $828m crypto fraud",
    "url": "https://crypto.news/haru-invest-ceo-two-others-arrested-in-south-korea-for-828m-crypto-fraud/",
    "description": "South Korean authorities are making headway in the Haru case from 2023, where the yield-bearing service froze withdrawals after accepting nearly $1 billion from customers."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T17:00:44.000Z",
    "title": "Bitcoin, Solana Take Center Stage In $721 Million In Institutional Inflows",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-solana-721-million-inflows/",
    "description": "According to a CoinShares report, Bitcoin and Solana led the way in the amount of institutional inflows into digital asset investment products last week. The report also highlighted an emerging trend among Spot Bitcoin ETFs in the US.  Bitcoin Records $703 Million In Inflows Bitcoin is reported to have seen inflows totaling $703 million last week, thereby accounting for 99% of all flows into these investment products. Solana came in a distant second with an inflow of $13 million, outperforming the second-largest crypto token, Ethereum, which saw an inflow of $6.4 million.  Related Reading: Crypto Token Unlocks To Cross $700 Million In February 2024, Here Are The Culprits The spotlight was on Spot Bitcoin ETFs in the US, with these funds seeing an inflow of $721 million last week. These new ETFs are said to have now averaged $1.9 billion in inflows over the last four weeks, bringing their total inflows to $7.7 billion since launch. Meanwhile, Grayscale’s GBTC has contributed largely to the $6 billion that these funds have recorded as outflows so far.  CoinShares noted that these outflows have slowed in recent weeks, suggesting that GBTC investors have cooled off on taking profits. The inflows recorded by other Spot Bitcoin ETFs have also been able to overshadow GBTC’s outflows. NewsBTC had also recently reported how BlackRock’s IBIT had surpassed GBTC in trading volume for the first time.  A Drop In Trading Volume Last week was a relatively slow week for digital asset investment products in terms of trading volume. The report highlighted how trading volumes in ETPs (Exchange Traded Products) fell to $8.2 billion compared to the prior week’s total of $10.6 billion. This drop in trading volume was well evident in the figures that the Spot Bitcoin ETFs recorded last week.  Related Reading: Crypto Analyst Says ADA Price Will Rise To $8, Here’s When Notably, these funds recorded a daily trading volume of $924 million on February 1 last week, the first time that the trading volume was under $1 billion. This trend continued the next day, with the Spot Bitcoin ETFs combined recording $922 million in trading volume.  Bloomberg analyst Eric Balchunas, however, suggested that there was no need to be alarmed. He noted in an X (formerly Twitter) post how there is usually a slow decline after a big, hyped launch. What is, however, evident is the fact that these funds have lived up to the hype so far. BlackRock and Fidelity alone (the top two issuers by AuM, excluding Grayscale) now hold over 134,358 BTC ($5.7 billion) for their Spot Bitcoin ETFs.  Interestingly, their funds also made the top 10 of all ETF inflows in January. This shows an impressive interest in the funds and that institutional adoption of the flagship crypto token is on the rise.  BTC bears beat down price to $42,700 &#124; Source: BTCUSD on Tradingview.com Featured image from Analytics Insight, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-06T17:03:00.000Z",
    "title": "Crypto Fear Returns as FTX Moves to Dump More Tokens; Is Bitcoin Price at Risk?",
    "url": "https://coinedition.com/crypto-fear-returns-as-ftx-moves-to-dump-more-tokens-is-bitcoin-price-at-risk/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Moves Millions for Liquidation; Crypto Market Faces New Selling Pressure\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Speculation has emerged that the crypto market could be at risk of another significant selling pressure amid the movement of millions of dollars by bankrupt FTX entities to liquid platforms for a potential liquidation. Market tracker Spot On Chain recently disclosed via social media platform X that wallets associated with FTX and Alameda have moved [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-fear-returns-as-ftx-moves-to-dump-more-tokens-is-bitcoin-price-at-risk/\">Crypto Fear Returns as FTX Moves to Dump More Tokens; Is Bitcoin Price at Risk?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]