[
  {
    "source": "CoinDesk",
    "date": "2024-03-14T12:48:42.000Z",
    "title": "First Mover Americas: Robinhood Shares Jump, Layer 2s Become Cheaper",
    "url": "https://www.coindesk.com/markets/2024/03/14/first-mover-americas-robinhood-shares-jump-layer-2s-become-cheaper/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for March 14, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T13:00:36.000Z",
    "title": "Protocol Village: BNB Chain Unveils 'Rollup-as-a-Service,' to Spur Layer 2s Built on BSC",
    "url": "https://www.coindesk.com/tech/2024/03/14/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 14-March 20."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-14T13:08:09.000Z",
    "title": "Bitcoin Runes Are Coming—And Xverse Wallet Is Getting Ready",
    "url": "https://decrypt.co/221663/bitcoin-runes-xverse-wallet",
    "description": "Ahead of the mainnet rollout at the halving, Bitcoin wallet Xverse has added testnet support for the Runes fungible token standard."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T12:52:20.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">With the community abuzz with excitement over Ethereum’s Dencun upgrade, the CEO of Fuel Labs told Cointelegraph that the biggest benefit will be greater stabilization, rather than a lowering of fees. Dogecoin jumped nearly 10% after Elon Musk hinted his electric car manufacturer could add Dogecoin (DOGE) as an official payment method for Tesla cars. Meanwhile, Crypto.com was fined $3 million by Dutch authorities for operating without a license.</p><p>While most people were focusing on the promised transaction fee reduction for layer-2 scaling networks, the most significant benefit of the upgrade is actually<a href=\"https://cointelegraph.com/news/dencun-stabilization-not-reduction\"> fee stabilization</a>, Nick Dodson, the co-founder and CEO of Fuel Labs, told Cointelegraph in an exclusive interview.</p><p>“On the point of EIP-4844, a lot of people talk about the fee reduction, but it’s more about fee stabilization. It’s actually more about expanding capacity and scale and not so much lowering fees,” he said.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T12:50:00.000Z",
    "title": " Moon or doom: Why do so many crypto startups fail?  ",
    "url": "https://cointelegraph.com/news/crypto-startups-failure-business-markets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZmY3ZTM1MGYtMTdkZi00NDkxLTg4MWQtM2YyODgzN2JiN2EwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto startups often fail in droves, with some estimates claiming upward of  95% go out of business, but it’s not always clear why.  </p>\n                    <p><p data-ct-non-breakable=\"true\">Creating a successful startup is challenging at the best of times, especially in the crypto industry, where an estimated 95% of startups fail.</p><p>There <a href=\"https://cointelegraph.com/news/venture-funds-eye-recovery-2024-capital-remains-tight\">have been thousands of crypto startups</a> as the industry has developed. <a href=\"https://www.crunchbase.com/hub/cryptocurrency-startups\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the business platform Crunchbase, at least 2,619 are operating in various stages of development as of 2024. </p><p>There has also been a fair share of cryptocurrencies, with over 24,000 <a href=\"https://www.coingecko.com/research/publications/how-many-cryptocurrencies-failed\" target=\"_blank\" rel=\"noopener nofollow\">listed </a>on CoinGecko since 2014, but at least 14,039 have died since then. </p><p><a href=\"https://cointelegraph.com/news/crypto-startups-failure-business-markets\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-14T13:07:33.000Z",
    "title": "Crypto.com hit with €2.85 million fine by Dutch Central Bank for regulatory noncompliance",
    "url": "https://cryptoslate.com/crypto-com-hit-with-e2-85-million-fine-by-dutch-central-bank-for-regulatory-noncompliance/",
    "description": "<p>Crypto.com has incurred a €2.85 million ($3.1 million) fine from the Netherlands Central Bank for operating within the European country without registration for two years. The penalty specifically targets Forix DAX Mt, the Dutch trading entity of Crypto.com. In a March 13 statement, it was revealed that the Apex Bank imposed this fine on the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-com-hit-with-e2-85-million-fine-by-dutch-central-bank-for-regulatory-noncompliance/\">Crypto.com hit with €2.85 million fine by Dutch Central Bank for regulatory noncompliance</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-14T12:41:18.000Z",
    "title": "Apple Vision Pro: Former Head of Oculus at Meta Says the ‘Hardware Bleeds Genius and Audacity’",
    "url": "https://www.cryptoglobe.com/latest/2024/03/apple-vision-pro-former-head-of-oculus-at-meta-says-the-hardware-bleeds-genius-and-audacity/",
    "description": "Recently, Hugo Barra, a former head of Oculus at Meta (the parent company of Facebook), explained in detail what he thinks about Apple’s first spatial computer, the Vision Pro, which Apple unveiled on 5 June 2023. Hugo Barra is a well-known technology executive who has held leadership positions at several prominent companies in the tech […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T13:03:18.000Z",
    "title": "Bitcoin Millionaire Who Bought BTC At $100 Predicts 10x Gains For These 3 Cryptos",
    "url": "https://cryptodaily.co.uk/2024/03/bitcoin-millionaire-who-bought-btc-at-100-predicts-10x-gains-for-these-3-cryptos",
    "description": "Insights from individuals who have achieved significant success can provide valuable perspectives for both seasoned investors and newcomers alike."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T13:02:02.000Z",
    "title": "Antler Interactive to Showcase Their Latest Creation, Cloudborn, at GDC",
    "url": "https://cryptodaily.co.uk/2024/03/antler-interactive-to-showcase-their-latest-creation-cloudborn-at-gdc",
    "description": "Antler Interactive to Showcase Their Latest Creation, Cloudborn, at GDC"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T12:58:11.000Z",
    "title": "Insider Secrets: How BEFE Coin's $100 Investment Opportunity Led to $2 Million Payouts",
    "url": "https://cryptodaily.co.uk/2024/03/insider-secrets-how-befe-coins-100-investment-opportunity-led-to-2-million-payouts",
    "description": "At $73,000 USD, Bitcoin has reached new all-time highs and the value of the cryptocurrency market has reached almost $2.7 trillion."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T12:51:13.000Z",
    "title": "Uncover the Secret: $200 in Bitgert Coin Could Catapult You to Millionaire Status",
    "url": "https://cryptodaily.co.uk/2024/03/uncover-the-secret-200-in-bitgert-coin-could-catapult-you-to-millionaire-status",
    "description": "Experts predict the altcoin market will witness a huge pump as Bitcoin reaches its ATH. Which makes us think, which coin will lead the altcoin rally?"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T13:06:12.000Z",
    "title": "MAP Protocol Joins NVIDIA to Enhance Blockchain Interoperability with AI",
    "url": "https://www.cryptopolitan.com/map-protocol-nvidia-blockchain-ai/",
    "description": "MAP Protocol has officially announced its entry into the NVIDIA Developer Program. The strategic collaboration is set to catapult the interoperability of Bitcoin into a new era, leveraging the formidable AI capabilities of NVIDIA.  As a significant player in the Bitcoin ecosystem, MAP Protocol&#8217;s initiative to integrate AI for advancing interoperability research and implementation marks [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T13:05:38.000Z",
    "title": "Antler Interactive to Showcase Their Latest Creation, Cloudborn, at GDC",
    "url": "https://www.cryptopolitan.com/antler-interactive-to-showcase-their-latest-creation-cloudborn-at-gdc/",
    "description": "Stockholm, Sweden, March 14th, 2024, Chainwire Antler Interactive is bringing their latest creation, Cloudborn &#8211; A Web3 PC RPG with a sprinkle of MMO &#8211; into the limelight at GDC 2024. The turn-based battler set in a fantasy sky island realm is poised to take immersive gaming experiences to new heights by intertwining cutting-edge technology [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T13:04:40.000Z",
    "title": "Financial Sector Hit by 1 Million Cyberattacks in 120 Days",
    "url": "https://www.cryptopolitan.com/1-million-cyberattacks-in-120-days/",
    "description": "In a recent revelation by BlackBerry Limited (NYSE: BB), the global financial sector has been besieged by a staggering one million cyberattacks within a mere 120 days. The report, unveiled today, underscores a pressing issue that threatens the stability and security of critical infrastructure worldwide. The alarming surge in cyber threats BlackBerry&#8217;s Global Threat Intelligence [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T12:58:23.000Z",
    "title": "Supermarket Simulator Sparks Controversy Over Alleged Use of AI in Promotional Images",
    "url": "https://www.cryptopolitan.com/supermarket-simulator-sparks-controversy/",
    "description": "Supermarket Simulator, an indie game developed by Nokta Games, has recently come under scrutiny following speculation that artificial intelligence (AI) might have been employed in creating its promotional images. The game, available on Steam, allows players to manage their virtual supermarkets, boasting significant popularity since its release on February 20. Viral success and allegations With [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T12:42:25.000Z",
    "title": "Nigeria holds Binance execs, eyes March 20 court hearing",
    "url": "https://www.cryptopolitan.com/nigeria-holds-binance-execs-eyes-march-20-hearing/",
    "description": "In a recent development reported by the Wall Street Journal, two high-ranking officials from Binance, the global cryptocurrency exchange, are to remain in detention in Nigeria. The officials, American Tigran Gambaryan and U.K.-Kenyan Nadeem Anjarwalla, are scheduled for a court hearing on March 20. Their arrest on February 26 came after their arrival in Abuja [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T13:00:51.000Z",
    "title": "Brace For Impact: MicroStrategy Is Planning Another $500 Million Bitcoin Purchase",
    "url": "https://www.newsbtc.com/news/bitcoin/microstrategy-500-million-bitcoin/",
    "description": "American business intelligence and software development company, MicroStrategy has unveiled new plans to acquire an additional Bitcoin, further bolstering its already substantial BTC holdings. MicroStrategy Mega Bitcoin Purchase In The Works In a recent press release published on MicroStrategy&#8217;s official website, the software development company announced plans to raise $500 million in convertible debt offerings to purchase more Bitcoin. Just a few days ago the company had sold approximately $800 million in convertible debt offerings, using the proceeds of the sale to acquire about 12,000 BTC valued at about $821.7 million at the time.  Related Reading: Shiba Inu Whales Are Accumulating SHIB, Do They Know Something You Don’t? Quite frankly, MicroStrategy seems to be on a full-blown Bitcoin acquisition spree, potentially attributed to the cryptocurrency’s massive bullish rallies recently and its surge to new all-time highs. As of March 11, 2024, the business intelligence firm possesses a total of 205,000 BTC, worth over $15 billion based on CoinMarketCap’s Bitcoin price of $73,411, at the time of writing.   With its latest purchase of 12,000 BTC, MicroStrategy has finally surpassed the Bitcoin holdings of BlackRock’s Spot Bitcoin Exchange Traded Fund (ETF). Additionally, the software development company has secured the top position as the leading public company with the largest Bitcoin holdings, surpassing the holdings of both Tesla and Coinbase. As of March 2024, MicroStrategy’s market capitalization has surged to $29.96 billion, reflecting an increase of 10.85% in the last 24 hours. The company is also presently ranked as the world’s 642nd most valuable company by market capitalization.  MicroStrategy Sets Sights On Convertible Senior Notes Offerings Since the start of the year, MicroStrategy has purchased nearly 16,000 BTC. This time around the company has chosen to raise capital through convertible senior notes, marking a shift from the previous year when most of its funds for acquiring BTC were generated from equity.  According to Market Watch’s report, the business intelligence firm’s stock value has also been on the rise recently, with MSTR prices witnessing an impressive 145% increase in a month.  Related Reading: Ethereum Is Not Done: Crypto Analyst Sets New $5,000 Target As stated in its press release, the company intends to sell convertible senior notes to qualified institutional buyers. MicroStrategy has revealed plans to grant early purchasers of the notes an option to buy up to an additional $75 million worth of the notes within 13 days after the initial issuance.  The software development firm has disclosed that the notes will remain unsecured, with interests payable semi-annually starting in September 2024. Additionally, MicroStrategy will have the right to redeem the notes from March 2028 or holders can request for the company to make a repurchase, with conversion terms determined at the offering’s prices. The proceeds and excess funds generated from its upcoming $500 million convertible senior notes sale will be used to expand MicroStrategy’s Bitcoin holdings and for general corporate purposes.  BTC price falls to $72,700 &#124; Source: BTCUSD on Tradingview.com Featured image from The Guardian, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-14T13:00:25.000Z",
    "title": "Explosive Potential Dogecoin’s Price May Surge By 550%, Coinstore Listing Drives Growth for Dogecoin Rival",
    "url": "https://www.crypto-news-flash.com/explosive-potential-dogecoins-price-may-surge-by-550-coinstore-listing-drives-growth-for-dogecoin-rival/?utm_source=rss&utm_medium=rss&utm_campaign=explosive-potential-dogecoins-price-may-surge-by-550-coinstore-listing-drives-growth-for-dogecoin-rival",
    "description": "<img width=\"1200\" height=\"752\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-14T094400.452.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-14T094400.452.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-14T094400.452-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-14T094400.452-768x481.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-14T094400.452-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-14T094400.452-450x282.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The cryptocurrency market is wild, filled with unexpected twists and turns. While established players like Bitcoin and Ethereum continue to dominate the headlines, there&#8217;s always room for surprises. One such surprise could be Dogecoin (DOGE), the meme-inspired token that took the internet by storm a few years back. Dogecoin&#8217;s Potential Surge: A &#8220;Relatively Safe Trade&#8221; [...]"
  }
]