[
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T00:44:21.000Z",
    "title": "Ripple CLO says XRP ruling bodes well for Coinbase, Binance SEC cases",
    "url": "https://cryptoslate.com/ripple-clo-says-xrp-ruling-bodes-well-for-coinbase-binance-sec-cases/",
    "description": "<p>Ripple CLO Stuart Alderoty said on July 25 that a ruling concerning the securities status of the XRP token could be relevant to other ongoing cases. In mid-July, Ripple obtained a legal victory against the U.S. Securities and Exchange Commission (SEC). The ruling largely found that Ripple and its executives had not engaged in unregistered [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ripple-clo-says-xrp-ruling-bodes-well-for-coinbase-binance-sec-cases/\">Ripple CLO says XRP ruling bodes well for Coinbase, Binance SEC cases</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-26T01:00:00.000Z",
    "title": "Bitcoin ($BTC) Could Surge to $180,000 Ahead of 2024 Halving, Fundstrat Predicts",
    "url": "https://www.cryptoglobe.com/latest/2023/07/bitcoin-btc-could-surge-to-180000-ahead-of-2024-halving-fundstrat-predicts/",
    "description": "In a recently published note, investment research firm Fundstrat has recently made a staggering Bitcoin ($BTC) price prediction, suggesting the cryptocurrency could see a leap of over 500% from its current value to reach the $180,000 mark ahead of its upcoming halving in April 2024. As Markets Insider reported, Fundstrat indicated that while daily demand […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T00:53:41.000Z",
    "title": "Why Does DRM-Like System on the Web by Google Raise Concerns?",
    "url": "https://www.cryptopolitan.com/why-does-drm-like-system-the-web-by-google/",
    "description": "Google&#8217;s proposal for a Web Environment Integrity API, tagged as a DRM-like system by users, has sparked widespread worry among Internet users. The idea, introduced by four Google workers in the &#8220;Web Environment Integrity Explainer&#8221; on GitHub, suggests implementing a token system to assess the authenticity of a device and browser session. While Google claims ... <a title=\"Why Does DRM-Like System on the Web by Google Raise Concerns?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-does-drm-like-system-the-web-by-google/\" aria-label=\"More on Why Does DRM-Like System on the Web by Google Raise Concerns?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T01:00:57.000Z",
    "title": "Tezos (XTZ) Loses Steam In Q2, Market Cap Drops 30% Following SEC Crackdown",
    "url": "https://www.newsbtc.com/analysis/xtz/tezos-xtz-loses-steam-in-q2-market-cap-drops-30-following-sec-crackdown/",
    "description": "According to a recent report by crypto research firm Messari, Tezos has been progressing in its roadmap development, with several new features and upgrades being introduced to the network.  The platform&#8217;s core developers have announced a strategic shift to hybrid optimistic/zk rollups, with multiple teams committed to building rollups that will enable the platform to process more transactions per second (TPS) and enhance scalability. Tezos DeFi Ecosystem Booms Per the report, the recent launch of the 14th network upgrade, Nairobi, has brought improvements to the platform, new rollup functionality, and enhanced attestations.  In addition, Tezos core developers have unveiled the Data Availability Layer (DAL), which operates in parallel with Tezos Layer-1 and ensures data availability while scaling bandwidth and storage capacity. Tezos has also been experiencing growing traction in the Decentralized Finance (DeFi) space, with the Total Value Locked (TVL) nearly doubling in the past year. The platform is seeing the launch of several new DeFi protocols, including novel DEXs, lending protocols, and perps protocols. To further support the growth of the Tezos ecosystem, the XTZ Ecosystem DAO has been introduced to manage and distribute XTZ, Tezos’ native token, to support community initiatives.  Nevertheless, despite experiencing a strong Q1 2023, with market capitalization surging from $0.66 billion to $1.03 billion (+55%), outperforming the broader market by 9%, the platform saw a 30% Quarter-over Quarter (QoQ) drop in Q2, ending the quarter with a market capitalization of $0.72 billion, primarily following the SEC&#8217;s complaints against Binance and Coinbase. Related Reading: Here’s How Crypto Offers A Lifeline For This Bahamian Payment Company Furthermore, the total crypto market capitalization during Q2 increased by 2%, driven by Bitcoin and Ethereum, which saw a 7% and 6% rise, respectively, propelled by the introduction of Bitcoin Spot Exchange-Traded Funds (ETFs).  On the other hand, Tezos&#8217; revenue, measured by total gas fees spent (excluding storage costs), experienced an 82% QoQ decrease in Q2, primarily influenced by a 79% decrease in the average transaction fee.  The reduction in the average transaction fee was attributed to the decline of the XTZ price and a slowdown in NFT front-running bidding activities. Fixed Inflation Rate And Burn Mechanisms  Tezos&#8217; native token, XTZ, serves multiple functions within the network, including staking, governance, and payment for gas fees.  The token has a fixed annual inflation rate of 4.4%, with a total supply of 965 million XTZ. The report notes that Tezos has implemented burn mechanisms by creating new accounts or smart contracts and imposing penalties on misbehaving validators.  Moreover, During Q2, Tezos displayed consistent usage levels compared to previous quarters. The network recorded an average of 53,000 daily smart contract calls and 41,000 daily transactions, indicating a 7% decrease and a 1% decline in QoQ, respectively.  However, NFTs remain the key driver of activity on Tezos, while DeFi applications continue to see greater adoption. Related Reading: Bitcoin Coinbase Premium Turns Red, US Institutions Disinterested? Conversely, Tezos&#8217; ecosystem experienced mixed activity, with NFTs and gaming remaining relatively flat, while DeFi continues to see increased activity. Regarding decentralization and staking, Tezos has a globally distributed validator set with a high staking rate relative to other base-layer protocols. Looking ahead, Tezos&#8217; strategic shift in its roll-up roadmap, continued developments in the Data Availability Layer, and the anticipated activation of the Hybrid Optimistic/ZK Rollup hold promise for further growth and innovation on the network.  Overall, Tezos remains a promising player in the blockchain space, with a robust ecosystem and a growing community of developers and users. Currently, the price of XTZ is $0.810801, representing a 0.41% price decline in the last 24 hours and a 2.06% price decline in the past 7 days.  The 24-hour trading volume for XTZ is $15,383,765.48, indicating significant trading activity on the Tezos network.  Featured image from Unsplash, chart from TradingView.com"
  }
]