[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T11:00:00.000Z",
    "title": "Salesforce Leads $6M Round for AI-Backed Web3 Data Platform Mnemonic",
    "url": "https://www.coindesk.com/business/2023/06/14/salesforce-leads-6m-round-for-ai-backed-web3-data-platform-mnemonic/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The startup provides actionable non-fungible token (NFT) data for enterprises and developers."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-14T10:47:58.000Z",
    "title": "Fashion Brands Still ‘Nervous’ to Set IP Loose in Metaverse: BNV CEO",
    "url": "https://decrypt.co/144555/fashion-brands-still-nervous-set-ip-loose-in-metaverse-bnv-ceo",
    "description": "Allowing users to create their own versions of products is a “big step” for brands, BNV CEO Richard Hobbs told Decrypt."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T11:07:00.000Z",
    "title": "Top 7 IT certifications in demand\t",
    "url": "https://cointelegraph.com/news/top-7-it-certifications",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4b40e344-17ce-46ad-a2f9-a5559e45720c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Obtaining IT certifications can help you stay ahead in the competitive tech industry and unlock exciting opportunities.</p>\n                    <p><p>In today’s tech-driven world, certain IT certifications are highly sought-after. The top seven in-demand IT certifications are CISSP, PMP, CCSP, CDP, CCNP, CEH and AWS Certified Solutions Architect. Obtaining these certifications can open doors to lucrative career opportunities.</p><p>These certifications cover a variety of specializations, including data management, networking, information security, project management, cloud security and ethical hacking. These credentials not only confirm your abilities and knowledge but also increase your marketability and open doors to rewarding employment opportunities with competitive salaries. By obtaining these in-demand credentials, one can stay ahead of the curve and advance their IT career.</p><h2>Certified Information Systems Security Professional (CISSP)</h2><p>(ISC)² offers the widely recognized <a href=\"https://www.isc2.org/Certifications/CISSP#\" target=\"_blank\" rel=\"noopener nofollow\">CISSP certification</a>. It certifies knowledge of a range of information security topics, including asset security, communication and network security, identity and access management, security assessment and testing, security operations, and software development security. It also certifies knowledge of security and risk management.</p><p>By going over all eight CISSP domains, the official CISSP certification training offered by (ISC)² helps students to get ready for the certification exam. It features thorough study materials, sample questions and engaging learning tools.</p><h2>Project Management Professional (PMP)</h2><p>The PMP designation is one of the most well-known qualifications for project management experts. The <a href=\"https://www.pmi.org/certifications/project-management-pmp\" target=\"_blank\" rel=\"noopener nofollow\">Project Management Institute (PMI)</a> offers and certifies knowledge of the project’s conception, planning, execution, monitoring and closure phases.</p><p>Authorized training organizations that have received PMI approval provide training for the PMP certification. The Project Management Body of Knowledge (PMBOK) handbook is covered in these courses, offering useful insights into project management best practices and approaches.</p><h2>Certified Cloud Security Professional (CCSP) </h2><p>The <a href=\"https://enroll.isc2.org/product?catalog=CCSP-SPT-GLOBAL&amp;utm_source=isc2&amp;utm_medium=button&amp;utm_campaign=GBL-CCSPosp&amp;utm_term=selfstudyresources&amp;utm_content=training&amp;_gl=1*15kdxvh*_ga*MjI0MzYzOTk3LjE2ODY2NjIxMjk.*_ga_7V1PGHSZT0*MTY4NjY2MjEyOC4xLjEuMTY4NjY2MzE1Ny4wLjAuMA..\" target=\"_blank\" rel=\"noopener nofollow\">CCSP certification</a> was created for experts who operate in cloud settings. The course, which (ISC)² offers, covers topics such as cloud concepts, architecture, governance, data security, operations and legal compliance.</p><p>Training for CCSP Certification: Through approved training providers, (ISC)²  provides official CCSP training. These courses provide in-depth knowledge of cloud security principles and best practices while covering the CCSP areas.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/top-7-blockchain-courses-and-certifications-for-beginners\">Top 7 blockchain courses and certifications for beginners</a></em></strong></p><h2>Certified Data Professional (CDP)</h2><p><a href=\"https://iccp.org/certified-data-professional-cdp.html\" target=\"_blank\" rel=\"noopener nofollow\">CDP</a> is a comprehensive accreditation for data professionals. Data management, data governance, data analytics, data science and data architecture are just a <a href=\"https://cointelegraph.com/news/15-important-data-terms\">few of the topics</a> it covers.</p><p>The Institute for Certification of Computing Professionals (ICCP) provides the CDP accreditation program. DAMA offers tools, study materials and resources to aid candidates in getting ready for the certification exam.</p><h2>Cisco Certified Network Professional (CCNP) </h2><p>Cisco Systems offers the professional-level certification known as the <a href=\"https://www.cisco.com/c/en/us/training-events/training-certifications/certifications/professional/ccnp-enterprise.html\" target=\"_blank\" rel=\"noopener nofollow\">CCNP</a>. It concentrates on cutting-edge networking theories and methods, such as routing, switching, security, teamwork and wireless networking.</p><p>Cisco works with approved training partners to provide training for the CCNP certification. These courses offer practical experience using Cisco networking hardware and cover the subjects and technologies included in the CCNP certification examinations.</p><h2>Certified Ethical Hacker (CEH)</h2><p>The <a href=\"https://www.eccouncil.org/train-certify/certified-ethical-hacker-ceh/\" target=\"_blank\" rel=\"noopener nofollow\">CEH certification</a> verifies ethical hacking and penetration testing abilities. It gives experts the skills and information needed to find weaknesses, safeguard computer systems, and carry out <a href=\"https://cointelegraph.com/news/what-is-ethical-hacking-and-how-does-it-work\">legal hacking</a> operations.</p><p>The EC-Council provides approved CEH training that covers a range of subjects, such as system hacking, web application penetration testing, network scanning, enumeration and more. Candidates receive instructions on how to get ready for the CEH certification test.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">9. Information Security Certifications:<br><br>- CompTIA Security+<br>- Certified Ethical Hacker (CEH)<br>- GIAC Security Essentials (GSEC)<br>- Certified Information Systems Security Professional (CISSP)<br>- Certified Information Security Manager (CISM)</p>&mdash; ‘Tunde Omotoye (@TundeTASH) <a href=\"https://twitter.com/TundeTASH/status/1262759305310162949?ref_src=twsrc%5Etfw\">May 19, 2020</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>AWS Certified Solutions Architect</h2><p>The <a href=\"https://aws.amazon.com/certification/certified-solutions-architect-associate/\" target=\"_blank\" rel=\"noopener nofollow\">AWS Certified Solutions Architect</a> certification is designed for professionals working with Amazon Web Services (AWS) cloud services. It verifies an understanding of creating and deploying fault-tolerant, scalable and highly available applications on the AWS platform.</p><p>The fundamental AWS services, architectural best practices and typical application architectures are the subject of this certification. AWS infrastructure, security, storage, networking, database services and AWS deployment and management are some of the subjects covered in the program.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/10-emerging-technologies-in-computer-science-that-will-shape-the-future\">10 emerging technologies in computer science that will shape the future</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T10:45:49.000Z",
    "title": "TRON brings in investment firm DWF Labs to add liquidity to ecosystem",
    "url": "https://cryptoslate.com/tron-brings-in-investment-firm-dwf-labs-to-add-liquidity-to-ecosystem/",
    "description": "<p>TRON has partnered with digital asset investment firm DWF Labs, per Bloomberg, with the firm &#8220;eager to further support the ecosystem with additional investment in the near future.&#8221; Part of the tie-in will see DWF Labs become a liquidity provider to support the growth of the TRON blockchain ecosystem. The managing partner of DWF Labs, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tron-brings-in-investment-firm-dwf-labs-to-add-liquidity-to-ecosystem/\">TRON brings in investment firm DWF Labs to add liquidity to ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T10:50:00.000Z",
    "title": "Binance Gives Liquidity Assurance, Crypto Daily TV 14/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/binance-gives-liquidity-assurance-crypto-daily-tv-14-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Bank of China issues $28M in digital structured notes on Ethereum blockchain</p>\n<p>Bank of China&rsquo;s investment bank subsidiary BOCI announced the issuance of 200 million Chinese yuan worth of digital structured notes minted on the Ethereum blockchain. The move makes BOCI the first Chinese financial institution to issue a tokenized security in Hong Kong.</p>\n<p>Taiwan Mobile in talks on possible investment in local crypto platform</p>\n<p>Telecommunications company Taiwan Mobile Co. is exploring opportunities for collaboration with local crypto platforms, including potentially investing in one of the businesses. The government-licensed wireless service provider is in early-stage talks with crypto firms about strategic partnerships.</p>\n<p>Binance plans to swap 750 million of token pairs to ensure liquidity</p>\n<p>Binance said it would swap 750 million tether-tron token pairs for tether-ether in an attempt to maintain the stablecoin's liquidity. The move comes amid renewed regulatory scrutiny at the world's largest cryptocurrency exchange and will help cushion some of the fallout from recent blows, including Binance being sued by the U.S.SEC.</p>\nBTC/USD corrected downwards by 0.2% in the last session.\n<p>The Bitcoin-Dollar pair fell 0.2% in the last session after gaining as much as 1.9% during the session. The MACD is giving a negative signal. Support is at 25440.3333 and resistance at 26352.3333.</p>\n<p>The MACD is currently in negative territory.</p>\n<p></p>\nETH/USD corrected downwards by 0.2% in the last session.\n<p>The Ethereum-Dollar pair dropped 0.2% in the last session after rising as much as 1.1% during the session. The RSI is giving a negative signal, which matches our overall technical analysis. Support is at 1706.251 and resistance at 1775.931.</p>\n<p>The RSI is giving a negative signal.</p>\n<p></p>\nXRP fell 0.4% against USD in the last session.\n<p>The last session saw the Ripple drop 0.4% against the Dollar. The ROC is giving a negative signal. Support is at 0.5014 and resistance at 0.5398.</p>\n<p>The ROC is giving a negative signal.</p>\n<p></p>\nLTC/USD traded sideways in the last session.\n<p>Litecoin-Dollar price remained largely unchanged in the last session. According to the Williams indicator, we are in an oversold market. Support is at 74.41 and resistance at 79.41.</p>\n<p>The Williams indicator points to an oversold market.</p>\n<p></p>\nDaily Economic Calendar:\n<p>DE 10-y Bond Auction</p>\n<p>The auction sets the average yield on the bonds auctioned off. Yields are set by bond market investors, and therefore they can be used to estimate investors' outlook on future interest rates. Germany's 10-y Bond Auction will be released at 09:30 GMT, the UK's Gross Domestic Product at 06:00 GMT, Japan's Imports at 23:50 GMT.</p>\n<p>UK Gross Domestic Product</p>\n<p>The Gross Domestic Product is a measure of the total value of all goods and services produced by a country. The GDP is considered as a broad measure of economic activity and health.</p>\n<p>JP Imports</p>\n<p>Imports of goods and services consist of transactions in goods and services (purchases, barter, gifts or grants) from non-residents to residents. </p>\n<p>JP Exports</p>\n<p>The Exports measure of the total exports of goods and services by the local economy. A steady demand for exports helps to support growth in the trade surplus. Japan's Exports will be released at 23:50 GMT, the US Fed Interest Rate Decision at 18:00 GMT, the UK's Industrial Production at 06:00 GMT.</p>\n<p>UK Industrial Production</p>\n<p>Industry is a basic category of business activity. Changes in the volume of the physical output of the nation's factories, mines and utilities are measured by the index of the industrial production.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T10:45:02.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T11:00:38.000Z",
    "title": "What Bitcoin And Crypto Traders Can Expect From Today’s FOMC Meeting",
    "url": "https://www.newsbtc.com/news/what-bitcoin-crypto-traders-expect-fomc/",
    "description": "The Bitcoin and crypto market faces the most important event of this week and probably the entire month of June today with the Federal Open Market Committee (FOMC) meeting of the US Federal Reserve (Fed) at 2:00 pm EST (release of the interest rate decision) and the following press conference at 2:30 pm EST. For the first time since the Fed started its rate hike cycle in March 2022, an overwhelming majority expect a pause. The CME FedWatch tool currently indicates a 95.3% probability that there will be no change at today&#8217;s meeting. A breather, in other words, keeping interest rates at current levels, would give the central bank more time to observe the effects of its fight against inflation. And big banks agree with these expectations. As macro analyst Ted (@tedtalksmacro) shows, only one of nine major banks, namely Citi, expects another 25 basis point rate hike. All other major banks such as Goldman Sachs, J.P. Morgan and Morgan Stanley expect a pause. Most important, therefore, will be the new &#8220;dot plot&#8221;, the Fed members&#8217; projection of future interest rate path. Any correction to the upside will likely drive equities down and the dollar index (DXY) up, according to the analyst. Bitcoin and crypto are likely to follow this trend. Happy hawkish pause day! The market gives a 96% probability that the Fed pause today after hiking rates at every meeting since March 2022. Major banks agree. Most important, will be the new ‘dot plot’ —&#62; any revisions higher would spook equities lower and the dollar higher. pic.twitter.com/M8UQkmXoZG — tedtalksmacro (@tedtalksmacro) June 14, 2023 The US bond market is currently pricing in another rate hike by the Federal Reserve and a rate cut by the end of 2023, as Walter Bloomberg reported today. However, it is likely to be more binary, says Michael Contopoulos, director of fixed income at Richard Bernstein Advisors, in a note. Related Reading: FUD Or Real: Is Binance Selling Bitcoin To Prop Up BNB? Either the Fed does not cut, or growth falls off so hard it is cutting a lot,&#8221; Contopoulos says. His guess is the former. &#8220;Higher than expected CPI could very well tilt them to a hike. Otherwise, I think they will pause,&#8221; he says. The bond market is pricing in 200 basis points of rate cuts in 2024, the expert says, adding that this would mean the recession won&#8217;t hit until next year. &#8220;I tend to agree with that&#8221;. However, it is not inconceivable that the Fed could hike further after a pause. As the Bank of Canada (BoC) shows, this is entirely possible. The BoC raised rates again by 25 basis points (to 475 bps) in June after a two-month pause. Related Reading: Bitcoin Price Looks Set To Start Recovery Toward $27K, Here’s Why And the probability of another quarter-point rate hike in July is 63%, according to the CME FedWatch Tool. In this respect, the dot plot could be the trend-setting indicator today to gauge whether equities as well as Bitcoin and crypto are falling or rising. If the dot plot sees any downward revisions, BTC and crypto are likely to start a new upward push. Otherwise, any upward revisions (&#8220;higher for longer&#8221;) of the projections would be rather bearish. And as on-chain analyst Ali Martinez noted today, the Bitcoin price is on thin ice: Notice the most important support zone is between $22,785 and $23,595 where 1.34 million wallets hold 450,000 $BTC. On the flip side, #BTC faces stiff resistance between $26,000 and $28,250 where 5.18 million wallets bought 2.1 million BTC. At press time, the Bitcoin price remained relatively calm ahead of today&#8217;s interest rate decision. In the 1-hour chart, BTC shows a good chance of a breakout from the current mini range (coincides with the $26,250 resistance to the upside of Ali) around the FOMC meeting, which should trigger another round of volatility. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T11:00:38.000Z",
    "title": "Can Shiba Inu Deliver 100% in June? Expert’s Opinion",
    "url": "https://www.crypto-news-flash.com/can-shiba-inu-deliver-100-in-june-experts-opinion/?utm_source=rss&utm_medium=rss&utm_campaign=can-shiba-inu-deliver-100-in-june-experts-opinion",
    "description": "Trends, new developments, and adoption are factors with the biggest influence in the crypto market. And for projects like Shiba Inu, there have been various positives in these areas lately, leading to growing optimism among investors that a price uptick might be near. However, the competition in the market seems to be getting tougher as [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T10:45:48.000Z",
    "title": "Ethereum Price Holds Strong at $1,700 Support: Unveiling Profitable Strategies for the Week Ahead",
    "url": "https://www.crypto-news-flash.com/ethereum-price-holds-strong-at-1700-support-unveiling-profitable-strategies-for-the-week-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-price-holds-strong-at-1700-support-unveiling-profitable-strategies-for-the-week-ahead",
    "description": "Ethereum price has been hovering around the $1,700 support level after a sell-off triggered by the SEC last week. The upcoming United States Federal Open Market Committee (FOMC) meeting could potentially impact Ethereum price, as a pause in interest rate hikes is expected, leading to increased investor optimism. Ethereum&#8217;s price has encountered a challenging phase [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T11:00:10.000Z",
    "title": "Paxful Ex-CEO Advocates Pan-African Crypto to Drive Economic Growth",
    "url": "https://coinedition.com/paxful-ex-ceo-advocates-pan-african-crypto-to-drive-economic-growth/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-Prediction-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-Prediction-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-Prediction-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-Prediction-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a thought-provoking tweet, Ray Youssef, the former CEO of Paxful, a leading peer-to-peer Bitcoin marketplace, expressed his belief that a pan-African currency backed by cryptocurrency could revolutionize the African economy. Youssef’s tweet drew attention to the potential of such a currency to fuel rapid development and transform Africa into an economic powerhouse. His tweet [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/paxful-ex-ceo-advocates-pan-african-crypto-to-drive-economic-growth/\">Paxful Ex-CEO Advocates Pan-African Crypto to Drive Economic Growth</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]