[
  {
    "source": "Bitcoin.com",
    "date": "2024-03-08T22:30:09.000Z",
    "title": "Bitcoin Futures Market Attracts Unprecedented Open Interest as Derivatives Appetite Grows ",
    "url": "https://news.bitcoin.com/bitcoin-futures-market-attracts-unprecedented-open-interest-as-derivatives-appetite-grows/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Futures Market Attracts Unprecedented Open Interest as Derivatives Appetite Grows \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/futures.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The latest bitcoin derivatives data indicates a continued climb in bitcoin futures open interest, hitting all-time peaks. Over the last day, statistics reveal an open interest of $32.30 billion across fourteen distinct bitcoin futures markets. Soaring Open Interest in BTC Futures Signals Growing Derivatives Market Friday, March 8, 2024, marked a notable day when BTC [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-08T22:30:14.000Z",
    "title": "Dogecoin Could Hit $1 If History Repeats, Analyst Reveals When",
    "url": "https://www.newsbtc.com/dogecoin-2/dogecoin-hit-1-history-repeats-analyst-when/",
    "description": "An analyst has explained that Dogecoin may be able to hit $1 if history repeats for it. Here&#8217;s when exactly this could happen for DOGE. Dogecoin Has Been Breaking Out Of A Parallel Channel Recently In a new post on X, analyst Ali has discussed a potential outcome for Dogecoin based on the historical pattern. Below is the chart for the weekly price of the memecoin shared by the analyst, which reveals a similar-seeming pattern that the asset has followed over the years. The trend in the weekly price of DOGE over the last few years &#124; Source: @ali_charts on X As Ali has highlighted in the chart, before both of its previous two major bull runs, Dogecoin&#8217;s weekly price consolidated inside a specific parallel channel for a notable amount of time. Related Reading: This Bitcoin Indicator Has Hit Levels That Often Lead To Corrections The &#8220;parallel channel&#8221; here refers to a pattern in technical analysis (TA) made up of two parallel trendlines inside which the price of the asset consolidates. Parallel channels can be of different types, like ascending and descending ones, but in the context of the current discussion, channels parallel to the time axis are relevant. The upper trendline in such a pattern is drawn by joining together tops, while the lower line connects bottoms. When the price retests either of these lines, a reversal is more probable. This means that a retest of the upper line could break the uptrend and cause the asset to go through a drawdown. Similarly, the lower line may be a source of support and help the price reverse itself back up. However, a break out of either of these lines can imply a continuation of the trend in that direction. The graph shows that when the weekly price of Dogecoin saw breakouts like this out of the respective consolidation channels the last two times, it went through bull rallies. In the past couple of years, it would appear that DOGE has once again gone through a similar period of consolidation as those previous two, and recently, the coin has been breaking out. Related Reading: Dogecoin Accumulation: DOGE Millionaires Have Shot Up By 76% Ali has marked a potential trajectory that Dogecoin could follow in the chart based on the precedent set by these last two bull runs. &#8220;This may sound wild, but if history is any guide, Dogecoin $DOGE could hit $1 by mid-April!&#8221; says the analyst. From the current cryptocurrency price, such a run would suggest an increase of more than 488% for the memecoin in less than a month and a half. Obviously, a rally like this would be super impressive if it ends up playing out like this. It remains to be seen what trajectory Dogecoin follows now that it has seemingly broken free of its long parallel consolidation channel. DOGE Price When writing, Dogecoin is trading around $0.17, up 36% in the past week. Looks like the price of the coin has slumped to sideways movement in the last couple of days &#124; Source: DOGEUSD on TradingView Featured image from Crystal Mapes on Unsplash.com, charts from TradingView.com"
  }
]