[
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T14:40:24.000Z",
    "title": "Deutsche Bank to offer crypto services with Taurus as custody partner",
    "url": "https://cryptoslate.com/deutsche-bank-to-offer-crypto-services-with-taurus-as-custody-partner/",
    "description": "<p>Deutsche Bank, one of the leading financial institutions in the world, will integrate Swiss crypto firm Taurus’ digital asset custody and tokenization services for its clients, according to a Sept. 14 statement shared with CryptoSlate. Per the statement, the partnership between both entities extends Deutsche Bank’s recent digital asset-focused initiatives, including its recent application for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/deutsche-bank-to-offer-crypto-services-with-taurus-as-custody-partner/\">Deutsche Bank to offer crypto services with Taurus as custody partner</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T14:56:43.000Z",
    "title": "Cardano's Vision vs. Domini.art's 340% Presale Surge vs. Stellar's Stability",
    "url": "https://cryptodaily.co.uk/2023/09/cardanos-vision-vs-dominiarts-340-presale-surge-vs-stellars-stability",
    "description": "The cryptocurrency universe is an exciting and diverse space, brimming with promise and pitfalls. Visionary platforms like Cardano ($ADA) aim to decentralize governance through smart contracts, while projects like Stellar ($XLM) stand as a steady beacon, providing swift cross-border transactions and payment solutions."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T14:50:35.000Z",
    "title": "Shiba Inu Excels After Shibarium Launch, Binance Coin Expands Ecosystem, Everlodge to Change Real Estate Investments",
    "url": "https://cryptodaily.co.uk/2023/09/shiba-inu-excels-after-shibarium-launch-binance-coin-expands-ecosystem-everlodge-to-change-real-estate-investments",
    "description": "Based on on-chart data, the total number of wallets on Shiba Inu (SHIB)'s newly launched Layer-2 blockchain surpassed 1 million."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T14:44:12.000Z",
    "title": "Solana (SOL), Polkadot (DOT), and Pomerdoge (POMD): Analyst's Top Three Tokens To Hold in September",
    "url": "https://cryptodaily.co.uk/2023/09/solana-sol-polkadot-dot-and-pomerdoge-pomd-analysts-top-three-tokens-to-hold-in-september",
    "description": "Solana (SOL), Polkadot (DOT), and Pomerdoge (POMD) - are three tokens that have garnered attention from analysts and investors alike for their potential to shine in September."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T14:45:34.000Z",
    "title": "LBank Announces Second Launchpad Project – MetaExpand (UMM)",
    "url": "https://news.bitcoin.com/lbank-announces-second-launchpad-project-metaexpand-umm/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/albanks.jpg 1267w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Recently, market sentiment and expectations for the GameFi sector (also known as &#8216;X to Earn&#8217;) have soared again. LBank&#8217;s first Launchpad PINS (Chat to Earn) from last month has seen an increase of 1600% even in a bear market. According to the announcement, LBank started its second Launchpad today, still in the GameFi [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T15:04:34.000Z",
    "title": "Nasdaq Soars 32% in 2023 Fueled by AI Growth and Favorable Economic Climate",
    "url": "https://www.cryptopolitan.com/nasdaq-soars-32-in-2023-fueled-by-ai-growth/",
    "description": "The Nasdaq Composite Index, known for its tech-heavy composition, has delivered an exceptional performance in 2023, surging by an impressive 32%. This remarkable upswing can be attributed to a combination of positive economic indicators, including a slowdown in inflation rates, robust economic expansion, reduced recessionary concerns, and the growing influence of artificial intelligence (AI) on ... <a title=\"Nasdaq Soars 32% in 2023 Fueled by AI Growth and Favorable Economic Climate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nasdaq-soars-32-in-2023-fueled-by-ai-growth/\" aria-label=\"More on Nasdaq Soars 32% in 2023 Fueled by AI Growth and Favorable Economic Climate\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T15:00:26.000Z",
    "title": "Ethereum Health: Analyst’s Red Flags And Failed Bullish Patterns",
    "url": "https://www.newsbtc.com/news/ethereum-health-analysts-red-flags-and-failed-bullish-patterns/",
    "description": "Ethereum (ETH) investors are bracing for a turbulent ride ahead as a well-regarded crypto analyst casts a shadow of doubt over the smart contract platform&#8217;s future.  In a recent report, Nicholas Merten predicts that Ethereum has less than a year to break free from an ascending triangle pattern, a technical indicator that holds significant implications for the cryptocurrency&#8217;s trajectory. Related Reading: Tron Shows Might With 4.8-M Daily Transactions – Will This Boost TRX Price? The Enigma Of The Ascending Triangle Pattern In a nutshell, an ascending triangle pattern is a chart formation that typically indicates an impending breakout. It forms when the price of an asset reaches higher lows, forming a rising trendline (the ascending side of the triangle), while facing resistance at a horizontal level (the flat top of the triangle). The longer the pattern persists, the more pressure builds for a decisive price move, either upwards or downwards. Merten, a prominent voice in the crypto community, has been closely monitoring Ethereum&#8217;s performance against this crucial pattern. According to Merten, Ethereum&#8217;s inability to convincingly breach the resistance at around $2,000 is a cause for concern.  &#8220;Ethereum cannot show up to the plate. It keeps getting shot down at around $2,000, and that&#8217;s okay for a while,” he emphasized.” But eventually, you&#8217;ve got to be able to either break out to the upside or, if you break through the ascending line of support to the downside, that spells bad news.&#8221; ETHUSD trading at $1,622 as of Thursday, Sept. 14. Chart: TradingView.com The Ethereum Exodus And Ambiguous Implications Meanwhile, a separate report has presented a puzzling trend that adds to the uncertainty surrounding Ethereum. Approximately 640,000 ETH has recently exited exchanges, a move that could be interpreted as a bullish sign. This outflow suggests that investors might be hoarding Ethereum for the long haul, anticipating a future price surge. However, caution is warranted. Ethereum&#8217;s long-term performance has not been impressive, with persistent bearish trends weighing it down. This raises questions about the credibility of the accumulation theory. While investors might be tempted to stock up on Ethereum at its current lower price point, they must tread carefully given the unpredictable nature of the cryptocurrency market. Related Reading: Can Ethereum Tally Spring Highs After Correction? Top Analyst Shares His Views At the time of writing, Ethereum is trading at $1,619, displaying a 1.7% gain over the past 24 hours, yet nursing a 1.0% loss in the seven-day period, according to CoinGecko. The coming months will likely determine whether Ethereum will defy the odds, break free from its current constraints, and soar to new heights &#8212; or if it will succumb to the pressures outlined by Merten, leading to a collapse that could reshape the crypto landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Daily Express"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T15:00:26.000Z",
    "title": "UNISWAP (UNI) Price Prediction for September: Should You Buy UNI?",
    "url": "https://www.crypto-news-flash.com/uniswap-uni-price-prediction-for-september-should-you-buy-uni/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-uni-price-prediction-for-september-should-you-buy-uni",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T120433.202.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T120433.202.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T120433.202-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T120433.202-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />On the charts, the Uniswap (UNI) price is experiencing the same challenges other tokens are facing, courtesy of the bearish market. With its latest &#8216;victory&#8217; against a lawsuit brought up by some investors, Uniswap (UNI) might be saving a bull run for later in the year. In this article, we’ll discuss experts&#8217; opinions on the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T14:55:09.000Z",
    "title": "Polygon Unveils Ambitious Plans for Ethereum Scaling in Polygon 2.0 to Become the Fastest Blockchain in the Industry",
    "url": "https://www.crypto-news-flash.com/polygon-unveils-ambitious-plans-for-ethereum-scaling-in-polygon-2-0-to-become-the-fastest-blockchain-in-the-industry/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-unveils-ambitious-plans-for-ethereum-scaling-in-polygon-2-0-to-become-the-fastest-blockchain-in-the-industry",
    "description": "<img width=\"640\" height=\"360\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-MATIC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-MATIC.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-MATIC-300x169.jpg 300w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Polygon Labs kickstarts Polygon 2.0 with the introduction of three critical Polygon Improvement Proposals (PIPs). Migration from the existing MATIC token to a new POL token is officially in motion. Delving Deeper into Polygon&#8217;s Strategic Advancements On September 14, Polygon Labs ushered in a new era for its platform by publicizing the genesis of Polygon [...]"
  }
]