[
  {
    "source": "CoinDesk",
    "date": "2024-03-19T18:47:50.000Z",
    "title": "Bitcoin Rebounds to $65K as Investors Weigh Looming Fed Decision Risk",
    "url": "https://www.coindesk.com/markets/2024/03/19/bitcoin-rebounds-to-65k-as-investors-weigh-looming-fed-decision-risk/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Disappointing flows into bitcoin ETFs over the past days partly resulted from investors trimming risks ahead of Wednesday's FOMC meeting, one market observer said."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T19:05:00.000Z",
    "title": " Sequence partners with Google Cloud to simplify Web3 gaming development ",
    "url": "https://cointelegraph.com/news/sequence-partners-google-cloud-simplify-web3-nft-gaming-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZTRhYTgzNjctZTg1MC00YTZmLTk3OWUtM2NlNzg1ZDZlZDVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Horizon Blockchain Games hit Web3 title “Skyweaver” is powered by Sequence.</p>\n                    <p><p>Sequence, a Horizon Blockchain Games platform, has entered into a partnership with Google Cloud to bring its full-stack web3 gaming development suite to cloud users. </p><p>The goal of the integration is to make it easier for web3 developers to leverage web3 building tools through Google’s industry standard cloud computing platform. </p><p>Horizon Blockchain Games <a href=\"https://techcrunch.com/2020/03/06/horizon-raises-another-5m-to-put-virtual-items-on-the-blockchain/\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> in 2019 with a $2.75 million dollar seed round. As of its Series A round in 2022, the company had reportedly raised $53.3 million over four rounds off the strength of its NFT/trading card game “Skyweaver” and tech stack. </p><p><a href=\"https://cointelegraph.com/news/sequence-partners-google-cloud-simplify-web3-nft-gaming-development\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T18:39:56.000Z",
    "title": " Super PAC tried to ‘bury a conversation’ on crypto with attack ads — Rep. Katie Porter ",
    "url": "https://cointelegraph.com/news/super-pac-conversation-crypto-attack-ads",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMmQ2OWQ3ZmEtMjEzOS00OTVhLTliYjctMDRkMDQzYzk3N2EwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>“They don’t know what my crypto views are because they never asked,” said Katie Porter following her defeat in a primary for California’s Senate race.</p>\n                    <p><p>California Representative Katie Porter, who lost a primary race for the United States Senate in March, suggested that targeted ads by a political action committee (PAC) may have contributed to her defeat but did not further the national conversation on crypto.</p><p>In an interview with <em>Pod Save America </em>released on March 19, Porter <a href=\"https://www.youtube.com/watch?v=EuiRBdE0-1I\" target=\"_blank\" rel=\"noopener nofollow\">questioned</a> the motivations behind $10 million worth of spending aimed at derailing her campaign for the U.S. Senate by Fairshake, a Super PAC backed by cryptocurrency firms including Ripple and Coinbase. According to the California lawmaker, negative ads by Fairshake specifically targeted her but failed to promote what could have been a productive discussion on crypto policy.</p><p>“This wasn’t actually a conversation that I think we should be having about crypto, about technology in Congress,” said Porter. “This wasn’t about crypto policy. This wasn’t about engaging me, seeing what I think, teaching me, coming to a policy understanding.”</p><p><a href=\"https://cointelegraph.com/news/super-pac-conversation-crypto-attack-ads\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-19T19:08:54.000Z",
    "title": "Institutions looks to deploy Bitcoin as liquidity to Lightning Network to earn yield",
    "url": "https://cryptoslate.com/institutions-looks-to-deploy-bitcoin-as-liquidity-to-lightning-network-to-earn-yield/",
    "description": "<p>Bitcoin Lightning Network liquidity provider LQWD Technologies has partnered with Amboss Technologies to establish further institutional liquidity on Lightning. The collaboration positions LQWD to contribute liquidity to Amboss&#8217;s marketplace, enabling the fulfillment of market demand for Lightning Network liquidity while generating a yield on LQWD&#8217;s Bitcoin holdings. Amboss, a provider of data analytics solutions and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/institutions-looks-to-deploy-bitcoin-as-liquidity-to-lightning-network-to-earn-yield/\">Institutions looks to deploy Bitcoin as liquidity to Lightning Network to earn yield</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-19T18:48:29.000Z",
    "title": "Coinbase CEO Predicts Crypto Explosion: Spot ETFs Just the Beginning",
    "url": "https://www.cryptoglobe.com/latest/2024/03/coinbase-ceo-predicts-crypto-explosion-spot-etfs-just-the-beginning/",
    "description": "On March 19, Brian Armstrong, the CEO of Coinbase, appeared on Bloomberg TV to discuss various aspects of the cryptocurrency industry, including the impact of spot Bitcoin ETFs on Coinbase’s business, his meetings with lawmakers in Washington, D.C., and the potential approval of spot Ethereum ETFs. Spot Bitcoin ETFs and Coinbase’s Business Armstrong began by […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T18:49:25.000Z",
    "title": "Capitalizing on the Dip: Prime Cryptos to Purchase as Market Growth Pauses",
    "url": "https://cryptodaily.co.uk/2024/03/capitalizing-on-the-dip-prime-cryptos-to-purchase-as-market-growth-pauses",
    "description": "Explore savvy investment strategies during market downturns, focusing on top cryptocurrencies to buy while market growth pauses. Benefit from expert insights to optimize your crypto portfolio."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T18:44:06.000Z",
    "title": "Key Cryptos to Watch for a Rapid Ascent Post-Market Dip",
    "url": "https://cryptodaily.co.uk/2024/03/key-cryptos-to-watch-for-a-rapid-ascent-post-market-dip",
    "description": "Explore our exclusive list of potential cryptocurrencies to observe post-market slump for robust growth. This article dives deep into various key cryptos that exhibit promising future performances, creating investment opportunities you don't want to miss."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T19:05:55.000Z",
    "title": "$RECQ token presale attracts DOGE investors amidst market shifts",
    "url": "https://crypto.news/recq-token-presale-attracts-dogecoin-investors-amidst-market-shifts/",
    "description": "Amid Dogecoin's unpredictable market, Rebel Satoshi's $RECQ emerges as a new investment opportunity in its presale phase, captivating DOGE holders. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T19:00:40.000Z",
    "title": "Injective Launches Important Token Tool As INJ Bleeds",
    "url": "https://www.newsbtc.com/injective/injective-launches-important-token-tool-as-inj-bleeds/",
    "description": "Injective Protocol, a decentralized finance-centric platform, has launched TokenStation. In a blog post on March 18, Injective said the solution, deployed on its mainnet, allows users to launch native tokens. With this tool, Injective said it would empower anyone to create their tokens in a low-fee and scalable environment. Injective Launches TokenStation, Strikes Key Partnership The tool was developed by the Injective community and aims to &#8220;remove barrier to entry for token creation.&#8221; Like the token creation tools on Solana and Ethereum, for example, using TokenStation, part of the blog post won&#8217;t require coding experience.  Related Reading: Top Reasons Why The Bitcoin Price Crashed Below $63,000 This makes it easier for individuals and projects to launch on Injective. Beyond token minting, the tool allows token management and integration of tokenomics mechanisms like burning. The blockchain is launching the TokenStation days after partnering with AltLayer, a platform backed by Binance Labs dedicated to developing roll-up technology for Ethereum. Through this collaboration, the two will build a re-staking security framework for Injective Ethereum Virtual Machine (inEVM) applications. The recently launched inEVM allows developers to seamlessly build applications leveraging the high scalability and near-zero fees on Injective. Additionally, the inEVM is set to increase composability between WebAssembly (WASM) and EVM environments. Through this unique feature, Injective can bridge the interoperability of Cosmos, the developer activity of Ethereum, and the high scalability of Solana.  Will Volan Help Prop Up INJ Prices? In January, Injective Protocol activated the Volan Upgrade, setting the platform&#8217;s plans to build a robust real-world tokenization infrastructure into motion. Part of this was the introduction of a Real-World Asset (RWA) module. In this way, institutions can launch regulatory-compliant security tokens.  Additionally, Volan modified INJ tokenomics, making the token progressively deflationary. Burning reduces INJ tokens over time, a measure adopted by other protocols, including BNB and Ethereum. Related Reading: Shiba Inu Ecosystem Blooms: BONE Jumps 44% With $3 Target In Sight While the upgrade and subsequent partnerships have lifted its prominence in decentralized finance (DeFi), growth has been slower than expected.  So far, DeFiLlama data shows that Injective Protocol commands a total value locked (TVL) of less than $65 million. This is miles behind Solana or Ethereum, two of the world&#8217;s most active smart contract platforms where active DeFi protocols also thrive. Meanwhile, INJ prices, although relatively higher, are under pressure, as seen in the candlestick arrangement in the daily chart. INJ is down 30% from 2024 highs, slipping and following Bitcoin. However, the coin is within a broader consolidation. Resistance and support levels are around $44 and $30, respectively. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-19T18:45:28.000Z",
    "title": "Binance Launches Investigation Into Potential Memecoin Insider Trading, Offering Up to $5,000,000 Reward for Information",
    "url": "https://dailyhodl.com/2024/03/19/binance-launches-investigation-into-potential-memecoin-insider-trading-offering-up-to-5000000-reward-for-information/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/binance-potential-insider.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Binance says it conducted an internal investigation after a trader made staggeringly large gains on a recently listed memecoin. The top global crypto exchange announced on Saturday that it was listing the Book of Meme (BOME), a Solana (SOL)-based coin launched by the art producer DarkFarms, who specializes in pieces based on Pepe the Frog, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/19/binance-launches-investigation-into-potential-memecoin-insider-trading-offering-up-to-5000000-reward-for-information/\">Binance Launches Investigation Into Potential Memecoin Insider Trading, Offering Up to $5,000,000 Reward for Information</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-19T18:41:30.000Z",
    "title": "‘Stop Doing This’ – $122,500,000 Worth of Solana (SOL) Raised in One Week for Altcoin Presales: Report",
    "url": "https://dailyhodl.com/2024/03/19/stop-doing-this-122500000-worth-of-solana-sol-raised-in-one-week-for-altcoin-presales-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Over $122 million has been raised for 27 different Solana-based projects&#8217; presales in the last week, according to a recent investigation from blockchain sleuth ZachXBT. ZachXBT says that since March 12, more than 655,000 SOL worth about $122.5 million has been raised for various presales. Says the on-chain analyst, &#8220;I was interested to see how [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/19/stop-doing-this-122500000-worth-of-solana-sol-raised-in-one-week-for-altcoin-presales-report/\">‘Stop Doing This’ – $122,500,000 Worth of Solana (SOL) Raised in One Week for Altcoin Presales: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]