[
  {
    "source": "Decrypt",
    "date": "2023-08-23T14:01:02.000Z",
    "title": "Mobile RPG Champions Arena Launches on Gala Games",
    "url": "https://decrypt.co/153156/mobile-rpg-champions-arena-launches-on-gala-games",
    "description": "The turn-based RPG will be released on mobile and PC through the Gala Launcher, and features NFT Champions you can battle and upgrade."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T13:54:41.000Z",
    "title": "FBI Warns Crypto Firms That North Korean Hackers ‘May Attempt to Cash Out Bitcoin’",
    "url": "https://decrypt.co/153462/fbi-warns-crypto-firms-that-north-korean-hackers-may-attempt-to-cash-out-bitcoin",
    "description": "Over the past 24 hours, 1,580 Bitcoin associated with Lazarus Group and APT38 have been moved, reports the FBI. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T13:56:56.000Z",
    "title": "Why is Bitcoin price stuck?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-stuck",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/afc8ec08-4768-417a-a371-a46442344ea8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price has been stuck inside a narrow trading range for days, awaiting signals from Jerome Powell's speech at Jackson Hole this week.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been stuck inside a narrow trading range for several days, and Aug. 23 is no different.</p><h2>All eyes on Jerome Powell's speech at Jackson Hole</h2><p>Bitcoin price has been trapped inside the $25,800-26,300 range since Aug. 19, underscoring a growing bias conflict among traders after its<a href=\"https://cointelegraph.com/news/china-facing-deflation-is-bad-news-for-bitcoin\"> 12.5% decline in the month</a>.</p><p>Currently, the Bitcoin market has become calmer in the days leading up to the Federal Reserve's annual <a href=\"https://cointelegraph.com/news/btc-price-fear-svb-5-things-bitcoin-this-week\">Jackson Hole gathering on Aug. 24-26</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9647ea5a-483c-43fd-9915-7897e501cc5f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Fed chair Jerome Powell will speak on the global economic outlook on Aug. 25, likely sharing his thoughts on interest rates. Minutes from the Fed official gathering in July <a href=\"https://cointelegraph.com/news/bitcoin-bulls-risk-trading-btc-price-nears-2-month-low\">revealed</a> concern about sustained inflation, which could prompt another rate hike in September.</p><p>Powell <a href=\"https://cointelegraph.com/news/jerome-powell-misleading-recession\">said in July</a> that the Fed would study economic data at each meeting, and would keep policy restrictive until there's enough confidence that inflation is moving toward the preferred 2% target. </p><p>Nonetheless, the CME FedWatch Tool, which assesses where overnight rates will go, sees an 84.5% chances that the Fed will keep rates unchanged at 525-550 basis points (bps.)</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6b60fa37-add2-4375-a623-555d2fc1c8e1.png\"  /><figcaption style=\"text-align: center;\"><em>Target rate probabilities for Sep 20, 2023 FOMC meeting. Source: CME</em></figcaption></figure><p>This could partially explain the cautious approach of Bitcoin in recent days, and this trend might continue leading up to Powell's speech.</p><h2>The Dollar is stablizing</h2><p>Likewise, the U.S. dollar index (DXY) chart has also been relatively flat in recent days.</p><p>Notably, the index was up 0.2% on Aug. 22, remaining stuck inside the 103-103.68 trading area as investors awaited interest rate clues from Powell's speech.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a7fcfe07-c515-44b1-837e-af58e4be41c5.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD vs. DXY daily performance chart. Source: TradingView</em></figcaption></figure><p>Bitcoin has established a <a href=\"https://cointelegraph.com/news/bitcoin-price-2017-like-rally-again-dollar\">strong inverse correlation</a> with the dollar since mid-July, with BTC's highest point aligning with DXY's lowest point. As a result, a short-term lull for the dollar has left Bitcoin in a blind spot about the market's next move.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-mining-difficulty-new-peak-btc-price-dip\">Bitcoin difficulty jumps 6% to new peak as miners ignore BTC price dip</a></em></strong></p><p>August is also the <a href=\"https://cointelegraph.com/news/btc-price-breakout-august-things-bitcoin-this-week\">least-volatile month</a> for Bitcoin as people go on holiday until after Labor Day, which falls on the first Monday of September.</p><h2>Oversold BTC price bounce ahead?</h2><p>Interestingly, Bitcoin's decline in August has left its daily relative strength index (RSI) in its most oversold state since June 2022.</p><p>An oversold RSI typically results in a price bounce, raising Bitcoin's potential to rebound toward the $26,500-27,500 range (the green zone) by September. </p><p>This range has served as support in March and May 2023. It also coincides with Bitcoin's 200-day exponential moving average (200-day EMA; the blue wave) near $27,225.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/0879c9df-7f7e-45f6-a3f7-aacb5fb45180.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Conversely, another selloff will have bears eye the $24,750-25,350 range (the red area) as th next downside target by September.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T14:01:10.000Z",
    "title": "Shopify integrates with ‘zero-fee’ Solana Pay, prompting businesses to adopt crypto transactions",
    "url": "https://cryptoslate.com/shopify-integrates-with-zero-fee-solana-pay-prompting-businesses-to-adopt-crypto-transactions/",
    "description": "<p>Solana Pay, the decentralized payment protocol by Solana Labs, has integrated with Shopify. This strategic integration allows millions of businesses on Shopify&#8217;s platform to leverage Solana Pay for crypto transactions with zero transaction fees until 2024. A post on the Solana official X profile, linking to a TechCrunch article read; &#8220;Today, Solana Pay integrates with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/shopify-integrates-with-zero-fee-solana-pay-prompting-businesses-to-adopt-crypto-transactions/\">Shopify integrates with &#8216;zero-fee&#8217; Solana Pay, prompting businesses to adopt crypto transactions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-23T13:52:29.000Z",
    "title": "Binance Labs Invests in Pendle Finance in Strategic Move in DeFi",
    "url": "https://cryptobriefing.com/binance-labs-invests-in-pendle-finance/?utm_source=feed&utm_medium=rss",
    "description": "Binance Labs announces investment in Pendle Finance, further showing interest in DeFi protocols focusing on yield tokenization."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T14:06:18.000Z",
    "title": "\n                        Vultor Announces the Launch of the VLT Presale\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/vultor-announces-the-launch-of-the-vlt-presale",
    "description": "\n                        <p dir=\"ltr\">Vultor, the crypto payments company, announced on August 23, 2023, the launch of the presale for its native token, VLT. Through the presale, the crypto project aims to increase the popularity of its main product. Furthermore, Vultor&rsquo;s goal is to allow presale participants and not only to be part of a transformative journey that will undoubtedly reshape the crypto landscape.&nbsp;</p>\nToken Presale, Many Benefits Ahead\n<p dir=\"ltr\">Vultor, a crypto project that constantly works to improve the way we perceive and use digital assets, announced the launch of its first token presale. The announcement was made on Twitter on August 23, 2023. Through the presale of its native token, VLT, Vultor aims to raise $1,920,000 to improve the project and launch its main products.&nbsp;</p>\n<p dir=\"ltr\">Currently, the price of 1 VLT token is $0.16, and it will not change its price during the presale session. The company aims to keep the presale open until it hits its soft cap.&nbsp;</p>\n<p dir=\"ltr\">The primary purpose of Vultor is to make the crypto project popular among worldwide crypto enthusiasts and offer them the opportunity to become early investors in a project that aims to revolutionize the crypto payments system.</p>\n<p dir=\"ltr\">Besides holding as many VLT tokens as they might like, all presale participants are eligible for a free Vultor card, as stated in a recent tweet. Designed similarly to a debit or credit card, the Vultor card offers an affordable, straightforward, and secure approach to processing cryptocurrency payments without requiring an intermediary.&nbsp;</p>\n<p dir=\"ltr\">The Vultor card is thought out to store private keys securely offline within an air-gapped environment. The keys will never exit the card&rsquo;s secure element and will constantly remain online. One of Vultor&rsquo;s main goals is to reach the surprising number of 4.1 billion cards delivered. Until 2024, the company projects that it will deliver over 100,000 Vultor cards, including those delivered to all presale participants.&nbsp;</p>\nHow to Buy VLT Tokens?\n<p dir=\"ltr\">With the token presale event currently running, users can purchase VLT tokens, the native cryptocurrency of Vultor, for a set price of $0.16. Purchasing Vultor (VLT) can be conducted by using Ethereum (ETH) coins or Tether (USDT) tokens. Crypto enthusiasts are recommended to ensure they have enough coins or tokens in their wallets to proceed.&nbsp;</p>\n<p dir=\"ltr\">It is essential to note that the VLT tokens can be claimed only after the presale session ends. Furthermore, participants must provide a valid wallet address and use the same wallet to buy and claim VLT. Using the same wallet used for purchasing VLT will ensure security and prevent unauthorized access to presale tokens.&nbsp;</p>\n<p dir=\"ltr\">To purchase VLT during the presale, all you have to do is:</p>\n<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Sending ETH or USDT to your wallet;</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Connect your wallet to the official Vultor website and swap ETH or USDT for VLT tokens using the buy widget on the homepage. There is no tax for presale transactions;</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Claim the tokens you purchased once the presale ends. All presale participants must claim their tokens from the Vultor website using the same wallet they used to purchase VLT.</p>\n</li>\n</ul>\n<p dir=\"ltr\">The VLT presale buying process is as straightforward as possible, allowing users to simply swap ETH or USDT for VLT tokens in just a few easy steps.&nbsp;</p>\nAbout Vultor\n<p dir=\"ltr\">Vultor is a crypto project that aims to be a dynamic and innovative force in the industry, offering a cutting-edge ecosystem that revolutionizes how we currently use digital assets. With its NFC technology at the forefront, Vultor aims to provide seamless and secure transactions, working towards a world where crypto becomes an everyday tool for payments and interactions.&nbsp;</p>\n<p dir=\"ltr\">Powered by a dedicated team and a clear vision for the future, Vultor is constantly working to redefine the boundaries of digital finance, making crypto more accessible and practical for both individual users and businesses.&nbsp;</p>\nStay Tuned\n<p dir=\"ltr\">If you want to find out more about Vultor and its latest updates, do not hesitate to follow the crypto project&rsquo;s activity on Twitter, Telegram, Discord, Instagram, and Medium.</p>\n<p dir=\"ltr\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T13:59:35.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T13:40:48.000Z",
    "title": "Solana In Turbulence: Analyzing The Death Cross And What Lies Ahead",
    "url": "https://www.newsbtc.com/all/solana-in-turbulence-analyzing-the-death-cross-and-what-lies-ahead/",
    "description": "Solana (SOL) has found itself under the shadow of a foreboding technical pattern known as the &#8220;Death Cross.&#8221; This ominous occurrence, defined by the 50-day moving average crossing below the 200-day moving average, has historically heralded significant price downturns.  Investors are now eyeing the charts as SOL grapples with this pattern once again, raising questions about its future trajectory. For the uninitiated in the intricacies of technical analysis, the Death Cross is akin to a storm warning on the horizon. It emerges when a short-term moving average dives beneath a long-term moving average, signaling potential tumult ahead. The last instance when Solana encountered the Death Cross was back in 2022, and the aftermath was far from favorable – a considerable downtrend that sent ripples through the crypto market. Fast forward to the present, and Solana finds itself at a crossroads once more. As of now, SOL is valued at $20.84 according to CoinGecko, reflecting a 1.4% gain over the last 24 hours. However, a more concerning figure emerges when considering the seven-day performance, which showcases an 11.1% slump. These numbers underscore the significance of the pending death cross and the apprehensions it invokes. SOL market cap at $8.4 billion on the daily chart: TradingView.com Bearish Solana Trends And Lingering Uncertainties Analyzing the market structure on the 1-day chart reveals a bearish picture for SOL. The cryptocurrency recently established a lower high at $25.68 coupled with a lower low at $22.23 on August 5. Subsequent weeks witnessed the gradual formation of a downtrend, amplifying concerns among traders and investors. Further technical indicators add weight to the concerns.  The On-Balance Volume (OBV) has been painting a discouraging narrative as well, with declining demand for SOL evident through the formation of lower highs since mid-July. Related Reading: Polygon (MATIC) At June Lows Again – Prospects For Bullish Recovery? The Relative Strength Index (RSI) depicts a recent bearish momentum, hinting at potential further declines. Additionally, the moving averages stand on the cusp of signaling a dip, adding to the prevailing unease. Meanwhile, bearish mood prevailed in the market, based on Open Interest. Even though SOL was at long-term support, the drop in OI over the last 10 days was significant, and it has not reversed the downturn. Source: Coinglass Potential Impact On Investor Sentiment And TVL Despite Solana&#8217;s current Total Value Locked standing at a noteworthy $243.85 million, the looming death cross looms as a destabilizing factor. Past experiences have shown that such ominous patterns can erode investor sentiment, potentially leading them to seek safer investment options. Related Reading: AVAX Network Activity Down – Will The Planned Token Unlock Bring Back The Energy? Consequently, the TVL could face downward pressure as investors contemplate safeguarding their capital amidst uncertain times. As the crypto community holds its breath, the coming weeks will undoubtedly be critical for Solana. Traders and investors will closely watch for signals of whether history will repeat itself, or if SOL will manage to defy the ominous prophecy of the death cross and forge a different path. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Getty Images"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T14:02:48.000Z",
    "title": "Ripple and Brad Garlinghouse Prepare for Final Battle Against SEC with Massive New Move – Is XRP Poised to Reach $0.50?",
    "url": "https://www.crypto-news-flash.com/ripple-and-brad-garlinghouse-prepare-for-final-battle-against-sec-with-massive-new-move-is-xrp-poised-to-reach-0-50/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-and-brad-garlinghouse-prepare-for-final-battle-against-sec-with-massive-new-move-is-xrp-poised-to-reach-0-50",
    "description": "<img width=\"1280\" height=\"684\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/US-Court-Sets-Date-for-Preliminary-Hearings-in-SEC-V.-Ripple-Case-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/US-Court-Sets-Date-for-Preliminary-Hearings-in-SEC-V.-Ripple-Case-1.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/US-Court-Sets-Date-for-Preliminary-Hearings-in-SEC-V.-Ripple-Case-1-300x160.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/US-Court-Sets-Date-for-Preliminary-Hearings-in-SEC-V.-Ripple-Case-1-1024x547.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Two lawyers from the law firm Cleary Gottlieb Steen &#38; Hamilton LLP have declared their intentions to represent Ripple CEO Brad Garlinghouse in the ongoing case. Brad Garlinghouse and co-founder Chris Larsen are expected to go on trial in Q2 2024 in response to their respective charges.  Ripple Labs (XRP) recently got a partial victory [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T13:52:23.000Z",
    "title": "GMX Trader Nets Over $1 Million Shorting and Then Longing Ethereum During Crypto Market Crash: On-Chain Data",
    "url": "https://www.crypto-news-flash.com/gmx-trader-nets-over-1-million-shorting-and-then-longing-ethereum-during-crypto-market-crash-on-chain-data/?utm_source=rss&utm_medium=rss&utm_campaign=gmx-trader-nets-over-1-million-shorting-and-then-longing-ethereum-during-crypto-market-crash-on-chain-data",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/ethereum-6851392_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/ethereum-6851392_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/ethereum-6851392_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/ethereum-6851392_1920-1024x576.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Lookonchain has identified a trader who was able to make around $1 million by accurately predicting the movement of Ethereum (ETH). Taking positions in the volatile crypto market remains a risky business as highlighted by another trader who lost just over $1 million longing Bitcoin. In the crypto market, there&#8217;s more than one way of [...]"
  }
]