[
  {
    "source": "CoinDesk",
    "date": "2024-02-23T14:54:49.000Z",
    "title": "Uniswap's UNI Jumps 50% on Proposal to Upgrade Governance",
    "url": "https://www.coindesk.com/markets/2024/02/23/uniswaps-uni-jumps-50-on-proposal-to-upgrade-governance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The upgrade would reward UNI token holders who staked and delegated their tokens, according to the proposal."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T14:47:44.000Z",
    "title": " Why Solana will prevail despite Ethereum ETFs ",
    "url": "https://cointelegraph.com/news/solana-will-prevail-despite-ethereum-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvODJhOTFjMjYtMzI5My00ZmM1LTgwNmMtZGUzZjMxM2ViNTA4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum may have spot ETFs in a few months, but Solana has superior speed and UX design. Its market dominance is inevitable.</p>\n                    <p><p>The cryptocurrency world is abuzz with bullish sentiment thanks to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) spot ETFs. Investors have been quick to accept that Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) spot ETFs will follow in the months ahead.</p><p>Many investors have begun to speculate that many altcoins will also have ETFs, which has led to price appreciation and a lot of speculation. But all the enthusiasm has led many to overlook an obvious contender to Ethereum — Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), which has beat many expectations and continues to boast a sophisticated tech team.</p><p>There has been no shortage of stories talking about Solana and its links to FTX founder Sam Bankman-Fried, with many predicting its demise. However, Solana has weathered the storm according to a handful of metrics. For instance, the number of active addresses on the network has nearly reached its 2022 level. The number of new addresses has continued to grow at almost as fast a rate as it was in 2022 as well. In fact, the number of unique active wallets (UAW) is up from 2022.</p><p><a href=\"https://cointelegraph.com/news/solana-will-prevail-despite-ethereum-etfs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-23T14:50:28.000Z",
    "title": "How eBTC leverages the ETH-BTC ratio, promising a new era for Bitcoin in DeFi",
    "url": "https://cryptoslate.com/podcasts/how-ebtc-leverages-the-eth-btc-ratio-promising-a-new-era-for-bitcoin-in-defi/",
    "description": "<p>In a recent episode of the SlateCast, Badger.com founder Spadaboom joined Senior Editor Liam &#8220;Akiba&#8221; Wright and CryptoSlate CEO Nate Whitehill to discuss the future of Bitcoin DeFi and the role of the ETH-BTC ratio in bridging the two worlds. eBTC aims to create a decentralized and immutable representation of Bitcoin on Ethereum, allowing users [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/podcasts/how-ebtc-leverages-the-eth-btc-ratio-promising-a-new-era-for-bitcoin-in-defi/\">How eBTC leverages the ETH-BTC ratio, promising a new era for Bitcoin in DeFi</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-23T14:59:21.000Z",
    "title": "VeChain Pumps 50%, Sparking Fresh Rally as $GFOX Nears Final Presale Stage",
    "url": "https://cryptodaily.co.uk/2024/02/vechain-pumps-50-sparking-fresh-rally-as-gfox-nears-final-presale-stage",
    "description": "VeChain ($VET) has recently regained considerable bullish momentum, with its native token soaring by more than 50%. Not only is $VET now one of the best altcoins to buy, but crypto researcher Ali Martinez predicts even higher prices in 2024."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-23T14:53:07.000Z",
    "title": "Decentralized streaming platform DeeStream (DST) scores more Solana (SOL) investors as Ethereum (ETH) knocks on $3K door",
    "url": "https://cryptodaily.co.uk/2024/02/decentralized-streaming-platform-deestream-dst-scores-more-solana-sol-investors-as-ethereum-eth-knocks-on-3k-door",
    "description": "The crypto world is always in a state of flux—and traders need to be on their feet and their ears to the ground 24/7."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-23T14:40:29.000Z",
    "title": "Essential Cryptos for February 2024: Your Buying Checklist",
    "url": "https://cryptodaily.co.uk/2024/02/essential-cryptos-for-february-2024-your-buying-checklist",
    "description": "Discover the must-buy cryptos of February 2024. These four altcoins are set to soar amid Bitcoin halving anticipation.  Don't miss out on the opportunity to invest in the most innovative and potentially lucrative tokens of the month!"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-23T15:00:59.000Z",
    "title": "Riot and Texas Blockchain Council Challenge US Government’s Bitcoin Mining Data Request in Court",
    "url": "https://news.bitcoin.com/riot-and-texas-blockchain-council-challenge-us-governments-bitcoin-mining-data-request-in-court/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Riot and Texas Blockchain Council Challenge US Government’s Data Request in Court\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ddddd55555.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The publicly listed mining firm Riot Platforms and the Texas Blockchain Council have initiated legal proceedings against the U.S. Department of Energy (DOE) and other federal entities, aiming to obstruct what they deem an unauthorized data collection effort targeting the bitcoin mining industry. The legal battle underscores the escalating tension between bitcoin mining operations and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T14:57:46.000Z",
    "title": "DeFi protocol blueberry halts operations after exploit",
    "url": "https://www.cryptopolitan.com/defi-protocol-blueberry-halts-operations/",
    "description": "Blueberry, a decentralized finance (DeFi) lending and leverage protocol, has taken swift action to mitigate potential damage following the discovery of an exploit. Users have been urged to withdraw funds as the protocol works to address the situation. An exploit was detected, and the protocol was paused Blueberry Protocol Foundation announced on Feb. 23 that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T14:42:21.000Z",
    "title": "Nintendo Switch Users Can Now Access Hidden Web Browser",
    "url": "https://www.cryptopolitan.com/nintendo-switch-hidden-web-browser/",
    "description": "Nintendo Switch users can now access a hidden web browser on their consoles, offering a convenient way to surf the internet without additional applications. Despite the device primarily being known for gaming, this hidden feature provides users with a useful tool for accessing web content, such as game walkthroughs or quick internet searches.&#160; While the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T15:00:05.000Z",
    "title": "Chainlink Open Interest Sitting At Record Levels, What This Means For Price",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-open-interest-price/",
    "description": "Chainlink has seen its open interest spike significantly in the month of February, so much so that it has reached new all-time highs. This trend has not waned despite the decline in the price of the cryptocurrency, which could paint a rather bullish picture for the LINK price going forward. Chainlink Open Interest Crosses $450 Million The Chainlink open interest ended the month of January on a high note and carried this trend into the month of February. A major jump was seen between January 31 and February 3 when the open interest went from below $250 million to more than $320 million. Related Reading: Elliot Wave Theory Predicts Bitcoin Bottom And Top, Here Are The Targets In the days following this, the open interest continued to rise, and eventually hit a peak of $533 million. This was significant because it was not just the highest point for the year but it is the highest that the open interest has ever been for the asset. Source: Coinglass As expected, the price would quickly rise to keep up with the open interest as investors continued to place their bets on the price. There has been a retracement in the open interest. However, Chainlink has continued to maintain more than $450 million in open interest since February 12. Currently, Coinglass data shows that the Chainlink open interest is $456 million as of February 23, continuing to maintain a high level. Given this, it might be prudent to look at how the LINK price has reacted in the past when open interest remained elevated. Historical Performance Of The LINK Price While the Chainlink open interest is at record levels, there have been times in the past where the open interest had been elevated for a period of time like it is now. So, how the price reacted during those periods could provide a pointer for how it might perform now. The last time that the open interest was this elevated for a long period of time was back in October-November 2023 when open interest more than doubled. It would maintain this elevated level for almost a month, but at the end of it, the LINK price would react positively and saw a price surge from $11 to $15, which was a 36% increase in price. Related Reading: Fundstrat Exec Predicts Bitcoin Will Reach $150,000, Here’s When If this scenario were to repeat now, then a 36% increase would send the LINK price to $24. This is not particularly hard to believe, given that the LINK price had topped out at $52 in the last bull market. So, such a move would still leave it 50% below its all-time high levels. On the flip side of this, the open interest levels could also taper off, as was seen in November 2023. This could see the LINK open interest lose its hold on the $450 million that it maintained in February and fall toward $400 million before recovering again. LINK price shows strength at $17.9 &#124; Source: LINKUSD on Tradingview.com Featured image from CoinGape, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-23T15:01:54.000Z",
    "title": "Donald Trump Gives a Wink to Bitcoin",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/donald-trump-gives-a-wink-to-bitcoin/",
    "description": "<p>Trump acknowledged the widespread use of Bitcoin, labeling it as &#8220;interesting&#8221; but underscored the necessity for regulation. Despite acknowledging Bitcoin, Trump reiterated his preference for the US dollar, showing caution towards digital currencies. But first, let&#8217;s see a brief summary of what&#8217;s the evolution of Trump&#8217;s opinion about cryptocurrencies. Trump&#8217;s Timeline with Bitcoin / Cryptocurrencies [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/donald-trump-gives-a-wink-to-bitcoin/\">Donald Trump Gives a Wink to Bitcoin</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]