[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T21:00:56.000Z",
    "title": "Bitcoin may hit $100K by capturing ‘even 2%–5% of gold’s market cap’ — Hut8 VP Sue Ennis",
    "url": "https://cointelegraph.com/news/bitcoin-may-hit-100k-by-capturing-even-2-5-of-gold-s-market-cap-hut8-vp-sue-ennis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4665b67f-5066-446d-b0ad-2486e7b529c3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>New developments in the Bitcoin mining space have Hut8 vice president Sue Ennis convinced that well positioned miners will thrive after the next BTC halving.</p>\n                    <p><p>The next Bitcoin halving event is less than 9 months away and the consensus opinion among analysts and investors is that the halving will send <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> price to a new all time high or even above $100,000. </p><p>Despite this belief, the absence of fresh inflow to the crypto market, the current macroeconomic headwinds and BTC’s recent <a href=\"https://cointelegraph.com/news/bitcoin-traders-support-levels-btc-price-taps-26\">price action below $30,000</a> do not inspire much confidence in this theory in the short-term. </p><p>In a <a href=\"https://youtu.be/odEt_9F4Isw?si=lNJ2sByNNlsWsdyi\" target=\"_blank\" rel=\"noopener nofollow\">recent interview</a> with Paul Barron, Hut8 vice president Sue Ennis shared her thoughts on how Bitcoin price will rise above $100,000 in the next year and how the upcoming halving will impact BTC miners. Hut8 currently has a balance of 9,152 BTC in reserve, of which 8,305 is unencumbered. The company’s installed ASIC hashrate capacity sits at 2.6 ETH/s and Hut8 mined 44.6 BTC in July.</p><p>In the interview, Barron inquired whether rising Bitcoin difficulty for miners could induce a fresh wave of sell pressure against BTC price. Citing data from Hashrate Index, Barron observed that spikes in Bitcoin difficulty were followed by drops in BTC price. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b39cc8e6-dee7-4687-9ffa-6c6c7ff5586c.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price, difficulty and difficulty adjustment. Source: Hashrate Index</em></figcaption></figure><p>Barron questioned if miners were selling Bitcoin as a result of the upcoming halving creating a need for more efficient ASICS, and whether BTC’s pre- and post-halving price action would not be as bullish as investors expected. </p><p>According to Ennis: </p><blockquote>“There’s a lot of unprecedented dynamics that are happening now in the mining space. What’s interesting is hashrate continues to come online despite Bitcoin price trading in a certain band, we’re still seeing hashrate increase.”</blockquote><p>Ennis elaborated with: </p><blockquote>“What's changed now is that we’re seeing BTC price come down a little but hashrate continues to go up. What’s exciting and different is we’re seeing tremendous amount of new entrants into the global Bitcoin network.” </blockquote><p>Ennis referenced 6 gigawatts of nuclear and renewable energy being generated in the Middle East and with the governments within this region exploring Bitcoin mining as an option, this is bringing more hashrate online in a way that is somewhat price agnostic. This is drastically different from how publicly traded US-based and more forward facing miners operate. </p><p>In order to stay afloat after the halving, Ennis suggested that miners need to be in a position of avoiding being “single threaded,” i.e., they need more than one way of earning revenue beyond just mining Bitcoin. </p><p>Revenue diversification would include exploring various AI applications, dedicating some warehouse rackspace to GPUs for companies specialising in AI training and possibly offering industrial-level ASIC repair services, or even participating in demand-response initiatives with large energy producers and distributors. </p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/september-crash-5-things-bitcoin-btc-price-this-week\"><strong><em> September ‘crash’ to $22K? — 5 things to know in Bitcoin this week</em></strong></a></p><h2>Higher prices are programmed thanks to the halving and eventual BTC ETF</h2><p>Crypto investors have waited years for the launch of a spot Bitcoin ETF and even with the <a href=\"https://cointelegraph.com/news/ark-invest-21-shares-file-ethereum-futures-etf\">recent influx of applications</a>, an approval by the U.S. Securities and Exchange Commission remains elusive. </p><p>Despite the history of delays and denials, Ennis said that a “spot ETF coming to market, that’s incredibly bullish for the asset class,” but she also cautioned that an approval could create sell pressure on miner equities given that mining stocks have often been used as a proxy investment to Bitcoin. </p><p>Regarding the percentage chance of a spot Bitcoin ETF approval by the end of 2023, Ennis said: </p><blockquote>“Definitely better than 50. The real reason for my opinion on that is because BlackRock threw its hat in the ring. BlackRock being powerful and the largest asset manager in the world. For them to throw their hat in the ring and say this is what we want and the amount of clout they’ve had in markets in past initiatives is tremendous. So I think for them to make this call, it is a real bullish signal.” </blockquote><p>Regarding a potential target for Bitcoin price, Ennis said: </p><blockquote>“I definitely do think we could see in this next cycle $100,000 cost per Bitcoin and that's based on if BTC were to capture even 2% to 5% of gold's $13 trillion place in institutional portfolios. If BTC were able to capture even 2 to 3% of gold's market cap that would be incredibly accretive to the price and push it north of $100,000.” </blockquote><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-28T20:55:48.000Z",
    "title": "$XRP: Pantera Capital’s Andrew Harris Analyzes Judge Torres’ Ruling and Its Impact on the Crypto Space",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-pantera-capitals-andrew-harris-analyzes-judge-torres-ruling-and-its-impact-on-the-crypto-space/",
    "description": "According to Andrew Harris, Senior Platform Associate at Pantera Capital, the ruling by Analisa Nadine Torres, a U.S. district judge of the U.S. District Court for the Southern District of New York, could be a game-changer for the crypto industry. Dan Morehead, who previously served as the Head of Macro Trading and CFO at Tiger […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T21:01:00.000Z",
    "title": "Bitcoin hashrate skyrockets, but there is a catch",
    "url": "https://www.cryptopolitan.com/bitcoin-hashrate-skyrockets-there-is-a-catch/",
    "description": "Bitcoin&#8217;s underlying machinery is working harder than ever, setting new records with its hash rate. Yet, as the engine roars, the profits it yields have diminished, leaving many miners perplexed and less prosperous. The growth of this leading cryptocurrency&#8217;s hash rate is a tale of scale, technology, and a stark contrast to the fall in ... <a title=\"Bitcoin hashrate skyrockets, but there is a catch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-hashrate-skyrockets-there-is-a-catch/\" aria-label=\"More on Bitcoin hashrate skyrockets, but there is a catch\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T21:00:56.000Z",
    "title": "Balancer Falls Victim To Hack After Warning Of Critical Vulnerability: Funds Lost",
    "url": "https://www.newsbtc.com/news/balancer-falls-victim-to-hack-after-warning-of-critical-vulnerability-funds-lost/",
    "description": "In a disheartening turn of events, the decentralized finance (DeFi) protocol Balancer (BAL) confirmed a hack just days after warning about a critical vulnerability impacting multiple Pools. The attack, which took place on August 27, resulted in a loss of nearly $1 million for Balancer. Previously, on August 22, NewsBTC reported that Balancer had discovered a critical vulnerability affecting its protocol. However, despite efforts to mitigate the risks and caution users, Balancer could not pause the affected pools. In response, the protocol urged users to withdraw from the impacted liquidity pools to prevent further exploits. Balancer Exploit Unveiled On Sunday, Balancer took to X (formerly known as Twitter) to acknowledge the existence of an exploit related to the previously disclosed vulnerability. While mitigation measures were implemented to reduce risks, they were insufficient to halt the affected pools.  Consequently, users were advised to withdraw their funds from the vulnerable liquidity pools to safeguard their investments. Related Reading: CryptoQuant Discusses How Bitcoin Has Changed In Past 1 Year Meir Dolev, a Web3 security expert, shed light on the situation, revealing that the attacker was persistently carrying out their operation. Approximately $900,000 was affected, with over $600,000 already transferred to the address 0xB23711b9D92C0f1c7b211c4E2DC69791c2df38c1.  On the same note, Blockchain security firm Beosin further divulged that the hack was executed through multiple flash loan attacks. Flash loans, a feature enabling users to borrow funds without collateral, have been increasingly utilized as tools for exploitation in the DeFi space.  The Balancer exploit underscores the ongoing challenges DeFi platforms face in ensuring user funds&#8217; safety. As the industry continues to innovate and attract significant capital, securing protocols and addressing vulnerabilities must remain a top priority.  BAL Price Plunges, Exploit Triggers 20.81% Decline  In the aftermath of the recent exploit that targeted Balancer, the project&#8217;s native token, BAL, has experienced significant market repercussions.  The exploit, which resulted in a loss of approximately $1 million, has had a noticeable impact on BAL&#8217;s price and various key metrics, reflecting the challenges faced by the platform, according to Token Terminal data.  As a consequence, BAL&#8217;s price has witnessed considerable volatility. Over the past 30 days, the token has experienced a sharp decline of 20.81%, as seen in the chart below.  This downward trend is further highlighted by the token&#8217;s performance over a longer period of 180 days, during which it has plummeted by 51.69%, underscoring the impact of the exploit on investor sentiment and market confidence in BAL. Furthermore, BAL&#8217;s all-time high (ATH) stands at $74.45, serving as a reminder of the token&#8217;s previous price peak. However, the all-time low (ATL) of $3.36 reveals the extent of the token&#8217;s decline following the exploit. Related Reading: Bitcoin Bullish Uptrend Remains Unbroken, Here’s Why The exploit&#8217;s aftermath has also affected Balancer&#8217;s market capitalization metrics. The circulating market cap, representing the value of BAL tokens in circulation, currently stands at $150.06 million. However, this metric has suffered a notable decline of 22.60%, indicating a decrease in token valuation and investor confidence. Another critical metric the exploit impacts is Balancer&#8217;s total value locked (TVL). TVL represents the amount of capital locked within the protocol.  In the aftermath of the exploit, Balancer&#8217;s TVL has declined by 33.86%, signaling a shift in investor sentiment and potential reallocation of funds to more secure platforms. Featured image from iStock, chart from TradingView.com"
  }
]