[
  {
    "source": "CoinDesk",
    "date": "2023-09-26T22:44:55.000Z",
    "title": "SEC Extends Ark, Global X ETF Deadlines as Government Shutdown Looms",
    "url": "https://www.coindesk.com/policy/2023/09/26/sec-extends-ark-global-x-etf-deadlines-as-government-shutdown-looms/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The efforts from Ark 21Shares and Global X to list spot bitcoin exchange traded funds (ETFs) must now officially wait longer for the U.S. Securities and Exchange Commission (SEC) to either approve or reject or deny their applications as the agency moved to extend deadlines Tuesday."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-26T22:53:00.000Z",
    "title": "Microsoft Accidentally Exposes Xbox Crypto Wallet Roadmap in FTC Case",
    "url": "https://www.cryptoglobe.com/latest/2023/09/microsoft-accidentally-exposes-xbox-crypto-wallet-roadmap-in-ftc-case/",
    "description": "In an information that has been called the “biggest in Xbox history,” tech behemoth Microsoft has inadvertently revealed plans to integrate a cryptocurrency wallet onto its popular Xbox gaming console. The leak through several documents being posted on the Resetera gaming forum, and the documents were unredacted in the Federal Trade Commission’s (FTC) case against […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-26T23:01:19.000Z",
    "title": "Ethereum censorship concerns raised amid rising OFAC compliance",
    "url": "https://crypto.news/ethereum-censorship-concerns-raised-amid-rising-ofac-compliance/",
    "description": "More and more Ethereum blockchain operators have complied with sanctions from the OFAC, raising censorship concerns among decentralization proponents and network participants."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T23:00:18.000Z",
    "title": "Ethereum Open Interest Barrels Past $5.2 Billion, Is It Time To Buy?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-open-interest-5-billion/",
    "description": "The Ethereum open interest has been on an upward trajectory that has culminated in it crossing the $5.2 billion mark. This surge is important to Ethereum’s native token ETH in a number of ways as it could point to how investors are viewing the cryptocurrency at this point. Ethereum Open Interest Sees Rapid Rise Data from Coinglass shows that the Ethereum open interest has risen rapidly in recent times. Over the last week, the open interest has grown, eventually crossing $5.2 billion at a time when the crypto market continues to struggle to loosen the grip of bears. Related Reading: Cardano: Factors That Could Drive ADA Price As High As $12 One thing about open interest is that it can point to how investors are viewing the cryptocurrency and whether they are bearish or bullish. When open interest rises, it points to investors becoming more bullish. On the other hand, a drop in open interest suggests that investors are more bearish and expect prices to drop. ETH open interest jumps above $5.2 billion &#124; Source: Coinglass This time around, with the open interest being on the rise, it suggests that crypto investors are turning bullish once more. This reflects the Crypto Fear &#38; Greed Index showing that investor sentiment has been improving during the same time period. The chart above shows that the ETH price has often rallied when open interest has surged, which could happen in this case. If this holds true, then the ETH price could be looking at a rise toward the $1,700 level once more. ETH Could Rally With Crypto Market The turn to bullishness marked by the increase in Ethereum open interest is not limited to the cryptocurrency alone. Looking at the long/short ratio on Coinglass shows that long volumes have begun to recover while short volume has plummeted. Ethereum long volumes are currently sitting at $574 million compared to $548 million for short. This comes out to 51.28% for longs with 48.72% for shorts. And while these differences are not especially significant, it does show that crypto investors are betting more on a recovery for the cryptocurrency. Related Reading: Shiba Inu (SHIB) Burn Rate Sees Exponential 627% Jump Liquidations have also shown that short traders are losing more in the market. Ethereum currently has a 24-hour liquidation volume of $6.63 million. $1.57 million of this is long positions while $5.06 million is accounted for by short traders. The ETH price is sitting at $1,588 at the time of writing. It’s seeing small gains of 0.84% in the last day but nursing 3.59% losses on the weekly chart. ETH price remains volatile &#124; Source: ETHUSD on Tradingview.com Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Nasdaq, chart from TradingView.com"
  }
]