[
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T20:15:00.000Z",
    "title": "Binance's opBNB Goes Live On Mainnet",
    "url": "https://cryptodaily.co.uk/2023/08/binance-opbnb-mainnet-goes-live-on-mainnet",
    "description": "<p class=\"md-end-block md-p\">Binance has officially announced the launch of its opBNB Mainnet, a notable addition to the burgeoning decentralized scaling solutions sector. Touted to bolster transaction speed, security, and scalability, the move is closely watched by industry insiders and users alike.</p>\n<p class=\"md-end-block md-p\">Harnessing the Optimism OP Stack Bedrock, an optimistic rollup framework, opBNB underwent a comprehensive Testnet phase over a span of 1.5 months. During this time, the network recorded more than 7 million on-chain transactions, connecting to over 435,000 unique wallet addresses. This trial run demonstrated block processing capabilities with times hovering around one second.</p>\n<p class=\"md-end-block md-p\">Notably, opBNB's Testnet revealed its capacity to support an array of tokens, encompassing not only Binance's proprietary BNB but also widely recognized stablecoins like BUSD, USDT, and DAI. A distinguishing feature emerged in the form of minimized transaction costs, with the Layer 2 gas price set at a minimal 0.2 gwei, leading to significantly reduced expenses for users.</p>\n<p class=\"md-end-block md-p md-focus\">The impending Mainnet rollout, slotted for mid-August 2023, is bifurcated into stages: an initial access for infrastructure providers followed by a general user release. Calearly defined criteria underline the Mainnet's launch, with emphasis on High Availability to mitigate potential bottlenecks and an ambitious performance benchmark, aiming for a consistent 4,000 TPS.</p>\n<p class=\"md-end-block md-p\">Governance remains central to opBNB's approach. The Mainnet's governance framework, as detailed in the BEP-1 proposal, underscores the commitment to democratic governance processes. Concurrently, to foster ecosystem growth, opBNB is initiating a range of grants and builder programs.</p>\n<p class=\"md-end-block md-p\">Looking ahead, Binance's roadmap for opBNB is multifaceted. It includes enhancing fraud-proof systems, streamlining account abstraction, and ensuring seamless data exchange with the BNB Greenfield ecosystem. A pivotal feature on the horizon is the decentralized sequencer, indicative of Binance's preemptive stance on potential centralization concerns.</p>\n<p class=\"md-end-block md-p\">While the opBNB Mainnet launch represents a significant juncture, the path ahead focuses on robust security, augmented community engagement, and facilitating broader digital adoption.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T20:16:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T20:32:18.000Z",
    "title": "Ethereum co-founder praises X’s Community Notes for echoing crypto principles",
    "url": "https://crypto.news/ethereum-co-founder-praises-xs-community-notes-for-echoing-crypto-principles/",
    "description": "Ethereum co-founder, Vitalik Buterin, commends X's new Community Notes feature, highlighting its resemblance to core cryptocurrency values in its decentralized and community-centric design"
  }
]