[
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T22:23:30.000Z",
    "title": "Sam Altman’s ouster indicates Biden isn’t handling AI properly",
    "url": "http://cointelegraph.com/news/sam-altman-ouster-shows-biden-isnt-handling-artificial-intelligence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/0021a7bd-de13-4df8-a577-180647fe979e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>What happened with Sam Altman behind the scenes? Neither OpenAI nor Microsoft have provided all the answers. The industry deserves more congressional scrutiny.</p>\n                    <p><p>CbatGPT developer OpenAI announced last week that it had fired CEO Sam Altman due to a loss of confidence by the board — only to see him return to the company after 90% of OpenAI staffers threatened to resign. The firing caused a flurry of excitement from companies offering to match OpenAI salaries in an attempt to lure top-tier talent.<u></u></p><p>The mess — and associated lack of transparency — highlighted the need to regulate AI development, particularly when it comes to security and privacy. Companies are developing their artificial intelligence divisions rapidly and a reshuffling of talent could propel one company ahead of others and existing laws. While President Joe Biden has taken steps to that effect, he has been relying on executive orders, which do not require input from Congress. Instead, they rely on agency bureaucrats to interpret them — and could change when a new president is inaugurated.<u></u><u></u></p><p>Biden this year signed an executive order related to the “safe, secure, and trustworthy artificial intelligence.” It commanded AI companies to “protect” workers from 'harm,' presumably in reference to the potential loss of their jobs. It also tasked the Office of Management and Budget (OMB) and Equal Employment Opportunity Commission (EEOC) with, in part, establishing governing structures within federal agencies. It also asked the Federal Trade Commission (FTC) to self-evaluate and determine whether it has the authority “to ensure fair competition in the AI marketplace and to ensure that consumers and workers are protected from harms that may be enabled by the use of AI.”<u></u><u></u></p><h2>Biden’s executive orders are not going to last long</h2><p>The fundamental problem with an approach driven by executive fiat is its fragility and limited scope. As evident by the SEC and CFTC’s (largely unsuccessful) attempts to classify cryptocurrencies as securities, tasking agencies with promulgating laws can cause confusion and apprehension amongst investors, and are ultimately open to interpretation by the courts.<u></u><u></u></p><p>Policies developed by agencies without legislative support also lack permanence. While public input is necessary for the passing of agency-backed regulations, the legislative process allows consumers of artificial intelligence and digital assets to have a stronger voice and assist with the passage of laws that deal with actual problems users face — instead of problems invented by often ambitious bureaucrats.<u></u><u></u></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: In a sudden turn of events, OpenAI signs agreement to bring Sam Altman back to the company as CEO.<br><br>There will be a new board of directors initially consisting of Bret Taylor, Larry Summers, and Adam D&#39;Angelo.<br><br>Less than 1 week after Sam Altman was fired, OpenAI is…</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1727208970249470335?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Biden’s failure to address the complex ethical implications of AI implementation on a mass scale is dangerous; concerns such as bias in algorithms, surveillance and privacy invasion are barely being addressed. Those issues should be addressed by Congress, made up of officials elected by the people, rather than agencies composed of appointees.<u></u><u></u></p><p>Without the rigorous debate required for Congress to pass a law, there is no guarantee of a law that promotes <strong>security and privacy </strong>for everyday users. Specifically, users of artificial intelligence need to have control over how this automated technology uses and stores personal data. This concern is particularly acute in the field of AI, where many users fail to understand the underlying technology and the severe security concerns that come with sharing personal information. Furthermore, we need laws that ensure companies are conducting risk assessments and maintaining their automated systems in a responsible manner.<u></u><u></u></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New <a href=\"https://twitter.com/hashtag/OpenAI?src=hash&amp;ref_src=twsrc%5Etfw\">#OpenAI</a> board <br><br>Bret Taylor former Twitter Board Chair &amp; <a href=\"https://twitter.com/hashtag/Salesforce?src=hash&amp;ref_src=twsrc%5Etfw\">#Salesforce</a> President<a href=\"https://twitter.com/hashtag/Quora?src=hash&amp;ref_src=twsrc%5Etfw\">#Quora</a>’s CEO Adam D’Angelo stays <br><br>Larry Summers former Treasury head joins <a href=\"https://t.co/95Y4uhuPWM\">https://t.co/95Y4uhuPWM</a></p>&mdash; Susan Li (@SusanLiTV) <a href=\"https://twitter.com/SusanLiTV/status/1727214761786704008?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Reliance on regulations enacted by federal agencies, could lead to confusion and consumers lacking trust in artificial intelligence. This precise scenario played out with digital assets where the SEC’s lawsuits against Coinbase, Ripple Labs, and other crypto-involved institutions, which made some investors apprehensive about their involvement with crypto technology companies. A similar scenario could play out in the field of AI where the FTC and other agencies sue AI companies and tie vital issues up in the court system for years ahead.</p><p><u></u><u></u>It’s imperative that Biden engage Congress on these issues instead of hiding behind the executive  branch. Congress, in turn, must rise to the occasion, crafting legislation that encapsulates the concerns and aspirations of a diverse set of stakeholders. Without such collaborative efforts, the United States risks repeating the pitfalls experienced in the digital assets domain, potentially lagging behind other nations and driving innovation elsewhere. More importantly, the security and privacy of American citizens — as well as many around the globe — is in jeopardy.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>John Cahill</strong> is an associate in national law firm Wilson Elser’s White Plains, N.Y., office. John focuses his practice on digital assets, and ensures that clients comply with current and developing laws and regulations. He received a B.A. from St. Louis University and a J.D. from New York Law School.</div></div><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-22T22:16:08.000Z",
    "title": "U.S. Treasury calls $3.4B Binance resolution FinCEN’s largest settlement in history",
    "url": "https://cryptoslate.com/u-s-treasury-calls-3-4b-binance-resolution-fincens-largest-settlement-in-history/",
    "description": "<p>The U.S. Department of the Treasury published its comments on settlements with Binance and related parties in a statement on Nov. 21. Secretary of the Treasury Janet Yellen said: “Binance turned a blind eye to its legal obligations in the pursuit of profit. Its willful failures allowed money to flow to terrorists, cybercriminals, and child [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/u-s-treasury-calls-3-4b-binance-resolution-fincens-largest-settlement-in-history/\">U.S. Treasury calls $3.4B Binance resolution FinCEN&#8217;s largest settlement in history</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]