[
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T02:48:34.000Z",
    "title": "Brazil's CBDC pilot contains code that can freeze or reduce funds, dev claims",
    "url": "https://cointelegraph.com/news/brazil-cbdc-pilot-source-code-can-freeze-funds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/15d17693-aa9e-47c3-a8e0-29e20fd83647.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Pedro Magalhães, a blockchain developer who claims to have reverse-engineered Brazil's pilot CBDC has found code that would allow accounts to be frozen or drained at will. </p>\n                    <p><p>A blockchain developer who claims to have reverse-engineered the source code of Brazil’s pilot central bank digital currency has discovered functions in the code that would allow a central authority to freeze funds or reduce balances. </p><p>He has since argued, however, that there could be situations that such functions could be beneficial.</p><p>The source code of the Real Digital pilot project was <a href=\"https://github.com/bacen/pilotord-kit-onboarding\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> on GitHub portal on July 6 by Brazil’s top bank. It was <a href=\"https://github.com/bacen/pilotord-kit-onboarding/blob/main/arquitetura.md\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> at the time that the Real Digital pilot project is intended for use only in a test environment and that the “presented architecture” may be subject to additional changes.</p><p>Pedro Magalhães — a blockchain developer and founder of tech consulting firm Iora Labs — later that day <a href=\"https://www.linkedin.com/posts/pemagalhaes_github-ioralabsrealdigitalsmartcontracts-activity-7082009809549484032-Beqi?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> to have been able to “reverse engineer” the open source code of Banco Central do Brazil’s Digital Real, revealing functions in the code.</p><p>Among the functions included the ability to freeze and unfreeze accounts, increase and decrease the balances, move Real Digital from one address to another, and create or burn Real Digital from a certain address.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">6/ These resources can be executed by any entity that receives proper permissions from the controlling entity of the new system — i.e. the Central Bank.<br><br>Among the changes authorities could potentially make using these functions are, for example: <a href=\"https://t.co/AT5v1rOQbK\">pic.twitter.com/AT5v1rOQbK</a></p>&mdash; Vini Barbosa (@vinibarbosabr) <a href=\"https://twitter.com/vinibarbosabr/status/1678511791498752004?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Magalhães told Cointelegraph that Brazil’s central bank will “probably” maintain these functions for the purpose of secured loan functions and other financial operations that can be carried out on decentralized finance protocols.</p><p>The problem, Magalhães explained, is that the code lacks specificity about the circumstances under which the tokens can be frozen, and, above all, who holds the power to execute them:</p><blockquote>“One thing is to agree with an operation and execute a DeFi operation that involves different blockchains; another completely different thing is an institution having the ability to freeze the balance on its initiative, and that's precisely how they've developed the smart contracts.”</blockquote><p>These aspects should always be exposed in the smart contracts publicly and discussed with the population, which hasn't been done yet,” he added.</p><p>Many in the cryptocurrency community have raised concerns that a CBDC has the potential to infringe on their <a href=\"https://cointelegraph.com/news/cbdc-human-rights-tracker-revealed-at-oslo-freedom-forum\">financial </a>freedom and encroach on their privacy.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">11/ One of the purposes of publishing the pilot, as written in the project&#39;s so-called “Onboarding Kit”, is to receive feedback — leaving all documentation subject to evolution or changes. And that&#39;s exactly what developer Pedro Magalhães did: he provided feedback.</p>&mdash; Vini Barbosa (@vinibarbosabr) <a href=\"https://twitter.com/vinibarbosabr/status/1678511815586635776?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On a July 10 <a href=\"https://www.linkedin.com/posts/pemagalhaes_a-respeito-do-real-digital-%C3%A9-uma-inova%C3%A7%C3%A3o-activity-7084201468051828737-4awm?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\" rel=\"noopener nofollow\">post,</a> Magalhães said while Brazilian people’s <a href=\"https://cointelegraph.com/news/privacy-anonymity-considered-retail-cbdc-treasury\">concerns about a CBDC</a> are understandable, it may actually offer some “benefits.”</p><p>He explained that taxes will be more easily traceable — enabling the public to inspect which <a href=\"https://cointelegraph.com/learn/what-is-a-cbdc-why-central-banks-want-to-get-into-digital-currencies\">resources tax funds are allocated to</a> — in addition to inspecting purchases made by the state on-chain and strengthening transparency in parliamentary amendments.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/visa-microsoft-join-brazilian-cbdc-pilot\"><strong><em>Visa, Microsoft and others join Brazilian CBDC pilot</em></strong></a></p><p>Fabio Araujo, an economist at the Central Bank of Brazil explained in July 2022 that the Digital Real has the <a href=\"https://cointelegraph.com/news/brazilian-central-banker-describes-how-cbdc-system-can-halt-bank-runs\">potential to halt bank runs </a>and looks to provide entrepreneurs with a more safe and reliable environment to innovate.</p><p>The Digital Real pilot is <a href=\"https://www.infomoney.com.br/minhas-financas/real-digital-projeto-piloto-esta-no-ar-e-fara-testes-com-titulos-publicos-veja-como-vai-funcionar/\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> running on Hyperledger Besu — a privately operated Ethereum Virtual Machine (EVM)-compatible blockchain. </p><p>Because it isn’t permissionless like the Bitcoin or Ethereum mainnets, users will need the central bank’s approval to become a node, Magalhães <a href=\"https://www.linkedin.com/posts/pemagalhaes_blockchain-github-cbdc-activity-7082763875309223936-GUhk?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> on July 7.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T02:50:41.000Z",
    "title": "Five AI Techniques that Can Work Miracles for Crypto Traders",
    "url": "https://www.cryptopolitan.com/five-ai-techniques-for-crypto-traders/",
    "description": "In the dynamic landscape of cryptocurrency trading, staying ahead of the curve is crucial. Traders are constantly seeking innovative strategies and tools to gain an edge in the market. One such tool that has been gaining significant traction is Artificial Intelligence (AI). This technology has the potential to revolutionize the way crypto trading is conducted, ... <a title=\"Five AI Techniques that Can Work Miracles for Crypto Traders\" class=\"read-more\" href=\"https://www.cryptopolitan.com/five-ai-techniques-for-crypto-traders/\" aria-label=\"More on Five AI Techniques that Can Work Miracles for Crypto Traders\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T03:00:44.000Z",
    "title": "Tron Co-Founder Unstakes $56 Million From Ethereum Via Lido, Will ETH Prices Fall?",
    "url": "https://www.newsbtc.com/news/ethereum/tron-co-founder-unstakes-56-million-from-ethereum-via-lido-will-eth-prices-fall/",
    "description": "Justin Sun, the co-founder of Tron, withdrew 30,000 ETH, worth roughly $56 million, via two addresses via Lido, a liquidity staking service provider, on July 10, Lookonchain reveals. Following his move, his Ethereum stake via Lido is down to 263,294 ETH, or $491.6 million at spot rates. Justin Sun Unstakes From Ethereum Lookonchain, a blockchain analytics platform, notes that between February 25 and 27, Sun staked 288,100 ETH, or $538 million, and earned 5,194 ETH, or $9 million. This translates to average daily earnings of 38 ETH, or $72,000, going by the annualized percentage yield (APY) of around 4.87% offered by Lido on Ethereum stakers. Related Reading: Narrow Bitcoin Price Range Suggests Explosive Move Ahead The reasons behind Sun&#8217;s withdrawal of 30,000 ETH from Lido are unclear. It could indicate his intention to sell some of the ETH, transfer to a different staking platform, or even run his private Ethereum validator node. Despite this transfer, Sun remains one of the largest stakers at Lido, accounting for over 9% of the total ETH staked. While Sun&#8217;s decision to unstaked and transfer coins may be a cause of concern, ETH prices are firm when writing on July 10 and edging closer to $1,900. Contrary to fears ahead of the Shanghai upgrade in mid-April, the number of users staking ETH remains upward. Trackers show that over 21 million ETH has been locked by over 657,000 validators as of July 10.  With the Shanghai upgrade implemented, ETH holders who had staked at least 32 ETH in the Beacon Chain from December 2020 can withdraw their assets. Despite earlier fears that more coins will be withdrawn and sold in the spot markets, impacting ETH prices, more validators and more coins have been locked on the Beacon Chain and other staking solutions.  Will The SEC Dampen Coin Staking? Lido, the leading staking provider for ETH, is the largest decentralized finance (DeFi) protocol by total value locked (TVL), according to DeFiLlama. As of July 10, Lido managed over $14.6 billion of assets, most of which are ETH.  Over $14.5 billion of ETH have been delegated and locked through Lido infrastructure. In Lido, users can stake ETH and other supported coins without needing lock-up periods or meeting high requirements, making it an attractive option for some investors. In lawsuits filed against crypto exchanges Binance and Coinbase in early June, the United States Securities and Exchange Commission (SEC) alleged that some proof-of-stake coins, including Cardano&#8217;s ADA and Algorand&#8217;s ALGO, were unregistered securities.  Related Reading: Solana (SOL) Tallies 10% Gains On Weekly Chart – Will It Cross $25? Following this assessment, their prices tanked, even impacting ETH. This is partly because Ethereum is now a proof-of-stake network after transiting from a proof-of-work algorithm and uses the same consensus system as those employed by competing smart contract platforms accused of issuing unregistered securities. The situation is worsened by Gary Gensler&#8217;s failure to clarify whether ETH is a utility like Bitcoin.  Cover image from Canvas, chart from Tradingview"
  }
]