[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-28T18:00:19.000Z",
    "title": "Coinbase Launches Perpetual Futures Trading for Retail Crypto Traders Outside the US",
    "url": "https://news.bitcoin.com/coinbase-launches-perpetual-futures-trading-for-retail-crypto-traders-outside-the-us/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase Launches Perpetual Futures Trading for Retail Crypto Traders Outside the US\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinbassdde.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Coinbase has received a regulatory stamp of approval to start offering perpetual futures trading to retail crypto traders outside the U.S., opening up access to the $5.5 trillion global derivatives market. Coinbase Extends Perpetual Futures Trading to Retail Traders Abroad The Bermuda Monetary Authority (BMA) granted Coinbase International Exchange, the company&#8217;s new non-U.S. exchange, a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T17:42:52.000Z",
    "title": "US authorities crackdown on pig butchering crypto scams",
    "url": "https://www.cryptopolitan.com/us-authorities-pig-butchering-crypto-scam/",
    "description": "In a recent development, the US authorities and the Attorney’s Office for the District of Massachusetts have taken significant steps to combat a fraudulent cryptocurrency scheme known as the “pig-butchering” scam. This scheme specifically targeted a resident of Massachusetts and was intertwined with money laundering activities. The government has initiated a civil forfeiture action in ... <a title=\"US authorities crackdown on pig butchering crypto scams\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-authorities-pig-butchering-crypto-scam/\" aria-label=\"More on US authorities crackdown on pig butchering crypto scams\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T18:00:22.000Z",
    "title": "Research Firm Reveals Its “Altcoin Trading Playbook”",
    "url": "https://www.newsbtc.com/altcoin/research-firm-reveals-altcoin-trading-playbook/",
    "description": "A research firm has revealed an altcoin trading playbook that could serve as a guide for navigating the next cryptocurrency bull run. K33 Research Shares Its Altcoin Trading Playbook In a new post on X, K33 Research (formerly Arcane Research) explained that new altcoins make better trades than old ones. The firm has given a few reasons for why this is so. &#8220;In lack of price-driving fundamentals, the narratives and liquidity matter,&#8221; explains the research organization. &#8220;And new coins generally outperform old coins.&#8221; Related Reading: Maker (MKR) Rockets To $1,500 With 15% Surge, Will This Run Continue? K33 Research has used the example of some &#8220;Ethereum killers&#8221; during the last bull market to show how the newer coins outperform the older ones. The below chart shows how the performance of these coins has been compared (note that the Y-axis, the price, is normalized concerning September 22, 2020, here). How the new vs old Ethereum killers performed during the 2021 bull mark &#124; Source: K33 Research on X From the chart, it&#8217;s apparent that Tron (TRX) and EOS (EOS), which were vouched as the Ethereum killers during the 2017/18 bull market, failed to set new all-time highs (ATHs) during the 2021 bull run. However, the new kids on the block, like Solana (SOL) and Avalanche (AVAX), observed much better returns than the old, established altcoins during the latest bull market. Why do old altcoins have difficulty returning to their former glory? According to K33 Research, there are a few factors behind this. First, the coins that have gone through a cycle have many holders at a loss, waiting to come into the green to exit. These underwater investors provide additional selling pressure during rallies that new coins, where everyone is in the green during the initial rally, don&#8217;t have to face. The old coins also have to deal with the rising circulating supply because of the token unlocks, which, due to supply-demand dynamics, can hurt the price if the demand side doesn&#8217;t catch up. How QTUM's returns waned over time &#124; Source: K33 Research on X Finally, the research firm notes that old coins are also tied to narratives that have gone out of fashion. On the other hand, new coins are the narratives when they launch and, thus, appear interesting to investors. Related Reading: Bitcoin Bearish Signal: Long-Term Holders Deposit To Exchanges While new altcoins certainly have a leg up to old coins regarding these factors, K33 Research notes that not all such coins make for a good investment. The firm advises investors to look for a few things to know whether a project may be worth investing in. The first thing could be whether or not the total number of holders is rising rapidly for the altcoin. A high amount of adoption means the asset has more steam behind it for building sustainable moves. The firm also says that a low float and high fully dilated value (FDV) should be avoided. ETH Price At the time of writing, Ethereum is trading at around $1,600, up 3% during the past week. ETH has continued to move sideways recently &#124; Source: ETHUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, K33Research.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T18:00:56.000Z",
    "title": "Investors Lament About Apecoin (APE) Continuous Crash; Anarchy Offering 50x ROI for early investors",
    "url": "https://www.crypto-news-flash.com/investors-lament-about-apecoin-ape-continuous-crash-anarchy-offering-50x-roi-for-early-investors/?utm_source=rss&utm_medium=rss&utm_campaign=investors-lament-about-apecoin-ape-continuous-crash-anarchy-offering-50x-roi-for-early-investors",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-170.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-170.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-170-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-170-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />2021 and 2022 were peak periods for the NFT marketplaces and Metaverse-based platforms, as many of them hit massive profits despite the raging bearish waves. 2023 started with so much promise, but between regulatory clampdowns and the overall decline in interest in the Metaverse operations, these platforms have been hitting new lows since the second [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-28T18:05:00.000Z",
    "title": "Bloomberg Analyst Predicts Investors Will Begin To Shift From Bonds to Bitcoin in Coming Years – Here’s Why",
    "url": "https://dailyhodl.com/2023/09/28/bloomberg-analyst-predicts-investors-will-begin-to-shift-from-bonds-to-bitcoin-in-coming-years-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/sec-chair-doubles-stance.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence crypto market analyst Jamie Coutts says investors will soon start shifting traditional bond investments to Bitcoin (BTC) due to one key factor. Coutts says that in the face of US dollar debasement, Bitcoin is a better performer than bonds. He looks at the performance of bonds and other assets like Bitcoin versus the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/28/bloomberg-analyst-predicts-investors-will-begin-to-shift-from-bonds-to-bitcoin-in-coming-years-heres-why/\">Bloomberg Analyst Predicts Investors Will Begin To Shift From Bonds to Bitcoin in Coming Years – Here&#8217;s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]