[
  {
    "source": "CryptoSlate",
    "date": "2023-12-20T21:00:16.000Z",
    "title": "SEC takes new meetings with BlackRock, Grayscale as high-level Bitcoin ETF talks continue",
    "url": "https://cryptoslate.com/sec-takes-new-meetings-with-blackrock-grayscale-as-high-level-bitcoin-etf-talks-continue/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) continued its review process of Bitcoin ETF applications, holding two additional meetings with applicants Grayscale and BlackRock on Dec. 19, 2023. The meeting with Grayscale revolved around a proposed rule change, which, if approved, would permit NYSE Arca to list and trade shares of Grayscale&#8217;s forthcoming spot Bitcoin ETF. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-takes-new-meetings-with-blackrock-grayscale-as-high-level-bitcoin-etf-talks-continue/\">SEC takes new meetings with BlackRock, Grayscale as high-level Bitcoin ETF talks continue</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-20T20:51:53.000Z",
    "title": "Top 6 tokens to hold for a fantastic 2024",
    "url": "https://cryptodaily.co.uk/2023/12/top-6-tokens-to-hold-for-a-fantastic-2024",
    "description": "The cryptocurrency community is buzzing with excitement as 2023 draws to an end."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-20T20:41:52.000Z",
    "title": "3 cryptos to gain most eyeballs in 2024",
    "url": "https://cryptodaily.co.uk/2023/12/3-cryptos-to-gain-most-eyeballs-in-2024",
    "description": "As the cryptocurrency world continues to grow and evolve rapidly, three digital assets are poised to gain significant attention in 2024"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T20:56:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-20T20:53:24.000Z",
    "title": "Hedera Hashgraph ($HBAR) Hits 13% Price Increase Following Exciting Collaboration",
    "url": "https://nulltx.com/hedera-hashgraph-hbar-hits-13-price-increase-following-exciting-collaboration/",
    "description": "Hedera Hashgraph $HBAR, recognized as the most utilized and sustainable enterprise-grade public network in the decentralized economy, offers a platform for individuals and businesses to create robust decentralized applications (DApps). Setting itself apart, Hedera aims to establish a fairer and more efficient system, overcoming limitations commonly found in older blockchain [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T21:00:37.000Z",
    "title": "Is Chainlink and Polygon About to Rip Higher? Whales Accumulating",
    "url": "https://www.newsbtc.com/altcoin/chainlink-polygon-rip-higher-whales-accumulating/",
    "description": "According to Lookonchain data on December 20, whales are actively accumulating Chainlink (LINK) and Polygon (MATIC) and moving them from Binance, one of the world&#8217;s largest cryptocurrency exchanges by trading volume.  Citing on-chain transfers, Lookonchain notes that LINK is specifically seeing significant accumulation from a fresh wallet labeled &#8220;0x8eAD,&#8221; which has withdrawn 247,860 LINK worth approximately $3.5 million from Binance in the past two days. Meanwhile, two new wallets, &#8220;0xa813&#8221; and &#8220;0x38b3&#8221;, have been actively accumulating MATIC, withdrawing 5 million MATIC worth around $3.13 million from Binance earlier today. Whales Accumulating, Will MATIC And LINK Rally? The fact that whales, individuals, or entities controlling large amounts of a particular token or coin are circling MATIC and LINK is net bullish and might support prices in the coming sessions.  Notably, the transfer is considered bullish when whales move coins from exchanges to non-custodial wallets like hardware wallets or even hot wallets to engage in decentralized finance (DeFi), degen trading, or NFT trading.  Related Reading: Dogecoin Price In Trouble: Whale Transfers 85 Million DOGE To Robinhood This shift is because, unlike in centralized exchanges like Binance, where their intention is usually trading for other coins or USDT, in on-chain apps, they can use the same stash to earn rewards, for instance, by providing liquidity or staking.  Therefore, considering the recent transfer, LINK and MATIC prices might recover, increasing in the coming few trading sessions. Thus far, looking at candlestick formations in the daily chart, LINK is stable and remains within an uptrend. Notably, prices are trading above the 20-day moving average, suggesting that the coin found support. LINK is currently up 155% from September lows but down 15% from November peaks.  On the other hand, MATIC is also stable and rejects attempts for lower lows. After days of consolidation, the coin has support at around $0.70, matching a critical level recorded in November.  Still, whether the uptrend will resume depends on whether prices will float higher, breaking above $0.93 or November 2023 highs in the coming session.  Technically, $0.95 marks a critical reaction level for MATIC that, if comprehensively broken, could open the doors for $1.20 and $1.60 in the coming sessions. Polygon And Chainlink Roll-Out Critical Features Beyond current technical formations, fundamental events prop up Polygon and Chainlink bulls, especially around decentralized finance (DeFi) and layer-2 scaling.  Chainlink&#8217;s new staking upgrade aims to mop more LINK from circulation, possibly increasing prices on rising demand for Cross-Chain Interoperability Protocol (CCIP).  Related Reading: MATIC Enters Correction Phase, Bleeds 10% In The Past Week Meanwhile, as other blockchains repurpose to become Ethereum layer-2, Polygon CDK is becoming a critical cog in fast-tracking the process, directly supporting MATIC prices. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-20T21:06:23.000Z",
    "title": "BRICS Unites: China and Saudi Arabia Spearhead Global Move Away From the US Dollar – Is Bitcoin Next?",
    "url": "https://www.crypto-news-flash.com/brics-unites-china-and-saudi-arabia-spearhead-global-move-away-from-the-us-dollar-is-bitcoin-next/?utm_source=rss&utm_medium=rss&utm_campaign=brics-unites-china-and-saudi-arabia-spearhead-global-move-away-from-the-us-dollar-is-bitcoin-next",
    "description": "<img width=\"940\" height=\"530\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BRICS\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png 940w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-768x433.png 768w\" sizes=\"(max-width: 940px) 100vw, 940px\" />BRICS Nations, China and Saudi Arabia have signed a currency swap agreement to break US Dollar hegemony. Bitcoin is gaining traction as a viable alternative in the race to displace the Dollar. In recent years, the global economic ecosystem has witnessed a major shift as emerging powers challenge the dominance of the United States dollar [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-20T21:00:47.000Z",
    "title": "Michael Saylor Says Bitcoin (BTC) Could Become Legitimate Treasury Reserve Asset for America’s Biggest Companies",
    "url": "https://dailyhodl.com/2023/12/20/michael-saylor-says-bitcoin-btc-could-become-legitimate-treasury-reserve-asset-for-americas-biggest-companies/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/saylor-treasury-reserve-asset.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>MicroStrategy founder and executive chairman Michael Saylor says that Bitcoin (BTC) could soon become a “legitimate” treasury reserve asset for top US companies. In a CNBC interview, Saylor says that new Financial Accounting Standards Board (FASB) rules for how publicly traded companies should report crypto holdings could speed up Bitcoin adoption. The FASB is a US [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/20/michael-saylor-says-bitcoin-btc-could-become-legitimate-treasury-reserve-asset-for-americas-biggest-companies/\">Michael Saylor Says Bitcoin (BTC) Could Become Legitimate Treasury Reserve Asset for America’s Biggest Companies</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-20T20:55:44.000Z",
    "title": "Brian Armstrong Says Coinbase Stands To Benefit From Large Incoming Pools of Capital to Crypto via Bitcoin ETF",
    "url": "https://dailyhodl.com/2023/12/20/brian-armstrong-says-coinbase-stands-to-benefit-from-large-incoming-pools-of-capital-to-crypto-via-bitcoin-etf/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Coinbase-to-Power-New.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive of Coinbase says that the crypto exchange will receive a boost from new capital coming into the space via Bitcoin (BTC) exchange-traded funds. In a new interview on CNBC Television, Coinbase CEO Brian Armstrong says that expected BTC ETFs will soon inundate the crypto industry with institutional capital and new users, complementing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/20/brian-armstrong-says-coinbase-stands-to-benefit-from-large-incoming-pools-of-capital-to-crypto-via-bitcoin-etf/\">Brian Armstrong Says Coinbase Stands To Benefit From Large Incoming Pools of Capital to Crypto via Bitcoin ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]