[
  {
    "source": "Cointelegraph",
    "date": "2024-04-01T21:28:36.000Z",
    "title": " ZachXBT onboarded as custodian for return of funds in $63M Munchables exploit ",
    "url": "https://cointelegraph.com/news/zachxbt-onboarded-custodian-return-funds-defi-exploit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvOWJhOTY1M2ItZWMxNC00OWNlLWI5ZjQtNDkxZWNmNzNkNjg3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>\"All user funds are safe, lockdrops will not be enforced, all blast related rewards will be distributed as well,\" wrote Munchables developers. </p>\n                    <p><p>Prominent blockchain sleuth ZachXBT has been onboarded as one of four custodians to a multi-sig wallet holding GameFi protocol Munchables' hacked user funds.</p><p>\"ZachXBT will be joining as the fourth signer on the multisig at this stage, completing the safe return of user funds,\" Munchables developers wrote in an April 1 <a href=\"https://twitter.com/_munchables_/status/1774841775095697720\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>. Other custodians are Manifold Trading, Selini Capital, and Munchables itself. We will also be onboarding Nethermind to audit all our refreshed contracts before going live again,\" wrote Munchables staff in a statement. All users' assets have been recovered, and refunds will be returned directly to their wallets at the time of exploit.</p><p>\"Confirming I will be temporarily joining the multisig as a signer for the initial period,\" <a href=\"https://twitter.com/zachxbt/status/1774875694096400622\" target=\"_blank\" rel=\"noopener nofollow\">said</a> ZachXBT in response to the nomination, <a href=\"https://twitter.com/zachxbt/status/1774881833630490851\" target=\"_blank\" rel=\"noopener nofollow\">adding</a>: “I just did not want to be on the multisig longterm, would expect any signers rotated out to be announced by the team.”</p><p><a href=\"https://cointelegraph.com/news/zachxbt-onboarded-custodian-return-funds-defi-exploit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-01T21:37:40.000Z",
    "title": "Bitcoin registers price growth for 7 months straight; what now?",
    "url": "https://cryptobriefing.com/bitcoin-growth-7-monts-what-now/",
    "description": "Data aggregator CoinGecko shows that Bitcoin (BTC) closed March priced at $70,854.60, with 16.8% gains, and CoinGlass data shows that this is the seventh consecutive month of growth for the largest crypto by market cap."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-04-01T21:23:18.000Z",
    "title": "48 US Lawmakers Ask SEC Chair Gensler to Clarify Whether ETH Is a Security — Warn of ‘Negative Repercussions’",
    "url": "https://news.bitcoin.com/48-us-lawmakers-ask-sec-chair-gensler-to-clarify-whether-eth-is-a-security-warn-of-negative-repercussions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"48 US Lawmakers Call on SEC Chair Gensler to Clarify Whether ETH Is a Security — Warn of &#039;Negative Repercussions&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/48-lawmakers-gensler-ether1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Forty-eight U.S. lawmakers have sent a letter to U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler asking him to clarify whether ether is a security. &#x201C;The negative repercussions of the SEC implicitly or directly classifying ETH as a digital asset security will cascade throughout the digital asset marketplace both in the short and long [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:38:03.000Z",
    "title": "Shiba Inu community warned of rising scam promotions",
    "url": "https://www.cryptopolitan.com/shiba-inu-community-warned-of-rising-scam/",
    "description": "The Shiba Inu (SHIB) community has received a critical alert regarding potential scams. This warning emphasizes the need for caution around paid promotions. Scammers have been leveraging SHIB&#8217;s rising popularity to create schemes. They often claim false affiliations with the Shiba Inu ecosystem. These deceptive practices target uninformed and eager investors. The community is advised [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:34:39.000Z",
    "title": "Binance Executive Escapes Nigerian Custody, Sparks Concerns Over Security",
    "url": "https://www.cryptopolitan.com/binance-executive-escapes-nigerian-custody/",
    "description": "The recent escape of the Binance executive Nadeem Anjarwalla from Nigerian detention is a matter of grave concern, in the view of critics, about the security systems in the country. Anjawalla and a famous cryptocurrency exchange leader of America, Tigran Gambaryan, got arrested in February this year for accusations of unlawful conduct connected to the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:32:26.000Z",
    "title": "UST should’ve crashed way before it did – Here is what actually saved it",
    "url": "https://www.cryptopolitan.com/ust-shouldve-crashed-way-before-it-did/",
    "description": "Contrary to what many thought, the UST stablecoin was on thin ice long before its epic crash. This was a disaster waiting to happen, held back only by the efforts of a few important players. Before I get into the mechanics of UST&#8217;s temporary salvation and eventual downfall, I&#8217;m gonna start you guys off with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:30:15.000Z",
    "title": "Arthur Hayes tips memecoins for massive growth",
    "url": "https://www.cryptopolitan.com/arthur-hayes-memecoins-for-massive-growth/",
    "description": "BitMEX co-founder Arthur Hayes has cautioned traders in the crypto market against labeling memecoins as ‘stupid’. Memecoins have been a subject of ridicule since they gained widespread attention in the market. According to some market participants, the assets do not provide a net positive for the blockchains that house them. Arthur Hayes backs memecoins’ growth [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:16:09.000Z",
    "title": "Crypto exchange Binance reinforces the board with three new independent members",
    "url": "https://www.cryptopolitan.com/binance-reinforce-new-independent-members/",
    "description": "Binance, a cryptocurrency exchange platform, has added three new independent members to its board of directors. The silent reflection of the update, through their official website, on August 1, promoted the addition of Gabriel Abed, Xin Wang, and Arnaud Ventura as independent directors to the Board, expanding the composition, which represents mainly senior Binance executive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:15:07.000Z",
    "title": "Upbit’s crypto trading volume plummets 75%: Altcoin frenzy fizzles out",
    "url": "https://www.cryptopolitan.com/upbits-crypto-trading-volume-plummets/",
    "description": "Upbit, South Korea&#8217;s largest crypto exchange, is said to have experienced almost a 70% drop in daily trading volume. This signifies the declining interest in altcoins due to altcoins&#8217; built-up momentum from the previous trading period. Upbit is still the No.1 cryptocurrency exchange in Korea with a 24-hour trading volume of $3.79 billion as of [&#8230;]"
  }
]