[
  {
    "source": "Decrypt",
    "date": "2023-09-11T10:52:02.000Z",
    "title": "Ex-Algorand Boss Steve Kokinos Tapped as CEO for Firm Buying Celsius",
    "url": "https://decrypt.co/155760/ex-algorand-boss-steve-kokinos-tapped-as-ceo-for-firm-buying-celsius",
    "description": "Celsius creditors played a prominent role in selecting the board for Fahrenheit Holdings—appointing six of the nine members."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-11T10:48:43.000Z",
    "title": "Friend Tech faces continued sniper bot issue, pushing price of popular creators before shares hit market",
    "url": "https://cryptoslate.com/friend-tech-faces-continued-sniper-bot-issue-pushing-price-of-popular-creators-before-shares-hit-market/",
    "description": "<p>Friend Tech (FT), the web3 social token platform that saw a resurgence in user activity recently, has seen an increase in &#8220;sniper bots,&#8221; which have been causing significant shifts in share prices. According to a detailed analysis performed by  X user @unexployed_ of Castle Capital, these bots, beyond their normally expected functionality, are deploying a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/friend-tech-faces-continued-sniper-bot-issue-pushing-price-of-popular-creators-before-shares-hit-market/\">Friend Tech faces continued sniper bot issue, pushing price of popular creators before shares hit market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-11T11:05:33.000Z",
    "title": "According to Match Systems, 118 BTC has been withdrawn from Hydra stashes a year after it was blocked",
    "url": "https://cryptodaily.co.uk/2023/09/according-to-match-systems-118-btc-has-been-withdrawn-from-hydra-stashes-a-year-after-it-was-blocked",
    "description": "Over the past three days, cryptocurrency assets totaling more than 118 BTC (worth more than $3 million at the current exchange rate) have been withdrawn from Russia's largest darknet marketplace for trading drugs and other illicit goods, Hydra."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-11T10:54:27.000Z",
    "title": "Secrets Behind Building a Successful Fintech Company",
    "url": "https://cryptodaily.co.uk/2023/09/secrets-behind-building-a-successful-fintech-company",
    "description": "Fintech company Layered Financial Independence (LFi), shares 3 Secrets Behind Building a Successful Fintech Company.\nSlug: fintech-company-building-secrets-with-luiz-goes"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T11:01:37.000Z",
    "title": "Australia surprises as third most represented nation in Ripple lawsuit",
    "url": "https://www.cryptopolitan.com/australia-surprises-as-third-most-represented-nation-in-xrp-lawsuit/",
    "description": "In a recent revelation, John E. Deaton, the legal spearhead for XRP holders in the Ripple vs. SEC case, has unveiled compelling data. This data spotlights the global diversity of XRP holders involved in the lawsuit. The United States leads the pack, accounting for 53% of the 75,000 XRP holders in the case. Given that ... <a title=\"Australia surprises as third most represented nation in Ripple lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australia-surprises-as-third-most-represented-nation-in-xrp-lawsuit/\" aria-label=\"More on Australia surprises as third most represented nation in Ripple lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T10:50:00.000Z",
    "title": "Is Quantum Computing the Key to a Greener AI Future?",
    "url": "https://www.cryptopolitan.com/quantum-computing-key-greener-ai-future/",
    "description": "In a world grappling with the soaring energy consumption of artificial intelligence (AI) systems, a glimmer of hope emerges from the realm of quantum computing. The energy-hungry nature of today&#8217;s AI models has raised alarming environmental concerns, pushing us toward an impending energy crisis.&#160; But, inspired by the astonishing efficiency of nature&#8217;s computations, researchers are ... <a title=\"Is Quantum Computing the Key to a Greener AI Future?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/quantum-computing-key-greener-ai-future/\" aria-label=\"More on Is Quantum Computing the Key to a Greener AI Future?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T11:00:50.000Z",
    "title": "Stellar (XLM) Holds Past Week Gains As Bear Taking Control Of The Market",
    "url": "https://www.newsbtc.com/analysis/xlm/stellar-xlm-holds-past-week-gains-as-bear-taking-control-of-the-market/",
    "description": "All eyes are on Stellar (XLM) as it breaches the $0.12 resistance despite the massive onslaught in the crypto market. The token managed to hold its past week&#8217;s gains while Bitcoin and other top coins maintained consistent bearish momentum.  Stellar’s current price reflects the growing demand and interest in its payment solution, which is a plausible reason behind its strength. Moreover, excitement is high among XLM investors as the Stellar network prepares for a game-chaining announcement on Tuesday.  XLM Soars Amid Heightened Speculation In The Stellar Ecosystem XLM has been bullish since September 2 following Stellar.org’s announcement that “something cool is coming” to the network in 10 days. Following this announcement, XLM&#8217;s price increased by 10%, climbing from $0.1135 to $0.126. Related Reading: Solana (SOL) Price Plunges On FTX Rumors, Buy Or Sell Now? It maintained the momentum, though with a few dips, reaching $0.134 on September 10. This price move marked a nearly 20% increase from the month low of $0.1117 recorded on August 17. Furthermore, Stellar Network continued to tease the community with the countdown to the mysterious announcement, as a September 7 tweet also teased that change is underway as the upcoming brand will introduce Stellar to the real world. The Stellar community is abuzz with anticipation as enthusiasts await the unraveling of the mystery. Some community members speculate that the upcoming announcement could be related to a partnership with Apple.  In a recent report, Stellar dominated all layer-1 networks in tokenized treasuries by market cap, surpassing Ethereum and Polygon. The August 23 tweet shows that Stellar recorded a tokenized treasury market cap of $304 million. Ethereum, on the other hand, recorded a Treasury market cap of $291 million, while Polygon followed with $24 million. This report presents Stellar as a leading real-world asset tokenization network, a plausible reason behind XLM&#8217;s price increase.  Price Outlook: XLM Slips Off $0.13. Will It Rebound? Over the past 30 days, Stellar&#8217;s XLM embodied the resilience lacking in the broader crypto market. While most coins surrendered all past gains, XLM held on, bucking negative market sentiments and soaring new highs. However, the rally has stalled, and the token currently holds over 3% price decline in the last 24 hours. But it still retains 1.78% gains in the last seven days.  Stellar has slipped off the newfound support at $0.134 and now trades at $0.1272. This downslide suggests two things. Firstly, the hype around the mysterious announcement must have dwindled. Secondly, XLM could have succumbed to the bearish pressure present in the broader crypto market. Related Reading: SOL Price Prediction: Solana Takes Hit and Could Dive To $15 Nonetheless, XLM is in a critical conjecture, as the outcome of the next 24 hours will determine its price trajectory. If the announcement is bullish enough, XLM could witness a positive momentum shift with a massive upswing above the $1.3 price. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T10:54:14.000Z",
    "title": "Ripple’s XRP: Engineered for CBDC Settlements? If Confirmed, Price Surge Inevitable Due to Scarce XRP Supply for the Trillion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-engineered-for-cbdc-settlements-if-confirmed-price-surge-inevitable-due-to-scarce-xrp-supply-for-the-trillion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-engineered-for-cbdc-settlements-if-confirmed-price-surge-inevitable-due-to-scarce-xrp-supply-for-the-trillion-dollar-market",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple is making significant strides in the Central Bank Digital Currency (CBDC) market with its Ripple CBDC platform, which leverages the XRP Ledger. The supply constraints of XRP, with approximately 100 billion tokens in circulation, might seem substantial but become less so when considering its role as a bridge for global CBDC transactions. After its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T10:53:58.000Z",
    "title": "Hedera (HBAR) and VeChain (VET) Price Predictions: How High Can They Go? Everlodge (ELDG) To Rally by 30x",
    "url": "https://www.crypto-news-flash.com/hedera-hbar-and-vechain-vet-price-predictions-how-high-can-they-go-everlodge-eldg-to-rally-by-30x/?utm_source=rss&utm_medium=rss&utm_campaign=hedera-hbar-and-vechain-vet-price-predictions-how-high-can-they-go-everlodge-eldg-to-rally-by-30x",
    "description": "<img width=\"512\" height=\"299\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-19-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-19-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-19-1-300x175.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Two recent altcoins that have gained significant attention are Hedera Hashgraph (HBAR) and VeChain (VET). Both projects offer unique features and have garnered a dedicated following in the crypto community. This article explores their price predictions for the remainder of 2023 and sees if they have the potential to reach new heights. Additionally, it touches [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-11T10:53:00.000Z",
    "title": "Could BTC Drop Up To 40% in September Before A Bottom is Found?",
    "url": "https://coinedition.com/could-btc-drop-up-to-40-in-september-before-a-bottom-is-found/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/As_Bitcoin_Struggles_to_Surpass_2000_Chainlink_Shines_and_ETH.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin’s Price At a Decisive Point on the 4-Hour Chart\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/As_Bitcoin_Struggles_to_Surpass_2000_Chainlink_Shines_and_ETH.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/As_Bitcoin_Struggles_to_Surpass_2000_Chainlink_Shines_and_ETH-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/As_Bitcoin_Struggles_to_Surpass_2000_Chainlink_Shines_and_ETH-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/As_Bitcoin_Struggles_to_Surpass_2000_Chainlink_Shines_and_ETH-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/As_Bitcoin_Struggles_to_Surpass_2000_Chainlink_Shines_and_ETH-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to John E. Deaton, a prominent cyptocurrency lawyer, no one knows what will happen next in the crypto market until it happens. In a recent post, Deaton highlighted the uncertain short term outlook for the crypto market, particularly owing to the sale of the FTX estate’s crypto assets expected this month. Deaton probed the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/could-btc-drop-up-to-40-in-september-before-a-bottom-is-found/\">Could BTC Drop Up To 40% in September Before A Bottom is Found?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]