[
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T20:40:28.000Z",
    "title": "Terraform Labs, Do Kwon file motion to dismiss SEC lawsuit",
    "url": "https://cryptoslate.com/terraform-labs-do-kwon-file-motion-to-dismiss-sec-lawsuit/",
    "description": "<p>Terraform Labs and its co-founder Do Kwon filed a motion for summary judgment with a federal court, asking the judge to dismiss the SEC&#8217;s securities fraud lawsuit against it. Terraform Labs collapsed in May 2022 after its native token LUNA lost 99% of its value when the linked algorithmic stablecoin UST lost its peg to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/terraform-labs-do-kwon-file-motion-to-dismiss-sec-lawsuit/\">Terraform Labs, Do Kwon file motion to dismiss SEC lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T21:07:05.000Z",
    "title": "Memecoins showcase a solid comeback amid the return of the market bulls",
    "url": "https://www.cryptopolitan.com/memecoins-comeback-amid-the-bull-market/",
    "description": "Generally, the entire crypto market is experiencing a bull trajectory, being led by major assets like Bitcoin and minor currencies, including memecoins. In a 24-hour timeframe, currencies, including PEPE and FLOKI, experienced impressive gains since the weekend ending on October 29.&#160; Among the reasons fostering this bullish market attribute is the fueled growing interest in ... <a title=\"Memecoins showcase a solid comeback amid the return of the market bulls\" class=\"read-more\" href=\"https://www.cryptopolitan.com/memecoins-comeback-amid-the-bull-market/\" aria-label=\"More on Memecoins showcase a solid comeback amid the return of the market bulls\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T20:58:06.000Z",
    "title": "The crypto market is up today, and here’s a breakdown of today’s events ",
    "url": "https://www.cryptopolitan.com/crypto-market-is-up-today-and-heres-why/",
    "description": "The digital currency market recorded a positive trajectory today, and this has been favored by various surges in cryptocurrencies, including Bitcoin, Pepe Coin, AXS, and DOGE. A bull run for these assets has signaled an expected market surge as optimistic sentiments flooded social platforms in light of the broader market move toward the upside.&#160; October ... <a title=\"The crypto market is up today, and here’s a breakdown of today’s events \" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-market-is-up-today-and-heres-why/\" aria-label=\"More on The crypto market is up today, and here’s a breakdown of today’s events \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T20:53:28.000Z",
    "title": "Here’s what you need to know to prepare for crypto this week",
    "url": "https://www.cryptopolitan.com/what-to-know-to-prepare-for-crypto-this-week/",
    "description": "Crypto analysts have been keen on the digital space as they present various findings and market predictions. Among them is the awaited exchange-traded funds (ETF) approval that has been debated for a long period as analysis predicted approval of these digital products would revolutionize the market.&#160; Celsius has also explained and warned about phishing scammers, ... <a title=\"Here’s what you need to know to prepare for crypto this week\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-to-know-to-prepare-for-crypto-this-week/\" aria-label=\"More on Here’s what you need to know to prepare for crypto this week\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T21:08:00.000Z",
    "title": "SBF trial day 15: “I was trying to help” FTX founder claims on third day of testimony",
    "url": "https://crypto.news/sbf-trial-day-15-i-was-trying-to-help-ftx-founder-claims-on-third-day-of-testimony/",
    "description": "FTX’s founder stuck to his guns on who to blame for Alameda’s spending and use of customer funds during the third day of his testimony in United States v Sam Bankman-Fried."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T20:41:09.000Z",
    "title": "dYdX chain goes live, unveils Bridge UI for token conversion",
    "url": "https://crypto.news/dydx-chain-goes-live-unveils-bridge-ui-for-token-conversion/",
    "description": "The dYdX Foundation announces the launch of its mainnet and a new Bridge User Interface."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T21:00:58.000Z",
    "title": "Ethereum’s Price Teetering: Analyst Forecasts Surge Past $2,000 On One Condition",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-price-teetering-analyst-forecasts-surge-past-2000-on-one-condition/",
    "description": "Ethereum (ETH), the second-largest crypto by market capitalization, has been in the spotlight due to its price action. A notable crypto analyst, Pentoshi, shed light on the asset&#8217;s price trajectory, suggesting a possible uptick in value if current conditions prevail. It is worth noting that this analyst&#8217;s predictions come at a time when Ethereum trails behind Bitcoin&#8217;s recent price rally. Notably, while Bitcoin has recorded a 12.5% increase over the past week, Ethereum&#8217;s gains are modest, rising by 8.4% during the same timeframe. Related Reading: Ethereum Resilient Above $1,800 Pre-FOMC Meeting – Details Ethereum Price Bracket Significance According to the analyst&#8217;s post, Ethereum&#8217;s immediate future could see an upward trend if it manages to close the week within a specific price range. The suggested target zone, between $1,796 and $2,148, is critical, as highlighted by Pentoshi. Should ETH&#8217;s closing price fall within this bracket, the analyst posits a potential path cleared for Ethereum to reach or even surpass the $2,200 mark. While Ethereum lags Bitcoin&#8217;s recent performance, the analyst remains optimistic about its prospects. Pentoshi indicates that Ethereum is approaching a &#8220;demand zone,&#8221; on the BTC/ETH ratio. Notably, this could stimulate buying activity and influence its price positively. $ETH Closing this weekly back inside the range opens up the doors to $2,200 Despite it severely underperforming BTC it&#8217;s now beginning to enter the demand zone on the btc /eth ratio BTC is bullish as long as above the 31.5-32.5k area thus I&#8217;ll continue to have bullish bias… pic.twitter.com/Hwoi8jwr2O — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) October 29, 2023 Bitcoin&#8217;s Bullish Standpoint Maintained Pentoshi is bullish on Bitcoin, the pioneer cryptocurrency, provided it remains above a particular threshold. The $31,500 and $32,500 area is highlighted as Bitcoin&#8217;s support zone. The analyst maintains that staying above this range could sustain the positive outlook on Bitcoin. However, a dip below these levels would suggest re-evaluating this bullish analysis. Regardless, Bitcoin does not currently appear to be moving towards any support but instead seems to be pushing above any resistance.  In just four days, the asset has climbed from a trading price of $34,000 last Thursday to a present trading value of $34,760 at the time of writing. It’s worth noting that BTC has embarked on a significant uptrend, ascending more than 20% in the last two weeks. Related Reading: The Hidden Signals: Bitcoin’s On-Chain Data Points To Bullish Outlook, But There’s A Catch Ethereum has also experienced a rally but hasn’t matched Bitcoin’s momentum. Over the past 14 days, ETH has seen a 14.8% increase and is currently trading at $1,820, marking a 1.4% rise in the last 24 hours alone. Featured image from Unsplash, Chart from TradingView"
  }
]