[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T18:27:12.000Z",
    "title": "Crypto Catalyst Watch: What Might Move Markets This Week",
    "url": "https://www.coindesk.com/markets/2023/06/12/crypto-catalyst-watch-what-might-move-markets-this-week/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Federal Reserve’s latest rate hike decision and U.S. inflation data are among key upcoming items."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T18:20:00.000Z",
    "title": "Standard Crypto VC Co-Founder on NFTs and Their Stigma in Gaming",
    "url": "https://decrypt.co/videos/interviews/bmtrrLio/standard-crypto-vc-co-founder-on-nfts-and-their-stigma-in-gaming",
    "description": "Alok Vasudev is a co-founder of venture capital firm Standard Crypto. In an interview with Decrypt's Kate Irwin, he shares his thoughts on NFT marketing, NFT utility in gaming, and the stigma that pervades the industry."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T18:11:46.000Z",
    "title": "Investors Have Pulled $417M Out of Crypto Funds in Two Months",
    "url": "https://decrypt.co/144251/investors-have-pulled-417m-out-of-crypto-funds-in-two-months",
    "description": "“Currently there is no end in sight to interest rates rises,\" James Butterfill, head of research at CoinShares, writes in the new report."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T18:30:00.000Z",
    "title": "​​Crypto fund outflows reach $417M over 8 weeks as investor caution persists",
    "url": "https://cointelegraph.com/news/crypto-fund-outflows-reach-417m-over-8-weeks-as-investor-caution-persists",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/670749ed-6049-47cf-b2ae-338dcacfa7ce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to CoinShares, digital asset investment product outflows amounted to $88 million last week.</p>\n                    <p><p>On June 12, European cryptocurrency investment firm CoinShares <a href=\"https://blog.coinshares.com/volume-135-digital-asset-fund-flows-weekly-report-6a27bb41b479\" target=\"_blank\" rel=\"noopener nofollow\">published</a> its latest weekly “Digital Asset Fund Flows Report,” revealing that cryptocurrency investment products experienced outflows of $88 million last week. The substantial drawdown added to the ongoing eight-week streak of outflows, which now total $417 million. Analysts at CoinShares have attributed this ongoing trend to monetary policy considerations, as interest rate hikes show no signs of slowing down, prompting investors to remain cautious.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e44b1bb3-317a-4b24-8e0d-e489d9d9330a.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Digital asset investment products have seen a substantial drawdown over the past 2 months. Source: CoinShares</em></figcaption></figure><p>In the past week, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) products witnessed $36 million of outflows, marking the largest weekly outflows for the asset since the <a href=\"https://cointelegraph.com/news/the-ethereum-merge-is-completed-here-s-what-s-next\">Ethereum Merge in September 2022</a>.</p><p>Meanwhile, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) investment products witnessed outflows totaling $52 million during the analyzed period. This brings the eight-week cumulative outflows for Bitcoin to $254 million, representing approximately 1.2% of the total assets under management (AUM). Additionally, short-Bitcoin products recorded outflows of $1.1 million, with seven-week outflows accounting for 44% of AUM.</p><p>Altcoins, on the other hand, exhibited “mixed fortunes” during this period. Minor inflows were observed for Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>), XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), while Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) experienced outflows. “Interestingly, on aggregate, altcoins have seen inflows year-to-date (except Tron), in stark contrast to Bitcoin and Ethereum,” observed CoinShares’ report author James Butterfill. </p><p>Interestingly, 87% of the outflows were concentrated within a single provider, indicating a regional impact. Most of these outflows originated from North America, while Switzerland witnessed minor inflows of $9.2 million. On the other hand, Germany experienced outflows of $9.4 million.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-and-select-altcoins-show-resilience-even-as-the-crypto-market-sell-off-continues\">Bitcoin and select altcoins show resilience even as the crypto market sell-off continues</a></em></strong></p><p>Despite the <a href=\"https://cointelegraph.com/news/u-s-senator-lummis-revamps-efforts-for-crypto-regulations-amid-sec-lawsuits\">regulatory pressures</a> and concerns surrounding the cryptocurrency sector, the digital asset market has shown remarkable resilience, with the total crypto market maintaining its $1 trillion-plus market cap. The relative resilience shown by altcoins suggests investors have diversified their exposure to cryptocurrencies despite concerns over regulatory crackdowns on assets deemed to be securities. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T18:26:57.000Z",
    "title": "Price analysis 6/12: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, MATIC",
    "url": "https://cointelegraph.com/news/price-analysis-6-12-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/85611b57-16fd-4410-8084-1168ddacd54d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Market observers will closely watch the United States CPI data and the Fed’s policy decision to provide direction to the stock and crypto market.</p>\n                    <p><p>After the tough sell-off seen in the past week, the cryptocurrency markets will be looking for some support from the macroeconomic data this week. The all-important United States consumer price index report on June 13 will be followed up by the Federal Reserve’s policy decision on June 14. </p><p>Both these events could trigger a sharp response from the equities and crypto traders. While a knee-jerk reaction is expected, it will be interesting to note if there is any follow-up to it. Traders may remain cautious as market volatility is likely to pick up over the next few days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/07b5fdbf-621f-4393-9005-37e77f95a45b.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Although the lawsuit by the U.S. Securities and Exchange Commission (SEC) against Binance and Coinbase has weakened sentiment, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) whales are using this opportunity to increase their holdings. Behavior analytics platform Santiment said in a recent report that <a href=\"https://cointelegraph.com/news/sec-cpi-and-a-strong-rebound-5-things-to-know-in-bitcoin-this-week\">Bitcoin whales accumulated 57,578 Bitcoin</a> since April 9 even as Bitcoin’s price fell by roughly 10% during the period.</p><p>What are the important support levels in Bitcoin and the major altcoins that need to hold for the recovery to start? Let’s study the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index (SPX) reached the overhead resistance at 4,325 on June 9 but the long wick on the day’s candlestick shows that the bears are trying to stall the up-move at this level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d3cf7c05-a58c-4e11-9338-4e006044ae3c.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: TradingView</em></figcaption></figure><p>The upsloping moving averages and the relative strength index (RSI) in the positive territory indicate that the path of least resistance is to the upside. If buyers thrust the price above 4,325, the index could start its march toward 4,500 where the bulls may encounter selling from the bears.</p><p>This positive view will invalidate in the near term if the price turns down and breaks below the moving averages. Such a move will suggest that the bulls are aggressively booking profits. The index could then tumble to the uptrend line.</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index (DXY) skidded back below the 20-day exponential moving average (103) on June 8 but the bears are struggling to sustain the lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/713f0b21-d288-42cb-92ec-6880ec8de50a.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: TradingView</em></figcaption></figure><p>Buyers are trying to propel the price back above the 20-day EMA, which could start a rally to $104.70 and subsequently to $106. This level is likely to act as a formidable resistance.</p><p>The flattish 20-day EMA and the RSI just above the midpoint suggest that the index may remain inside the large range between 100.82 and 106 for a while longer. </p><p>Alternatively, if the price turns down and slips back below the 20-day EMA, it will suggest that the bears are selling on rallies. The index could then start a deeper correction to the 50-day simple moving average (102).</p><h2>Bitcoin price analysis</h2><p>The bulls have managed to sustain Bitcoin above the important support of $25,250 for the past few days, indicating strong buying at the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/909d2d66-e1bf-4fd5-adfd-e35ec4019110.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Although the downsloping moving averages indicate advantage to bears, the positive divergence on the RSI suggests that the selling pressure could be reducing. The bulls will try to thrust the price above the 20-day EMA ($26,654), clearing the path for a potential rally to the resistance line of the descending channel.</p><p>Instead, if the price turns down from the 20-day EMA, it will suggest that the bears are maintaining their selling pressure. The BTC/USDT pair could then retest the support at $25,250. If this level breaks down, the pair may decline to the support line of the channel and eventually to $20,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) tried to start a recovery on June 11 but the shallow bounce suggests that the bears are selling on every minor rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/29d14829-9114-44fa-ac57-587c57593e9d.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to strengthen their position further by dragging the price below the immediate support at $1,700. If that happens, it will suggest the start of a deeper correction. There is a minor support at $1,600 but if this level gives way, the decline may extend to $1,352.</p><p>On the contrary, if the ETH/USDT pair once again rebounds off $1,700, it will signal that the bulls are fiercely protecting the level. A rally above the resistance at $1,778 could clear the path for a potential up-move to the moving averages.</p><h2>BNB price analysis</h2><p>BNB’s (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) price fell from $305 on June 5 to $220 on June 12, a 27% fall within a few days. This indicates that the bears are in firm command.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/45ed2c98-a483-463f-b5e6-235739d5aad2.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The sharp decline has pulled the RSI into deeply oversold territory, suggesting that a relief rally is possible in the next few days. The BNB/USDT pair could first rise to $240 and thereafter attempt a rally to the 38.2% Fibonacci retracement level of $252.50.</p><p>If the price turns down from this level, it will suggest that the sentiment remains negative and traders continue to sell on rallies. The bears will then again try to tug the price below $220. If they pull it off, the pair could nosedive to $200 and then to $183.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) has been a relative outperformer in the past few days as the bulls have managed to sustain the price above the moving averages.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/407dcb37-4254-4353-98e1-82fe50e68c85.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The buyers will have to overcome the obstacle at $0.56 to start the next leg of the uptrend. The XRP/USDT pair could then rise to $0.65.</p><p>However, this may not be easy because bears are likely to protect the $0.56 level with vigor. If the price dips below the 20-day EMA ($0.50), it could signal that the bulls are losing their grip. The pair may then slump to the 50-day SMA ($0.47), which is an important level to keep an eye on. </p><p>If the price rebounds off this level, the pair may oscillate between the 50-day SMA and $0.56 for a few days.</p><h2>Cardano price analysis </h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) succumbed to intense selling pressure after breaking down from the ascending channel pattern on June 5. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5a56e6f3-742d-4903-a0ff-e09fcbbd2840.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The downward move continued and on June 10, the ADA/USDT pair plunged below the crucial support at $0.24. This drop sent the RSI deep into the oversold territory indicating that the selling may have been overdone in the near term.</p><p>Strong buying at $0.22 started a recovery that may first reach $0.29 and then the 20-day EMA ($0.33). This zone is likely to witness intense battles between the bulls and the bears. If the price turns down from the zone, it will suggest that bears remain in the driver’s seat.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-and-select-altcoins-show-resilience-even-as-the-crypto-market-sell-off-continues\"><em>Bitcoin and select altcoins show resilience even as the crypto market sell-off continues</em></a></p><h2>Dogecoin price analysis</h2><p>The bears pulled Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) below $0.06 on June 10 but the bulls purchased this drop and the price recovered to close above the support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f3ec0fdd-b67b-4767-b548-4f26f3d99ae4.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>However, the bulls are struggling to start a meaningful pullback, indicating that demand dries up at higher levels. The bears will once again try to sink the price below the strong support at $0.06. If they do that, the DOGE/USDT pair could slump to the next major support near $0.05.</p><p>The bulls are expected to guard the zone between $0.06 and $0.05 with all their might because a break below it may lead to panic selling. Buyers will have to kick the price back above $0.07 to gain strength.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) slipped below the strong support of $15.28 on June 10 but the long tail on the candlestick shows aggressive buying at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/33c3eb6c-304d-433e-b403-d1b407cd8968.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Buyers attempted to start a rebound but the Doji candlestick pattern on June 11 shows that the bears are not willing to let go of their advantage easily. They are again trying to pull the price below the support at $15.28. If they succeed, the price could decline to the next support at $12.69.</p><p>Contrarily, if the price turns up from the current level and rises above $16.18, it will signal the start of a stronger recovery. The SOL/USDT pair could then rise to the 20-day EMA ($18.85) where the bears may again mount a strong defense.</p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) plummeted below the vital support of $0.69 on June 10, indicating that bears are in firm control.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1027b99c-e447-44ae-bbf4-fae1184f8e92.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>A minor solace for the buyers is that the price recovered sharply off the strong support near $0.50 as seen from the long tail on the day’s candlestick. The MATIC/USDT pair will attempt a bounce, which is likely to face strong selling at the breakdown level of $0.69. </p><p>If the price turns down from this level, it will suggest that the bears are trying to flip $0.69 into resistance. That could result in a retest of $0.50. If bulls want to start a sustained recovery, they will have to drive and sustain the price above the 20-day EMA ($0.79).</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T18:21:10.000Z",
    "title": "The first-world debt crisis means you can expect more pain ahead",
    "url": "https://cointelegraph.com/news/debt-crisis-expect-more-pain-ahead",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/a65b1c3f-9319-4c84-910e-6e05f41762f1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>You should be prepared for gradual deterioration in your quality of life — or search for alternative assets that could protect your wealth. </p>\n                    <p><p>The huge volume of <a href=\"https://cointelegraph.com/news/debt-ceiling-crisis-best-practices-to-navigate-this-market\">sovereign debt</a> in developed countries (particularly the United States) is often exploited to promote questionable theories about imminent financial collapse.</p><p>However, the problem is real, and it has become much more acute due to interest rates rising in response to <a href=\"https://cointelegraph.com/learn/bitcoin-and-inflation-everything-you-need-to-know\">entrenched inflation</a>.</p><p>The United States <a href=\"https://www.pgpf.org/blog/2023/02/interest-costs-on-the-national-debt-are-on-track-to-reach-a-record-high#:~:text=Interest%20payments%20on%20the%20national,another%2035%20percent%20in%202023\" target=\"_blank\" rel=\"noopener nofollow\">paid</a> $475 billion for debt service alone in fiscal year 2022. According to some <a href=\"https://www.pgpf.org/analysis/2023/05/higher-interest-rates-will-raise-interest-costs-on-the-national-debt\" target=\"_blank\" rel=\"noopener nofollow\">forecasts</a>,<strong> </strong>the U.S. will spend more on debt interest payments in 10 years than on the military — and it is not sparing any expense on the latter. The U.S. is a prominent example of an emerging debt crisis, but the situation is not much different in other developed countries that have been printing money like there’s no tomorrow.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c6aa7f33-06d0-47d5-8e66-dafce8fe473c.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>U.S. national debt as of June 12, 2023. Source: USdebtclock.org</em></figcaption></figure><p>Is a debt default on the horizon? It’s unlikely in the short term. During the COVID-19 crisis, developed countries demonstrated their unwillingness to bear short-term blows, even if the applied “band-aid” implies significant costs in the future. Simply put, neither the elites nor the population are prepared for short-term losses.</p><p>However, the debt problem will not vanish. That means a gradual and prolonged deterioration of people’s living standards through inflation. This will happen through regular price increases and hidden inflation, such as reduced product quality and smaller packaging sizes.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/what-will-cryptocurrency-look-like-in-2027-here-are-5-predictions\"><strong><em>What will the cryptocurrency market look like in 2027? Here are 5 predictions</em></strong></a></p><p>Various narratives can be used to justify this deterioration. The most “promising” approach would be to make poverty fashionable. The media — obedient in translating official narratives to become \"trendy\" — will be quick to tell us that we should buy “sustainable” goods instead of disposable ones; refrain from traveling not because it’s expensive, but because it’s environmentally friendly; and so on.</p><p>The key thing to remember is that it would be easy to hide currency devaluation as the performance of currencies is measured against other currencies, which all share the same problems. When the purchasing power of the U.S. dollar and euro declines due to rampant money printing in both economies, the euro and USD may stay relatively stable, creating an illusion of stability for both currencies.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: Median asking rent for a US home rises 1.4% in May to $1,995/month.<br><br>Meanwhile, the average new car payment is now $800/month.<br><br>On top of this, the average American is paying $430/month in credit card debt.<br><br>This means the average person is now paying $3,225/month for…</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1668309684103655446?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>There won’t be many options left for those who protest. Deposits and bonds denominated in reserve currencies will consistently lose against real inflation. This plan has long been implemented, as anyone holding money in deposits in developed countries is financing interest payments on accumulated debts. Holding bonds is hardly a better idea: The yield on 10-year Treasuries barely exceeds official inflation, while the real inflation for key items like housing, education and healthcare is notably higher.</p><p>Among the financial instruments,<strong> </strong>the only remaining options are cryptocurrencies and stocks. Both are denominated in currencies whose purchasing power is deteriorating daily.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-charges-binance-coinbase-terrible-defi\"><strong><em>SEC charges against Binance and Coinbase are terrible for DeFi</em></strong></a></p><p>The S&amp;P 500 <a href=\"https://www.officialdata.org/us/stocks/s-p-500/1928?amount=100&amp;endYear=2022\" target=\"_blank\" rel=\"noopener nofollow\">returned</a> 6.58% per year between 1928 and 2022, on an inflation-adjusted basis. Once again, that’s compared to official inflation, while the real inflation tends to be higher, especially for the low and middle-income guys. </p><p>Meanwhile, the S&amp;P 500 has steadily lost ground against the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). Several boom-bust cycles in crypto did not change the general trend. Over the longer term, BTC served as a protection against both inflation and the underperformance of the S&amp;P 500.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/35f59c45-7d11-4989-a5c6-a9ddffa48d7d.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Growth in the S&amp;P 500 compared to growth in the price of Bitcoin, July 2018 through June 2023. Source: InflationChart.com.</figcaption></figure><p>Talking about fundamentals, data suggests Bitcoin inflation stands today at just 1.74% — way below the official U.S. inflation of 4.9%. At current levels, Bitcoin inflation is already lower than the Fed’s desired 2% target, which means that Bitcoin has a solid base to outperform the U.S. dollar, which suffers from rampant money-printing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/54ed3e30-0ccb-4dd7-a4f4-ca52582ec555.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">The price of Bitcoin compared to the U.S. inflation rate and stock-to-flow ratio, 2010–2023. Source: Willy Woo via Glassnode data.</figcaption></figure><p>In addition to inflation protection, Bitcoin (and crypto in general) brings privacy and control over your finances. While the “privacy value” is hard to quantify, it may deserve a big premium even in developed countries. For example, a 2013 Cyprus bank crisis led to a 9.9% haircut for depositors who held more than 100,000 euros — and the media did its best to quickly forget the crisis. There is no guarantee bigger economies will not follow the same path when politicians run out of funds. Crypto is one of the few assets that could protect against such risks. </p><p>Between January and June 2023, Bitcoin’s price grew more than 50%. It is still far from its all-time highs, but it is par for the course for Bitcoin to fall after spectacular bouts of growth.</p><p>Another spike in value is not far-fetched if leading economies continue to devalue their currencies. And it’s a certainty they will do so because they have no other options.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Igor Varnavsky</strong> is the chief marketing officer of DeFiHelper, a decentralized noncustodial investment assistant that helps manage and automate DeFi investments across other protocols.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T18:29:05.000Z",
    "title": "Mark Cuban criticizes the SEC for its unclear registration process",
    "url": "https://www.cryptopolitan.com/mark-cuban-sec-for-registration-process/",
    "description": "Renowned billionaire investor Mark Cuban recently joined a growing chorus of industry figures in expressing dissatisfaction with the United States Securities and Exchange Commission (SEC) over what he perceives as a lack of clear registration guidelines for cryptocurrency firms. Cuban took to Twitter to highlight the absence of a registration process within the SEC’s “Framework ... <a title=\"Mark Cuban criticizes the SEC for its unclear registration process\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mark-cuban-sec-for-registration-process/\" aria-label=\"More on Mark Cuban criticizes the SEC for its unclear registration process\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T18:15:28.000Z",
    "title": "Is Ethereum 2.0 Staking Profitable After The Merge Event?",
    "url": "https://www.cryptopolitan.com/is-ethereum-2-0-staking-profitable-after-the-merge-event/",
    "description": "Ethereum has been at the forefront of innovation and change in the ever-evolving crypto sphere. The Ethereum network, known for its smart contract functionality and the birthplace of decentralized applications (dApps), has recently undergone a transformative event known as the &#8216;Ethereum Merge.&#8217; This event marks a significant shift in Ethereum&#8217;s consensus mechanism, transitioning from Proof ... <a title=\"Is Ethereum 2.0 Staking Profitable After The Merge Event?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-ethereum-2-0-staking-profitable-after-the-merge-event/\" aria-label=\"More on Is Ethereum 2.0 Staking Profitable After The Merge Event?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T18:12:51.000Z",
    "title": "Vitalik Buterin outlines elements that will help Ethereum succeed",
    "url": "https://www.cryptopolitan.com/vitalik-buterin-elements-ethereum-succeed/",
    "description": "Vitalik Buterin, the co-founder of Ethereum, has identified three crucial technical “transitions” that he believes will determine the success of the Ethereum blockchain. In a recent blog post, Vitalik Buterin emphasized the significance of layer-2 scaling, wallet security, and privacy-preserving features in driving Ethereum’s growth and adoption. Vitalik Buterin highlights Scaling as a key element ... <a title=\"Vitalik Buterin outlines elements that will help Ethereum succeed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vitalik-buterin-elements-ethereum-succeed/\" aria-label=\"More on Vitalik Buterin outlines elements that will help Ethereum succeed\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T18:30:12.000Z",
    "title": "US Court grants Galaxy Digital victory, dismisses $100m BitGo lawsuit",
    "url": "https://crypto.news/us-court-grants-galaxy-digital-victory-dismisses-100m-bitgo-lawsuit/",
    "description": "The Delaware Court of Chancery has granted a motion by Galaxy Digital, resulting in the dismissal of BitGo's case following the abandoned acquisition."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T18:14:35.000Z",
    "title": "BOCI and UBS issue tokenized securities in Hong Kong via Ethereum",
    "url": "https://crypto.news/boci-and-ubs-issue-tokenized-securities-in-hong-kong-via-ethereum/",
    "description": "BOCI, the investment banking subsidiary of the Bank of China, has successfully launched tokenized structured notes valued at 200 million offshore renminbi ($28 million) on the Ethereum blockchain. "
  },
  {
    "source": "Kraken Blog",
    "date": "2023-06-12T18:16:01.000Z",
    "title": "Polygon lands on Kraken NFT — trade Reddit Collectible Avatars today",
    "url": "https://blog.kraken.com/polygon-lands-on-kraken-nft-trade-reddit-collectible-avatars-today",
    "description": "Did you catch the exciting news in our Kraken launches your gateway to the world of NFTs post last week? Polygon NFTs are now available on Kraken NFT — the secure marketplace to explore, collect and trade non-fungible tokens with zero gas fees.*&#160;Clients can now use the Polygon network to deposit and withdraw supported Polygon [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T18:30:57.000Z",
    "title": "Bitcoin Stuck In Historically Tight Range, Calm Before The Storm?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-stuck-historically-tight-range-calm-before-storm/",
    "description": "Data shows Bitcoin has been stuck in a historically tight range recently, something that could be a precursor for extreme volatility. Bitcoin 30-Day Price Range Has Compressed To Tight Values In a new tweet, the analytics firm Glassnode has looked into how volatile the asset has been recently. One way to quantify the volatility of Bitcoin is by taking the highest and lowest price points over a specific time period and calculating their percentage difference. The timespan of interest in the context of the current discussion is the 30-day period, meaning that the volatility here is calculated by checking for the difference between the top and bottom registered during the last 30 days. Naturally, whenever the value of this metric is high, it means that the cryptocurrency&#8217;s price has observed large fluctuations in the past month. On the other hand, low values imply that the asset has traded inside a narrow range. Related Reading: Bitcoin Bearish Signal: Miners Sell At 3rd Largest Scale Ever Now, here is a chart that shows the trend in the 30-day high and low, as well as the difference between the two (that is, the 30-day range), for Bitcoin over the entire history of the coin: The value of the metric seems to have been quite low in recent days &#124; Source: Glassnode on Twitter As displayed in the above graph, the Bitcoin 30-day range has had a value of 10.7% recently, meaning that the cryptocurrency&#8217;s price has fluctuated 10.7% between its top and bottom during the past month. From the graph, it&#8217;s clearly visible that the current value of the indicator is very low when compared to the norm during the asset&#8217;s history. Interestingly, this is despite the fact that the BTC price has registered some fresh volatility recently due to FUD around Binance and Coinbase coming under regulatory pressure. While the asset may have seen some short-term volatile price action following the emergence of this uncertainty in the market, Bitcoin has still overall only traded in a narrow range when looking at the grand scheme of things. Related Reading: Bitcoin “Throwback” Could Trigger Flawless Technical Bottom Formation In the chart, the analytics firm has also highlighted the trading days that saw an even tighter 30-day range than the one being observed currently. As expected, it looks like there haven&#8217;t been that many instances where such a trend has taken place. Curiously, following most of these occurrences, the Bitcoin price observed a burst of volatility as the narrow 30-day range decompressed. One prominent example of this would be the November 2018 crash, which was preceded by a period of the asset moving endlessly sideways inside a tight range. This crash occurred during the bear market of the previous cycle and lead to the formation of the cyclical bottom for it. If the pattern followed by all these instances is anything to go by, Bitcoin may currently be approaching a narrow range that would only result in some extreme volatility for the asset in the near term. BTC Price At the time of writing, Bitcoin is trading around $25,900, down 3% in the last week. Looks like BTC has been moving sideways since the plunge &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T18:15:40.000Z",
    "title": "Prepare Yourself for the Crypto Gold Rush of 2023: Pepecoin and Another just listed Memecoin Arise as the Sole Two Tokens for Lucrative 25x Returns",
    "url": "https://www.crypto-news-flash.com/prepare-yourself-for-the-crypto-gold-rush-of-2023-pepecoin-and-another-just-listed-memecoin-arise-as-the-sole-two-tokens-for-lucrative-25x-returns/?utm_source=rss&utm_medium=rss&utm_campaign=prepare-yourself-for-the-crypto-gold-rush-of-2023-pepecoin-and-another-just-listed-memecoin-arise-as-the-sole-two-tokens-for-lucrative-25x-returns",
    "description": "Emerging star memecoin SMURFS has just landed its first major listing on a centralized exchange. Alongside with frog-themed memecoin sensation, investors are bound for massive return on investment. In the ever-evolving world of crypto, 2023 has emerged as a pivotal year. The crypto market, aided by the memecoin revolution, has witnessed unprecedented growth and innovation, [...]"
  }
]