[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-10T05:30:26.000Z",
    "title": "Singapore’s Crypto.com to Halt US Institutional Division Citing ‘Limited Demand’",
    "url": "https://news.bitcoin.com/singapores-crypto-com-to-halt-us-institutional-division-citing-limited-demand/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Singapore&#039;s Crypto.com to Halt US Institutional Division Citing ‘Limited Demand’\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/arm.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Singapore-based cryptocurrency exchange Crypto.com announced that it intends to halt services for institutional traders in the United States on June 21, 2023. The exchange cited &#8220;limited demand&#8221; as the reason for suspending its institutional offering. Crypto.com to Cease U.S. Institutional Services on June 21 Crypto.com, the Singapore-based cryptocurrency exchange with 80 million customers worldwide, announced [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-10T05:31:58.000Z",
    "title": "Cardano (ADA) Faces Obstacles In Reaching Key Level In June – Here’s Why",
    "url": "https://www.newsbtc.com/news/cardano-ada-obstacles-in-hitting-0-3/",
    "description": "Cardano (ADA), along with numerous other major altcoins, experienced a significant downturn in recent days, causing considerable losses for investors. However, the downward trajectory of prices observed across the cryptocurrency market did not provide a reassuring signal for a potential reversal in the near future. As panic and uncertainty gripped the crypto space, holders of Cardano and other altcoins found themselves questioning the stability and future prospects of these digital assets.  What factors contributed to this market-wide decline, and what lies ahead for Cardano amidst this turbulent period? Related Reading: Bearish BNB Signs Hint Downtrend May Persist Beyond Expectations Bearish Trend Emerges As Cardano (ADA) Price Plummets A recent report shed light on the alarming bearish scenario for Cardano (ADA) on its price charts.  Currently valued at $0.248073 according to CoinGecko, ADA has suffered a significant decline of 22.2% within the past 24 hours, further exacerbating the downward trend. Over the span of the last seven days, the cryptocurrency has experienced a staggering downturn, plummeting by 34.2%. Source: Coingecko A recent report emphasized the bearish landscape depicted by Cardano (ADA) on its charts, specifically noting its current price, and the breach below the $0.348 mark. This development set the stage for bears to take control of the market across higher timeframes. The report highlighted the significance of this downward movement, as it not only signaled a shift in momentum but also posed challenges for Cardano&#8217;s price recovery. Related Reading: ApeCoin Holders Suffer Financial Pain As 95% Endure Negative Returns With the breach of the crucial support level, bears gained the upper hand in dictating market dynamics, particularly on longer timeframes. This bearish sentiment cast a shadow over Cardano&#8217;s performance, making it increasingly difficult for the ADA token to regain lost ground and establish upward momentum. The report&#8217;s analysis underscored the implications of bears dominating the market, emphasizing the obstacles Cardano might face in its price trajectory. In an attempt to alter the prevailing trend, the bulls made a late May push and managed to establish a high at $0.386. However, their efforts to sustain this shift in market sentiment were futile as they failed to capitalize on this change in character. The failure to maintain the bullish momentum has left Cardano investors and market participants on edge, grappling with concerns about the cryptocurrency&#8217;s future trajectory. Cardano (ADA) market cap currently at $8.5 billion. Chart: TradingView.com SEC&#8217;s Security Label And Lawsuits Intensify Market Jitters Adding to the already gloomy market sentiment, the US Securities and Exchange Commission (SEC) dealt a significant blow to Cardano by classifying ADA as a security. This categorization triggered a wave of apprehension among investors, leading many to flee from the cryptocurrency markets.  Cardano&#8217;s IOG Dismisses SEC&#8217;s Claim that ADA is a Security #Cardano #cardanofeed #ADA #crypto #cardanocommunity #bitcoin #CoinMarketCap #blockchain #cryptocurrency #CardanoADA #btc $ADAhttps://t.co/rOjRcaWXJN — Cardano Feed ($ADA) (@CardanoFeed) June 9, 2023 Compounding the unease, the SEC filed lawsuits against Coinbase and Binance, further exacerbating the panic surrounding the already bleak market outlook in the crypto sphere. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) Featured image from iStock"
  }
]