[
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T03:00:25.000Z",
    "title": "Op-ed: As the House readies a crypto bill, what’s heeded to keep the U.S. at the forefront of web3 innovation?",
    "url": "https://cryptoslate.com/op-ed-as-the-house-readies-a-crypto-bill-whats-heeded-to-keep-the-u-s-at-the-forefront-of-web3-innovation/",
    "description": "<p>The following is a guest post from Nilmini Rubin, Chief of Staff and Head of Global Policy at Hedera. When I testified on the future of digital assets in front of the House Subcommittee on Commodity Markets, Digital Assets, and Rural Development, the discussion addressed the impactful uses of cryptocurrencies and how the lack of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-as-the-house-readies-a-crypto-bill-whats-heeded-to-keep-the-u-s-at-the-forefront-of-web3-innovation/\">Op-ed: As the House readies a crypto bill, what’s heeded to keep the U.S. at the forefront of web3 innovation?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T02:44:41.000Z",
    "title": "Bitcoin Bulls Keep Pushing, Why Rally Isn’t Over Yet",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-bulls-pushing-30k/",
    "description": "Bitcoin price is surging above $30,000. BTC is up over 10% and it seems like the bulls are not done yet and might be aiming for a move to $32,000. Bitcoin is gaining pace above the $30,000 resistance. The price is trading above $29,500 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $30,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could rise further if it clears the $30,800 and $31,200 resistance levels. Bitcoin Price Extends Its Rally Bitcoin price started a major rally above the $28,500 resistance zone. BTC gained strength and was able to clear the key $29,200 resistance zone. It is up over 10% and there was a clear move above the $30,000 resistance. It traded close to $30,800. A high is formed near $30,794 and the price recently saw a minor downside correction. There was a move below the $30,500 level. The price dipped below the 23.6% Fib retracement level of the recent wave from the $28,660 swing low to the $30,794 high. Bitcoin price is now trading above $29,500 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $30,250 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com It is again rising and trading above the $30,000 level. On the upside, the price is facing resistance near the $30,300 level. The next major resistance is near the $30,800 level. An upside break above the $30,800 resistance could start a fresh increase toward the $31,200 level. The next major resistance is near the $32,000 level, above which the bulls might send BTC toward the $32,500 resistance zone. Dips Present Buying Opportunity in BTC? If Bitcoin’s price fails to clear the $30,800 resistance, it could start a downside correction. Immediate support on the downside is near the $30,250 level and the trend line. The next major support is near the $29,750 level or the 50% Fib retracement level of the recent wave from the $28,660 swing low to the $30,794 high. The main support is now near $29,000, below which the price might drop toward the $28,500 support. Any more losses might send the price toward $27,500 in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is in the overbought zone. Major Support Levels – $30,200, followed by $29,750. Major Resistance Levels – $30,300, $30,800, and $31,200."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-22T03:08:16.000Z",
    "title": "Nearly 20 Countries Eyeing BRICS Membership, Some Even ‘Begging’ To Join: Russian Deputy Minister",
    "url": "https://dailyhodl.com/2023/06/21/nearly-20-countries-eyeing-brics-membership-some-even-begging-to-join-russias-deputy-minister/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/20-Countries-Eyeing-BRICS.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Senior Russian diplomat Sergey Ryabkov says the line to get into BRICS is getting more and more competitive. According to a report from Tass, a publication owned by the Russian government, Ryabkov says that nearly 20 countries are currently waiting to get into BRICS, the economic coalition currently made up of Brazil, Russia, India, China [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/nearly-20-countries-eyeing-brics-membership-some-even-begging-to-join-russias-deputy-minister/\">Nearly 20 Countries Eyeing BRICS Membership, Some Even ‘Begging’ To Join: Russian Deputy Minister</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]