[
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T05:52:00.000Z",
    "title": "Spot Bitcoin ETF hype reignited zest for blockchain games: Yat Siu",
    "url": "http://cointelegraph.com/news/spot-bitcoin-etf-hype-blockchain-games-yat-siu",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/71c27364-e22a-4e40-b400-e5d37a4f84cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Animoca Brands founder and CEO says spot Bitcoin ETF enthusiasm has directly correlated to increased confidence and activity in GameFi.</p>\n                    <p><p>Enthusiasm surrounding a possible spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange traded fund (ETF) isn’t just driving up the price of Bitcoin — it's also sparked a resurgence of enthusiasm for blockchain games, says Animoca Brands founder Yat Siu. </p><p>Speaking to Cointelegraph at Hong Kong Fintech Week, Siu said the price increases of many cryptocurrencies reignited investor confidence in the Web3 gaming market as well as sparking a fresh wave of related on-chain activity. </p><blockquote>“Token values are a way of confidence building in terms of users and utility. It's not for the purpose of just having money, but it's also to feel confident about what you own.”</blockquote><p>\"If an industry or a country isn’t growing, despite the fact that prices might be high, then people can lose confidence,’ Siu said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Busy <a href=\"https://twitter.com/animocabrands?ref_src=twsrc%5Etfw\">@animocabrands</a> fam &amp; frens booth including <a href=\"https://twitter.com/TheSandboxGame?ref_src=twsrc%5Etfw\">@TheSandboxGame</a> <a href=\"https://twitter.com/MocaverseNFT?ref_src=twsrc%5Etfw\">@MocaverseNFT</a> <a href=\"https://twitter.com/WreckLeagueHQ?ref_src=twsrc%5Etfw\">@WreckLeagueHQ</a> <a href=\"https://twitter.com/the_phantom_g?ref_src=twsrc%5Etfw\">@the_phantom_g</a> <a href=\"https://twitter.com/AnichessGame?ref_src=twsrc%5Etfw\">@AnichessGame</a> and more at  <a href=\"https://twitter.com/hashtag/HKFintechWeek2023?src=hash&amp;ref_src=twsrc%5Etfw\">#HKFintechWeek2023</a>  Hong Kong is clearly determined to becoming the <a href=\"https://twitter.com/hashtag/web3?src=hash&amp;ref_src=twsrc%5Etfw\">#web3</a> hub! <a href=\"https://t.co/6spuYH7Jhy\">pic.twitter.com/6spuYH7Jhy</a></p>&mdash; Yat Siu (@ysiu) <a href=\"https://twitter.com/ysiu/status/1720492897131491780?ref_src=twsrc%5Etfw\">November 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It can be difficult to boil investor confidence down to a single metric, however Siu explained the key indicators of growth and conviction in the GameFi sector can be best measured by looking closely at on-chain activity.</p><p>Rather than looking <a href=\"https://cointelegraph.com/magazine/immutable-random-games-2-3b-invested-web3-games-upland-ethereum-guild-guardians-review/\">solely at the price of a projects’ token</a> to gauge its success, Siu says that investors need to take a variety of factors into account — much like how one would look at the different inputs in a country’s economy.</p><p>“It's not necessarily just the price of one particular thing. It's the whole economic parcel,” he added. </p><p>The data supports Siu’s comments. Over the last month, the most played blockchain-based game in Animoca's roster, Axie Infinity, witnessed a 50% increase in transaction activity and a 14% jump in trading volume, according to DappRadar <a href=\"https://dappradar.com/dapp/axie-infinity\" target=\"_blank\" rel=\"noopener nofollow\">data</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/bdfec869-04c7-480d-9547-a9d4fa5a38b3.png\"  /><figcaption style=\"text-align: center;\"><em>Axie Infinity transaction activity has increased steadily since its yearly low on July 2. Source: DappRadar</em></figcaption></figure><p>Siu believes the entire crypto ecosystem is still fundamentally reliant on the growth of Bitcoin for its overall success despite many crypto industry players imagining their <a href=\"https://cointelegraph.com/news/web3-industry-products-blockchain-adoption\">offerings as unique and separate</a> from the rest of the market.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/web3-gaming-investors-more-discerning-animoca-robby-yung\"><strong><em>Web3 gaming investors more ‘choosy’ in crypto winter — Animoca’s Robby Yung</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/web3-gaming-investors-more-discerning-animoca-robby-yung\"><strong><em></em></strong></a>“We're still in a gold standard financial ecosystem where Bitcoin is the reserve currency of Web3. How Bitcoin is used, how it's stored and who owns it, actually underpins a lot of the value in the crypto ecosystem,” he said. </p><p>Siu is confident an approval of a spot Bitcoin ETF product will be an <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\">incredible boon for the industry as a whole</a> and add legitimacy to the sector while inviting a slew of new investment from traditional financial institutions.</p><p>Siu predicted the crypto sector will eventually outgrow its reliance on Bitcoin as the de-facto reverse asset in the same way the international economy shed its dependence on the gold-standard.</p><p>“As populations and economies grow, we need different systems that are more natural and efficient. To me, this is where we’re headed. But we're still talking about a very small population of the world that is involved in Web3, despite it being over $1 trillion in size.”</p><blockquote>“It’s just a matter of maturity in the market.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]