[
  {
    "source": "Decrypt",
    "date": "2023-10-16T16:59:51.000Z",
    "title": "OnePiece Labs and Sei to Showcase Web3 Startups at Demo Day",
    "url": "https://decrypt.co/201851/onepiece-labs-and-sei-to-showcase-web3-startups-at-demo-day",
    "description": "The event will spotlight 11 startups from the partnership’s incubator program, including GameFi, SocialFi, and AI+Web3 firms."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-16T16:47:39.000Z",
    "title": "Looking to the Future: Artist Sougwen Chung on Collaborating With AI and Machines",
    "url": "https://decrypt.co/201783/looking-future-artist-sougwen-chung-collaborating-ai-machines",
    "description": "An exhibition of artist Sougwen Chung's pioneering works, co-created with the use of AI and robots, has just opened in London. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-16T16:57:20.000Z",
    "title": "Binance halts onboarding of new UK users",
    "url": "https://cointelegraph.com/news/binance-halts-new-uk-user-onboarding",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f628edad-43d1-4386-83ad-d841486c39c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The move comes after the Financial Conduct Authority imposed restrictions on its U.K. partner REBS. </p>\n                    <p><p>Crypto exchange Binance will stop accepting users in the United Kingdom as of 5 p.m. local time on Oct. 16.</p><p>According to Binance's <a href=\"https://www.binance.com/en-GB/blog/all/update-on-binance-for-uk-users-937596818854026589\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the move came after the country's Financial Conduct Authority (FCA) imposed legally binding requirements on its partner Rebuildingsociety.com Ltd (REBS) on Oct. 10. Among other items, the ruling prohibited REBS from ad promotions soliciting Binance goods and services. The exchange wrote:</p><blockquote>\"Binance is currently looking for a new FCA authorised approver. However, there will be some temporary restrictions coming into effect on our Platform (i.e. www.binance.com/en-GB and latest version of our Mobile App) during the period until Binance onboards with a new FCA authorised approver and has its financial promotions reapproved.\"</blockquote><p>Existing Binance users in the U.K. will retain their services. However, the exchange clarified that \"any new products and services will not be made available during this interim period.\" Various products such as gift cards, Binance Academy, Binance Research, Binance Feed, and Referral Bonus available on the Binance international platform are currently unavailable on its U.K. platform.</p><p>Cointelegraph previously reported that the FCA began <a href=\"https://cointelegraph.com/news/binance-uk-partner-restricted-crypto-ads\">enforcing a series</a> of new crypto marketing rules requiring exchanges to \"market to U.K. consumers clearly, fairly and honestly, and must also provide risk warnings people understand.\" The ruling, at the time, also allowed FCA-registered entities to market products and services on behalf of overseas firms not registered with the FCA. Binance planned to use REBS to allow its U.K. users to view the exchange's products and services through a localized domain, as the exchange is not registered with the FCA.</p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/sbf-bribe-binance-account-freeze-huobi-hacker/\">SBF’s alleged Chinese bribe, Binance clarifies account freeze</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T16:48:53.000Z",
    "title": "Crypto Scams Decline in Ireland as Fraudsters Shift Focus",
    "url": "https://www.cryptopolitan.com/crypto-scams-decline-in-ireland/",
    "description": "In a surprising turn of events, fraudsters in Ireland have shifted their focus away from targeting cryptocurrency investors amid a two-year-long bear market. Instead, they have honed in on traditional banking customers, resulting in substantial financial losses. This shift comes as the cryptocurrency market experiences a decline in scams, largely retaining committed investors who prioritize ... <a title=\"Crypto Scams Decline in Ireland as Fraudsters Shift Focus\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-scams-decline-in-ireland/\" aria-label=\"More on Crypto Scams Decline in Ireland as Fraudsters Shift Focus\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-16T17:07:43.000Z",
    "title": "FTX bankruptcy estate stakes crypto assets in Solana and Ethereum",
    "url": "https://crypto.news/ftx-bankruptcy-estate-stakes-crypto-assets-in-solana-and-ethereum/",
    "description": "The FTX bankruptcy estate recently staked approximately $122 million in SOL tokens and around $5 million in ETH."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T17:00:36.000Z",
    "title": "Tether Freezes 32 Crypto Addresses Linked To Terrorism In Israel And Ukraine",
    "url": "https://www.newsbtc.com/news/tether-freezes-32-crypto-addresses-linked-to-terrorism-in-israel-and-ukraine/",
    "description": "Tether, the world&#8217;s largest stablecoin company, has reaffirmed its commitment to combating cryptocurrency-funded terrorism and warfare by collaborating with law enforcement agencies worldwide.  The company has frozen 32 addresses containing $873,118.34, allegedly linked to illicit activities in Israel and Ukraine.  Tether Collaborates With Global Law Enforcement According to a blog post on October 16, Tether has played a significant role in assisting 31 law enforcement agencies across 19 jurisdictions, freezing $835 million in assets primarily associated with thefts from blockchain and exchange hacks.  Related Reading: Bitcoin Price Surges 7% In 10 Minutes On Fake iShares ETF News The company&#8217;s collaborations span various countries, including Brazil, Singapore, Germany, Canada, Argentina, China, Ukraine, and the United States. By actively engaging with authorities, Tether aims to contribute to the fight against cybercrime and ensure stolen funds are returned to legitimate users. The company further stated:  Of this, Tether has frozen 32 addresses, containing $873,118.34, that were found to be linked to illicit activity in Israel and Ukraine. Tether has been working with the NBCTF in Israel to counter cryptocurrency-funded terrorism and warfare. The ability of Tether to freeze and return illicitly obtained funds highlights the traceability and transparency of blockchain transactions. Contrary to common misconceptions, cryptocurrency transactions are not anonymous; they are meticulously recorded on the blockchain, allowing for the tracking and tracing of fund movements.  CEO Stresses Traceability The recently announced CEO of Tether, Paolo Ardoino, emphasized that criminals using cryptocurrencies for illegal activities will inevitably be identified. Ardoino stated:  Tether remains committed to promoting responsible blockchain technology use and standing as a robust defense against cybercrime. We eagerly anticipate continued collaboration with global law enforcement agencies as part of our commitment to global security and financial integrity. While Tether&#8217;s actions demonstrate the industry&#8217;s capacity to combat criminal use effectively, some critics within the blockchain industry continue to scrutinize the crypto sector, often neglecting to address the slow or inadequately equipped traditional financial system&#8217;s role in combating criminal funding.  On this matter, Tether&#8217;s CEO emphasized the importance of recognizing the traceability and trackability of blockchain transactions, which serve as potent deterrents to illicit activities. Related Reading: Crypto Shorts See Carnage As Bitcoin Surges Towards $28,000 As the stablecoin company behind USDT continues to collaborate with law enforcement agencies globally, the company&#8217;s efforts highlight the potential of blockchain technology to enhance financial security and integrity.  The traceability of transactions provided by blockchain technologies offers a robust defense against cybercrime and illicit financial activities. As the fight against cybercrime intensifies, continued collaboration between cryptocurrency companies and law enforcement agencies will play a crucial role in ensuring the integrity and stability of the digital asset space. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T16:52:27.000Z",
    "title": "Bitcoin Bulls Roar: $28K Looms as ETF Approval Excitement Builds",
    "url": "https://www.crypto-news-flash.com/bitcoin-bulls-roar-28k-looms-as-etf-approval-excitement-builds/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-bulls-roar-28k-looms-as-etf-approval-excitement-builds",
    "description": "<img width=\"1000\" height=\"647\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin ETF\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-300x194.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-768x497.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Bitcoin made a 4.8 percent surge in the last 24 hours to trade at $28k as spot Bitcoin ETF excitement builds.  Several industry experts have admitted that a spot Bitcoin ETF approval is imminent after the SEC decided against an appeal in the Grayscale case.  The crypto market is all green today with Bitcoin and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-16T16:55:07.000Z",
    "title": "Apple’s App Store Briefly Removes Crypto Wallet MetaMask, Coinbase CEO Says Antitrust Action May Be Needed",
    "url": "https://dailyhodl.com/2023/10/16/apples-app-store-briefly-removes-crypto-wallet-metamask-coinbase-ceo-says-antitrust-action-may-be-needed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/metamask-new-user-ramp.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Apple temporarily removed the crypto wallet MetaMask from its App Store, prompting Coinbase CEO Brian Armstrong to suggest filing an antitrust action against the Silicon Valley giant. MetaMask said it was aware that Apple users were not able to download its app, but that the issue wasn&#8217;t related to anything malicious. The company also warned [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/16/apples-app-store-briefly-removes-crypto-wallet-metamask-coinbase-ceo-says-antitrust-action-may-be-needed/\">Apple’s App Store Briefly Removes Crypto Wallet MetaMask, Coinbase CEO Says Antitrust Action May Be Needed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]