[
  {
    "source": "NewsBTC",
    "date": "2024-02-14T04:00:11.000Z",
    "title": "Zcash To Enhance User Protection With Privacy-Focused Partnership",
    "url": "https://www.newsbtc.com/analysis/zec/zcash-to-enhance-user-protection-with-privacy-focused-partnership/",
    "description": "A partnership between privacy-focused projects Nym and Zcash was recently announced. The partnership aims to address some persisting issues in the sector to enhance user protection and data privacy in the Zcash ecosystem. Related Reading: New Milestone For Google And MultiversX, Partners Launch New Data Integration Data Leakage, A Challenging Issue Electric Coin Company (ECC), the Zcash development organization, is collaborating with Nym, a privacy blockchain project focused on enhancing data confidentiality. The collaboration is possible through a Zcash Community Grants (ZCG) grant, as the project’s team announced on its X (former Twitter) account. The partnership aims to address challenging user protection issues by integrating Nym’s mixnet into the Zcash ecosystem. Integrating with the Zcash light client libraries would allow the wallet developers to implement Nym mixnet’s privacy protection at their discretion. The goal, as the announcement explains, is for the integration process of Nym and Zcash to fill the gap in the network layer.  This gap allows the metadata of user’s transactions to be traceable and leaves the data vulnerable, which then presents a privacy problem for users, as the post explains: Powerful adversaries can analyze traffic patterns such as the stream of TCP/IP packets used to submit transactions, which can then be used to de-anonymize users. ISPs can snoop on traffic patterns to passively record Zcash activity. And the growing crypto surveillance industry can passively spy on peer-to-peer traffic, as well as conduct active attacks. Nym will work with Zcash’s already existing privacy-preserving infrastructure to “help provide an end-to-end protected solution for users’ privacy. Zcash uses zero-knowledge proofs to secure transaction privacy, but “even advanced privacy protections like Zcash’s auto-shielding feature are vulnerable at the network later.” The Nym mixnet is a technology that prevents government, corporate, and criminal surveillance adversaries from tracing metadata by encrypting user data into sphinx packets and dispersing them across global ‘mix nodes’, making metadata patterns untraceable and ensuring online privacy: The mixnet achieves this by splitting data into identically sized encrypted Sphinx packets and dispersing these in three hops to ‘mix nodes’ worldwide at randomized intervals. Next, the mixnet shuffles in dummy ‘cover’ traffic, further complicating tracing. Together these features make tracking metadata patterns impossible even for powerful adversaries with a global view of the network. A Shared Vision: Privacy For Everyone Nym and Zcash are privacy-focused projects that protect users’ rights to their personal information and transaction data. “It is an alienable right to a dignified life free from gross intrusion and interference,” said Harry Halpin, cofounder and CEO at Nym Technologies. Halpin also commented on the state of the digital realm regarding privacy matters. The CEO believes that although intrusion and interference are the “normal state of affairs,” a change is needed. “With this groundbreaking integration, Nym and Zcash are working to make real privacy online a reality,” he concluded. Josh Swihart, CEO of ECC, expressed his positive outlook on the partnership, reaffirming that network-level privacy has been a “missing piece since Zcash’s inception.” He believes that privacy ecosystems coming together will only “deepen protections from everyday users to protect their financial privacy.” Global regulators have scrutinized privacy-focused projects and accused them of enabling criminal activity. Last year, Zcash (ZEC), alongside other privacy coins like Monero (XMR), was announced to be delisted from Binance, the largest crypto exchange in the world, in four European countries. Similarly, Binance recently announced its plan to delist Moreno in the US amid regulatory pressure. Related Reading: What Is Monero (XMR) Network? ZEC is trading at $20.71 in the hourly chart. Source: ZECUSDT on tradingview.com Feature image from Unsplash.com, Chart from TradingView.com"
  }
]