[
  {
    "source": "Decrypt",
    "date": "2023-09-20T18:59:51.000Z",
    "title": "AI Music Streaming Service Launching—Will People Pay?",
    "url": "https://decrypt.co/197995/ai-music-streaming-service-launching-people-pay-musixy",
    "description": "Musixy.ai also takes requests and sells the rights to unofficial takes on hit singles, but it's entering a divisive and legally thorny space."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T19:00:00.000Z",
    "title": "Meta launches metaverse game, Bitcoin Ordinals creator proposes numbering change: Nifty Newsletter",
    "url": "https://cointelegraph.com/news/meta-launches-metaverse-game-bitcoin-ordinals-creator-proposes-numbering-change-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cb730c7d-d4f1-49bc-9edf-722b9893e141.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Meta has rolled out early access for Horizon Worlds on web browsers and mobile devices. </p>\n                    <p><p>In this week’s newsletter, read about how marketplace Magic Eden integrated compressed <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> into its platform and how Meta launched its metaverse game on mobile and web. Check out why the Bitcoin Ordinals creator proposes changing the protocol’s numbering system and learn about Atari founder Nolan Bushnell’s perspectives on play-to-earn gaming. In other news, the United States Securities and Exchange Commission (SEC) has charged NFT collection Stoner Cats with offering unregistered securities. </p><h2>Meta’s Horizon Worlds launches on mobile and web in early access</h2><p>Meta has announced it has started rolling out Horizon Worlds on mobile devices and web browsers. The launch to mobile and web includes a free-for-all shooter game called Super Rumble, where two to six players can play together in fast-paced shooting matches. </p><p>The launch is only in early access, meaning only a few people can join. According to Meta, it will slowly roll the game out to more people and add more experiences and worlds to the metaverse in the near future.</p><p><a href=\"https://cointelegraph.com/news/meta-horizon-worlds-launch-mobile-web-early-access\"><strong>Continue reading</strong></a></p><h2>Bitcoin Ordinals creator proposes to change inscription numbering system</h2><p>Bitcoin Ordinals chief coder and creator Casey Rodarmor proposed to change the numbering system of Bitcoin NFTs. The coder highlighted that the current system has led to “ugly code and stalled development.” </p><p>Because of this, Rodarmor initiated a proposal to make inscriptions permanently unstable, making the protocol simpler and easier to upgrade. The Ordinals creator added that while the change may make the numbers inaccurate, the numbering system will not be scrapped entirely. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-creator-proposes-inscription-numbering-changes\"><strong>Continue reading</strong></a></p><h2>Magic Eden integrates Solana’s compressed NFTs into marketplace</h2><p>NFT marketplace Magic Eden has integrated compressed NFTs (cNFTs) by Solana into its platform. According to Magic Eden, cNFTs will allow users to experiment without spending too much money and are ideal for mass-produced NFTs for industries like music, gaming and events. </p><p>cNFTs are different from standard NFTs, as their data is stored off-chain. Because of this, users can mint as many as one million NFTs for just around $110. </p><p><a href=\"https://cointelegraph.com/news/magic-eden-integrates-solana-compressed-nfts-into-marketplace\"><strong>Continue reading</strong></a></p><h2>Play-to-earn games are the reason “real” gamers hate crypto: Atari founder</h2><p>Nolan Bushnell, the founder of Atari, a video game company that peaked in popularity in the 1980s, recently spoke with Cointelegraph and expressed that play-to-earn (P2E) games are the reason why “real” gamers dislike crypto. </p><p>The executive claimed that “good gamers” don’t like to grind and said that Web3 gaming needs to move away from P2E and focus on building worlds powered by virtual reality and augmented reality. </p><p><a href=\"https://cointelegraph.com/news/play-to-earn-why-gamers-hate-crypto-atari-founder\"><strong>Continue reading</strong></a></p><h2>Stoner Cats NFTs are “fan crowdfunding,” not securities — SEC’s Peirce, Uyeda</h2><p>The SEC has charged the company behind the NFT collection Stoner Cats with offering unregistered securities. According to the SEC, the NFTs were marketed as having potential for secondary sales and implied that the value would rise. </p><p>However, not everyone in the SEC agrees with the action. SEC commissioners Hester Pierce and Mark Uyeda published a dissenting statement, arguing that the project’s activity constitutes fan crowdfunding, which they believe is a common occurrence in the world of creators. </p><p><a href=\"https://cointelegraph.com/news/stoner-cats-nfts-fan-crowdfunding-not-securities-sec-s-peirce-and-uyeda\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"Bitcoin Ordinals, Meta, Metaverse\"  title=\"Meta launches metaverse game, Bitcoin Ordinals creator proposes numbering change: Nifty Newsletter\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T18:50:40.000Z",
    "title": "Bitcoin price tests $27K support as Fed holds interest rates at FOMC",
    "url": "https://cointelegraph.com/news/bitcoin-price-27k-fed-holds-interest-rates-fomc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c9ba77a9-943f-4093-8cd1-022d2789c30f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin weathers the Fed's decision to keep rates at their previous levels, while Chair Jerome Powell reveals the potential for another hike to come this year.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) saw snap volatility on Sep. 20 as the United States Federal Reserve maintained interest rates at twenty-year highs.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8ff4dd53-f074-42dd-9fb2-4e73f86e801c.png\"></figure><h2>BTC price digests Fed rate pause</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> followed BTC price action as it reacted to the rate decision and accompanying commentary from Fed Chair Jerome Powell.</p><p>The Federal Open Market Committee (FOMC) opted to keep rates at their previous levels set in July this year.</p><p>“The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run,” a <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/monetary20230920a.htm\" target=\"_blank\" rel=\"noopener nofollow\">press release</a> stated.</p><blockquote>“In support of these goals, the Committee decided to maintain the target range for the federal funds rate at 5-1/4 to 5-1/2 percent.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5e02dc8c-aa4f-40b3-9625-ecde859165b6.png\"><figcaption style=\"text-align: center;\"><em>Fed funds rate chart. Source: St. Louis Fed</em></figcaption></figure><p>The move was <a href=\"https://cointelegraph.com/news/bitcoin-analysis-predicts-spicy-btc-price-fomc-27k\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-analysis-predicts-spicy-btc-price-fomc-27k/amp\">overwhelmingly expected</a> ahead of time by markets, with a 99% probability of a rate hike pause already in place, per data from CME Group’s FedWatch Tool.</p><p>The Fed’s language remained cautious over the future of inflation, however, with no guarantee that conditions would become more lax.</p><p>“In assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook. The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee's goals,” the release continued.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SUMMARY OF FED DECISION (9/20/23):<br><br>1. Fed PAUSES rate hikes leaving rates unchanged<br><br>2. 12 Fed officials see 1 more rate hike<br><br>3. 7 Fed officials see no more rate hikes<br><br>4. Fed sees rates higher for longer<br><br>5. Fed sees inflation at 2.6% in 2024<br><br>Is the Fed pause finally here?</p>— The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1704556890997371133?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Reacting, Michaël van de Poppe, founder and CEO of trading firm Eight, suggested that no more rate hikes would come in future. Bitcoin, he predicted, would benefit.</p><p>“No rate hike from the FED. My best guess: we're done with the hiking policy,” part of an <a href=\"https://twitter.com/CryptoMichNL/status/1704556451497161212\" target=\"_blank\" rel=\"noopener nofollow\">X post</a> read. </p><blockquote>“Bitcoin is likely to start trending up from here (yes, a fakeout usually happens at the news).”</blockquote><h2>Powell hints that another rate hike could come in 2023</h2><p>BTC price action saw jitters as the decision came, with Powell still to complete his speech at the subsequent <a href=\"https://www.federalreserve.gov/newsevents.htm\" target=\"_blank\" rel=\"noopener nofollow\">press conference</a> at the time of writing.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-prediction-all-time-high-precede-2024-halving\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-prediction-all-time-high-precede-2024-halving/amp\">Bitcoin price all-time high will precede 2024 halving — New prediction</a></em></strong></p><p>The road to getting inflation down to the Fed's 2% target, he said, had \"a long way to go.\"</p><p>\"If the economy evolves as projected, the median participants projects that the appropriate level of the federal funds rate will be 5.6% at the end of this year, 5.1% at the end of 2024 and 3.9% at the end of 2025,\" he said.</p><p>Powell noted that the medium projection for the end of the year was unchanged from before, but had moved up 0.5% for the end of the next two years.</p><p>BTC/USD continued to hold above $27,000 as a result, with no major exit of the recent intraday trading range.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T19:00:44.000Z",
    "title": "Sleeping Bitcoin giants stir, moving huge amounts of dormant coins and unsettling market landscape",
    "url": "https://cryptoslate.com/insights/sleeping-bitcoin-giants-stir-moving-huge-amounts-of-dormant-coins-and-unsettling-market-landscape/",
    "description": "<p>Quick Take An examination of Bitcoin&#8217;s revived supply, the total number of coins re-entering circulation after remaining dormant for a minimum of 1 year, reveals significant activity. In a single day, a staggering 40k Bitcoin were shifted out of long-term holder wallets, marking the highest level of movement since July and the second largest of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/sleeping-bitcoin-giants-stir-moving-huge-amounts-of-dormant-coins-and-unsettling-market-landscape/\">Sleeping Bitcoin giants stir, moving huge amounts of dormant coins and unsettling market landscape</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T19:00:26.000Z",
    "title": "Chainlink: Analyst’s Vision Of A 20% Rally And How It Could Happen",
    "url": "https://www.newsbtc.com/all/chainlink-analysts-vision-of-a-20-rally-and-how-it-could-happen/",
    "description": "Chainlink (LINK) has caught the attention of crypto analyst Rekt Capital, who has offered an optimistic outlook for LINK. In a new price prediction, he suggested that the decentralized oracle network is on the verge of a significant recovery. Rekt Capital, a prominent figure in the crypto community, took to the social media platform X to share insights on Chainlink&#8217;s recent performance. According to the analyst, LINK has shown resilience by respecting its range-high resistance, a crucial milestone following its notable surge in price back in July. This achievement has ignited hopes of a sustained upward trajectory. Despite its promising trajectory, LINK has experienced some fluctuations in recent weeks. The cryptocurrency dropped to a recent low of $5.76, a level that Rekt Capital points out as being close to the asset&#8217;s range-low support.  Related Reading: Halving Hype: Bitcoin Gearing Up For A Parabolic Ride, Analyst Says However, Chainlink seems to be regaining its footing, with its current price sitting at $6.81 according to CoinGecko, marking a 1.2% increase in the last 24 hours and an impressive seven-day rally of 15.5%. These positive indicators have fueled anticipation within the crypto community. $LINK has rejected from its Range High resistance Price is down -13% since then But if #LINK were to drop into the Range Low support&#8230; Price would need to drop an additional -20% to the downside#Crypto #Chainlink pic.twitter.com/GS3C2IYeiw — Rekt Capital (@rektcapital) August 4, 2023 A Bullish Prediction For Chainlink Rekt Capital&#8217;s analysis doesn&#8217;t stop at the current price trends. The crypto analyst predicts that Chainlink &#8220;should be able to revisit the range-high resistance,&#8221; which is situated at around $8.186. If this prediction holds true, it would represent an additional 20.5% increase from the current price, promising further gains for LINK holders. This price surge coincides with a notable uptick in Chainlink&#8217;s Relative Strength Index (RSI), which, as of the latest analysis, stands above 60. An RSI above 60 indicates a robust bullish trend in the market.  Moreover, Chainlink&#8217;s price has climbed above the short-term Moving Average, previously acting as a resistance level. It is also approaching a position where it may surpass the long-term Moving Average, signaling potential for sustained upward movement. Chainlink (LINK) is currently trading at $6.81. Chart: TradingView.com Mysterious Wallet Activity Intriguingly, recent wallet activity has garnered significant attention in the Chainlink ecosystem. Data from Lookonchain reveals that over 35 new LINK addresses were established just three days ago. These newly created addresses have started withdrawing LINK tokens from Binance (BNB), with a cumulative withdrawal exceeding 755,000 LINK tokens, valued at over $5 million. We noticed that ~35 fresh wallets created 3 days ago started withdrawing $LINK from #Binance today. And have withdrawn a total of 755,687 $LINK ($5.08M) so far. Are there whales accumulating $LINK? pic.twitter.com/IYte19TmTE — Lookonchain (@lookonchain) September 19, 2023 Related Reading: BNB Trading Sideways In Last 30 Days – Is Stagnation Likely Until October? The motive behind these substantial withdrawals remains undisclosed as of now, leaving room for speculation within the crypto community. Some analysts suggest that this activity might indicate a significant accumulation move by a whale investor, potentially adding another layer of intrigue to Chainlink&#8217;s evolving narrative. As Chainlink continues to make strides in the crypto space, investors and enthusiasts will undoubtedly be closely monitoring its progress, hoping that Rekt Capital&#8217;s bullish predictions come to fruition. In the ever-volatile world of cryptocurrencies, the only certainty is that surprises are never far behind. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Vecteezy"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T18:52:00.000Z",
    "title": "Exercise Caution When Using Decentralized Exchanges: Binance CEO",
    "url": "https://coinedition.com/exercise-caution-when-using-decentralized-exchanges-binance-ceo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Exercise Caution When Using Decentralized Exchanges: Binance CEO\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/2.-httpstwitter.comcz_binancestatus1591974155783909377-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In light of the recent attack on Balancer, an Ethereum-based decentralized finance protocol, Binance’s CEO Changpeng Zhao shared that people should exercise caution when using decentralized exchanges (DEX). Balancer shared on X (formerly Twitter) that its front end is under attack and is currently under investigation. Moreover, they added that users shouldn’t interact with the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/exercise-caution-when-using-decentralized-exchanges-binance-ceo/\">Exercise Caution When Using Decentralized Exchanges: Binance CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-20T18:45:38.000Z",
    "title": "SEC Suffers Blow in Lawsuit Against Binance.US After Judge Denied Request To Probe Exchange’s Software: Report",
    "url": "https://dailyhodl.com/2023/09/20/sec-suffers-blow-in-lawsuit-against-binance-us-after-judge-denied-request-to-probe-exchanges-software-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A US federal magistrate judge is reportedly choosing not to grant the U.S. Securities and Exchange Commission (SEC) permission to inspect the technological infrastructure of Binance&#8217;s American affiliate, a setback for the regulator. A new report from Bloomberg indicates the SEC asked Magistrate Judge Zia M. Faruqui on Monday for permission to search through Binance.US&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/sec-suffers-blow-in-lawsuit-against-binance-us-after-judge-denied-request-to-probe-exchanges-software-report/\">SEC Suffers Blow in Lawsuit Against Binance.US After Judge Denied Request To Probe Exchange’s Software: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-20T18:41:10.000Z",
    "title": "Former Deutsche Bank Executive Faces 30 Years in Prison for Crypto Fraud: DOJ",
    "url": "https://dailyhodl.com/2023/09/20/former-deutsche-bank-executive-faces-30-years-in-prison-for-crypto-frauddoj/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/doj-two-aiding.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A former executive of German financial giant Deutsche Bank has been handed a 30-year prison sentence for his role in a crypto fraud scheme. In a new press release, the U.S. Department of Justice (DOJ) says that ex-investment banker and registered broker Rashawn Russell has pleaded guilty to charges of perpetrating a crypto fraud scheme [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/former-deutsche-bank-executive-faces-30-years-in-prison-for-crypto-frauddoj/\">Former Deutsche Bank Executive Faces 30 Years in Prison for Crypto Fraud: DOJ</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]