[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T13:44:04.000Z",
    "title": "Crypto Hacks and Exploits Cost Traders $303M in July; Worst Month of 2023",
    "url": "https://www.coindesk.com/markets/2023/07/31/crypto-hacks-and-exploits-cost-traders-303m-in-july-worst-month-of-2023/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Some $52 million of assets were siphoned from Curve Finance just this weekend."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T13:41:35.000Z",
    "title": "Celo Proposal to Migrate to Ethereum Layer 2 Passes",
    "url": "https://www.coindesk.com/tech/2023/07/31/celo-proposal-to-migrate-to-ethereum-layer-2-passes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The change seeks to simplify liquidity sharing between Celo and Ethereum while boosting security."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T13:55:35.000Z",
    "title": "Rug pull fears emerge after obscure meme coin surges 10,000% on Coinbase-backed Base network",
    "url": "https://cryptoslate.com/obscure-meme-coins-surge-10000-on-coinbase-backed-base-network/",
    "description": "<p>Over the weekend, meme coin mania returned with new fervor as it reached the Coinbase-backed Ethereum layer-2 network Base. On July 30, BALD, an obscure meme coin with no website, on the L2 solution gained wide attention after its value exploded by more than 10,000% on the decentralized exchange Leetswap to a peak of around $0.085, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/obscure-meme-coins-surge-10000-on-coinbase-backed-base-network/\">Rug pull fears emerge after obscure meme coin surges 10,000% on Coinbase-backed Base network</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T14:00:00.000Z",
    "title": "IoTeX blockchain DAO votes 94% in favor of simplifying IoTeX domain names",
    "url": "https://cryptodaily.co.uk/2023/07/iotex-blockchain-dao-votes-94-in-favor-of-simplifying-iotex-domain-names",
    "description": "<p>The IoTeX blockchain governance community voted 94% in favor staking 54 million IOTX tokens to push forward IIP-22 to simplify its domain names (INS), similar to Ethereum&rsquo;s ENS. The benefits of INS include human-readable names, increased security, improved accessibility, and resource identifiers.</p>\n<p>As stated by IoTeX in their blog announcing the IIP-22 voting period, &ldquo;Crypto addresses are frustratingly long, garbled strings like &ldquo;lswli4yuofd8a0s&rdquo; &ndash; a clunky mechanism that often leaves room for error when inputting. And as cryptocurrencies become mainstream, there will be a substantial market for Web3 addresses.&rdquo;</p>\n<p>Similarly to the ENS, INS allows users to register and manage human-readable domain names for their IoTeX addresses, smart contracts, decentralized websites, and other IoTeX-based resources.</p>\n<p>IoTeX&rsquo;s INS promotes mass adoption by discovering decentralized services and applications more manageable by providing human-readable domain names, making it easier to search and navigate the blockchain ecosystem.&nbsp;</p>\n<p>The INS also provides a unified namespace across multiple dApps and blockchain platforms, enabling using the same INS domain name for various services, eliminating the need to remember different addresses for different applications.</p>\n<p>Regarding decentralization and security, INS operates on the IoTeX blockchain, leveraging the decentralized nature of blockchain technology. That ensures that domain ownership and control are in the hands of the users themselves, reducing the risk of censorship or manipulation. And it can be integrated into popular wallets, exchanges, and decentralized applications, allowing seamless use of domain names across various platforms and services.</p>\n<p>Users are empowered with INS as it gives them ownership and control over their domain names and associated cryptocurrency addresses. Users can update or transfer their domains as needed, providing a sense of empowerment and autonomy.</p>\n<p>IoTeX&rsquo;s name service fosters a community-driven ecosystem where developers, organizations, and individuals can collaborate, build upon, and innovate, driving creativity and the development of new dApps and services.</p>\n<p>INS is yet another adaptation to simplify onboarding the masses to Web3 by IoTeX, leader of the Decentralized Physical Infrastructure Network (DePIN), the most significant trend in crypto that by 2028 will grow to over $3.5 trillion.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T14:07:57.000Z",
    "title": "Ethereum’s dormant ICO investor resurfaces with whopping $3.7 million ETH transfer",
    "url": "https://www.cryptopolitan.com/ethereums-dormant-ico-investor-resurfaces-with-whopping-3-7-million-eth-transfer/",
    "description": "Ethereum&#8217;s cryptocurrency community was taken aback by the unexpected return of its initial coin offering (ICO) participant after an eight-year absence. The investor, who had acquired a substantial $2,000ETH during the Genesis phase when the ICO price was just $0.31 per ETH, made headlines by transferring $641ETH, currently valued at a staggering $3.7 million in ... <a title=\"Ethereum&#8217;s dormant ICO investor resurfaces with whopping $3.7 million ETH transfer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereums-dormant-ico-investor-resurfaces-with-whopping-3-7-million-eth-transfer/\" aria-label=\"More on Ethereum&#8217;s dormant ICO investor resurfaces with whopping $3.7 million ETH transfer\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T13:54:43.000Z",
    "title": "EC Launches Antitrust Investigation into Microsoft’s Bundling of Teams with Office Suite",
    "url": "https://www.cryptopolitan.com/microsofts-bundling-teams-with-office-suite/",
    "description": "The European Commission (EC) has initiated a formal investigation into Microsoft&#8217;s business practices, specifically focusing on the bundling of its Teams application with its Office 365 and Microsoft 365 suites. The probe aims to determine whether Microsoft has breached European Union (EU) competition rules by potentially limiting competition in the European Economic Area (EEA) for ... <a title=\"EC Launches Antitrust Investigation into Microsoft&#8217;s Bundling of Teams with Office Suite\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsofts-bundling-teams-with-office-suite/\" aria-label=\"More on EC Launches Antitrust Investigation into Microsoft&#8217;s Bundling of Teams with Office Suite\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T13:47:31.000Z",
    "title": "Wales Expands NHS Use of AI for Cancer Diagnosis, Helps Prioritize Urgent Cases",
    "url": "https://www.cryptopolitan.com/ai-for-cancer-diagnosis-ibex-galen-platform/",
    "description": "In a move to revolutionize the healthcare sector, the Welsh Government has announced the expansion of artificial intelligence (AI)-a powered tool designed to detect cancer in biopsy samples. The decision follows a promising 13% increase in prostate cancer diagnosis during a pilot study. The AI platform known as IBEX Galen will now undergo further trials ... <a title=\"Wales Expands NHS Use of AI for Cancer Diagnosis, Helps Prioritize Urgent Cases\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-for-cancer-diagnosis-ibex-galen-platform/\" aria-label=\"More on Wales Expands NHS Use of AI for Cancer Diagnosis, Helps Prioritize Urgent Cases\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T13:40:16.000Z",
    "title": "Is Another Bitcoin Rally Coming Soon? This Pattern May Say So",
    "url": "https://www.newsbtc.com/bitcoin-news/is-another-bitcoin-rally-coming-soon-this-pattern-may-say-so/",
    "description": "On-chain data shows a pattern in the stablecoin shark and whale holdings that may suggest the Bitcoin rally could make a return in the near future. Stablecoin Sharks &#38; Whales Have Been Accumulating Recently According to data from the on-chain analytics firm Santiment, the sharks and whales of the major stablecoins have been increasing their reserves while Bitcoin has been struggling recently. The &#8220;sharks&#8221; and &#8220;whales&#8221; are two of the largest cohorts in the sector, with investors belonging to the former holding at least $100,000 and at most $1 million worth of the asset, while the latter has wallet balances in the $1 million to $10 million range. Due to such large holdings, these investors can potentially move around a large number of coins at once, something that can make them influential entities in the market. In the context of the current discussion, the sharks and whales of stablecoins are of interest. In particular, the four largest players in the market are of relevance here: Tether (USDT), USD Coin (USDC), Binance USD (BUSD), and Dai (DAI). Santiment has used its &#8220;Supply Distribution&#8221; metric to track the holdings of these humongous holders and this indicator tells us about the percentage of the supply that each group in the market is holding right now. Here is a chart that shows the trend in this metric specifically for the sharks and whales of the top 4 stablecoins in the sector: The metrics appear to have been going up in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the holdings of these stablecoin sharks and whales have been on the rise recently. Interestingly, while this trend has formed, the price of Bitcoin has dipped below the $30,000 level. A similar pattern in the supply held by these large investors had also formed last month, as these investors had been buying more stablecoins, while BTC had been on a decline. What followed this period of accumulation back then was a sharp Bitcoin rally that had taken the cryptocurrency&#8217;s price above the $30,000 level. An explanation of this curious trend may lie in what the holdings of these large stablecoin holders signify. Generally, these investors opt for stables whenever they want to exit volatile assets such as BTC. Related Reading: Stanford MBA Explains Why Next Bitcoin Cycle Could Be “Bigger” Such holders, however, usually only seek to temporarily take shelter in these dollar-tied tokens, because if they wanted to stay away from the sector for extended periods, they would have exited through other means like fiat. Thus, these investors would eventually shift their stablecoins into Bitcoin and others again, and with this exchange, provide a bullish boost to their prices. This is why the supply of these sharks and whales may be looked at as the available buying pressure that these humongous investors can put on the asset at any point they want. From the chart, it&#8217;s visible that the BTC rally above $30,000 didn&#8217;t actually kick off from new money being pumped back into the asset by the sharks and whales, but rather the conversions that they made back into the asset, as their holdings decreased while the rally happened. Related Reading: Bitcoin Miner Reserve Rising: Good News For BTC Bulls? As the large investors of the major stables have again been accumulating recently, it&#8217;s possible that Bitcoin could see a bullish effect from this down the road once more, although it&#8217;s uncertain how long it may be before these investors deploy their stablecoins back into the market. Bitcoin Price At the time of writing, Bitcoin is trading around $29,300, up 1% in the last week. BTC has stagnated since the decline &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  }
]