[
  {
    "source": "Decrypt",
    "date": "2023-07-21T20:52:27.000Z",
    "title": "Is Meta's ChatGPT Killer Really Open Source?",
    "url": "https://decrypt.co/149600/is-metas-chatgpt-killer-really-open-source",
    "description": "The Open Source Initiative told Meta’s Chief AI Scientist that the model they are promoting as Open Source is not really open source."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T21:00:00.000Z",
    "title": "AI21 Labs debuts anti-hallucination feature for GPT chatbots",
    "url": "https://cointelegraph.com/news/ai21-labs-debuts-anti-hallucination-feature-for-gpt-chatbots",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/40c14454-038a-45d1-b55d-8e70a6989d6c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Contextual Answers is designed for enterprise but could have far-reaching implications for the generative AI sector.</p>\n                    <p><p>AI21 Labs recently launched “Contextual Answers,” a question-answering engine for large language models (LLMs). </p><p>When connected to an LLM, the new engine allows users to upload their own data libraries in order to restrict the model’s outputs to specific information. </p><p>The launch of ChatGPT and similar artificial intelligence (AI) products has been paradigm-shifting for the AI industry, but a lack of trustworthiness makes adoption a difficult prospect for many businesses.</p><p>According to research, employees <a href=\"https://venturebeat.com/business/report-employees-spend-3-6-hours-each-day-searching-for-info-increasing-burnout/\" target=\"_blank\" rel=\"noopener nofollow\">spend</a> nearly half of their workdays searching for information. This presents a huge opportunity for chatbots capable of performing search functions; however, most chatbots aren’t geared toward enterprise. </p><p>AI21 developed Contextual Answers to address the gap between chatbots designed for general use and enterprise-level question-answering services by giving users the ability to pipeline their own data and document libraries.</p><p>According to a blog post from AI21, Contextual Answers <a href=\"https://www.ai21.com/blog/introducing-contextual-answers\" target=\"_blank\" rel=\"noopener nofollow\">allows</a> users to steer AI answers without retraining models, thus mitigating some of the biggest impediments to adoption:</p><blockquote>“Most businesses struggle to adopt [AI], citing cost, complexity and lack of the models’ specialization in their organizational data, leading to responses that are incorrect, ‘hallucinated’ or inappropriate for the context.”</blockquote><p>One of the outstanding challenges related to the development of useful LLMs, such as OpenAI’s ChatGPT or Google’s Bard, is teaching them to express a lack of confidence.</p><p>Typically, when a user queries a chatbot, it’ll output a response even if there isn’t enough information in its data set to give factual information. In these cases, rather than output a low-confidence answer such as “I don’t know,” LLMs will often make up information without any factual basis. </p><p>Researchers dub these outputs “hallucinations” because the machines generate information that seemingly doesn’t exist in their data sets, like humans who see things that aren’t really there.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We're excited to introduce Contextual Answers, an API solution where answers are based on organizational knowledge, leaving no room for AI hallucinations. <br><br>➡️ <a href=\"https://t.co/LqlyBz6TYZ\">https://t.co/LqlyBz6TYZ</a> <a href=\"https://t.co/uBrXrngXhW\">pic.twitter.com/uBrXrngXhW</a></p>— AI21 Labs (@AI21Labs) <a href=\"https://twitter.com/AI21Labs/status/1681659969517568001?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to A121, Contextual Answers should mitigate the hallucination problem entirely by either outputting information only when it’s relevant to user-provided documentation or outputting nothing at all. </p><p>In sectors where accuracy is more important than automation, such as finance and law, the onset of generative pretrained transformer (GPT) systems has had varying results. </p><p>Experts <a href=\"https://cointelegraph.com/news/can-ai-tools-like-chatgpt-replace-dedicated-crypto-trading-bots\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/can-ai-tools-like-chatgpt-replace-dedicated-crypto-trading-bots/amp\">continue to recommend caution</a> in finance when using GPT systems due to their tendency to hallucinate or conflate information, even when connected to the internet and capable of linking to sources. And in the legal sector, a lawyer now <a href=\"https://www.nytimes.com/2023/06/08/nyregion/lawyer-chatgpt-sanctions.html\" target=\"_blank\" rel=\"noopener nofollow\">faces</a> fines and sanctioning after relying on outputs generated by ChatGPT during a case.</p><p>By front-loading AI systems with relevant data and intervening before the system can hallucinate non-factual information, AI21 appears to have demonstrated a mitigation for the hallucination problem.</p><p>This could result in mass adoption, especially in the fintech arena, where traditional financial institutions have been <a href=\"https://fortune.com/2023/02/24/major-bank-banned-chatgpt/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://fortune-com.cdn.ampproject.org/c/s/fortune.com/2023/02/24/major-bank-banned-chatgpt/amp/\">reluctant</a> to embrace GPT tech, and the cryptocurrency and blockchain communities have had <a href=\"https://cointelegraph.com/news/crypto-trading-bot-borrows-200m-for-a-3-gain\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-trading-bot-borrows-200m-for-a-3-gain/amp\">mixed success at best</a> employing chatbots. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/openai-launches-custom-instructions-for-chatgpt-so-you-don-t-have-to-repeat-yourself-in-every-prompt\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/openai-launches-custom-instructions-for-chatgpt-so-you-don-t-have-to-repeat-yourself-in-every-prompt/amp\"><strong><em>OpenAI launches ‘custom instructions’ for ChatGPT so users don’t have to repeat themselves in every prompt</em></strong></a></p>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T20:57:31.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.47 USD with a 24-hour trading volume of $139,799,753 USD. Filecoin is up 2.18% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,954,773,159 USD. It has a circulating supply of ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T20:49:15.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T20:53:17.000Z",
    "title": "Polygon ID becomes available on Ethereum after partnership with Rarimo",
    "url": "https://crypto.news/polygon-id-becomes-available-on-ethereum-after-partnership-with-rarimo/",
    "description": "Interoperability protocol Rarimo has partnered with Polygon ID, enabling the use of its verifiable credential infrastructure across multiple blockchains. Rarimo, a tool that helps different blockchains talk to each other, has joined forces with Polygon ID, a system for checking&#8230;"
  }
]