[
  {
    "source": "NewsBTC",
    "date": "2023-11-15T04:00:43.000Z",
    "title": "Is Buying FTT Now A Once-In-A-Life Opportunity For FTX Believers?",
    "url": "https://www.newsbtc.com/ftx/is-buying-ftt-now-a-once-in-a-life-opportunity-for-ftx-believers/",
    "description": "FTT, the native token of the FTX ecosystem, rallied by 180% last week, emerging as one of the top performers. The rally, Kaiko, a blockchain analytics platform observes, was primarily due to comments by the stringent United States Securities and Exchange Commission (SEC) leader that the FTX 2.0 relaunch is possible.  FTT Soaring On Hopes Of FTX Relaunching In an X post on November 14, Kaiko also notes that related FTT trading volume soared, signaling possible accumulation by traders and believers of FTX. At spot rates, FTT trading volume, looking at how the token performs in Binance, one of the leading cryptocurrency exchanges, remains elevated at November 2022 levels.  In November 2022, FTX, led by Sam Bankman-Fried, filed for Chapter 11 bankruptcy protection at the United States Bankruptcy Court for the District of Delaware. Related Reading: BlackRock’s XRP ETF Filing, Everything You Need To Know Before this bankruptcy filing, FTT, which served several purposes in the FTX ecosystem, acting as a governance token and providing access, plunged in early November following allegations that the exchange had misappropriated user funds. There was a significant collapse on November 8 when FTT fell by 90%, taking the coin from around $22 to as low as $2. FTT is trading at around $3.22, up 232% from October 2023 lows, looking at the performance in the daily chart. As fundamental events around FTX unfold, FTT&#8217;s trading volume also rises. Compliance With The Law Is Crucial: SEC Chairperson There could be more gains for FTX in the days ahead should there be more solid news of an FTX 2.0 relaunch following Gary Gensler&#8217;s comments last week. Then, Gensler told CNBC that a revived FTX could see the light of day if only leaders taking over clearly understood existing laws.   Related Reading: Crypto.com Acquires License In Dubai As Cronos (CRO) Price Slips The SEC chairperson&#8217;s comments follow speculations that the former New York Stock Exchange (NYSE) president, Tom Farley, is among the three bidders planning to buy FTX.  &#8220;If Tom or anybody else wanted to be in this field, I would say, &#8216;Do it within the law. Build investors&#8217; trust in what you&#8217;re doing and ensure that you&#8217;re doing the proper disclosures — and also that you&#8217;re not commingling all these functions, trading against your customers. Or using their crypto assets for your purposes.&#8221;  A jury in early November found Sam Bankman-Fried, the former CEO of FTX, guilty of all criminal charges, including wiring fraud and money laundering. Bankman-Fried is set for sentencing in March 2024. Feature image from Canva, chart from TradingView"
  }
]