[
  {
    "source": "CryptoSlate",
    "date": "2024-03-25T21:13:25.000Z",
    "title": "SEC begins multi-billion dollar fraud trial against Terraform Labs, Do Kwon",
    "url": "https://cryptoslate.com/sec-begins-multi-billion-dollar-fraud-trial-against-terraform-labs-do-kwon/",
    "description": "<p>In a dramatic opening to a much-anticipated trial, the US SEC cast Terraform Labs and its co-founder, Do Kwon, as central figures in a vast financial deception that left investors nearly destitute following its collapse, Reuters reported on March 26. The trial, unfolding in the US District Court for the Southern District of New York, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-begins-multi-billion-dollar-fraud-trial-against-terraform-labs-do-kwon/\">SEC begins multi-billion dollar fraud trial against Terraform Labs, Do Kwon</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-25T21:21:21.000Z",
    "title": "DeFi weekly trading volume falls by 25% due to pullback in crypto prices",
    "url": "https://cryptobriefing.com/defi-weekly-volume-falls-25/",
    "description": "The correction seen in the prices of different crypto last week could be the cause behind DeFi's falling volumes, says Zeta Markets' founder."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T21:15:06.000Z",
    "title": "SEC alleges multi-billion dollar crypto fraud by Terraform Labs and Co-Founder",
    "url": "https://www.cryptopolitan.com/sec-alleges-crypto-fraud-by-terraform-labs/",
    "description": "The civil trial against Terraform Labs commenced in the U.S. District Court for the Southern District of New York, with the United States Securities and Exchange Commission (SEC) launching scathing allegations against the blockchain firm.&#160; In the opening statements, SEC attorney Devon Staren characterized Terra as a deceptive enterprise, likening it to a &#8220;house of [&#8230;]"
  }
]