[
  {
    "source": "BTCManager",
    "date": "2023-10-08T15:04:20.000Z",
    "title": "What you need to know about FTX star witness Caroline Ellison",
    "url": "https://crypto.news/what-to-know-about-ftx-star-witness-caroline-ellison/",
    "description": "Caroline Ellison was CEO at FTX's sister firm, Alameda Research, as well as Sam Bankman-Fried's ex-girlfriend. The 28-year-old is expected to take the stand after FTX co-founder Gary Wang."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-08T15:00:59.000Z",
    "title": "Bitcoin Price At Risk? Whale Transfers $137 Million In BTC After 3-Year Dormancy",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-at-risk-whale-transfers-137-million-in-btc-after-3-year-dormancy/",
    "description": "Whales are some of the most relevant entities in the Bitcoin market because of their potential influence on the Bitcoin price through large-volume transactions. Investors and traders often look out for whale transactions, which can trigger a domino effect on the market. In one of such developments, recent on-chain data revealed that a particular whale has woken up from a three-year slumber, moving their BTC for the first time since 2020. Whale Becomes Active For The First Time In Three Years According to data from blockchain analytics platform Arkham Intelligence, a particular Bitcoin whale became active after years of dormancy and transferred out 5,000 BTC (worth around $137 million) on Saturday, October 7.  The whale address initially received the 5,000 BTC from “Poolin mining pool” on June 23, 2020. At the time, the Bitcoin price was around $9,700, putting the total value of the transaction at approximately $48.5 million. Related Reading: Bitcoin Price: El Salvador Crypto Advisor Predicts Explosive Rise To $220,000 The Bitcoin price has experienced significant growth since 2020, with one BTC trading for $27,903 as of this writing. Consequently, the whale address’ holdings had swelled to approximately $137 million when all 5,000 BTC was moved on Saturday. On-chain data shows that this whale split and transferred the 5,000 to two separate addresses. Some 4,000 BTC were transferred to one address, and 1,000 BTC were sent to the other address, both of which are new and unmarked. A Threat To Bitcoin Price? This latest whale action seems to be provoking a sense of caution in the Bitcoin market. This is no surprise, considering that the movement of a large BTC amount (especially a sell-off) often sparks interest or fear in other investors, leading to momentary price fluctuations.  Nevertheless, it is worth noting that the reason behind this whale transfer is currently not known. It remains to be seen whether the owner wants to sell or just move their assets into another wallet. If the whale intends to sell off all their BTC holdings, then this latest action could potentially threaten the Bitcoin price. Large-scale selling could negatively impact Bitcoin’s value, as it often puts downward pressure on the cryptocurrency and could trigger a temporary price dip. Related Reading: Bitcoin News: Here Is When BTC Could Revisit $20,000 One Last Time, Analyst Says It may be worth mentioning that the Bitcoin price has not experienced any significant or abrupt changes in the past 24 hours. According to CoinGecko data, the value of BTC has dipped by 0.1% in the past day. Bitcoin has made a relatively healthy start to October, with the premier cryptocurrency recording a 3.3% price gain since the start of the month. The BTC price has been moving mostly sideways in the past few days as it looks to break through the $28,000 mark. Bitcoin price hovering around $28,000 on the daily timeframe &#124; Source: BTCUSDT chart on TradingView Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-08T15:05:51.000Z",
    "title": "SWIFT Dives Deeper into Crypto: Examining the Role of XRP",
    "url": "https://www.crypto-news-flash.com/swift-dives-deeper-into-crypto-examining-the-role-of-xrp/?utm_source=rss&utm_medium=rss&utm_campaign=swift-dives-deeper-into-crypto-examining-the-role-of-xrp",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />SWIFT has tested Ripple&#8217;s XRP in 2020 as it navigates the crypto ecosystem. ISO 20022 is set to revolutionize the financial industry, enhancing SWIFT&#8217;s real-time functionalities. The crypto community is buzzing with excitement after a recent tweet by JackTheRippler hinted that SWIFT had tested XRP successfully back in 2020 and is preparing for the integration [...]"
  }
]