[
  {
    "source": "Decrypt",
    "date": "2023-06-26T15:59:32.000Z",
    "title": "Swiss CBDC Will Be 'Real Money Equivalent to Bank Reserves', Says Central Bank Chair",
    "url": "https://decrypt.co/146216/swiss-cbdc-will-be-real-money-equivalent-to-bank-reserves-says-central-bank-chair",
    "description": "Switzerland will soon join the growing list of countries piloting a CBDC."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T16:00:00.000Z",
    "title": "Binance Eyes Strategic Move to UAE",
    "url": "https://cryptodaily.co.uk/2023/06/binance-eyes-strategic-move-to-uae",
    "description": "<p class=\"md-end-block md-p\">The world&rsquo;s top cryptocurrency exchange is eyeing a move to Dubai, in the midst of its battle with the United States&rsquo; Securities and Exchange Commission (SEC).</p>\n<p class=\"md-end-block md-p\">Binance Dubai General Manager Alex Chehade has said that the UAE is the prime destination for crypto businesses and has noted its pro-crypto stance and policies.</p>\n<p class=\"md-end-block md-p\">Chehade notes that the UAE is diversifying away from fossil fuels and has turned to cryptocurrency to achieve this. He also expects the influx of young people to the country to contribute to the rapid adoption of cryptocurrency. In a tweet last June 15, Binance MENA retweeted that over 27.7% of the UAE&rsquo;s population are crypto owners.</p>\nVirtual Assets and Financial Diversity\n<p class=\"md-end-block md-p\">The UAE has its own regulator exclusively for virtual assets, the Virtual Assets Regulatory Authority (VARA). Just last June 15, top crypto exchange OKX received an MVP preparatory license from VARA. MVP stands for &lsquo;minimal viable product&rsquo; and a preparatory license allows approved licensees to fulfill all pre-conditions required to undertake MVP operations within the VARA regime. </p>\n<p class=\"md-end-block md-p\">Binance itself received its own MVP license last September 2022. All of these point to the UAE&rsquo;s pro-crypto environment and why numerous crypto businesses are eyeing to expand on the country. &ldquo;There&rsquo;s a clear framework for people and businesses to engage with, whereas you&rsquo;re just not seeing as much of that elsewhere,&rdquo; Chehade said.</p>\nContrasts and Regulation\n<p class=\"md-end-block md-p\">This is in contrast to the United States and the SEC. Binance is currently in the middle of a dispute with the United States&rsquo; SEC and has just filed a lawsuit against the commission last June 23. The SEC and its chairman Gary Gensler in particular, have not flinched on their hardline stance against virtual assets and businesses and there seem to be no signs of a shift anytime soon.</p>\n<p class=\"md-end-block md-p\">Binance's interest in Dubai emphasizes the potential for countries with forward-thinking policies to position themselves as global crypto centers. By welcoming industry leaders like Binance, they can drive innovation and economic growth. Conversely, regulatory hostility or uncertainty, as observed in the US, can deter businesses and stifle the sector's development.</p>\n<p class=\"md-end-block md-p md-focus\">The implications of Binance's strategic move extend beyond individual companies or countries. This shift illustrates a key aspect of the future growth of the cryptocurrency industry &ndash; the necessity of harmonious interaction between crypto businesses and regulatory bodies. While the robustness and security of the crypto market are paramount, overregulation can inhibit innovation and advancement. Striking this delicate balance could determine the trajectory of the global crypto landscape.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T15:54:25.000Z",
    "title": "Arkham Partners With Tron, Launches Support for Tron Blockchain",
    "url": "https://cryptodaily.co.uk/2023/06/arkham-partners-with-tron-launches-support-for-tron-blockchain",
    "description": "<p>Geneva, Switzerland, June 26th, 2023, Chainwire</p><p>TRON DAO is pleased to announce that Arkham, the leading blockchain intelligence platform, has launched support for the TRON blockchain.</p><p>Arkham deanonymize blockchains by showing users the people and companies behind cryptocurrency transactions. Arkham&rsquo;s support for the TRON blockchain will enable traders and researchers to track the entities on TRON using Arkham&rsquo;s AI-powered analytics engine.</p><p>TRON is the world&rsquo;s leading blockchain by number of daily active addresses. It averages over 2 million daily this month, which surpasses both Ethereum and Bitcoin. It is the 2nd largest blockchain by total value locked. The TRON-Arkham partnership thus represents a major step forward in Arkham&rsquo;s coverage of global blockchain activity.&nbsp;</p>&ldquo;This partnership aligns perfectly with our values, offering our millions of users the ability to dive deeper into the blockchain than ever before,&rdquo; says a spokesperson of TRON DAO. &ldquo;Arkham's cutting-edge analytics engine will bring a new level of understanding to the TRON blockchain, allowing traders and researchers to map out the entities within our network. Together with Arkham, we aim to revolutionize the way people view and interact with the blockchain.&rdquo;&nbsp;<p>Miguel Morel, Founder and CEO of Arkham, also added, &ldquo;We&rsquo;re delighted to have TRON as a partner, as we launch support for their blockchain on Arkham. They&rsquo;ve achieved a significance which few other blockchains have, particularly in the Asian market, where Arkham is deeply committed to growing our presence.&rdquo;</p><p></p><p>About TRON DAO</p><p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p><p>Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. The TRON network has gained incredible traction in recent years. As of June 2023, it has over 168.8 million total user accounts on the blockchain, more than 5.97 billion total transactions, and over $12.49 billion in total value locked (TVL), as reported on TRONSCAN.&nbsp;</p><p>In addition, TRON hosts the largest circulating supply of USD Tether (USDT) stablecoin across the globe, overtaking USDT on Ethereum since April 2021. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently in October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, which marks the first time a major public blockchain partnered with a sovereign nation to develop its national blockchain infrastructure. On top of the government&rsquo;s endorsement to issue Dominica Coin (&ldquo;DMC&rdquo;), a blockchain-based fan token to help promote Dominica&rsquo;s global fanfare, seven existing TRON-based tokens - TRX, BTT, NFT, JST, USDD, USDT, TUSD, have been granted statutory status as authorized digital currency and medium of exchange in the country.</p><p></p><p>TRONNetwork | TRONDAO | Twitter | YouTube | Telegram | Discord | Reddit | GitHub | Medium | Forum</p><p></p><p>About Arkham</p><p>Arkham is deanonymizing the blockchain. With backing from the founders of Palantir and OpenAI, Arkham is building a crypto intelligence platform that shows users the people and companies behind blockchain activity and addresses, along with advanced data and analytics about their behavior. To deanonymize blockchain users and match them to identities, Arkham uses Ultra, a proprietary AI-powered address matching engine. For more information, visit https://arkhamintelligence.com&nbsp;</p><p></p>ContactHayward Wongpress@tron.network"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T16:02:38.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T15:57:50.000Z",
    "title": "Exodus wallet empowers users with Sovryn Dollar integration and financial freedom",
    "url": "https://www.cryptopolitan.com/exodus-wallet-empowers-users-with-sovryn-dollar-integration-and-financial-freedom/",
    "description": "In a groundbreaking move, Exodus, the renowned cryptocurrency software wallet, has announced the integration of Sovryn Dollar (DLLR), a stablecoin backed by Bitcoin, into its platform. This strategic partnership marks a significant milestone for both companies and signifies the beginning of a new era in financial autonomy and custody. With its extensive experience in the ... <a title=\"Exodus wallet empowers users with Sovryn Dollar integration and financial freedom\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exodus-wallet-empowers-users-with-sovryn-dollar-integration-and-financial-freedom/\" aria-label=\"More on Exodus wallet empowers users with Sovryn Dollar integration and financial freedom\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T15:56:33.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and it is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin (APE) ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T15:47:01.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Toady’s Aave price $65.45, with a 24-hour trading volume of $278,624,212. Aave is down 13% in the last 24 hours. The current CoinMarketCap ranking is #44, with a live market cap of $943,973,820. It has a circulating supply of 14,438,296 AAVE coins and a max. ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-26T16:06:18.000Z",
    "title": "APECOIN PRICE ANALYSIS & PREDICTION (June 26) – APE Charts 5% Daily Gain After a Steady Recovery, Price Traps in a Channel",
    "url": "https://nulltx.com/apecoin-price-analysis-prediction-june-26-ape-charts-5-daily-gain-after-a-steady-recovery-price-traps-in-a-channel/",
    "description": "Three weeks ago, Apecoin slipped below $2 and found support with a recovery in the past two weeks. It posted a 5% increase today and may reiterate more actions in the coming days.  As the market&#8217;s volatility dropped since last weekend, making most altcoins retrace downward, Apecoin&#8217;s price continued to increase and is now trying [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-26T15:59:45.000Z",
    "title": "CARDANO PRICE ANALYSIS & PREDICTION (June 26) – ADA Stalls at $0.30 After Two-Week Push, Signals Bearish Pattern on Hourly",
    "url": "https://nulltx.com/cardano-price-analysis-prediction-june-26-ada-stalls-at-0-30-after-two-week-push-signals-bearish-pattern-on-hourly/",
    "description": "Cardano looks weak today after recording a double-digit gain in the last 7 days. The weakness came after the bulls failed to push higher since last weekend. It may tap more profits if the bulls resume pressure.  Last week saw ADA and other altcoins through a significant recovery after dipping to a multi-month low of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T16:01:03.000Z",
    "title": "HSBC unveils bitcoin and ethereum ETF in Hong Kong",
    "url": "https://crypto.news/hsbc-unveils-bitcoin-and-ethereum-etf-in-hong-kong/",
    "description": "HSBC, one of Hong Kong's largest financial institutions, has made history by enabling its clients to trade bitcoin and ethereum Exchange-Traded Funds (ETFs), becoming the first bank in the city to do so."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T16:00:57.000Z",
    "title": "Analysts Predict 10,000% ROI For This Upcoming Memecoin, and Dogecoin Investors Are Buying Massively for a Reason",
    "url": "https://www.crypto-news-flash.com/analysts-predict-10000-roi-for-this-upcoming-memecoin-and-dogecoin-investors-are-buying-massively-for-a-reason/?utm_source=rss&utm_medium=rss&utm_campaign=analysts-predict-10000-roi-for-this-upcoming-memecoin-and-dogecoin-investors-are-buying-massively-for-a-reason",
    "description": "Crypto investors are always on the lookout for the next big opportunity, and missing out on massive market moves like the Dogecoin (DOGE) pump can be disappointing. Staying informed and up-to-date on the latest information about every coin on their watchlist is crucial for these investors. DOGE, with its vibrant community of crypto enthusiasts, investors, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T15:55:21.000Z",
    "title": "Arkham Partners With Tron, Launches Support for Tron Blockchain",
    "url": "https://www.crypto-news-flash.com/arkham-partners-with-tron-launches-support-for-tron-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=arkham-partners-with-tron-launches-support-for-tron-blockchain",
    "description": "Geneva, Switzerland, June 26th, 2023, Chainwire TRON DAO is pleased to announce that Arkham, the leading blockchain intelligence platform, has launched support for the TRON blockchain. Arkham deanonymize blockchains by showing users the people and companies behind cryptocurrency transactions. Arkham’s support for the TRON blockchain will enable traders and researchers to track the entities on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T15:42:30.000Z",
    "title": "Massive Shiba Inu (SHIB) Burn: Over 708 Million Tokens Incinerated in a Week, MARSWAP and Koyo Token Lead the Charge",
    "url": "https://www.crypto-news-flash.com/massive-shiba-inu-shib-burn-over-708-million-tokens-incinerated-in-a-week-marswap-and-koyo-token-lead-the-charge/?utm_source=rss&utm_medium=rss&utm_campaign=massive-shiba-inu-shib-burn-over-708-million-tokens-incinerated-in-a-week-marswap-and-koyo-token-lead-the-charge",
    "description": "The Shiba Inu memecoin protocol saw a 1747% increase in burn rate over the past week. The token remains visible despite current market uncertainty. The crypto market has witnessed an extraordinary event in recent times, as over 708 million Shiba Inu (SHIB) tokens were burned in a single week.  Shibburn.com, a platform that measures and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T15:51:00.000Z",
    "title": "PEPE’s Gains May Continue in Next Few Weeks, Predicts Influencer",
    "url": "https://coinedition.com/pepes-gains-may-continue-in-next-few-weeks-predicts-influencer/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE’s Gains May Continue in Next Few Weeks, Predicts Influencer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/PEPEs-Gains-May-Continue-in-Next-Few-Weeks-Predicts-Influencer-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Classy Crypto predicted in his latest YouTube video that PEPE may experience a big move in the next few weeks. The meme coin’s price has risen more than 70% over the past week. PEPE&#8217;s 24-hour performance was in the red zone despite its weekly gain. In a YouTube video posted earlier today, the crypto influencer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepes-gains-may-continue-in-next-few-weeks-predicts-influencer/\">PEPE’s Gains May Continue in Next Few Weeks, Predicts Influencer</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]