[
  {
    "source": "Decrypt",
    "date": "2023-11-14T16:01:02.000Z",
    "title": "Square Enix-Backed Atlas Uses AI to Turn Text and Images Into Game Worlds",
    "url": "https://decrypt.co/205923/final-fantasy-developer-square-enix-backs-3d-ai-platform-atlas",
    "description": "The generative AI startup Atlas emerges from stealth with $6 million in gaming and blockchain investments."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T15:53:00.000Z",
    "title": "Disney launches NFT platform with Dapper Labs",
    "url": "http://cointelegraph.com/news/disney-metaverse-launches-nft-web3-platform-dapper-labs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7c22b0fb-3b23-4cc0-afed-f9114b82ec09.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The NFT platform, dubbed 'Disney Pinnacle,' will go live later this year. </p>\n                    <p><p>Disney has created a nonfungible tokens (NFT) platform together with blockchain and metaverse firm Dapper Labs.</p><p>According to the November 14 <a href=\"https://disneypinnacle.com/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, Disney will tokenize its iconic cartoon characters from the past century onto its NFT marketplace dubbed \"Disney Pinnacle.\" The platform will also include icons from Pixar as well as heroes and villains from the <em>Star Wars</em> galaxy, uniquely styled as collectible and tradable digital pins. \"Fans anywhere will be able to collect dynamic pins on their phone and trade instantly and securely with each other no matter where they are in the world,\" Dapper Labs' CEO Roham Gharegozlou explained. </p><p>The NFT platform will launch later this year on the Apple App Store for iOS, the Google Play store for Android and on the web. As of now, only a waitlist and a landing site exist on its official page. Disney Pinnacle is built on layer-one blockchain Flow, which was too, created by Dapper Labs. Previously, Ticketmaster <a href=\"https://cointelegraph.com/news/ticketmaster-selects-flow-blockchain-for-minting-nft-event-tickets\">elected to mint NFT</a> event tickets on the Flow blockchain. </p><p>Earlier this year, Disney decided to <a href=\"https://cointelegraph.com/news/disney-reportedly-scraps-its-metaverse-division\">pull the plug</a> on its metaverse division as part of a broader restructuring plan to cut its operating expenses by $5.5 billion and lay off 7,000 staff over two months. The metaverse division’s 50 or so members were left without a new employment contract. </p><p>Founded in Vancouver, Canada, in 2018, Dapper Labs received a $15 million investment from Hong Kong Web3 creator Animoca Brands. In July 2023, Dapper Labs announced its <a href=\"https://cointelegraph.com/news/dapper-labs-cut-staff-layoff-amid-nft-contraction\">third round</a> of staff layoffs to year-to-date. The firm is known for its NFT brands such as CryptoKitties and NBA Top Shot.</p><p><strong>Related: <a href=\"https://cointelegraph.com/news/disney-reportedly-scraps-its-metaverse-division\">Disney reportedly scraps its metaverse division</a></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T15:45:06.000Z",
    "title": "Historical correlation between elections and recessions raises concerns ahead of 2024",
    "url": "https://cryptoslate.com/insights/historical-correlation-between-elections-and-recessions-raises-concerns-ahead-of-2024/",
    "description": "<p>Quick Take The federal funds rate, currently steady at a noteworthy 5.33% — a peak unseen since 2001 — indicates the ongoing battle against one of the harshest inflation rates in the past forty years. However, with the U.S. CPI YoY decreasing from over 8% to a mere 3.2%, the intense inflationary pressure seems to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/historical-correlation-between-elections-and-recessions-raises-concerns-ahead-of-2024/\">Historical correlation between elections and recessions raises concerns ahead of 2024</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-14T15:44:14.000Z",
    "title": "Crypto.com Obtains Dubai VASP License",
    "url": "https://cryptobriefing.com/crypto-com-obtains-dubai-vasp-license/?utm_source=feed&utm_medium=rss",
    "description": "Crypto.com wins Dubai VASP license after prior MVP permits, expanding exchange, brokerage, investment &#038; lending services."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-14T15:58:00.000Z",
    "title": "Bitcoin (BTC) Price Drops Below $36,000 as U.S. inflation data eases pressure on Fed",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-btc-price-drops-below-36000-as-u-s-inflation-data-eases-pressure-on-fed/",
    "description": "Last month, U.S. inflation pressures eased further, according to data from the US Department of Labor released on Tuesday, which shows core consumer prices, which exclude food and energy, dropped to the lowest level in two years and cast doubt on the Federal Reserve’s plans to raise interest rates soon. The Labor Department reported that […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T15:40:20.000Z",
    "title": "Is a Surprise Upturn Possible in Ethereum (ETH) Hesitant Rally?",
    "url": "https://cryptodaily.co.uk/2023/11/is-a-surprise-upturn-possible-in-ethereum-eth-hesitant-rally",
    "description": "Delve into the dynamic world of Ethereum (ETH) as it navigates the ever-changing cryptocurrency landscape. Our in-depth analysis explores the altcoin's current market position, teetering between potential breakthroughs and setbacks. With ETH at crucial technical junctures, we offer a detailed view of its performance, considering the influence of market trends, external factors, and investor sentiment."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T16:02:00.000Z",
    "title": "USDV Stablecoin Launch: Verified USD Foundation Gears Up for Groundbreaking Release",
    "url": "https://www.cryptopolitan.com/usdv-stablecoin-launch-verified-usd-release/",
    "description": "In a significant move within the cryptocurrency sector, the Verified USD Foundation, a non-profit organization dedicated to creating a sustainable and innovative stablecoin ecosystem, has announced its plans to launch the Verified USD (USDV) stablecoin. the development marks a notable step in the evolution of digital currencies, particularly in the realm of stablecoins, which are ... <a title=\"USDV Stablecoin Launch: Verified USD Foundation Gears Up for Groundbreaking Release\" class=\"read-more\" href=\"https://www.cryptopolitan.com/usdv-stablecoin-launch-verified-usd-release/\" aria-label=\"More on USDV Stablecoin Launch: Verified USD Foundation Gears Up for Groundbreaking Release\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T16:00:31.000Z",
    "title": "China’s tech revolution and regulatory landscape",
    "url": "https://www.cryptopolitan.com/chinas-tech-revolution/",
    "description": "China has emerged as a global leader in the development and utilization of digital technologies, particularly artificial intelligence (AI). This transformation has not only propelled Chinese companies to compete on the world stage but has also prompted a robust regulatory framework to ensure responsible use and safeguard against market abuses.&#160; Amidst this tech boom and ... <a title=\"China&#8217;s tech revolution and regulatory landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-tech-revolution/\" aria-label=\"More on China&#8217;s tech revolution and regulatory landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T15:52:18.000Z",
    "title": "Drones and wearable technology transform frontline healthcare",
    "url": "https://www.cryptopolitan.com/drones-and-wearable-technology-on-healthcare/",
    "description": "In a groundbreaking presentation at Medica 2023, Colonel Paul Parker, an orthopaedics consultant at Queen Elizabeth Hospital, Birmingham, and the University College, Cork, shed light on the future of battlefield medicine. Colonel Parker&#8217;s vision incorporates a fusion of medical devices, artificial intelligence (AI), wearable technology, and drones that promises to reshape the detection and treatment ... <a title=\"Drones and wearable technology transform frontline healthcare\" class=\"read-more\" href=\"https://www.cryptopolitan.com/drones-and-wearable-technology-on-healthcare/\" aria-label=\"More on Drones and wearable technology transform frontline healthcare\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T16:01:34.000Z",
    "title": "Lookonchain reports whales are dominating the Ethereum market with big sales",
    "url": "https://crypto.news/lookonchain-reports-whales-are-dominating-the-ethereum-market-with-big-sales/",
    "description": "In a Nov. 14 post, the cryptocurrency on-chain data analysis firm Lookonchain reports whale activity amid Ethereum price surge."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T15:45:18.000Z",
    "title": "USDV stablecoin backed by tokenized treasuries launches",
    "url": "https://crypto.news/usdv-stablecoin-backed-by-tokenized-treasuries-launches/",
    "description": "A new stablecoin called USDV has launched, claiming stability and transparency by pegging itself to tokenized U.S. Treasuries."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T16:00:52.000Z",
    "title": "Celestia Strikes: How This Lesser-Known Coin Went Berserk With 126% Price Explosion",
    "url": "https://www.newsbtc.com/news/celestia-strikes-how-this-lesser-known-coin-went-berserk-with-126-price-explosion/",
    "description": "Celestia (TIA) has hit an all-time high, making waves in the world of cryptocurrency. It&#8217;s the first-ever modular blockchain network, which basically means it&#8217;s a new kind of technology that&#8217;s changing how blockchains are created and used. At the time of writing, TIA was trading at $5.25, and registering an impressive 126% increase in the last seven days, data from Coingecko shows. However, the token sustained a 12.7% loss in the last 24 hours. Celestia&#8217;s unique method separates different parts of the blockchain process, making it easier to set up individual blockchains. This innovation has pushed Celestia to the forefront of the evolving world of blockchain technology. Related Reading: Solana (SOL) Shines 40% Toward $60 As Whales Make Big Moves With a market cap exceeding $691 million, Celestia has quickly become one of the fastest-growing blockchains. The network, backed by OKX, recently launched its mainnet and issued an airdrop to over 190,000 people, despite having 610k eligible recipients. The price of Celestia TIA had a significant decline during the past two days, dropping from its top of $6 on Monday to a low of $4.21. However, the price rebounded on Tuesday morning. The current value of the token is nearing the significant halfway point to $5.50. According to Santiment&#8217;s data, the trading volume of TIA has demonstrated positive advancements from November 11th. As of the current moment, the trading volume stands at $751.37 million. This was a level of value that had not been approached since its initial introduction. Source: Santiment A significant level of trading volume serves as an indicator of heightened liquidity allocation towards a token, along with a corresponding level of market interest. Related Reading: Boom! Cronos Unleashes 57% Weekend Explosion, Beating All In The Top 100 Crypto Ranking When examining the impact on price, an upward trend in volume, coupled with a concurrent rise in price, has the potential to reinforce the direction of price movement. TIAUSD trading at $5.16 on the 24-hour chart at TradingView.com On the flip side, Celestia&#8217;s online buzz has decreased significantly, dropping by 55.5% in the last day, according to data from Santiment. Despite this decline in social media chatter on platforms like Twitter, Telegram, and Reddit, Celestia remains prominently featured on CoinMarketCap. Source: Santiment This drop in social volume comes after the platform launched its mainnet on October 31, distributing TIA tokens to 580,000 eligible users through an airdrop. The TIA token has grown remarkably, rising by 154% from its starting price of roughly $2.1, or 135% over the last week, despite a decline in online discussions. The asset&#8217;s listing on Binance has added to its momentum, showcasing promising solutions for scalability that competitors like Ethereum (ETH) and Solana (SOL) have struggled to deliver to their users. Taking a conservative approach, it is possible that TIA may reach approximately $11 by the end of the year. This scenario postulates that the ongoing upward trend will soon come to an end, leading to a subsequent phase of correction. In an ideal scenario, a regression towards the $3.40 region might establish the foundation for a more significant upward movement, potentially attaining a value of $10 during the third wave and beyond $11 subsequent to a consolidation in the fourth wave. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from NASA"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T16:08:00.000Z",
    "title": "Swan Bitcoin Terminates Accounts Using Crypto Mixing Services",
    "url": "https://coinedition.com/swan-bitcoin-terminates-accounts-using-crypto-mixing-services/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Swan Bitcoin Terminates Accounts Using Crypto\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Swan Bitcoin CTO and Co-Founder, Yan Pritzker, wrote a long statement on X (formerly Twitter)  on November 12, explaining the firm’s new policy regarding crypto mixing. He highlighted that the platform’s decision to terminate or freeze accounts was due to the regulatory obligations of its partners—from banks to qualified custodians. Pritzker underscored that Swan Bitcoin [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/swan-bitcoin-terminates-accounts-using-crypto-mixing-services/\">Swan Bitcoin Terminates Accounts Using Crypto Mixing Services</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]