[
  {
    "source": "CoinDesk",
    "date": "2023-06-22T19:33:53.000Z",
    "title": "BlackRock Executive: Knowing Who Counterparties Are Is Key to Engaging Institutions in DeFi ",
    "url": "https://www.coindesk.com/business/2023/06/22/blackrock-executive-knowing-who-counterparties-are-is-key-to-engaging-institutions-in-defi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock's views on KYC will likely carry weight in the ongoing struggle for regulation on the industry, given its ETF application."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T19:10:00.000Z",
    "title": "TrueUSD assures users it has no exposure to troubled Prime Trust ",
    "url": "https://cointelegraph.com/news/trueusd-assures-users-no-prime-trust-exposure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0dc9783e-cfec-46b1-99ba-dbc594a48ca8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stablecoin issuer TrueUSD maintains that it is not affected by the current challenges facing Prime Trust.</p>\n                    <p><p>On June 22,  TrueUSD <a href=\"https://twitter.com/tusdio/status/1671898163039596544\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Twitter that its TUSD stablecoin had “no exposure” to the troubled Prime Trust, which is reportedly facing regulatory challenges. </p><p>Following an order from state financial regulators, the <a href=\"https://cointelegraph.com/news/bitgo-terminates-acquisition-prime-trust\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitgo-terminates-acquisition-prime-trust/amp\">Nevada-based Prime Trust</a> reportedly abruptly halted all fiat and cryptocurrency deposits and withdrawals. Numerous clients now find themselves in a predicament, with their funds effectively stranded due to the sudden disruption.</p><p>In light of the recent news, TrueUSD promptly announced that “it is not affected by the situation” at Prime Trust. TrueUSD emphasized that it had diversified its partnerships and maintained “multiple USD rails” elsewhere. The announcement read: </p><blockquote>“PrimeTrust has suspended all deposits of fiat and digital assets. #TrueUSD (#TUSD) is not affected by this situation. We have no exposure to Prime Trust and maintain multiple USD rails for minting and redemption. Rest assured, all your funds are safe with TUSD.”</blockquote><p>Prime Trust is a technology-driven trust company that provides a range of services to digital asset companies. Its offerings encompass token and fiat custody, funds processing, Anti-Money Laundering compliance and Know Your Customer regulations, and transaction technology solutions. The company plays a crucial role in supporting the cryptocurrency ecosystem. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitgo-terminates-acquisition-prime-trust\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitgo-terminates-acquisition-prime-trust/amp\">BitGo terminates acquisition of Prime Trust</a></em></strong></p><p>In the early hours of June 10, <a href=\"https://cointelegraph.com/news/tusd-stops-minting-via-prime-trust-loses-dollar-peg\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/tusd-stops-minting-via-prime-trust-loses-dollar-peg/amp\">TUSD experienced a deviation from its dollar peg</a> due to a temporary halt in minting activities facilitated by Prime Trust, which is TUSD’s technology partner. The disruption caused TUSD’s value to drop to its lowest point at $0.9964, as reported by CoinMarketCap. </p><p>TrueUSD said it addressed the situation, assuring its users that while the minting process through Prime Trust was temporarily paused, other banking partnerships for TUSD minting and redemption services remained unaffected. At the time of publication, TUSD is trading at $1, with an estimated market cap of $3.1 billion, data from CoinMarketCap confirmed. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T19:12:59.000Z",
    "title": "Binance’s legal woes intensify as Brazil lawmaker seeks to question general manager",
    "url": "https://cryptoslate.com/binances-legal-woes-intensify-as-brazil-lawmaker-seeks-to-question-general-manager/",
    "description": "<p>Binance, already under regulatory fire in jurisdictions worldwide, is seeing its legal pressures exacerbated in Brazil, where lawmaker Alfredo Gaspar has formally requested that the National Congress compel Guilherme Haddad Nazar, General Manager of Binance Brazil, to appear for questioning. In a formal request addressed to the Parliamentary Commission of Inquiry into Pyramid Schemes, Gaspar [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binances-legal-woes-intensify-as-brazil-lawmaker-seeks-to-question-general-manager/\">Binance&#8217;s legal woes intensify as Brazil lawmaker seeks to question general manager</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T19:25:32.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T19:24:25.000Z",
    "title": "BitMEX CEO calls for operational model shift as internal market-making teams face scrutiny",
    "url": "https://www.cryptopolitan.com/bitmex-ceo-calls-for-operational-model-shift-as-internal-market-making-teams-face-scrutiny/",
    "description": "As the cryptocurrency landscape continues to evolve, the acting CEO of BitMEX&#8217;s parent company, Stephan Lutz, in an interview, suggests a shift in the operational model of exchanges, particularly regarding their internal market-making teams.  Lutz believes that the rise of high-frequency traders (HFTs) and proprietary trading firms can effectively replace the need for internal market ... <a title=\"BitMEX CEO calls for operational model shift as internal market-making teams face scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitmex-ceo-calls-for-operational-model-shift-as-internal-market-making-teams-face-scrutiny/\" aria-label=\"More on BitMEX CEO calls for operational model shift as internal market-making teams face scrutiny\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T19:14:19.000Z",
    "title": "IMF admits that banning crypto won’t work",
    "url": "https://www.cryptopolitan.com/imf-admits-banning-crypto-wont-work/",
    "description": "The International Monetary Fund (IMF) has conceded that the prohibition of cryptocurrencies might not be a practical approach in the long run. Instead, the global financial institution urges a focus on meeting digital payment needs and improving transparency in the use of these digital assets. Regulating crypto: A necessity, not an option Latin American and ... <a title=\"IMF admits that banning crypto won&#8217;t work\" class=\"read-more\" href=\"https://www.cryptopolitan.com/imf-admits-banning-crypto-wont-work/\" aria-label=\"More on IMF admits that banning crypto won&#8217;t work\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T19:31:00.000Z",
    "title": "Mastercard boosts ‘Engage’ program to prioritize crypto integration",
    "url": "https://crypto.news/mastercard-boosts-engage-program-to-prioritize-crypto-integration/",
    "description": "Mastercard has expanded the scope of its Engage program, facilitating connections between card issuers and potential partners who possess the necessary technical expertise to expedite the launch of crypto credit cards."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T19:30:04.000Z",
    "title": "Uniswap Faces Backlash Over Business Source License Imposed On v4 Code",
    "url": "https://www.newsbtc.com/analysis/uni/uniswap-faces-backlash-over-business-source-license-imposed-on-v4-code/",
    "description": "Uniswap, the top decentralized exchange (DEX) in the Decentralized Finance (DeFi) space, has come under fire from developers after imposing a Business Source License (BSL) on its v4 code.  According to a report by DL News, this move has restricted other developers from using the code for four years, leading to accusations that Uniswap is betraying its open-source ethos. Uniswap’s Open Source Credibility In Question DeFi developers have complained that many of the new features outlined in Uniswap&#8217;s v4 whitepaper are similar to those already released by rival protocols. As such, the decision to use a BSL has cast doubt on the exchange&#8217;s commitment to open-source development and prompted some in the DeFi community to question whether Uniswap has plagiarized other protocols&#8217; ideas. Related Reading: Bitcoin Whales Show Most Active Hour In 3 Months As BTC Breaks $30,000 Uniswap&#8217;s decision to impose a BSL license on its v4 code could have several potential consequences for its user base. Firstly, the move could alienate some developers who believe in the importance of open-source development and collaboration. This could lead to a loss of trust in Uniswap and a shift towards other decentralized exchanges that have a more open approach to code sharing. Additionally, the BSL license could limit the number of developers who can work on Uniswap&#8217;s code, which could slow down innovation and the development of new features. This could put Uniswap at a disadvantage compared to other decentralized exchanges that are more open to collaboration and innovation. Furthermore, the BSL license could limit the number of forks of Uniswap&#8217;s code, which could reduce the competition in the DeFi space. While this could be seen as a positive for Uniswap, it could also lead to a lack of innovation and a stagnation of the DeFi ecosystem as a whole. Finally, the controversy around the BSL license could damage Uniswap&#8217;s reputation and lead to a loss of users who are concerned about the exchange&#8217;s commitment to open-source development Uniswap Denies Plagiarism Accusations Nevertheless, Uniswap&#8217;s defenders argue that the exchange has not copied others&#8217; work and that using a BSL is a sound way to protect the exchange&#8217;s hard work.  They also point out that Uniswap is free to choose the license it sees fit. Even though many DeFi developers believe that making code fully open source is beneficial to the industry as it allows for collaboration and often improves the security of the code. Uniswap is currently the top decentralized exchange, but it has faced challenges in the past. In 2020, Uniswap suffered a &#8220;vampire attack&#8221; from the then newly-launched exchange Sushiswap. By protecting its code with a BSL license, Uniswap is likely trying to avoid a similar situation in the future. Related Reading: ‘Ripple (XRP) Is A Must-Hold For The Next Bull Run,’ Says Bitcoin Maxi Despite the controversy, some DeFi developers believe that using a BSL makes sense and is a decision that keeps many &#8220;dumb forks&#8221; from existing.  The allegations of plagiarism have further complicated the issue. Several members of the DeFi community have accused Uniswap of copying ideas from rival protocols and then trapping them behind the BSL license.  While it is difficult to say if any copying took place, the accusations have raised concerns about the exchange&#8217;s practices and the future of open-source development in the DeFi space. Featured image from Unsplash, chart from TradingView.com "
  }
]