[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T10:00:00.000Z",
    "title": "Sam Bankman-Fried Goes on Trial Tomorrow",
    "url": "https://www.coindesk.com/policy/2023/10/02/sam-bankman-fried-goes-on-trial-tomorrow/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "It is officially trial week, everyone – or as Bloomberg’s Joe Weisenthal would likely put it, “this is why we get up in the morning.” It’s been exactly nine months and 20 days since Sam Bankman-Fried got arrested in his then-home in the Bahamas. Today marks the last day before he is set to start trial in which he will win back his freedom – or be locked up for what a federal judge says a “very long” time."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T09:59:20.000Z",
    "title": "Genshin Impact: Full List of Underwater Pets",
    "url": "https://www.cryptopolitan.com/genshin-impact-pets-underwater/",
    "description": "Discover charming pets in Genshin Impact, including underwater companions. Dive into the world of Teyvat with these delightful creatures, each with a unique story."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T09:56:51.000Z",
    "title": "Attorney Deaton offers new strategy for dealing with the SEC",
    "url": "https://www.cryptopolitan.com/deaton-offer-new-strategy-to-deal-with-sec/",
    "description": "John Deaton, a prominent attorney representing XRP holders, has recently offered a unique piece of advice to companies operating within the digital currency sector on interacting with the United States Securities and Exchange Commission (SEC). This counsel came as a response to a post by Ripple CTO David Schwartz, who outlined three key strategies for ... <a title=\"Attorney Deaton offers new strategy for dealing with the SEC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/deaton-offer-new-strategy-to-deal-with-sec/\" aria-label=\"More on Attorney Deaton offers new strategy for dealing with the SEC\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T09:42:20.000Z",
    "title": "Solana Rebound Potential: Is $30 The Next Target?",
    "url": "https://www.newsbtc.com/news/solana-rebound-potential-is-30-the-next-target/",
    "description": "Solana (SOL) has been on an impressive winning streak, with its price chart resembling the formation of an inverted head and shoulders pattern, a bullish technical indicator signaling potential upward momentum. This surge in SOL&#8217;s value has grabbed the attention of crypto enthusiasts and traders alike.  At the time of writing, SOL is trading at $24.39, according to CoinGecko. Over the past 24 hours, the coin has rallied by an impressive 14.5%, contributing to a seven-day surge of 25.4%. Notably, SOL recently breached the resistance level of $22.2, which now acts as a robust support zone in case of market pullbacks. Related Reading: Uniswap Soaring User Engagement: How It’s Transforming UNI Price? Solana: Potential For Further Gains Analysts are closely monitoring SOL&#8217;s ability to maintain its foothold above $22.1, as this could lead to another 13% price surge, with a target zone of $26 to $30. However, a word of caution is in order, as the presence of a long wick rejection around the $24 mark on the daily chart suggests the possibility of a minor pullback.  SOL market cap nearing the $10 billion mark. Chart: TradingView.com In a separate report, it is noted that one SOL is currently trading at approximately 0.01281 ETH. This holds significant implications for traders and investors, particularly those closely following the SOL/ETH trading pair. This price point signifies an increase in volatility for Solana, potentially opening up more trading opportunities and the prospect of higher returns. Perhaps even more intriguingly, it highlights Solana&#8217;s growing dominance in certain aspects of blockchain technology when compared to Ethereum. SOL/ETH Trading Pair Signals Opportunity And Competition Ethereum has traditionally been the go-to platform for decentralized applications (dApps) and smart contracts. However, Solana has been making substantial headway due to its high throughput and lower transaction costs. A breakout in the SOL/ETH trading pair could signal that the market is increasingly recognizing Solana&#8217;s potential to rival, and even surpass, Ethereum in specific use cases. SOL seven-day price advance. Source: Coingecko Related Reading: CRV Price Surges 16% – What’s The Next Move For Curve DAO Token? The implications of SOL&#8217;s recent price surge and potential breakout against Ethereum are twofold. Firstly, it indicates a renewed interest and investment in Solana, potentially driving its market capitalization higher. Secondly, it raises the possibility of a more competitive landscape within the blockchain space, with Solana emerging as a serious contender in the world of decentralized applications and smart contracts.  As crypto enthusiasts continue to watch these developments closely, the future holds exciting prospects for Solana and its investors. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T09:48:15.000Z",
    "title": "Harvard Publishes Case Study About Ripple and Its Business Model in Preparation for Potential IPO",
    "url": "https://www.crypto-news-flash.com/harvard-publishes-case-study-about-ripple-and-its-business-model-in-preparation-for-potential-ipo/?utm_source=rss&utm_medium=rss&utm_campaign=harvard-publishes-case-study-about-ripple-and-its-business-model-in-preparation-for-potential-ipo",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Harvard Business School releases a case study on Ripple, emphasizing its unique crypto business model and potential ramifications for its IPO. Crypto Eri, an influential XRP figure, underscores the importance of this case study for Ripple&#8217;s upcoming IPO valuation. Inside Harvard&#8217;s Analysis on Ripple The digital currency world was recently set abuzz with a new [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T09:47:08.000Z",
    "title": "Polkadot’s Quantum Leap: Async Backing Unleashes Parachain Power",
    "url": "https://www.crypto-news-flash.com/polkadots-quantum-leap-async-backing-unleashes-parachain-power/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-quantum-leap-async-backing-unleashes-parachain-power",
    "description": "<img width=\"640\" height=\"426\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot launches OpenGov, an open governance platform.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />The Polkadot network has revealed the next step in its scaling roadmap with a proposal to introduce Asynchronous Backing. Courtesy of the Asynchronous backing, execution time on the Polkadot will be increased, while Parablock time will be reduced. A recent Polkadot proposal aims to advance the development of the network. The proposal, known as “Asynchronous [...]"
  }
]