[
  {
    "source": "CoinDesk",
    "date": "2024-01-05T11:00:00.000Z",
    "title": "Bitcoin ETF Fees Will Play Critical Role in the Race to Popularity",
    "url": "https://www.coindesk.com/business/2024/01/05/bitcoin-etf-fees-will-play-critical-role-in-the-race-to-popularity/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "So far, only six potential spot bitcoin ETF issuers have revealed their charge, and Fidelity is the cheapest."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T10:51:31.000Z",
    "title": " Spot Bitcoin ETF capital: Could funds potentially buy up all BTC in circulation? ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-seed-buy-all-btc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2I0MzVmMmQtNmIyMi00ZjFjLTllYmQtNDk1ZjJlNWY4NGI5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A company or a government might attempt to buy a significant amount of Bitcoin, but it will likely get tricky pretty soon, as the price will only continue to rise, analysts say.</p>\n                    <p><p>The long-awaited potential approval of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) in the United States could mean the market sees Bitcoin supply suddenly drop as funds snap up as much as they can, some market observers have <a href=\"https://x.com/TheBTCTherapist/status/1741270777159201128?s=20\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a>. With prominent firms like Ernst &amp; Young expecting SEC approval to <a href=\"https://cointelegraph.com/news/bitget-releases-mpc-wallet-2-3-private-key-sharding\">trigger massive demand from institutions</a>, will the financial giants behind these ETFs leave any actual Bitcoin on the market for the rest of us?</p><p>The U.S. A spot Bitcoin ETF would bring up to $30 billion of fresh cash into Bitcoin, crypto entrepreneur and investor Lark Davis <a href=\"https://x.com/TheCryptoLark/status/1698682491413156201?s=20\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> in September 2023. In such a scenario, spot Bitcoin ETF issuers would buy up about 50% of all Bitcoin on crypto exchanges to back their ETFs, he projected.</p><p>But buying as much Bitcoin as possible would likely get tricky for anyone, several industry executives and analysts agree.</p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-seed-buy-all-btc\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T11:00:43.000Z",
    "title": "Central Bank of Nigeria approves cNGN stablecoin to pilot in February amid CBDC woes",
    "url": "https://cryptoslate.com/central-bank-of-nigeria-approves-cngn-stablecoin-to-pilot-in-february-amid-cbdc-woes/",
    "description": "<p>The Central Bank of Nigeria (CBN) has approved the Africa Stablecoin Consortium to pilot the cNGN stablecoin within its Regulatory Sandbox. This initiative marks a key moment in the evolution of financial developments in the country. The ASC brings together a group of leading financial institutions, fintech innovators, and blockchain specialists, aiming to redefine and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/central-bank-of-nigeria-approves-cngn-stablecoin-to-pilot-in-february-amid-cbdc-woes/\">Central Bank of Nigeria approves cNGN stablecoin to pilot in February amid CBDC woes</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-05T10:59:07.000Z",
    "title": "Celestia (TIA) and Injective (INJ) are forerunners of the coming altcoin season",
    "url": "https://cryptodaily.co.uk/2024/01/celestia-tia-and-injective-inj-are-forerunners-of-the-coming-altcoin-season",
    "description": "With altcoin season perhaps just around the corner, both Celestia (TIA) and Injective (INJ) are showing the kinds of price gains to come from other top-performing altcoins."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-05T11:00:34.000Z",
    "title": "South Korean Tokenization Startup Chooses Klaytn Over Ethereum for Gold NFTs",
    "url": "https://news.bitcoin.com/south-korean-tokenization-startup-chooses-klaytn-over-ethereum-for-gold-nfts/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Creder to Launch Goldstation Gold Tokenization Platform on Klaytn\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c64ddcf4-d576-43b1-b66f-2b4fd8c834c9.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Klaytn Foundation, an organization devoted to expanding the Klaytn ecosystem, announced that Creder, one of its governance council members, will launch a tokenized gold offering called Gold Pegged Coin (GPC) in January. Creder will also launch Goldstation, a decentralized finance platform to convert physical gold into GPC tokens. Creder Launches 1:1 Backed Gold Pegged [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-05T10:50:11.000Z",
    "title": "ARBITRUM PRICE ANALYSIS & PREDICTION (January 5) – ARB Defies Market Sentiment As It Continues to Surge, Up 30% In A Week",
    "url": "https://nulltx.com/arbitrum-price-analysis-prediction-january-5-arb-defies-market-sentiment-as-it-continues-to-surge-up-30-in-a-week/",
    "description": "ARB has been gaining traction since the price surged through a key supply zone some weeks back. It remained strong daily and continued to surge until the price broke out to a new high today. Two weeks ago, ARB broke out of a key supply zone after experiencing weeks of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T11:09:26.000Z",
    "title": "Nigeria’s Central Bank approves cNGN stablecoin for February launch",
    "url": "https://crypto.news/nigerias-central-bank-approves-cngn-stablecoin-for-february-launch/",
    "description": "The Africa Stablecoin Consortium (ASC) has received approval from the Central Bank of Nigeria (CBN) to pilot its cNGN stablecoin within the regulatory sandbox, with the launch scheduled for Feb. 27, 2024. In a Jan. 4 blog update, the ASC,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T10:48:30.000Z",
    "title": "Logan Paul faces backlash after declaring $2.3m refund for CryptoZoo NFTs",
    "url": "https://crypto.news/logan-paul-faces-backlash-after-declaring-2-3m-refund-for-cryptozoo-nfts/",
    "description": "Tom Kherkher, a YouTuber and owner of the Attorney Tom and Associates law firm, says Logan Paul&#8217;s announcement to buy back CryptoZoo NFTs is filled with a &#8216;bunch of inaccuracies.&#8217; In an X post on Jan. 4, Logan Paul announced&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T10:46:12.000Z",
    "title": "Crypto security firm CertiK’s X account compromised",
    "url": "https://crypto.news/crypto-security-firm-certiks-x-account-compromised/",
    "description": "CertiK&#8217;s account with over 340k followers has apparently posted a malicious link, urging followers to use it to safeguard from a cyber incident. A crypto auditor CertiK has become the latest victim of a hacker attack, posting on its X&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T10:40:31.000Z",
    "title": "Falling Down: XRP Sheds 10% As Short-Term Recovery Prospects Remain Dim",
    "url": "https://www.newsbtc.com/news/falling-down-xrp-sheds-10-as-short-term-recovery-prospects-remain-dim/",
    "description": "Over the past day, cryptocurrency prices have plummeted, with XRP being among the worst hit—it has lost 10% of its value while the market as a whole is reeling from extreme volatility. The price of XRP has dropped significantly and abruptly, causing a seismic shift that is similar of the one that occurred in August of last year. The price chart below shows a significant decline, signifying the liquidation of derivatives valued at millions of dollars in a very short amount of time. Related Reading: Celestia Adds 35% More To Its Value As TIA Guns For $20 This unanticipated decline has had a significant impact, upsetting many traders and disrupting a wide range of trading portfolios. The severity of this price decline have brought an unexpected degree of volatility to the market, which has caused traders and risk managers to reevaluate their trading tactics. XRP market cap currently at $31 billion. Chart: TradingView.com The current upward trend of XRP has come to a halt. With Ripple releasing one billion XRP from its escrow accounts this week, the bearish attitude surrounding XRP seems to be growing. To give the market a regulated level of liquidity, this regular process, which occurs on the first of every month, entails three distinct transactions. Notwithstanding XRP&#8217;s present consolidation near the $0.6 mark, its prior January performance may have encouraged investors. With the exception of 2022, XRP has typically demonstrated a positive trend in this month during the past four years. XRP has increased by 30% on average in January. XRP Price Analysis The chart analysis reveals an interesting trend in the XRP market, which is characterized by a consolidation phase inside a contracting price range. The traders&#8217; interpretation of this consolidation pattern as an accumulation period led to elevated anticipation of a possible bullish rise. This story was upset, nevertheless, by the rapid crash in XRP that followed. The chart&#8217;s long downward wick suggests a sharp sell-off that caused prices to drop sharply and quickly. XRP/USDT chart by TradingView A market where sellers have applied considerable pressure, overwhelming buyers and initiating a series of liquidations when stop-loss orders are executed in large quantities, is usually indicated by such price behavior. The ramifications of this sudden decline are significant. The reversal of the previously noted accumulation phase casts doubt on the previously validated bullish setups and adds a degree of uncertainty. This event suggests that there has been a shift in market sentiment, with a notable decline in confidence over XRP&#8217;s potential for immediate growth. Related Reading: SEI What? Token Rules Top 100 Listing With 80% Rally As Crypto Market Wobbles It will now be up to traders and investors to come to terms with this new reality, and it can take some time for the market to stabilize and sentiment to return. Short-Term Recovery Prospects Uncertain The cloud overhanging XRP&#8217;s recovery prospects in the near term points to a cautious and possibly pessimistic mood. Because of the invalidated bullish settings, investors need to reevaluate their expectations and may become more cautious as they wait for more definite signs and proof of rekindled trust in the asset. XRP market dominance. Source: TradingView All things considered, the analysis suggests that the unanticipated price dynamics seen in XRP have resulted in a period of adjustment and uncertainty. What About Market Dominance? Meanwhile, since November, XRP&#8217;s market dominance has decreased; at 2.07%, it is currently trading below that level. The long/short ratio, which is at 0.9771, indicates that there has been a discernible battle between bullish and bearish traders recently, particularly around the $0.6 level. Currently, over 50% of holdings anticipate a bearish move, while 49% anticipate a price increase for XRP. Featured image from Pixabay"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-05T10:54:12.000Z",
    "title": "tDOT: The Future of Polkadot Staking and Liquidity",
    "url": "https://www.crypto-news-flash.com/tdot-the-future-of-polkadot-staking-and-liquidity/?utm_source=rss&utm_medium=rss&utm_campaign=tdot-the-future-of-polkadot-staking-and-liquidity",
    "description": "<img width=\"1934\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot.jpeg 1934w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot-300x168.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot-1200x670.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot-768x429.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot-1536x858.jpeg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot-150x84.jpeg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/tdot-450x251.jpeg 450w\" sizes=\"(max-width: 1934px) 100vw, 1934px\" />tDOT is pegged against Polkadot&#8217;s native token DOT and generates sustainable yield from multiple sources including derivatives and protocol fees, and is easy and simple to use. It already boasts close to $10 million in total value locked and over $60 million in cumulative trading, and with its StableAsset architecture, offers extremely low slippage. The [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-05T11:09:13.000Z",
    "title": "Bitcoin Price To Go Down? Expert Raises Concerns Amid ETF Expectations",
    "url": "https://coinedition.com/bitcoin-price-to-go-down-expert-raises-concerns-amid-etf-expectations/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"If Bitcoin Halving History Repeats, BTC Could Be Near the Bottom\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Historically_BTC_tends_to_bottom_517_547_days_prior_to_the_next-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Markus Thielen from Matrixport expressed concerns about the current state of the Bitcoin market, particularly concerning the U.S. Securities and Exchange Commission’s (SEC) decision on a Bitcoin ETF. Matrixport, one of the world’s largest digital asset platforms, shared a recent interview between Thielen and CoinDesk Podcast, highlighting Bitcoin’s recent price movements as the market anticipates [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-price-to-go-down-expert-raises-concerns-amid-etf-expectations/\">Bitcoin Price To Go Down? Expert Raises Concerns Amid ETF Expectations</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-05T10:40:27.000Z",
    "title": "SBF Avoids Double Trial; FTX Claws Back Millions in Settlements",
    "url": "https://coinedition.com/sbf-avoids-double-trial-ftx-claws-back-millions-in-settlements/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Heres-how-it-all-went-wrong-for-SBF-and-FTX-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Following a decision by the Department of Justice (DoJ) prosecutors, it is certain that troubled crypto founder Sam Bankman-Fried (SBF) will not go to a second trial concerning his central role in the collapse of bankrupt crypto exchange FTX.&#160; While a second trial was expected to happen in March this year, prosecutors handling the case [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sbf-avoids-double-trial-ftx-claws-back-millions-in-settlements/\">SBF Avoids Double Trial; FTX Claws Back Millions in Settlements</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]