[
  {
    "source": "Decrypt",
    "date": "2023-07-06T20:18:05.000Z",
    "title": "Institutions Are Holding More Bitcoin Than Ever Before, Says Ark Invest",
    "url": "https://decrypt.co/147570/institutions-are-holding-more-bitcoin-than-ever-before-says-ark-invest",
    "description": "Bitcoin balances on over-the-counter trading desks, which Ark Invests uses as a proxy for institutions, is up 60% over the last quarter."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T20:21:00.000Z",
    "title": "Bitcoin mining stocks outperform BTC in 2023, but on-chain data points to a potential stall ",
    "url": "https://cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/ca8c827d-577d-4d92-a6a1-1ffb89e105fb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin mining stocks have been on a triple-digit-tear in 2023, but an uptick in BTC sent to exchanges hints at waning momentum.</p>\n                    <p><p>Bitcoin mining companies outperformed <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> price by a huge margin amid the recent bullish price action in the top cryptocurrency.</p><p>The average year-to-date gains in 2023 across the stocks of top nine public Bitcoin mining firms by market capitalization stood at 257.14%. The figure is almost three times higher than <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>’s gain in the same period.</p><p>The higher gains represent the <a href=\"https://cointelegraph.com/news/ripe-for-the-squeeze-bitcoin-mining-stocks-remain-under-attack-from-short-sellers\">leveraged beta effect</a> that mining stocks enjoy. Leveraged beta suggests that during Bitcoin upside, these stocks outperform. Whereas, when Bitcoin slumps, they face deeper downside risk.</p><p>Due to a high levered beta, Bitcoin’s price performance will remain a crucial factor in determining the direction of mining stocks. </p><p>The trends within the mining sector show that miners are positioning themselves for the long-term by buying more machines. However, they have yet to exhibit accumulation levels that match previous bull markets, suggesting that the uptrend in the stocks could stall in the medium term.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/475c2664-e7cd-4b22-8838-2e5bf9bcbe66.JPG\"  /><figcaption style=\"text-align: center;\"><em>Performance of listed Bitcoin mining stocks.</em></figcaption></figure><p>Multiple mining companies made expansion moves in the past month which added to the positive sentiments and long-term value of the stocks. At the same time, the mining conditions improved with a dip in hashrate and price increase.</p><p>However, on-chain data shows miners <a href=\"https://cointelegraph.com/news/bitcoin-on-chain-data-shows-miners-offloading-btc-as-revenues-shrink\">unloaded a significant portion</a> of their holdings, which could be a sign of a downturn in the near future.</p><h2>Mining companies make expansive moves </h2><p>The public companies in the U.S. made aggressive moves in June, signalling long-term strength in the industry.</p><p>Hut 8 Mining Corp. (HUT8) merger with US Bitcoin Corp (USBTC) increased its total hashrate to 9.8 EH/s, making it the third largest public mining entity in the U.S. However, it also took a debt of <a href=\"https://www.prnewswire.com/news-releases/hut-8-announces-us50-million-credit-facility-301861407.html\" target=\"_blank\" rel=\"noopener nofollow\">$50 million</a> from Coinbase. </p><p>Cleanspark (CLSK) invested $9.3 million to increase its hashrate by almost 1 EH/s. </p><p>At the same time, Riot Blockchain (RIOT) entered into a $170 million deal with mining hardware manufacturer MicroBT to nearly double its hashrate capacity by 2024 upon full deployment. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3049f9bf-6ab6-4586-8450-5fe7ae773b5f.JPG\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin holdings of public mining companies. Source: Mining Mag</em></figcaption></figure><h2>Mining stocks are prepped for a short squeeze</h2><p>Marathon Digital Holdings is one of the <a href=\"https://finance.yahoo.com/screener/predefined/most_shorted_stocks/?count=25&amp;offset=0\" target=\"_blank\" rel=\"noopener nofollow\">most shorted stocks</a> on Nasdaq with 25.06% of its float shares shorted, per data from <a href=\"https://fintel.io/ss/us/mara\" target=\"_blank\" rel=\"noopener nofollow\">Fintel</a>. For reference, values above 10% are considered heavily shorted. </p><p>Similarly, Riot Platform’s 14.54% of float shares are shorted—an increase from 13.48% in May and Cipher Mining at 22.32%. </p><p>While the rest have between 5% to 10% of their floating shares shorted, representing a relatively neutral market stance.</p><p>The increased short interest in MARA, RIOT and CIFR could be due to excessive <a href=\"https://cointelegraph.com/news/bitcoin-price-is-up-but-btc-mining-stocks-could-remain-vulnerable-throughout-2023\">debt and stock dilution</a>, which negatively affects the profitability of existing shareholders. </p><h2>Mining profits improve, but miners are selling</h2><p>The one-hop supply metric from Coin Metrics, representing the holdings of wallets that received coins from mining pools, shows that these addresses have reduced their holdings near a one-year low.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/298ff3ca-29d0-406e-87e6-3973889c90ac.JPG\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin miner one-hop supply. Source: Coin Metrics</em></figcaption></figure><p>Glassnode data also recorded a significant volume of miner coins transferred to exchanges. The exchange inflows surpassed even the levels seen during the bull market of 2021.</p><p><a href=\"https://twitter.com/glassnode/status/1673635113261756416\" target=\"_blank\" rel=\"noopener nofollow\">https://twitter.com/glassnode/status/1673635113261756416</a></p><p>Moreover, the miner holdings are still near a two-year low, which is likely due to <a href=\"https://cointelegraph.com/news/not-just-bitcoin-price-factors-affecting-btc-miner-profitability\">low profitability</a> for the most part of 2023. </p><p>The network’s total hashrate reached a new all-time high at the start of June, however, it has been dropping amid heatwaves in Texas. The dropping hashrate and increase in Bitcoin’s <a href=\"https://cointelegraph.com/news/bitcoin-price-taps-30-k-first-time-since-april\">price above $30,000</a> is contributing toward increasing the profitability of running miners. </p><p>The production cost of the most used mining model Antminer S19 ranges between $20,000 to $25,000 depending on electricity cost. </p><p>Notably, companies with mining farms in Texas such as Riot Blockchain can incur some losses due to the climate. However, it is likely that the company would have taken steps to hedge the heatwave risks as it is not the first time.</p><p>Related: <a href=\"https://cointelegraph.com/news/riot-blockchain-s-bitcoin-mining-productivity-dropped-28-yoy-amid-record-texas-heat\"><strong><em>Riot Blockchain's Bitcoin mining productivity dropped 28% YOY amid record Texas heat</em></strong></a></p><p>Nevertheless, despite the improvement in profitability, miners are unloading Bitcoins, potentially a sign of future negative price action. </p><p>While revenue improved in June, miners have continued to spend on expansion and operation costs, which suggests that a crypto bull market has yet to start. </p><p>The expansion plans of companies and decline in on-chain miner holdings project medium-term sideways price action or a potential correction in mining stocks if BTC price drops.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T20:10:39.000Z",
    "title": "Binance urges Dutch customers to move assets to Coinmerce before July 17 departure from the Netherlands",
    "url": "https://cryptoslate.com/binance-urges-dutch-customers-to-move-assets-to-coinmerce-before-july-17-departure-from-the-netherlands/",
    "description": "<p>Binance is shuttering operations in the Netherlands after failing to secure a virtual asset provider license from the Dutch central bank. As part of its exit, Binance has offered to move users&#8217; assets for free to rival crypto exchange Coinmerce, which has secured regulatory authorization to operate in the country. The exchange will cease all [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-urges-dutch-customers-to-move-assets-to-coinmerce-before-july-17-departure-from-the-netherlands/\">Binance urges Dutch customers to move assets to Coinmerce before July 17 departure from the Netherlands</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T20:34:45.000Z",
    "title": "Elon Musk threatens to sue Mark Zuckerberg over Threads",
    "url": "https://www.cryptopolitan.com/musk-threatens-to-sue-zuck-over-threads/",
    "description": "The social media battleground is ablaze as Twitter&#8217;s maverick owner, Elon Musk, sets his legal crosshairs on Meta&#8217;s Mark Zuckerberg over the creation of a new app &#8211; Threads. In less than a day from its launch, Threads, a text-based platform echoing Twitter&#8217;s design, found itself embroiled in a fiery intellectual property dispute with the ... <a title=\"Elon Musk threatens to sue Mark Zuckerberg over Threads\" class=\"read-more\" href=\"https://www.cryptopolitan.com/musk-threatens-to-sue-zuck-over-threads/\" aria-label=\"More on Elon Musk threatens to sue Mark Zuckerberg over Threads\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T20:32:33.000Z",
    "title": "Bitcoin miners earn big as BRC-20 tokens boost transaction fees",
    "url": "https://www.cryptopolitan.com/bitcoin-miners-earn-big-as-brc-20-fees/",
    "description": "Bitcoin miners have experienced a significant increase in funds from transaction fees in the past quarter, generating a multimillion-dollar windfall driven by the popularity of BRC-20 tokens and the introduction of Ordinals, according to Coin Metrics. BRC-20 tokens boost Bitcoin miner&#8217;s revenue In its latest “State of the Network” report, the crypto analytics firm revealed ... <a title=\"Bitcoin miners earn big as BRC-20 tokens boost transaction fees\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-miners-earn-big-as-brc-20-fees/\" aria-label=\"More on Bitcoin miners earn big as BRC-20 tokens boost transaction fees\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T20:22:17.000Z",
    "title": "MasterCard empowers UK banks to combat payment fraud with AI-powered solution",
    "url": "https://www.cryptopolitan.com/mastercard-empowers-uk-banks-to-combat-payment-fraud-with-ai-powered-solution/",
    "description": "Financial services provider Mastercard is leading the charge against payment fraud and scams with its AI-powered tool called &#8220;Consumer Fraud Risk.&#8221; The solution, now live in the UK, leverages Mastercard&#8217;s latest AI capabilities and its unique network view of account-to-account payments to help banks predict and prevent various types of scams. According to an announcement, ... <a title=\"MasterCard empowers UK banks to combat payment fraud with AI-powered solution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mastercard-empowers-uk-banks-to-combat-payment-fraud-with-ai-powered-solution/\" aria-label=\"More on MasterCard empowers UK banks to combat payment fraud with AI-powered solution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T20:18:48.000Z",
    "title": "ANZ bank is moving away from cash in attempts to go fully digital",
    "url": "https://www.cryptopolitan.com/anz-moving-from-cash-attempts-to-go-digital/",
    "description": "Navigating the digital transformation, ANZ, one of Australia&#8217;s top banking institutions, is shifting towards a cashless future. This strategic move has been highlighted by a dramatic reduction in over-the-counter cash withdrawals at many of its branches. The decision, controversial in nature, has stimulated quite a buzz, as customers grapple with the rapidly advancing financial technology ... <a title=\"ANZ bank is moving away from cash in attempts to go fully digital\" class=\"read-more\" href=\"https://www.cryptopolitan.com/anz-moving-from-cash-attempts-to-go-digital/\" aria-label=\"More on ANZ bank is moving away from cash in attempts to go fully digital\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-06T20:14:15.000Z",
    "title": "Blur v2 slashes gas fees by 50%, adds trait bidding feature",
    "url": "https://crypto.news/blur-v2-slashes-gas-fees-by-50-adds-trait-bidding-feature/",
    "description": "Blur v2 will reduce gas fees by 50% and introduce trait bidding"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T20:30:00.000Z",
    "title": "UAE Share In Global Mining Activity Grows, Accounts For 3.7% Of Mined Bitcoin",
    "url": "https://www.newsbtc.com/bitcoin-news/uae-accounts-for-3-7-of-mined-bitcoin/",
    "description": "According to the latest report by Hashrate Index, a website for Bitcoin mining data and metrics, the UAE is now becoming a growing destination for Bitcoin miners, especially in the Middle East.  Bitcoin Miners Look For Greener Pastures Bitcoin miners have faced issues in popular Bitcoin mining countries like China and Kazakhstan in recent years. As a result, many of these miners have been forced to look for new operational hubs.  Related Reading: Analyst Says XRP Will Reach $100, Here’s Why Mining Bitcoin is a difficult process, both financially and in terms of the amount of electricity required. It involves using powerful computers to solve complex math problems in order to get rewarded with BTC. This energy requirement is part of the reason why miners have run into problems in various jurisdictions over the years. However, the Middle East is now emerging as a prime destination for Bitcoin miners, and the UAE is leading the charge among these energy-rich countries. The United Arab Emirates is helping to pave the path for the future of Bitcoin mining with its increased availability of affordable electricity, favorable access to funding, and politically stable and business-friendly climate. During the past year-and-a-half, some major mining companies signed agreements and entered partnerships with the digital asset arm of Abu Dhabi&#8217;s sovereign wealth fund (Zero Two) to create two giga projects that put the UAE on the global bitcoin mining map. As a result, the biggest amount was spent on a single Bitcoin mining site, with an investment totaling $2 billion. Now, it seems these large-scale projects are starting to cement the UAE as a serious player in the Bitcoin mining niche. According to the data provided by the Hashrate Index, bitcoin miners in the UAE should produce approximately 13 EH/s, which is equivalent to 3.7% of the total Bitcoin hash rate at an assumed average energy efficiency of 30 J/TH.  BTC price recovers from Thursday crash &#124; Source: BTCUSD on TradingView.com UAE Aims To Become A Global Crypto Hub The UAE government aims to establish the country as a global hub for cryptocurrency and blockchain innovation. Several recent initiatives show the country is serious about becoming a leader in this emerging industry. With government backing, relaxed rules, and major companies setting up offices, the building blocks are in place.  Earlier this year, the country announced that it is launching a ‘free zone’ for crypto firms called the RAK Digital Assets Oasis (RAK DAO), allowing them to own 100% of their companies.  Related Reading: Ethereum Whale Transactions Jump Over 50% As ETH Eyes $2,000 The future looks bright for Bitcoin mining in the UAE. The country&#8217;s share in the global Bitcoin mining metric should continue to grow as more mining firms are drawn to the region. However, considering the hot climate of the region when compared to big Bitcoin mining regions like Texas and Russia, the temperature could be challenging for mining.  Also, the report shows that the only way to mine Bitcoin in a scalable and legally sustainable way in the country is by partnering with a government entity. Featured image from iStock, chart from TradingView.com"
  }
]