[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T02:51:54.000Z",
    "title": "Tornado Cash indictment fails to show 'clear violation' of certain laws: Coin Center",
    "url": "https://cointelegraph.com/news/tornado-cash-indictment-in-conflict-with-fincen-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4013a498-9459-4181-a01a-fdfa7931243c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coin Center research director Peter Van Valkenburgh argued that crypto mixer Tornado Cash is an anonymizing software provider, not a money transmitter.</p>\n                    <p><p>Crypto advocacy group Coin Center has criticized the latest indictment of two former Tornado Cash developers, arguing that the facts offered don't show any clear violations of money-transmitting-related offenses.</p><p>Roman Storm and Romen Semenov were indicted by the United States Office of Foreign Asset Control (OFAC) on Aug. 23 for conspiring to operate an <a href=\"https://cointelegraph.com/news/tornado-cash-co-founders-charged-with-money-laundering-sanctions-violations-ofac\">unlicensed money-transmitting business</a>, among other charges.</p><p>In a follow-up <a href=\"https://www.coincenter.org/new-tornado-cash-indictments-seem-to-run-counter-to-fincen-guidance/\" target=\"_blank\" rel=\"noopener nofollow\">opinion</a> piece, Coin Center research director Peter Van Valkenburgh argues that the claims in the indictment appear to run counter to guidance from the U.S. Financial Crimes Enforcement Network — arguing that Tornado Cash only provides the software to transmit money, rather than transmitting the money itself.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New Tornado Cash indictments seem to run counter to FinCEN guidance<br><br>Coin Center’s initial thoughts on a case that could potentially criminalize the publication of software code<a href=\"https://t.co/YCBv3vsZAE\">https://t.co/YCBv3vsZAE</a></p>&mdash; Neeraj K Agrawal (@NeerajKA) <a href=\"https://twitter.com/NeerajKA/status/1694465261393555546?ref_src=twsrc%5Etfw\">August 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>\"The only thing the indictment claims regarding the defendants’ unlicensed money transmission is that they 'engaged in the business of transferring funds on behalf of the public' and did so without registering with FinCEN,\" wrote Valkenburgh.</p><blockquote>But does the indictment state any facts that actually show that the defendants engaged in any activities that qualify as money transmission under the relevant law?</blockquote><p>He pointed to an interpretation by FinCEN as to what constitutes “money transmission services” under the U.S. Bank Secrecy Act, which states:</p><p>“An anonymizing software provider is not a<a href=\"https://www.coincenter.org/the-need-for-a-federal-alternative-to-state-money-transmission-licensing/\" target=\"_blank\" rel=\"noopener nofollow\"> money transmitter</a>.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4df7e61b-b782-4df2-91c7-6e21fbfb0ff9.png\"  /><figcaption style=\"text-align: center;\"><em>An excerpt from FinCEN’s Virtual Currency Guidance from 2019. Source: FinCEN.</em></figcaption></figure><p>Valkenburgh then referred to another excerpt stating that only people using the software can be considered money transmitters:</p><blockquote>“[A] person that utilizes the software to anonymize the person’s own transactions will be either a user or a money transmitter, depending on the purpose of each transaction.”</blockquote><p>While Valkenburgh said that Tornado Cash made it easier for individuals to use the protocol’s smart contracts to transmit money, he argued it doesn’t mean that the developers were money transmitters themselves. </p><p>“[But] that doesn’t somehow mean that they became transmitters merely because they provided tools that others used to transmit their own money,” Valkenburgh explained. </p><p>Valkenburgh also criticized claims in the indictment suggesting that Storm and Semenov had complete control over the protocol’s smart contracts.</p><p>“Ethereum smart contracts are variable and sometimes people have no control over their operation, some control, or total control. This is the key fact needed to determine whether one is performing money transmission, he argued.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-association-remove-tornado-cash-sanctions\"><strong><em>Crypto lobbyists still fighting to axe ‘unlawful’ Tornado Cash sanctions </em></strong></a></p><p>Coin Center first voiced its opposition toward the U.S. Treasury in October when it sued the agency for its <a href=\"https://cointelegraph.com/news/coin-center-files-lawsuit-against-us-treasury-over-tornado-cash-sanctions\">unprecedented and unlawful sanctioning</a> of Tornado Cash.</p><p>The OFAC indictment claims Storm and Semenov ran an <a href=\"https://www.coincenter.org/education/policy-and-regulation/does-18-u-s-c-%c2%a7-1960-create-felony-liability-for-bitcoin-businesses/\" target=\"_blank\" rel=\"noopener nofollow\">unlicensed money transmission</a> service by engaging in the business of transferring funds on behalf of the public. The enforcement agency claimed the developers should have registered with FinCEN.</p><p>Semenov was added to OFAC’s list of Specially Designated Nationals and Blocked Persons on Aug. 23, while Storm was arrested by the Federal Bureau of Investigation in Washington state on the same day.</p><p>Alexey Pertsev, another one of Tornado Cash’s founders, was imprisoned by <a href=\"https://cointelegraph.com/news/ruling-to-keep-tornado-cash-developer-in-jail-for-90-days-sparks-backlash\">Dutch authorities in Aug. 2022</a> before being <a href=\"https://cointelegraph.com/news/tornado-cash-dev-alex-pertsev-set-to-be-released-from-prison-under-surveillance\">released in late April.</a></p><p>Valkenburgh believes the outcome of the Tornado Cash saga will have a profound impact on the legal rights of United States citizens to build and publish software in the future.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Magazine: Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T03:00:55.000Z",
    "title": "Betrayal In Blue: Former NJ Officer Charged With Crypto Fraud",
    "url": "https://www.newsbtc.com/news/betrayal-in-blue-former-nj-officer-charged-with-crypto-fraud/",
    "description": "In a major development, the US Securities and Exchange Commission (SEC) has charged former New Jersey State Correctional Police Officer, John A. DeSalvo, for allegedly orchestrating a fraudulent crypto fraud scheme that specifically targeted law enforcement personnel.  DeSalvo stands accused of raising funds through the unregistered offering of the Blazar Token, a crypto asset he created, which eventually collapsed in May 2022.  The SEC&#8217;s complaint further alleges misappropriation of investor funds, including diverting substantial amounts to his crypto asset wallets and using them for personal expenses, such as a bathroom renovation. Crypto Scam Targeting Cops? According to the SEC, DeSalvo managed to raise a minimum of $620,000 from around 220 investors between the launch of the Blazar Token in November 2021 and its subsequent collapse.  The complaint reveals that DeSalvo made “false claims” to investors, stating that the Blazar Token was registered with the SEC and that it would replace existing state pension systems. He further “deceived” investors by falsely assuring them that automatic payroll deductions would facilitate their investment and guarantee extraordinary returns.  Related Reading: Solana In Turbulence: Analyzing The Death Cross And What Lies Ahead Ultimately, DeSalvo allegedly misused and misappropriated the funds entrusted to him. Notably, the SEC&#8217;s complaint highlights DeSalvo&#8217;s deliberate targeting of fellow law enforcement and first responders in his fraudulent schemes. In addition to the Blazar Token scheme, the SEC&#8217;s complaint also exposes an earlier fraud initiated by DeSalvo. Beginning in late January 2021, he allegedly solicited investors, primarily through social media, for an investment venture that involved trading stocks, options, and crypto asset securities.  Within weeks of raising $95,000 from 17 investors, DeSalvo reportedly lost a significant portion of the funds through speculative investments and misappropriated the rest. He proceeded to inform investors that poor market conditions led to the complete devaluation of the securities. SEC Accuses Former Officer Of Exploiting Trust Gurbir S. Grewal, Director of the SEC&#8217;s Division of Enforcement, condemned DeSalvo&#8217;s actions, stating:  We allege that DeSalvo orchestrated several fraudulent investment schemes that targeted law enforcement personnel and promised astronomical returns, including one involving a crypto asset security that would somehow replace traditional state pension systems. Rather than producing any returns or revolutionary technology, he instead misappropriated and misused investor money. Grewal further emphasized the breach of trust perpetrated by DeSalvo, who “exploited” his former position as a corrections officer to gain the confidence of fellow law enforcement professionals, many of whom invested their “hard-earned” savings with him. Related Reading: Bitcoin Exchange Reserve Shoots Up, Pain Not Over Yet? The SEC&#8217;s complaint, filed in the U.S. District Court for the District of New Jersey, charges DeSalvo with violating antifraud and offering registration provisions of the securities laws. The SEC seeks injunctive relief, disgorgement of ill-gotten gains with prejudgment interest, and imposition of civil penalties. Simultaneously, the U.S. Attorney&#8217;s Office for the District of New Jersey has announced criminal charges against DeSalvo, further underscoring the severity of the allegations and the commitment to holding him accountable for his actions. At the time of writing, Bitcoin (BTC) maintains its upward trajectory in price, currently trading at $26,700, reflecting a notable increase of over 3% within the past 24 hours. Featured image from iStock, chart from TradingView.com"
  }
]