[
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T01:29:35.000Z",
    "title": "MicroStrategy returns to profit and now owns $4.4B worth of Bitcoin",
    "url": "https://cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5b2812ed-1e5d-4808-b85a-407f66aace44.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Michael Saylor-founded MicroStrategy disclosed it now holds 12,800 Bitcoin as of July 30, and is back in the black.</p>\n                    <p><p>Business intelligence firm MicroStrategy — one of the largest corporate holders of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in the United States — managed to return to profitability in the second quarter amid a surge in the price of Bitcoin.</p><p>In a Q2 earnings results <a href=\"https://www.microstrategy.com/en/investor-relations/press/microstrategy-announces-second-quarter-2023-financial-results_08-01-2023\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> posted on Aug. 1, MicroStrategy reported $22.2 million in net income, a massive swing from a net loss of $1.1 billion in the prior-year period. Total revenues were mostly flat at $120.4 million. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In July, <a href=\"https://twitter.com/MicroStrategy?ref_src=twsrc%5Etfw\">@MicroStrategy</a> acquired an additional 467 BTC for $14.4 million and now holds 152,800 BTC. Please join us at 5pm ET as we discuss our Q2 2023 financial results and answer questions about the outlook for <a href=\"https://twitter.com/hashtag/BusinessIntelligence?src=hash&amp;ref_src=twsrc%5Etfw\">#BusinessIntelligence</a> and <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>.  <a href=\"https://twitter.com/search?q=%24MSTR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$MSTR</a> <a href=\"https://t.co/SCHeBJ80TH\">https://t.co/SCHeBJ80TH</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1686468084574412800?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Much of the swing was due to a comparatively smaller digital asset impairment loss of $24.1 million in the quarter, compared to a whopping $917.8 million in Q2 2022.</p><p>In MicroStrategy’s case, digital asset impairment occurs when the market price of Bitcoin falls below the price at which the Bitcoin was acquired. </p><p>The price of Bitcoin hovered between $25,000 and $30,700 in the second quarter, with a notable rally in mid-June after several new spot Bitcoin exchange-traded funds were filed to the Securities and Exchange Commission. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/84433222-96ec-485b-9c14-c95ceb2c8a13.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price over the last three months. Source: Cointelegraph Markets Pro</em></figcaption></figure><p>“Our bitcoin holdings increased to 152,800 bitcoins as of July 31, 2023, with the addition in the second quarter of 12,333 bitcoins being the largest increase in a single quarter since Q2 2021,” said MicroStrategy CFO Andrew Kang.</p><p>Kang said it used cash from operations to add more Bitcoin to its balance sheet, and did so against the “promising backdrop” of institutional interest, <a href=\"https://cointelegraph.com/news/michael-saylor-welcomes-fasb-vote-to-review-crypto-accounting-standards\">accounting transparency</a> and increasing regulatory clarity for Bitcoin. </p><p>In a June 13 interview with Bloomberg, MicroStrategy chairman Michael Saylor said he believes recent enforcement actions from the Securities and Exchange Commission would eventually play out in favor of Bitcoin — the only crypto <a href=\"https://cointelegraph.com/news/crypto-lawyers-flame-gensler-over-claims-that-all-crypto-are-securities\">excluded from being a security</a> by SEC Chair <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/gary-gensler\">Gary Gensler</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is clarity in a sea of Crypto chaos.  <a href=\"https://t.co/4MMpZS3Bd0\">pic.twitter.com/4MMpZS3Bd0</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1686438810312200206?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The company acquired 12,333 Bitcoin for $347 million in the quarter. As of July 30, the firm bought another 467 BTC, meaning its total Bitcoin balance is worth $4.5 billion at current prices. </p><p>In a separate filing to the SEC, also <a href=\"https://www.sec.gov/Archives/edgar/data/1050446/000119312523200621/d533407d424b5.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on Aug. 1, the company revealed it is also planning to sell up to $750 million in stocks for the acquisition of Bitcoin and other general corporate purposes.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/micro-strategy-buys-347m-worth-of-bitcoin-amid-market-thaw\"><strong><em>MicroStrategy buys $347M worth of Bitcoin amid market thaw</em></strong></a></p><p>The price of Bitcoin has <a href=\"https://cointelegraph.com/news/crypto-community-barbie-star-bitcoin-ken-energy\">continued to creep upwards</a> over 2023, surging 79% since the start of the year. It is currently trading at $29,206.80, according to Google Finance. </p><p>MicroStrategy’s share price has also witnessed a resurgence per Google Finance, starting at $145.02 per share on Jan. 3, and rising nearly 200% to $434.98 at the time of writing. </p><p>In July, analysts from New York-based investment firm Berenberg Capital posted a bullish outlook for MicroStrategy, noting that the upcoming Bitcoin halving rally could <a href=\"https://cointelegraph.com/news/bitcoin-halving-bullish-microstrategy-michael-saylor\">see its shares gain significantly</a> in price.</p><p><strong><em>Hall of Flame: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T01:30:48.000Z",
    "title": "Robert Kiyosaki Warns US Economy Not Strong, America Broke — Says He Still Prefers Bitcoin",
    "url": "https://news.bitcoin.com/robert-kiyosaki-warns-us-economy-not-strong-america-broke-says-he-still-prefers-bitcoin/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Robert Kiyosaki Says US Economy Is Not Strong, America Is Broke — Still Recommends Bitcoin\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/kiyosaki-america-broke.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Rich Dad Poor Dad author Robert Kiyosaki says the U.S. economy is not strong and America is broke. Noting that the stock market is going up because President Joe Biden raised the debt ceiling, he emphasized that he still prefers gold, silver, and bitcoin. Robert Kiyosaki’s Latest Economic Warnings The author of Rich Dad Poor [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T01:09:33.000Z",
    "title": "Over $28 Million In SHIB Withdrawn From Exchanges Ahead Of Shibarium Launch",
    "url": "https://www.newsbtc.com/shiba-inu/over-28-million-in-shib-withdrawn/",
    "description": "The Shibarium Layer-2 upgrade is launching any day now, and it looks like some big SHIB players are making moves ahead of the launch. According to on-chain data, over $28 million in SHIB tokens have been withdrawn from major crypto exchanges in the just concluded month of July.  Massive Withdrawals Signal Investor Interest in Shibarium According to data shared on Twitter by crypto analyst Ali Martinez, backed up by on-chain chart data from IntoTheBlock, around 3.30 trillion SHIB were withdrawn from known crypto exchanges in July, the highest SHIB withdrawal rate in recent months. The chart’s data also shows that the circulating supply of the token within exchanges fell from 86.69 trillion to around 83 trillion by the end of the month. Related Reading: USDT Issuer Tether Reports A 30% Decline In Profit July 19 saw the most significant withdrawal from exchanges, with more than two trillion tokens going into unknown wallets. According to on-chain data from @WhaleAlert, an Ethereum whale transferred 2.4 trillion SHIB tokens worth $18.7 million from Binance.US into an unknown wallet. With the price of the token up by 10% since then, the whale&#8217;s SHIB holding is now valued at more than $20 million.  These massive SHIB withdrawals can be traced to the announcement of the Layer 2 blockchain, Shibarium, which is expected to help minimize gas fees and increase the transaction speeds of the blockchain. Token price falls to $0.00000821 &#124; Source: SHIBUSD on Tradingview.com While there&#8217;s still no official launch date for Shibarium yet, the high rate of withdrawals likely signals that SHIB investors are reducing the selling pressure and want to hold their tokens in private wallets in hopes of what the Shibarium launch might bring.  Withdrawals From Exchanges Reduces Selling Pressure On SHIB When SHIB is withdrawn from exchanges, it can’t be readily sold. This reduces the available supply of SHIB for sale, putting upward pressure on the price. When whales transfer such high amounts into self-custody, it frequently results in massive price changes and a rise in interest from other investors. This flurry of withdrawal into self-custody demonstrates the strength of the SHIB community and their faith in SHIB’s future. Related Reading: Is It A Good Idea To Buy Curve Now? Here’s What This Founder Thinks The meme-inspired token has gained quite a lot of community and has led the entire crypto industry in gains for the past two weeks. Shibarium’s launch is anticipated and SHIB holders want to make sure they capitalize on everything the new scaling solution will offer.  At the time of writing, SHIB&#8217;s market cap is nearing $5 billion after it recently retook the 14th position by market cap. The meme coin is trading at $0.000008314 and is up by 7.55% in the past seven days. Featured image from iStock, chart from Tradingview.com"
  }
]