[
  {
    "source": "Cointelegraph",
    "date": "2023-12-01T05:20:36.000Z",
    "title": " Australia’s confusing new crypto tax guidance is ‘toilet paper,’ says law firm ",
    "url": "https://cointelegraph.com/news/australia-ato-crypto-defi-tax-guidance-is-toilet-paper",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjI5NTcyMGQtNjU2My00YjIzLWFmZTQtY2JlNjdmYjI4OTI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>“I am actively telling people they are best ignoring it,” Cadena Legal’s founder tells Cointelegraph after controversial new tax guidance on DeFi was released in November.</p>\n                    <p><p>Australia's controversial new guidelines for cryptocurrency taxation should be ignored for being unclear and should probably be seen as “toilet paper,” according to an Australian law firm.</p><p>On Nov. </p><p>In a Nov. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If you hate the ATO&#39;s recent web guidance on crypto, read this:<a href=\"https://t.co/JA5GYsDVFt\">https://t.co/JA5GYsDVFt</a></p>&mdash; Harry Dell  taxpapi.eth (@harrydelltaxlaw) <a href=\"https://twitter.com/harrydelltaxlaw/status/1729098702533595398?ref_src=twsrc%5Etfw\">November 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>The law firm noted there is a lot of confusion about what Australians can do with DeFi without triggering a capital gains tax (CGT). </p><blockquote>“If the ATO released a public ruling, we could all rely on that, but instead we have this non-binding nonsense which makes everyone more confused and will probably reduce willing tax compliance by the Australian crypto community.”</blockquote><p>Dell, who previously worked at the ATO auditor between 2017-2019, said he’s even telling his clients to ignore the rules for the time being:</p><blockquote>“[It] is inciting panic in the Australian crypto community. I am actively telling people they are best ignoring it and get their own advice.”</blockquote><p>One crypto tax pundit, however, warned that ignoring ATO guidelines could be risky, arguing that while they aren’t legally binding rules, an investor may still need to pay a lawyer to fight the ATO should they determine it falls foul of their guidance. </p><p>On Nov. 21, <a href=\"https://cointelegraph.com/news/ato-wont-clarify-australia-crypto-tax-rules\">Cointelegraph attempted to find out from the ATO</a> whether transferring funds via a bridge or staking Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> on a liquid staking protocol such as Lido constituted a capital gains tax event. </p><p><a href=\"https://cointelegraph.com/news/australia-ato-crypto-defi-tax-guidance-is-toilet-paper\">Read more</a></p></p>\n                \n            "
  }
]