[
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T08:52:12.000Z",
    "title": "Fidelity rumored to make “seismic” crypto move soon",
    "url": "https://cryptoslate.com/fidelity-rumored-to-make-seismic-crypto-move-soon/",
    "description": "<p>Fidelity is rumored to be planning a &#8220;seismic move&#8221; in the crypto markets, according to Andrew Parish, co-founder of Arch Public. The asset management firm describes itself as &#8220;crypto-curious,&#8221; having mined Bitcoin since 2014. By 2018 it launched a separate cryptocurrency-dedicated business &#8211; Fidelity Digital Assets (FDA,) which has since received a New York Trust [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fidelity-rumored-to-make-seismic-crypto-move-soon/\">Fidelity rumored to make “seismic” crypto move soon</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T08:52:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. Crypto prices have fallen and the entire crypto market cap has dropped by 18% since April 18, 2023. What does the future hold for Binance Coin? ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T08:50:31.000Z",
    "title": "Hong Kong’s Cyberport becomes hotbed for Web 3.0 innovation, attracts top tech companies",
    "url": "https://www.cryptopolitan.com/hong-kongs-cyberport-becomes-hotbed-for-web-3-0-innovation-attracts-top-tech-companies/",
    "description": "Hong Kong&#8217;s Cyberport, a renowned technological business park backed by the government, has witnessed a staggering surge in the registration of Web3 enterprises over the past year.&#160; In a blog post published on Sunday, Finance Secretary Paul Chan revealed that more than 150 firms had joined the Cyberport ecosystem, although he refrained from disclosing their ... <a title=\"Hong Kong&#8217;s Cyberport becomes hotbed for Web 3.0 innovation, attracts top tech companies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kongs-cyberport-becomes-hotbed-for-web-3-0-innovation-attracts-top-tech-companies/\" aria-label=\"More on Hong Kong&#8217;s Cyberport becomes hotbed for Web 3.0 innovation, attracts top tech companies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T08:49:39.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T08:57:47.000Z",
    "title": "What are Ethscriptions and how they work compared to Bitcoin Ordinals",
    "url": "https://crypto.news/what-are-ethscriptions-and-how-they-work-compared-to-bitcoin-ordinals/",
    "description": "Despite its relatively recent launch, Ethscriptions has shown tremendous acceptance, evoking parallels with Bitcoin&#8217;s Ordinals. The Ethereum (ETH) community, known for its unrelenting pursuit of experimentation and innovation, has a new brainchild—Ethscriptions.  Ethscriptions is the latest protocol stirring interest in&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T08:47:14.000Z",
    "title": "Hong Kong’s Cyberport emerges as thriving hub for web3 companies",
    "url": "https://crypto.news/hong-kongs-cyberport-emerges-as-thriving-hub-for-web3-companies/",
    "description": "Hong Kong&#8217;s Cyberport, the city&#8217;s flagship technology hub, has experienced remarkable growth over the past year, attracting more than 150 companies operating in the web3 space.&#160; According to a June 18 blog post by Hong Kong Financial Secretary Paul Chan,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T08:40:46.000Z",
    "title": "Twitter suspends AI bot as Elon Musk dubs it crypto scam",
    "url": "https://crypto.news/twitter-suspends-ai-bot-as-elon-musk-dubs-it-crypto-scam/",
    "description": "Twitter has suspended the &#8220;Explain This Bob&#8221; account, an AI-based bot with 402k followers. Musk accused the project of being a crypto scam. The Twitter account &#8220;Explain This Bob&#8221; is an AI-powered bot created by Indian developer Prabhu Biswal. &#8220;Explain&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T08:55:31.000Z",
    "title": "Ethereum Cancun Upgrade: Why Arbitrum, Optimism Will Profit Massively",
    "url": "https://www.newsbtc.com/news/ethereum-cancun-upgrade-arbitrum-optimism-will-profit/",
    "description": "The tentatively slated Ethereum upgrade Cancun / Deneb for autumn will be a game-changer for layer-2 rollup technologies such as Arbitrum and Optimism. The basis for this will be the Ethereum Improvement Proposal (EIP) 4844, which will be the main code change of the upgrade, as Christine Kim, vice president in Galaxy Digital&#8217;s research team explained. Last Friday, 15 June, the 111th All Core Developers Consensus (ACDC) call was held. Chaired by Ethereum Foundation Researcher Alex Stokes, participants finalized the final scope of the upgrade. And EIP 4844 (proto-thanksharding) is being implemented. Ethereum: Next Upgrade Is Huge For ARB And OP As Kim writes, EIP 4844 introduces a new transaction type called &#8220;blobs&#8221;. This increases the data and storage requirements of Ethereum blocks and creates a new fee market to value blobs separately from regular transactions. Data blobs are the first milestone for Ethereum&#8217;s full Danksharding, which will allow rollups such as Arbitrum and Optimism a 100-fold increase in capacity. This is realized by allowing nodes to safely process multiple blobs per block than the initial maximum set by EIP 4844. Importantly, EIP 4844 does not improve Ethereum&#8217;s scalability as a general-purpose blockchain for executing transactions and smart contracts, Kim notes. It does not significantly increase or improve the transaction capacity of Ethereum itself. Related Reading: XRP Allegedly Attacked By SEC’s Hinman For Ethereum’s Benefit However, proto-Danksharding reduces the cost of transferring large amounts of data to Ethereum and thus lowers the operating costs of rollups. This is of equal importance, as recent years have seen a surge in transactional activity from rollups such as Arbitrum and Optimism. While Ethereum mainnet transactions per second (TPS) reached a maximum of 20 TPS this year, L2 TPS peaked above 50. Compared to the cost of deploying code and transactions directly on Ethereum, rollups have saved end users and dapp developers over 99% in gas fees. The goal of EIP 4844 is therefore of great importance for scaling Ethereum. Related Reading: Ethereum Plunges Below $1,700, Here’s The Metric That Signaled This In Advance &#8220;Blob blockspace will be auctioned according to its own fee market, modeled after the fee market design of EIP 1559,&#8221; says Kim who emphasizes that there are many parallels to the introduction of blobs on Ethereum and the introduction of segregated witness (segwit) on Bitcoin. However, one of the main differences between segwit and EIP 4844 is the expected long-term impact of these code changes. Arbitrum (ARB) Price At Crucial Resistance In recent weeks, ARB has shown relative strength compared to OP. The ARB price has swept the previous low and now needs to overcome resistance at $1.03 to enter the trading range from May 6 to June 10. If the ARB price fails to do so in the next few days, a price discovery to the downside could be imminent. Otherwise, a rise to mid-range resistance at $1.15 could be on the table. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T09:05:15.000Z",
    "title": "Big for Indonesia: Bitcoin, Ethereum, Polkadot, Uniswap, and Solana Approved for 280 Million People Market with Billion-Dollar Profit Chances",
    "url": "https://www.crypto-news-flash.com/big-for-indonesia-bitcoin-ethereum-polkadot-uniswap-and-solana-approved-for-280-million-people-market-with-billion-dollar-profit-chances/?utm_source=rss&utm_medium=rss&utm_campaign=big-for-indonesia-bitcoin-ethereum-polkadot-uniswap-and-solana-approved-for-280-million-people-market-with-billion-dollar-profit-chances",
    "description": "The Indonesian government authorizes the trading of XRP, Cardano (ADA), and 499 other cryptocurrencies. The list of 501 tradable cryptocurrencies covers tokens recognized as securities by the U.S. SEC. The Indonesian government has released a list of tradable cryptocurrencies, including BTC, ETH, LTC, SOL, ADA, XRP, DOT, SAND, UNI etc., a total of 501 cryptocurrencies, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T09:00:17.000Z",
    "title": "Dogecoin Price Dips 10% in the Last 7 Days As Pikamoon (PIKA) Presale Continues To Gather Momentum",
    "url": "https://www.crypto-news-flash.com/dogecoin-price-dips-10-in-the-last-7-days-as-pikamoon-pika-presale-continues-to-gather-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-price-dips-10-in-the-last-7-days-as-pikamoon-pika-presale-continues-to-gather-momentum",
    "description": "While the majority of Dogecoin&#8217;s popularity can be attributed to Elon Musk, it is no secret that Dogecoin is loved by many because of its alluring potential to rake in massive profits for investors. However, over the past few months, Dogecoin has been in a prolonged downturn that has seen the price of the token [...]"
  }
]