[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T16:55:21.000Z",
    "title": "AFAQ Group Announces the 26th Financial Expo-JFEX",
    "url": "https://www.cryptopolitan.com/afaq-group-announces-the-26th-financial-expo-jfex/",
    "description": "Amman, Jordan – AFAQ Group, a distinguished event organizer, proudly unveils the 26th edition of the Financial Expo and Awards (JFEX), scheduled at Movenpick Hotel, Jordan &#8211; Amman from September 10th to 11th, 2024. Having successfully hosted 24 events in Jordan, the organization eagerly extends. The primary aim is to gather leading minds in Forex, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-06T17:00:38.000Z",
    "title": "Breakout Of The Year? Crypto Analyst Predicts Where NEAR Is Headed Next",
    "url": "https://www.newsbtc.com/news/breakout-of-the-year-crypto-analyst-predicts-where-near-is-headed-next/",
    "description": "The price of Near Protocol’s native token, NEAR, has been on an upward momentum recently, with a crypto analyst projecting further price increases and suggesting that the coin could see a surge to more than $10 soon. Related Reading: Solana Primed For Takeoff? Expert Analysis Points To Buying Opportunity Near Protocol Price Poised For $10 Surge Popular crypto trader and analyst, identified as Bluntz on X (formerly Twitter) has unveiled a major price prediction for NEAR. The analyst disclosed that the price of NEAR is exhibiting historical patterns indicative of a bullish rally, potentially surpassing $10. $near turbo sends here imo pic.twitter.com/4o28UEsfE1 — Bluntz (@Bluntz_Capital) April 3, 2024 Bluntz, a pseudonymous analyst known for his eerily accurate prediction of Bitcoin (BTC) in June 2018, forecasted that the price of BTC would hit a bottom out at $3,200 after reaching an all-time high of $20,000 at the time. True to his foresight, Bitcoin dropped to around the projected price target by December of the same year.  Now, using technical analysis based on the Elliott Wave principle, Bluntz has shared a price chart displaying Near protocol’s potential rally to over $10.  NEAR market cap currently at $7.4 billion. Chart: TradingView.com The Elliott Wave theory, developed by Ralph Nelson Elliott is a technical methodology that analyzes recurrent and long-term price patterns related to persistent changes in investor sentiment and psychology. This technical tool is used to predict the price movements of cryptocurrencies based on greed and fear.  Bluntz provided two charts depicting Near Protocol’s price movements against Tether (USDT) and another against Bitcoin.  In both charts, Near Protocol had undergone a sequence of price fluctuations, moving between green and red zones before exhibiting strong price fundamentals that could potentially propel its price above $10. The crypto analyst has pinpointed a projected timeline for this price surge around mid April, specifically before the 15th. Insights Into NEAR’s Recent Price Movements Over the past month, the price of Near Protocol has been on a steady upward trend, boasting an impressive 26% increase. Moreover, the cryptocurrency’s total market capitalization has risen by over 6%, accompanied by a 25% increase in its 24-hour trading volume.  Related Reading: Trouble Ahead? Binance Coin Futures Market Under Pressure With Negative Funding Rates At the time of writing, Near Protocol is trading at $7.09, reflecting a significant increase of 5.89% in just one day, according to CoinMarketCap. These developments highlight the increasing appeal and demand for the popular token within the dynamic crypto space. Illia Polosukhin, co-founder of Near Protocol has also commended the NEAR team’s consistent efforts in maintaining the cryptocurrency’s steady growth and development over the past few months. Polosukhin noted that due to the team’s dedication, Near Protocol’s capacity has surged by 50%, ensuring a more effective network to serve users.  Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-06T16:55:10.000Z",
    "title": "Ethena Labs Onboards Bitcoin as a Backing Asset for the Crypto Project’s Synthetic Dollar",
    "url": "https://dailyhodl.com/2024/04/06/ethena-labs-onboards-bitcoin-as-a-backing-asset-for-the-crypto-projects-synthetic-dollar/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/04/ethena-labs-onboards-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Synthetic dollar protocol developer Ethena Labs has added Bitcoin (BTC) to the backing of its USDe stablecoin, the firm&#8217;s flagship product. Announcing via the social media platform X, Ethena Labs says that using Bitcoin to back USDe is &#8220;a crucial unlock which will enable USDe to scale significantly&#8221; from its current supply of $2 billion. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/06/ethena-labs-onboards-bitcoin-as-a-backing-asset-for-the-crypto-projects-synthetic-dollar/\">Ethena Labs Onboards Bitcoin as a Backing Asset for the Crypto Project’s Synthetic Dollar</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]