[
  {
    "source": "Cointelegraph",
    "date": "2024-04-02T02:54:30.000Z",
    "title": " 5 crazy April Fools pranks that Crypto X almost fell for ",
    "url": "https://cointelegraph.com/news/crazy-april-fools-jokes-crypto-x-almost-fell-for",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvMjg3NDBkOGMtZmI3Ny00OGNjLWE2OTMtMWI4MTEwNTQ1ODhlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>April Fools Day jokes have been wreaking havoc on token prices and information across social media. </p>\n                    <p><p>From Vitalik Buterin touting “degen communism” to a white paper from the Solana CEO for a token designed to operate through shortwave radio channels, here are some of the most outlandish April Fool’s Day gags that almost tricked Crypto X this year. </p><p>In an April 1 <a href=\"https://twitter.com/aeyakovenko/status/1774794089818689699?s=46&amp;t=MuRujqZUAz3TQE1vmr3c6A\" target=\"_blank\" rel=\"noopener nofollow\">post</a> to X, Solana CEO Anatoly Yakovenko announced the launch of a new Solana-based token called “BunkerCoin” which made light of the oftentimes over-complicated architecture of new cryptocurrencies. </p><p>Yakovenko claimed the new BunkerCoin token operated on “shortwave radio channels” and leveraged several complicated technologies, including ZkProofs, Groth16 proofs and a “Nakamoto-style longest chain rule.”</p><p><a href=\"https://cointelegraph.com/news/crazy-april-fools-jokes-crypto-x-almost-fell-for\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-02T02:58:28.000Z",
    "title": "a16z kicks off third class application for $75 million Speedrun tech and games accelerator",
    "url": "https://cryptobriefing.com/a16z-speedrun-accelerator-third-class-entry/",
    "description": "A16z's Speedrun startup accelerator seeks tech and gaming startups for a 12-week mentorship and up to $750K investment per startup."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-02T02:46:04.000Z",
    "title": "Tether Achieves Important Security Milestone",
    "url": "https://www.cryptoglobe.com/latest/2024/04/tether-achieves-important-security-milestone/",
    "description": "Stablecoin issuer Tether has announced the successful completion of the System Organization Control (SOC) 2 Type 1 audit. According to Tether, this step is integral to reinforcing its commitment to providing a secure and transparent environment for its users, highlighting its role as a frontrunner in the industry. The SOC 2 Type 1 audit, recognized […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-02T03:02:33.000Z",
    "title": "Bitcoin Price Dumped To $66K As Bears Gain Strength, $64K Next?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-dumped-to-66k/",
    "description": "Bitcoin price started another decline from the $70,000 resistance zone. BTC is down over 5% and there was a move below the $67,500 support. Bitcoin price is gaining bearish momentum from the $70,000 resistance zone. The price is trading below $68,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $68,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could extend its decline toward the $64,000 support zone in the near term. Bitcoin Price Turns Red Bitcoin price struggled to settle above the $70,000 resistance zone. BTC reacted to the downside after it broke the $69,200 support zone. There was a sharp move below the $68,500 level. The price even declined below the $67,000 level. Finally, it tested the $66,000 with a bearish angle. A low was formed near $65,992 and the price is now attempting a recovery wave. There was a move above the $66,800 level. The price moved above the 23.6% Fib retracement level of the downward move from the $69,884 swing high to the $65,992 low. However, Bitcoin is now trading below $68,500 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $68,400 on the hourly chart of the BTC/USD. Immediate resistance is near the $68,000 level. It is close to the 50% Fib retracement level of the downward move from the $69,884 swing high to the $65,992 low. The first major resistance could be $68,500 and the trend line. If there is a clear move above the $68,500 resistance zone, the price could start a fresh increase. Source: BTCUSD on TradingView.com In the stated case, the price could rise toward the $70,000 resistance zone in the near term. The next major resistance is near the $71,500 zone. More Losses In BTC? If Bitcoin fails to rise above the $68,000 resistance zone, it could continue to move down. Immediate support on the downside is near the $66,000 level. The first major support is $65,000. The next support sits at $64,000. If there is a close below $64,000, the price could start a drop toward the $62,500 level. Any more losses might send the price toward the $60,500 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $66,000, followed by $65,000. Major Resistance Levels – $68,000, $68,500, and $70,000."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-02T03:00:43.000Z",
    "title": "FTX Founder Sam Bankman-Fried Breaks Silence, Announces Appeal For 25-Year Conviction",
    "url": "https://www.newsbtc.com/ftx/ftx-founder-sam-bankman-fried-breaks-silence-announces-appeal-for-25-year-conviction/",
    "description": "In a recent interview with ABC News, Sam Bankman-Fried (SBF), the co-founder and former CEO of the now-bankrupt cryptocurrency exchange FTX, spoke about his remorse and plans for an appeal following his recent 25-year prison sentence for fraud. FTX Co-Founder Admits Errors Bankman-Fried, currently held at the Metropolitan Detention Center in Brooklyn, shared his reflections on the unfolding events. He admitted to making several &#8220;bad decisions&#8221; in 2022 that led to FTX&#8217;s insolvency. Although he claimed he had never considered his actions illegal, Bankman-Fried acknowledged falling short of the “high ethical standard” he set for himself. Related Reading: Get Ready For A Bitcoin Cash Revolution: Analyst Forecasts Historic Breakout During the sentencing, US District Judge Lewis Kaplan accused Bankman-Fried of perjury and evasiveness during his testimony, criticizing his lack of remorse for the crimes committed. In response, Bankman-Fried affirmed his remorse and expressed empathy for the thousands of customers who suffered financial losses. SBF claimed the following: I&#8217;m haunted, every day, by what was lost. I never intended to hurt anyone or take anyone&#8217;s money. But I was the CEO of FTX, I was responsible for what happened to the company, and when you&#8217;re responsible it doesn&#8217;t matter why it goes bad. I&#8217;d give anything to be able to help repair even part of the damage. I&#8217;m doing what I can from prison, but it&#8217;s deeply frustrating not to be able to do more Bankman-Fried also acknowledged the impact on his co-workers, who reportedly dedicated their lives to FTX, and the charities he supported, whose funding was affected by the company&#8217;s collapse.  The disgraced crypto mogul expressed deep regret for &#8220;throwing away&#8221; what they had worked hard for and expressed a desire to repair at least part of the damage caused. Despite his efforts from prison, Bankman-Fried admitted to feeling frustrated by the limitations on what he could do to rectify the situation. In his statement to the court, Bankman-Fried contended that if he or another FTX employee had remained CEO, customers would have been paid back by now. He attributed the delay in compensation to the company&#8217;s decision not to restart the FTX exchange, which he believed could have created long-term value. Sam Bankman-Fried Claims ‘Unfair’ Trial, Plans Appeal During the interview, Bankman-Fried also raised concerns about the fairness of his trial, specifically calling out Sullivan &#38; Cromwell, the law firm representing FTX&#8217;s new owners.  SBF accused them of colluding with the prosecution and preventing him from accessing key FTX documents shared with the prosecution. Bankman-Fried claimed this had a “detrimental effect” on the entire trial, including media coverage and the defense&#8217;s ability to present evidence in his favor. Responding to Bankman-Fried&#8217;s claims, a spokesperson for Sullivan &#38; Cromwell referred to Judge Kaplan&#8217;s sentencing remarks, highlighting Bankman-Fried&#8217;s perjury on the witness stand and his strategy of blaming lawyers and the bankruptcy process instead of accepting responsibility for his crimes. Related Reading: Forget Bitcoin, Altcoins Are The Winners Of This Cycle, Crypto Analyst Says Looking ahead, Bankman-Fried revealed that his defense team plans to appeal the conviction later this year, primarily based on certain trial testimony that he felt greatly misrepresented the actual events. He also mentioned the importance of introducing “crucial evidence” and presenting key witnesses, which his defense was allegedly not allowed to do during the trial. As Bankman-Fried begins his prison term, he acknowledges the gravity of the situation, having lost everything. While expressing a desire to make a positive difference in the world, he recognizes the limitations of his current circumstances and remains committed to seeking justice through appeals. Featured image from BBC News, chart from TradingView.com"
  }
]