[
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T02:27:00.000Z",
    "title": "‘Strap yourselves in’ — Bull market coming early 2024, say crypto exchange heads",
    "url": "http://cointelegraph.com/news/bull-market-just-getting-started-exchange-execs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5e194d3d-9a8c-4a58-956c-9007f3c5f4cf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The heads of Australia’s largest crypto exchanges say a bull run is coming early next year — others say it’s already arrived.</p>\n                    <p><p>The market has already entered the first phase of a major rally, with the number of people buying crypto trickling upward which is expected to accelerate early next year, say the heads of Australia’s largest crypto exchanges.</p><p>Independent Reserve CEO Adrian Przelozny told Cointelegraph he expects market activity to see an uptick in early 2024 and is hiring to build infrastructure before that happens.</p><p>“We’re just doing everything we can to get ready for a bull market because we know that when the bull market comes, it happens very fast,” he said. “You need to make sure you have the processes, people, and infrastructure in place so when your business triples overnight, you can handle it.”</p><blockquote>“I think the next two years are going to be good. Strap yourselves in.”</blockquote><p>BTC Markets chief Caroline Bowler said market conditions had grown more bullish over the year, with a general recovery that kicked off in January.</p><p>Bowler added while the trajectory of market gains hadn’t exactly been linear, the industry-wide growth in both asset prices and tech applications were reasons to be confident. </p><blockquote>“The current deployment of ‘dry powder,' an influx of new users, and an uptick in trading volumes further support our assessment that we are in the early stages of a bull market.”</blockquote><p>Tommy Honan, Swyftx’s product strategy head, said his exchange had begun to see an uptick in buying activity and is moving quickly to shore up direct debit functionality — a recent pain point for Australia’s crypto scene as <a href=\"https://cointelegraph.com/news/crypto-national-australia-bank-joins-crypto-exchange-boycott-cites-scams\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-national-australia-bank-joins-crypto-exchange-boycott-cites-scams/amp\">Australia’s ‘Big Four’ banks</a> have limited or <a href=\"https://cointelegraph.com/news/binance-australia-debanked-on-short-notice-says-regional-manager\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-australia-debanked-on-short-notice-says-regional-manager/amp\">outright banned deposits to some exchanges</a>. </p><p>Honan ruled out fear of missing out — FOMO — as the reason for the activity uptick, instead highlighting that market fundamentals had become more attractive to investors who took the sideline during the bear market.</p><blockquote>“All our indicators are flashing green at the moment. We’re seeing a significant number of customers come back to the market after periods of inactivity during the bear market. The market is waking up, but the truth is no one knows where we’re at in the cycle.”</blockquote><p>Kraken Australia managing director Jonathon Miller was on the side of caution and said it can be difficult to tell what phase the market is in.</p><p>“There’s a common misconception that the crypto markets are either in a bull market or bear market. In reality, there’s a large gray area between these two,” he said. </p><p>Miller admitted that compared to this time last year, there are plenty of reasons to be optimistic, specifically looking to <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter#:~:text=The%20rate%20at%20which%20new,in%202012%2C%202016%20and%202020.\">next year’s Bitcoin halving</a> and Ethereum’s Dencun upgrade, which he believes is already starting to pique attention from institutional and retail investors</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/australian-crypto-industry-treasury-proposals-step-forward-slow-regulation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/australian-crypto-industry-treasury-proposals-step-forward-slow-regulation/amp\"><strong><em>Australian crypto exchanges look to new licensing regime with cautious optimism</em></strong></a></p><p>“The expanding institutional appetite for crypto assets is often underlooked. Yes, the markets are currently focused on ETF filings for Bitcoin and Ether, but in the last year, we’ve seen a revival of interest from many institutional clients looking for exposure to this emerging asset class,” he added.</p><p>Binance Australia general manager Ben Rose didn’t want to make the call on whether a bull market had arrived but noted new registrations and trading activity on the Australian arm of Binance had increased in recent months. </p><p>Rose said Binance Australia was focused on educating users ahead of a potential rally and ensuring users avoid FOMO buying.</p><p>“We asked a lot of exiting customers about the reasons they got into crypto, and a quarter of them said that seeing others succeed with crypto was the main reason. That’s the single biggest driver. So FOMO in crypto is a real thing,” he explained. </p><p>Rose said the key to retaining users throughout the next potential market surge was ensuring that people didn’t get trampled during a market frenzy. </p><p>“Price is one thing that will unlock interest, but you want people to be able to onboard in a sustainable and responsible way so it’s not just a one-off,” he said. “Sure price might be the reason they first look at crypto, but ultimately they’re in there because they understand the benefits of it and it becomes part of how they manage finances.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-incredible-rags-riches-tale-polygon-sandeep-nailwal/\"><strong><em>Slumdog billionaire — Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  }
]