[
  {
    "source": "CoinDesk",
    "date": "2023-09-26T12:01:00.000Z",
    "title": "First Mover Americas: Coinbase Registers With Central Bank of Spain ",
    "url": "https://www.coindesk.com/markets/2023/09/26/first-mover-americas-coinbase-registers-with-central-bank-of-spain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Sept. 26, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T11:52:40.000Z",
    "title": "Taiwan bans unregistered foreign crypto exchanges from operating ",
    "url": "https://cointelegraph.com/news/taiwan-bans-operation-unregistered-foreign-crypto-exchanges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/03cdc952-bcb8-4119-b6c1-f3eee5b97674.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Apart from local exchanges like Maicoin, major global crypto trading firms like Binance, ByBit and Kraken have also been serving customers in Taiwan.</p>\n                    <p><p>Taiwan’s Financial Supervisory Commission (FSC) is moving to improve protections for cryptocurrency investors by introducing new rules.</p><p>The FSC has <a href=\"https://www.fsc.gov.tw/ch/home.jsp?id=96&amp;parentpath=0,2&amp;mcustomize=news_view.jsp&amp;dataserno=202309260005&amp;dtable=News\" target=\"_blank\" rel=\"noopener nofollow\">formulated</a> the key points of regulating the cryptocurrency market in Taiwan, releasing on Sept. 26 a set of industry guidelines for virtual asset service providers (VASP) operating in the country.</p><p>In the guidelines, the authority mentioned some common industry-wide rules like separating exchange’s treasury assets from customer assets as well as reviewing mechanisms for listing and delisting virtual assets.</p><p>The FSC also required foreign VASPs to refrain from providing its services in Taiwan without holding necessary approvals from the regulator. The FSC stated:</p><blockquote>“Overseas virtual asset platform operators are not allowed to provide business within the territory of the country [...] unless they have been registered in accordance with the law.”</blockquote><p>The authority also said that VASPs are invited to promote self-regulation in the cryptocurrency industry, as relevant VASP associations are expected to formulate self-regulatory norms based on the contents of the guiding principles.</p><p>The guidelines came in conjunction with major crypto exchanges in Taiwan announcing the <a href=\"https://cointelegraph.com/news/taiwan-major-crypto-exchanges-form-association\">establishment of a joint self-regulatory association</a>. On Sept. 26, local exchanges like Maicoin, BitstreetX, Hoya Bit, Bitgin, Rybit, Xrex and Shangbito officially formed Taiwan VASP Association, aiming to promote the industry and help regulators.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-regulator-sfc-crackdown-unregulated-crypto-platforms-jpex-scandal\"><strong><em>Hong Kong to list ‘suspicious’ crypto platforms in wake of JPEX scandal</em></strong></a></p><p>Apart from local exchanges, major global crypto trading firms like Binance have also been serving customers in Taiwan. At the time of writing, Kraken exchange <a href=\"https://support.kraken.com/hc/en-us/articles/360001368823-Where-can-I-use-Kraken-\" target=\"_blank\" rel=\"noopener nofollow\">says</a> that it offers “full services to clients living in Taiwan,” while ByBit exchange <a href=\"https://www.bybit.com/en-US/help-center/s/article/Supported-Countries-Regions\" target=\"_blank\" rel=\"noopener nofollow\">supports</a> Visa and Mastercard payments in countries like Taiwan, according to its website.</p><p>In August, Binance crypto exchange reportedly <a href=\"https://cointelegraph.com/news/binance-applies-taiwan-aml-compliance\">applied to be registered in Taiwan</a> under the Money Laundering Control Act and the FSC.</p><p>Kraken and ByBit did not immediately respond to Cointelegraph’s request for comment.</p><p>The news comes shortly after local publications reported on Sept. 7 that the FSC created a draft of 10 guiding principles for the management of virtual currencies in the country, planning to <a href=\"https://cointelegraph.com/news/taiwan-restricts-unregistered-overseas-crypto-exchanges\">restrict unregistered crypto exchanges</a>. The framework is coming on the heels of the FSC <a href=\"https://cointelegraph.com/news/taiwan-watchdog-fsc-to-assume-authority-on-crypto-regulation\">becoming the primary regulator of cryptocurrencies</a> in the island country in 2023.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\"><strong><em>Asia Express: China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T11:48:31.000Z",
    "title": "Venezuela extends reorganization shutdown of crypto agency to March 2024 ",
    "url": "https://cointelegraph.com/news/venezuela-extends-reorganization-crypto-agency-six-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4197df22-8f5b-44c7-af3a-6318c6f86212.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The government will spend six additional months to ‘reorganize” the entity, which de-facto stopped its work in March 2023. </p>\n                    <p><p>Venezuela was one of the first Latin American countries to establish its own crypto oversight body, the National Superintendency of Crypto Assets (Sunacrip). Now, the government says it will take six extra months to ‘reorganize” the entity, which de-facto stopped its work in March 2023. </p><p>According to the presidential <a href=\"http://spgoin.imprentanacional.gob.ve/cgi-win/be_alex.cgi?Documento=T028700043720/0&amp;Nombrebd=spgoin&amp;CodAsocDoc=3409&amp;Sesion=122251351\" target=\"_blank\" rel=\"noopener nofollow\">decree</a>, published on Sept 19, the head of State, Nicolás Maduro, ordered the extension of the period of forced reorganization of Sunacrip for another semester. The period of the new extension officially started on Sept. 17 and will last until March 24, 2024. </p><p>Sunacrip was closed in March 2023, when the government <a href=\"https://cointelegraph.com/news/venezuela-overhauls-national-crypto-department\">announced its reorganization</a> due to the corruption scandal involving its former top management. At the time at least ten people were arrested, including Joselit Ramirez Camacho, who led the crypto department from its inception in 2018. According to Venezuelan prosecutors, Ramirez stole more than $3 million from the state during his time at Sunacrip. He was in charge of overseeing the crypto regulation in the country, as well as the implementation of Venezuelan national cryptocurrency tied to oil reserves, Petro. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/binance-excludes-banco-de-venezuela-from-p2p-payments\"><strong><em>Binance excludes Banco de Venezuela from P2P payments</em></strong></a></p><p>The shutdown of the regulatory body <a href=\"https://cointelegraph.com/news/venezuela-shuts-down-crypto-mining-facilities-exchanges-amid-corruption-probe\">led to chaos</a> in the Venezuelan crypto industry, firmly tied to the state, which has been using digital assets to evade the U.S. financial sanctions — crypto mining facilities in several states were shut down, and some crypto exchanges were ordered to cease operations. </p><p>Sunacrip was established by the Venezuelan government in 2018 to inspect the entirety of crypto-related commercial activities in the country and the “creation, emission, transfer, commercialization and exchange” of all crypto actives. </p><p>In 2018, the country launched the oil-backed cryptocurrency Petro. By the summer of 2023, there were reports that the government planned to <a href=\"https://www.bloomberglinea.com/latinoamerica/venezuela/se-acerca-el-fin-del-petro-la-criptomoneda-venezolana-tras-reajuste-interno-y-deudas-por-pagar/\" target=\"_blank\" rel=\"noopener nofollow\">liquidate</a> the currency, however, its official webpage is still functioning at time of publication. </p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-26T12:00:55.000Z",
    "title": "HTX launches SAFU fund following $7.9 million Ethereum loss",
    "url": "https://cryptoslate.com/htx-launches-safu-fund-following-7-9-million-ethereum-loss/",
    "description": "<p>HTX global adviser Justin Sun said the exchange has created a secure asset fund for users (SAFU) following the $7.9 million exploit of its hot wallet on Sept. 24. SAFU serves as a financial safety net earmarked to reimburse investors in the unfortunate event of asset losses resulting from hacks or other unforeseen incidents on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/htx-launches-safu-fund-following-7-9-million-ethereum-loss/\">HTX launches SAFU fund following $7.9 million Ethereum loss</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-26T12:07:35.000Z",
    "title": "Your Guide to the Elektrik Airdrop",
    "url": "https://cryptodaily.co.uk/2023/09/your-guide-to-the-elektrik-airdrop",
    "description": "The overarching goal with the Elektrik airdrop is to catalyse the growth of its protocol and prepare it for long term sustainable growth."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-26T12:05:59.000Z",
    "title": "LBank Labs Announces Its Investment in Bubblemaps, Pioneering Blockchain Data Transparency and Accessibility",
    "url": "https://cryptodaily.co.uk/2023/09/lbank-labs-announces-its-investment-in-bubblemaps-pioneering-blockchain-data-transparency-and-accessibility",
    "description": "LBank Labs, the trailblazing blockchain venture fund, has proudly announced its strategic investment in Bubblemaps, an innovative platform aimed at making blockchain data transparent, accessible, and engaging."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-26T11:50:09.000Z",
    "title": "Bitboy Ben Armstrong Arrested During Live Stream Over Stolen Lambo",
    "url": "https://news.bitcoin.com/bitboy-ben-armstrong-arrested-during-live-stream-over-stolen-lambo/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitboy Ben Armstrong Arrested During Live Stream Over Stolen Lambo\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bbbbbbbb.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto influencer Ben ‘Bitboy’ Armstrong has been reportedly arrested while livestreaming his attempt to confront a former business partner. Excerpts from the Youtube video released on social media show him explaining to police the reasons for his deed, including the alleged theft of his Lamborghini. Bitboy Crypto Gets Detained in Front of Former Business Partner’s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T11:42:10.000Z",
    "title": "Cloud Titans: Amazon, Microsoft, and Google Enter the AI Arena",
    "url": "https://www.cryptopolitan.com/cloud-titans-amazon-microsoft-and-google-enter-the-ai-arena/",
    "description": "In a scenario reminiscent of a sci-fi epic, the tech industry is witnessing an escalating battle among three cloud giants: Amazon, Microsoft, and Google. They are fervently investing in and vying for supremacy in generative AI. With Amazon&#8217;s colossal $4 billion investment in Anthropic, a San Francisco-based startup known for its Claude 2 generative AI ... <a title=\"Cloud Titans: Amazon, Microsoft, and Google Enter the AI Arena\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cloud-titans-amazon-microsoft-and-google-enter-the-ai-arena/\" aria-label=\"More on Cloud Titans: Amazon, Microsoft, and Google Enter the AI Arena\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-26T11:57:38.000Z",
    "title": "Cardano and Tron bullish, Kangamoon bringing utility to meme coins",
    "url": "https://crypto.news/cardano-and-tron-bullish-kangamoon-bringing-utility-to-meme-coins/",
    "description": "Kangamoon aims to bring utility to meme coins as Tron and Cardano print bullish signals. KANG presale is ongoing"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-26T11:55:50.000Z",
    "title": "Taiwan tightens crypto rules with new guidelines and industry group",
    "url": "https://crypto.news/taiwan-tightens-crypto-rules-with-new-guidelines-and-industry-group/",
    "description": "Taiwan tightens crypto regulations with new FSC guidelines and the formation of an industry association by leading exchanges."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T11:58:58.000Z",
    "title": "Maker (MKR) Price Continues to Climb Higher Level, Will It Surpass $1500?",
    "url": "https://www.newsbtc.com/maker-mkr/maker-mkr-price-continues-to-climb-higher-level-will-it-surpass-1500/",
    "description": "Maker DAO’s MKR has recorded a big push amid the slight uptick in the broader cryptocurrency market. Yesterday, September 25, the token rose from a low of $1,265 to a high of $1,343.  Although most tokens struggle to recover, MKR consolidated on its upswing with an impressive 5% 24-hour increase. MKR trades at $1335, striding to conquer the critical resistance at $1,350.  Its latest strides show buyers are in control, and their activity could facilitate more gains for MKR. But is the bullish momentum strong enough to push MKR to the $1,500 price mark? Let&#8217;s find out. Related Reading: Market Analysts Outline When The First Spot Bitcoin ETF Will Be Approved MKR Stands Among Top-gaining Cryptocurrencies MKR ranked number one among today’s top-gaining cryptocurrencies, gapping Chainlink and Bitcoin Cash by 2%. This comes while the overall crypto market cap recorded a slight uptick of 0.63%, with the trading volume down 4%, indicating a decline in trading activity. However, amid the sparse buying activities in the general market, MKR recorded a 47% increase in trading volume.  This observation depicts increased buy action in the Maker market. But while this increased buying strength could fuel the coin&#8217;s price rally, it’s important to identify the factors behind it.  The buzz around the new proposal to deploy Spark Protocol on zkSync Era Mainnet has boosted investor sentiment. This proposal will include wETH, rETH, wstETH, and DAI as initial collaterals for borrowing on the Spark Protocol. Also, if adopted, the proposal will set a 2 million liquidity goal to spur Spark Protocol’s growth on zkSync. Already, 100% of the Maker community voted yes to launching Spark on Gnosis Chain. This development makes DAI, Maker DAO’s stablecoin, the native gas token of Gnosis Chain. In addition, it allows users to earn increased yield when lending their DAI tokens.  Given this benefit, this development yielded positive sentiment in the Maker ecosystem. This positive sentiment must have translated into increased demand for MKR, the governance token of the Maker protocol, a plausible reason behind the surge in trading activities.  MKR Strives To Conquer The Key Resistance Level: Is $1,500 Possible? The daily chart shows that MKR has formed two consecutive bullish candlesticks around the $1,300 price. This set-up depicts high token demand and increased buying strength around this zone.  The increased buy actions have pushed MKR above a key support level of $1,086 and a critical moving average of $1,166. But, the bulls met strong opposition at the $1,354. The sell activities from profit-taking traders, evident in forming two bearish candlesticks at this level, hinder further strides. Furthermore, MKR has remained a few pipes below $1,354 since opening today’s trading session at $1,338.  However, the Relative Strength Index, which increased from 63 to 64.97, approaching the overbought area, signals rising buying strength. It suggests that more buyers are entering longer positions, ready to counter the selling pressure resisting rally.  Related Reading: Bitcoin Price Predictions For 2024: Insights From Major Banks To Hedge Funds Suppose buyers maintain the ongoing momentum; a breakout above $1,354 and a move towards $1,500 before the day ends is possible. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T12:00:17.000Z",
    "title": "Leak Suggests Musk, X, and Wall Street May Disrupt Bitcoin Prices with “PayPal Update”: Implications for SPCT, and AVAX?",
    "url": "https://www.crypto-news-flash.com/leak-suggests-musk-x-and-wall-street-may-disrupt-bitcoin-prices-with-paypal-update-implications-for-spct-and-avax/?utm_source=rss&utm_medium=rss&utm_campaign=leak-suggests-musk-x-and-wall-street-may-disrupt-bitcoin-prices-with-paypal-update-implications-for-spct-and-avax",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-148.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-148.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-148-300x157.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-148-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A recent news leak put into the public by Forbes has suggested that Elon Musk might be considering a new payment system like PayPal. This can have serious repercussions for top crypto coins, like Bitcoin (BTC). Meanwhile, Avalanche (AVAX) has just launched a ticketing platform. Yet VC Spectra (SPCT) remains the highlight of the market [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T11:45:58.000Z",
    "title": "Bitcoin’s Dance with Exchanges: A Prelude to Market Tremors?",
    "url": "https://www.crypto-news-flash.com/bitcoins-dance-with-exchanges-a-prelude-to-market-tremors/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-dance-with-exchanges-a-prelude-to-market-tremors",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-47.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-47.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-47-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Significant inflows of Bitcoin into exchanges hint at a possibly volatile market landscape ahead. While bearish sentiments brew among some traders, an uptick in long-term holder accumulation reflects a diverging market sentiment. The bustling landscape of cryptocurrency often serves as a reactionary canvas to the subtle strokes of market dynamics. Lately, Bitcoin, the prodigal harbinger [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-26T11:53:28.000Z",
    "title": "DOGE at 7-Day Low: Will Bears Dominate or Bulls Make a Comeback?",
    "url": "https://coinedition.com/doge-at-7-day-low-will-bears-dominate-or-bulls-make-a-comeback/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Doge-price-analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Doge-price-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A bearish trend has been prevalent in the Dogecoin (DOGE) market for the previous 24 hours until support was found at the 7-day low of $0.06055. As a result, bullish momentum reclaimed control of the DOGE market, driving the price to a 24-hour high of $0.0612 before slumping into solid resistance. However, DOGE bulls had [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/doge-at-7-day-low-will-bears-dominate-or-bulls-make-a-comeback/\">DOGE at 7-Day Low: Will Bears Dominate or Bulls Make a Comeback?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-26T11:45:32.000Z",
    "title": "BitGo CEO Says Political Pressure, Not the Law, Preventing Spot Bitcoin ETF Approval",
    "url": "https://dailyhodl.com/2023/09/26/bitgo-ceo-says-political-pressure-not-the-law-preventing-spot-bitcoin-etf-approval/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Approval-of-Spot-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of crypto exchange BitGo, Mike Belshe, is offering his opinion on why a spot Bitcoin (BTC) exchange-traded fund (ETF) has yet to be approved by the U.S. Securities and Exchange Commission (SEC). In a new interview on Kitco News, Belshe says politics are playing a major role as to why there&#8217;s no spot-based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/26/bitgo-ceo-says-political-pressure-not-the-law-preventing-spot-bitcoin-etf-approval/\">BitGo CEO Says Political Pressure, Not the Law, Preventing Spot Bitcoin ETF Approval</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]