[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-21T19:30:21.000Z",
    "title": "US Chamber of Digital Commerce Backs Binance, Urges SEC to Drop Lawsuit",
    "url": "https://news.bitcoin.com/us-chamber-of-digital-commerce-backs-binance-urges-sec-to-drop-lawsuit/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Chamber of Digital Commerce Backs Binance, Urges SEC to Drop Lawsuit\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/227capiol.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a significant move on Thursday, the U.S. Chamber of Digital Commerce, a leading crypto policymaking advocacy group, filed an amicus brief urging the U.S. Securities and Exchange Commission (SEC) to dismiss its lawsuit against cryptocurrency giant Binance. SEC&#x2019;s Authority Questioned: Chamber of Digital Commerce Supports Binance Founded in July 2014 by Perianne Boring, the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-21T19:10:28.000Z",
    "title": "Blockchain Company LBRY Shuts Down After Legal Battle With SEC",
    "url": "https://www.newsbtc.com/news/blockchain-company-lbry-shuts-down-after-legal-battle-with-sec/",
    "description": "LBRY Inc., a cryptocurrency platform, announced its closure due to a court failure against the Securities and Exchange Commission (SEC). The SEC charged LBRY with making an unregistered securities offering by selling its native LBC tokens. The fallout from this legal fight has prompted worries about unequal access to justice and regulatory overreach in the crypto business, which has disproportionately impacted smaller startups with minimal financial resources. LBRY Inc. reported that the company was compelled to discontinue operations because of obligations owed to the SEC, legal team, and private creditors totaling several million dollars. LBRY Inc. is winding down. The LBRY network is unaffected. Odysee and other assets will undergo a legal process to satisfy debts, but Odysee has a bright future ahead. Thank you to everyone who fought with us for online freedom. A final goodbye post is in the first reply. — LBRY 🚀 (@LBRYcom) October 19, 2023 LBRY&#8217;s Financial Struggles The SEC first sought a $22 million penalties, which was later lowered to $111,614. This lowered fine was a major financial blow for LBRY, making it impossible for the company to continue operations. Related Reading: Bulls Thrust Solana To $25 – What Traders Should Expect Next The scenario exemplifies the difficulties that crypto businesses can face when they are pursued by regulatory agencies, particularly smaller startups with minimal financial resources. The SEC has been accused of regulatory overreach in pursuing LBRY, with critics suggesting that the agency should focus on big issues in the crypto business rather than minor instances of securities noncompliance. However, this case highlights the SEC&#8217;s ability to control the cryptocurrency market through enforcement proceedings. Ripple&#8217;s Contrasting Legal Victory The downfall of LBRY contrasts sharply with Ripple&#8217;s recent court success in its ongoing struggle with the SEC. Ripple acquired funding from a multibillion-dollar corporation, allowing it to continue its legal battle. Crypto total market cap currently at $1.10 trillion. Chart: TradingView.com While LBRY Inc.&#8217;s controlled operations are ending, the LBRY blockchain, an open-source initiative, may continue to exist if sufficient user engagement is obtained. However, the business stated that decentralization may only succeed if active development and user participation are present. With millions of registered users and a large volume of published material, the LBRY blockchain acted as a decentralized file-sharing network. Odysee, a decentralized social networking platform built on the LBRY blockchain, has a substantial user base. However, its future is now in doubt. In a broader sense, the legal disputes in the crypto business are altering the securities law landscape. Both LBRY and Ripple have been accused with selling unregistered securities, but their outcomes have set developing precedents. Related Reading: Stacks (STX) Rockets 26% Higher In A Single Week: The Factors At Play These results have prompted concerns about the SEC&#8217;s capacity to win legal battles against other crypto businesses. As LBRY succumbs to regulatory pressure, it represents the obstacles encountered by smaller crypto businesses, as well as the broader issue of unequal access to justice in the cryptocurrency industry&#8217;s growing regulatory context. Featured image from Conseils Crypto"
  }
]