[
  {
    "source": "Decrypt",
    "date": "2023-08-10T22:24:52.000Z",
    "title": "Crypto Gaming Investments Surged in July as Metaverse NFTs Fizzled Out",
    "url": "https://decrypt.co/152091/crypto-gaming-investments-surged-july-metaverse-nfts-fizzled-out",
    "description": "Investors pumped $297 million into the fledging crypto video game industry in July, but metaverse NFT sales have slowed significantly."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T22:35:48.000Z",
    "title": "Circle says competition from PayPal and others is ‘great to have’, reports $1B in cash",
    "url": "https://cryptoslate.com/circle-says-competition-from-paypal-and-others-is-great-to-have-reports-1b-in-cash/",
    "description": "<p>Circle&#8217;s top executive spoke favorably of competition from PayPal&#8217;s stablecoin while emphasizing his own company&#8217;s strong standing on Aug. 10. Jeremy Allaire, the CEO of Circle, said that other firms will likely begin to introduce stablecoins following PayPal&#8217;s announcement. He told Bloomberg: &#8220;I expect you will see many many, not just internet payments firms, but [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circle-says-competition-from-paypal-and-others-is-great-to-have-reports-1b-in-cash/\">Circle says competition from PayPal and others is &#8216;great to have&#8217;, reports $1B in cash</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T22:16:02.000Z",
    "title": "Bitcoin Futures Fakeout: The Price Divergence That Predicts A Phony",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-futures-fakeout-the-price-divergence/",
    "description": "This week, Bitcoin traders braced for a breakout as an important technical buy signal triggered and BTCUSD shot up over $30,000 temporarily. They came up short-handed, however, as the market took an immediate turn back down. Interestingly, the fakeout could have possibly been predicted by a divergence between two BTCUSD price charts. Why Price Patterns And Technical Signals Can Fail Price patterns are tough to trade in cryptocurrencies. Because so many eyes are on the same pattern meeting precise parameters, the market has a way of making people pay for acting on the obvious. For example, a rising wedge pattern is typically bearish, but could breakout to the upside. The same is true for technical signals that a large portion of traders are paying attention to, such as notable crossovers and changes in momentum. This is exactly the case recently with a bullish crossover of the daily BTCUSD Moving Average Convergence Divergence (MACD). Related Reading: Will Record Low Volatility Awaken A Behemoth Bitcoin Surge? 4,000% Signal Returns The MACD is a momentum indicator that gives a buy signal when the MACD line crosses the signal line from below. This signal not only has appeared in Bitcoin, but it confirmed on BTCUSD spot exchanges, so what gives? It was a phony signal from the “future.” Conflicting signals &#124; BTCUSD on TradingView.com Spot Possible Divergences With Bitcoin Futures By “future” we mean BTC CME Futures, also known as Chicago Mercantile Exchange’s Bitcoin derivatives product, which institutions use to speculate on the underlying price of BTCUSD. The BTC CME Futures chart doesn’t always reflect spot BTCUSD charts 1:1. Any divergences between the two platforms, has historically led to fakeouts and phony breakouts. Part of the reason for this is due to the platform shutting down for a short period each day, and for the entire weekend starting at Friday afternoon. The result is a Bitcoin chart with more traditional market traits, such as gaps. The missing price data also changes the calculation of many technical indicators. For example, moving averages are in slightly different locations from chart to chart. Related Reading: Crypto Storm Brewing: Bitcoin Vortex Indicator Flashes Buy Alert This is precisely how the recent “fakeout” higher was able to be predicted with a degree of accuracy. This discrepancy and divergence leading to false signals is nothing new and has been happening for years. When BTC CME finally participates in the same signal, the expected results often then arrive. Is this a situation similar to Dow Theory, where the DJIA and DJTA must confirm one another for a trend to be valid? Or is there some more at play? Whatever the case may be, there’s enough historical evidence at this point to pay attention to any divergences between spot and CME Futures. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T22:32:00.000Z",
    "title": "Has Crypto Failed Sex Workers Escaping Traditional Finance?",
    "url": "https://coinedition.com/has-crypto-failed-sex-workers-escaping-traditional-finance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/blockchain1-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to a recent report, sex workers are moving away from crypto due to mounting difficulties. Once a solution for workers in the adult industry, crypto is becoming burdensome due to the increasing instability in regulation.&#160; Because of the stigma around sex work, workers have stayed away from banks and other payment options. Several sex [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/has-crypto-failed-sex-workers-escaping-traditional-finance/\">Has Crypto Failed Sex Workers Escaping Traditional Finance?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]