[
  {
    "source": "Crypto Daily",
    "date": "2023-11-05T12:56:58.000Z",
    "title": "Crypto Weekly Roundup: Bankman-Fried Found Guilty And More",
    "url": "https://cryptodaily.co.uk/2023/11/crypto-weekly-roundup-bankman-fried-found-guilty-and-more",
    "description": "After weeks of trials, testimony, and cross-examination, the FTX courtroom drama has finally wrapped up, with former CEO Sam Bankman-Fried found guilty on all seven charges of fraud and money laundering. Let’s find out more."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-05T12:48:36.000Z",
    "title": "Shiba Inu Whales Bet Big As Shibarium Grows – Road To $0.1?",
    "url": "https://www.newsbtc.com/news/shiba-inu-whales-bet-big-as-shibarium-grows-road-to-0-1/",
    "description": "Shibarium has had quite the adoption and growth since its launch. The layer-2 solution has grown in various metrics over the months, demonstrating strong momentum. Shibarium is closely approaching the 4 million milestone in total transactions. At the same time, whales are increasing their activities, as large transactions spiked in the past week.  Related Reading: RUNE Solid 100% Rally Hits Barrier: THORChain Price Nears Key Resistance Shibarium Nears 4 Million Transactions The momentum behind Shiba Inu’s own scaling solution is growing at an incredible pace. Shibarium has taken off and become the preferred method for SHIB whales and retail investors alike to buy and sell SHIB tokens. According to NOWNodes, Shibarium was one of the best-performing networks this month, as the blockchain node provider reached 66 million processed requests to Shibarium. In less than three months after its launch, the network is now approaching four million total transactions and shows no signs of slowing down. @ShibariumNet was one of the best performing networks in our ecosystem this month 🥇 Our team prepared a Milestone report dedicated to the success, most recent updates and highlights of the network Get into our new 🧵 https://t.co/t4e5ljoXNi pic.twitter.com/WHyZZCQAE0 — NOWNodes ⛓️ (@NOWNodes) November 3, 2023 Data from Shibariumscan puts the total transaction count at the time of writing at 3.81 million, with a total of 1.51 million blocks mined. The number of daily transactions is also at 13,700 in the past 24 hours, and the number of wallet addresses has recently surpassed 1.26 million. At the same time, Shiba Inu whales have upped their activity. Data from IntoTheBlock has shown the Shiba Inu ecosystem saw a 45% jump in large transaction volume, which totaled $46.12 million as October came to a close. Related Reading: This Chainlink Metric Just Hit Meteoric Levels – Good News For LINK Price? SHIB market cap currently at $4.839 billion. Chart: TradingView.com Road To $0.1 For Shiba Inu? Past news around Shibarium has always positively affected the price of SHIB. Each new milestone and benchmark reached in developing Shibarium generates excitement and drives up the price of SHIB. At the time of writing, SHIB is trading at $0.000008154 and only 22.14% of holders are currently making a profit. A cross over the four million milestone in Shibarium could lead to another hype in the Shiba Inu ecosystem, even if only temporarily. This could propel Shiba Inu past the current resistance of $0.0000082 and towards its August high of $0.00001072. As more SHIB holders discover the benefits of Shibarium, like lower fees and faster transaction speeds, the rate of adoption will only accelerate. At the same time, various developments have pointed towards sustained price growth for SHIB.  Shytoshi Kusama, SHIB&#8217;s lead developer, recently unveiled a naming service on Shibarium to convert complex Shibarium addresses into simple human-readable names. A $0.1 price point at this moment seems very unrealistic, but updates like this indicate a starting point for sustained price growth.    Featured image from Pexels"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-05T13:04:00.000Z",
    "title": "SHIB’s Price Up Slightly as 259+ Million Tokens Get Burned",
    "url": "https://coinedition.com/shibs-price-up-slightly-as-259-million-tokens-get-burned/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SHIB-Analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Internal-SHIB-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Shiba Inu (SHIB) token burn tracking platform Shibburn revealed in a X post earlier today that a total of 259,383,545 tokens have been burned over the past week. According to the post, these tokens were burned through 66 transactions. Although the amount of tokens burned in the past 7 days is impressive, it is [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/shibs-price-up-slightly-as-259-million-tokens-get-burned/\">SHIB’s Price Up Slightly as 259+ Million Tokens Get Burned</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-05T12:45:31.000Z",
    "title": "Dan Morehead Predicts Stock Market Crash, Says Crypto To Outshine Equities, Real Estate and Bonds",
    "url": "https://dailyhodl.com/2023/11/05/dan-morehead-predicts-stock-market-crash-says-crypto-to-outshine-equities-real-estate-and-bonds/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Dont-Really-Like-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Pantera Capital founder Dan Morehead is forecasting an incoming correction in equities markets and a relative outperformance of crypto assets. Morehead says via social media platform X that he believes the S&#38;P500 is &#8220;massively overvalued&#8221; and due for a 23% fall. The investor, who oversees $4.2 billion worth of assets at Pantera, says the Federal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/05/dan-morehead-predicts-stock-market-crash-says-crypto-to-outshine-equities-real-estate-and-bonds/\">Dan Morehead Predicts Stock Market Crash, Says Crypto To Outshine Equities, Real Estate and Bonds</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]