[
  {
    "source": "NewsBTC",
    "date": "2023-12-09T23:00:10.000Z",
    "title": "Why Is XRP Price Up Today? Ripple’s Massive Buyback May Have The Answer",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-up-today-ripple/",
    "description": "XRP is one of the top gainers in the last 24 hours. As to why the crypto token is up, a popular crypto sleuth has some answers, as he recently revealed a significant move made by Ripple. This revelation also has the possibility of ending talks that XRP’s price is being manipulated by Ripple, considering that the crypto firm has so far shown that it has XRP’s best interest at heart. Ripple Allegedly Buys Back Around 700 Million XRP In a post on his X (formerly Twitter) platform, crypto sleuth Mr. Huber mentioned that Ripple bought back around 700 million XRP from the open market. According to him, Ripple usually does this to keep the XRP markets stable and liquid. This endeavor could explain why the token’s price has suddenly picked up.  Related Reading: Dogecoin Above $0.1? Crypto Analyst Lists Reasons Why DOGE Price Will Continue To Rally The XRP price has underperformed in recent times, with many speculating why this could be happening. Some simply stated that the price was manipulated as there was no other logical reason to explain the underperformance, especially considering that other altcoins were enjoying significant gains.  However, Mr. Huber had another plausible explanation for this decline as he stated that it could be one of Ripple’s ODL customers selling their XRP tokens on the open market. It had previously been reported that Ripple’s XRP sales to these ODL customers do not impact prices on exchanges. However, it does when these customers, in turn, start to sell these XRP tokens to retail investors.  Therefore, noticing the trend of the XRP sales from ODL customers, Ripple could have bought back these XRP tokens in order to stabilize the XRP price. It is worth mentioning that Mr. Huber seems to have reached his conclusion of a massive buyback due to the decline in XRP’s circulating supply. He asserted that Ripple’s holdings are not calculated in the circulating supply.  XRP recovers above $0.68 &#124; Source: XRPUSD on Tradingview.com XRP Price Underperformance Is Concerning Before his revelation about Ripple’s massive buyback, Mr. Huber had raised concern about XRP’s worrisome price action. He noted that the XRP price had “lost literally” all the gains it made against the broader crypto market following Judge Analisa Torres’ ruling. The Judge had ruled that the crypto token wasn’t a security in itself.  Related Reading: XRP Price To Go Parabolic? Crypto Analyst Confirms 1000% Golden Cross Has Returned Many had predicted that this legal clarity was going to help boost XRP’s price, and it actually did in the weeks after the ruling. However, the XRP price has been on a notable decline since posting those gains. It has even become concerning ever since the broader crypto market picked up as many continue to wonder could be the reason for XRP’s rather relatively tepid movement.  At the time of writing, XRP is trading at around $0.69, up over 7% in the last 24 hours, according to data from CoinMarketCap.  Featured image from Watcher Guru, chart from Tradingview.com"
  }
]