[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T14:58:03.000Z",
    "title": "Worldcoin Hype Causes Optimism to Leapfrog Arbitrum in Daily Transactions",
    "url": "https://www.coindesk.com/business/2023/07/27/worldcoin-hype-causes-optimism-to-leapfrog-arbitrum-in-daily-transactions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Layer-2 blockchain Optimism has surpassed Arbitrum in daily transaction volume for the first time in six months, according to Dune Analytics."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-27T14:41:44.000Z",
    "title": "PancakeSwap Sweetens Network with zkSync Era Launch",
    "url": "https://cryptobriefing.com/pancakeswap-sweetens-network-with-zksync/?utm_source=feed&utm_medium=rss",
    "description": "Decentralized exchange PancakeSwap is leveraging zkSyncs layer 2 solution to deliver increased scalability and efficiency, making a notable stride for the mass adoption of DeFi, according to a press release..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T14:55:45.000Z",
    "title": "BlackRock introduces India to digital-first investment approach",
    "url": "https://www.cryptopolitan.com/blackrock-india-to-digital-first-investment/",
    "description": "A groundbreaking step into India&#8217;s digital investment landscape is set to be taken by BlackRock, the international investment powerhouse. Partnering with Jio Financial Services (JFS), an affiliate of Reliance Industries, a firm that holds the title of India&#8217;s most valued, BlackRock seeks to revolutionize India&#8217;s asset management industry by establishing a “digital-first offering.” Expanding horizons: ... <a title=\"BlackRock introduces India to digital-first investment approach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-india-to-digital-first-investment/\" aria-label=\"More on BlackRock introduces India to digital-first investment approach\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T15:00:56.000Z",
    "title": "Lacoste Unveils Exclusive Ethereum-Based Virtual Store For NFT Holders",
    "url": "https://www.newsbtc.com/nft/lacoste-unveils-virtual-store/",
    "description": "Fashion brand Lacoste has unveiled an exclusive Ethereum-based virtual store for NFT holders as the brand aims to give its NFT holders an immersive experience for the summer. The virtual store, created by retail technology developer Emperia, will integrate the traditional retail experience with digital innovations exclusive to users holding Lacoste’s UNDW3 NFT passes.  An Insight Into UNDW3 &#38; Lacoste’s Virtual Store Lacoste’s UNDW3 NFT holders will have exclusive access to the virtual store. UNDW3 is an NFT-based loyalty program the French brand released in June (similar to that of Starbucks).  Holders will access the virtual store through Lacoste’s e-commerce platform. The digital store gives an immersive experience right from the beginning; Shoppers enter through Lacoste’s iconic crocodile, which will lead them to a tiled boutique. These shoppers also get to enjoy the beach view in the digital store from its outdoor pool area.  Related Reading: Singaporean Judge Declares Crypto Is Personal Property In ByBit Case Lacoste’s summer apparel collection will also be on display throughout the experience, and visitors can make a purchase at any time. There is also a crocodile-themed scavenger hunt game these shoppers can participate in. Additionally, there is an exclusive underwater VIP space that only UNDW3 holders can access. These users will need to unlock this space by an email login or by connecting the digital wallet which contains the NFT. Furthermore, Lacoste’s exclusive UNDW3 apparel collection is available on sale in the VIP space.  There is more to it as it exemplifies the growing Phygital trend among fashion brands. Each piece from the exclusive UNDW3 apparel collection has a tokenized equivalent (in the form of an NFT). Holders can scan a QR code that unlocks an augmented reality (AR) feature, adding a more immersive angle to the shopping experience.  Lacoste &#38; Emperia’s Collaboration  It is worth mentioning that this isn’t the first time Lacoste and Emperia have collaborated on a virtual shopping experience. Emperia had previously helped Lacoste build a token-gated gamified experience for UNDW3 NFT holders. This shoppable activation, which launched in December 2022, won a Webby Award earlier this year.  Related Reading: Short-Lived Hype: Worldcoin (WLD) Signups Dwindle Less Than A Week After Launch Speaking on the blissful relationship with Lacoste, Emperia’s co-founder, and CEO Olga Dogadkina said: Our ongoing work with Lacoste and its advanced view of e-commerce and customer loyalty has given birth to new technologies that yield an improved user journey which connects the dots between virtual and physical retail. The phygital trend continues to grow in the fashion world and has become one of the biggest benefits of Web3 to the industry. Fashion brands like Nike have also in the past launched projects that help give their customers a feel of the physical and digital realms together. Total market cap now above $1.15 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from Awwwards, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T14:42:08.000Z",
    "title": "US Judge to Evaluate Potential Jail Time for Sam Bankman-Fried Ahead of FTX Collapse Trial – Report",
    "url": "https://www.crypto-news-flash.com/us-judge-to-evaluate-potential-jail-time-for-sam-bankman-fried-ahead-of-ftx-collapse-trial-report/?utm_source=rss&utm_medium=rss&utm_campaign=us-judge-to-evaluate-potential-jail-time-for-sam-bankman-fried-ahead-of-ftx-collapse-trial-report",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The US DoJ pushed to keep FTX CEO, Sam Bankman-Fried in jail pending his trial period. The embattled FTX founder was accused of unduly influencing witnesses. The United States Department of Justice (DoJ) is mulling the idea of keeping the former Chief Executive Officer of FTX Derivatives Exchange, Sam Bankman-Fried (SBF) in jail pending the [...]"
  }
]