[
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T03:49:28.000Z",
    "title": "Matter Labs co-founder proposes 'Ethereum Supreme Court' for on-chain disputes",
    "url": "https://cointelegraph.com/news/matter-labs-founder-proposes-ethereum-supreme-court-on-chain-disputes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a32ea8b4-739e-4888-810e-aeb40760c780.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto entrepreneur believes it would scare off bad actors and strengthen the state of the Ethereum network.</p>\n                    <p><p>Matter Labs co-founder and CEO Alex Gluchowski has proposed an <a href=\"https://cointelegraph.com/news/law-30-an-evolution-toward-on-chain-legal-resolution-in-web3\">Ethereum court system</a> resembling a hierarchical court system similar to the real world.</p><p>In a Sept. 2 post on X (Twitter), Gluchowski <a href=\"https://twitter.com/gluk64/status/1697964707548676245\" target=\"_blank\" rel=\"noopener nofollow\">floated</a> the idea for an “Ethereum Supreme Court” — which would work similar to the United States Supreme Court — serving as a final stop for parties to dispute smart contract issues rather than needing to take matters to a traditional lawyer or court.</p><p>“The most important function of such a system will be to protect protocols against political inference from the outside. It will serve as a great deterrence mechanism, and will elevate the role of Ethereum as a powerful network state,” said Gluchowski.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Smart contract implementation risks remain the biggest unsolved problem of Defi. L2s are equally affected.<br><br>Let me pitch an idea: L1 Fork as the Court of Final Appeal.<br><br>First, why existing solutions don&#39;t work:<br><br>1) Time-locked upgrades are great for scheduled changes, but… <a href=\"https://t.co/EcaogkZBH9\">pic.twitter.com/EcaogkZBH9</a></p>&mdash; Alex G. ∎ (@gluk64) <a href=\"https://twitter.com/gluk64/status/1697964707548676245?ref_src=twsrc%5Etfw\">September 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Gluchowski’s concept, disputes and emergency upgrades would be handled by a hierarchical system of on-chain courts. The final stop, however, would be an Ethereum layer-1 soft fork as the “Court of Final Appeal.”</p><p>Gluchowski said that in this system, every protocol would have its own governance with normal and emergency upgrade mechanisms, and would also designate a special contract which can trigger an appeal. </p><p>When there is an emergency upgrade to a protocol, there would be an appeal period, during which any user can submit a challenge to the higher court. However, they’ll have to put up a pre-defined bail deposit. </p><p>Each court specifies the higher court to appeal to, with the Ethereum Supreme Court serving as the final destination for challengers, Gluchowski said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let&#39;s chat. The main idea of the post: no human-driven court should be able to say the last word. The final appeal must always be an L1 fork.</p>&mdash; Alex G. ∎ (@gluk64) <a href=\"https://twitter.com/gluk64/status/1697966736878764139?ref_src=twsrc%5Etfw\">September 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>An example court heirachy would see protocols like Aave and Uniswap would contest matters in a court such as CourtUnchained or JusticeDAO. After those courts reach a decision, a party can appeal to the Ethereum Supreme Court.</p><p>However, there would need to be a strong social consensus for the <a href=\"https://cointelegraph.com/press-releases/metacourts-ido-launch-a-paradigm-shift-in-web3-legal-services\">on-chain court system to work,</a> Gluchowski acknowledged.</p><p>He added that it would be expensive so that only “truly extraordinary” cases will be brought before it.</p><blockquote>“[It will need to be] worthy of the attention of the entire Layer-0 (the social consensus) of Ethereum. Think of a bug in <a href=\"https://twitter.com/Uniswap\" target=\"_blank\" rel=\"noopener nofollow\">@Uniswap,</a> a major L2, a Defi protocol with a systemic risk, etc.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/onchain-legal-enforcement-jurat-a-purist-nightmare\"><strong><em>On-chain tool to seize crypto is a purist’s nightmare but a must, says CEO </em></strong></a></p><p>Gluchowski noted there were several existing solutions to such disputes already, but argued that they aren’t effective. </p><p>For example, enabling time-locked features on smart contracts isn’t suitable in emergency situations and introducing a security council can mitigate the problem, but won’t solve it, while carrying its own risks. </p><p>“A security council could only freeze the contract temporarily, requiring a token governance approval for an emergency upgrade. But now a malicious majority of undercollaterized stakers could perform an evil take-over upgrade and steal all the assets,” he explained.</p><p>Gluchowski said he and the team at zkSync — an Ethereum layer 2 scaling solution created by Matter Labs — will happily fund research into the proposal.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em> </em></strong><strong><em>‘Moral responsibility’ — Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]