[
  {
    "source": "CoinDesk",
    "date": "2023-08-24T17:46:08.000Z",
    "title": "After GOP Debate, Blockchain Bettors See Ramaswamy as Most Formidable Trump Challenger",
    "url": "https://www.coindesk.com/policy/2023/08/24/after-gop-debate-blockchain-bettors-see-ramaswamy-as-most-formidable-trump-challenger/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Betting lines didn’t change much as a result of Wednesday’s debate, but the Bitcoin-friendly entrepreneur has edged out Florida governor Ron Desantis this past week in the GOP’s race for second place."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-24T17:50:30.000Z",
    "title": "Bored Ape CEO & OpenAI CTO Among Victims of SIM Swap Scams",
    "url": "https://cryptobriefing.com/victims-of-sim-swap-scams-54-bored-ape-openai/?utm_source=feed&utm_medium=rss",
    "description": "Over $13M in crypto lost in SIM Swap scams this year."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T17:47:35.000Z",
    "title": "\n                        Philatelie Liechtenstein and Renowned Artist Romero Britto Reveal Groundbreaking NFT Stamp\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/philatelie-liechtenstein-and-renowned-artist-romero-britto-reveal-groundbreaking-nft-stamp",
    "description": "\n                        <p class=\"s5\">In an exciting merger of tradition and technology, Philatelie Liechtenstein, part of Liechtenstein&rsquo;s official postal service, has debuted an NFT postage stamp infused with the artistry of internationally acclaimed neo-pop artist, Romero Britto. Launched on March 29, 2023, this innovation sets a new benchmark for both philately and the digital art realm.</p>\nPop-art, stamps, and blockchain\n<p class=\"s5\">Liechtenstein's foray into the world of blockchain technology began as early as 2021, but this recent collaboration with Britto, known for his distinctive public art installations worldwide, including Hyde Park, London, and John F. Kennedy Airport, New York, has undoubtedly generated new attention in the world of post stamps.&nbsp;</p>\n\n<p class=\"s5\">\"We are proud to have been issuing stamps for 111 years now. The NFTs were created through the digital twin of a painting by Romero Britto, now on display in the Liechtenstein National Museum,\" says Roland Seger, CEO at LiechtensteinischePost AG.</p>\n\n<p class=\"s5\">Drawing from his personal journey, Britto told NullTX that, </p>\n\n<p>\"As art ambassador for the Philately Liechtenstein art edition, things have come full circle for me. When I was a kid in&nbsp;Brazil, I couldn't travel. But stamps let me dream. Through them, I could travel the world in my mind and get to faraway places.\"</p>\n\n<p class=\"s5\">The NFT Art Edition stands out in the novel arena of crypto-based stamps not just due to its blend of tradition and innovation but also because of its message of unity. </p>\n\n<p class=\"s5\">\"My art, the painting for the philately and the design of the NFT stamps are meant to express joy of life. This style conveys my philosophy: a visual language of happiness! The work in the Liechtenstein National Museum stands not only for friendship, but also for the connection between tradition and the digital world. Mushrooms (through their roots) are the best-connected creatures in our world - just as we are digitally on the internet today,\" Britto reflected.</p>\n\n<p class=\"s5\">Each stamp, built on Ethereum&rsquo;s ERC-721 standard, includes a unique SQR code, linking directly to its corresponding NFT on the Ethereum blockchain. This guarantees transparency and authenticity for collectors. Additional physical perks include gold foil embossed packaging and a certificate of authenticity.</p>\n<p class=\"s5\">Britto further emphasized the democratizing power of NFTs, saying, </p>\n\n<p class=\"s5\">\"Art is for everyone. We should share love and positivity with each other. With my art, I want to convey this attitude. The NFTs allow everyone to participate in the art world. Through this unique project, everyone gets access to a world that was previously only available to a few&nbsp;people..\"</p>\n\nA growing field\n<p class=\"s5\">As Liechtenstein's philately dives headfirst into the digital age, their initiatives not only revolutionize notions of authenticity and ownership but also underscore their commitment to evolving while paying homage to a century-old tradition. And notably, they&rsquo;re not the only players in their field to realize the potential of NFTs.</p>\n<p class=\"s5\">Since the thoughtleader&rsquo;s first venture into blockchain back in 2021, the release of Stamp 4.0, the world&rsquo;s first NFT stamp, other postage services in Europe have caught on to the idea. As Cointelegraph reported, the Dutch and Austrian postage services have followed suit and released their own blockchain-based stamps to the public in Fall 2022.</p>\n<p class=\"s5\">The future of philately seems promising, with a perfect blend of the past, present, and future, creating an inviting space for both traditional stamp enthusiasts and new-age collectors. As the world continues to become more digitalized, it seems fair to assume that collectors and even consumers will be seeing more post services leverage blockchain technology. It's even conceivable that postal services will abandon the old-fashioned physical stamps and soon rely entirely on their NFT counterparts for domestic and international mail.</p>\n<p class=\"s5\">One thing is for sure: thanks to collaborations like these, Philatelie Liechtenstein ensures its revered position in philatelic history for ages to come.</p>\n<p class=\"s10\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T18:07:24.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T17:56:05.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T17:51:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T17:43:08.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T18:00:17.000Z",
    "title": "Bitcoin NVT Flashes Buy Signal, Bottom In?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-nvt-flashes-buy-signal-bottom-in/",
    "description": "On-chain data shows the Bitcoin NVT ratio is currently flashing a buy signal, a sign that the bottom for the asset&#8217;s price might now be in. Bitcoin NVT Golden Cross Is Showing A Green Signal As pointed out by an analyst in a CryptoQuant post, the Network Value to Transactions (NVT) Golden Cross has now dipped below the -2 mark. The &#8220;Network Value to Transactions (NVT) ratio&#8221; is an indicator that measures the ratio between the Bitcoin market cap and transaction volume (both denominated in USD). When the value of this metric is high, it means that the price of the asset (that is, its market cap) is high when compared to its ability to transact coins (the transaction volume). Such a trend may imply that BTC is overvalued right now. On the other hand, low values can suggest that the market cap isn&#8217;t that much relative to the volume, so the cryptocurrency&#8217;s price may be undervalued at the moment. In the context of the current discussion, the NVT ratio itself isn&#8217;t of interest, but rather a modified form of it called the &#8220;NVT Golden Cross&#8221; is. This new indicator aims to pinpoint tops and bottoms in the NVT ratio by comparing its 30-day moving average (MA) with the 10-day one. Now, here is a chart that shows the trend in the Bitcoin NVT Golden Cross over the past year: Looks like the value of the metric seems to have been heading down in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin NVT Golden Cross has plunged recently as the cryptocurrency&#8217;s price has gone through a crash. Following the latest drawdown, the indicator is now deep inside the negative territory, at a value below -2. In the chart, the quant has marked two lines for the metric that have held some significance for the asset during the past. The first of these (marked in red) takes place at around 2.2, while the other one (green) is at -1.6. Related Reading: Bitcoin Exchange Reserve Shoots Up, Pain Not Over Yet? Historically, whenever the NVT Golden Cross has crossed above the former line, the cryptocurrency has generally observed the formation of a local top. Similarly, a break below the latter level has resulted in bottoms for the coin. From the chart, it&#8217;s clear that the indicator has now dipped firmly below the bottom line, implying that Bitcoin might be undervalued currently. In the past year, there have been three other instances of the indicator plunging below the line, each coinciding with some sort of low for the price. The first two of these had reached bottom values similar to now, while the third occurrence (which is the latest one) saw the NVT Golden Cross dip much deeper towards the -3.1 mark before the bottom was hit. Related Reading: This Bitcoin Indicator Is On The Verge Of A Bullish Breakout It&#8217;s unclear which scenario might play out for Bitcoin this time, but one thing may be clear from this pattern: the bottom could be near for the cryptocurrency, or may even already be in. BTC Price At the time of writing, Bitcoin is trading at around $26,500, down 7% in the last week. BTC hasn't made much recovery yet &#124; Source: BTCUSD on TradingView Featured image from Michael Förtsch on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T18:08:08.000Z",
    "title": "XRP Gains Recognition: State Bank of Pakistan Hails Ripple’s Promising Work",
    "url": "https://www.crypto-news-flash.com/xrp-gains-recognition-state-bank-of-pakistan-hails-ripples-promising-work/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-gains-recognition-state-bank-of-pakistan-hails-ripples-promising-work",
    "description": "<img width=\"512\" height=\"279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71-300x163.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The promising work of Ripple and XRP was recognized by the State Bank of Pakistan (SBP) in a 2022 financial stability report. The report also highlights some risks associated with crypto assets including money laundering and terrorism financing. Amid the backdrop of regulatory uncertainties and crypto-related crackdowns within some selected regions, the State Bank of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T18:00:46.000Z",
    "title": "Shibarium, Shiba Inu, Dogecoin, ApeMax, ShibaSwap, and Pepe Coin: ApeMax Takes Center Stage in a Busy Crypto Landscape",
    "url": "https://www.crypto-news-flash.com/shibarium-shiba-inu-dogecoin-apemax-shibaswap-and-pepe-coin-apemax-takes-center-stage-in-a-busy-crypto-landscape/?utm_source=rss&utm_medium=rss&utm_campaign=shibarium-shiba-inu-dogecoin-apemax-shibaswap-and-pepe-coin-apemax-takes-center-stage-in-a-busy-crypto-landscape",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-124.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-124.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-124-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto universe is all aflutter with names like Shibarium, Shiba Inu, Dogecoin, ShibaSwap, and Pepe Coin. Shibarium is the anticipated Layer 2 solution for Shiba Inu, ShibaSwap provides decentralized exchange services, while Dogecoin and Pepe Coin have already marked their territory as top meme coins. However, amidst these crypto titans, there&#8217;s a fresh player [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T18:00:12.000Z",
    "title": "Discover the Next Big Thing: Bitcoin Spark’s Revolutionary Technology Sets It Apart from Solana and Dogecoin",
    "url": "https://www.crypto-news-flash.com/discover-the-next-big-thing-bitcoin-sparks-revolutionary-technology-sets-it-apart-from-solana-and-dogecoin/?utm_source=rss&utm_medium=rss&utm_campaign=discover-the-next-big-thing-bitcoin-sparks-revolutionary-technology-sets-it-apart-from-solana-and-dogecoin",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-77.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-77.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-77-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-77-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Technology is developing rampantly and evolving. One of the recent innovations in the technological space is blockchain. Blockchain is an ecosystem designed to promote decentralization in the finance arena, enabling participants to conduct peer-to-peer transactions without needing a third party. The new crypto project will take over the industry in a gradual manner. The platform [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T17:55:00.000Z",
    "title": "FTX Seeks Galaxy Digital to Sell Remaining Crypto Holdings",
    "url": "https://coinedition.com/ftx-seeks-galaxy-digital-to-sell-remaining-crypto-holdings/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Celebrity Running Away\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/FTX-Celebrity-Running-Away-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to the latest reports, Billionaire Michael Novogratz’s Galaxy Digital Holdings Ltd. has been hired by FTX to help sell crypto holdings. “A comprehensive management and monetization” developed by the bankrupt crypto exchange aims to protect it from market volatility, as well as “prepare for potential dollarized distribution to creditors.” Bloomberg noted that the regulations [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-seeks-galaxy-digital-to-sell-remaining-crypto-holdings/\">FTX Seeks Galaxy Digital to Sell Remaining Crypto Holdings</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-24T18:05:38.000Z",
    "title": "One Social Metric Is Now Flashing a Bullish Signal After Bitcoin Crash to Under $26,000: Santiment",
    "url": "https://dailyhodl.com/2023/08/24/one-social-metric-is-now-flashing-a-bullish-signal-after-bitcoin-crash-to-under-26000-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analytics platform Santiment says that a key social metric indicates crypto markets may soon rebound after crashing. Santiment says that after Bitcoin’s sudden collapse below $26,000, the use of the term “bear market” has increased to an 11-week high on social media platforms, which is a bullish signal. &#8220;A positive sign that crypto markets [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/24/one-social-metric-is-now-flashing-a-bullish-signal-after-bitcoin-crash-to-under-26000-santiment/\">One Social Metric Is Now Flashing a Bullish Signal After Bitcoin Crash to Under $26,000: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]