[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T19:15:39.000Z",
    "title": "Web3 Payments Firm Transak Raises $20M",
    "url": "https://www.coindesk.com/web3/2023/05/30/web3-payments-firm-transak-raises-20m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The startup offers on- and off-ramps that could make it easier for new users to interact with Web3 projects."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-30T19:09:15.000Z",
    "title": "Texas Bill That Would Limit Miners' Participation in Cost-Saving Grid Programs Stopped in House Committee",
    "url": "https://www.coindesk.com/policy/2023/05/30/texas-bill-that-would-limit-miners-participation-in-cost-saving-grid-programs-stopped-in-house-committee/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The legislation would have capped the industry's participation in demand response programs."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-30T18:45:53.000Z",
    "title": "Should Russia Bolster or Ban Bitcoin?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/05/30/should-russia-bolster-or-ban-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The country reportedly backed out of plans to build a \"national crypto exchange,\" its latest sign of indecision."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T19:00:00.000Z",
    "title": "US district judge sends matter of FTX independent examiner to appellate court",
    "url": "https://cointelegraph.com/news/us-district-judge-sends-matter-of-ftx-independent-examiner-to-appellate-court",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/ca173e6e-b478-426d-ab41-ebe482d72a42.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A bankruptcy judge denied a motion for an independent examiner in February, leading to an appeal that may now go to the U.S. Court of Appeals for the Third Circuit.</p>\n                    <p><p>A United State district judge has referred a motion requesting the appointment of an independent examiner for bankrupt crypto exchange FTX to appellate court.</p><p>In documents filed in U.S. District Court for the District of Delaware on May 30, Judge Colm Connolly <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.ded.81702/gov.uscourts.ded.81702.39.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the U.S. trustee in FTX’s case, Andrew Vara, requested an appeal following the bankruptcy court <a href=\"https://cointelegraph.com/news/ftx-bankruptcy-judge-denies-us-trustee-s-motion-to-appoint-independent-examiner\">rejecting a motion</a> in February to appoint an examiner overseeing the failed crypto exchange. According to court filings, bankruptcy laws allow the appointment of an independent examiner when certain conditions are met — as in the case of FTX — but do not require it. </p><p>“Whether [law] mandates the appointment of an examiner upon the U.S. Trustee’s request when the debtor’s debts specified in the statute exceed $5 million is, of course, a question of law,” said Connolly. “Because the Bankruptcy Court rejected the Trustee’s request for the appointment of an examiner based in part on its answer to that question, [...] Certification of the Order for an appeal to the Third Circuit is therefore required.”</p><p>Lawyers for FTX debtors have <a href=\"https://cointelegraph.com/news/ftx-lawyers-examiner-could-cost-100m-and-provide-no-benefit\">argued that the appointment</a> of an examiner in the bankruptcy case would cost roughly $100 million and “provide no benefit” for creditors. However, Vara — representing the interests of the U.S. Justice Department — and several U.S. lawmakers have <a href=\"https://cointelegraph.com/news/us-lawmakers-call-on-court-to-approve-independent-examiner-in-ftx-bankruptcy-case\">called on the court</a> to do so to prevent potential conflicts of interest.</p><p>Bankruptcy Judge John Dorsey denied Vara’s motion in February, leading to the U.S. trustee appealing in March. The matter will now likely go to the U.S. Court of Appeals for the Third Circuit.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-relaunch-soon-court-filing-shows-plan\"><strong><em>FTX 2.0 launching soon? Court filing shows a reboot plan in the works</em></strong></a></p><p>FTX filed for Chapter 11 bankruptcy protection in November 2022, while the criminal case against former CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> continues to move forward. Bankman-Fried has largely been confined to his parents’ California home since his extradition from the Bahamas to the U.S. in December, with his trial expected to begin in October.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T18:40:15.000Z",
    "title": "Binance considers allowing investors to hold collateral in banks",
    "url": "https://cryptoslate.com/binance-considers-allowing-investors-to-hold-collateral-in-banks/",
    "description": "<p>Binance is exploring the possibility of letting some of its institutional clients hold their trading collateral for margin trading in spot and derivatives at a bank, according to Bloomberg. The exchange reportedly spoke to several institutional clients about enabling bank-held collateral deposits, with Swiss-based FlowBank and Liechtenstein-based Bank Frick named as potential intermediaries for the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-considers-allowing-investors-to-hold-collateral-in-banks/\">Binance considers allowing investors to hold collateral in banks</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-30T19:30:34.000Z",
    "title": "Tether Expands: Stablecoin Issuer Announces Sustainable Bitcoin Mining Project in Uruguay",
    "url": "https://news.bitcoin.com/tether-expands-stablecoin-issuer-announces-sustainable-bitcoin-mining-project-in-uruguay/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/minerrrrs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After announcing its plan to invest 15% of profits into bitcoin, the company Tether Limited has taken another step toward its crypto goals. Tether, the stablecoin issuer, has revealed its latest venture: &#x201C;sustainable bitcoin mining operations in Uruguay.&#x201D; Tether has partnered with a licensed local company to make this happen, as it believes Uruguay is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T19:38:11.000Z",
    "title": "Bitcoin Ordinals surpass 10 Million inscriptions on the network",
    "url": "https://www.cryptopolitan.com/bitcoin-ordinals-surpass-10m-inscriptions/",
    "description": "Shortly after founder Casey Rodarmor resigned as caretaker, Bitcoin Ordinals, a popular way to create assets on the blockchain, have topped 10 million inscriptions, marking a significant milestone. Over 25,000 Bitcoin-based tokens have been generated, which furthered the rise once the BRC-20 token standard was introduced. Founder Resigns as Bitcoin&#8217;s Ordinals Project Custodian Shortly after ... <a title=\"Bitcoin Ordinals surpass 10 Million inscriptions on the network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-ordinals-surpass-10m-inscriptions/\" aria-label=\"More on Bitcoin Ordinals surpass 10 Million inscriptions on the network\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T19:17:21.000Z",
    "title": "Concerns arise over Bitcoin price disparity on Binance Australia and BTC Markets",
    "url": "https://www.cryptopolitan.com/bitcoin-price-disparity-on-binance-australia/",
    "description": "The price of bitcoin dropped significantly by almost $6000 on Binance Australia, a significant crypto exchange on May 30. Trading activity indicated a strong willingness to sell, driving the price of bitcoin on Binance Australia down to $22,000 from $28,000 on the local exchange, BTC Markets. Market watchers have taken notice of this dramatic price ... <a title=\"Concerns arise over Bitcoin price disparity on Binance Australia and BTC Markets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-disparity-on-binance-australia/\" aria-label=\"More on Concerns arise over Bitcoin price disparity on Binance Australia and BTC Markets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T19:04:03.000Z",
    "title": "How Much Will Bitcoin Be Worth in 2030? A Glimpse Into BTC’s Future",
    "url": "https://www.cryptopolitan.com/how-much-will-bitcoin-be-worth/",
    "description": "The potential for significant financial gains has made Bitcoin a popular investment choice in recent years. As you consider whether to invest in Bitcoin, one question that looms large is how much the cryptocurrency will be worth in the future. Many projections and predictions have been made, each offering a glimpse into the potential future ... <a title=\"How Much Will Bitcoin Be Worth in 2030? A Glimpse Into BTC’s Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-much-will-bitcoin-be-worth/\" aria-label=\"More on How Much Will Bitcoin Be Worth in 2030? A Glimpse Into BTC’s Future\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T18:58:17.000Z",
    "title": "Binance CEO: Buying a bank will not fix crypto’s debanking problem",
    "url": "https://www.cryptopolitan.com/binance-ceo-buying-a-bank-wont-fix-problem/",
    "description": "Binance CEO Changpeng Zhao (CZ) has voiced concerns about the company&#8217;s plans to acquire traditional financial institutions. He said that issues including complex regulations and high capital requirements influenced the choice. CZ highlighted that Binance is likely to pursue something other than the acquisition of banks as a response to the growing worry over crypto ... <a title=\"Binance CEO: Buying a bank will not fix crypto&#8217;s debanking problem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ceo-buying-a-bank-wont-fix-problem/\" aria-label=\"More on Binance CEO: Buying a bank will not fix crypto&#8217;s debanking problem\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T18:55:57.000Z",
    "title": "Bitcoin price analysis: BTC value upgrades to $27,719 as bulls exhibit control",
    "url": "https://www.cryptopolitan.com/bitcoin-price-analysis-2023-05-30/",
    "description": "The Bitcoin price analysis for today shows that bulls are exhibiting control over the short-term market sentiment. After a brief period of consolidation, BTC is back on its uptrend and has surged above the $27,577 region, with an increase of nearly 0.14% in the last 24 hours. The Bulls are now looking to push the ... <a title=\"Bitcoin price analysis: BTC value upgrades to $27,719 as bulls exhibit control\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-analysis-2023-05-30/\" aria-label=\"More on Bitcoin price analysis: BTC value upgrades to $27,719 as bulls exhibit control\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T18:39:45.000Z",
    "title": "Jimbos protocol offers deal to attacker following exploit",
    "url": "https://www.cryptopolitan.com/jimbos-protocol-offers-deal-attacker-exploit/",
    "description": "In a recent incident, the team behind the decentralized finance (DeFi) application Jimbos Protocol has taken a unique approach to deal with an exploiter who drained $7.5 million from its treasury-owned liquidity pool. The team has offered the attacker a proposition: return 90% of the funds and keep the remaining 10%, or face potential prosecution ... <a title=\"Jimbos protocol offers deal to attacker following exploit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jimbos-protocol-offers-deal-attacker-exploit/\" aria-label=\"More on Jimbos protocol offers deal to attacker following exploit\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-30T19:00:31.000Z",
    "title": "Cosmos (ATOM) and Polkadot (DOT) Investors Flock to InQubeta (QUBE) Presale Amid Substantial Hype",
    "url": "https://nulltx.com/cosmos-atom-and-polkadot-dot-investors-flock-to-inqubeta-qube-presale-amid-substantial-hype/",
    "description": "The cryptocurrency market is abuzz with excitement as investors from the Cosmos (ATOM) and Polkadot (DOT) ecosystems flock to participate in the presale of InQubeta (QUBE). This highly anticipated event has attracted significant attention and generated substantial hype within the crypto community. InQubeta Provides A Compelling Proposition For Investors InQubeta&#8217;s presale offers a unique opportunity [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T18:51:44.000Z",
    "title": "Crypto bear market not hurting Grayscale Investments",
    "url": "https://crypto.news/crypto-bear-market-not-hurting-grayscale-investments/",
    "description": "The 2023 fiscal year has been an exceptional one for Grayscale Investments, despite the ongoing bear market in the world of cryptocurrencies. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T19:30:37.000Z",
    "title": "Fantom (FTM) Gas Incentive: The Secret Sauce To Reclaiming L1 Dominance",
    "url": "https://www.newsbtc.com/fantom/fantom-ftm-gas-incentive-the-secret-sauce-to-reclaiming-l1-dominance/",
    "description": "Fantom (FTM), a leading Layer 1 (L1) blockchain platform, has launched a new Gas Monetization program to incentivize high-quality Decentralized Applications (dApps) and attract top talent to the ecosystem.  With the recent announcement of the long-term vision for the protocol by Andre Cronje, co-founder of the blockchain platform, the community is buzzing with excitement for the future of Fantom. Fantom’s Gas Monetization, which just went live on May 28th, is one of the most highly anticipated updates for the platform. The governance proposal was first approved in January 2023, with an overwhelming 99.8% of the votes, showcasing the community&#8217;s support for the initiative. Related Reading: Bitcoin Miners Receive Inflows Of 7,000 BTC, What Does It Mean? Fantom Launches Gas Monetization Program Gas monetization is an incentive program to reward high-quality dApps for their generated fees. These dApps will receive a 15% kickback on all the gas fees generated, incentivizing development and attracting more developers to the ecosystem. The money for this reward comes from the fact that the FTM burn rate will be reduced from 20% to 5%. This is a win-win situation for both developers and the Fantom network. Developers are compensated for the value they create on the network, while the network benefits from increased adoption and usage. The reduction in the FTM burn rate also helps control inflation and gives more stability to the token&#8217;s value. Francesco, a leading figure in the blockchain industry, remarked that this incentivization of development is exactly what Fantom needs to achieve its goals. With Gas Monetization, the platform is taking a significant step forward to become one of the leading L1 giants in the blockchain industry. However, the mechanism could be targeted by spam dApps and malicious actors trying to exploit it. To prevent such exploits, Fantom has implemented certain criteria that dApps must meet to be eligible for Gas Monetization. Fantom&#8217;s Eligibility Criteria A dApp must have completed at least 1 million transactions and been live on the Fantom network for at least 3 months to be eligible. These criteria are valid for each smart contract on the Fantom mainnet and may be subject to change during the program based on their effectiveness. Once approved for the program, dApps will receive 15% of the gas fees they generate. The FTM tokens received are unlocked and can be used as the dApps see fit. However, what happens to the 15% share of gas fees made by dApps that do not participate in the Gas Monetization Program? These transactions are ineligible and do not qualify for the 15% share of gas fees. The Fantom Foundation has clarified that only dApps that meet the eligibility criteria can participate in the Gas Monetization Program and receive rewards for their contributions to the network. The Foundation also reserves the right to suspend rewards to participating dApps for any necessary reason, including fraudulent user activity or the overall well-being of the Fantom ecosystem. The Gas Monetization Program is a great opportunity for dApps to showcase their value and be rewarded for their contributions to the network. However, ensuring that spam dApps or malicious actors do not exploit the program is essential. Related Reading: NFT Market Update: Major Collections Suffer Price Slump in 2023 This new approach is just a series of incentives Fantom builds to attract developers and keep them engaged with the ecosystem. The platform&#8217;s long-term vision includes creating a decentralized finance (DeFi) ecosystem that is fast, secure, and user-friendly, with various dApps and tools that make it easy for users to interact with the network. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-30T18:45:41.000Z",
    "title": "Solana (SOL) Price Should Be ‘Bare Minimum’ 3x Higher, According to InvestAnswers",
    "url": "https://dailyhodl.com/2023/05/30/solana-sol-price-should-be-bare-minimum-3x-higher-according-to-investanswers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Should-bare-Minimum-sol.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst thinks that the Ethereum (ETH) competitor Solana (SOL) is dramatically undervalued. In a new update, the anonymous host of InvestAnswers tells his 444,000 YouTube subscribers that the number of daily active addresses on Solana rivals that of Ethereum, yet it is currently only worth 1/25th of ETH&#8217;s market cap. &#8220;[Solana] does way [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/30/solana-sol-price-should-be-bare-minimum-3x-higher-according-to-investanswers/\">Solana (SOL) Price Should Be ‘Bare Minimum’ 3x Higher, According to InvestAnswers</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-30T18:41:57.000Z",
    "title": "Negative Crypto Sentiment Pervades Institutions, Bitcoin, and Altcoins Witness Sell-Offs: CoinShares",
    "url": "https://dailyhodl.com/2023/05/30/negative-crypto-sentiment-pervades-institutions-bitcoin-and-altcoins-witness-sell-offs-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/binance-witnesses-staggering-outflows.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are weathering negative sentiment on the market as Bitcoin (BTC) and altcoins suffer major outflows for the sixth week in a row. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that institutional investors sold off $39 million in crypto holdings last week, with trading volumes remaining low. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/30/negative-crypto-sentiment-pervades-institutions-bitcoin-and-altcoins-witness-sell-offs-coinshares/\">Negative Crypto Sentiment Pervades Institutions, Bitcoin, and Altcoins Witness Sell-Offs: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]