[
  {
    "source": "Decrypt",
    "date": "2023-08-18T08:59:34.000Z",
    "title": "Securitize Acquires $40B Crypto Fund Manager Onramp Invest",
    "url": "https://decrypt.co/152794/securitize-acquires-40b-crypto-fund-manager-onramp-invest",
    "description": "The undisclosed acquisition means that RIAs from Onramp Invest will be able to turn to Securitize's tokenization offering."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-18T08:44:00.000Z",
    "title": "Big Win For Crypto As SEC Gives Green Light To Ether Futures ETFs",
    "url": "https://cryptodaily.co.uk/2023/08/big-win-for-crypto-as-sec-gives-green-light-to-ether-futures-etfs",
    "description": "<p>The United States Securities Commission (SEC) is all set to greenlight the first exchange-traded funds (ETFs) based on Ether (ETH) futures in a big win for the crypto space.</p>\n<p>Nearly a dozen companies have expressed interest and filed applications with the SEC to launch ETFs.</p>\nBig Win For Crypto\n<p>According to sources familiar with the matter, the regulator will not block or oppose products. This comes as a major relief to companies who have filed with the Securities and Exchange Commission, including Bitwise, Roundhill, ProShares, and Volatility Shares. However, it is still unclear which funds would receive the nod from the SEC. Officials and sources close to the matter have stated that approvals could come as early as October, but the SEC has yet to comment on the matter. Ether (ETH) is the native token of the Ethereum blockchain and is the world&rsquo;s second-largest cryptocurrency in terms of market capitalization, second only to Bitcoin.</p>\nThe SEC&rsquo;s Changing Stance\n<p>The Securities and Exchange Commission has repeatedly blocked previous attempts at an ETF based directly on a cryptocurrency. However, in late 2021, the regulator began permitting trading in a fund that involved Bitcoin futures contracts trading on the Chicago Mercantile Exchange. Since then, speculation has been growing that the Securities and Exchange Commission would allow a product with Ether futures which would also be traded on the exchange.</p>\n<p>However, despite the buzz and excitement, the Securities and Exchange Commission has dragged its feet when it comes to approvals for a product that involves derivatives in Ether. Data from CoinGecko shows that ETH commands a market value of just under $200 billion, second only to Bitcoin, which has a market value of nearly $700 billion.</p>\nHope For Bitcoin ETFs?\n<p>However, the Securities and Exchange Commission is still pushing back against Bitcoin-based ETFs and is locked in a tense standoff with the crypto industry on the matter. Grayscale Investments has already challenged the Securities and Exchange Commission&rsquo;s rejection of its application to convert its Bitcoin trust into an ETF. A panel of US federal appellate court judges will be deciding on the matter soon.</p>\n<p>On its part, the Securities and Exchange Commission has argued that the crypto space is fraught with several hazards. The regulator has repeatedly expressed concerns about price manipulation and insufficient liquidity when it comes to crypto. The regulator has also flagged Bitcoin&rsquo;s volatility as a threat, especially to newer investors. However, several firms, including BlackRock, have filed applications with the Securities and Exchange Commission to list ETFs based on Bitcoin. BlackRock&rsquo;s filing had a considerable impact on the market, pushing the price of Bitcoin above $31,000. However, since then, the price has hovered around the $29,000 mark.</p>\nValkyrie&rsquo;s ETF Filing\n<p>Asset management firm Valkyrie has also submitted an application to the United States Securities and Exchange Commission for an Ethereum (ETH) futures exchange-traded fund. The application signals the asset manager&rsquo;s intention to move beyond just offering Bitcoin futures ETFs. Valkyrie had filed the application on the 16th of August. The application stated that the ETF would not directly invest in ETH, purchasing ETH futures contracts instead.</p>\n<p>The application also outlines a specific limit on the ETF&rsquo;s investment in ETH futures contracts. As per the application, the investments are capped at 8000 contracts per month. This has been done to comply with position limits set by the Chicago Mercantile Exchange. If the Securities and Exchange Commission approves the application, investors will be able to speculate on ETH&rsquo;s future price movements via the ETF. Valkyrie also plans to invest in cash, cash-like instruments, or high-quality securities. These include government-issued bonds, bills, notes, money market funds, and corporate debt securities.</p>\n<p>Valkyrie is one of several asset managers looking for approval for an Ether futures ETF. Others include VanEck, Grayscale, Bitwise, ProShares, Volatility Shares, and Round Hill Capital.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T08:47:14.000Z",
    "title": "Google May Have Been Tracking Children Online via AI-Powered YouTube Ad System, Research Finds",
    "url": "https://www.cryptopolitan.com/google-may-have-tracked-children-on-youtube/",
    "description": "New research findings by Adalytics show Google may have been tracking and targeting children with ads for adult products on YouTube using an ad-targeting system powered by artificial intelligence.  Adalytics Finds YouTube Ads for Adult Products Are Shown to Children Adalytics said it found over 300 brands’ ads for adult products, like cars, displayed on ... <a title=\"Google May Have Been Tracking Children Online via AI-Powered YouTube Ad System, Research Finds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-may-have-tracked-children-on-youtube/\" aria-label=\"More on Google May Have Been Tracking Children Online via AI-Powered YouTube Ad System, Research Finds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T08:40:39.000Z",
    "title": "US Judge grants SEC permission to seek South Korea’s assistance in Terraform Labs case",
    "url": "https://www.cryptopolitan.com/us-judge-grants-sec-permission-for-south-koreas-assistance/",
    "description": "U.S. District Judge Jed Rakoff has granted the Securities and Exchange Commission (SEC) to engage the South Korean government&#8217;s cooperation in questioning Daniel Shin, the co-founder of Terraform Labs, and in gathering evidence from Chai Corp., a payments company.&#160; This decision marks a significant development in the SEC&#8217;s case against Terraform Labs and its ex-CEO, ... <a title=\"US Judge grants SEC permission to seek South Korea&#8217;s assistance in Terraform Labs case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-judge-grants-sec-permission-for-south-koreas-assistance/\" aria-label=\"More on US Judge grants SEC permission to seek South Korea&#8217;s assistance in Terraform Labs case\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T08:53:38.000Z",
    "title": "PEPE Coin Could Take The Spotlight After Shibarium Debut – Here’s Why",
    "url": "https://www.newsbtc.com/news/pepe-coin-could-take-the-spotlight-after-shibarium-debut-heres-why/",
    "description": "PEPE, the amphibian-themed token that kickstarted the meme coin season in April this year, remains a subject of both fascination and volatility within the cryptocurrency landscape. Its journey, marked by highs and lows, offers insights into the evolving dynamics of this speculative market. In a surprising turn of events, the meme coin arena witnessed a significant exchange of millions of SHIB and BONE tokens for PEPE, shortly after the successful launch of Shibarium&#8217;s mainnet.  A notable whale, identified by Lookonchain as per a PEPE price analysis data cited in a new analysis shifted its holdings from SHIB and sister-token BoneShibaSwap to PEPE, raising eyebrows in the crypto community.  Related Reading: PayPal And The Crypto Conundrum: Understanding The UK Sales Suspension The whale&#8217;s move, which included a substantial deposit of 143 billion SHIB into Binance, hints at a potential strategy shift and a &#8220;buy the rumor, sell the news&#8221; approach that seems to favor PEPE at the expense of SHIB. PEPE Coin price action today. Source: Coingecko However, PEPE&#8217;s recent price performance has been on a rollercoaster ride. The current price of $0.00000110, as reported by CoinGecko, reflects an 8% slump in the last 24 hours and a 12% decline over the past seven days. This stark fluctuation highlights the inherent volatility of meme coins, where sudden shifts in sentiment can lead to rapid price movements. PEPE Social Volume, Holder Numbers Paint A Complex Picture The report&#8217;s analysis reveals an intricate pattern in PEPE&#8217;s social volume over the past month. The coin&#8217;s popularity has swung back and forth, indicating days of heightened interest juxtaposed with relative indifference.  However, in the face of this up-and-down pattern, a notable trend emerged &#8211; the rise in the number of PEPE holders. Currently, the coin boasts a total of 137,000 holders, underscoring a dedicated community that remains engaged despite the market&#8217;s unpredictable nature. PEPE total amount of holders. Source: Santiment. The Quest For New Meme Coins On DEXes In the wake of PEPE&#8217;s price correction, traders have turned their attention to emerging meme coins on Decentralized Exchanges. The allure of new low market cap cryptocurrencies lies in their potential for exponential gains before even making their way to Centralized Exchanges. These gains are often followed by retracements, as shorting opportunities become available post-listing. PEPE is currently trading at $0.0000010965. Chart by TradingView.com A stand-out example post-PEPE&#8217;s correction is HarryPotterObamaSonic10Inu (BITCOIN), a meme coin that has secured a consistent spot among the top 10 trending cryptocurrencies on DEXTools. Its journey underscores the dynamic nature of meme coin investments, as traders seek the next opportunity to ride the wave of speculative enthusiasm. Related Reading: LUNC Sheds 13% Of Its Value – A Further Retreat In The Offing? In the world of meme coins, PEPE&#8217;s story mirrors the wider crypto market&#8217;s blend of excitement, uncertainty, and the continuous pursuit of the next big opportunity. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Benzinga"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T08:44:58.000Z",
    "title": "Shiba Inu: All $1.7B Funds Are Safe and Not Stuck in Shibarium Bridge; Shytoshi Kusama Takes a Stand Against FUD – Price Plummets by 14%",
    "url": "https://www.crypto-news-flash.com/shiba-inu-all-1-7b-funds-are-safe-and-not-stuck-in-shibarium-bridge-shytoshi-kusama-takes-a-stand-against-fud-price-plummets-by-14/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-all-1-7b-funds-are-safe-and-not-stuck-in-shibarium-bridge-shytoshi-kusama-takes-a-stand-against-fud-price-plummets-by-14",
    "description": "<img width=\"509\" height=\"339\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/SHIB.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/SHIB.jpg 509w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/SHIB-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/SHIB-104x69.jpg 104w\" sizes=\"(max-width: 509px) 100vw, 509px\" />Shiba Inu Ecosystem reassures the community that there&#8217;s no issue with the Shibarium bridge, and all funds are secure. Traffic surge causes technical difficulty, not a flaw in Shibarium&#8217;s design. In an exhilarating announcement from the Shiba Inu Ecosystem, the community was alerted via a tweet, &#8220;#SHIBARMY Check out our latest blog post here,&#8221; dispelling [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-18T08:42:00.000Z",
    "title": "BTC May Drop Below $26K as Whale Activity Continues: Report",
    "url": "https://coinedition.com/btc-may-drop-below-26k-as-whale-activity-continues-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-falls-under-26000-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of the market leader Bitcoin (BTC) fell below $26K over the past 24 hours, according to CoinMarketCap. During this period, the cryptocurrency’s price had fallen to a low of $25,409.11. This was after BTC had reached a 24-hour high of $28,655.50. The leading cryptocurrency was able to recover somewhat to trade above $26K [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-may-drop-below-26k-as-whale-activity-continues-report/\">BTC May Drop Below $26K as Whale Activity Continues: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]