[
  {
    "source": "CoinDesk",
    "date": "2024-03-19T22:00:00.000Z",
    "title": "Immutable, King River Capital, Polygon Labs Set Up $100M Web3 Gaming Fund",
    "url": "https://www.coindesk.com/web3/2024/03/19/immutable-king-river-capital-polygon-labs-set-up-100m-web3-gaming-fund/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Immutable and Polygon Labs will identify investment opportunities while King River will manage the investment process and deploy the capital across game studios and web3 infrastructure firms."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-19T22:06:01.000Z",
    "title": "BlackRock Creates Tokenized Asset Fund, SEC Filing Shows",
    "url": "https://decrypt.co/222453/blackrock-tokenized-asset-fund-institutional-liquidity",
    "description": "BlackRock's new digital fund sets $100K minimum, eyes Ethereum-based assets"
  },
  {
    "source": "Decrypt",
    "date": "2024-03-19T22:01:02.000Z",
    "title": "Ethereum Scalers Immutable and Polygon Unite for $100 Million Gaming Fund",
    "url": "https://decrypt.co/222456/ethereum-immutable-polygon-100-million-gaming-fund",
    "description": "The Inevitable Games Fund, led by King River Capital with Immutable and assistance from Polygon Labs, will invest in crypto games across platforms."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T22:00:00.000Z",
    "title": " Immutable, Polygon’s new $100M fund to throw cash at Pixelmon, among others ",
    "url": "https://cointelegraph.com/news/immutable-polygon-partner-100-million-blockchain-gaming-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMWU0OWQzMGEtYjczZi00MDUyLTgyYTAtNzk5MjA0MWQ4OTM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Immutable and Polygon have teamed up to find blockchain games for their new $100 million fund to bankroll, starting with seven games native to their blockchains.</p>\n                    <p><p>Blockchain game publisher Immutable has launched a $100 million fund to invest in blockchain games, called the “Inevitable Games Fund” — IGF for short.</p><p>Venture capital firm King River Capital and Polygon Labs also contributed to the launch of the “ecosystem-agnostic fund,” according to a statement shared with Cointelegraph.</p><p>King River will lead the investment process, with <a href=\"https://cointelegraph.com/explained/what-is-immutable-explained\">Immutable</a> and Polygon as advisors.</p><p><a href=\"https://cointelegraph.com/news/immutable-polygon-partner-100-million-blockchain-gaming-fund\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-19T21:55:45.000Z",
    "title": "BlackRock launches $100 million tokenized asset fund using Ethereum",
    "url": "https://cryptoslate.com/blackrock-launches-100-million-tokenized-asset-fund-using-ethereum/",
    "description": "<p>BlackRock, the world&#8217;s largest asset management firm, has created a new tokenized asset fund, according to a March 19 SEC filing. The initiative — dubbed the BlackRock USD Institutional Digital Liquidity Fund — is registered in the British Virgin Islands and developed in partnership with San Francisco-based Securitize, a company focused on asset tokenization. The [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrock-launches-100-million-tokenized-asset-fund-using-ethereum/\">BlackRock launches $100 million tokenized asset fund using Ethereum</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-19T22:00:37.000Z",
    "title": "Luxor and Bitnomial Roll out Hashrate Futures for US Market Ahead of Bitcoin Halving",
    "url": "https://news.bitcoin.com/luxor-and-bitnomial-roll-out-hashrate-futures-for-us-market-ahead-of-bitcoin-halving/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Luxor and Bitnomial Roll out Hashrate Futures for US Market Ahead of Bitcoin Halving\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/luxsad.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Luxor Technology Corporation, a blockchain infrastructure service provider, has unveiled plans to introduce exchange-traded hashrate futures for institutional investors in the U.S. Through a collaboration with derivatives exchange Bitnomial, this new futures product is slated to be accessible on the trading platform by the end of this month. Luxor and Bitnomial&#8217;s Partnership Introduces Exchange-Traded Hashrate [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T22:00:53.000Z",
    "title": "Bitcoin Halving Retrace Spooks Investors: What Is It And Why Does It Matter?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-halving-retrace-investors/",
    "description": "The Bitcoin price crash over the past day has taken crypto investors by surprise, leading to a full bleed day for the industry. However, while this may have come as a shock to many, some were able to call it out ahead of time. One of those is Rent Capital, which said the decline was in line with Bitcoin’s established halving trend. An Expected Crash The analysis posted by Rest Capital outlines the trends that Bitcoin has followed leading up to its halving months. In 2020, the halving fell on the month of May and in the month leading up to the rally, the Bitcoin price saw an approximately 20% decline. Related Reading: Solana Surpasses Ethereum In Major Metric Amid Surge Above $200 Over the years, Bitcoin has followed similar patterns to usher in the anticipated halving and while there has been some deviation this time around, the digital asset looks to be maintain some trends. One of these trends is the price crash before the halving. As Rekt Capital’s analysis shows, Bitcoin is right in region of where this crash is expected to happen. The previous trends have seen the price fall between 20% and 38% in the month before the halving. So taking this into account, the BTC price could crash around 25% on average if it sticks to this trend. The crypto analyst also revealed their target for if Bitcoin follows this trend. The crash is expected to push the BTC price below the $40,000. However, if the average plays out, then the price could bottom out above $40,000 before rebounding. Why This Crash Is Important For Bitcoin The crash is a confirmation that the Bitcoin price is following the established pre-halving trend and also confirms the incoming bull market. Going by the previous trends, the halving takes place after the crash, following which there is some upside the is seen with the cryptocurrency. Related Reading: Is Ripple Behind The XRP Price Crash? Massive Selling Spree Sparks Concern Then, in the months following the halving, there is massive accumulation that serves as a precursor to the bull market. In this case, this accumulation is expected to begin sometime in April 2024 and then continue on for a few months. The crash, as Rekt Capital points out, also serves as the last opportunity for cryptocurrency investors to get into position at the lowest prices. This is because once the halving is complete and the bull market begins, low prices become a thing of the past. At the time of writing, the BTC price is seeing minor recovery from its crash below $63,000. It I trading at $63,500, but with a 5.91% decline on the daily chart and a 12.19% decline on the weekly chart, according to CoinMarketCap. BTC price drops to $62,300 &#124; Source: BTCUSD on Tradingview.com Featured image from Kaspersky, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-19T22:01:49.000Z",
    "title": "This Is Arguably the Most Important Use Case for Bitcoin and Cryptocurrency, According to Brian Armstrong",
    "url": "https://dailyhodl.com/2024/03/19/this-is-arguably-the-most-important-use-case-for-bitcoin-and-cryptocurrency-according-to-brian-armstrong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Coinbase-Releases-New-Transparency-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of Coinbase is revealing what he thinks the most important use cases for cryptocurrencies are. In a new Coinbase blog post, Coinbase CEO Brian Armstrong attempts to answer the question &#8220;what is crypto even useful for?&#8221; First, Armstrong says that out-of-control money printing has caused an increasing level of economic inequality via inflation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/19/this-is-arguably-the-most-important-use-case-for-bitcoin-and-cryptocurrency-according-to-brian-armstrong/\">This Is Arguably the Most Important Use Case for Bitcoin and Cryptocurrency, According to Brian Armstrong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]