[
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T04:04:14.000Z",
    "title": " Cybertrace warns of deep fake crypto scam featuring Aussie billionaire ",
    "url": "https://cointelegraph.com/news/cybertrace-warns-deepfake-crypto-scam-andrew-forrest-mining-billionaire",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvN2JkMjNhNzAtNDRmNS00MGE3LTg5NDktOGIwNzNhOGZkYzIyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cybertrace’s CEO Dan Halpin speculates that the crypto scammers are likely well-versed in sales and marketing based on the “convincing” ruse.</p>\n                    <p><p>Cybersecurity firm Cybertrace has published a warning over a “convincing” deep fake video of Australian mining magnate and businessman Andrew “Twiggy” Forrest, seen promoting a fake crypto trading platform on social media.</p><p>The video emerged on Facebook, urging users to sign up for a fraudulent platform that purports to make “ordinary people” thousands of dollars daily. Potential victims are reportedly taken to a website called “Quantum AI,” which Cybertrace says has become a synonymous name associated with scams and financial fraud.</p><p>Cybersecurity firm Cybertrace’s CEO Dan Halpin <a href=\"https://www.theaustralian.com.au/nation/andrew-forrest-deepfake-video-scam-targets-aussies/news-story/6c53931854a4f30d2a593615a74bade9?amp\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> to The Australian that he believes “people will be fooled by this deepfake” as the scammers appeared trained in sales.</p><p><a href=\"https://cointelegraph.com/news/cybertrace-warns-deepfake-crypto-scam-andrew-forrest-mining-billionaire\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-02T03:54:00.000Z",
    "title": "XRP Whales Accumulate 67.2% of Supply Amid Price Drop",
    "url": "https://www.cryptoglobe.com/latest/2024/02/xrp-whales-accumulate-67-2-of-supply-amid-price-drop/",
    "description": "Large XRP token holders, colloquially known as whales, have seemingly been accumulating the native token of the XRP Ledger to the point they now control 67.2% of the cryptocurrency’s circulating supply, the largest amount since December 31, 2022. According to on-chain analytics firm Santiment, the price of XRP is currently at risk of falling below […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-02T04:30:58.000Z",
    "title": "30 Banks Participating in Russia’s Central Bank Digital Currency Pilot",
    "url": "https://news.bitcoin.com/30-banks-participating-in-russias-central-bank-digital-currency-pilot/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"30 Banks Participating in Russia&#039;s Central Bank Digital Currency Pilot\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/17-banks-joins-russian-central-bank-digital-ruble-pilot.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The number of banks participating in Russia&#8217;s central bank digital currency pilot has increased to 30. Seventeen banks have signed an agreement with the Bank of Russia to participate in the digital ruble program. They will join 13 other banks, about 600 citizens, and 30 trading and service companies that are already testing Russia&#8217;s central [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T04:05:25.000Z",
    "title": "Job Cuts Mount in Silicon Valley – Is the Tech Dream Fading?",
    "url": "https://www.cryptopolitan.com/job-cuts-in-silicon-valley-tech-dream-fading/",
    "description": "In a tumultuous start to 2024, Silicon Valley finds itself grappling with an unexpected surge in job cuts, echoing concerns reminiscent of the dot-com bubble era. Over 25,000 jobs have been lost within the first few weeks, sending shockwaves through the tech industry. Analysts point to a multitude of factors contributing to this unsettling trend, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T04:00:36.000Z",
    "title": "sub0 Reveals Agenda and Speaker Line-up for Next Iteration of Annual Polkadot Developer Conference in Asia",
    "url": "https://www.cryptopolitan.com/sub0-reveals-agenda-and-speaker-line-up-for-next-iteration-of-annual-polkadot-developer-conference-in-asia/",
    "description": "The hybrid physical/virtual event takes place March 12th and 13th&#160; Bangkok, Thailand (January 30, 2024) – The Polkadot Developer Conference, sub0, has announced the full agenda and final speaker lineup for its annual conference at Lhong 1919, in Bangkok, Thailand on March 12th and 13th, inviting ingenuity, collaboration and further Web3 development to Asia. sub0 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T03:47:42.000Z",
    "title": "Big Five US Tech Companies Garner $94 Billion in Q4 2023",
    "url": "https://www.cryptopolitan.com/big-five-tech-companies-94-billion-q4-2023/",
    "description": "In a resounding display of technological prowess and financial might, the Big Five tech companies in the United States have collectively raked in an astounding $94 billion in profits during the final quarter of 2023. This monumental achievement underscores the enduring dominance of Alphabet, Amazon, Apple, Meta, and Microsoft in the ever-evolving landscape of the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T04:00:36.000Z",
    "title": "Almost $1B In Altcoins Set To Flood The Market This February: Here Are The Key Ones",
    "url": "https://www.newsbtc.com/altcoin/almost-1b-in-altcoins-set-to-flood-the-market-this-february-here-are-the-key-ones/",
    "description": "February 2024 is a pivotal month, with nearly $1 billion in altcoins set to unlock. This phenomenon, crucial for investors and newcomers alike, signifies the release of previously restricted altcoins into the market, influencing supply and demand dynamics. Alex Wacy, a renowned decentralized finance (DeFi) research specialist, has highlighted this significant event, emphasizing its impact on some of the notable altcoins among this February unlock. Related Reading: These Altcoins Are Showing Most Bullish &#38; Bearish Divergences: Santiment Altcoins Unleash: The February Token Unlocks February&#8217;s token unlocks encompass a diverse range of projects. Key players such as Aptos (APT), Immutable (IMX), Sui (SUI), Sei Network (SEI), and Oasis Network (ROSE) are at the forefront of this movement. Aptos is set for a substantial release on February 12, with roughly $230 million worth of tokens poised for circulation. Despite previous unlocks, APT’s price has remained relatively stable. Similarly, IMX and SUI are preparing for significant unlocks on February 23 and February 3, respectively. IMX&#8217;s unlock is valued at around $70 million, while SUI’s, worth $100 million, is particularly noteworthy as it marks its inaugural annual unlock. SEI and ROSE are also partaking in February&#8217;s unlock, with SEI releasing $85 million worth of tokens on February 15 and ROSE’s $19 million unlock scheduled for February 18. These events come when both projects have shown modest gains in the market. Large token unlocks in February ❄️🧵: • $DYDX &#8211; $91M February 1 • $SUI &#8211; $100M February 3 • $NYM &#8211; $14M February 3 • $GMT &#8211; $28M February 9 • $CGPT &#8211; $9M February 10 • $APT &#8211; $230M February 12 • $SEI &#8211; $85M February 15 • $MANTA &#8211; $51M February 18 • $ROSE &#8211; $19M February… pic.twitter.com/aK2dT2Phkk — AlΞx Wacy 🌐 (@wacy_time1) January 31, 2024 Market Performance Analysis Of Unlocked Tokens Amid the anticipation of these altcoins unlock, SUI, IMX, and Aptos have experienced notable surges in their values, increasing by 27.3%, 10.6%, and 9.7%, respectively, over the past week. However, the last 24 hours have seen varied movements, with SUI facing a 6.4% decline, Aptos slightly up by 0.7%, and IMX reducing by a mere 0.1%. SEI and ROSE, on the other hand, have witnessed less dramatic shifts. SEI saw a 6.4% increase over the week, while ROSE gained 5.4%. However, their 24-hour performance has diverged, with SEI dropping nearly 10% and ROSE decreasing by a marginal 0.2%. These market performances reflect the broader crypto market trajectory, which has recently seen a 1.7% decline in the overall market cap, now at $1.72 trillion. This decline is led by crypto giants Bitcoin and Ethereum, which have experienced a 1.7% and 1.8% decline in their market caps over the past 24 hours. To put this into perspective, Bitcoin&#8217;s overall market cap has dropped approximately $15 billion in the past day, falling from $856 billion yesterday to $841 billion today. Related Reading: By The Numbers: How Many Altcoins Died In The Past 10 Years, Report Shows Similarly, Ethereum&#8217;s market cap has decreased by nearly $6 billion over the same period, moving from $282 billion yesterday to $276 billion today. Featured image from Unsplash, Chart from TradingView"
  }
]