[
  {
    "source": "Decrypt",
    "date": "2023-08-12T17:47:58.000Z",
    "title": "How To Bring Wall Street Into Crypto? Build Better ‘Piping,’ Says Talos CEO",
    "url": "https://decrypt.co/152315/wall-street-crypto-institutional-investors-talos-ceo",
    "description": "Anton Katz says Wall Street firms need tools that better connect them to trading opportunities similar to the ones they use on capital markets."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-12T17:44:53.000Z",
    "title": "The SEC is exceeding its authority and encroaching on Congress’ lawmaking: Senator Lummis",
    "url": "https://cryptoslate.com/the-sec-is-exceeding-its-authority-and-encroaching-on-congress-lawmaking-senator-lummis/",
    "description": "<p>U.S. Senator Cynthia Lummis filed an amicus brief on August 11 supporting Coinbase&#8217;s motion to dismiss against the U.S. Securities and Exchange Commission (SEC) lawsuit. Drawing attention to the Lummis-Gillibrand Responsible Financial Innovation Act, which aims to regulate crypto, the Senator said that there are already ongoing debates in Congress on crypto regulation. Therefore, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/the-sec-is-exceeding-its-authority-and-encroaching-on-congress-lawmaking-senator-lummis/\">The SEC is exceeding its authority and encroaching on Congress’ lawmaking: Senator Lummis</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T17:56:43.000Z",
    "title": "How Ion Protocol Redefines Trust, Liquidity, and Creditworthiness in the PoS Landscape",
    "url": "https://www.cryptopolitan.com/how-ion-protocol-creditworthiness-in-pos/",
    "description": "In the dynamic realm of blockchain and decentralized finance (DeFi), innovations reshape how we interact with digital assets and financial instruments. One of the most significant advancements is the rise of Proof-of-Stake (PoS) consensus networks, which introduce a novel approach to securing and validating transactions. At the forefront of this evolution stands Ion Protocol, a ... <a title=\"How Ion Protocol Redefines Trust, Liquidity, and Creditworthiness in the PoS Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-ion-protocol-creditworthiness-in-pos/\" aria-label=\"More on How Ion Protocol Redefines Trust, Liquidity, and Creditworthiness in the PoS Landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T17:53:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T17:49:37.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-12T17:54:35.000Z",
    "title": "Trump reveals crypto and NFT holdings",
    "url": "https://crypto.news/trump-reveals-crypto-and-nft-holdings/",
    "description": "Former President Trump reveals NFT holdings with up to $500,000 in Ethereum holdings, as the former US president continues to make trends in the crypto space.\n\n\n\n\n\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-12T18:00:23.000Z",
    "title": "Want A Bitcoin Spot ETF? Then Prove BTC Is Not Manipulated, Says SEC",
    "url": "https://www.newsbtc.com/bitcoin-news/sec-prove-bitcoin-is-not-manipulated/",
    "description": "With multiple applications for a spot Bitcoin ETF already filed, many have continued to speculate when the SEC is likely to give its approval or otherwise. To further add to speculations, Galaxy Digital CEO Mike Novogratz, citing his sources, stated that approval was likely to come within four to six months. However, recent developments seem to suggest that the wait could be longer.  SEC Stalling? In a release dated August 11, the US Securities and Exchange Commission (SEC) has moved to delay the ARK 21Shares Bitcoin ETF in a move that could be seen as a delay tactic by the regulator.  Related Reading: San Francisco’s SoFi Bank Reveals Significant Holdings In BTC, ETH, And DOGE Cathie Wood’s ARK Invest and 21Shares had collaborated again to refile for a spot Bitcoin ETF earlier this year after the SEC rejected previous applications. Following the standard procedures, the SEC was meant to approve or disapprove the application by August 13. However, with its latest order calling for public input on ARK 21 Shares application, this deadline is consequently extended.  With this, the general public has three weeks to give further comments on the proposal, while the SEC has another five weeks to respond to any comments it may receive. Furthermore, the SEC can choose to extend the deadline by 240 days at the maximum (a move that could potentially delay a final response until Jan 10, 2024). This news would most likely not come as a surprise to ARK Invest’s CEO Cathie Wood, as she had predicted a delay when speaking to Bloomberg on August 7. She also forecasted that the SEC might approve multiple Bitcoin ETF applications. However, nothing is certain, as the regulator could also deny all applications as it has done in the past. BTC price finds support above $29,300 &#124; Source: BTCUSD on Tradingview.com  Concerns Over Bitcoin Manipulation &#38; Regulation While the crypto community swallows the hard pill of the SEC’s latest move, some experts have called attention to the SEC’s multiple uses of the word “manipulation” in its latest release. This is worrisome, considering that the SEC had previously rejected spot Bitcoin ETF applications on the grounds of potential market manipulation.  Furthermore, the SEC’s continued reference to this word may also mean that the regulator, maybe in a bid to frustrate these applications, could ask that they prove that Bitcoin is not a manipulated asset class.  Related Reading: Did XRP Price Really Hit $50 On Gemini Exchange? That will undoubtedly be a huge ask considering that, over time, there have been instances that raised speculations that the crypto market can be manipulated by major players. Furthermore, Bitcoin is a borderless and decentralized currency, and even if the SEC were to move to regulate its use in the US, the ETF market could still be manipulated by external activities from outside the US. The SEC also made raised concerns about Bitcoin not having a “regulated market or significant size,” something which could hinder the approval of any spot-traded Bitcoin ETF. The agency pointed out the fact that Bitcoin Future ETFs were approved because they were regulated by the Commodity Futures Trading Commission (CFTC). Meanwhile, Bitcoin isn’t regulated by any agency. Featured image from iStock, chart from Tradingview.com"
  }
]