[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-16T07:30:16.000Z",
    "title": "US Treasury Secretary: No Alternative Reserve Currency Can ‘Replicate’ Role Played by the Dollar",
    "url": "https://news.bitcoin.com/us-treasury-secretary-no-alternative-reserve-currency-can-replicate-role-played-by-the-dollar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Treasury Secretary: No Alternative Reserve Currency Can &#039;Replicate&#039; Role Played by the Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2299876141.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />United States Treasury Secretary Janet Yellen recently told members of the U.S. Congress that while some countries are seeking to create alternatives to the greenback, no country, including China, can create a currency which replicates the dollar&#8217;s role in the global financial system. The U.S. Treasury secretary also claimed that it will not be easy [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T07:14:07.000Z",
    "title": "3AC Co-founder Faces Contempt Charges Amidst Bankruptcy Proceedings",
    "url": "https://www.cryptopolitan.com/3ac-co-founder-faces-contempt-charges/",
    "description": "Three Arrows Capital (3AC) co-founder Kyle Davies is facing potential contempt of court charges due to his failure to comply with a subpoena connected to the bankruptcy proceedings of the former crypto hedge fund, according to court filings from 3AC&#8217;s liquidators on June 14. The creditor&#8217;s legal team alleges that Davies is intentionally delaying the ... <a title=\"3AC Co-founder Faces Contempt Charges Amidst Bankruptcy Proceedings\" class=\"read-more\" href=\"https://www.cryptopolitan.com/3ac-co-founder-faces-contempt-charges/\" aria-label=\"More on 3AC Co-founder Faces Contempt Charges Amidst Bankruptcy Proceedings\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-16T07:20:18.000Z",
    "title": "What Happened To Crypto AI Tokens? Still A Worthy Investment Option?",
    "url": "https://nulltx.com/what-happened-to-crypto-ai-tokens-still-a-worthy-investment-option/",
    "description": "Crypto AI tokens have been on a roller coaster ride in 2023, driven by the general excitement around cryptocurrencies and the potential of artificial intelligence in the industry. However, the market dynamics have changed since then. Re-emergency Of Memecoins The emergence of memecoins, such as Pepe, Mong, and Turbo, diverted attention and investment from other [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T07:12:59.000Z",
    "title": "XRP Price Projection: Assessing The Ripple-Colombia Central Bank Partnership",
    "url": "https://www.newsbtc.com/news/xrp-price-projection-assessing-the-ripple-colombia-central-bank-partnership/",
    "description": "To improve the country&#8217;s high-value payment system, Colombia&#8217;s central bank is experimenting with Ripple&#8217;s new end-to-end central bank digital currency technology. How will this collaboration affect the price of XRP? On Thursday, Ripple announced that the central bank of Colombia and the Ministry of Information and Communication Technologies (MinTIC) would be exploring the use of blockchain technology in the country&#8217;s high value electronic payment system with Ripple. The central bank did not specifically state it will pilot test a central bank digital currency, even though it will employ Ripple&#8217;s CBDC platform, supported by a private version of the XRP Ledger. Ripple and @Peersyst are partnering with Colombia’s @BancoRepublica in conjunction with @Ministerio_TIC to pilot use cases that will enhance Colombia’s high-value payment system.🇨🇴 Learn more about the partnership: https://t.co/X9jyJ3pvDa — Ripple (@Ripple) June 15, 2023 Ripple has not let regulatory constraints prevent it from innovating and expanding its reach, notably in Colombia, despite the fact that the blockchain startup is still engaged in a highly publicized legal dispute with the US Securities and Exchange Commission. A Technological Solution In The Offing For Colombia? Blockchain technology was highlighted by Colombia&#8217;s minister of information and communication technology, Mauricio Lizcano, who claimed that it would offer a technological solution (Prototype) that would enable simulations of various use cases in the high-value payment system. Peersyst Technology, a blockchain technology company based in the region, is MinTIC&#8217;s direct partner. According to James Wallis, vice president of central bank engagements and CBDCs, Ripple: &#8220;By harnessing the power of the CBDC Platform, based upon the XRPL, this project will pave the way for transformative advancements in the utilization of blockchain technology within the public sector.&#8221; Ripple previously introduced its end-to-end XRPL-driven CBDC solution, which would enable central banks, financial service providers, and governments to establish their own digital currencies while also assisting them in resolving issues with CBDC deployments. The Colombian government said in August 2022 that it was looking into introducing a CBDC to facilitate transactions and decrease tax evasion, and that it also planned to prohibit cash transactions for quantities more than 10 million Colombian pesos (about $2,390). Related Reading: XRP Smothered In Red Despite Massive Whale Accumulation, Hinman Docs Release A digital asset custody technology provider, Metaco was bought by Ripple a few months ago, and its clientele includes several large, systemically significant institutions. What The Latest Collaboration Means For XRP Price Meanwhile, XRP is back in the red despite briefly rising above $0.55 earlier, adding more than $2 billion to its market capitalization in a 24-hour span, and the publication of the contentious papers pertinent to the Ripple lawsuit. At the time of writing, and after news of the Ripple-Colombia central bank partnership broke out, the price of the XRP token looked it could use more energy to extricate itself out of negative territory. According to the most recent data provided by cryptocurrency market tracker CoinMarketCap, XRP was down by almost a percent in the twenty-four hour time frame, down 8.56 percent in the last seven days, and threatening the 18 percent gain over the past month. XRP is currently trading at $0.47. XRP market cap currently at $24.8 billion. Chart: TradingView.com There are a number of possible explanations for the recent drop in the price of XRP following the announcement of the partnership between Ripple and the central bank of Colombia. XRP price all in red. Source: CoinMarketCap First, investors may not put much stock in the relationship because of the regulatory concerns that typically accompany partnerships between cryptocurrencies and traditional financial institutions. The trend of XRP&#8217;s price could be affected by selling pressure due to this uncertainty. The general state of the market and the attitude of investors could also be factors in the drop of cryptocurrency prices. Related Reading: Cardano (ADA) Price Sheds 19% As Bearish Sentiment Looms Large XRP Price Trajectory: Factors To Consider The price of XRP may fall regardless of specific news or collaborations if there is a lack of confidence in the crypto sector or a general slowdown in the broader economy. Investor emotion, market conditions, and regulatory considerations all play a role in how much of an effect the Ripple-Colombia central bank agreement has on XRP&#8217;s price. At the same time, the dispute between the SEC and Ripple is a major factor influencing the value of XRP. Although the release of the Hinman documents first boosted XRP since they appeared to support Ripple&#8217;s case, the altcoin&#8217;s price eventually fell as investors&#8217; confusion and worry overcame their initial joy. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Coin Republic"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T07:14:52.000Z",
    "title": "BlackRock’s Choice of Coinbase Custody Raises Questions as Spot-Bitcoin ETF Decision Nears: Could This Mark the Conclusion of the SEC Lawsuit? BlackRock Holds a Major Stake in COIN",
    "url": "https://www.crypto-news-flash.com/blackrocks-choice-of-coinbase-custody-raises-questions-as-spot-bitcoin-etf-decision-nears-could-this-mark-the-conclusion-of-the-sec-lawsuit-blackrock-holds-a-major-stake-in-coin/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-choice-of-coinbase-custody-raises-questions-as-spot-bitcoin-etf-decision-nears-could-this-mark-the-conclusion-of-the-sec-lawsuit-blackrock-holds-a-major-stake-in-coin",
    "description": "BlackRock, the world&#8217;s largest asset manager, surprises the crypto market with a filing for a spot Bitcoin ETF during a period of stringent regulatory action. BlackRock&#8217;s decision to choose Coinbase as the custodial service provider raises eyebrows considering the exchange is currently battling a lawsuit by the SEC. As the crypto landscape evolves rapidly, BlackRock, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T07:28:16.000Z",
    "title": "John Deaton Exposes William Hinman’s Conspiracy with the SEC",
    "url": "https://coinedition.com/john-deaton-exposes-william-hinmans-conspiracy-with-the-sec/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/072-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/072-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/072-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/072.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>John E Deaton, the founder of the digital service news platform CryptoLaw, and popular XRP attorney denounced William Harold Hinman’s deposition of July 2021, accosting that Hinman’s response to the Court’s questions was fabricated. In July 2021, Hinman was summoned to the US District Court Southern District of New York for the deposition, during which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/john-deaton-exposes-william-hinmans-conspiracy-with-the-sec/\">John Deaton Exposes William Hinman’s Conspiracy with the SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]