[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T07:55:32.000Z",
    "title": "ProShares' Bitcoin Futures ETF Racks Up Biggest Weekly Inflow in a Year",
    "url": "https://www.coindesk.com/markets/2023/06/26/proshares-bitcoin-futures-etf-racks-up-biggest-weekly-inflow-in-a-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Open interest on bitcoin futures have surged to the highest levels in a year."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T08:00:00.000Z",
    "title": "Web3 Gaming Platform Neon Link Announces New ‘Ascend the End’ Shooter Release for July",
    "url": "https://cryptodaily.co.uk/2023/06/web3-gaming-platform-neon-link-announces-new-ascend-the-end-shooter-release-for-july",
    "description": "<p>In the last 2 years, Web3 gaming has seen a surge in popular games and platforms revolving around virtual worlds, NFTs, and in-game assets - with play-to-earn at the heart of most successful projects.&nbsp;</p>\n<p>In Ethereum blockchain&rsquo;s virtual world, Decentraland, players can create unique avatars, develop land, and engage in social activities. Axie Infinity utilizes NFTs as in-game assets, such as weapons that players can use to battle each other and earn cryptocurrency. Role-playing action-adventure game, Lost Relics, enables players to buy or sell outfits, pets, and other in-game accessories on third-party marketplaces</p>\nNeon Link Gaming Platform\n<p>Another innovative web3 gaming platform looking to make its mark is Neon Link. The company has developed a seamless community-driven ecosystem that is powered by its own network and NEON token, specifically designed to offer a player-centric experience. The ecosystem offers developers unique web3 technology and tools to create immersive worlds with exciting opportunities and a seamless gaming experience for players.&nbsp;</p>\n<p>The Neon Link network has the bandwidth to withstand an impressive 35,000 transactions per second, and provide cheap fees whilst also promising the secure control of players' digital assets and cross-platform compatibility to boot.&nbsp;</p>\n<p>Like other already successful web3 gaming platforms Neon Link is heavily focused on community engagement, so much so that the development of the project depends on it - with players, community managers, and developers all incentivized to work together.&nbsp;</p>\n<p>An Ascendancy Powered by Blockchain</p>\n<p>Having exceeded its initial funding targets and the community growing at break-neck speed&nbsp;</p>\n<p>Neon Link has announced the release of its first big game, Ascend the End, due to launch after the public token sale in July.&nbsp;</p>\n<p>Ascend the End is a high-octane third-person shooter that takes place in an apocalyptic world where players must strategize, loot, craft, and fight to survive. The game offers a collective campaign narrative with a variety of competitive multiplayer modes, in-game rewards, and loads of customizations for player characters and a multitude of in-game items.&nbsp;</p>\n<p>The arena-based shooter/looter boasts multiplayer combat, with adrenaline-pumping gameplay interwoven with RPG elements. Players will be tasked with creating a unique hero character, mastering various skills, and battling to climb leaderboards for exclusive crypto rewards. The game offers an array of unique weapons &amp; exo-suits that can be discovered, customized, and traded on the Neon Link marketplace using neon swap.&nbsp;&nbsp;</p>\nHow to Join Neon Link\n<p>Anyone who sets up a Neon Tresor wallet can participate in the Neon Link ecosystem and enter a decentralized world where players truly own their in-game assets, and the choice to own a piece of new games, have a say in the governance of the network, and earn crypto rewards, through gaming, staking, and participation.&nbsp;&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T07:46:00.000Z",
    "title": "Celsius Lenders Allege Wintermute Helped Firm In Wash Trading",
    "url": "https://cryptodaily.co.uk/2023/06/celsius-lenders-allege-wintermute-helped-firm-in-wash-trading",
    "description": "<p>Creditors of bankrupt crypto lender Celsius have amended their lawsuit to include Wintermute, alleging that the firm assisted executives of the lending firm by facilitating wash trading and fraudulently manipulating trading volumes.&nbsp;</p>\nWintermute Caught In Legal Quagmire&nbsp;\n<p>According to the new court filing, Wintermute Trading Ltd has been added as a new defendant in the ongoing class action lawsuit against Celsius Network. Celsius creditors recently amended the lawsuit filed in the United States District Court for the District of New Jersey, alleging that executives from the bankrupt crypto lender had engaged Wintermute to facilitate wash trading and inflate the trading volume on the platform. According to the filing, this was done between March 2021 and June 2022, when the firm froze withdrawals. Wash trading is a type of market manipulation where a company creates the illusion that an asset is trading at a higher volume than it actually is.&nbsp;</p>\n\n<p>&ldquo;Defendant Wintermute and the Executive Defendants engaged in a scheme that artificially inflated the trading volume of the CEL tokens sold and marketed by Celsius.&rdquo;</p>\n\n<p>The filing also stated that the alleged scheme was discovered through publicly available internal conversations between executives from Celsius. Furthermore, it was also reported that Celsius did not have any measures to prevent improper or malicious wash trading.&nbsp;</p>\n\n<p>&ldquo;The supposed controls were virtually non-existent, and those that did exist did not monitor for or protect against &ldquo;wash trading&rdquo; or self-dealing.&rdquo;</p>\n\n<p>Before it filed for bankruptcy, Celsius allegedly transferred $160 million of wrapped bitcoin to third-party wallets. It is alleged that Wintermute controlled several of these wallets. According to blockchain intelligence firm Arkham, Celsius also ended up moving around $20 million worth of wrapped Ethereum (WETH) into a Wintermute-controlled wallet. Wintermute itself was caught up in a hacking fiasco in September 2022, when the protocol suffered a breach and ended up losing around $160 million across 90 assets held in the company&rsquo;s portfolio. Following the hack, the Wintermute CEO had to reassure users, lenders, and partners that the company remained solvent.&nbsp;</p>\nFahrenheit Acquires Celsius Assets&nbsp;\n<p>The developments come after it was reported that Celsius assets had been acquired through an auction. According to reports published on the 25th of May, crypto consortium Fahrenheit had acquired the Celsius assets after a successful bid. The assets were previously valued at $2 billion. As a result of the successful bid, the Fahrenheit consortium acquired Celsius Network&rsquo;s staked cryptocurrencies, institutional loan portfolio, mining units, and several other alternative investments made by the lender. The acquisition comes nearly a year after Celsius filed for Chapter 11 bankruptcy in July 2022.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T08:00:00.000Z",
    "title": "Bitcoin surges above $30,000, DigiToads presale hits $5.7 million",
    "url": "https://crypto.news/bitcoin-surges-above-30000-digitoads-presale-hits-5-7-million/",
    "description": "Bitcoin (BTC) and digitoads (TOADS) have been making notable progress and achieving new milestones in the crypto market despite regulatory challenges in Europe"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T07:42:57.000Z",
    "title": "High exchange inflow shows correction possibility for bitcoin",
    "url": "https://crypto.news/high-exchange-inflow-shows-correction-possibility-for-bitcoin/",
    "description": "The latest bull run has helped the global crypto market to rise by roughly $150 billion in just two weeks. However, as the heat grew, selling pressure rose nonetheless, triggering a notable downtrend. According to data provided by CryptoQuant, there&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T08:06:15.000Z",
    "title": "World Mobile’s Blockchain-Based Network Launches Token Buyback Program, Driving Sustainable Growth and Empowering Users",
    "url": "https://www.crypto-news-flash.com/world-mobiles-blockchain-based-network-launches-token-buyback-program-driving-sustainable-growth-and-empowering-users-2/?utm_source=rss&utm_medium=rss&utm_campaign=world-mobiles-blockchain-based-network-launches-token-buyback-program-driving-sustainable-growth-and-empowering-users-2",
    "description": "World Mobile, a blockchain-based mobile network, has launched a token buyback program to support the sustainable growth of its sharing economy. The firm has also announced the successful completion of its DeWi technology field tests in several African countries, demonstrating the scalability of their hybrid-connectivity solution. World Mobile, an innovative mobile network powered by blockchain [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T07:50:56.000Z",
    "title": "New ERC-20 Token Could Yield Massive Returns On ICO Presale Investments: $1000 ROI Per $100 Invested in $Golden Crypto",
    "url": "https://www.crypto-news-flash.com/new-erc-20-token-could-yield-massive-returns-on-ico-presale-investments-1000-roi-per-100-invested-in-golden-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=new-erc-20-token-could-yield-massive-returns-on-ico-presale-investments-1000-roi-per-100-invested-in-golden-crypto",
    "description": "The new ERC-20 token, Golden Inu, has 12 days left in its initial coin offering [ see ICO here ].  It’s currently in the second round of the presale and reached 31% fulfilled.   Over US$80,000 has been raised in the ICO event,  which has a soft cap of 50 $ETH [Ethereum coins] or about [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T07:43:55.000Z",
    "title": "BREAKING: SEC Approves First Leveraged Bitcoin Futures ETF – Will it Drive Bitcoin Price to New All-Time High of $100,000?",
    "url": "https://www.crypto-news-flash.com/breaking-sec-approves-first-leveraged-bitcoin-futures-etf-will-it-drive-bitcoin-price-to-new-all-time-high-of-100000/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-sec-approves-first-leveraged-bitcoin-futures-etf-will-it-drive-bitcoin-price-to-new-all-time-high-of-100000",
    "description": "The SEC has approved the first-ever leveraged Bitcoin futures exchange-traded fund (ETF), allowing institutional investors to speculate on the price of Bitcoin with double leverage. The approval of the leveraged Bitcoin futures ETF raises speculation about the potential impact on Bitcoin&#8217;s price, with some suggesting it could drive the cryptocurrency to a new all-time high [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-26T08:08:43.000Z",
    "title": "3 Ways to Replace Traditional Centralized Exchanges",
    "url": "https://www.altcoinbuzz.io/product-release/3-ways-to-replace-traditional-centralized-exchanges/",
    "description": "<p>The SEC is taking aim at Centralized Exchanges (CEXs) again. This time, it&#8217;s going for the biggest players in the game &#8211; Binance and Coinbase. Indeed, the SEC has sued both these CEXs for violating federal &#8220;securities laws&#8221;. If you&#8217;re an American crypto investor, you should be concerned.  If CEXs like Binance.us and Coinbase cease [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/3-ways-to-replace-traditional-centralized-exchanges/\">3 Ways to Replace Traditional Centralized Exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]