[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T21:29:49.000Z",
    "title": "Sequoia Capital Slashes Crypto Fund From $585M to $200M : WSJ",
    "url": "https://www.coindesk.com/business/2023/07/27/sequoia-capital-slashes-crypto-fund-from-585m-to-200m-wsj/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The vaunted VC firm told investors earlier in the year it would shrink the fund to reflect a changed market."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-27T21:26:01.000Z",
    "title": "You Can Now Build Your Own AI Girlfriend—Here's How",
    "url": "https://decrypt.co/150383/you-can-now-build-your-own-ai-girlfriend-heres-how",
    "description": "Andreessen Horowitz wants to redefine the meaning of \"companionship\" with AI, and is providing the tools to make it happen."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T21:20:21.000Z",
    "title": "SEC chief accountant warns accountants about liabilities when auditing crypto firms",
    "url": "https://cointelegraph.com/news/sec-chief-accountant-warns-accountants-about-liabilities-when-auditing-crypto-firms",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e2626492-2477-4c84-91c8-18e542a3c362.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Paul Munter says making or allowing misleading statements can have serious consequences for accounting forms and individual accountants. </p>\n                    <p><p>Paul Munter, chief accountant of the United States Securities Exchange Commission (SEC), has released a statement warning accounting firms of their obligations to the agency when working with crypto firms. Allowing their finding to be misrepresented could have serious consequences, he <a href=\"https://www.sec.gov/news/statement/munter-statement-crypto-072723\" target=\"_blank\" rel=\"noopener nofollow\">said</a>.   </p><p>Crypto firms may engage accountants to “perform some sort of review of certain parts of their business, often presented as a purported ‘audit’” and falsely present the work as being comparable to a financial statement audit, Munter wrote. Doing so is not only misleading, butit can have legal liability.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-proof-of-reserves-removed-from-the-auditor-s-site\">Binance proof-of-reserves removed from the auditor's site</a></em></strong></p><p>Accounting firms have a legal obligation under the Securities Exchange Act of 1934 to look for illegal activities and report them to the SEC, Munter continued. “Material misstatement” by accountants or their clients could violate both the Securities Exchange Act and the Securities Act of 1933, resulting in censure or suspension of the firm. Those provisions can also be applied to individuals. </p><p>Munter advised accounting firms to consider these issues during client onboarding and to consider contractual prohibitions on certain language. In response to misleading statements, the position of the SEC Office of the Chief Accountant is:</p><blockquote>“As best practice, the accounting firm should consider making a noisy withdrawal, disassociating itself from the client, including by way of its own public statements, or, if that is not sufficient, informing the Commission.”</blockquote><p>The accounting firm’s independence is vital, Munter continued, and even the appearance of a mutual interest or conflict of interest in its public statements could be enough to have the firm suspended from “the privilege of appearing or practicing before the Commission.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Want to hear perspectives from the SEC Office of the Chief Accountant? Listen to our latest podcast with guest speaker SEC Chief Accountant Paul Munter for insights on accounting and audit hot topics. <a href=\"https://twitter.com/hashtag/KPMGFRV?src=hash&amp;ref_src=twsrc%5Etfw\">#KPMGFRV</a> <a href=\"https://twitter.com/hashtag/SEC?src=hash&amp;ref_src=twsrc%5Etfw\">#SEC</a> <a href=\"https://twitter.com/hashtag/audit?src=hash&amp;ref_src=twsrc%5Etfw\">#audit</a> <a href=\"https://t.co/a2MsEjOvbR\">https://t.co/a2MsEjOvbR</a></p>&mdash; Joe Bailitz (@JoeBailitz) <a href=\"https://twitter.com/JoeBailitz/status/1683642730772299776?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC does not have the resources to scrutinize every financial statement, and it “relies heavily on accountants to assure corporate compliance with federal securities law requirements,” Munter wrote. In 2022, his office issued the SEC’s Staff Accounting Bulletin 121, which also concerned third-party disclosures and was <a href=\"https://cointelegraph.com/news/senators-join-chorus-of-disapproval-of-backdoor-regulation-in-sec-staff-accounting-bulletin\">widely criticized as regulation by enforcement</a>. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/defi-security-audits-bug-bounties-broken-heres-how-fix/\">Crypto audits and bug bounties are broken: Here’s how to fix them</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T21:17:37.000Z",
    "title": "New Optimism wallet lets users receive crypto via Twitter login",
    "url": "https://cointelegraph.com/news/new-optimism-wallet-users-receive-crypto-via-twitter-login",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d123c743-5cf7-4af4-b66b-88a41f699f80.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Beam wallet uses Web3Auth and account abstraction to allow for seedless accounts, stablecoin gas payments, and other user experience features.</p>\n                    <p><p>A new wallet that has launched on Optimism (OP) allows users to generate an address without storing seed words, and the account can be saved using an ordinary Twitter login. Called “Beam wallet” the application runs in a browser window and requires no downloads, according to a July 27 announcement from its developer. It also allows users to send transactions on Optimism without owning Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">INTRODUCING BEAM<br><br>The first self-custody payments wallet built for the mainstream — no download or signup required.<br><br>Beam is the easiest way on the planet to send anyone money.<br><br>Try it out with a single click </p>&mdash; Andy Bromberg (@andy_bromberg) <a href=\"https://twitter.com/andy_bromberg/status/1684605161308925952?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Beam was developed by Eco, a payments company backed by Web3 venture capital firms Andreessen Horowitz, Coinbase Ventures, Founders Fund, Lightspeed Venture Partners, and Pantera Capital.</p><p>To create a Beam wallet, the user navigates to the application’s website, which generates a unique QR code representing an Optimism address. After this, the user can display their QR code to someone who wants to send them crypto. They can also click the QR code to copy the address so that it can be sent through email or instant messaging applications. The web app can be accessed from a desktop or mobile device.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1bfb7190-e59b-4764-9024-fcd094ebe939.png\"  /><figcaption style=\"text-align: center;\"><em>Beam wallet interface. Source: Eco</em></figcaption></figure><p>To back up their wallet, users must click “save access” and log into Twitter through its application programming interface (API). They then click “save access” a second time to be prompted for a new password. After submitting the password, the account backup is complete, and the user can then recover their account with their Twitter login and password if their device ever crashes.</p><p>In a conversation with Cointelegraph, Eco App and Beam CEO Andy Bromberg explained that the application uses Web3Auth to backup accounts. Web3Auth <a href=\"https://cointelegraph.com/news/new-tech-could-make-crypto-and-web3-wallets-more-convenient\">is a type of new wallet technology</a> that allows for seedless wallets to be created.</p><p>Bromberg said the password serves as a backup shard for Web3Auth, which means no hash of it is ever stored on a centralized server, implying that neither Twitter nor Eco can make unauthorized transfers on the users’ behalf.</p><p>Even though Optimism’s native coin is Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Beam does not require users to own ETH to pay gas fees. Instead, gas fees can be paid with the coin used in the transfer. For example, a user can send $100 in US Dollar Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) for $0.50 in USDC. </p><p><em><strong>Related:</strong> <a href=\"https://cointelegraph.com/news/optimism-transaction-volumes-surpass-abitrum-first-time-six-months\"><strong>Optimism transaction volumes surpass Abitrum’s for the first time in six months</strong></a></em></p><p>To make this possible, the wallet broadcasts two separate transactions. The first transaction is the one the user requested, whereas the second transaction is a pledge to pay a third-party “paymaster” account if the paymaster agrees to pay gas on the user’s behalf. In the above example using USDC, the paymaster will pay $0.50 or less worth of ETH on behalf of the user and the user will simultaneously pay $0.50 of USDC to the paymaster. Bromberg told Cointelegraph that paymasters cannot take more fees than the user authorized since the fee amount is embedded in the signature used to authorize the transaction.</p><p>According to Bromberg, using paymasters has only become possible since account abstraction was implemented in March, which allowed user-controlled wallet accounts <a href=\"https://cointelegraph.com/news/ethereum-erc-4337-smart-accounts-launch-at-walletcon-account-abstraction-is-here\">to contain executable code</a> for the first time.</p><p>Beam will also release for Coinbase’s Base network when it <a href=\"https://cointelegraph.com/news/coinbase-base-launches-mainnet-for-builders-will-onboard-users-august\">officially launches in August</a>. Once Base has officially launched, user balances on Base and Optimism will be added together and shown as one total within the Beam app, Bromberg stated. When a customer initiates a transaction, the Base and Optimism parts of the transaction will be broadcast simultaneously on each network, making it seem to the user as if they are interacting on a single network. </p><p>Because of this feature, Bromberg referred to Beam as a “Superchain” wallet, implying that it will interact seamlessly across the OP Stack ecosystem.</p><p>Bromberg believes Beam would reduce lousy user experiences with crypto wallets and allow ordinary people to adopt the technology:</p><blockquote>“We’ve abstracted away chains, addresses, fees, all of it, to make it so that normal people can use it. I’ve been in crypto for ten years now, and this is the first non-custodial product that my parents have ever been able to use, and I have tried many times before, and this did it. So we’re excited about it.”</blockquote><p>Beam isn’t the only wallet app that aims to simplify crypto onboarding. Kresus wallet, launched on May 11, allows users to <a href=\"https://cointelegraph.com/news/new-wallet-uses-amazon-hardware-security-modules-to-eliminate-seed-words\">sign up with just an email address</a>. On May 8, Worldcoin launched a wallet that <a href=\"https://cointelegraph.com/news/human-id-project-worldcoin-launches-gas-free-wallet-only-for-humans\">allows gas-free transactions</a> for any users that prove their humanness through its protocol.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T21:30:02.000Z",
    "title": "Amazon Managed Blockchain to offer new Bitcoin querying services",
    "url": "https://cryptoslate.com/amazon-managed-blockchain-to-offer-new-bitcoin-querying-services/",
    "description": "<p>Amazon Managed Blockchain (AMB) announced an upgrade to its Access and Query functions, ushering the tech giant deeper into Web3. The announcement was made during the two-day AWS Web3/Blockchain Summit in New York City on July 26, representing a significant step in advancing Amazon&#8217;s blockchain services. The Amazon Managed Blockchain, a Blockchain-as-a-Service (BaaS) platform, is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/amazon-managed-blockchain-to-offer-new-bitcoin-querying-services/\">Amazon Managed Blockchain to offer new Bitcoin querying services</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T21:37:39.000Z",
    "title": "MakerDAO increases DAI yield amid stablecoin market slump",
    "url": "https://www.cryptopolitan.com/makerdao-increases-dai-yield-market-slump/",
    "description": "MakerDAO, the decentralized autonomous organization behind the stablecoin DAI, recently approved a proposal aimed at increasing interest rates temporarily for DAI token holders. The new mechanism, known as the Enhanced Dai Savings Rate (EDSR), seeks to offer higher yields to users, with rates reaching up to 8%. MakerDAO introduces EDSR to boost yields The decision ... <a title=\"MakerDAO increases DAI yield amid stablecoin market slump\" class=\"read-more\" href=\"https://www.cryptopolitan.com/makerdao-increases-dai-yield-market-slump/\" aria-label=\"More on MakerDAO increases DAI yield amid stablecoin market slump\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T21:23:28.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T21:28:03.000Z",
    "title": "Hong Kong and Saudi Arabia to boost financial services integration",
    "url": "https://crypto.news/hong-kong-saudi-arabia-advance-token-and-payment-solutions/",
    "description": "SAMA and Hong Kong's HKMA  recently held a meeting to discuss ways of boosting financial services integration and cooperation"
  }
]