[
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T11:57:42.000Z",
    "title": "Bitcoin briefly recaptures $27k in mixed market performance: CryptoSlate wMarket Update",
    "url": "https://cryptoslate.com/bitcoin-briefly-recaptures-27k-in-mixed-market-performance-cryptoslate-wmarket-update/",
    "description": "<p>The cryptocurrency market saw net outflows of around $25 billion over the last 24 hours and currently stands at $1.11 trillion — up 1.90% from $1.09 trillion. During the reporting period, the market caps of Bitcoin (BTC) and Ethereum (ETH) rose 3.17% and 2.07% to $517.08 billion and $223.69 billion, respectively. Over the last 24 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-briefly-recaptures-27k-in-mixed-market-performance-cryptoslate-wmarket-update/\">Bitcoin briefly recaptures $27k in mixed market performance: CryptoSlate wMarket Update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T11:56:22.000Z",
    "title": "Bitget Unveils new AI-Powered Strategy for Crypto Traders",
    "url": "https://cryptodaily.co.uk/2023/06/bitget-unveils-new-ai-powered-strategy-for-crypto-traders",
    "description": "<p>Bitget, a leading platform for crypto derivatives and copy trading, has introduced an impressive addition to its arsenal of investment strategies: the Martingale AI.&nbsp;</p>\n<p>Bitget's Martingale trading strategy, enables traders to capitalise on its remarkable potential. The Martingale strategy is one where investment amounts are increased following a market downturn, with the goal of not only recovering losses but of making more profits.&nbsp;</p>\n<p>By looking into the historical data and analysing market trends over time, the strategy provides investors with a comprehensive overview of market behaviour, allowing them to fine-tune their trading and allocate their capital more efficiently.</p>\n<p>Thanks to Martingale AI, traders can now delve into automated trading by setting their desired risk appetite and investment frequency based on parameters recommended by Bitget's proprietary AI system. These parameters are carefully calculated using Bitget's sophisticated algorithms, which take into account historical market prices and asset fluctuations. As a result, traders can rely on these dependable investment references to make informed decisions and navigate the crypto market with more confidence.</p>\n<p>Bitget&rsquo;s Martingale strategy caters to both novice and experienced traders alike. By embracing this innovative approach, traders can engage in two-way trading, seamlessly adapting to both bullish and bearish market conditions. Whether they aim to seize opportunities by going long or short, buying the dip, or capturing market callbacks, the Martingale strategy on Bitget offers a wealth of possibilities.&nbsp;</p>\n<p>Moreover, traders have the freedom to customise and control their risk levels by adjusting various parameters, such as profit targets and the multiples of additional positions. This flexibility empowers traders to align the strategy with their unique trading preferences and risk appetites.</p>\n<p>For those new to the crypto world, Bitget provides a friendly learning curve by offering a range of Martingale strategies with lower thresholds.&nbsp;</p>\n<p>Gracy Chen, MD of Bitget had the following to say about the Martingale AI launch:</p>\n\n<p>\"As a platform driven by innovation, we have launched the Martingale AI trading strategy. With this, we seek to highlight how much we delight in empowering our users to stay as productive as they can in line with their investment goals. AI is changing the narrative and pushing the boundaries of what is possible, and as such, we are going all out in integrating the technology into our everyday operations.</p>\n<p>With the help of AI technology, Bitget is committed to simplifying complicated trading strategies as we seek to drive deeper adoption of cryptocurrencies. With AI gradually gaining steam across industries, we are further committed to deploying advanced solutions powered by this technology - in line with our global growth strategies and a defined push beyond the derivative trading strategy\".</p>\n\n<p>Thanks to the AI-powered system, novice traders can explore conservative, balanced, and aggressive approaches, each tailored to suit their risk tolerance. This thoughtful division ensures that everyone, regardless of their experience level, can participate in the world of crypto trading.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T11:50:20.000Z",
    "title": "LBank Exchange Will List ELMOERC (ELMO) Token on June 9",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-exchange-will-list-elmoerc-elmo-token-on-june-9",
    "description": "<p>Road Town, BVI, June 7th, 2023, Chainwire</p><p>Digital asset trading platform LBank Exchange is to list the ELMOERC (ELMO) token. The ELMO/USDT trading pair will officially go live on LBank at 9:00 UTC on Jun 9, 2023.</p><p>ELMOERC (ELMO) is a memecoin project whose token features a unique \"burn and earn\" mechanism. The listing of ELMO on LBank Exchange will expand its global footprint and support deeper liquidity.</p><p>The ELMO token imposes a 10% tax on DEX trades and 6% on CEX trades, mechanisms that support a robust circular economy. The goal of ELMOERC is to become the ultimate memecoin through a rapidly reducing supply, utility, and accessibility.</p><p>The team behind ELMO intend to introduce staking, NFTs, and many other features. Long-term diamond holders are rewarded through substantial burns funded by taxes imposed on sellers. Whenever someone sells, the total supply reduces, increasing demand for the remaining circulating supply due to scarcity.</p><p>About ELMO Token</p><p>ELMOERC is a memecoin with an aggressive burn mechanism that has seen 125M tokens burnt since its launch. This is implemented via a 10% tax on DEX trades. ELMO started out with a total supply of 1 billion, but 500 million of these tokens were burned prior to launch. There is a 0% tax on buying, a 10% tax on selling, liquidity is locked, ownership has been renounced, and team tokens have been secured under lock.</p><p>Learn More</p><p>Official Website | Telegram | Twitter | Contract</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram l&nbsp;Twitter l&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p></p><p></p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T12:06:37.000Z",
    "title": "Secure your Future in Crypto with TMS Network (TMSN), as Shiba Inu (SHIB) and Arbitrum (ARB) Struggle to Grow",
    "url": "https://www.cryptopolitan.com/secure-your-future-in-crypto-with-tms-network-tmsn-as-shiba-inu-shib-and-arbitrum-arb-struggle-to-grow/",
    "description": "As the cryptocurrency market experiences turbulence, the spotlight falls on TMS Network (TMSN) as a beacon of stability and growth. While older cryptocurrencies, such as Shiba Inu (SHIB) and Arbitrum (ARB), struggle to gain momentum, the presale of TMS Network (TMSN), now in phase 4, continues to gain momentum. And with over 2000% ROI for ... <a title=\"Secure your Future in Crypto with TMS Network (TMSN), as Shiba Inu (SHIB) and Arbitrum (ARB) Struggle to Grow\" class=\"read-more\" href=\"https://www.cryptopolitan.com/secure-your-future-in-crypto-with-tms-network-tmsn-as-shiba-inu-shib-and-arbitrum-arb-struggle-to-grow/\" aria-label=\"More on Secure your Future in Crypto with TMS Network (TMSN), as Shiba Inu (SHIB) and Arbitrum (ARB) Struggle to Grow\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T11:51:12.000Z",
    "title": "North Korean Hackers, Lazarus group, tied to the Atomic Wallet breach",
    "url": "https://www.cryptopolitan.com/lazarus-group-tied-to-the-atomic-wallet-hack/",
    "description": "Elliptic, a blockchain intelligence firm, said in a blog post on Tuesday that users of Atomic Wallet may have fallen victim to Lazarus, the notorious North Korean cybercrime group. Reportedly, illegal funds from the $35 million Atomic Wallet hack have been transferred to a crypto aggregator that is favored by North Korea&#8217;s most notorious cyber-hacking ... <a title=\"North Korean Hackers, Lazarus group, tied to the Atomic Wallet breach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lazarus-group-tied-to-the-atomic-wallet-hack/\" aria-label=\"More on North Korean Hackers, Lazarus group, tied to the Atomic Wallet breach\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T11:46:58.000Z",
    "title": "Patiently powering through insight into the Philippines’ delay in issuing crypto regulatory framework",
    "url": "https://www.cryptopolitan.com/patiently-powering-through-insight-into-the-philippines-delay-in-issuing-crypto-regulatory-framework/",
    "description": "Amidst the shimmering waters of the Pacific and the lush greenery of the archipelago, a sophisticated dance of regulation and freedom unfolds in the Philippines, one of Southeast Asia&#8217;s rapidly accelerating economies. After the global market failures in 2022, the country&#8217;s financial watchdog, the Philippines Securities and Exchange Commission (SEC), has opted for patience and ... <a title=\"Patiently powering through insight into the Philippines&#8217; delay in issuing crypto regulatory framework\" class=\"read-more\" href=\"https://www.cryptopolitan.com/patiently-powering-through-insight-into-the-philippines-delay-in-issuing-crypto-regulatory-framework/\" aria-label=\"More on Patiently powering through insight into the Philippines&#8217; delay in issuing crypto regulatory framework\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T11:45:42.000Z",
    "title": "What exactly does the SEC claim CZ did with BinanceUS?",
    "url": "https://www.cryptopolitan.com/what-the-sec-claims-cz-did-with-binanceus/",
    "description": "With over $2.2 billion of U.S. customer assets under scrutiny, BinanceUS and its founder, Changpeng Zhao, face allegations by federal regulators who believe these funds are under &#8220;significant risk&#8221; of misappropriation. The U.S. Securities and Exchange Commission (SEC) voiced its concerns and accusations in a recent legal filing, stating that immediate action must be taken ... <a title=\"What exactly does the SEC claim CZ did with BinanceUS?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-the-sec-claims-cz-did-with-binanceus/\" aria-label=\"More on What exactly does the SEC claim CZ did with BinanceUS?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T11:58:38.000Z",
    "title": "Binance exec calls MiCA a game changer at Money20/20",
    "url": "https://crypto.news/binance-exec-calls-mica-a-game-changer-at-money-20-20/",
    "description": "Vishal Sacheendran unravels the complexities of the Markets in Crypto Assets (MiCA) regulations. The expert presents a lucid picture of these comprehensive rules to reshape the European Union&#8217;s crypto asset industry. When the curtain rose at the Money20/20 event in&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T11:52:31.000Z",
    "title": "Now That Optimism ‘Bedrock’ Hard Fork Is Done, What Can We Expect?",
    "url": "https://www.newsbtc.com/news/now-that-optimism-bedrock-hard-fork-is-done-what-can-we-expect/",
    "description": "Optimism ushers in a new era with the successful completion of its highly anticipated &#8220;Bedrock&#8221; upgrade. This transformative enhancement, announced by OP Labs, the network&#8217;s developer, brings forth accelerated deposit times, decreased layer-1 fees, and fortified security measures.  The implementation of these advancements marks a pivotal step in the developer&#8217;s ambitious mission to establish a &#8220;Superchain&#8221; comprised of scalable Web3 networks, leveraging the cutting-edge Optimism OP Stack software.  Related Reading: Polygon (MATIC) Large Transactions Explode 742% Amid Latest SEC Attack Optimism Bedrock: Revolutionizing Efficiency &#38; Security According to an announcement by Optimism on Twitter, the network now possesses the ability to identify chain reorganizations occurring on Ethereum, seamlessly reflecting these reorgs in users&#8217; Optimism balances. This revolutionary development has paved the way for deposit times to be dramatically reduced to a mere one minute, in stark contrast to the previous average wait time of 10 minutes.  ✅OP Mainnet’s migration to Bedrock has concluded and the Bedrock sequencer has started up. Key external OP Mainnet infrastructure is starting to come back online. You can track infrastructure status here:https://t.co/XTtaArdI03 — Optimism (✨🔴_🔴✨) (@optimismFND) June 6, 2023 The significant time savings are achieved by eliminating the need to achieve finality on L1 before processing deposits from Ethereum to Optimism. Streamlined Gas Optimization Recognizing the importance of affordability and accessibility, the Bedrock upgrade takes a stride towards a more user-friendly ecosystem. By leveraging the network&#8217;s innovative gas optimization techniques, the development team behind Bedrock has successfully slashed data availability fees on Ethereum by a remarkable 40%.  This momentous reduction is seamlessly passed on to Optimism users in the form of significantly lowered gas fees. As a result, participants can now transact on the network with increased efficiency and cost-effectiveness, making Optimism an even more attractive platform for decentralized activities. BTCUSD trying to reclaim $27K territory. Chart: TradingView.com Fortifying Security With 2-Step Withdrawal Process Ensuring the utmost security of user assets has always been a paramount concern for the Optimism team. With the implementation of Bedrock, the network introduces a robust two-step withdrawal process, explicitly designed to mitigate the risk of potential bridge exploits.  By implementing this comprehensive security measure, Optimism takes a proactive stance in safeguarding user funds and fortifying its infrastructure against potential vulnerabilities. As a result, participants can engage with the network confidently, knowing that their assets are shielded by cutting-edge security features. Related Reading: Pepecoin Frenzy Fades: How Meme Token’s Price, Market Cap Were Cut In Half A Promising Future With the arrival of the Bedrock upgrade, Optimism sets a new benchmark for efficiency, affordability, and security within the realm of decentralized networks. The remarkable reduction in deposit times, coupled with substantial gas fee optimizations, ensures that users can interact with the platform seamlessly while enjoying cost savings.  Furthermore, the implementation of a robust two-step withdrawal process offers an additional layer of protection, solidifying Optimism&#8217;s commitment to maintaining a secure and trusted environment.  As the network continues its journey towards building a Superchain of scalable Web3 networks, powered by the state-of-the-art OP Stack software, the future looks promising for Optimism and its growing community of users. Featured image from Optimism Docs"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T12:06:00.000Z",
    "title": "Groundbreaking Bitcoin Tool Facilitates Lightning Network Adoption for Trillion-Dollar Market, Empowering Billions of Companies with Faster BTC Payments",
    "url": "https://www.crypto-news-flash.com/groundbreaking-bitcoin-tool-facilitates-lightning-network-adoption-for-trillion-dollar-market-empowering-billions-of-companies-with-faster-btc-payments/?utm_source=rss&utm_medium=rss&utm_campaign=groundbreaking-bitcoin-tool-facilitates-lightning-network-adoption-for-trillion-dollar-market-empowering-billions-of-companies-with-faster-btc-payments",
    "description": "<p>LINER Index aims to promote Lightning Network adoption by showcasing cost-efficiency. The Index measures &#8216;yield&#8217; from deploying capital and &#8216;cost&#8217; of digital transactions. Lightning Network can offer cost savings, especially for international transactions. The Bitcoin ecosystem is on the brink of a major transformation as Amboss, a Lightning Network data provider, introduces the LINER (Lightning [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/groundbreaking-bitcoin-tool-facilitates-lightning-network-adoption-for-trillion-dollar-market-empowering-billions-of-companies-with-faster-btc-payments/\">Groundbreaking Bitcoin Tool Facilitates Lightning Network Adoption for Trillion-Dollar Market, Empowering Billions of Companies with Faster BTC Payments</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T12:00:29.000Z",
    "title": "We asked ChatGPT: will shiba inu coin reach $1? Tradecurve setting the trend in DeFi",
    "url": "https://www.crypto-news-flash.com/we-asked-chatgpt-will-shiba-inu-coin-reach-1-tradecurve-setting-the-trend-in-defi/?utm_source=rss&utm_medium=rss&utm_campaign=we-asked-chatgpt-will-shiba-inu-coin-reach-1-tradecurve-setting-the-trend-in-defi",
    "description": "<p>ChatGPT had an interesting take when asked if Shiba Inu (SHIB) would reach $1, but the real focus is on Tradecurve (TCRV), a brand new trading platform setting the trend in DeFi. Famous traders like Andrew Kang have taken out leveraged positions pointing to incoming upside, and altcoins look poised to leap. As the market [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/we-asked-chatgpt-will-shiba-inu-coin-reach-1-tradecurve-setting-the-trend-in-defi/\">We asked ChatGPT: will shiba inu coin reach $1? Tradecurve setting the trend in DeFi</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T11:50:29.000Z",
    "title": "LBank Exchange Will List ELMOERC (ELMO) Token on June 9",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-will-list-elmoerc-elmo-token-on-june-9/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-will-list-elmoerc-elmo-token-on-june-9",
    "description": "<p>Road Town, BVI, June 7th, 2023, Chainwire Digital asset trading platform LBank Exchange is to list the ELMOERC (ELMO) token. The ELMO/USDT trading pair will officially go live on LBank at 9:00 UTC on Jun 9, 2023. ELMOERC (ELMO) is a memecoin project whose token features a unique &#8220;burn and earn&#8221; mechanism. The listing of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/lbank-exchange-will-list-elmoerc-elmo-token-on-june-9/\">LBank Exchange Will List ELMOERC (ELMO) Token on June 9</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T12:05:00.000Z",
    "title": "LDO, ARB, OP Display Strength Despite Latest Regulatory Hurdle",
    "url": "https://coinedition.com/ldo-arb-op-display-strength-despite-latest-regulatory-hurdle/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/LDO_ARB_OP_display_strength_despite_new_regulatory_proscription-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/LDO_ARB_OP_display_strength_despite_new_regulatory_proscription-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/LDO_ARB_OP_display_strength_despite_new_regulatory_proscription-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/LDO_ARB_OP_display_strength_despite_new_regulatory_proscription.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The price of Lido DAO Token (LDO), Optimism (OP), and Arbitrum (ARB) significantly increased in the last 24 hours. The increase in value ensured that these tokens were some of the biggest gainers out of the top 50 assets per market capitalization. However, that was not the most bewildering part. It was the fact that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ldo-arb-op-display-strength-despite-latest-regulatory-hurdle/\">LDO, ARB, OP Display Strength Despite Latest Regulatory Hurdle</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T11:48:00.000Z",
    "title": "Analyzing Jack Dorsey’s Claim: Is Ethereum (ETH) a Security?",
    "url": "https://coinedition.com/analyzing-jack-dorseys-claim-is-ethereum-eth-a-security/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Claims-Ethereum-ETH-Is-a-Security-Is-It-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Claims-Ethereum-ETH-Is-a-Security-Is-It-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Claims-Ethereum-ETH-Is-a-Security-Is-It-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Jack-Dorsey-Claims-Ethereum-ETH-Is-a-Security-Is-It.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Twitter’s former CEO and co-founder affirmed his position that Ethereum (ETH) is a security. Dorsey, who shared his opinion about the SEC’s action of labeling several cryptocurrencies as unregistered securities, initially mentioned three assets that were censorship resistant. Jack is on opposing sides with Gary As expected, his list included Bitcoin (BTC). However, Dorsey left [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyzing-jack-dorseys-claim-is-ethereum-eth-a-security/\">Analyzing Jack Dorsey&#8217;s Claim: Is Ethereum (ETH) a Security?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T11:45:52.000Z",
    "title": "Millions in Cardano (ADA) Will Be Stolen by Artificial Intelligence by This Time Next Year: Charles Hoskinson",
    "url": "https://dailyhodl.com/2023/06/07/charles-hoskinson-says-millions-in-ada-will-be-stolen-because-of-artificial-intelligence-by-this-time-next-year/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Because-of-Artificial-Intelligence.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cardano (ADA) creator Charles Hoskinson warns that crypto scams will proliferate with the emergence of generative artificial intelligence (AI). Hoskinson predicts in a new video that millions of dollars worth of Cardano will be lost one year from now as scams that employ generative AI take over. &#8220;This time next year because of generative AI, millions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/charles-hoskinson-says-millions-in-ada-will-be-stolen-because-of-artificial-intelligence-by-this-time-next-year/\">Millions in Cardano (ADA) Will Be Stolen by Artificial Intelligence by This Time Next Year: Charles Hoskinson</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]