[
  {
    "source": "CoinDesk",
    "date": "2023-05-25T20:56:28.000Z",
    "title": "Bitcoin Lingers Below $26.5 Amid Debt Ceiling Worries",
    "url": "https://www.coindesk.com/markets/2023/05/25/bitcoin-lingers-below-265-amid-debt-ceiling-worries/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Unemployment and productivity data arrived stronger than expected but investors seemed focused narrowly on the ongoing negotiations that will determine if the U.S. government has to default on its debts."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-25T20:48:28.000Z",
    "title": "Etonec and Mina Foundation to Create ZK-Powered Compliance Tool By Year’s End",
    "url": "https://www.coindesk.com/business/2023/05/25/etonec-and-mina-foundation-to-create-zk-powered-compliance-tool-by-years-end/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The product is designed to enable DeFi and Web3 communities to comply with regulations while maintaining community members’ privacy."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T20:54:28.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T20:41:52.000Z",
    "title": "Binance bolsters DeFi space with innovative NFT loan service feature",
    "url": "https://www.cryptopolitan.com/binance-bolsters-defi-space-with-innovative-nft-loan-service-feature/",
    "description": "Binance, the leading global cryptocurrency exchange and blockchain platform, introduces a novel service to its marketplace – the Binance NFT Loan. This new feature, which goes live on Friday, is a great development that enables digital asset holders to leverage their Non-Fungible Tokens (NFTs) as collateral to secure Ethereum (ETH) loans. In a press release, ... <a title=\"Binance bolsters DeFi space with innovative NFT loan service feature\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-bolsters-defi-space-with-innovative-nft-loan-service-feature/\" aria-label=\"More on Binance bolsters DeFi space with innovative NFT loan service feature\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T20:39:47.000Z",
    "title": "Binance coin price analysis: Bulls uncertain as price remains sluggish below $306",
    "url": "https://www.cryptopolitan.com/binance-coin-price-analysis-2023-05-25/",
    "description": "According to the latest Binance coin price analysis update, there has been a continuous decline in price levels. The cryptocurrency is steadily moving downwards, approaching the support at $303. Currently, the coin&#8217;s price stands at $305.2, and over the past 48 hours, sporadic bearish momentum and price fluctuations have been observed. However, the bears persist ... <a title=\"Binance coin price analysis: Bulls uncertain as price remains sluggish below $306\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-analysis-2023-05-25/\" aria-label=\"More on Binance coin price analysis: Bulls uncertain as price remains sluggish below $306\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-25T20:42:46.000Z",
    "title": "Deposit suspensions hit bridged tokens pending multichain team’s clarification",
    "url": "https://crypto.news/deposit-suspensions-hit-bridged-tokens-pending-multichain-teams-clarification/",
    "description": "In response to a series of transaction issues that raised concerns about the Multichain (MULTI) protocol, leading crypto exchange Binance has temporarily suspended deposits for 10 bridged tokens as of May 25."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-25T20:59:34.000Z",
    "title": "Polkadot Extends Decline, Can Bulls Defend $5.15 Support?",
    "url": "https://www.newsbtc.com/analysis/dot/polkadot-extends-decline-can-bulls-defend-5-15-support/",
    "description": "The Polkadot price analysis continues to indicate a bearish outlook as the market undergoes a notable decline. Within the past 24 hours, the asset&#8217;s price experienced a slight decline, demonstrating sideways movement under the influence of bearish sentiment. On a weekly timeframe, there has been limited movement in the price of DOT. In terms of technical indicators, DOT has exhibited bearish strength, with low buying pressure. Both demand and accumulation levels have decreased based on the daily chart. Related Reading: Bitcoin Bearish Signal: NUPL Finds Rejection At Long-Term Resistance Given the indecisiveness in Bitcoin&#8217;s chart, many altcoins, including DOT, have either remained constrained under immediate resistance levels or have entered consolidation phases. It is crucial for DOT to maintain a price level above its immediate support to avoid the possibility of another substantial decline in upcoming trading sessions. If selling pressure intensifies, there is a risk of the altcoin breaking below its crucial support level. The declining market capitalization of Polkadot indicates that sellers are still exerting control over the asset. Polkadot Price Analysis: One-Day Chart As of the current writing, DOT is being traded at $5.29, with Polkadot hovering near its critical support level of $5.15. Should the price fall below this level, it may further decline to $5. On the upside, a significant resistance level is observed at $5.40. If DOT bulls manage to surpass this resistance, it could potentially trigger a rally towards $5.71, indicating a 6% appreciation. Further progress could then lead the price into the $6 range. Notably, the trading volume of DOT in the last session was relatively low. This suggested that buying strength was weaker compared to selling pressure. Technical Analysis During the months of April and May, the demand for DOT remained relatively weak. Analysis shows that the Relative Strength Index (RSI) remained below the 40-mark, indicating that selling pressure outweighed buying pressure in the market. Additionally, DOT remained below the 20-Simple Moving Average (SMA), further affirming the dominance of sellers in driving the price momentum. However, if DOT manages to surpass the $5.30 mark, it has the potential to climb above the 20-SMA line. This could potentially attract buyers back into the market and shift the overall sentiment in a more positive direction. As demand for DOT declined, the altcoin exhibited decreasing buy signals on its one-day chart. The Moving Average Convergence Divergence (MACD), which represents price momentum and trend reversal, displayed declining green histograms, indicating a weak buy signal for DOT. Furthermore, the Bollinger Bands, which illustrate price volatility and fluctuations, exhibited constriction, indicating a range-bound movement. Related Reading: Bitcoin Hangs At $26,200: Why This Is A Crucial Support Level The upcoming trading sessions hold importance for DOT as they will determine whether the price breaks out above or below the crucial support line. Featured Image From UnSplash, Charts From TradingView.com"
  }
]