[
  {
    "source": "Decrypt",
    "date": "2023-09-12T22:01:50.000Z",
    "title": "Sony Reveals Blockchain Plans to 'Connect Souls Across Generations'",
    "url": "https://decrypt.co/156082/sony-reveals-blockchain-plans-connect-souls-across-generations",
    "description": "Sony subsidiary Sony Network Communications has established a joint venture with Startale Labs, makers of the Astar blockchain."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-12T21:48:08.000Z",
    "title": "AI Deepfakes Pose ‘Real Risk’ to Markets, Says SEC Chair Gary Gensler",
    "url": "https://decrypt.co/156074/ai-deepfakes-pose-real-risk-to-markets-says-sec-chair-gary-gensler",
    "description": "Wall Street’s top regulator is again warning about the dangers of AI. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T21:45:00.000Z",
    "title": "Israel, Hong Kong complete retail CBDC test emphasizing privacy, inclusivity",
    "url": "https://cointelegraph.com/news/israel-hong-kong-complete-retail-cbdc-test-emphasizing-privacy-inclusivity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a26cbc51-072a-42c3-b848-c09abcdf06d6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Hong Kong Monetary Authority, Bank of Israel and Bank for International Settlements teamed up to address the complex issues of rCBDCs. </p>\n                    <p><p>The Bank for International Settlements and the central banks of Hong Kong and Israel <a href=\"https://www.bis.org/publ/othp74.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> the results of Project Sela on Sept. 12. The project was a public-private partnership that used private intermediaries to create a retail central bank digital currency (rCBDC) combining the desirable characteristics of cash and the advantages of digitalization.</p><p>The project leveraged the central banks’ diverse experience to incorporate a number of predefined policy, security, technology and legal features. The private participants were fintechs FIS and M10 Networks, which provided core products, Clifford Chance for legal analysis and Check Point Software Technologies for cyber security. The project was a proof-of-concept.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Project Sela proposes a new financial infrastructure, the Access Enabler, which facilitates customer-facing activities without ever holding users’ rCBDC. It removes complexity, costs + risks compared w current payment providers <a href=\"https://twitter.com/hashtag/BISInnovationHub?src=hash&amp;ref_src=twsrc%5Etfw\">#BISInnovationHub</a> <a href=\"https://twitter.com/hkmagovhk?ref_src=twsrc%5Etfw\">@hkmagovhk</a> <a href=\"https://t.co/znVp81gQol\">https://t.co/znVp81gQol</a> <a href=\"https://t.co/hItQamQc0K\">pic.twitter.com/hItQamQc0K</a></p>&mdash; Bank for International Settlements (@BIS_org) <a href=\"https://twitter.com/BIS_org/status/1701535645112365234?ref_src=twsrc%5Etfw\">September 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the Sela ecosystem, the central bank that issues an rCBDC maintains the ledger for it with pseudo-anonymous end-user accounts and provides instantaneous settlement with a real-time gross settlement (RTGS) system. Funding institutions manage users’ accounts and convert the rCBDC into and out of bank deposits and cash. An intermediary called an access enabler handles all customer-facing services, including Know Your Customer compliance, endorsements and routing, while end users maintain control over their electronic wallets with cryptographic keys. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/hong-kong-regulator-eyes-tokenization-for-bond-market\">Hong Kong regulator eyes tokenization for bond market improvement: Report</a></em></strong></p><p>One advantage of the ecosystem is its accessibility for the private financial institutions that carry out the unbundled financial services, which will purportedly increase competition and lead to increased user access. Access enablers do not create accounts, manage records or control  money, reducing the regulatory requirements placed on them:</p><blockquote>“Lower entry barriers can enable wider participation in the provision of rCBDC services, compared with the existing payments market, to include, for example, SMEs [small- and medium-sized enterprises], civil society and charitable organisations, e-commerce providers, community centres and technology companies, among others.”</blockquote><p>Financial institutions are understood in the traditional sense of banks, credit unions and similar organizations. Thus, it does not lead to disintermediation. Project Sela rCBDC users would not have to be account holders to use the services of those institutions to convert an rCBDC to or from cash. Payments are settled by the central banks, and users control their money the whole time. The central bank participants are assumed to be the operators of the distributed ledger system.</p><p>A system weak point noted in the report is RTGS systems, since they are usually not available around the clock and are not designed for frequent small transactions. Potential technical solutions are discussed.  </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ripple-visa-hong-kong-cbdc-pilot-huobi-token-allegations-asia-express/\">Ripple, Visa join HK CBDC pilot, Huobi accusations, GameFi token up 300%: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-12T22:00:05.000Z",
    "title": "Lightspark CEO David Marcus Profiles Bitcoin as Global Payment Network",
    "url": "https://news.bitcoin.com/lightspark-ceo-david-marcus-profiles-bitcoin-as-global-payment-network/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lightspark CEO David Marcus Profiles Bitcoin as a Global Payment Network\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1933699985.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />David Marcus, CEO of Lightspark and co-creator of Diem, Meta&#8217;s failed cryptocurrency project, explained his intentions of turning Bitcoin into a global payments network. Marcus explained that there was no universal protocol for sending value over the internet and that we were still in the &#8220;fax era&#8221; of global payments. Lightspark CEO David Marcus Wants [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T22:00:44.000Z",
    "title": "Bitcoin: $22,600 Or $31,200? Odds Split For Next 90 Days",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-22600-or-31200-odds-split-for-next-90-days/",
    "description": "Bitcoin (BTC), the leading cryptocurrency, has defied expectations of a steep decline to sub-$20,000 levels and has rebounded to the $26,000 mark, registering a 3.5% gain over the past 24 hours.  This resurgence in Bitcoin&#8217;s price coincides with the predictions made by Chartered Financial Analyst Timothy Peterson, whose recent social media post outlined the probabilities of Bitcoin dropping to $22,600 or rallying to $31,200 within the next 90 days. Bitcoin Price Analysis, 8% Chance Of Drop To $22,600 Peterson&#8217;s analysis indicates an 8% likelihood of Bitcoin experiencing a downward movement to $22,600, while a 71% chance of the cryptocurrency surging to $31,200.  Related Reading: Chainlink (LINK) Bullish Run Falters: Time To Brace For A Price Dip? According to the chart above, Bitcoin&#8217;s price will likely enter a macro consolidation phase over the next 90 days. During this period, the price may fluctuate within the range of its key Moving Averages (MAs). However, the crucial factor for bullish investors is the low probability of a drop below $22,000. This allows them to regain control of the 50-day and 200-day MAs in the short term, currently positioned at $27,200 and $27,000, respectively. The recent recovery of Bitcoin to the $26,000 level has alleviated concerns among market participants who were apprehensive about a potential downward spiral. The cryptocurrency&#8217;s ability to bounce back has instilled renewed confidence among investors. Nevertheless, Bitcoin faces a series of resistance levels that could pose challenges. In the immediate term, resistance at $26,454 has temporarily halted the cryptocurrency&#8217;s upward momentum. As mentioned earlier, Bitcoin lost its key MAs in August, resulting in additional obstacles on its journey back to $30,000. However, if these resistance levels are surpassed, there remains only one more hurdle before the cryptocurrency can surpass its annual high zone.  This final resistance stands at $29,800, which has historically proven to be a formidable barrier whenever Bitcoin has aimed to achieve new highs. Imminent Final Decline Expected? As the market approaches the final weeks of Q3 and edges closer to the new year, QCP Capital, an analysis firm, has been closely monitoring the market using two critical blueprints: the supermoon cycle and the Elliot Wave count. According to their analysis, an imminent final decline is expected to close the quarter at its lows. The chart above illustrates the projected decline, aligning with QCP Capital&#8217;s blueprints. The firm believes that the crypto and macro events calendar also supports this view, with a concentration of upcoming bearish events expected to transition to a neutral stance from mid-October onwards. Notable future events include tomorrow&#8217;s likely higher-than-expected CPI (Consumer Price Index) data and a more hawkish-than-expected Federal Open Market Committee (FOMC) meeting next week.  Additionally, asset sales of FTX tokens and the conclusion of the Mt. Gox proceedings over the next month contribute to the bearish sentiment. Although QCP Capital&#8217;s theory suggests a potential bottom soon after the supermoon early next month, they anticipate the true bottom to materialize in mid-late October when the negative news cycle has run its course. They expect the market to stabilize during this time and potentially reverse its downward trend. Related Reading: Report Reveals The Stablecoins That Have Suffered The Most De-Peg Events Despite the short-term challenges, QCP Capital remains bullish on the overall outlook. They anticipate a positive trajectory from mid-late October, extending into year-end and Q1 of the following year. BTC is currently trading at $26,100, reflecting a 3.5% increase over the past 24 hours and a gain of over 1.5% in the past seven days. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-12T22:01:04.000Z",
    "title": "MetaMask Introduces Support for Bitcoin, Solana and Cosmos Network With New ‘Snaps’ Feature",
    "url": "https://dailyhodl.com/2023/09/12/metamask-introduces-support-for-bitcoin-solana-and-cosmos-network-with-new-snaps-feature/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/metamask-enhances-dapp.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The most popular crypto wallet is introducing support for some of the largest blockchain networks in the world with the launch of a new feature. MetaMask announces on the social media platform X the launch of the open beta for &#8220;Snaps,&#8221; which aims to make the MetaMask ecosystem more permissionless. &#8220;Some time ago, Dan Finlay [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/12/metamask-introduces-support-for-bitcoin-solana-and-cosmos-network-with-new-snaps-feature/\">MetaMask Introduces Support for Bitcoin, Solana and Cosmos Network With New ‘Snaps’ Feature</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]