[
  {
    "source": "Decrypt",
    "date": "2023-10-03T20:57:03.000Z",
    "title": "Former Alameda CEO Sam Trabucco, Anthony Scaramucci May Be Called to Testify in SBF Trial",
    "url": "https://decrypt.co/199989/former-alameda-ceo-sam-trabucco-anthony-scaramucci-may-be-called-to-testify-in-sbf-trial",
    "description": "The two weren't expected to be involved in the trial, but may be called to testify. "
  },
  {
    "source": "Decrypt",
    "date": "2023-10-03T20:43:29.000Z",
    "title": "Candidate for Argentina President Promises to Push a CBDC",
    "url": "https://decrypt.co/199960/candidate-for-argentina-president-promises-to-push-a-cbdc",
    "description": "During a live, televised presidential debate, Sergio Massa evangelized a “digital currency of Argentina.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T20:59:00.000Z",
    "title": "Cardano stablecoin project gambled away investors’ money before rug: Report",
    "url": "https://cointelegraph.com/news/cardano-stabledcoin-project-gambled-away-investors-money-before-rug",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f6273b66-86ae-4d27-b8b4-54ef7f2def22.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ardana claimed to be creating a stablecoin platform on Cardano, but new evidence suggests it may have lost investors’ money in bad crypto trades.</p>\n                    <p><p>In 2021, Ardana Labs claimed it would provide an innovative stablecoin platform for the Cardano network. The new project, called “Ardana,” would allow investors to lock up crypto collateral and mint fiat-pegged stablecoins, including a U.S. dollar-based token called dUSD. It raised $10 million from investors that year, but it suddenly <a href=\"https://cointelegraph.com/news/leading-cardano-stablecoin-project-shuts-down-after-excruciating-launch-delays\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/leading-cardano-stablecoin-project-shuts-down-after-excruciating-launch-delays/amp\">closed up shop</a> in November 2022, citing “funding and project timeline uncertainty.” </p><p>Some investors blamed the loss on the “crypto winter” of 2022, during which many legitimate projects went bust from lack of funding in the extended bear market. However, new evidence from Web3 risk-management platform Xerberus suggests there may be more to the Ardana story than just fundraising issues.</p><p>According to Xerberus, Ardana executives likely transferred 80% of the project’s funds to a personal wallet after first attempting to obscure the transactions by sending some through centralized exchanges. The transfers were allegedly conducted by CEO Ryan Motovu or some other C-level team member. Once the funds were in this wallet, the executives made a series of bad crypto investments, Xerberus alleges. These investments resulted in a loss of approximately $4 million, shortening the runway for the project and ultimately leading to its collapse.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2) The capital was deposited in stablecoins. Ardana used this capital to invest in highly risky Ethereum-based tokens. As in the advent of the bear market prices collapsed Ardana lost at least 4 million USD just on their DEX trades. <a href=\"https://t.co/PIj5o55Flr\">pic.twitter.com/PIj5o55Flr</a></p>— Xerberus (@Xerberus_io) <a href=\"https://twitter.com/Xerberus_io/status/1699453740720210173?ref_src=twsrc%5Etfw\">September 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Ardana’s rise and fall</h3><p>Ardana was first announced in the summer of 2021, and by October 2021, it <a href=\"https://cointelegraph.com/news/cardano-stablecoin-protocol-ardana-raises-10m-in-latest-funding-round\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cardano-stablecoin-protocol-ardana-raises-10m-in-latest-funding-round/amp\">had raised $10 million from venture capital firms</a> CFund, Three Arrows Capital (3AC) and Ascensive Assets. Thanks to its successful fundraise and the prominence of its backers, some investors came to believe that Ardana’s upcoming token, DANA, would deliver outsized market gains.</p><p>The following month, Ardana announced that it was also <a href=\"https://cointelegraph.com/news/ardana-partners-with-near-protocol-on-cardano-bridge-infrastructure\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ardana-partners-with-near-protocol-on-cardano-bridge-infrastructure/amp\">partnering with Near Protocol</a> to create an asset bridge between Cardano and Near.</p><p>However, no Ardana stablecoin platform or bridge was ever launched, and the protocol <a href=\"https://cointelegraph.com/news/leading-cardano-stablecoin-project-shuts-down-after-excruciating-launch-delays\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/leading-cardano-stablecoin-project-shuts-down-after-excruciating-launch-delays/amp\">closed down in November 2022</a> without a functioning product. The development team stated that the closure was due to “funding and project timeline uncertainty.” The closure happened amid the <a href=\"https://cointelegraph.com/news/ftx-and-binance-s-ongoing-saga-everything-that-s-happened-until-now\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-and-binance-s-ongoing-saga-everything-that-s-happened-until-now/amp\">collapse of FTX</a>, which had made it difficult for many projects to raise funds. One of Ardana’s backers, 3AC, had also <a href=\"https://cointelegraph.com/news/3ac-a-10b-hedge-fund-gone-bust-with-founders-on-the-run\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/3ac-a-10b-hedge-fund-gone-bust-with-founders-on-the-run/amp\">gone bankrupt a few months earlier</a>. Given this background, many didn’t question the official story.</p><p>However, blockchain data and analysis by Xerberus show that Ardana’s failure may have had less to do with a lack of funding and more to do with risky asset management practices by Ardana Labs’ officers. </p><h3>A trail of questionable money </h3><p>Xerberus co-founders Simon Peters and Noah Detwiler told Cointelegraph they identified the Ethereum <a href=\"https://etherscan.io/address/0xbFb4B6651F56FA438B1a853781ED6847673EDa25\" target=\"_blank\" rel=\"noopener nofollow\">wallet</a> Ardana Labs used to collect funds from the DANA initial coin offering (ICO) in November 2021. They stated that links to the address were included in the ICO platform Tokensoft’s web pages relating to the token. In addition, they claim to have identified a $1 million transaction from 3AC into this address at a time when 3AC had announced its Ardana investment.</p><p>According to blockchain data, the first transaction to this account occurred on Sept. 2, 2021, when approximately 0.46 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ($1,747 at the time) was <a href=\"https://etherscan.io/tx/0x17ec93140730596b9b4c432a1c6fe6bde93135ad52d3af41827b3b002eecda23\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> into it. This was approximately two weeks after the Aug. 15 start date for the first round of Ardana fundraising. Beginning on Sept. 15, the account received multiple USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) transfers that eventually added up to millions of dollars worth of stablecoins.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ebfd2494-01e4-4b1f-b688-f630d73a1205.png\"><figcaption style=\"text-align: center;\">Caption: USDC transfers into alleged Ardana fundraising wallet. Source: Etherscan.</figcaption></figure><p>Once the funds were raised, they were moved into other wallets through a series of intermediate steps, Xerberus claims.</p><p>As told by Peters and Detwiler, approximately $3.2 million worth of stablecoins was moved from the fundraiser wallet to a “Target Wallet” through two intermediate addresses. This amount is approximately 30% of the total funds raised. First, the fundraiser account <a href=\"https://etherscan.io/tx/0x8fa4c2972aff412ac03cc917f5f644fe8fe25cc8ef9702166a4a5514b6be87c0\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> the funds to what they refer to as “Proxy Wallet 1.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/fde93c7c-1bc4-4d89-bb21-00fd8bb89895.png\"><figcaption style=\"text-align: center;\">Diagram of Ardana fund flows. Source: Xerberus</figcaption></figure><p>After receiving the funds, Proxy Wallet 1 swapped all of the stablecoins for CVX, a utility token used to receive fees from the Convex Finance platform. Blockchain data <a href=\"https://etherscan.io/address/0x962A6024Eb1ea0B447749e400510DBAa09Bb9bE3#tokentxns\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that decentralized exchange (DEX) SushiSwap was used to make this swap.</p><p>From there, the funds were <a href=\"https://etherscan.io/tx/0x7a804acb360111b5ddaee247616b298877d153b796de6507f9f29c717f12bab0\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> to what the Xerberus founders claim is an old personal wallet (“Old Address”) of Ardana founder Motovu. According to them, Motovu declared that he made money in the previous bull market of 2017. They found that “between $200,000 and $400,000” was in this wallet before the Ardana ICO, but the bulk of the funds it later held were from Ardana.</p><p>“When this project went under and when it failed, [Motovu] went onto a live Space and said, ‘A lot of my personal money that I had earned over the previous bull market in 2017’ […] is the money he made out of this old wallet,” Detwiler explained. “It sums up to something around $200,000 to $400,000, nothing more.”</p><p>Blockchain data shows that approximately four minutes after the CVX tokens were sent to the Old Address, it <a href=\"https://etherscan.io/tx/0x079311123f43a67d24599e558ba1bb14bca32c6db2d57e5e4a40bae283801e57\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> them to the Target Wallet. It is this wallet that they claim was used to purchase a variety of cryptocurrencies, ultimately causing Ardana’s funds to be lost in bad investments.</p><h3>CeFi exchanges join the trail</h3><p>In addition to the amount moved on-chain to the Target Wallet, another $4 million was sent through centralized exchanges first, then transferred to the Target Wallet, according to the Xerberus co-founders.</p><p>They claim to have identified the Kraken, Coinbase and Gate.io deposit addresses used by the Ardana team. To find these, they looked for addresses that received funds from the fundraising wallet and sent funds to a known exchange address. For example, one address in particular <a href=\"https://etherscan.io/address/0x3a3d36b0c1d218d2cec061b871898465ab5fad24\" target=\"_blank\" rel=\"noopener nofollow\">received</a> funds from the fundraising wallet and only sent funds to the Coinbase 6 and Coinbase: Miscellaneous wallet addresses.</p><p>Once funds were sent to a centralized exchange, determining what happened to them became more difficult. However, the team used a variety of techniques to determine with a degree of certainty where the funds went.</p><p>In some cases, the team was able to identify funds that were sent to Kraken and then immediately sent out to another address, as Kraken often uses the same address to send and receive funds for each user, especially if the time between transactions is short. In other cases, Kraken sent the deposited funds to another of its wallets, making it no longer obvious what the user did with the funds. Deposits sent to Coinbase and Gate.io are always sent to other wallets and pooled with other users’ tokens. So, with transactions involving these exchanges, the team could not determine what happened as easily.</p><p>However, they analyzed all outgoing transactions made by each exchange within an hour of the fundraising wallet depositing to it. They found that many outgoing transactions were for the exact same amount as the deposits. For example, the fundraising wallet would deposit $220,000 worth of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) to Gate.io. Then, 40 minutes later, the exchange would send exactly $220,000 in USDT out to a different wallet. Ultimately, much of these funds ended up in the Target Wallet, providing what Xerberus sees as solid evidence that the same user made the outgoing transactions.</p><p>Peters and Detwiler cautioned that this process does not prove with certainty that the transactions were made by Motovu or a member of the Ardana team. “This is not a UTXO [unspent transaction output] trail or a ledger trail. This is not a blockchain exact trail. […] However, the time frames and amounts do correlate with each other,” Detwiler stated. According to them, a total of $4 million was sent to the Target Wallet through these methods, bringing the total amount of funds sent into it to $7.2 million.</p><h3>Some funds remain, while some were spent on development</h3><p>Research conducted by the Xerberus team shows that approximately $1.82 million worth of Ardana’s funds were spent on development costs associated with the project, including team member’s salaries. They contacted a person they referred to as “the main contractor for the project,” who gave Ardana their wallet address. This address showed payments totaling $1.82 million, which is approximately 20% of the funds raised.</p><p>In addition, they claim that approximately $1.4 million worth of USDC has not been lost and still remains in the possession of the project in a <a href=\"https://etherscan.io/address/0xF3A953eC64aef4c268543Acf2E0b75A1844e9AB6\" target=\"_blank\" rel=\"noopener nofollow\">wallet</a> they refer to as the “Treasure Chest” account. This account’s first transaction was an incoming transfer of 0.3 ETH, worth $562.29 at the time, which was sent to it from the Target Wallet.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges/amp\"><strong>Multichain victims search for answers in $1.5B exploit as new evidence emerges</strong></a></em></p><h3>Nearly $4 million lost in bad trades</h3><p>According to Xerberus’ Sept. 6 report on Ardana, nearly $4 million of the Target Wallet’s token balance was <a href=\"https://docsend.com/view/anpnvfkufguryx2c\" target=\"_blank\" rel=\"noopener nofollow\">lost</a> through bad trades. The wallet owner transferred most of the funds to two Safe (formerly Gnosis Safe) multisignature accounts. These funds were used to make trades on DEXs PancakeSwap, Uniswap, SushiSwap and GMX, resulting in near-total losses. The Target Wallet also made its own losing trades.</p><p>Blockchain data shows that the Target Wallet made over 1,000 transactions, most of which were interactions with DEX contracts.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9ef75caf-97c4-4d3f-92c5-2d4958e4d398.png\"><figcaption style=\"text-align: center;\">Transactions of the account identified as “target wallet” by Xerberus. Source: Etherscan.</figcaption></figure><h3>Ardana’s liquidation and closure</h3><p>Xerberus claims that the on-chain behavior of the Ardana team began to change in March 2022, when the team’s wallets began “dumping” their assets onto DEXs. They continued to sell all remaining assets until November 2022, at which point the project officially announced it was closing. The funds obtained from these sales still remain in the treasury wallet.</p><p>The firm says it created an early warning system that can help alert investors when a project is engaging in risky behavior that may lead to a closure. Xerberus calls this “Blockchain Native Risk Ratings based on verifiable mathematics,” and it says investigations like the Ardana one are used to “fine-tune” its risk model, which it expects to “transform crypto markets, making them the safe alternative to traditional financial markets.”</p><p>Cointelegraph attempted to contact Ardana’s Motovu through LinkedIn, hoping to receive his side of the story. A reply was not received within the two weeks leading up to publication.</p><p>Many Ardana investors were firm believers in the Cardano ecosystem. They expected Ardana to be the project that would finally get Cardano the attention they felt it deserved. Instead, over $10 million in capital was sucked out of the Cardano community, with virtually nothing left to show for it in the end.</p><p>The Ardana story is a sober reminder of the risks of investing in new Web3 startups with no functioning product. Although these projects can lead to outsized gains, they can also lead to catastrophic losses. Investors may want to take a close look at a project’s on-chain behavior when considering whether to invest in these types of projects.</p><p><em>Cointelegraph editor <a href=\"https://cointelegraph.com/authors/zhiyuan-sun\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/authors/zhiyuan-sun/amp\">Zhiyuan Sun</a> contributed to this story. </em></p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/binances-indecision-to-freeze-bnb-wallets-drew-controversy-in-this-11m-rug-pull\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binances-indecision-to-freeze-bnb-wallets-drew-controversy-in-this-11m-rug-pull/amp\"><strong>Binance’s indecision to freeze wallets drew controversy in this $11M rug pull</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T20:50:25.000Z",
    "title": "FTX execs who pleaded guilty among names of potential witnesses in Sam Bankman-Fried’s criminal case",
    "url": "https://cointelegraph.com/news/ftx-execs-witnesses-sam-bankman-fried-criminal-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/12a091d3-0a84-4b74-b4d2-319413db0275.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to reports from the courthouse, Assistant U.S. Attorney Danielle Sassoon named Caroline Ellison, Gary Wang, and Nishad Singh among those who may offer testimony.</p>\n                    <p><p>Many former executives with cryptocurrency exchange FTX or its sister companies are on the list to testify in the United States Justice Department’s criminal case against <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, or SBF.</p><p>During jury selection for SBF’s trial on Oct. 3, Assistant U.S. Attorney Danielle Sassoon said former Alameda Research CEO Caroline Ellison, FTX co-founder Gary Wang, former FTX engineering director Nishad Singh, and former FTX chief operating officer Constance Wang were among the names of witnesses who may testify against Bankman-Fried. Ellison, Gary Wang, and Singh have already <a href=\"https://cointelegraph.com/news/former-ftx-director-to-reportedly-plead-guilty-to-fraud-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/former-ftx-director-to-reportedly-plead-guilty-to-fraud-charges/amp\">pleaded guilty to charges</a> related to their roles in the collapse of FTX, while Ryan Salame — the former co-CEO of FTX Digital Markets and the fifth person directly connected to the criminal case — will not testify.</p><p>Other names floated by Sassoon included SkyBridge Capital co-founder Anthony Scaramucci, who has previously <a href=\"https://cointelegraph.com/news/sam-bankman-fried-really-hurt-the-industry-anthony-scaramucci\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-really-hurt-the-industry-anthony-scaramucci/amp\">criticized SBF’s alleged role</a> in the crypto market downturn of 2022. Judge Lewis Kaplan started proceedings in the SBF criminal trial by asking prospective jurors questions related to the case.</p><p>According to multiple reports from the courthouse, Bankman-Fried appeared for the first time without his signature messy hair, which appeared to have been cut for the first week of the trial. Kaplan confirmed that prosecutors had not offered the former FTX CEO a plea deal in the case, and questioned prospective jurors on scheduling, hardships and conflicts of interest. He also issued a warning about avoiding the consumption of media related to the trial.</p><p>“This case has generated publicity,” <a href=\"https://twitter.com/innercitypress/status/1709286327521354098\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Kaplan according to reports. “You're to stay away from it — podcasts, anything. Did any of you watch 60 Minutes on Sunday? [likely referring to <a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-sbf-offer-donald-trump-not-to-run-president\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-sam-bankman-fried-sbf-offer-donald-trump-not-to-run-president/amp\">Michael Lewis’ interview</a> on Bankman-Fried]”.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">i am standing outside of SDNY for SBF’s trial  <a href=\"https://t.co/WDGd8kVqdQ\">pic.twitter.com/WDGd8kVqdQ</a></p>— Tiffany Fong (@TiffanyFong_) <a href=\"https://twitter.com/TiffanyFong_/status/1709170863633842250?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/explained/sam-bankman-fried-jail-before-ftx-trial\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/sam-bankman-fried-jail-before-ftx-trial/amp\"><strong><em>What has Sam Bankman-Fried been up to in jail?</em></strong></a></p><p>At the time of publication, Kaplan dismissed 4 out of 12 prospective jurors in the court and said selection would continue the morning of Oct. 4. The trial is expected to last through November, though the judge reportedly <a href=\"https://twitter.com/innercitypress/status/1709219734497948076\" target=\"_blank\" rel=\"noopener nofollow\">said</a> “[his] cases rarely take as long as the lawyers think”.</p><p>Opening arguments in the criminal trial are expected to begin on Oct. 4, in which the defense and prosecutors will each take roughly 25-40 minutes to address the jury. Bankman-Fried faces 7 criminal counts in his first trial, with another 5 charges to be addressed in a second trial starting in March 2024. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T21:00:47.000Z",
    "title": "3 Reasons Why Shiba Inu Price Might See A Massive Surge Over 400%",
    "url": "https://www.newsbtc.com/shiba-inu/3-reasons-shiba-inu-price-surge/",
    "description": "Just like the rest of the crypto market, the Shiba Inu price saw an uptrend at the start of the week before correcting back downward on Tuesday morning. However, this decline may point to the meme coin gearing up for another rally that could see it rise more than 400% and there are reasons why. The Blessings Of October One of the first reasons that suggests a massive surge this month is how the asset has performed historically in the month of October. Looking back at previous years, the Shiba Inu price had shown incredible strength in October 2021 rising over 800%, which eventually led to its all-time high. Related Reading: Bitcoin Creator Satoshi Nakamoto Sparks Speculation As Cryptic Email, X Account Resurfaces Then in October 2022, the altcoin marked a double-digit rise even amid the start of a very bearish market. Although this was much smaller than its 2021 figures, it was significant nonetheless and registered October as a bullish month for the altcoin. Going by the average of both of these figures, analytics platform CryptoRank posits that the Shiba Inu price could rise over 400% this month if it sticks to its historical performance. Shibarium Continues To Grow The Shiba Inu Layer 2 blockchain, Shibarium, built atop the Ethereum network debuted in August. Following this, there have been some notable milestones for the network. One of these is the total number of transactions that have been carried out. Data from ShibariumScan shows that the network has now crossed 3 million transactions. Additionally, wallet addresses on the network are now more than 1.25 million. The total blocks produced are also inching closer to the 1 million mark with each passing day. These metrics point to a growing rate of adoption which could significantly impact the Shiba Inu price. This is because SHIB serves as the governance token of Shibarium and participants who want to be involved in governance will need Shiba Inu tokens to do so, increasing demand. SHIB maintains tight trading range &#124; Source: SHIBUSD on Tradingview.com Shiba Inu Price Trajectory The Shiba Inu price has traded in a tight range between $0.0000071-$0.0000075, which suggests that the meme coin is finally finding a bottom. As a result, it could see a recovery using this point as a launch point and re-testing the resistance at $0.0000075. Related Reading: Will Ethereum Flip Bitcoin? Crypto Analyst Explains How If this resistance falls and bulls take control, it will be smooth sailing for Shiba Inu. Add in the recovering crypto market sentiment as shown by the Fear &#38; Greed Index moving up into neutral. Shiba Inu will naturally follow the trajectory of Bitcoin and such a recovery would take it above $0.000008. At the time of writing, SHIB is sitting at $0.000007279 after falling 3.33% in the last day. Its market cap of $4.2 billion makes it the 18-largest cryptocurrency in the industry. Featured image from Siam Blockchain, chart from Tradingview.com"
  }
]