[
  {
    "source": "CoinDesk",
    "date": "2024-01-19T13:00:00.000Z",
    "title": "First Mover Americas: Bitcoin Slips Over 15% Since ETF Approval",
    "url": "https://www.coindesk.com/markets/2024/01/19/first-mover-americas-bitcoin-slips-over-15-since-etf-approval/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Jan. 19, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-19T13:00:00.000Z",
    "title": "'One-Stop Station' Digital Identity Service Root Protocol Raises $10M Seed Funding",
    "url": "https://www.coindesk.com/web3/2024/01/19/one-stop-station-digital-identity-service-root-protocol-raises-10m-seed-funding/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The funding rounds, which gave Root a $100 million valuation, were led by Animoca Brands and included contributions from a slew of other notable investors"
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-19T12:51:14.000Z",
    "title": "HTX Services Restored After Exchange Hit by DDoS Attack: Justin Sun",
    "url": "https://www.coindesk.com/business/2024/01/19/htx-services-restored-after-exchange-hit-by-ddos-attack-justin-sun/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sun then followed up around 15 minutes later saying that all services on HTX had been restored"
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-19T13:00:00.000Z",
    "title": " Italian startup BlockInvest to tokenize non-performing loans ",
    "url": "https://cointelegraph.com/news/italian-startup-blockinvest-tokenize-non-performing-loans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNTU1ZmE3OGQtNDEyMC00NTZhLWIwYzgtMDZlNzM3M2I2NGU4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Real-world asset tokenization advances in Italy, where the distressed loan market has ballooned to hundreds of billions of euros.</p>\n                    <p><p data-ct-non-breakable=\"true\">Italian startup BlockInvest will tokenize non-performing loans (NPLs) in two projects, the first of which will be a proof-of-concept, and the second will tokenize Italian mortgages in default. The Italian NPL market is worth tens of billions of euros, peaking at 360 billion euros in December 2015 ($391 billion at the time), but it has since reduced.</p><p>BlockInvest will partner with Milan-based securitization consultant 130 Servicing in a proof-of-concept to issue native digital asset-based securities notes directly on-chain as a run-up to its main goal. After that, it will work with credit management company Morgan &amp; Davis, which is also based in Milan, to tokenize distressed real estate credits acquired by that company to enable tokenization of financing agreements and related instruments. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bank-of-italy-innovation-hub-supports-research-into-security-tokens-on-secondary-markets\">Italian central bank backs DeFi tokenization project with Polygon, Fireblocks</a></em></strong></p><p><a href=\"https://cointelegraph.com/news/italian-startup-blockinvest-tokenize-non-performing-loans\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-19T12:50:04.000Z",
    "title": "Ripple Presents XRP Ledger To Franklin Templeton For Consideration",
    "url": "https://cryptodaily.co.uk/2024/01/ripple-presents-xrp-ledger-to-franklin-templeton-for-consideration",
    "description": "Ripple is preparing for the institutional use of XRP by pitching the merits of the XRP Ledger (XRPL) to asset management behemoth Franklin Templeton."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T12:56:13.000Z",
    "title": "Q&A with Alex McConnell, CEO (Chief Executive Outlaw) of Vendetta Games",
    "url": "https://www.cryptopolitan.com/qa-with-alex-mcconnell-vendetta-games/",
    "description": "Web3 gaming is one of the biggest narratives in crypto, and it’s proving to be a tipping point for players in more ways than one. Though still relatively early, a diverse landscape of Web3 games is already thriving, each offering a unique blend of genres and mechanics with the added benefits of the crypto economy.&#160; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T12:48:10.000Z",
    "title": "Justin Sun challenges UN report on USDT and blockchain",
    "url": "https://www.cryptopolitan.com/justin-sun-challenges-un-report-on-usdt/",
    "description": "In a recent development, Justin Sun, the founder of the Tron blockchain, has publicly contested the claims made in a United Nations report concerning the misuse of blockchain technology, specifically focusing on the usage of Tether’s USDT. The UN report had raised significant concerns over the role of USDT in money laundering and scams, particularly [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-19T13:00:26.000Z",
    "title": "Cardano To $7? Analyst Predicts When ADA Will Resume Uptrend",
    "url": "https://www.newsbtc.com/news/cardano/cardano-7-analyst-predicts-ada-resume-uptrend/",
    "description": "An analyst has explained that if history repeats for Cardano, its price could resume its uptrend and rally to $7. Here&#8217;s when this could happen. Cardano Could Follow Same Price Trajectory As Back In 2020 In a new post on X, analyst Ali has discussed how ADA&#8217;s latest consolidation phase has been mirroring its trend from late 2020. Below is the chart that the analyst has shared for the cryptocurrency. The trend in the price of the asset over the last few years &#124; Source: @ali_charts on X As Ali has highlighted in the graph, ADA had been stuck inside a phase of consolidation for a couple of years in the lead-up to the 2021 bull run. Back then, the asset had been moving inside a parallel channel. Related Reading: Bitcoin NVT Golden Cross Shoots Bullish Signal, Rally To Restart? A &#8220;parallel channel&#8221; in technical analysis refers to the area made up of two parallel trendlines inside which the price of any commodity moves for a period of time. The upper line of such a channel generally provides resistance to the price and can thus be a probable point of a local top. Similarly, the bottom line can act as support and help the asset bottom out. Sustained breaks beyond either of these lines can suggest the continuation of the trend in that direction. For example, if the asset manages to escape above the channel, then it can be a signal that a bullish trend is now taking over. Parallel channels can be at an angle as well, enclosing uptrends or downtrends. In the context of the current discussion, though, a channel parallel to the x-axis is of interest, as Cardano&#8217;s price movement during the periods relevant here was completely flat. From the chart, it&#8217;s visible that ADA had briefly plunged below its parallel consolidation channel during March 2020. However, this break was a result of the COVID-19 crash, which was an anomalous event, so it may be safe to disregard it in the long-term picture. Since around mid-2022, the coin has also been moving inside a similar parallel channel. &#8220;Cardano&#8217;s current consolidation phase mirrors its late 2020 behavior,&#8221; explains the analyst. During the past consolidation phase, it took until mid-2020 before ADA managed to find a break above the pattern. The break wasn&#8217;t an entirely clean one, though, as the asset returned back for a retest of the upper line not too long after before finally setting off on a massive run in late 2020. &#8220;If history repeats itself, we might see ADA resuming its upward trend around April,&#8221; says Ali. &#8220;This pattern continuation could potentially lead to an upswing toward $0.80, a brief correction to $0.60, then $7!&#8221; Related Reading: XRP On Edge: Supply Hits Historical High-Risk Levels, Brace For Impact? From the current spot price of the cryptocurrency, a rally to $0.80 would mean an increase of about 60%. At the same time, a run towards the eventual $7 target would imply a rise of a whopping 1,300%. It now remains to be seen if Cardano does end up following this potential path highlighted by the analyst or not. ADA Price Cardano has struggled during the past week as its price has come down 13% towards the $0.50 level. Looks like the price of the asset has been going down recently &#124; Source: ADAUSD on TradingView Featured image from Michael Förtsch on Unsplash.com, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-19T13:00:01.000Z",
    "title": "Shiba Inu Whales Ramp Up Buying; Aave & Rebel Satoshi ($RBLZ) Expected to Soar",
    "url": "https://www.crypto-news-flash.com/shiba-inu-whales-ramp-up-buying-aave-rebel-satoshi-rblz-expected-to-soar/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-whales-ramp-up-buying-aave-rebel-satoshi-rblz-expected-to-soar",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T085745.551.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T085745.551.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T085745.551-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T085745.551-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T085745.551-450x281.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency landscape in 2024 is witnessing significant developments as large investors make strategic moves in the market. Shiba Inu (SHIB) whales, in a surprising revelation, have embarked on a substantial buying spree, acquiring a staggering 9.6 trillion SHIB tokens in the last 48 hours. Simultaneously, Aave (AAVE) and Rebel Satoshi ($RBLZ) are capturing the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-19T12:45:29.000Z",
    "title": "Binance Coin (BNB) Price Prediction 2024-2030: Will BNB reach $500 Soon?",
    "url": "https://coinedition.com/binance-coin-bnb-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Binance-Coin-BNB.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Coin (BNB) Price Prediction 2022\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Binance-Coin-BNB.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Binance-Coin-BNB-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Binance-Coin-BNB-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Binance-Coin-BNB-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Binance-Coin-BNB-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance Coin is the native token of the Binance Smart Chain (BSC). It is owned by the largest cryptocurrency exchange in the world for spot trading. Binance Smart Chain allows developers to create decentralized applications (DApps). Binance Coin is denoted with BNB and has increased by 33.6% in the past 30 days. Binance Coin (BNB) [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-coin-bnb-price-prediction/\">Binance Coin (BNB) Price Prediction 2024-2030: Will BNB reach $500 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-19T12:45:39.000Z",
    "title": "$1,291,000,000 Flows Into Spot Bitcoin ETFs in Less Than a Week of Trading Following Historic Approval: BitMEX",
    "url": "https://dailyhodl.com/2024/01/19/1291000000-flows-into-spot-bitcoin-etfs-in-less-than-a-week-of-trading-following-historic-approval-bitmex/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/01/Flows-Into-Spot-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The research arm of the cryptocurrency exchange BitMEX finds that more than $1.2 billion flowed into spot Bitcoin (BTC) exchange-traded funds (ETFs) just days after launching. BitMEX says that after four trading days, $1.29 billion flowed into the various new ETF products with BlackRock’s ETF receiving most of the funding. “Bitcoin spot ETFs day four update [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/19/1291000000-flows-into-spot-bitcoin-etfs-in-less-than-a-week-of-trading-following-historic-approval-bitmex/\">$1,291,000,000 Flows Into Spot Bitcoin ETFs in Less Than a Week of Trading Following Historic Approval: BitMEX</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]