[
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T08:30:55.000Z",
    "title": "FDIC orders OKCoin to correct misleading insurance claims",
    "url": "https://cryptoslate.com/fdic-orders-okcoin-to-correct-misleading-insurance-claims/",
    "description": "<p>The U.S. Federal Deposit Insurance Corp. (FDIC) has issued a cease and desist letter to OKCoin, warning the exchange about misleading statements regarding its insurance status. In a  June 15 letter, the FDIC alleged that the exchange and its senior executives made false representations stating or suggesting that certain crypto-related products were FDIC-insured. The agency [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fdic-orders-okcoin-to-correct-misleading-insurance-claims/\">FDIC orders OKCoin to correct misleading insurance claims</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-16T08:30:27.000Z",
    "title": "Reports Indicate Venezuela Is Preparing to Liquidate the Petro",
    "url": "https://news.bitcoin.com/reports-indicate-venezuela-is-preparing-to-liquidate-the-petro/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Reports Indicate Venezuela Is Preparing to Liquidate the Petro\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2143145087.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to reports, the government of Venezuela could be winding down the operations of the petro cryptocurrency. The decision comes after Sunacrip, the Venezuelan cryptocurrency watchdog, was set back by the alleged participation of its former head Joselit Ramirez in a potential $20 billion corruption scheme involving the settlement of Venezuelan oil sales. Reports Indicate [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T08:36:31.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T08:10:42.000Z",
    "title": "Why Is Bitcoin Up Today?",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-up-today-btc-rises-3/",
    "description": "The Bitcoin price has risen 3.2% since yesterday&#8217;s low of $24,827. At press time, BTC was trading at $25,590 and has thus reclaimed two extremely important price levels for the moment: first, the Bitcoin price has once again risen above the 200-day Exponential Moving Average (EMA) currently at $25,299, and second, the price is now also back above the 200-week EMA at $25,304 (with the weekly close becoming of crucial importance). As always, there are several narratives for yesterday&#8217;s rise in price. The most obvious narrative and currently the biggest topic in the market is the Bitcoin spot ETF filing by BlackRock, the world&#8217;s largest asset manager, with the US Securities and Exchange Commission (SEC). A spot ETF is seen as the holy grail that could finally open the floodgates for institutional liquidity, as Bitcoinist reported today. Reasons For The Bitcoin Rally BlackRock is believed to have a strong chance of getting the first spot-based Bitcoin ETF approved by the SEC due to its political influence and network. The new capital inflows made possible may have the potential to be the next bull run catalyst, according to many experts. &#8220;BlackRock getting a BTC ETF through would be the best thing that could happen to BTC,&#8221; Galaxy Digital CEO Mike Novogratz said yesterday. Accordingly, the news is likely to have created a bullish sentiment in the market. Related Reading: Here’s Why The Tether FUD Could Be Good For Bitcoin However, as always, several reasons play a role in the price movement on the Bitcoin market. One issue that should not be neglected is always the macro situation and the US dollar index (DXY). The latter has seen a setback in the last three days, falling from 104.70 to currently 102.21. This is likely to have favored BTC for now. As for the macro situation, Wednesday&#8217;s interest rate decision by the US Federal Reserve (Fed) certainly still plays a role. The main story is that the market is not buying Fed Chair Jerome Powell&#8217;s hawkish stance. Analysts believe that the two more rate hikes announced in the dot plot are a feint to prevent a bullish breakout in the financial markets. Finally, BTC&#8217;s decoupling from the S&#38;P 500 has also been seen in recent days. Yesterday&#8217;s move could have been the start of a catch-up rally in which BTC shakes off the unnecessary losses caused by the Tether FUD and the SEC lawsuits against Coinbase and Binance US. Related Reading: Bitcoin Holders Show No Panic Loss Selling, What Does It Mean? In addition, Bitcoin hodlers continue to show historically high conviction. As on-chain analyst Axel Adler Jr explained via Twitter, the total BTC inflow across all exchanges is currently at a low, suggesting that Bitcoin holders are in no hurry to sell their coins. The total BTC inflow across all exchanges is currently at a low, indicating that Bitcoin owners are not in a rush to sell their coins. #Bitcoin #HODL pic.twitter.com/JTscheVcgO — Axel 💎🙌 Adler Jr (@AxelAdlerJr) June 16, 2023 As NewsBTC reported, yesterday&#8217;s Tether FUD may also have once again marked the bottom for Bitcoin. Within the last bear market, there have already been three de-pegging events of stablecoins, all of them were marking the local bottom. At press time, BTC changed hands for $25,590. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T08:32:09.000Z",
    "title": "Stellar-Powered Financial Innovation: Franklin Templeton’s Mutual Fund Embarks on Billion-Dollar Market Transformation",
    "url": "https://www.crypto-news-flash.com/stellar-powered-financial-innovation-franklin-templetons-mutual-fund-embarks-on-billion-dollar-market-transformation/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-powered-financial-innovation-franklin-templetons-mutual-fund-embarks-on-billion-dollar-market-transformation",
    "description": "Franklin Templeton, a financial giant, is leveraging blockchain technology to enhance efficiency in capital markets, potentially reducing mutual fund fees. The company&#8217;s exploration of blockchain as an underlying technology of cryptocurrencies started with a public blockchain-based money market fund in 2021. #BuiltonStellar https://t.co/hHsTVVPW5l &#8212; Stellar (@StellarOrg) June 15, 2023 Embracing blockchain technology, Franklin Templeton, an [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T08:14:12.000Z",
    "title": "Terra Classic Unleashes Game-Changing v2.1.1 Parity Upgrade, LUNC Price Skyrockets 8%",
    "url": "https://www.crypto-news-flash.com/terra-classic-unleashes-game-changing-v2-1-1-parity-upgrade-lunc-price-skyrockets-8/?utm_source=rss&utm_medium=rss&utm_campaign=terra-classic-unleashes-game-changing-v2-1-1-parity-upgrade-lunc-price-skyrockets-8",
    "description": "Terra Classic implements v2.1.1 Parity Upgrade, driving LUNC price up by 8%. Upgrade aligns Terra Classic with Terra 2.0 and Cosmos chains, enhancing capabilities. Future plans include integrating Interchain Accounts and addressing CEX concerns. In a significant development for the cryptocurrency world, the Terra Classic blockchain has triumphantly implemented its landmark v2.1.1 Parity Upgrade. This [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T08:25:25.000Z",
    "title": "On-Chain Metrics Highlights ADA’s High Level of Resilience",
    "url": "https://coinedition.com/on-chain-metrics-highlights-adas-high-level-of-resilience/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-61-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-61-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-61-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-61.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The pair of lawsuits by the U.S. Securities and Exchange Commission (SEC) against Binance and Coinbase, wherein Cardano (ADA) was labelled as a security, led to a drop in the Ethereum-killer’s price to $0.23. Despite this, some of ADA’s metrics reached yearly highs, indicating increased adoption, according to data from Santiment. The blockchain intelligence firm [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/on-chain-metrics-highlights-adas-high-level-of-resilience/\">On-Chain Metrics Highlights ADA’s High Level of Resilience</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T08:15:35.000Z",
    "title": "Trust Wallet Token Price Prediction 2023-2030: Will TWT Price Hit $10 Soon?",
    "url": "https://coinedition.com/trust-wallet-token-twt-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Trust-Wallet-Token-TWT-Price-Prediction-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trust Wallet Token (TWT) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>With the introduction of cryptocurrency and blockchain technology, crypto wallets have played an important role in securing users’ crypto assets. Moreover, crypto wallets store the users’ public and private keys, allowing them to easily access their digital assets. Trust Wallet is one such decentralized wallet that enables users to have complete control over digital assets [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trust-wallet-token-twt-price-prediction/\">Trust Wallet Token Price Prediction 2023-2030: Will TWT Price Hit $10 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]