[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T05:55:00.000Z",
    "title": "Atomic Wallet hacker sends crypto to mixer used by Lazarus Group: Elliptic",
    "url": "https://cointelegraph.com/news/atomic-wallet-hacker-sends-crypto-mixer-elliptic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cfcd0277-868f-4482-9547-bd9f10b86c38.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stolen crypto from Atomic wallets is already on the move to mixers according to Elliptic. </p>\n                    <p><p>Illicit funds gained from the $35 million Atomic Wallet hack have been moving to a crypto mixer known to be favored by North Korea’s most notorious cyber-hacking group.</p><p>On June 5, blockchain compliance analytics firm Elliptic reported that its Investigations Team has traced funds from the $35 million Atomic Wallet hack to crypto mixer Sinbad.io.</p><p>It claims the mixing service was previously used to launder more than $100 million in crypto assets stolen by North Korea’s<a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/lazarus-group\"> Lazarus Group</a>.</p><p>Elliptic did not specify how much was sent to the mixer but noted that the loot was being swapped for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), before being obfuscated through the mixer.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Analysis of the ongoing Atomic Wallet hack, from our new Investigations Team account <a href=\"https://twitter.com/Elliptic_Inv?ref_src=twsrc%5Etfw\">@Elliptic_Inv</a> <a href=\"https://t.co/gbm3dX34JB\">https://t.co/gbm3dX34JB</a></p>&mdash; Elliptic (@elliptic) <a href=\"https://twitter.com/elliptic/status/1665755755071275024?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The firm also reported that Sinbad.io is likely to be a rebranded version of Blender.io, “another mixer heavily used to launder Lazarus Group funds,” and the first mixer to be sanctioned by the U.S. Treasury Department.</p><p>Several Atomic Wallet user accounts were<a href=\"https://cointelegraph.com/news/atomic-wallet-hack-losses-top-35\"> compromised</a> on June 3 resulting in losses of up to $35 million. However, the firm played down the incident claiming that the attack impacted<a href=\"https://cointelegraph.com/news/atomic-wallet-hack-affected-1-of-active-users-investors-claim-otherwise\"> less than 1%</a> of its monthly active users.</p><p>Atomic Wallet chief marketing officer, Roland Säde, told Cointelegraph the team is “doing everything they can to get those funds back,” before adding: “In order to create a concrete plan, the investigation must be completed.”</p><blockquote>“Of course, the team is devastated as we have been very proud about our security. We are working around the clock to get it all resolved and come out of this crisis stronger than before.”</blockquote><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/atomic-wallet-exploited-users-report-loss-of-entire-portfolios\"><strong><em> </em></strong><strong><em>Atomic Wallet exploited, users report loss of entire portfolios</em></strong></a></p><p>He suggested that victims<a href=\"https://support.atomicwallet.io/article/26-how-to-check-transaction-on-the-block-explorer\" target=\"_blank\" rel=\"noopener nofollow\"> track the illicit transfers</a> and report them to the most popular crypto exchanges, which “could prevent the scammers from exchanging their funds.”</p><p>“Of course, we are also reporting them directly, but the more eyes on hackers the harder it is for them to move them,” he said.</p><p>However, it could be too late for many in light of Elliptic’s latest findings.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\">Should crypto projects ever negotiate with hackers? Probably</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T05:45:00.000Z",
    "title": "Cboe Digital receives nod for margin trades on its crypto futures exchange",
    "url": "https://cointelegraph.com/news/cboe-digital-approved-margin-trades-crypto-futures-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/388c8455-f3aa-4b19-86b0-35c7d7b20b71.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Amid regulatory uncertainty, the approval has been seen as a small win for the U.S. crypto market and institutional investors.</p>\n                    <p><p>Cboe Digital, a major options exchange in the United States, has had its application to offer margined futures contracts for Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> and Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> approved by the United States commodities regulator. </p><p>While Cboe has <a href=\"https://cointelegraph.com/public/index.php/news/largest-us-options-exchange-cboe-to-enable-bitcoin-futures-trading-by-december-10/amp\">offered crypto futures contracts since December 2017,</a> margin trades were not available to users. </p><p>With the new approval, users will be able to trade Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> and Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> futures with a fraction of what they initially had to put upfront. </p><p>The approval has also been seen as a positive step for Cboe as it will allow traditional financial firms access crypto futures without intermediaries having to take custody.</p><p>“That’s where the concept of us also having a spot market has advantages,” said Cboe Digital President John Palmer in a <a href=\"https://www.bloomberg.com/news/articles/2023-06-05/cboe-wins-cftc-nod-for-margin-trades-on-crypto-futures-exchange?cmpid=socialflow-twitter-business\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> to Bloomberg. “We didn’t want to have to force participants to custody or touch the physical asset.”</p><p>The positive news comes at a pivotal time for the industry, as those in the U.S. market continue to face <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">regulatory uncertainty from the U.S. Securities Exchange Commission. </a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today the CFTC approved Cboe Clear Digital, LLC to clear margined digital asset futures. Learn more: <a href=\"https://t.co/tWLd2F7E2h\">https://t.co/tWLd2F7E2h</a></p>&mdash; CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1665849007464144899?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>CFTC Commissioner Christy Goldsmith Romero has praised Cboe’s approach, and <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/romerostatement060523b\" target=\"_blank\" rel=\"noopener nofollow\">stressed</a> that other crypto firms should follow Cboe’s lead and fit within the existing traditional markets structure first and foremost:</p><blockquote>“Too often in recent years, crypto firms have sought to take a business model or market structure that exists in an unregulated environment and port it over to the regulated environment. The CFTC does not have a window into the risks associated with models or structures in an unregulated environment.”</blockquote><p>“Cboe has not done that, instead operating within the parameters of the traditional futures market structure and regulatory framework,” she added.</p><p>The successful application stands in “stark contrast” to the application the CFTC reviewed from <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\">FTX prior to its bankruptcy,</a> Goldsmith Romero said.</p><p>The Commissioner explained that Cboe’s approval came after the regulator requested additional measures for “critical risk-mitigation” to lay out an approach to account for several “heightened risks” related to the digital asset market. </p><p>One of those measures included stricter cybersecurity practices, the Commissioner noted.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Want to know more about the staff advisory from last week? Read here about how it is the 1st step in using existing authorities for supervision over heightened risk in expanding regulated crypto. W/that &amp; cyber protections I requested, I support this regulated crypto expansion. <a href=\"https://t.co/KjRkGK3RyP\">https://t.co/KjRkGK3RyP</a></p>&mdash; Commissioner Christy Goldsmith Romero (@CFTCcgr) <a href=\"https://twitter.com/CFTCcgr/status/1665884983624445952?ref_src=twsrc%5Etfw\">June 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/cftc-proposes-reducing-anonymity-to-manage-risks\"><strong>CFTC proposes reducing anonymity to manage risks</strong></a></p><p>Gabor Gurbacs, a strategy advisor for stablecoin issuer Tether and investment management firm VanEck told his 56,400 Twitter followers on June 5 that the approval would likely be seen as a win for institutions, an investor class which Galaxy Digital CEO Mike Novogratz believes has <a href=\"https://cointelegraph.com/news/crypto-markets-flat-as-institutional-buying-slows-mike-novogratz\">contributed to the slow buying in recent months.</a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I worked with the OCC back in the days to get a margined model approved… the CFTC was waiting to see how the CME contracts end up functioning. Obviously they are working well… so looks like approvals are back on the table.</p>&mdash; Gabor Gurbacs (@gaborgurbacs) <a href=\"https://twitter.com/gaborgurbacs/status/1665877440764190722?ref_src=twsrc%5Etfw\">June 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cointelegraph reached out to Cboe for comment but did not receive an immediate response.</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T06:06:17.000Z",
    "title": "Arbitrum Price Analysis & Prediction (June 5th) – ARB Remains Above $1 as Volatility Shrinks, Will it Hold?",
    "url": "https://nulltx.com/arbitrum-price-analysis-prediction-june-5th-arb-remains-above-1-as-volatility-shrinks-will-it-hold/",
    "description": "Arbitrum has shown a sign of strength in the last 24 hours, but the price still looks bearish from a short-term perspective. Though, it is currently consolidating above a key support level. Since the price dropped to a key psychological level of $1 in May, ARB took a breath and subjected price actions to a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T05:53:31.000Z",
    "title": "Lido DAO Price Analysis & Prediction (June 5th) – LDO Gains 17% Weekly After Bouncing Off a Solid Level",
    "url": "https://nulltx.com/lido-dao-price-analysis-prediction-june-5th-ldo-gains-17-weekly-after-bouncing-off-a-solid-level/",
    "description": "Lido resumes bullish after successfully breaking above a crucial resistance trendline. It retested the trendline as support yesterday and now surging toward a key resistance level. But it seems to be facing resistance. After losing momentum for three months, LDO found support above the $1.5 level and bounced off to the peak of $2.5. It [&#8230;]"
  }
]