[
  {
    "source": "Cointelegraph",
    "date": "2024-03-30T05:35:21.000Z",
    "title": " Grayscale introduces crypto investment fund that prioritizes staking rewards  ",
    "url": "https://cointelegraph.com/news/grayscale-investments-dynamic-income-fund-gdic-crypto-solana-polkadot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMGFhYTQ1NDMtNWFmMC00ZGY2LTk3NzAtN2E4NjAyOTBkZDM3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Investors must have assets under management exceeding $1.1 million or a net worth over $2.2 million to qualify for Grayscale's Dynamic Income Fund.</p>\n                    <p><p>Grayscale Investments has announced an investment fund tailored for sophisticated clients eager to expose their portfolios to income generated from staking cryptocurrency tokens.</p><p>According to a recent <a href=\"https://www.grayscale.com/private-funds/gdif#section5488\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the Grayscale Dynamic Income Fund (GDIC) is only available to clients holding more than $1.1 million assets under management (AUM), or with a net worth of more than $2.2 million.</p><p>The fund intends to convert staking rewards into US dollars weekly, with distributions planned quarterly for investors. Additionally, Grayscale claims that careful analysis will be conducted to select the Proof of Stake (PoS) tokens included in the fund's portfolio. </p><p><a href=\"https://cointelegraph.com/news/grayscale-investments-dynamic-income-fund-gdic-crypto-solana-polkadot\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-30T05:14:02.000Z",
    "title": "ChatGPT Creator OpenAI’s Voice Cloning Technology Is So Good That Even They Find It Too Scary for Public Release",
    "url": "https://www.cryptoglobe.com/latest/2024/03/chatgpt-creator-openais-voice-cloning-technology-is-so-good-that-even-they-find-it-too-scary-for-public-release/",
    "description": "OpenAI, a prominent artificial intelligence research organization, published a blog post on March 29, discussing their latest development: Voice Engine. This model, created in late 2022, can generate natural-sounding speech that closely resembles the original speaker using only a 15-second audio sample and text input. While the technology is impressive, OpenAI is cautious about its […]\n"
  }
]