[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-11T22:00:48.000Z",
    "title": "Study: Weekly Digital Asset Investment Outflows Hit $59M; BTC Sees Largest Drop",
    "url": "https://news.bitcoin.com/study-weekly-digital-asset-investment-outflows-hit-59m-btc-sees-largest-drop/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Study: Weekly Digital Asset Investment Outflows Hit $59M; BTC Sees Largest Drop\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gg776655.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the first week of September, an outflow of $59 million worth of digital assets managed by Digital Asset Funds was recorded, the latest Coinshares data has shown. The latest outflow means the value of digital asset investment products under management has dropped by a total of $294 million or 0.9% in the past four [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T22:01:21.000Z",
    "title": "Just how important is Bitcoin’s global investment to TradFi?",
    "url": "https://www.cryptopolitan.com/bitcoins-measure-in-global-wealth-gdp/",
    "description": "In the rapidly evolving landscape of financial markets, one term has become increasingly prevalent—Bitcoin. Once dismissed as a speculative bubble or a tool for illicit activity, Bitcoin has matured into a complex, multi-faceted asset that holds transformative potential for traditional financial systems, often referred to as &#8220;TradFi&#8221; or Traditional Finance.&#160; On September 11, 2023, one ... <a title=\"Just how important is Bitcoin&#8217;s global investment to TradFi?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoins-measure-in-global-wealth-gdp/\" aria-label=\"More on Just how important is Bitcoin&#8217;s global investment to TradFi?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T22:00:04.000Z",
    "title": "Bitcoin Flash Crashes To New H2 2023 Lows, $20,000 Incoming?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-flash-crashes-to-new-h2-2023-lows-20000-incoming/",
    "description": "Bitcoin, the world&#8217;s most valuable cryptocurrency, is free-falling, looking at price action on September 11. From the daily chart, BTC is trading at $25,135, a marginal improvement after dropping to H2 2023 lows of $24,951 minutes earlier following an unexpected dump in the early trading hours of the New York trading session.  The Bitcoin Sell-Off Takes Form The crash on September 11 saw the coin drop below the consolidation of the past few trading days with the bearish breakdown, looking at price action, canceling bulls of August 31, and setting an increased selling pressure on August 17. The September 11 sell-off has seen a wide-ranging bear candlestick form. Even though it continues to print, it has relatively high trading volume, indicating high participation levels. Since the bar has above-average volumes, BTC will likely edge lower in the direction defined by the conspicuous bear bar of August 17, when the coin fell 12%, forcing BTC to trend below the $28,700 support level. Related Reading: Dogecoin Future In Question: What’s Next After Today’s Price Drop? Looking at price action, Bitcoin bears are in control and are actively reversing gains posted between June and July 2023. Then, Bitcoin prices rose from around the $20,000 level to as high as $31,800 by the end of July 2023. Afterward, the coin peaked and began falling as talks of a spot Bitcoin Exchange-Traded Fund (ETF) faded following the Securities and Exchange Commission&#8217;s (SEC) decision to put off their decision.  At spot rates, Bitcoin is down 20% from July 2023 lows but trading at critical Fibonacci retracement levels of the June to July 2023 resistance levels. Even though BTC and crypto prices tend to post deep retracements, the coin may find support at around $25,000. However, further losses from spot rates in continuation of the August 17 bear bar may see sellers press on rewind gains and force BTC towards June 2023 lows at around $20,000. The Death Cross On The Bitcoin Chart Based on technical candlestick arrangements, one analyst notes that the coin closed below the $25,600 mark after the close of last week&#8217;s bar. With this dip, the Ichimoku Cloud indicator has printed a &#8220;Death Cross.&#8221; Related Reading: Pro-XRP Lawyer John Deaton Reveals The Countries Topping The 75,000 Holder List Technical analysts note that Bitcoin prices tend to dump when this pattern forms before eventually rebounding over several weeks. Previous instances of the &#8220;Death Cross&#8221; occurred in June 2021 and January 2022, which saw BTC drop 19% and 23%, respectively.  Based on this, if a &#8220;Death Cross&#8221; prints, BTC may dump by 21%, forcing the coin back to the $20,000 level or June 2023 lows. Before then, BTC has to breach strong support levels at $25,600, $24,000, and $23,200 before retesting the $20,300 zone. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-11T22:01:15.000Z",
    "title": "Strong Dollar and Regulatory Woes Causing Negative Sentiment Among Institutions: CoinShares",
    "url": "https://dailyhodl.com/2023/09/11/strong-dollar-and-regulatory-woes-causing-negative-sentiment-among-institutions-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/CoinShares-Launches-Experimental-AI.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are currently less optimistic about crypto due to a strong dollar and ongoing regulatory concerns in the United States. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that digital assets saw outflows of nearly $60 million last week, marking the fourth week of outflows in a row. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/11/strong-dollar-and-regulatory-woes-causing-negative-sentiment-among-institutions-coinshares/\">Strong Dollar and Regulatory Woes Causing Negative Sentiment Among Institutions: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]