[
  {
    "source": "CoinDesk",
    "date": "2023-11-30T21:47:45.000Z",
    "title": "Republicans' Leadership Squabbles Delayed U.S. Crypto Bills Until 2024, Key Lawmakers Say",
    "url": "https://www.coindesk.com/policy/2023/11/30/republicans-leadership-squabbles-delayed-us-crypto-bills-until-2024-key-lawmakers-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Republican Rep. French Hill and Democrat Rep. Jim Himes see potential future floor votes for crypto bills being key to convincing the Democrat-controlled Senate to play ball."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-30T21:57:53.000Z",
    "title": "Protocol Village: Arbitrum Lands RARI's New NFT-Focused Layer-3 Chain",
    "url": "https://www.coindesk.com/tech/2023/11/30/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 30-Dec. 6, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-30T21:56:13.000Z",
    "title": "'Mysterious Whale' Is Accumulating Millions in Bitcoin—Or Is It?",
    "url": "https://decrypt.co/208165/mysterious-bitcoin-whale-millions-btc",
    "description": "The cryptosphere is abuzz over a wallet address that has amassed over $450 million in Bitcoin in the last few weeks. Who does it belong to?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T21:51:14.000Z",
    "title": " IRS proposal to track your wallets will put a damper on the crypto industry ",
    "url": "https://cointelegraph.com/news/irs-proposal-track-your-wallet-will-put-damper-crypto-industry",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvZjEyNjYyYWYtNjAyMy00NWE5LWI1M2QtMjYyOTM2NzdmZjZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Thanks to the IRS, your favorite decentralized exchange may need to begin asking for your address, birthdate, and other personal information beginning in 2025.</p>\n                    <p><p>The United States Internal Revenue Service (IRS) is <a href=\"https://cointelegraph.com/news/irs-releases-draft-proposed-reporting-rules-digital-asset-brokers\">considering a proposal </a>that would have sweeping consequences for the cryptocurrency industry. </p><p>The IRS is proposing an initiative under Section 6045 of the tax code to establish new tax rules for the treatment of cryptocurrency providers. Specifically, the agency is seeking to amend the law to expand the definition of “brokers” to include nearly all crypto-service providers — including, for instance, <a href=\"https://cointelegraph.com/learn/what-are-decentralized-exchanges-and-how-do-dexs-work\">decentralized exchanges (DEXs)</a> and wallet providers. </p><p>The IRS's move to redefine “broker” is not just a regulatory tweak but a fundamental shift that could reshape the entire U.S. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3b3bde5f-7525-4de5-8f2f-9c309013224d.jpg\"  /><figcaption style=\"text-align: center;\"><em>Example of a Form 1099-MISC. Source: Glassnode</em></figcaption></figure><p>For users and investors in the cryptocurrency space, this change could translate into increased reporting and compliance obligations — rolling back the anonymity and flexibility they currently offer users. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/irs-proposes-unprecedented-data-collection-crypto-users\"><strong><em>IRS proposes unprecedented data-collection on crypto users</em></strong></a></p><p>The move would be a decisive step toward bringing the world of digital assets in line with traditional financial systems in terms of regulatory oversight and transparency. </p><p><a href=\"https://cointelegraph.com/news/irs-proposal-track-your-wallet-will-put-damper-crypto-industry\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T21:45:12.000Z",
    "title": " Circle denies claims of illicit financing and ties to Justin Sun ",
    "url": "https://cointelegraph.com/news/circle-denies-claims-illicit-financing-ties-justin-sun",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvYzFmZDM5OWEtODBmZC00ZjcyLTgzMGEtNTA1YWMzNWRiMTc2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to an open letter published on Circle’s blog, the company has not provided services to Justin Sun since February.</p>\n                    <p><p>USDC stablecoin issuer Circle has <a href=\"https://www.circle.com/blog/circle-refutes-false-claims-on-illicit-financing\" target=\"_blank\" rel=\"noopener nofollow\" >denied</a> claims of illicit financing and ties to Tron founder Justin Sun, according to an open letter accessed from Circle’s blog on Nov. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a6d6d5d0-3cd2-416f-b9fb-14d1d9a226bc.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Circle open letter to U.S. Source: Circle.</em></figcaption></figure><p>The post was published on Nov. </p><p>In the letter, Disparte claimed that Circle has “recently became aware” of “false” claims being made about it by the “so-called Campaign for Accountability (“CfA”). </p><p>Disparte dismissed the allegation that Circle facilitated “major flows of funds to Hamas or Hezbollah,” claiming instead that these accusations are based on uncorroborated, unverified posts to social media. </p><p>Disparte also claimed that Circle stopped providing services to Justin Sun in February, 2023, stating:</p><blockquote>“Neither Mr. Sun and his affiliated companies in February 2023.”</blockquote><p>The open letter from Circle appears to have been sent in response to a Nov. CfA’s letter claimed that Circle<a href=\"https://cointelegraph.com/news/ethics-watchdog-rats-out-circle-for-links-to-tron-in-letter-to-sens-warren-brown\" > has extensive ties to Justin Sun’s Tron Foundation</a> and major Wall Street investors and that Sun’s cross-chain protocol, SunSwap, is often used for money laundering.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/wall-street-journal-corrects-article-misciting-hamas-crypto-terrorism-funding-data\" ><strong>WSJ debacle fueled US lawmakers’ ill-informed crusade against crypto</strong></a></em></p><p>Claims that crypto is being used to finance terrorism have been commonplace since the Israeli-Hamas war broke out on Oct. The media outlet later <a href=\"https://cointelegraph.com/news/wall-street-journal-corrects-article-misciting-hamas-crypto-terrorism-funding-data\" >corrected its story</a>, stating instead that $12 million in crypto “may have been” sent to these organizations.</p>\n\n\n\n</p><p><a href=\"https://cointelegraph.com/news/circle-denies-claims-illicit-financing-ties-justin-sun\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T21:48:12.000Z",
    "title": "Circle denies allegations of illicit financial activities",
    "url": "https://crypto.news/circle-denies-allegations-of-illicit-financial-activities/",
    "description": "Circle has publicly refuted allegations of improper banking relationships and financing of illicit activities in a detailed response to concerns raised by Senators Elizabeth Warren and Sherrod Brown."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T21:43:46.000Z",
    "title": "Brazil to implement new tax on foreign crypto earnings in 2024",
    "url": "https://crypto.news/brazil-to-implement-new-tax-on-foreign-crypto-earnings-in-2024/",
    "description": "The Brazilian Senate has approved a new taxation policy, effective Jan. 1, imposing up to a 15% tax on earnings from crypto held in foreign exchanges."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T22:00:16.000Z",
    "title": "dYdX To Unlock $478M Worth Of Tokens, Will Bears Have A Field Day?",
    "url": "https://www.newsbtc.com/news/defi/dydx-unlock-tokens-will-bears-have-field-day/",
    "description": "On December 1, dYdX, the layer-2 decentralized exchange, will unlock 150 million DYDX worth roughly $478 million to early investors and core team members. This substantial unlock has raised concerns among investors, who fear the influx of fresh tokens could substantially increase supply. If this is not matched by high demand, DYDX prices will likely pull back, reversing recent gains posted over the past few trading weeks.  DYDX Worth $500 Million To Hit The Market According to Bubblemaps data, out of the $478 million worth of DYDX, over 50% is allocated to venture capitalists (VCs), including Paradigm and Polychain. Zooming back and looking at their data, VCs seeded $100 million to the layer-2 decentralized exchange. These tokens were distributed to private investors through five wallets, including Coinbase Custody, Investor Distribution, and the Foundation Wallet. Currently trading at over $3, DYDX is at February 2023 levels and technically bullish. However, the upcoming token unlock casts a shadow over the token&#8217;s positive momentum. Related Reading: Shiba Inu L2 Shibarium Crosses 4 Million Transactions As Burn Rate Explodes Notably, dYdX, postponed its token unlock by ten months. According to data, the humongous DYDX unlock was initially postponed from February to December 2023. Following this move, DYDX prices edged higher. Even so, prices pulled back before consolidating in the better part of Q2, Q3, and early Q4 2023. There was a pronounced rally in late October 2023 as DYDX rose, riding the optimism across the crypto board. At spot rates, DYDX is up 82% from October 2023 highs. However, looking at price action, bears are retesting the 20-day moving average of the BB. A break below this level might trigger a sell-off, pushing prices back to October 2023 highs. Which Way Could Take The Price Action? While it is likely that prices could contract ahead or after the unlocking event, the team has devised a way of mitigating the expected selling pressure. To illustrate, the initial unlock will release 30% of the total amount. Afterward, there will be monthly equal releases over the next three years.   For optimists, however, that a significant portion of these tokens will go to the team, and investors could end up supporting prices. Team members and venture capitalists trade less frequently than retail investors, meaning the expected liquidation pressure, if any, could be limited. Moreover, some team members and even early investors might consider re-staking DYDX from their infrastructure, giving them more control.  Related Reading: Bitcoin Alert: $137 Million Moved By Long-Sleeping Whale, Market Braces For Impact Even with this release, crypto participants are upbeat, anticipating Bitcoin prices to track higher ahead of the expected spot Bitcoin ETF approval by the Securities and Exchange Commission (SEC). More tailwinds could result from the Bitcoin halving event in early Q2 2024. Feature image from Canva, chart from TradingView"
  }
]