[
  {
    "source": "NewsBTC",
    "date": "2024-02-20T02:00:51.000Z",
    "title": "Alameda Research’s Worldcoin Investment Hits All-Time High, Exceeding $50M As WLD Price Climbs",
    "url": "https://www.newsbtc.com/news/alameda-researchs-worldcoin-investment-hits-all-time-high-exceeding-50m-as-wld-price-climbs/",
    "description": "Worldcoin, the digital identity token ERC-20 project on the Ethereum (ETH) blockchain, has garnered significant attention. Its native token, WLD, emerges as the top performer among the top 100 cryptocurrencies by market capitalization.  The token has experienced a remarkable 31% uptrend in just 24 hours and a staggering 217% surge over the past fourteen days. This surge not only marks a new all-time high for WLD but also positively impacts Alameda Research, the now-bankrupt trading arm of the defunct FTX exchange, which holds a substantial stake in Worldcoin. Alameda Research&#8217;s Stake In Worldcoin Reaches $186 Million According to on-chain data, Alameda Research, a cryptocurrency trading firm co-founded by Sam Bankman-Fried and Tara Mac Aulay in 2017, has witnessed a surge in its Worldcoin holdings.  As WLD reached a new all-time high of $7.9788 on Monday, the trading firm&#8217;s investment in the project surged by $50 million, reaching a new record. Currently, Alameda Research holds 25 million WLD tokens, valued at $186 million, representing 33% of their total portfolio.  Related Reading: Bitcoin Spot ETFs: Issuers Set New Record As Weekly Inflows Cross $2.2 Billion This portfolio also includes other digital assets such as Bitcoin (BTC), BitDAO (BIT), Ethereum (ETH), Stargate Finance (STG), and the FTX token FTT. Whale Activity And AI Hype Drive WLD&#8217;s Price Surge Analysts such as Zameer Attar attribute the WLD price spike to strong whale activity, with one notable whale wallet withdrawing 2.09 million WLD tokens ($5.82 million) from Binance. This withdrawal caused a 25% surge in the price of Worldcoin, resulting in the whale&#8217;s holdings reaching an impressive $8.03 million. Additionally, the launch of OpenAI Sora by Sam Altman, one of the founders of Worldcoin, has triggered bullish action in WLD tokens.  Interestingly, Sora can create videos of up to 60 seconds with highly detailed scenes, complex camera movements, and multiple characters with emotions, which surrounding the hype of artificial intelligence (AI) has spurred investor interest, leading to more bullish sentiment surrounding WLD. Related Reading: NEAR Skyrockets Nearly 30% – Investors Intrigued By These Metrics Worldcoin, founded by Sam Altman, Alex Blania, and Max Novendstern, aims to revolutionize the global identity and financial network by creating a public utility known as World ID.  This privacy-preserving identity network enables users to verify their humanness online while maintaining their privacy through zero-knowledge proofs. The project has garnered significant funding, raising over $250 million across various funding rounds from investors, including a16z, Khosla Ventures, Bain Capital Crypto, Blockchain Capital, and Tiger Global. The combination of whale activity and positive market sentiment surrounding AI technologies has contributed to the considerable surge in Worldcoin&#8217;s price. Featured image from Shutterstock, chart from TradingView.com "
  }
]