[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-14T00:00:00.000Z",
    "title": "$SHIB: Shibarium Testnet Puppynet Surpasses 20 Million Transactions Ahead of Mainnet Launch",
    "url": "https://www.cryptoglobe.com/latest/2023/06/shib-shibarium-testnet-puppynet-surpasses-20-million-transactions-ahead-of-mainnet-launch/",
    "description": "The native test network of Shiba Inu’s layer-2 Shibarium, fondly called Puppynet, has recorded an impressive tally of over 20 million transactions, emanating from an estimated 16 million wallets. This notable achievement signals the network’s steady march towards a broader release slated for the forthcoming months. Puppynet is Shibariu’s testnet, meaning a blockchain network tailored […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T00:00:01.000Z",
    "title": "XRP SEC Case Could Be A Boon For Ethereum, Here’s Why",
    "url": "https://www.newsbtc.com/news/ripple/xrp-sec-case-could-be-a-boon-for-ethereum-heres-why/",
    "description": "Ethereum (ETH) has experienced a sharp decline since Saturday, dropping from the $1,838 line down to the current level of $1,738 while XRP traded sideways. This has caused concern among investors and traders in the Ethereum market. However, experts and analysts believe the recent disclosure of the Hinman documents on June 13th could mark a relief wave for Ethereum&#8217;s price.  The Hinman documents refer to a series of emails and memos from the former director of the Securities and Exchange Commission’s (SEC) Division of Corporation Finance, William Hinman, recently released to the public. The Hinman documents include a series of emails and memos from the former director of the SEC, who declared in 2018 that Ethereum&#8217;s native token, Ether, is not a security.  Related Reading: Bitcoin Market At Decision Point: Will This On-Chain Retest Be Successful? Ethereum Traders Should Keep An Eye On The XRP Case Recently, the release of emails from former SEC official William Hinman regarding Ethereum has caused a stir in the cryptocurrency community. While some have claimed that the documents are a smoking gun for the cryptocurrency, others have downplayed their significance. However, analyst Adam Cochran has argued that the documents are a nuance that puts current SEC Chairman Gary Gensler in a corner.  The Hinman speech attempted to clarify the SEC&#8217;s position on digital assets, such as ETH and XRP, and their relation to security regulations. In his speech, Hinman went beyond the scope of the Howey test and attempted to understand the nuanced intent of users vs. investors. He also questioned the concept of morphing, or whether something can be a security and then later not a security. The feedback comment from SEC staff specifically noted to him that they wanted to pivot to the discussion of &#8220;what is a security&#8221; rather than the idea of morphing. And that their concerns came from implication differences between the Securities Act and the Exchange Act. Hinman specifically drew attention to the idea that &#8220;promoters&#8221; have a very specific legal analysis point &#8211; and that even a coordinated group of actors working on something wouldn&#8217;t rise to the level of being deemed the promoter if their efforts weren&#8217;t essential. The draft on Ethereum, which came after meeting with Vitalik Buterin, Ethereum founder, and his lawyers, noted that Ethereum was not at such time a security and that secondary sales didn&#8217;t raise Securities Act concerns &#8211; only Exchange Act and Commodities Act concerns.  According to Cochran, that footnote is of incredible importance as it notes that the SEC internally viewed secondary sales not as sales of the promoter at the time.  Furthermore, Cochran believes the documents are damning for Gensler&#8217;s position because they acknowledge the idea of &#8216;reverse-morphing&#8217; of an asset becoming a security. Suppose the SEC wanted to argue that Ethereum is a security today. In that case, they must acknowledge the idea of &#8216;morphing&#8217;, prove the burden of a promoter being liable for all secondary sales of an asset ever, and break every precedent of horizontal and vertical commonality. Cochran further claimed:  For Gary to conclude that proof-of-stake Ethereum is a security, he would both need to fight a landslide of precedent on the most litigated part of Howey analysis &#8211; and admit to the idea that securities status can change over time with decentralization. Related Reading: Terra Classic Continues To Brush Off Market Downtrends, Buy Now? Overall, many market analysts believe that disclosing the Hinman documents could boost Ethereum&#8217;s price in the short term. This is because it removes some of the regulatory uncertainty surrounding Ethereum and could increase investor confidence in the cryptocurrency. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-14T00:05:29.000Z",
    "title": "US Banks Facing $1,450,000,000,000 in Commercial Real Estate Exposure As Lenders Prepare to Sell at a Loss: Report",
    "url": "https://dailyhodl.com/2023/06/13/us-banks-facing-1450000000000-in-commercial-real-estate-exposure-as-lenders-prepare-to-sell-at-a-loss-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/commercial-real-estate-banks.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>American banks are preparing to sell portions of their commercial real estate debt at a loss, according to a new report. Although most debtors are up to date on payments, banks are looking to clean up their books as Q2 comes to a close, reports the Financial Times. Chad Littell, an analyst at the commercial [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/us-banks-facing-1450000000000-in-commercial-real-estate-exposure-as-lenders-prepare-to-sell-at-a-loss-report/\">US Banks Facing $1,450,000,000,000 in Commercial Real Estate Exposure As Lenders Prepare to Sell at a Loss: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]