[
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T04:13:32.000Z",
    "title": "Banking is 'slowly dying' — Former TradFi execs on reasons for joining crypto",
    "url": "https://cointelegraph.com/news/former-tradfi-execs-crypto-explain-why-they-left-banking",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/94381713-eef7-4a6b-8fb2-c585af9b8a64.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph spoke to former senior executives in traditional finance who've made the move to crypto. Would they ever go back?</p>\n                    <p><p>Despite plenty of <a href=\"https://cointelegraph.com/news/sec-and-binance-us-strike-deal-on-asset-access\">regulatory action</a> in the United States and an ongoing crypto winter, former TradFi executives, now in crypto, said there’s no desire to return to their old banking lives</p><p>Instead, former traditional bankers who’ve pivoted to crypto, remain bullish about the industry's future, and love the fact they can actualize real innovation.</p><p>Lisa Wade, CEO of DigitalX is one such executive, pivoting to crypto in December 2021. She was once the head of innovation and sustainability at National Australia Bank (NAB), one of Australia’s Big Four banks. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">DigitalX Funds Limited (ASX:DCC) announced that it has recruited Lisa Wade (she/her) Wade as its new Chief Executive Officer.<a href=\"https://twitter.com/hashtag/executiveleadership?src=hash&amp;ref_src=twsrc%5Etfw\">#executiveleadership</a> <a href=\"https://twitter.com/hashtag/citi?src=hash&amp;ref_src=twsrc%5Etfw\">#citi</a> <a href=\"https://twitter.com/hashtag/natwest?src=hash&amp;ref_src=twsrc%5Etfw\">#natwest</a> <a href=\"https://twitter.com/hashtag/nab?src=hash&amp;ref_src=twsrc%5Etfw\">#nab</a><a href=\"https://t.co/lxORT3KDJp\">https://t.co/lxORT3KDJp</a></p>&mdash; Finance Magnates (@financemagnates) <a href=\"https://twitter.com/financemagnates/status/1474046668240793605?ref_src=twsrc%5Etfw\">December 23, 2021</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Wade told Cointelegraph that the crypto industry provides her with greater freedom <a href=\"https://cointelegraph.com/innovation-circle/going-parabolic\">to take innovative risks</a> compared to the banking sector.</p><blockquote>“It is becoming very obvious Web3 financial rails are the future — it is hard to innovate internally so those of us with a fire in our bellies are jumping ship.”</blockquote><p>Wade holds the belief that crypto will witness widespread adoption in the coming years, stating that “like ESG, this will be mainstream in 10 years or sooner.”</p><p>She added that she moved over to the crypto industry to “build something great […] in a way that a bank couldn’t.”</p><p>Similarly, Guy Dickinson, CEO of carbon trading platform BetaCarbon, moved away from a lucrative executive banking role in 2022 as the former treasurer of HSBC Australia.</p><p>“I moved into the Web3 space as the carbon credit and environmental markets space was not easily accessible and Web3 provided access to the market,” he said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I left my engineering job at a TradFi company in 2017 to professionally work in the crypto space. My colleague turned to me when I resigned and said “Remember, quitters never win and winners never quit.” No hard feelings, but I think about your stupid statement often, Steve</p>&mdash; Malcolm  (@mxlcolm) <a href=\"https://twitter.com/mxlcolm/status/1489285409465061377?ref_src=twsrc%5Etfw\">February 3, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>For Dickinson, the motivation behind the move wasn’t driven by money, but rather by a quest for personal fulfillment.</p><p>“It is not more lucrative; it is however far more satisfying,” he said, adding that jobs in traditional finance are not as safe as they once were:</p><blockquote>“The banking industry is slowly dying. Constant layoffs and technological efficiencies render many professional service roles at risk. A senior banking official always has a target on his back in the current landscape.”</blockquote><p>Simon Dixon, CEO of investment platform BnkToTheFuture told Cointelegraph he actually attempted to create a traditional bank in 2011 before building a “regulated crypto securities business.”</p><p>Dixon said when he did his research into creating a traditional bank, he found out it was actually a massive risk:</p><blockquote>“When we applied for a license, the regulators told us we had to store our funds in another fractional reserve bank and that it’s only profitable if we leverage client funds like all banks.”</blockquote><p>Later that year, Dixon discovered Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and took an interest in the fact that “funds are owned in self-custody, spent peer to peer and backed by full reserve math and code.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/investors-crypto-institutional-backing-nomura-survey\"><strong><em>Investors want crypto, but not without TradFi backing: Nomura survey</em></strong></a></p><p>Many TradFi executives have been slowly making to move to crypto for some time. </p><p>According to a Fortune <a href=\"https://fortune.com/2022/07/06/jpmorgan-execs-jobs-crypto-industry/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> published in July 2022 <a href=\"https://cointelegraph.com/news/jpmorgan-uses-blockchain-for-24-7-dollar-transfers-with-indian-banks\">two JPMorgan executives</a>, Eric Wragge and Puja Samuel, resigned to pursue a career in the crypto industry.</p><p>Wragge, previously a managing director at JPMorgan, made the decision to join Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>) as its head of business development and capital markets. </p><p>Samuel, who served as head of ideation and digitalization at JPMorgan, took on the position as head of corporate development at Digital Currency Group.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\"><strong><em>Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-22T04:10:00.000Z",
    "title": "Stablecoin Market Cap Shrinks to Lowest Level Since September 2021: CCData Report",
    "url": "https://www.cryptoglobe.com/latest/2023/06/stablecoin-market-cap-shrinks-to-lowest-level-since-september-2021-ccdata-report/",
    "description": "The crypto market has seen a shift in the winds, as the total market capitalization of stablecoins experienced a decrease of 0.57% to $128 billion in June, the lowest it’s been since September 2021, according to the latest Stablecoins &amp; CBDCs report by CCData. The figures mark the fifteenth consecutive month of decline in the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T04:29:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  }
]