[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T19:00:00.000Z",
    "title": "The secret to successful branding in Web3: The science of choosing",
    "url": "https://cointelegraph.com/innovation-circle/the-secret-to-successful-branding-in-web3-the-science-of-choosing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c987134b-d20d-4726-83ec-2295f1f932a1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>One more thing: It is not an art or magic. There is a science to branding.</p>\n                    <p><p>Human nature means it’s not easy to make decisions. Choosing one option often means forsaking others and can require careful analysis and thought, which takes energy. It’s why the term “decision fatigue” was coined, referring to our inability to continue making good decisions over a sustained period. </p> <p>However, in crypto marketing, the inability to choose is treated as a universal feature, not a bug. For founders, there’s nothing like having the freedom to be everything to everybody all the time. Right? On your website, your investor decks, your whitepaper, your social channels and your blog, you boast: This brand is all about the tech. </p> <p>But it’s also all about the community. Not to forget security, trust and privacy. And, of course, you are all about disruption, revolution and exponentialism. </p> <p>Why not throw in a Lambo to the moon if it will make people happy?</p> <h3>Let’s stop the wishful thinking</h3> <p>A brand needs to leave a mark to be effective. No matter how deep or memorable, every interaction between the customer and the company is meant to contribute to leaving that mark. It’s always the same mark, in the same spot. That’s what it takes to be branded (metaphorically, of course) forever. </p> <p>So, to achieve this effect, powerful brands make sure that their message is consistent. It has to be succinct, clear and delineated. It also must be understandable, credible and relevant. Only then does your brand start to form. But first and foremost, you must choose. Many of the most successful brands we know have made their name on a single unique selling proposition (USP). </p> <p>Think cars such as Volvo and it’s association with safety. For decades they used one word, with one need and a singlular positioning. With Coca-cola for example — it’s always the real thing. You always know when you’re drinking a cola that isn’t a Coke. The recipe and product may even vary slightly per country, but the Coke brand is universal. </p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>With Nike they have “Swoosh” and “Just do it.” Every image, every athlete collaboration, every product, <a href=\"https://cointelegraph.com/news/nike-unveils-nft-platform-nifty-newsletter-nov-9-15\">even its NFT platform</a> — the brand is what pulls it all together. </p> <p>So, what’s it going to be? Fun? Safety? Speed? Community? Convenience? Your options are wide open, but understand this: You need to be willing to commit to <em>one</em>. </p> <h3>Finding the sweet spot for your positioning</h3> <p>Ok, so you’re committed. Where should you start? The smart choice is to start with the current perception. You’ve been active in the market and hence have already created a brand perception, whether intentionally or not. What relevant needs and attributes does your brand currently respond to? And what are the most relevant needs you are actively addressing? </p> <p>Your community is the best source of insights into the answers to these questions. Surveys, social media polls or simply mining existing user data and communications for insights can all be valuable input to support and validate your decision-making. </p> <p>However, once you know how customers perceive your brand and how it fulfills their needs, you can combine this knowledge with your company vision and roadmap, as well as with your capabilities. Using this formula, you will be able to shape a credible and aspirational brand and brand vision that rallies your company and gives prospects a reason to buy into you. </p> <h3>Good news: The impact is transformational</h3> <p>Good marketing is a symphony. The different channels need to be orchestrated, but first and foremost, they all need to play the same score. Once you have that in place, you can play each instrument and enjoy the harmony of everything joining together, sounding and resounding to become so much more. </p> <p>Better yet, everyone on your team will have clarity and share a brand purpose. That is powerful in itself. But far beyond that, conveying a strong, succinct, relevant, distinct and credible unique selling idea will lead to more profits — as decades of branding lessons from consumer goods, financial services and all the world’s other industries have proven. </p> <p>One more thing: It is not an art or magic. There is a science to branding.</p> <p>There <em>is</em> a right and a wrong. There<em> is</em> a sweet spot for your brand positioning, where a specific set of relevant needs are catered to in a credible and distinctive fashion. This isn’t a guessing game to be played in a meeting room with your creative team; it’s psychology. And once you have it, you need to tie it to a unique selling idea. To a single brand story.</p> <p>Are you ready to choose?</p> <p><em>German is co-founder and chief relevance officer of <a href=\"https://www.therelevancehouse.com/\">THE RELEVANCE HOUSE</a>, a branding and marketing agency focused on blockchain and Web3.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-21T19:00:31.000Z",
    "title": "Short-term holders are sitting on 1.3M BTC at a loss",
    "url": "https://cryptoslate.com/short-term-holders-are-sitting-on-1-3m-btc-at-a-loss/",
    "description": "<p>Bitcoin experienced a significant dip last week, losing over 9% in 24 hours and dropping to $26,299 on Aug. 18. Its price plunged even further during the weekend, settling at $26,198 on Aug. 20. A massive exodus of leverage from the derivatives market primarily triggered this abrupt decline. As leverage was flushed out, the spot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/short-term-holders-are-sitting-on-1-3m-btc-at-a-loss/\">Short-term holders are sitting on 1.3M BTC at a loss</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-21T18:50:40.000Z",
    "title": "Binance begins limiting access to SEPA customers more than a month ahead of announced deadline",
    "url": "https://cryptoslate.com/binance-begins-limiting-access-to-sepa-customers-more-than-a-month-ahead-of-announced-deadline/",
    "description": "<p>Binance has started the process of early account closures for a select group of its customers within the SEPA (Single Euro Payments Area). This move comes ahead of the previously announced termination of SEPA services on 25th September 2023 due to disruption with their EUR Fiat payments partner, Paysafe. Several Binance users in the SEPA [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-begins-limiting-access-to-sepa-customers-more-than-a-month-ahead-of-announced-deadline/\">Binance begins limiting access to SEPA customers more than a month ahead of announced deadline</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-21T19:06:29.000Z",
    "title": "Steve Cohen-backed NFT Platform Recur to Close Doors After Raising $50M Just 2 Years Ago",
    "url": "https://cryptobriefing.com/recur-nft-shut-down-platform-steve-cohen/?utm_source=feed&utm_medium=rss",
    "description": "Recur, a prominent NFT platform backed by hedge fund mogul Steve Cohen, has decided to wind down its Web3 platform operations, despite having raised $50 million in a series A funding round in late 2021 at a valuation of $333M."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T18:53:00.000Z",
    "title": "\n                        FBI Seized Nearly $2M Worth in Crypto in 3 Months\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/fbi-seized-nearly-2m-worth-in-crypto-in-3-months",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">A new report from the US FBI reveals it confiscated almost $2 million in cryptocurrencies between March and May 2023.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In its latest filing, the Federal Bureau of Investigations (FBI) revealed it seized about $1.7 million in cryptocurrencies from March to May. In an effort to combat illicit activities, the FBI seized crypto assets, including Bitcoin, Ether, Tether, Monero and Dai.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The agency reported that most of the confiscations were in ether, with tokens to the value of $800,000 seized. Around $147,000 in Bitcoin (BTC), $307,000 in Tether (USDT), 469,000 in Dai (DAI), and $20,000 in Monero (XMR) were seized. The FBI even managed to seize $200 worth of Dogecoin (DOGE).</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">According to the FBI, the majority of seizures were from Binance accounts. The largest confiscation took place in the Eastern District of Virginia in the form of $463,811 in ether. The agency said most of the seizures came from Florida and Virginia. The FBI further confiscated digital assets in Arizona, California, Connecticut, Georgia, Minnesota, Nebraska, New Mexico, New Jersey, New Hampshire, Illinois, Massachusetts, Louisiana, New York, Ohio, Pennsylvania, and Oklahoma.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In its filing, the agency said the asset seizures came about after violations of federal regulations: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;The Federal Bureau of Investigation (FBI) gives notice that the property listed below was seized for federal forfeiture for violation of federal law.&rdquo;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The FBI has been cracking down on digital assets used in illicit activities. In February, the agency announced that it confiscated several cryptocurrencies, digital assets, and NFTs worth around $250,000 from two different locations in the US. The agency also announced in March that it launched an investigation into Do Kwon and Terraform Labs.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:59:01.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:48:55.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:47:00.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $55.77, with a 24-hour trading volume of $64,084,181. Aave is down 1.81% in the last 24 hours. The current CoinMarketCap ranking is #44, with a live market cap of $809,858,981. It has a circulating supply of 14,521,295 AAVE coins and a max. Supply of 16,000,000 ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T19:00:04.000Z",
    "title": "Bitcoin Price Follows This 1930’s Chart, Why BTC Could Keep On Falling",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-follows-this-1930s-chart-why-btc-could-keep-on-falling/",
    "description": "Volatility is back for the Bitcoin price and the crypto market, but it currently favors the bears as value tumbles in the past few days. The nascent sector was moving sideways, but a liquidation cascade forced prices into critical support levels, but the worse might yet come if BTC fulfills a prophecy. Related Reading: Bitcoin Weekly Chart Completes Double Top: Market Shifts Ahead? As of this writing, the Bitcoin price trades at $26,100 with sideways movement in the last 24 hours. Over the past week, the price of BTC corrected back to $26,000 after its lost support at the high of its current levels. Is The Worst Yet To Come For The Bitcoin Price? Bloomberg Intelligence’s Senior Commodity Analyst Mike McGlone shared an analysis on social media platform X. Therein, the analyst classified Bitcoin as one of the “best-performing assets in history,” the cryptocurrency rose from $100 to around $70,000 in less than ten years. At the same time, McGlone pointed out the similarities between the Bitcoin price chart and the 1930s stock market chart. During this period, the US economy went through one of its worse history leading to a series of economic reforms. Comparing both sectors, McGlone forecasted a potential drop in the Bitcoin price once the US Federal Reserve (Fed) turns its monetary policy around. As seen in the chart below, the financial institution has raised interest rates to slow down inflation. As a result, BTC’s price has declined as liquidity leaves financial markets and uncertainty increases. Unlike popular belief, the Bloomberg Intelligence analyst expects the cryptocurrency to dip further if the Fed loses its monetary policy. McGlone explained: One of the best-performing assets in history and a leading indicator &#8212; Bitcoin &#8212; appears similar to the stock market in 1930. Statistician and entrepreneur Roger Babson began warning about elevated equity prices well before economist Irving Fisher proclaimed a &#8220;permanently high plateau&#8221; in 1929. The Fed tilts our bias toward a stance similar to Babson&#8217;s. The analyst above focuses on the increasing potential benefits for investors getting out of BTC and into government-based financial instruments, such as US Treasury notes which are currently yielding 5%. As long as this environment continues, BTC shows “mostly downward biases,” as the analyst concluded. Related Reading: Diamond In The Rough: Solo Bitcoin Miner Secures $160,000 Block Reward On short timeframes, the price of BTC continues to trade sideways, licking its wounds from last week’s liquidation cascades. The last time the cryptocurrency experienced a similar price action was in late 2022, and it took several weeks of sideways price action before a recovery was possible. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T19:00:09.000Z",
    "title": "Meet This New Meme coin That is Set to Outshine Giants like Enjin coin (ENJ) and Sandbox (SAND)",
    "url": "https://www.crypto-news-flash.com/meet-this-new-meme-coin-that-is-set-to-outshine-giants-like-enjin-coin-enj-and-sandbox-sand/?utm_source=rss&utm_medium=rss&utm_campaign=meet-this-new-meme-coin-that-is-set-to-outshine-giants-like-enjin-coin-enj-and-sandbox-sand",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-63.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-63.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-63-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-63-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Several projects in the cryptocurrency market are based on a Play-to-Earn (P2E) concept. Enjin Coin (ENJ), and The Sandbox (SAND) fall under this category. These projects utilised blockchain technology in gaming to create an opportunity for gamers to earn money while doing what they enjoy doing. The platforms’ native currencies are often used as incentives [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T19:07:00.000Z",
    "title": "Bitcoin Faces Deeper Decline as Market Sentiment Turns Bearish: DataDash",
    "url": "https://coinedition.com/bitcoin-faces-deeper-decline-as-market-sentiment-turns-bearish-datadash/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/The-Bitcoin-Collapse-Is-About-To-Get-Worse-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a stark turn of events, the once-bullish sentiment surrounding Bitcoin has taken a sharp nosedive, leaving investors and enthusiasts concerned about the crypto’s future. In a recent video by Nicholas Merten, renowned crypto analyst and founder of DataDash, he delved into the ominous signs indicating that Bitcoin&#8217;s price decline might be far from over. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-faces-deeper-decline-as-market-sentiment-turns-bearish-datadash/\">Bitcoin Faces Deeper Decline as Market Sentiment Turns Bearish: DataDash</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T18:45:43.000Z",
    "title": "Bad Actors Deployed Over 500 Scam Crypto Assets on Coinbase’s Ethereum Layer-2 Prior to Launch: Surveillance Firm",
    "url": "https://dailyhodl.com/2023/08/21/bad-actors-deployed-over-500-scam-crypto-assets-on-coinbases-ethereum-layer-2-prior-to-launch-surveillance-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Default-Could-Crush-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto surveillance firm says black hat developers have placed hundreds of malicious tokens on Coinbase’s newly launched Ethereum (ETH) layer-2 chain. According to Solidus Labs, bad actors deployed more than 500 scam tokens on Base days after the blockchain debuted for developers on July 13th and before the network became available for the public [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/bad-actors-deployed-over-500-scam-crypto-assets-on-coinbases-ethereum-layer-2-prior-to-launch-surveillance-firm/\">Bad Actors Deployed Over 500 Scam Crypto Assets on Coinbase’s Ethereum Layer-2 Prior to Launch: Surveillance Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T18:41:26.000Z",
    "title": "Vast Majority of Bitcoin Transactions Involve Ordinals, Despite Large Volume Decline",
    "url": "https://dailyhodl.com/2023/08/21/vast-majority-of-bitcoin-transactions-involve-ordinals-despite-large-volume-decline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcion-suddenly-moves-satoshi.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ordinals are still dominating Bitcoin&#8217;s (BTC) blockchain, with the majority of transactions on the network involving them, despite a large price decline. Bitcoin ordinals allow users to inscribe digital assets such as images and videos to a single satoshi, or an individual unit of BTC, to create the equivalent non-fungible tokens (NFTs) on the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/vast-majority-of-bitcoin-transactions-involve-ordinals-despite-large-volume-decline/\">Vast Majority of Bitcoin Transactions Involve Ordinals, Despite Large Volume Decline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]