[
  {
    "source": "Decrypt",
    "date": "2023-05-30T16:37:24.000Z",
    "title": "Controversial Stablecoin Issuer Tether Plans to Start Mining Bitcoin",
    "url": "https://decrypt.co/142830/controversial-stablecoin-issuer-tether-plans-to-start-mining-bitcoin",
    "description": "Stablecoin issuers have accrued huge amounts of Bitcoin in the past—but it hasn't always gone to plan."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T16:15:00.000Z",
    "title": "Tether moves into Bitcoin mining in Uruguay",
    "url": "https://cointelegraph.com/news/tether-moves-into-bitcoin-mining-in-uruguay",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/11dcb2b9-e20c-455b-b733-1e0d7138c470.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As part of its expansion into mining, Tether cited Uruguay’s capability of generating 94% of its electricity from renewable sources, including wind and solar.</p>\n                    <p><p>Stablecoin issuer Tether has announced it will be launching Bitcoin mining operations in Uruguay.</p><p>In a May 30 announcement, Tether <a href=\"https://tether.to/en/tether-invests-in-energy-production-and-sustainable-bitcoin-mining-in-uruguay\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it planned to start a mining arm in the South American nation “in collaboration with a local licensed company” in addition to investing in Uruguay’s energy production. The stablecoin issuer claimed the venture would utilize renewable energy sources aimed at “sustainable” Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining and planned to hire additional team members.</p><p>\"By harnessing the power of Bitcoin and Uruguay's renewable energy capabilities, Tether is leading the way in sustainable and responsible Bitcoin mining,\" said Tether chief technology officer <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/paolo-ardoino\">Paolo Ardoino</a>. \"Our unwavering commitment to renewable energy ensures that every Bitcoin we mine leaves a minimal ecological footprint while upholding the security and integrity of the Bitcoin network.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At Tether, we understand the importance of energy in driving progress &amp; enabling thriving communities. That&#39;s why we&#39;re dedicated to harnessing the power of renewable energy to mine <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>, the world&#39;s most open &amp; secure monetary network.<br><br>Learn More  <a href=\"https://t.co/LmBQptyobi\">https://t.co/LmBQptyobi</a> <a href=\"https://t.co/VrG20OnE1Z\">pic.twitter.com/VrG20OnE1Z</a></p>&mdash; Tether (@Tether_to) <a href=\"https://twitter.com/Tether_to/status/1663516281922809857?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tether cited Uruguay’s capability of generating 94% of its electricity from renewable sources including wind, solar, and potentially hydropower, as well as its reliable grid. Job listings on its website at the time of publication also suggested expansion into South Africa and Brazil.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/usdt-market-share-jumps-amid-economic-uncertainty-usdc-shrinks\"><strong><em>USDT market share jumps amid economic uncertainty, but USDC shrinks</em></strong></a></p><p>The mining announcement <a href=\"https://cointelegraph.com/news/tether-to-buy-bitcoin-based-on-monthly-net-profits\">followed Tether saying it planned</a> to “regularly allocate up to 15%” of its profits into BTC purchases. The stablecoin issuer reported it <a href=\"https://cointelegraph.com/news/tether-has-1-5b-in-bitcoin-reserves-bdo-italia\">held roughly $1.5 billion in Bitcoin</a> as of the first quarter of 2023 — 2% of its total reserves. Tether kept most of its holdings in cash, cash equivalents and U.S. Treasury bills.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-05-30T16:36:33.000Z",
    "title": "FTX Case Passed to Third Circut Court of Appeals: ‘The facts are not in dispute’",
    "url": "https://cryptobriefing.com/ftx-case-passed-to-third-circut-court-appeals/?utm_source=feed&utm_medium=rss",
    "description": "Delaware District Judge Colm F. Connolly has approved to pass the case involving FTX to the U.S. Third Circuit Court of Appeals, leading the way for an independent investigators appointment,..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T16:33:30.000Z",
    "title": "How Is Commodity Tokenization A Feature Advantage for DeFi?",
    "url": "https://www.cryptopolitan.com/commodity-tokenization-advantage-for-defi/",
    "description": "Tokenizing commodities is a killer use case for DeFi. Commodities are physical goods such as precious metals or physical art traded on exchanges. Commodity tokenization refers to creating digital tokens representing a commodity&#8217;s ownership. This process allows for fractional ownership of commodities and enables investors to buy and sell commodities in smaller quantities. This Cryptopolitan ... <a title=\"How Is Commodity Tokenization A Feature Advantage for DeFi?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/commodity-tokenization-advantage-for-defi/\" aria-label=\"More on How Is Commodity Tokenization A Feature Advantage for DeFi?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T16:30:10.000Z",
    "title": "Bitcoin Miners Receive Inflows Of 7,000 BTC, What Does It Mean?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miners-receive-inflows-7000-btc-what-mean/",
    "description": "On-chain data shows that Bitcoin miners have recently received net inflows of about 7,000 BTC. Here&#8217;s what this may mean for the asset. Bitcoin Miner Netflow Has Registered A Large Positive Spike As an analyst in a CryptoQuant post pointed out, Poolin mining pool seems to have been behind most of the recent inflows. The relevant indicator here is the &#8220;miner netflow,&#8221; which measures the net amount of Bitcoin entering or exiting the wallets of all miners. When the value of this indicator is positive, these chain validators are now depositing a net number of coins into their addresses. Such a trend can indicate that the miners are accumulating currently, which can be bullish for the price. On the other hand, values of the metric below zero imply this cohort is taking coins out of their wallets. The main reason why these investors would transfer their coins away from their addresses is for selling-related purposes. Thus, this kind of trend can have bearish implications for the asset. Now, here is a chart that displays the trend in the Bitcoin miner netflow over the past year and a half: The value of the metric seems to have been quite elevated during the past day &#124; Source: CryptoQuant The above graph shows that the Bitcoin miner netflow has observed a pretty large positive spike during the last day or so. With this sharp rise in the indicator, the miners have received 7,000 BTC in their wallets. Related Reading: Bitcoin Rally Hopes Still Alive, If This Metric Is To Go By This is quite an extraordinary amount, as no other spike has come close during the last one and a half years. Naturally, if these net inflows indicate that the miners have been buying, the cryptocurrency could feel a bullish boost. In January, for example, the miners participated in some possible buying, as the netflow registered a significant spike. Following these inflows, the price started its rally. The quant cautions, however, &#8220;It is important to note that having such a large influx of BTC into miners&#8217; wallets does not necessarily guarantee a bullish movement in the price of Bitcoin. Similar situations have occurred in the past where there were significant inflows into miners&#8217; wallets, but the price of Bitcoin subsequently declined.&#8221; The analyst also points out that 99% of these net flows seem to have involved just one mining pool in the sector: Poolin. The chart below shows the trend in the combined holdings of the miners in this pool. Looks like the metric has spiked recently &#124; Source: CryptoQuant Since the net Bitcoin inflows are mostly to the wallets of this mining pool, it&#8217;s unlikely that they represent the sentiment among the wider mining industry, regardless of whether they are a sign of buying or not. Related Reading: XRP Bullish Signal: Address Activity Spikes To Historical Levels From the chart, it&#8217;s visible that last month, following the local top in the asset&#8217;s price, Poolin appears to have sold many coins. These latest inflows seem to have merely taken their holdings back to levels close to those from before this selling. BTC Price At the time of writing, Bitcoin is trading around $27,800, up 2% in the last week. The asset has surged during the past couple of days &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T16:36:03.000Z",
    "title": "Cardano-Based SNEK Achieves Historical Milestone and Sets New All-Time High (ATH): Is It Still a Lucrative Investment Opportunity? Report",
    "url": "https://www.crypto-news-flash.com/cardano-based-snek-achieves-historical-milestone-and-sets-new-all-time-high-ath-is-it-still-a-lucrative-investment-opportunity-report/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-based-snek-achieves-historical-milestone-and-sets-new-all-time-high-ath-is-it-still-a-lucrative-investment-opportunity-report",
    "description": "<p>MinSwap DEX is currently the largest liquidity provider for SNEK tokens, with SNEK/ADA trading pair reporting a 24-hour trading volume of about $8.7 million. Already, about 4.3 million SNEK tokens have been burnt, with a listing on MEXC Global scheduled on May 31. The meteoric growth of meme coins led by Pepe (PEPE) in the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cardano-based-snek-achieves-historical-milestone-and-sets-new-all-time-high-ath-is-it-still-a-lucrative-investment-opportunity-report/\">Cardano-Based SNEK Achieves Historical Milestone and Sets New All-Time High (ATH): Is It Still a Lucrative Investment Opportunity? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]