[
  {
    "source": "CryptoSlate",
    "date": "2023-12-06T17:40:28.000Z",
    "title": "Binance announces compensation for users who bought AEUR at inflated prices",
    "url": "https://cryptoslate.com/binance-announces-compensation-for-users-who-bought-aeur-at-inflated-prices/",
    "description": "<p>Cryptocurrency exchange Binance said it would compensate users impacted by a recent deviation in the price of Anchored Coins EUR (AEUR) stablecoin. On Dec. 5, AEUR&#8217;s value surged nearly 200% to more than $3 after the cryptocurrency platform listed it. The exchange promptly suspended trading for the asset&#8217;s four trading pairs, including the AEUR/USDT, BTC/AEUR, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binance-announces-compensation-for-users-who-bought-aeur-at-inflated-prices/\">Binance announces compensation for users who bought AEUR at inflated prices</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T17:59:37.000Z",
    "title": "Grayscale AI Joins NATO’s DIANA Acceleration Programme: A Pioneering Step in AI Advancements",
    "url": "https://www.cryptopolitan.com/grayscale-ai-joins-natos-diana-acceleration/",
    "description": "Grayscale AI, a UK-based technology company founded by Romanian entrepreneur Dragos Stanciu in 2020, has achieved a significant milestone by gaining acceptance into the Defence Innovation Accelerator for the North Atlantic (DIANA) Acceleration Programme, sponsored by NATO. This recognition places Grayscale AI among a select group of forward-thinking startups dedicated to advancing cutting-edge technology solutions ... <a title=\"Grayscale AI Joins NATO&#8217;s DIANA Acceleration Programme: A Pioneering Step in AI Advancements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-ai-joins-natos-diana-acceleration/\" aria-label=\"More on Grayscale AI Joins NATO&#8217;s DIANA Acceleration Programme: A Pioneering Step in AI Advancements\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T17:46:13.000Z",
    "title": "Cyber AI Summit: Showcasing Cutting-Edge Developments in Security Tech",
    "url": "https://www.cryptopolitan.com/cyber-ai-summit-shows-security-tech/",
    "description": "SecurityWeek&#8217;s 2023 Cyber AI &#38; Automation Summit is set to kick off today as a fully immersive virtual conference, bringing together leading technologists to explore the dynamic landscape of AI-powered security. The event aims to shed light on the transformative potential of AI in addressing security challenges, with a focus on diverse topics ranging from ... <a title=\"Cyber AI Summit: Showcasing Cutting-Edge Developments in Security Tech\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cyber-ai-summit-shows-security-tech/\" aria-label=\"More on Cyber AI Summit: Showcasing Cutting-Edge Developments in Security Tech\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-06T17:41:53.000Z",
    "title": "BakerySwap’s launchpad announcement sends token soaring",
    "url": "https://crypto.news/bakeryswaps-launchpad-announcement-sends-token-soaring/",
    "description": "A Dec. 6 post from Lookonchain, a leader in cryptocurrency price updates, highlights that BAKE, a part of the BakerySwap ecosystem and a decentralized automated market-making (AMM) protocol, had increased 100%."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T18:00:03.000Z",
    "title": "Former FTX US President Says Bitcoin Spot ETF Will Come In 2024, Gives Price Targets",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-price-targets/",
    "description": "Former FTX US President Brett Harrison recently had an interview with Cointelegraph Magazine. As part of the discussion, Harrison gave his thoughts on when a Spot Bitcoin ETF will be approved and the possible price level the foremost crypto token could attain when this happens.  A Spot Bitcoin ETF Could Be Approved In Q1 of 2024 Harrison is said to have mentioned that there is a very “high probability” that the Securities and Exchange Commission (SEC) will approve a Spot BTC ETF in the first quarter of 2024. His prediction happens to be in line with the fact that the SEC has to make a decision on ARK 21Shares Spot Bitcoin ETF on or before January 10, 2024. Related Reading: Crypto Expert Delivers Top 8 Altcoins To Buy On Binance As such, there is indeed a high likelihood that a Spot Bitcoin ETF could be approved in Q1 of 2024 (and as early as January). Bloomberg analysts James Seyffart and Eric Balchunas had also earlier mentioned that there is a 90% chance that approval will come by the January 10 deadline.  Meanwhile, there is a growing belief that we might have more than one Spot Bitcoin ETF application approved by January 10. Seyyfart had, after the Templeton and Hashdex delay, reasoned that the SEC could be lining up all ETFs for a “full wave of approvals.”  Bitcoin’s Potential Price When This Happens Harrison also gave his thoughts on what price level Bitcoin could hit when a Spot Bitcoin ETF is approved. The former FTX US President seemed to have been conservative with his price prediction as he put BTC&#8217;s potential price between $50,000 and $55,000. He doesn’t foresee the foremost crypto token hitting six figures towards the end of 2024 or early 2025.  Related Reading: Shiba Inu Open Interest Falls Behind General Crypto Market, What This Means For Price His prediction about when Bitcoin could hit six figures coincides with Matrixport’s prediction of $125,000. The crypto financial services firm predicts that BTC will hit this price level by the end of 2024. Harrison’s prediction of the BTC price rising to as high as $55,000 on the back of approval seems plausible when looking at Matrixport’s projection of BTC hitting $63,140 by April 2024. Harrison is undoubtedly bullish about a Spot Bitcoin ETF and the success such an investment vehicle can enjoy. He alluded to the first day of a Bitcoin Futures ETF launching to back up his optimism. The ProShares Bitcoin Strategy (BITO) ETF (the first Bitcoin futures ETF) is reported to have seen more than $1 billion in its first two days after launch.  BITO became the fastest ETF ever to hit that figure. However, Harrison believes that a Spot Bitcoin ETF could go on to break more records.  Featured image from The Motley Fool, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-06T18:05:49.000Z",
    "title": "MicroStrategy Now Holds 174,530 Bitcoin (BTC) Following November Accumulation; Toncoin Continues Consolidation; InQubeta Gears Up for December Surge",
    "url": "https://www.crypto-news-flash.com/microstrategy-now-holds-174530-bitcoin-btc-following-november-accumulation-toncoin-continues-consolidation-inqubeta-gears-up-for-december-surge/?utm_source=rss&utm_medium=rss&utm_campaign=microstrategy-now-holds-174530-bitcoin-btc-following-november-accumulation-toncoin-continues-consolidation-inqubeta-gears-up-for-december-surge",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-41.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-41.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-41-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-41-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />MicroStrategy’s large Bitcoin (BTC) holdings are currently the subject of discussion. Following the purchase of an additional 16,130 BTCs last month, the firm’s total holdings stand at 174,530 Bitcoins, valued at about $7 billion. Meanwhile, Toncoin (TON) has been in a consolidation phase but appears to be gearing up for a significant rally. Another exciting [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-06T17:55:24.000Z",
    "title": "Tether Allocating Part of Its Profits To Buy Bitcoin, Currently Holds $2,400,000,000 in BTC: Report",
    "url": "https://dailyhodl.com/2023/12/06/tether-allocating-part-of-its-profits-to-buy-bitcoin-currently-holds-2400000000-in-btc-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/tether-part-profits-buy.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top stablecoin issuer Tether now reportedly holds $2.4 billion worth of Bitcoin and has made more than $1 billion worth of profit off its BTC investments. Pseudonymous on-chain analyst EmberCN tells their 64,000 followers on the social media platform X that Tether currently holds a total of 57,576 BTC purchased at an average cost of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/06/tether-allocating-part-of-its-profits-to-buy-bitcoin-currently-holds-2400000000-in-btc-report/\">Tether Allocating Part of Its Profits To Buy Bitcoin, Currently Holds $2,400,000,000 in BTC: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]