[
  {
    "source": "CryptoSlate",
    "date": "2023-11-11T15:00:12.000Z",
    "title": "From the Ground Up: Developer Empowerment for a Sustainable Future",
    "url": "https://cryptoslate.com/from-the-ground-up-developer-empowerment-for-a-sustainable-future/",
    "description": "<p>The following is a guest post from Sunny Lu, the CEO of Vechain. Web3 builders are the beating heart of the blockchain industry. Without them, this technology wouldn’t be the disruptive technical engine that it is in 2023. However, while there are more monthly active developers today than there were before 2021, we saw a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/from-the-ground-up-developer-empowerment-for-a-sustainable-future/\">From the Ground Up: Developer Empowerment for a Sustainable Future</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-11T15:00:49.000Z",
    "title": "Kaspa Rules The Weekend Top 100 Coin Roster With 63% Rally – Details",
    "url": "https://www.newsbtc.com/news/kaspa-rules-the-weekend-top-100-coin-roster-with-63-rally-details/",
    "description": "Kaspa (KAS) has emerged as a notable altcoin, drawing considerable interest from investors. Notably, the cryptocurrency has achieved its all-time high, experiencing an impressive 66% increase over the previous week. Examining the monthly performance charts reveals an even more substantial upward trajectory, with KAS exhibiting a remarkable surge of over 90%. Zooming out to a year-long perspective, the altcoin has witnessed an astonishing increase of over 2,000%, showcasing its significant growth over this extended period. Investors are closely monitoring Kaspa as it continues to showcase strong bullish momentum, reflecting the cryptocurrency market&#8217;s dynamic nature. The rapid and substantial increases in both short-term and long-term intervals underscore the token&#8217;s potential for high returns. Kaspa Shows Mettle, Pulls Off Its Own Rally With Bitcoin surpassing the $36,800 threshold and Ethereum exceeding $2,000, the native token of Kaspa pulled off its own ascent, rising from approximately $0.070986 to reach an unprecedented peak of $0.092917. Based on the aforementioned data, it can be observed that Kaspa is one of the limited number of tokens now experiencing their highest recorded values. Many cryptocurrencies registered a significant decline from their historical peak values following the occurrence of a market downturn commonly referred to as the &#8220;crypto winter.&#8221; This period witnessed the collapse of prominent crypto entities such as Terra Luna and FTX crypto exchange. Based on the data provided by CoinMarketCap, it can be observed that the trading volume of Kaspa&#8217;s (KAS) has experienced a significant surge of more than 95%. Source: CoinMarketCap Additionally, the market capitalization of KAS has exhibited a notable gain of nearly 20%. Furthermore, there has been a significant increase in trading volume, with a jump of around 380% compared to the preceding week. The current market capitalization of the project stands just above $1.8 billion. Related Reading: Solana Breaks Past $54 On Steady Price Momentum – Will SOL Hit $60 This Month? This increase in value positions Kaspa as a compelling investment option, capturing the attention of those seeking opportunities in the ever-evolving landscape of digital assets. As the altcoin landscape continues to evolve, Kaspa&#8217;s impressive performance highlights its resilience and appeal, making it a noteworthy player in the cryptocurrency market. KASUSDT trading at $0.089 on the weekend chart: TradingView.com The inclusion of Kaspa on Coinone&#8217;s platform is its initial foray into the cryptocurrency market in South Korea, granting it significant visibility among a group of investors who are very interested in blockchain initiatives and digital assets. The unique GHOSTDAG protocol, authored by Kaspa, garnered the interest of Korean traders. Related Reading: Polygon (MATIC) Poised For A Bullish Surge, Analyst Who Predicted 2021 Fall Says Kaspa Makes Foray Into South Korea The latest indication of Kaspa&#8217;s growing popularity among cryptocurrency traders and investors is its successful entry into the South Korean market. As Kaspa develops and realizes its lofty vision of scalability, security, and practical application, it appears ready for more expansion. Source: CoinMarketCap KAS&#8217;s future trajectory remains uncertain, with the potential for further rally or a correction. Reaching $1 would signify a remarkable 1062% growth, though it seems unlikely currently. The possibility of a correction looms, despite community members maintaining a target of at least $0.10. The recent surge in Bitcoin (BTC) to a yearly high of over $36k may have influenced KAS&#8217;s all-time high, suggesting that KAS and other altcoins could follow BTC&#8217;s lead if it continues to rally. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Coingecko"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-11T14:44:34.000Z",
    "title": "Ethereum Fees Soar to Yearly Highs Following BlackRock’s ETH ETF Filing",
    "url": "https://www.crypto-news-flash.com/ethereum-fees-soar-to-yearly-highs-following-blackrocks-eth-etf-filing/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-fees-soar-to-yearly-highs-following-blackrocks-eth-etf-filing",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-38.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-38.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-38-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-38-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum fees skyrocketed to 270 gwei, driving transaction costs up to $100 following BlackRock&#8217;s ETH ETF filing. Despite the fee surge, on-chain activity remained subdued, indicating a disconnect between market sentiment and actual blockchain usage. A Sharp Increase in Ethereum Transaction Fees The Ethereum network recently experienced a significant spike in transaction fees, attributed to [...]"
  }
]