[
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T18:17:47.000Z",
    "title": "Why is XRP price up today?",
    "url": "https://cointelegraph.com/news/why-is-xrp-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-03/27adace7-91b4-4f1e-a47f-00f5c1e7cf7c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>XRP's daily active address count has soared to its second-highest level in May, raising traders' anticipation for a price rally.</p>\n                    <p><p>The price of XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) rose 6% to $0.51 on May 30 as the market's attention turned toward the latest spike in XRP network activity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/049e21f5-4260-400e-b449-3fb3113b6459.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD hourly price chart. Source: TradingView</em></figcaption></figure><h2>XRP's daily active addresses count near record high</h2><p>The XRP network witnessed a sudden increase in the <a href=\"https://cointelegraph.com/news/experts-yet-to-explain-massive-spike-in-eth-active-addresses\">daily active addresses</a> (DAA) — the number of unique addresses involved in XRP transactions daily.</p><p>For instance, on May 27, around 490,000 addresses interacted with the XRP network. That amounted to the second-largest address activity on the XRP blockchain, just three months after establishing the record DAA count of 880,000, according to data resource Santiment.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/2724f6f1-fdd1-4076-b24b-32869c82a815.png\"  /><figcaption style=\"text-align: center;\"><em>XRP DAA vs. daily price chart. Source: Santiment</em></figcaption></figure><p>Interestingly, the DAA surge to a record high in March preceded a <a href=\"https://cointelegraph.com/news/xrp-price-eyes-30-upside-after-key-resistance-area-breaks\">45% price rally</a>. This fractal may have prompted traders to speculate on a similar upside move after the latest DAA count rise.</p><p>This is primarily because of how the market interprets the DAA indicator. It considers a rise in active addresses as bullish for the concerned token. Conversely, a drop in active addresses is considered bearish.</p><p>Nonetheless, history presents the DAA indicator as a flawed one. For instance, the spikes in XRP's DAA count between November 2021 and April 2022 coincides with the token's price decline, as shown in the chart below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/baea7749-f874-487c-ac2b-6c234a8f33e7.png\"  /><figcaption style=\"text-align: center;\"><em>XRP DAA count throughout history. Source: Santiment</em></figcaption></figure><p>As a result, XRP remains at risk of declining, primarily because of an <a href=\"https://cointelegraph.com/news/how-do-the-fed-s-interest-rates-impact-the-crypto-market\">uncertain macroeconomic outlook</a> that could hurt the crypto sector broadly.</p><h2>XRP eyes a 20% decline in June</h2><p>From a technical standpoint, XRP could drop in the coming weeks as the token retests its multi-month horizontal trendline resistance for a potential pullback.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/cbb951fa-bf53-47e5-8f8a-d369b5e343a2.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>If a retreat occurs, XRP price may aim for its multi-month ascending trendline support as its primary downside target. That could theoretically take the price to around $0.40, down 20% from current price levels.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-reclaims-28k-and-charts-suggest-arb-xrp-eos-and-aave-could-follow\">Bitcoin reclaims $28K, and charts suggest ARB, XRP, EOS and AAVE could follow</a></em></strong></p><p>Conversely, a breakout above the horizontal trendline resistance could trigger an ascending triangle reversal breakout, pushing XRP price toward $1, as illustrated below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/ceb1a622-c2c1-40e6-b8f8-e5398e3670e0.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>A potential <a href=\"https://cointelegraph.com/news/xrp-price-rally-stalls-as-sec-vs-ripple-ruling-drags-on-25-drop-ahead\">Ripple win</a> in the ongoing lawsuit against the U.S. Securities and Exchange Commission (SEC may prompt such a breakout move.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T18:28:48.000Z",
    "title": "Laos pushes for digital transformation in its blockchain conference",
    "url": "https://www.cryptopolitan.com/laos-digital-transformation-in-it-conference/",
    "description": "Laos, a Southeast Asian nation, recently made strides in embracing digital technology and blockchain. In a significant move, the Laotian government organized its inaugural Ministerial Conference on Blockchain 4.0 Digital Transformation in the capital city, Vientiane, on May 26. Led by Prime Minister Sonexay Siphandone, the conference brought together blockchain experts and leaders from key ... <a title=\"Laos pushes for digital transformation in its blockchain conference\" class=\"read-more\" href=\"https://www.cryptopolitan.com/laos-digital-transformation-in-it-conference/\" aria-label=\"More on Laos pushes for digital transformation in its blockchain conference\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T18:36:37.000Z",
    "title": "TON Foundation introduces new liquidity mining rewards program",
    "url": "https://crypto.news/ton-foundation-introduces-new-liquidity-mining-rewards-program/",
    "description": "The TON Foundation, a non-profit association dedicated to advancing The Open Network (TON), has unveiled a liquidity mining rewards campaign designed to incentivize users from other chains to join the TON ecosystem. "
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T18:17:25.000Z",
    "title": "BRC-721E new standard for NFT migration from ETH to BTC",
    "url": "https://crypto.news/brc-721e-new-standard-for-nft-migration-from-eth-to-btc/",
    "description": "A new token standard, BRC-721E, has been introduced, designed to facilitate the migration of NFTs from Ethereum to Bitcoin."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T18:30:13.000Z",
    "title": "Can This THORChain New Feature Push Back RUNE Bears?",
    "url": "https://www.newsbtc.com/news/can-this-thorchain-new-feature-push-back-rune-bears/",
    "description": "THORChain, a decentralized exchange and one of the liquid decentralized finance protocols by total value locked, plans to release “Lending” in 2023.  It is a feature THORChain says will complete their THORFi ecosystem. However, amid this development and community anticipation, RUNE remains under pressure, slipping 32% from April 2023 highs as of writing on May 30. THORChain Lending According to THORChain, Lending will function similarly to other decentralized money markets, including one of the earliest, MakerDAO, which operates on Ethereum.  With THORChain Lending, not only can the borrow deposit collateral, a token or coin already integrated by the platform, but also take loans with zero interest, liquidation, and expiry.  Related Reading: Downside Threat: These Two Crypto At Risk Of Crash Due To Unlocks This arrangement means a borrower would effectively hold a loan without the risk of liquidation, irrespective of the collateral’s volatility. Moreover, THORChain says a user can be short the USD while being long on crypto assets such as Bitcoin and others. Their feature will depart from how other competing decentralized money markets operate. Most require over-collateralization, considering the volatile nature of cryptocurrencies. Borrowers will deposit collateral and create debt at a collateralization ratio (CR) set by the market. A distinction in ThorChain Lending, the protocol clarifies, is that debt will be denominated in TOR. TOR is a stablecoin that tracks the value of USD, irrespective of the collateral used, and will be non-transferable.  There will be limits on collateral and risks contained by, among other factors, “slip-based fees when opening and closing loans, dynamic CR, and a circuit breaker on RUNE supply.” Loan repayment, THORChain adds, can be done at any time and in any supported asset. All repayments will be converted to TOR. Impact On RUNE RUNE serves as the utility token of the THORChain ecosystem. Using the token, users can pay for gas and use it to secure the network. RUNE plays a role in ensuring the platform is decentralized and resistant to attacks from malicious agents.  With THORChain Lending, every new loan is expected to create a deflationary effect on RUNE. However, repaying the loan creates an inflationary impact.  Related Reading: NFT Market Update: Major Collections Suffer Price Slump in 2023 If by the time the loan is created and closed, the price of the collateral has not moved relative to the RUNE price; there will be zero effect.  However, there will be an inflationary effect if the collateral price increases versus RUNE during this time, which could negatively impact the token price if many positions are opened that meet these criteria.  Ahead of this launch, RUNE prices remain flat in the last week of trading. However, it is up 7% from May 2023 lows. As of late May 2023, DeFi activity is yet to recover. According to DeFiLlama data, TVL has stagnated below $50 billion in the last five months. During this time, Uniswap, a popular multi-chain DEX, and Curve, a stablecoin DEX, have dominated activity. THORChain has a TVL of $106 million, with most liquidity from tokenized Bitcoin. Feature Image From Canva, Chart From TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T18:21:29.000Z",
    "title": "What Do IOTA and Tesla Have in Common? Conquering the Innovative and Rapidly Growing IoT Billion-Dollar Market with Diverse Use Case",
    "url": "https://www.crypto-news-flash.com/what-do-iota-and-tesla-have-in-common-conquering-the-innovative-and-rapidly-growing-iot-billion-dollar-market-with-diverse-use-case/?utm_source=rss&utm_medium=rss&utm_campaign=what-do-iota-and-tesla-have-in-common-conquering-the-innovative-and-rapidly-growing-iot-billion-dollar-market-with-diverse-use-case",
    "description": "<p>IOTA, a distributed ledger technology designed for IoT, offers benefits like free transactions, scalability, high security, and decentralization, making it ideal for micropayments and various applications. IOTA&#8217;s Tangle technology is expected to play a significant role in the future of mobility, enabling self-driving vehicles to transfer and communicate data seamlessly. In addition to pioneering the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/what-do-iota-and-tesla-have-in-common-conquering-the-innovative-and-rapidly-growing-iot-billion-dollar-market-with-diverse-use-case/\">What Do IOTA and Tesla Have in Common? Conquering the Innovative and Rapidly Growing IoT Billion-Dollar Market with Diverse Use Case</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]