[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-01T06:00:19.000Z",
    "title": "Blockfi Bankruptcy Plan Confirmed, Paving Way for Client Distributions ",
    "url": "https://news.bitcoin.com/blockfi-bankruptcy-plan-confirmed-paving-way-for-client-distributions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blockfi Bankruptcy Plan Confirmed, Paving Way for Client Distributions \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bfi.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto lender Blockfi is moving closer to returning funds to clients after a bankruptcy judge confirmed its Chapter 11 plan on Tuesday. The plan outlines a process for the company to distribute the remaining assets to clients and attempt to recover additional funds. Blockfi Advances on Client Asset Reimbursement Following Chapter 11 Plan Approval With [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-01T06:07:49.000Z",
    "title": "Bitcoin Cash Bulls Charge: 13% Price Rally Driven By Fresh Demand",
    "url": "https://www.newsbtc.com/news/bitcoin-cash-bulls-charge-13-price-rally-driven-by-fresh-demand/",
    "description": "The price of Bitcoin Cash has experienced significant rise over the course of the last 30 days, resulting in favorable returns for investors. Since July, BCH holders have continuously maintained a positive perspective, which has reduced the frequency of selling activity. This collective sentiment has played a significant role in the upward trajectory of BCH, consequently yielding favorable outcomes for these holders. The price of BCH has increased by about 13% over the previous week, giving it some of the biggest gains in the last seven days for cryptocurrency assets. According to CoinMarketCap data, the altcoin was trading at $234.78 at the time of publication. The value of the world&#8217;s cryptocurrency market dropped to $1.06 trillion at the time of writing, a 0.1% decrease in a day. On Thursday, ETH increased by about 0.8% to $1,629, while Bitcoin (BTC) rose slightly above the $27K level. Can Bitcoin Cash Reach New ATH This Year? BCH is anticipated to undergo a trial of the support line at a value of $229, after which a subsequent rebound is projected. The breach of the current barrier at $253 is crucial for the potential rise of the altcoin. If this level is surpassed, it might pave the way for the altcoin to achieve new 2023 highs, beyond the $300 mark. BCH market cap currently at $4.6 billion on the weekend chart: TradingView.com Bitcoin Cash has increased by a remarkable 90% in the last six months, demonstrating strong performance. Furthermore, the price of BCH has been up significantly by 136% so far this year, maintaining a favorable return. Related Reading: Maker (MKR) Inks 20% Price Advance, Leads Top 50 Coins Today Santiment research indicates that whales in the cryptocurrency space have increased their holdings in Bitcoin Cash significantly. Collectively, bitcoin whales with holdings ranging from 100,000 to 10 million BCH held 3.74 million BCH as of September 18, 2023. Source: Santiment Long-Term Holder Addresses Up But on September 26, their holdings had increased to 3.86 million BCH, showing a noteworthy acquisition of 120,000 BCH in just one week. Their balances are now comparable to what they were in July 2023 thanks to this accumulation, and the 120,000 BCH that the Bitcoin Cash whales purchased are worth about $25.6 million at the current market price of $213 per BCH. Related Reading: CRV Price Surges 16% – What’s The Next Move For Curve DAO Token? Meanwhile, the increase in long-term holders of Bitcoin Cash indicates a positive outlook for the cryptocurrency&#8217;s sustainability. These committed investors, who believe in BCH&#8217;s long-term potential, contribute to a stable user base and network demand. This support from long-term holders, combined with whale accumulation, could help BCH reach or exceed $300 in the future (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-01T06:00:47.000Z",
    "title": "Circle’s Argument in Binance’s SEC Case Highlights Stablecoins’ Distinctive Nature",
    "url": "https://www.crypto-news-flash.com/circles-argument-in-binances-sec-case-highlights-stablecoins-distinctive-nature/?utm_source=rss&utm_medium=rss&utm_campaign=circles-argument-in-binances-sec-case-highlights-stablecoins-distinctive-nature",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance.US\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The unfolding SEC case against Binance sees Circle making a case for stablecoins’ exemption from financial trading laws. Circle&#8217;s stance highlights the foundational logic behind stablecoins, potentially setting a significant precedent in crypto regulation. As the legal skirmish between Binance and the Securities and Exchange Commission (SEC) continues to unfold, stablecoin issuer Circle has stepped [...]"
  }
]