[
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T04:47:28.000Z",
    "title": "SBF upset by criminal trial's late evidence while FTX seeks sale of AI stock",
    "url": "https://cointelegraph.com/news/sbf-upset-by-late-evidence-in-trail-ftx-seeks-ai-stock-sale",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b8668796-25a1-40b4-9eab-577acbde4e6d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>3.6 million documents have yet to be produced by prosecutors in the criminal trial of Sam Bankman-Fried according to his lawyers.</p>\n                    <p><p>Former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> claims prosecutors have missed discovery deadlines for key pieces of evidence required in the defense of a raft of fraud charges.</p><p>On June 5, Bankman-Fried’s lawyers told United States District Judge Lewis A. Kaplan in a <a href=\"https://www.courtlistener.com/docket/66631291/153/united-states-v-bankman-fried/\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> that the government had not turned over all of the contents of five electronic devices that were due for discovery by the end of March.</p><p>A laptop and iPhone belonging to former Alameda Research CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Caroline Ellison</a> and a laptop belonging to FTX co-founder Gary Wang were among the devices.</p><p>According to the letter from Bankman-Fried’s attorneys:</p><blockquote>“As the trial date is now less than four months away, the defense is concerned that the late production of such voluminous and important discovery will impact the preparation of the defense.”</blockquote><p>Bankman-Fried is due to <a href=\"https://cointelegraph.com/news/ftx-fallout-sbf-trial-could-set-precedent-for-the-crypto-industry\">face court</a> on Oct. 2 on a <a href=\"https://cointelegraph.com/news/sam-bankman-fried-charged-with-bribing-chinese-officials-court-docs\">litany of fraud charges</a>, claims of illegal political donations, and bribes to the Chinese government. He does not want to adjourn the trial date and additional motions may be filed “if the newly produced discovery provides grounds for new motions,” according to the letter.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d42c545f-2c1c-4939-a6f8-f0b7fb457941.jpg\"  /><figcaption style=\"text-align: center;\"><em>Excerpt from the letter from Bankman-Fried’s lawyers. Source: CourtListener</em></figcaption></figure><p>The letter went on to state that the government has also failed to produce information related to FTX debtors. “These late productions have a cumulative effect on the defense’s ability to properly prepare for trial,” it said, before revealing how much is missing:</p><blockquote>“The five productions thus far are voluminous, totaling over 3.6 million documents and over 10 million pages.”</blockquote><p>The first four productions included around 1.1 million documents and the last one, received by the defense on May 25, includes just fewer than 2.5 million documents “which more than triples the documents in the existing discovery.”</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/ftx-leadership-sues-sam-bankman-fried-over-deal-made-prior-to-bankruptcy\"><strong><em> </em></strong><strong><em>FTX leadership sues Sam Bankman-Fried over $220M deal made prior to bankruptcy</em></strong></a></p><p>Meanwhile, FTX bankers tasked with bailing out the embattled company are reportedly looking towards cashing out shares in a company that's part of the currently hyped artificial intelligence sector.</p><p>On June 6, Semafor <a href=\"https://www.semafor.com/article/06/06/2023/ftxs-big-ai-bet-could-help-bail-out-customers\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Perella Weinberg, the investment banking firm on retainer to the bankrupt exchange, has been “teasing the sale of hundreds of millions of dollars of shares” in AI startup Anthropic to potential investors.</p><p>According to FTX balance sheets at the time of its bankruptcy in November 2022, the company<a href=\"https://cointelegraph.com/news/google-invests-300m-in-ai-firm-previously-funded-by-sam-bankman-fried\"> held $500 million</a> worth of Anthropic stock which is estimated to be worth much more now the AI boom is in full swing.</p><p>Anthropic<a href=\"https://cointelegraph.com/news/ai-developer-anthropic-raises-450m\"> raised $450 million</a> in its latest Series C funding round on May 23, with a reported valuation of $4.6 billion.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T04:50:44.000Z",
    "title": "Crypto Shakeup: Jim Cramer’s Warning Spurs Binance Exodus, Yet Bitcoin Defies Odds",
    "url": "https://www.cryptopolitan.com/jim-cramers-warning-spurs-binance-exodus/",
    "description": "The cryptocurrency world has been rocked by recent developments as the U.S. Securities and Exchange Commission (SEC) files charges against two major players in the industry. Binance, one of the leading cryptocurrency exchanges, and Coinbase, a prominent platform, now find themselves in the crosshairs of the SEC&#8217;s regulatory actions. The charges allege deceptive practices, conflicts ... <a title=\"Crypto Shakeup: Jim Cramer&#8217;s Warning Spurs Binance Exodus, Yet Bitcoin Defies Odds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jim-cramers-warning-spurs-binance-exodus/\" aria-label=\"More on Crypto Shakeup: Jim Cramer&#8217;s Warning Spurs Binance Exodus, Yet Bitcoin Defies Odds\">Read more</a>"
  }
]