[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T14:00:00.000Z",
    "title": "Providing Regulatory Clarity (Binance and Coinbase Edition)",
    "url": "https://www.coindesk.com/policy/2023/06/08/providing-regulatory-clarity-binance-and-coinbase-edition/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC sued Binance and Coinbase this week, presenting the industry with both further analysis on why it thinks certain cryptocurrencies are securities and its biggest test to how cryptos may be regulated in the U.S. going forward."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-08T13:44:56.000Z",
    "title": "Are DAOs Doomed to ‘Decentralization Theater’?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/08/are-daos-doomed-to-decentralization-theater/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Consensus 2023 guests highlighted their concerns over 'decentralization theater' in DeFi projects, emphasizing the importance of genuine decentralization in the development of the Web3 ecosystem"
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-08T13:44:03.000Z",
    "title": "Cut the Jargon, Keep Your Promises: How Crypto Can Fix Its Image Problem",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/08/cut-the-jargon-keep-your-promises-how-crypto-can-fix-its-image-problem/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Consensus 2023 attendees argued that improving crypto's image requires a clearer explanation of digital assets and a focus on tangible, user-centric products and services"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T14:01:02.000Z",
    "title": "Lens Protocol Raises $15 Million to Expand Decentralized Social Media",
    "url": "https://decrypt.co/143789/lens-protocol-raises-15-million-to-expand-decentralized-social-media",
    "description": "Part of the Aave open-source decentralized lending network, Lens encourages users to own their online presence via alternatives to platforms like Twitter."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T13:46:19.000Z",
    "title": "UK Authors' Union Issues Guidance to 'Protect' Writers’ Work From AI",
    "url": "https://decrypt.co/143809/uk-authors-union-issues-guidance-to-protect-writers-work-from-ai",
    "description": "The Society of Authors warned writers to be careful as “money today could simply speed up the absence of any work at all in the future.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T13:44:21.000Z",
    "title": "Binance Moved Billions Through US Bank Accounts Controlled by CZ, Says SEC",
    "url": "https://decrypt.co/143814/binance-moved-billions-through-us-bank-accounts-controlled-by-cz-sec",
    "description": "The filing claims Binance entities commingled funds and funneled them to a Paxos affiliate through Merit Peak, which was controlled by Changpeng Zhao."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T14:00:00.000Z",
    "title": "World Mobile eyes African rollout after decentralized wireless field tests",
    "url": "https://cointelegraph.com/news/world-mobile-eyes-african-rollout-after-decentralized-wireless-field-tests",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/39a7d2ea-9c5b-4145-94c4-a8c8712df48a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>World Mobile announces the completion of DeWi technology field tests in Kenya, Mozambique and Nigeria, bringing a full African rollout one step closer.</p>\n                    <p><p>Decentralized wireless (DeWi) network operator World Mobile said on June 8 it has completed field tests of its DeWi technology in Kenya, Mozambique, and Nigeria, bringing it closer to a full rollout across the African continent, the company said in the announcement.</p><p>World Mobile, which aims to offer affordable and reliable internet access to rural areas that are traditionally under-served, said the tests in Kenya and Mozambique were carried out using TV White Space equipment, employing unused spectrum in the TV broadcast band to provide mobile network services.</p><p>In Nigeria, the field test utilized SpaceX’s satellite internet system Starlink. According to the company, both TV White Space and Starlink are complementary technologies that enable World Mobile to employ existing infrastructure and spectrum resources to expand its network coverage.</p><p>World Mobile CEO Micky Watkins said the tests “validate the feasibility and scalability of our DeWi technology, bringing us one step closer to providing affordable and reliable internet access to both rural and under-served areas worldwide.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/polygon-labs-president-testifies-on-internet-democracy-with-web3-and-blockchains\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-labs-president-testifies-on-internet-democracy-with-web3-and-blockchains/amp\"><strong><em>Polygon Labs president testifies on democratizing the internet with Web3, blockchains</em></strong></a><strong><em><u> </u></em></strong></p><p>This announcement follows World Mobile’s launch of its commercial network in Zanzibar in May, where it says over 300 AirNodes provide wireless connectivity to more than 16,000 users a day. </p><p>The company plans to extend its network to more countries in Africa and beyond and seeks to create “ a global community-owned wireless network that can bridge the digital divide and foster social and economic inclusion,” it said.</p><p>World Mobile says its DeWi solution provides connectivity at a lower cost than traditional mobile network operators and could help create ‘“a sharing economy” to finance the expansion of telecommunications infrastructure in rural Africa and beyond. </p><p>Unlike traditional mobile networks, World Mobile is built on blockchain and seeks to encourage people to participate in what it calls “a sharing economy” by giving people access to the trillion-dollar global telecom market.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T14:00:00.000Z",
    "title": "UK’s FCA Releases New Crypto Marketing Rules",
    "url": "https://cryptodaily.co.uk/2023/06/uks-fca-releases-new-crypto-marketing-rules",
    "description": "<p>The UK&rsquo;s Financial Conduct Authority released a new set of crypto marketing rules to take effect on October 8. </p>\n<p>On Thursday, the UK&rsquo;s Financial Conduct Authority (FCA) unveiled stricter marketing rules. The new guidelines, set to come into force on October 8, introduces a &ldquo;cooling-off&rdquo; period for crypto buyers and scraps &ldquo;refer a friend&rdquo; bonuses.</p>\n<p>The regulator said in a press release:</p>\n\n<p>The new rules mean crypto firms must ensure that people have the appropriate knowledge and experience to invest in crypto.</p>\n\nIncentive Bonuses Scrapped\n<p>The UK&rsquo;s financial watchdog is taking a closer look at its crypto marketing rules introducing a more comprehensive guideline to protect investors.</p>\n<p>In a bid to discourage impulsive crypto purchases, the FCA&rsquo;s new rules require first-time crypto investors to wait out a 24-hour &ldquo;cooling-off&rdquo; period after registering trading accounts.</p>\n<p>Sheldon Mills, Executive Director of the FCA&rsquo;s Consumers and Competition Division, said:</p>\n\n<p>It is up to people to decide whether they buy crypto. But research shows many regret making a hasty decision.</p>\n<p>Consumers should still be aware that crypto remains largely unregulated and high risk.</p>\n\n<p>The regulator further said that &ldquo;refer a friend&rdquo; incentive bonuses for crypto buyers would be done away with. It added institutions promoting crypto assets would have to introduce clear risk warnings and ensure that advertisements are transparent, fair, and not misleading.</p>\n<p>The agency said crypto firms would have to carry warnings stating, for instance:</p>\n\n<p>Don&rsquo;t invest unless you&rsquo;re prepared to lose all the money you invest. This is a high-risk investment and you should not expect to be protected if something goes wrong.</p>\n\nUK Looks To Regulate Crypto Sector\n<p>Regulators worldwide are working relentlessly to introduce frameworks to govern the crypto sector to mitigate the risk to investors and economic stability. The European Union (EU) has taken charge in this respect with its landmark Markets in Crypto Asset (MiCA) regulation. The bill underwent its last vote late in May and is set to take effect in phases in 2024. &nbsp;</p>\n<p>The UK Treasury Committee recently released a report compelling the government to regulate retail crypto trading not as financial assets but as gambling instruments. The committee argued that fraudsters and money launderers&rsquo; potential use of crypto threatens consumers and economic stability.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-08T14:00:56.000Z",
    "title": "Another Mysterious Signed Message Appears Associated With the 2009 Bitcoin Block 1,018",
    "url": "https://news.bitcoin.com/another-mysterious-signed-message-appears-associated-with-the-2009-bitcoin-block-1018/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/block-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/block.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This week, the number of Ordinal inscriptions has exceeded 11 million, with one inscription in particular, numbered 11,035,214, standing out. The inscription bears a message that has been signed with the private key associated with block 1,018, and while the key is quite old, having been linked to the computer scientist Hal Finney, this isn&#x2019;t [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T13:54:49.000Z",
    "title": "iFX EXPO Asia 2023 returns to Bangkok with only a few weeks to go until the event gets underway",
    "url": "https://www.cryptopolitan.com/ifx-expo-asia-2023-returns-to-bangkok-with-only-a-few-weeks-to-go-until-the-event-gets-underway/",
    "description": "Find out what to expect at the world’s largest B2B financial expo, which is heading back to Thailand for the second year running. The countdown is on for the latest edition of iFX EXPO, the largest B2B expo for the financial sector, which returns to Bangkok for the second time, following on from last year’s ... <a title=\"iFX EXPO Asia 2023 returns to Bangkok with only a few weeks to go until the event gets underway\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ifx-expo-asia-2023-returns-to-bangkok-with-only-a-few-weeks-to-go-until-the-event-gets-underway/\" aria-label=\"More on iFX EXPO Asia 2023 returns to Bangkok with only a few weeks to go until the event gets underway\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T14:00:46.000Z",
    "title": "Stacks (STX) Tallies Over 6% In Last Week, What’s Pushing It?",
    "url": "https://www.newsbtc.com/stacks/stacks-stx-tallies-over-6-in-last-week-whats-pushing-it/",
    "description": "Stacks, the layer-1 protocol that enables smart contracts on Bitcoin, have demonstrated incredible resilience amid bearish market trends. Stacks&#8217; STX token price has increased by over 6% over the past week and joined top-gaining coins today with a nearly 0.53% price gain, while the broader crypto market plunged by 1.63% in the last day. STX’s price moves have left investors wondering if it will soon conquer the $0.7 level, as its seven-day price range is between $0.532995 and $0.669564. Stacks (STX) Bucking Bearish Trends Amid Heightened Regulatory Uncertainty  According to CoinGecko data, STX rebounded yesterday from a two-day price decline after the total crypto market cap witnessed a 1.6% increase. The token saw a massive 11% price decline on Tuesday, June 6, before regaining momentum with an 8.9% price increase on June 7. Related Reading: Less Than 100 XRP Needed To Become A Millionaire? New Research Suggests As a DeFi-enabling protocol, Stacks (STX) is among the tokens prospering in the heat of the SEC’s lawsuit against Binance and Coinbase. After the US regulator pronounced several digital tokens, including SOL, ADA, BNB, MATIC, and ATOM, as securities, DeFi protocols witnessed increased trading volume. The same goes for STX, and according to CoinMarketCap data, STX saw a 0.65% increase in market cap over the past 24 hours. The crypto market cap turned red after news of the two lawsuits broke out in the crypto ecosystem. Although STX went with the flow, dropping 0.3% and 11% on June 5 and 6, it soon recovered momentum. The token&#8217;s timely recovery could be why it retained most of its 7-day and 14-day gains. Data shows that STX&#8217;s 14-day price increase is 11.9%, while Bitcoin only recorded a 0.5% increase in the last two weeks. STX Price Outlook Volatility is high across various assets in the crypto market, while sentiment is down as fear and uncertainty grip investors due to heightened enforcement actions. The Fear&#38; Greed Index has been neutral over the past month, but technical analysis suggests a bullish outlook for STX. At press time, STX price has exceeded the 10, 20, and 30-day Exponential and Simple Moving Averages, suggesting a strong buy signal. However, the momentum is a little bearish, as the token has to conquer the 50 and 100-day Simple Moving Averages to break above the $0.7 mark. Related Reading: Polkadot Metrics Surge With Project Launches – Good News For DOT Price? The bull Bear Power is currently neutral at 0.0655. Therefore, the bulls must overpower the bears before the STX price can rally with bullish momentum in the coming days. Also, STX is trading at $0.65, gearing up to touch $0.7. That could be possible if the bulls conquer the bears in the coming days. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T13:47:27.000Z",
    "title": "FUD Storm: Top 5 Market Losers In Heightened Uncertainty",
    "url": "https://www.newsbtc.com/news/sinking-amidst-fud-storm-unveiling-the-top-5-market-losers-in-heightened-uncertainty/",
    "description": "The market is currently experiencing a downturn fueled by an unsettling combination of FUD (fear, uncertainty, and doubt). Adding to this challenging situation is the recent lawsuit filed against Binance by the US Securities and Exchange Commission. In their legal action, the regulatory body has vividly portrayed Binance and Changpeng Zhao&#8217;s actions as part of &#8220;an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law&#8221;. As a consequence of this disheartening news, Binance&#8217;s netflow on the Ethereum blockchain has plummeted to a staggering negative $776.8 million. This event led to the crypto market dropping over 3% in the past 24 hours at the time of writing as significant cryptocurrencies slid, pulling the entire market downwards. Meanwhile, Bitcoin, for its part, continues to languish below the $27k region. Thus, these top five cryptocurrencies are a must-avoid for investors if they want to stay in the green this week.  Netflow to Binance over the past 24 hours is $778.6M negative on Ethereum &#8211; $871.7M in and $1.65B out Over the past hour, netflow on Ethereum continues to be negative at $35.7M on Ethereum &#8211; $14.8M in and $50.5M out Track it here https://t.co/nwTgpXWhZY and filter for &#8220;Binance&#8221; pic.twitter.com/jnNAN0QKVy — Nansen 🧭 (@nansen_ai) June 6, 2023 Top 5 Losing Cryptos Amid FUD Storm PEPE Once the bringer of significant gains to investors has now succumbed to the bearish forces of the market, according to Coingecko, the token is now down over 13% in the daily timeframe, following the market slippage that started this week.  The token’s current trajectory puts it on a path for more FUD for investors. At the moment, PEPE’s price oscillates above the $0.00000101 support range. With the bearish sentiment in the crypto market right now, it will take some time before bulls can knock a zero out of PEPE.  SAND Despite a strong advertising campaign ahead of Paris Hilton’s concert on the 7th of June, investors&#8217; and traders&#8217; confidence in SAND was shaken as major cryptocurrencies fell in price. Coingecko noted a 17% decrease in the past 24 hours, a sign that more pain in the short to medium term is at hand. ✨PARIS: LIVE IN CONCERT ✨ Owners of the 11 rarest 1/1 Avatars get a free ticket to @ParisHilton: Live in Concert on June 7th. This will be an unmissable evening with Paris + special guests at the Fonda Theatre in LA, featuring performances of her famous songs and brand new,… https://t.co/afDazic39p pic.twitter.com/MXNpF8RQID — The Sandbox (@TheSandboxGame) June 5, 2023 SAND is currently sitting above the $0.4976 support range. Investors and traders could expect the bears to break through this support level if the bearishness in the market continues. If this happens, a drop to $0.4368 will occur.  SUI Even as the news of the network’s partnership with Red Bull Racing hit the market, bears still found a way to crash the party. Recent market data shows that the SUI, the governance token of the network, is down 14% since Wednesday.  SUI has a newfound support range at $$0.7533. SUI bulls, however, should not expect much from this support level as it has no strength backing it. At the moment, investors and traders should monitor the market’s movement as the token has a significant correlation with Bitcoin.  Bitcoin sliding near the $25K region. BTCUSD Chart: TradingView.com Bearish Atmosphere Pervades CFX Bears brought havoc to CFX, continuing the bearish momentum after Conflux was affected by Multichain’s irregularities. As of writing, the CFX is down over 12% since yesterday, following the general market downturn.  At the moment, CFX bulls are trying to settle around the $0.2229 support level. If this support holds, we might be able to see a return towards $0.2354 in the long term. However, investors and traders should still be wary of short to medium term losses on the token.  AXS Despite the successful release of Axie Origins on the Apple Store last month, the market downturn and FUD dashed any hope of gains in the short term. Coingecko data reveals that the token is down nearly 12% since Wednesday.  After enjoying gains made after the release of Axie Origins, bears are now trying to break through the $6.6 support level. If they are successful, a drop to $5.86 in the near future is possible if the market continues to pull AXS downward.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) Featured image from Binansal"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T13:56:00.000Z",
    "title": "Binance.US, Coinbase Under Pressure to Relist XRP Following SEC Suit",
    "url": "https://coinedition.com/binance-us-coinbase-under-pressure-to-relist-xrp-following-sec-suit/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BinanceUS_and_Coinbase_Come_Under_Pressure_to_Relist_XRP_After_SEC-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BinanceUS_and_Coinbase_Come_Under_Pressure_to_Relist_XRP_After_SEC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BinanceUS_and_Coinbase_Come_Under_Pressure_to_Relist_XRP_After_SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BinanceUS_and_Coinbase_Come_Under_Pressure_to_Relist_XRP_After_SEC.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The recent lawsuits filed by the U.S. Securities and Exchange Commission (SEC) against Binance and Coinbase have sparked a renewed push for the relisting of XRP, with prominent figures and crypto influencers urging the exchanges to reconsider their delisting decisions. The call for relisting XRP gained traction when Coinbase CEO Brian Armstrong said the exchange [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-us-coinbase-under-pressure-to-relist-xrp-following-sec-suit/\">Binance.US, Coinbase Under Pressure to Relist XRP Following SEC Suit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]