[
  {
    "source": "CoinDesk",
    "date": "2023-11-09T14:00:00.000Z",
    "title": "Polygon Labs Commences $85M Grant Program to Draw Builders to Its Ecosystem",
    "url": "https://www.coindesk.com/business/2023/11/09/polygon-labs-commences-85m-grant-program-to-draw-builders-to-its-ecosystem/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Polygon Labs is offering a total of 110 million of its native token, MATIC, to projects in DeFi, gaming and social media, among others."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-09T13:59:30.000Z",
    "title": "Protocol Village: Interop Ventures Raises $3.85M for 'Interchain Economy'",
    "url": "https://www.coindesk.com/tech/2023/11/08/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 9-15, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-09T13:51:28.000Z",
    "title": "Business Sim Game Legacy Launches With Competitive Events on Gala Games",
    "url": "https://decrypt.co/204010/business-sim-game-legacy-launches-with-competitive-events-on-gala-games",
    "description": "Players can take part in events including design and sales competitions to win in-game Gems."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T14:01:00.000Z",
    "title": "Can crypto Privacy Pools help balance privacy and regulation? ",
    "url": "http://cointelegraph.com/news/crypto-privacy-pools-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/26c8a1e0-db30-481c-b272-44f979e4e30a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>When it comes to privacy and regulation, could Vitalik Buterin’s Privacy Pools be the answer? </p>\n                    <p><p>Ethereum co-founder Vitalik Buterin <a href=\"https://cointelegraph.com/news/vitalik-buterin-privacy-pool-interesting-but-just-the-start\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/vitalik-buterin-privacy-pool-interesting-but-just-the-start/amp\">recently authored a research paper</a>, the primary focus of which was integrating privacy features into blockchain transactions while ensuring compliance with a range of regulatory requirements.</p><p>Experts from various backgrounds collaborated on this research project, including early Tornado Cash contributor Ameen Soleimani, Chainalysis chief scientist Jacob Illum, and researchers from the University of Basel. </p><p>The diverse team reflects the interdisciplinary nature of the research, drawing insights from cryptocurrency, blockchain security and academic scholarship.</p><p>The paper suggests a protocol known as “Privacy Pools,” which can act as a regulation-compliant tool aimed at improving the confidentiality of user transactions.</p><h2>How do Privacy Pools work?</h2><p>Privacy Pools, as Buterin and the team explain in the research paper, aim to protect the privacy of transactions while separating criminal activities from lawful funds by organizing them into isolated sets or categories, allowing users to prove to regulators that their funds are not mixed with illicit funds.</p><p>This is accomplished through the use of techniques like zero-knowledge proofs to demonstrate the legitimacy of the transactions and the absence of involvement with criminal activities. <strong></strong></p><p><a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/zero-knowledge-proofs-explained/amp\">Zero-knowledge proofs</a> are cryptographic techniques that allow one party (the prover) to demonstrate knowledge of a specific piece of information to another party (the verifier) without revealing any details about the information itself. </p><p>When users want to take their money out of the Privacy Pool, they can choose to create a zero-knowledge proof. This proof does two things: First, it confirms that the user’s transaction is legitimate and doesn’t involve a blockchain address associated with criminal activity. Second — and more importantly for users — it keeps their identities private.</p><h2>Association sets</h2><p>Another crucial part of how Privacy Pools work is the idea of “association sets,” subsets of wallet addresses within a cryptocurrency pool. When making withdrawals from the pool, users specify which association set to use. These sets are designed to include only noncritical or “good” depositors’ wallet addresses while excluding those considered “bad” depositors.</p><p>The purpose of association sets is to maintain anonymity, as withdrawn funds can’t be precisely traced to their source. However, it can still be proven that the funds come from a noncritical source.</p><p>Association set providers (ASPs) create these sets and are trusted third parties responsible for analyzing and evaluating the pool’s contributing wallets. They rely on blockchain analytics tools and technologies used in Anti-Money Laundering and transaction analysis. </p><p>Association sets are formed through two distinct processes: inclusion (membership) proofs and exclusion proofs.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c6168360-877a-4c48-94a9-22949b22eafa.png\"><figcaption style=\"text-align: center;\">Membership proofs include “good” transactions, while exclusion proofs include “bad” transactions. Source: Buterin et al., 2023</figcaption></figure><p>Inclusion, also known as membership, is the process of curating a selection based on positive criteria, much like creating a “good” list. When considering deposits, for instance, you examine various options and identify those with clear evidence of being secure and low-risk.</p><p><strong><em><a href=\"https://cointelegraph.com/news/purchase-relaunch-ftx-crypto-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/purchase-relaunch-ftx-crypto-exchange/amp\">Recent: Multiple buyers consider purchase and relaunch of ‘irreparable’ FTX</a></em></strong></p><p>Exclusion involves forming a selection by focusing on negative criteria, much like compiling a “bad” list. In the context of deposits, ASPs evaluate different options and pinpoint those that are evidently risky or unsafe. Subsequently, they generate a list that comprises all deposits except for the ones categorized as risky, thereby excluding them from the list.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1c7ad229-2fb8-409c-9fbb-811569fa8d04.png\"><figcaption style=\"text-align: center;\">Eve’s deposit comes from an untrusted source. Source: Buterin et al., 2023</figcaption></figure><p>The paper takes an example of a group of five people: Alice, Bob, Carl, David and Eve. Four are honest, law-abiding individuals who want to keep their financial activities private. </p><p>However, Eve is a thief or hacker, and this is well known. People may not know who Eve really is, but they have enough proof to know that the coins sent to the address labeled “Eve” come from a “bad” source.</p><p>When these individuals use the Privacy Pool to withdraw money, they will be grouped together by ASPs with other users based on their deposit history via association sets.</p><p>Alice, Bob, Carl and David want to make sure their transactions are kept private while reducing the chances of their transactions looking suspicious at the same time. Their deposits have not been linked to any potential malicious activity, so the ASP chooses for them to be associated only with each other. So, a group is created with just their deposits: Alice, Bob, Carl and David.</p><p>Eve, on the other hand, also wants to protect her privacy, but her own deposit — which comes from a bad source — cannot be left out. So, she’s added to a separate association set that includes her deposit and the others, forming a group with all five user’s deposits: Alice, Bob, Carl, David and Eve.</p><p>Essentially, Eve is excluded from the original group with the trusted deposits (Alice, Bob, Carl and David) but is instead added to a separate group that includes her transactions and the others. However this doesn’t mean that Eve can use the privacy pool to mix her funds.</p><p>Now, here’s the interesting part: Even though Eve doesn’t provide any direct information about herself, it becomes clear by the process of elimination that the fifth withdrawal must be from Eve, as she’s the only one associated with all five accounts in the withdrawal records (since she was added to the separate group that included all five deposits).</p><p>Association sets help Privacy Pools by separating trustworthy users from questionable ones. </p><p>This way, transactions from reliable sources stay private, while any shady or suspicious ones become more visible and easier to spot. </p><p>This way, malicious actors can be tracked, which can satisfy regulatory requirements since the bad users won’t be able to use the pools to hide their activities.</p><h2>What are others saying about the proposals?</h2><p>Buterin’s paper has sparked discussions and garnered attention from the blockchain community and industry experts. Ankur Banerjee, co-founder and chief technology officer of Cheqd — a privacy-preserving payment network — believes Privacy Pools can make it easier for noncentralized entities to identify bad actors. </p><p>Banerjee told Cointelegraph, “The approach outlined could make this kind of money laundering analysis more democratized, and available to DeFi protocols as well. In fact, in the case of crypto hacks, it’s very hard to prevent hackers from trying to launder what they’ve stolen via DeFi protocols — it’s only centralized exchanges where they can be more easily caught/stopped.”</p><p>Seth Simmons (aka Seth For Privacy), host of the privacy-focused podcast <em>Opt Out</em>, told Cointelegraph, “While the concept is technically interesting in that it does minimize the data given over to regulated entities, it asks and answers the wrong question. It asks the question ‘What privacy are we allowed to have?’ instead of ‘What privacy do we need to have?’”</p><p>Simmons continued, saying, “For years now, there has been no balance between user anonymity and regulatory compliance, with the current ruling powers having an almost total visibility into the actions we take and the ways we use our money.”</p><blockquote>“Privacy Pools must seek to right this imbalance by providing the maximum privacy for users possible today instead of attempting to lessen that privacy to please regulators.”</blockquote><p>Banerjee expressed concerns about the built-in delays for adding deposits to association sets, stating, “Tokens can’t immediately get included in a ‘good’ or ‘bad’ set since it takes some time to figure out whether they are ‘good’ or ‘bad.’ The paper suggests a delay similar to seven days before inclusion (this could be higher or lower).”</p><p>Banerjee continued, “But what’s the right amount of time to wait? Sometimes, like in the case of crypto hacks, it’s very obvious soon after the hack that the coins might be bad. But in the case of complex money laundering cases, it might be weeks, months or even years before tokens are figured out to be bad.” </p><p>Despite these concerns, the paper says deposits won’t be included if they are linked to known bad behavior such as thefts and hacks. So, as long as malicious behavior is detected, this should not be a concern.</p><p>Additionally, people with “good” deposits can prove they belong to a trusted group and gain rewards. Those with “bad” funds can’t prove their trustworthiness, so even if they deposit them in a shared pool, they won’t gain any benefits. People can easily spot that these bad funds came from questionable sources when they’re withdrawn from a privacy-enhancing system.</p><h2>Recent regulatory actions</h2><p>Recent actions within the blockchain space have underscored the critical need for privacy and compliance solutions. One notable incident involved the United States government imposing sanctions on Tornado Cash, a cryptocurrency mixing service. </p><p>This move was prompted by allegations that Tornado Cash had facilitated transactions for the North Korea-linked hacking group Lazarus. These sanctions effectively signaled the U.S. government’s heightened scrutiny of privacy-focused cryptocurrency services and their potential misuse for illicit purposes.</p><p>Chris Blec, host of the <em>Chris Blec Conversations</em> podcast, told Cointelegraph, “It’s the easy way out to just look at recent news and decide that you need to start building to government specifications, but sadly, that’s how many devs will react. They’re not here for the principle but for the profit. My advice to those who care: Build unstoppable tech and separate it from your real-world identity as much as possible.”</p><p><strong><em><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-polygon-top-10-brings-no-satisfaction-sandeep-nailwal/\">Magazine: Slumdog billionaire 2: ‘Top 10… brings no satisfaction’ says Polygon’s Sandeep Nailwal</a></em></strong></p><p>As the adoption of cryptocurrencies and decentralized applications continues to grow, governments and regulatory bodies worldwide grapple with balancing enabling innovation and safeguarding against illegal activities.</p><p>Simmons believes it is better to have tools governments cannot shut down: “Regulators will continue to push the imbalance of privacy and surveillance further in their direction unless we actively seek to build tools that give power back to the individual.”</p><p>He continued, “Tornado Cash is a perfect example of this, as they even went above and beyond and complied with regulators as much as was technically possible, and yet that wasn’t enough for ‘them.’ Even after supposedly becoming compliant, they remained a target of the U.S. government because governments do not want a balance between compliance and privacy — they want total surveillance, which leads to total power.”</p><blockquote>“What we need to build in the space are tools (like Tornado Cash) that are resistant to state-level attacks and impossible to shut down or censor, as this is the only way to ensure we have tools at our disposal to defend our freedoms and keep governments in check. Privacy or bust.”</blockquote><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T13:50:14.000Z",
    "title": "China AI chip market finds expansion paths despite US export restrictions ",
    "url": "http://cointelegraph.com/news/china-ai-chip-market-expansion-despite-us-export-restrictions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b4b9ed3a-c006-49df-b866-126983c094be.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. imposed export restrictions of high-level AI chips to China last October, though Chinese companies are now finding new options to develop their technology.</p>\n                    <p><p>The Chinese artificial intelligence (AI) chip market has been<a href=\"https://cointelegraph.com/news/china-is-developing-ai-without-us-chips-here-s-how\"> subject to ongoing export restrictions</a> which imposed by the United States from October 2022, which prohibited the sale of certain U.S. products to China. </p><p>The U.S. initially blocked the export of the highest level of chips produced by companies like Nvidia and AMD. Under the initial October controls the companies were still able to export other models to China, such as Nvidia’s A800 and H800.</p><p>One year later on Oct. 17, the U.S. government announced <a href=\"https://cointelegraph.com/news/us-expands-export-controls-ai-chips-china\">an expansion of controls</a> to “reinforce” the previous ones, which meant that all chip models would be embargoed from the Chinese market. </p><p>One of Nvidia's top gaming chips, the L40S chip is also affected by the latest export restrictions, which were immediately effective on Oct. 24. </p><p>However, on Nov. 9 the local Chinese media outlet STAR Market Daily reported that Nvidia has plans to release three new chips for China. The report cited people familiar with the matter and said the chips are called the HGX H20, L20 PCIe and L2 PCIe.</p><p>Nvidia reportedly could make the announcement about the new chips as early as Nov. 16. Cointelegraph has reached out to Nvidia for comment but hasn't yet received a response. </p><p>According to a quarterly report from Nvidia earlier this year, China is one of its largest markets, along with Taiwan and the U.S. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/chinese-president-calls-for-unity-on-ai-challenges-and-cyber-development\"><strong><em>Chinese president calls for unity on AI challenges and cyber development</em></strong></a></p><p>Additionally, Chinese companies have been turning to domestic companies to fulfill their needs for AI chips. </p><p>On Nov. 7, Reuters <a href=\"https://www.reuters.com/technology/baidu-placed-ai-chip-order-huawei-shift-away-nvidia-sources-2023-11-07/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the Chinese technology company Baidu had ordered AI chips from Huawei in August of this year. </p><p>According to the report, Baidu ordered 1,600 of Huawei’s 910B Ascend AI chips for 200 servers. Huawei’s 910B chips are supposed to be an alternative to Nvidia’s A100. </p><p>The report said that by October, Huawei delivered more than 60% of Baidu’s chip order, which is roughly 1,000 chips and has a total value of approx. 450 million yuan ($61.83 million). The remaining chips are expected by the end of the year. </p><p>Baidu is one of China’s leading AI companies. In October it <a href=\"https://cointelegraph.com/news/baidu-unveils-ernie-4-0-ai-system-overall-performance-par-chat-gpt\">released its Ernie 4.0 AI system</a>, which it says has an overall performance “on par with ChatGPT.”</p><p>Over the summer the Biden Administration reportedly said it is even <a href=\"https://cointelegraph.com/news/us-reportedly-plans-to-restrict-china-s-access-to-cloud-computing-services\">considering adding restrictions</a> on China’s access to cloud computing services. </p><p>Last week, United States Undersecretary of Commerce for Industry and Security Alan Estevez<a href=\"https://cointelegraph.com/news/us-official-confirms-military-concerns-over-china-access-ai-cloud-technology\"> reiterated that fear to reporters</a> at an event in Tokyo, particularly highlighting concerns over usage for military purposes. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/\"><strong><em>AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T14:03:31.000Z",
    "title": "Bitcoin short-term holders reap $1.8 billion in profits over 48 hours",
    "url": "https://cryptoslate.com/insights/bitcoin-short-term-holders-reap-1-8-billion-in-profits-over-48-hours/",
    "description": "<p>Quick Take Over the 48-hour period of Nov. 7 and 8, short-term holders, specifically those who have maintained their Bitcoin investments for less than 155 days, have extracted a staggering $1.8B in profits. This massive profit-taking marks one of the highest volumes observed this year, rivaled only by instances such as the aftermath of the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-short-term-holders-reap-1-8-billion-in-profits-over-48-hours/\">Bitcoin short-term holders reap $1.8 billion in profits over 48 hours</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T14:00:23.000Z",
    "title": "RISC Zero, the Industry-Leading Developer of General Purpose Zero-Knowledge (ZK) Technology, Open Sources Three Technological Innovations Under Apache2 License",
    "url": "https://cryptodaily.co.uk/2023/11/risc-zero-the-industry-leading-developer-of-general-purpose-zero-knowledge-zk-technology-open-sources-three-technological-innovations-under-apache2-license",
    "description": "RISC Zero, the Industry-Leading Developer of General Purpose Zero-Knowledge (ZK) Technology, Open Sources Three Technological Innovations Under Apache2 License"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T13:48:49.000Z",
    "title": "SEC Head Open To Rebooting FTX",
    "url": "https://cryptodaily.co.uk/2023/11/sec-head-open-to-rebooting-ftx",
    "description": "The US Securities and Exchange Commission (SEC) chair, Gary Gensler, has claimed that proper leadership and compliance could help revive the bankrupt crypto exchange."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T14:06:48.000Z",
    "title": "JPMorgan considers rally in crypto market overestimated",
    "url": "https://crypto.news/jpmorgan-considers-rally-in-crypto-market-overestimated/",
    "description": "The rally in the crypto market looks overvalued, say JPMorgan Chase analysts. According to The Block, the bank noted the high expectations of traders and investors dictated by several factors. Among them, experts identified two main ones: the prospect of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T13:58:43.000Z",
    "title": "Bitcoin miner Marathon Digital posts 670% surge in Q3 revenue",
    "url": "https://crypto.news/bitcoin-miner-marathon-digital-posts-670-surge-in-q3-revenue/",
    "description": "Bitcoin miner Marathon Digital Holdings has reported a substantial increase in revenue, marking a 670% rise year-on-year in the third quarter of 2023. This remarkable growth is attributed to a significant uptick in Bitcoin (BTC) production, which increased from 6.7&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T13:50:33.000Z",
    "title": "Coinbase fined $11k in Russia despite not operating there",
    "url": "https://crypto.news/coinbase-fined-11k-in-russia-despite-not-operating-there/",
    "description": "A Russian court has ruled that American crypto exchange Coinbase failed to localize the personal data of its Russian clients. A court in Moscow on Nov. 9 has fined U.S.-based cryptocurrency exchange Coinbase 1 million rubles (nearly $11,000) for failing&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T13:43:52.000Z",
    "title": "Bitcoin’s soar past $36k triggers $186m in liquidations",
    "url": "https://crypto.news/bitcoins-soar-past-36k-triggers-186m-in-liquidations/",
    "description": "On Nov. 9, Bitcoin passed the $36,000 mark. The volume of liquidations on futures in the crypto-asset market increased to around $186.6 million. In the last 24 hours, 57,903 traders&#8217; positions were liquidated, totaling more than $186.6 million, according to CoinGlass.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T14:00:59.000Z",
    "title": "Shibarium Network Lull – How It Affects The Future Of BONE",
    "url": "https://www.newsbtc.com/news/shibarium-network-lull-how-it-affects-the-future-of-bone/",
    "description": "Shibarium, the highly anticipated layer-2 solution for the SHIB army, finally became functional on Aug. 28, following a rocky launch plagued by technical issues that drew scorn from the broader cryptocurrency community. The launch promised a new era of efficiency for SHIB holders who had eagerly awaited this solution for over a year.  However, recent data paints a troubling picture of Shibarium&#8217;s current state, with a steep decline in user engagement and network activity levels reminiscent of its early days of operation. Data from the Shibarium explorer reveals a significant drop in user engagement. On Nov. 6, Shibarium recorded a mere 9,740 transactions, a stark contrast to the network&#8217;s peak on Sept. 11, when daily transactions surged to over 202,000. This decline raises concerns about the project&#8217;s long-term viability and whether it can deliver on its promises of scalability and efficiency. Source: ShibariumScan Shib Name Service (SNS) Launch The decline in new address counts on the chain appears to be closely tied to the drop in daily transactions. This trend persists despite the introduction of Shiba Inu&#8217;s &#8220;Shib Name Service&#8221; (SNS) on Oct. 30.  SNS, a decentralized naming service, allows users to create human-readable addresses for their Shibarium wallets. While the SNS launch aimed to enhance user experience and accessibility, it has not been able to reverse the declining user engagement on the network. BONE market cap currently at $169 million. Chart: TradingView.com Impact On BONE Price Shibarium&#8217;s struggles are not limited to user engagement; they are also affecting the price of the native token, BONE. As of the latest data from CoinGecko, the current price of BONE stands at $0.734137, with a 4.0% increase in the last 24 hours and a 2.5% rise over the past week. On the token&#8217;s spot market, most participants have been distributing their BONE holdings, which is evident from the momentum indicators on a 24-hour chart. Selling pressure is outweighing accumulation, which is concerning for the token&#8217;s future value. BONE 14-day price action. Source: Coingecko Shibarium&#8217;s failure post-launch raise several concerns within the cryptocurrency community. The project&#8217;s inability to maintain the initial momentum following a challenging launch is a red flag for investors and enthusiasts. The decline in user engagement, even after introducing user-friendly features like SNS, suggests that the core issues surrounding Shibarium&#8217;s technical infrastructure need attention. @ShytoshiKusama has been selling stuff to shibarmy and amassing their own wallet. More talk than action, since shib became successful, everything he has done has been a failure (shiboshis, land, Shibarium and sns) Fuk — Mefam (@0xMefam) November 1, 2023 Related Reading: Cardano October Whale Frenzy – What Lies Ahead For November? The dwindling user base has a direct impact on the value of BONE, with selling pressure dominating the market. To regain its footing, Shibarium will need to address the technical issues, improve its user experience, and regain the trust and enthusiasm of its user base. Shibarium, which held significant promise as a layer-2 solution for the SHIB community, is currently facing a critical test of its long-term viability. The decline in user engagement and its effect on BONE&#8217;s price indicate that the project has some challenges to overcome. Investors and enthusiasts will be watching closely to see if Shibarium can bounce back and fulfill its potential. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Taokinesis/Pixabay"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T14:00:14.000Z",
    "title": "Grayscale Chainlink Trust Premium Rate Hits Record High of +223.86%",
    "url": "https://coinedition.com/grayscale-chainlink-trust-premium-rate-hits-record-high-of-223-86/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale Chainlink Trust Rate Hits Record\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The digital asset investment product Grayscale Chainlink Trust has hit record highs, with the GLINK premium rate increasing by 223.86%. Grayscale’s other trusts have also returned record highs, with GSOL, the investment product for Solana, seeing its premium rate increase by 630.82%. Meanwhile, Grayscale’s Filecoin Trust is trading at a 1016.63% climb on its premium [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/grayscale-chainlink-trust-premium-rate-hits-record-high-of-223-86/\">Grayscale Chainlink Trust Premium Rate Hits Record High of +223.86%</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T13:51:33.000Z",
    "title": "DAstra Network: How to make DeFi more widespread?",
    "url": "https://coinedition.com/dastra-network-how-to-make-defi-more-widespread/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/pr-1-29.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/pr-1-29.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/pr-1-29-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Decentralized finance (DeFi) is a type of financial instrument that uses blockchain technology to create decentralized applications, allowing users to exchange digital assets without intermediaries. Launchpads have already proven their effectiveness as a tool for decentralized economies, but they have not yet gained the widespread popularity that many Web3 enthusiasts desire. However, despite the numerous [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/dastra-network-how-to-make-defi-more-widespread/\">DAstra Network: How to make DeFi more widespread?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]