[
  {
    "source": "Decrypt",
    "date": "2024-02-19T23:07:20.000Z",
    "title": "Starknet Activity Falls Sharply Following Ethereum Airdrop Hype",
    "url": "https://decrypt.co/218114/starknet-activity-falls-ethereum-airdrop-hype",
    "description": "Active wallets and trading volume on Starknet are falling ahead of Tuesday's airdrop, following a brief spike around last week's news."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-19T23:00:34.000Z",
    "title": "Top wirehouses will become involved with spot Bitcoin ETFs, Galaxy executive says",
    "url": "https://cryptoslate.com/top-wirehouses-will-become-involved-with-spot-bitcoin-etfs-galaxy-executive-says/",
    "description": "<p>A representative from Galaxy has predicted that spot Bitcoin ETFs will gain further adoption in the coming months, as reported by FOX Business on Feb. 19. Steve Kurz, global head of Galaxy Asset Management, said: &#8220;I’d be surprised in the next year if the top 10 wirehouses are not involved in this &#8230; We will [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/top-wirehouses-will-become-involved-with-spot-bitcoin-etfs-galaxy-executive-says/\">Top wirehouses will become involved with spot Bitcoin ETFs, Galaxy executive says</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T23:00:47.000Z",
    "title": "Finance Expert Predicts Bitcoin Will Touch $100,000 Soon, Here’s When",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-will-touch-100000/",
    "description": "Renowned finance author Robert Kiyosaki has once again made a bullish price prediction for the flagship cryptocurrency, Bitcoin. This time, he predicts that Bitcoin will hit $100,000 and mentions when exactly this will happen.  When Bitcoin Will Hit $100,000 Kiyosaki mentioned in an X (formerly Twitter) post that Bitcoin will hit $100,000 by June 2024. However, he didn’t mention what will propel this massive price surge. The finance expert is known to be a huge advocate of the foremost crypto token and, at different times, given his opinion on its potential.  Related Reading: $400 XRP Price Point: Analyst Breaks Down The Future Surge Date Before now, Kiyosaki, who authored the best-selling book ‘Rich Dad, Poor Dad,’ said that Bitcoin was going to rise to $150,000 and singled out the Spot Bitcoin ETFs as what would drive this parabolic move. He had also once identified the Bitcoin Halving as being pivotal for BTC&#8217;s growth.  Interestingly, the author is believed to be a ‘crypto OG’ as he previously shared his excitement about investing in BTC “years ago.” He also continues to urge others to do the same, claiming that it is the way to avoid becoming poorer due to the actions of the government. Kiyosaki doesn’t shy away from criticizing the government and recently went as far as branding the Federal Reserve “a criminal organization.” According to him, the “Fed has destroyed the economy, made the poor and middle class poorer, and bailed out their rich banking friends.” Instead of trusting the Fed (possibly to fight inflation), Kiyosaki stated that he would rather put his trust in Bitcoin and other assets like Gold and Silver.  BTC price still above $52,000 &#124; Source: BTCUSD on Tradingview.com BTC Will Hit $100,000 But How Soon? There seems to be a consensus among several crypto analysts that Bitcoin will no doubt hit $100,000 in the next bull run. However, the ultimate question remains when exactly this will happen. Just like Kiyosaki, crypto analyst Kevin Svenson believes that this price level isn’t far off.  Related Reading: 4 Surprising Insights From Coinbase’s Earnings, COIN Sees Bullish Surge Tom Dunleavy, Partner and Chief Investment Officer (CIO) at MV Capital, also predicted that Bitcoin will hit $100,000 this year, although he didn’t give a more precise timeframe like Kiyosaki. While some predictions remain devoid of a specific timeframe, the belief is that this parabolic price surge will happen after Bitcoin Halving. The Halving event has been projected to be what kickstarts the next bull run. That isn’t surprising, considering that Bitcoin is known to claim a new all-time high (ATH) after miners’ rewards are cut in half. One of the most bullish post-halving price predictions is Anthony Scaramucci’s prediction that BTC will hit $170,000 in 2025.   At the time of writing, Bitcoin was trading at around $52,300, up over 1% in the last 24 hours, according to data from CoinMarketCap.  Featured image from InfoMoney, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-19T23:01:42.000Z",
    "title": "Smaller Retail Investors Begin to Reappear to Crypto As Markets Stage Comeback: Report",
    "url": "https://dailyhodl.com/2024/02/19/smaller-retail-investors-begin-to-reappear-to-crypto-as-markets-stage-comeback-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/in-Play-As-BTC.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Smaller crypto investors are reportedly beginning to return to retail trading apps like Robinhood and Coinbase as BTC has rallied 25% in the last month. According to a new Bloomberg report, small, &#8220;mom-and-pop&#8221; investors are creeping back into the crypto markets, though they&#8217;re nowhere near the same level of involvement as the last bull market. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/19/smaller-retail-investors-begin-to-reappear-to-crypto-as-markets-stage-comeback-report/\">Smaller Retail Investors Begin to Reappear to Crypto As Markets Stage Comeback: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]