[
  {
    "source": "CoinDesk",
    "date": "2023-09-12T12:01:00.000Z",
    "title": "First Mover Americas: Altcoin Crash May Be on the Cards",
    "url": "https://www.coindesk.com/markets/2023/09/12/first-mover-americas-altcoin-crash-may-be-on-the-cards/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Sept. 12, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-12T12:00:00.000Z",
    "title": "Fabian Vogesteller’s Lukso Blockchain Adds ‘Universal Profiles,’ in Push for ‘Fancy’ Ethereum",
    "url": "https://www.coindesk.com/tech/2023/09/12/fabian-vogestellers-lukso-blockchain-adds-universal-profiles-in-push-for-fancy-ethereum/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Universal Profiles are a feature, currently in beta, designed to give users a holistic “on-chain identity” that comes with a recoverable crypto account as well as a profile for interacting with decentralized applications."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T12:01:22.000Z",
    "title": "NFT collection Milady exploited by developer stealing $1M in fees",
    "url": "https://cointelegraph.com/news/nft-project-milady-suffers-1million-fee-exploit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/04d8b9ba-5781-4edc-9279-f77dc5dc13bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Milady NFT creator Charlotte Fang said that Remilia “easily identified” the individuals involved in the exploit and will start legal action.</p>\n                    <p><p>Milady Maker, a nonfungible token (NFT) project on the Ethereum blockchain, has fallen victim to a major exploit involving the platform’s fees and social media accounts.</p><p>Charlotte Fang, co-founder of the Milady Maker NFT collection, took to X (formerly Twitter) on Sept. 11 to <a href=\"https://x.com/CharlotteFang77/status/1701245168039452947?s=20\" target=\"_blank\" rel=\"noopener nofollow\">announce</a> that a developer in the Milady ecosystem has managed to divert about $1 million in generated fees from Remilia Corporation.</p><p>Remilia is a decentralized autonomous organization (DAO) behind Milady Maker NFT. The DAO saw its revenue compromised from Bonkler, its experimental finance art project created in April 2023, according to an announcement by Fang.</p><p>“The Bonkler reserves, main contract and NFTs are safe; only Remilia’s revenue from Bonkler was compromised,” Fang noted. The creator emphasized that Remilia’s reserves are “unaffected” and user assets are “perfectly safe.”</p><p>In addition to fee reserves, the attacker has also seized codebases and coordinated with other team members in an attempt to seize control of Remilia’s social media.</p><p>According to Fang, the attacker has managed to take over three X accounts, including Miladymaker and Remilionaire, while Remiliacorp has been locked out. “Treat those three accounts as compromised until further notice,” Fang stated, providing new official accounts, including RemiliaCorp333, MiladyMaker333 and RemilioBaby.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hackers-behind-stake-exploit-shifts-bnb-and-matic-latest-move\"><strong><em>Hackers behind $41M Stake heist shifts BNB, MATIC in latest move: CertiK</em></strong></a></p><p>Fang added that Remilia “easily identified” the individuals involved in the exploit and expressed willingness to pursue them to the fullest extent of the law. “We expect all our property to be returned,” she stated, adding: </p><blockquote>“For such viciousness, I can give no quarter — the individuals involved have been terminated from Remilia Corporation, and will now be dealt with through the heavy hand of the law.”</blockquote><p>Launched in 2021, Milady is a collection of 10,000 anime profile picture NFTs designed by Fang. In May 2023, Milady NFTs were publicly endorsed by Tesla CEO Elon Musk, who <a href=\"https://cointelegraph.com/news/milady-nft-floor-price-surges-after-elon-musk-tweet\">posted a meme using imagery from the Milady NFT collection</a>. The move triggered a rapid spike in the floor price of a Milady NFT, which subsequently surged from 3.8 Ether (ETH) to 7.8 ETH.</p><p>At the time of writing, the floor price of a Milady NFT is 2.86 ETH, down about 15% over the past 24 hours, <a href=\"https://opensea.io/collection/milady/analytics\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from OpenSea.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binances-exec-exodus-nasdaq-to-trade-ai-orders-and-sbf-loses-bail-appeal-hodlers-digest-sept-3-9/\"><strong><em>Hodler’s Digest, Sept. 3-9: Binance’s exec exodus, Nasdaq to trade AI orders and SBF loses bail appeal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T11:58:44.000Z",
    "title": "Venture capital exec says ‘lack of innovation’ drives funding away from crypto",
    "url": "https://cointelegraph.com/news/crypto-venture-capital-exec-says-lack-innovation-drives-funding-away-from-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1ef03945-dbe6-4d64-9fef-02d0995d2796.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Foresight Ventures partner Tony Cheng said that most of the narratives like layer-2 solutions, zero-knowledge tech and nonfungible tokens have already \"played out.\"  </p>\n                    <p><p>Compared to 2022, where the first and second quarters of the year saw a combined $20.3 billion flow into the space through VC funding, 2023 has been significantly lacking. </p><p>Venture capital funding for the crypto space has significantly declined this year. In the first quarter of the year, around <a href=\"https://cointelegraph.com/news/crypto-venture-capital-investment-q1-2023-report-pitchbook\">$2.6 billion worth of crypto VC deals</a> were made. In Q2, the space <a href=\"https://cointelegraph.com/news/execs-remain-positive-on-long-term-prospects-amid-vc-funding-downturn\">saw around $2.1 billion across 292 funding rounds</a>, which is one of the worst performances in terms of crypto fundraising. </p><p>Amid the current VC funding situation, Cointelegraph’s Zhiyuan Sun recently interviewed Tony Cheng, a partner at the crypto investment firm Foresight Ventures, to speak about how the lack of new innovations may be driving venture capital firms away from the space, how founders should act to survive the bear market and what companies should prioritize between user growth and profit. </p><p>According to Cheng, most of the narratives such as layer-2 solutions, zero-knowledge and <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible tokens (NFTs)</a> have \"largely played out.” The executive believes that these \"kind of died down\" with the lack of trading volume on exchanges and in <a href=\"https://cointelegraph.com/learn/how-to-get-started-in-defi-a-guide-on-the-first-steps-in-decentralized-finance\">decentralized finance (DeFi)</a>. He explained: </p><blockquote>“I think right now the biggest problem and obstacle for a lot of these people is the lack of confidence, mainly because we haven't really seen any new innovation in this space.” </blockquote><p>In addition, the executive said that due to the limited market activity and number of users, the space hasn't been able to \"see too much traction in any direction.\" However, the executive remains positive that things can turn around when there's a better macro landscape and when people get more pumped about the next crypto cycle. </p><p>When asked if founders within the space should take funding offers even though the terms may not be as good as they would expect, Cheng said that the main thing to do at this point is to “survive.” </p><p>“If you are lacking in capital, if you don't have the runway to kind of get you through the next year or so, you should be taking capital and taking as much as you can get because that money might not be available anymore after maybe 2 or 3 months,” he explained.</p><p>The executive highlighted the importance of self-preservation for founders and staying in the game. Otherwise, the venture capital executive said that all the work that was done in the past few years would be gone. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitget-announces-further-100-m-fund-for-ecosystem-development\"><strong><em>Bitget announces further $100M fund for ecosystem development</em></strong></a></p><p>The executive added that in the context of the bear market, the \"growth at all cost\" approach does not make sense. Instead, companies should focus on being profitable. “You just have to make sure that you can survive. Like in any kind of downturn, surviving is priority number one,” he said. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T11:45:00.000Z",
    "title": "How artificial intelligence can impact supply chains and logistics",
    "url": "https://cointelegraph.com/explained/how-artificial-intelligence-can-impact-supply-chains-and-logistics",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/ec8856d40162782f5f66797323b4c851.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>                        Many supply chain and logistics organizations are seeking AI-driven solutions to enhance their workflow efficiency.                    </p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-116282-0\">            <h2 data-ct-widget=\"explained-block-title\">                The future of AI in supply chains and logistics            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>AI has the potential to revolutionize the supply chain and logistics sectors by improving efficiency and reducing operational costs.&nbsp;</em></p><p>The use of AI in supply chains and logistics has the potential to drastically alter how items are distributed, handled and transported in the future. Automation, predictive analytics and other AI-based technologies are positioned to optimize a number of supply chain-related processes.&nbsp;</p><p>These developments may result in improved demand forecasting, real-time shipment tracking and vehicle route optimization, in addition to improved inventory management.</p><p>Furthermore, AI can lower operating expenses, identify inefficiencies, and enhance overall customer responsiveness. AI&rsquo;s integration into supply chain and logistics operations promises to improve efficiency, decrease waste, and better respond to the changing demands of the modern market as it continues to develop.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-1\">            <h2 data-ct-widget=\"explained-block-title\">                AI in transportation management and route optimization            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In the field of supply chain and logistics, AI can be employed to analyze data and identify patterns to<a href=\"https://cointelegraph.com/news/amazon-implements-ai-to-enhance-logistics-and-delivery-speeds\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/amazon-implements-ai-to-enhance-logistics-and-delivery-speeds/amp\"> determine convenient transport routes</a>.&nbsp;</em></p><p>AI solutions can utilize real-time data, such as prevailing traffic and weather conditions, to identify the most efficient routes for deliveries. Such AI capabilities can be harnessed to mitigate inconveniences caused by factors such as traffic congestion, particularly during peak traffic times, thereby reducing delivery times.</p><p>AI is also expected to impact the industry in other ways. For example, industry analysts<a href=\"https://www.cnbc.com/2023/06/19/supply-chains-how-ai-could-remove-all-human-touchpoints.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\" data-amp=\"https://www-cnbc-com.cdn.ampproject.org/c/s/www.cnbc.com/amp/2023/06/19/supply-chains-how-ai-could-remove-all-human-touchpoints.html\"> predict</a> that the<a href=\"https://cointelegraph.com/news/7-artificial-intelligence-examples-in-everyday-life\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/7-artificial-intelligence-examples-in-everyday-life/amp\"> use of autonomous trucks</a> that rely on the technology will increase in the near future. The transformation is expected to occur due to a confluence of factors.</p><p>One factor is that the technology behind the vehicles is advancing rapidly, while there is increased demand for freight transportation and a shortage of skilled truck drivers. According to pundits, the technology will become an attractive option for businesses as it improves and becomes more reliable.</p><p>Of course, it is impossible to pinpoint precisely when autonomous trucks will become mainstream. However, extensive safety standards would have to be met before mass adoption.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-2\">            <h2 data-ct-widget=\"explained-block-title\">                AI applications in supply chains and logistics for a better customer experience            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>AI has the potential to transform customer service in the supply chain and logistics industries in many ways.</em></p><p>One of them is enabling real-time tracking of orders. This capability can help customers stay informed about the status and location of their shipments, providing them with transparency and peace of mind.</p><p>Additionally, <a href=\"https://cointelegraph.com/news/5-real-world-applications-of-natural-language-processing-nlp\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/5-real-world-applications-of-natural-language-processing-nlp/amp\">natural language processing (NLP)</a>-based AI solutions can be used to automate<a href=\"https://cointelegraph.com/news/5-ways-ai-is-helping-to-improve-customer-service-in-e-commerce\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/5-ways-ai-is-helping-to-improve-customer-service-in-e-commerce/amp\"> customer service tasks</a>, reducing the burden on human representatives. For example, AI can be deployed to answer frequently asked questions (FAQs), freeing up human agents to focus on more complex tasks, especially those requiring human input or expertise.</p><p>These capabilities not only improve the response time to customer inquiries but also lead to greater customer contentment.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-3\">            <h2 data-ct-widget=\"explained-block-title\">                AI can be used to streamline procurement processes            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>AI has the potential to be a game-changer in streamlining procurement processes by automating many of the tedious tasks. For example, AI can be used to automate invoice processing by helping companies validate invoice data.&nbsp;</em></p><p>Furthermore, AI can also be used to alert supply managers about pending invoices to ensure that they are processed in a timely manner. Beyond this, AI capabilities can be extended to create purchase orders and monitor their progress. This level of automation is likely to result in a significant reduction in the time and effort expended on these tasks.</p><p>In addition to invoice-related functions, AI can be programmed to analyze past data and detect patterns and trends that indicate potential risks and issues in procurement processes. For instance, AI could be used to identify supplier performance issues or compliance violations. Such an approach would help to avert problematic situations preemptively and enhance process optimization.</p>Some companies are already<a href=\"https://www.wipro.com/holmes/how-blockchain-and-ai-can-transform-the-procure-to-pay-cycle/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> leveraging</a> the power of AI and <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-a-beginners-guide-to-blockchain-technology\">blockchain technology</a> to create <a href=\"https://cointelegraph.com/explained/how-blockchain-technology-is-used-in-supply-chain-management\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/how-blockchain-technology-is-used-in-supply-chain-management/amp\">securer and more transparent distributed database</a> procurement systems.            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-4\">            <h2 data-ct-widget=\"explained-block-title\">                AI for quality control            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>The emergence of AI-enabled sensors and analytics tools has revolutionized quality control in supply chains and logistics firms, as AI technologies can monitor product quality and detect defects in real time, ensuring that products meet the highest standards before they reach customers.</em></p><p>Some sensors are, for example, able to detect scratches, cracks and dents in products, while others are programmed to check for incorrect markings or missing components. Some predictive maintenance AI models are also used to<a href=\"https://www.ptc.com/en/blogs/iiot/what-is-ai-in-predictive-maintenance\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> evaluate</a> product usage and come up with recommended maintenance schedules based on a wide range of usage trends.</p><p>In transportation, AI-enabled sensors can be employed to monitor the condition of products. For instance, the AI in <a href=\"https://cointelegraph.com/learn/the-internet-of-things-iot-a-beginners-guide\">Internet-of-Things (IoT)</a> sensors can be used to detect temperature and humidity changes to ensure that perishable goods are kept at the correct temperature.</p><p>By incorporating AI-enabled sensors throughout supply chain and logistics processes, businesses can ensure that only high-quality products reach their customers. This not only enhances customer satisfaction but also safeguards brands&rsquo; reputations.</p><p><img alt=\"How AI and IoT are adding value to the supply chain\" src=\"https://s3.cointelegraph.com/storage/uploads/view/e8a46a61aedea1dbf3a23fad22901189.jpg\" title=\"How AI and IoT are adding value to the supply chain\"></p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-5\">            <h2 data-ct-widget=\"explained-block-title\">                The use of AI in warehouse automation            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>AI robots are increasingly being used in supply chain and logistics warehouses to automate a range of tasks, including picking, packing and replenishing.&nbsp;</em></p><p>Autonomous mobile robots (AMRs) are becoming a more popular tool used in supply chain warehouses around the world. This is because they are able to operate independently with little human guidance or intervention. By incorporating AI and advanced technologies, such as <a href=\"https://cointelegraph.com/news/5-key-features-of-machine-learning\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/5-key-features-of-machine-learning/amp\">machine learning</a>, computer vision and sensor fusion, these robots are able to execute intricate tasks effectively.</p><p>Moreover, AMRs have the ability to adjust to changing warehouse configurations and operational demands. In environments where AI robots can work collaboratively alongside human workers, the synergy allows humans to focus on more complex tasks that require human creativity and problem-solving skills, while the robots take care of the repetitive and mundane tasks.</p><p>Such dynamic partnerships have the potential to maximize workforce productivity and improve the overall efficiency of warehouse operations in the supply chain and logistics sectors.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-6\">            <h2 data-ct-widget=\"explained-block-title\">                Enhancing demand forecasting with AI predictive analytics solutions            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Demand forecasting enhances predictability and resource planning, which, in turn, aids supply chain and logistics organizations in maintaining the delicate balance between consumer demand and supply.</em></p><p>AI technology excels at forecasting demand by extracting insights from extensive repositories of data. Some <a href=\"https://cointelegraph.com/news/15-important-data-terms\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/15-important-data-terms/amp\">big data</a> and <a href=\"https://cointelegraph.com/explained/what-are-convolutional-neural-networks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/what-are-convolutional-neural-networks/amp\">artificial neural network</a> AI projection<a href=\"https://www.frontiersin.org/articles/10.3389/frai.2020.00004/full\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> tools</a> are designed to apply <a href=\"https://cointelegraph.com/news/5-python-libraries-to-interpret-machine-learning-models\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/5-python-libraries-to-interpret-machine-learning-models/amp\">data science models</a> and derive pertinent information from numerous sources that include past sales records, customer transactions, social media mentions and prevailing economic indicators.</p><p>Besides this, the tools can be used to facilitate better collaboration between supply chain partners by allowing demand forecast data to be shared with suppliers. Such capabilities help businesses optimize production schedules and delivery plans to create a harmonized supply chain system. This aspect benefits supply chain organizations by enabling them to respond swiftly to demand fluctuations.</p><p>The higher level of predictability also allows businesses to minimize stockouts, optimize inventory levels, and reduce excess inventory, leading to better inventory management, higher cost savings and better customer satisfaction.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116282-7\">            <h2 data-ct-widget=\"explained-block-title\">                The use of artificial intelligence in supply chains            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Numerous industries are embracing the use of AI because of the technology&rsquo;s transformative potential.&nbsp;</em></p><p>In the context of supply chains and logistics, many companies have been exploring AI-driven solutions to enhance their workflow efficiency and overcome the complexities involved in managing the movement of goods from companies to the end consumer.</p><p>As highlighted in a 2021 <a href=\"https://www.gartner.com/en/articles/gartner-predicts-the-future-of-supply-chain-technology\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">report</a> by Gartner, a research and data insights firm, 50% of supply chain organizations are projected to invest in AI and analytics applications through 2024.</p><p>Looking at how the trend started, the <a href=\"https://cointelegraph.com/news/how-ai-is-changing-how-humans-interact-with-machines\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-ai-is-changing-how-humans-interact-with-machines/amp\">need for artificial intelligence</a> in supply chains rose sharply in 2020 following the emergence of the COVID-19 pandemic. The onset of the epidemic brought unprecedented challenges to supply chain organizations worldwide after the global health crisis disrupted economies, halted manufacturing, and led to erratic consumer behavior.&nbsp;</p><p>The fast-evolving situation left many supply chain operators grappling with an unprecedented level of uncertainty as long-standing conventional supply chain management models proved insufficient to cope with the scale and complexity of the disruptions.</p><p>The predicament compelled supply chain organizations across industries to seek more innovative tools and technologies. Consequently, a substantial number of them turned to AI solutions due to the advantages of the technology.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T11:44:02.000Z",
    "title": "Bitcoin to hit $100K in 2024? Canaan VP weighs up 2024 halving opportunities ",
    "url": "https://cointelegraph.com/news/bitcoin-to-hit-100k-in-2024-canaan-vp",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6dbbe525-2a2b-47ee-ba8f-271e83cdc9c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Canaan vice president Davis Hui believes a supply deficit following the next Bitcoin halving will drive its price past $100,000. </p>\n                    <p><p>Executives from prominent mining and manufacturing firms believe market forces resulting from the fourth Bitcoin halving scheduled in 2024 could force the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) past $100,000.</p><p>Magazine editor Andrew Fenton spoke to Canaan vice president Davis Hui following a panel discussion at Canaan’s Avalon Bitcoin and Crypto Day (ABCD) in Singapore.</p><p>Hui and a panel that included Bitcoin mining ecosystem executives from Singapore, Kazakhstan and the United Arab Emirates all offered BTC price predictions around $100,000 in 2024 resulting from the effects of the latest Bitcoin mining reward halving.</p><p><strong><em>Related:</em></strong> <a href=\"https://cointelegraph.com/news/bitcoin-all-time-high-2025-btc-price-idea\"><strong><em>Bitcoin all-time high in 2025? BTC price idea reveals ‘bull run launch’</em></strong></a></p><p>Hui told Cointelegraph that the supply of Bitcoin would be drastically reduced with the reward halving down to 6.25 BTC per block, while traditional finance institutions are showing increased interest in investing in the sector:</p><blockquote>“What about BlackRock? They’re holding onto $10 trillion of assets under management. The overall cryptocurrency market cap is $2 trillion — they have five times more than that.”</blockquote><p>The Canaan VP said his prediction was heavily influenced by the outcome of a number of Bitcoin exchange-traded fund applications lodged with the United States Securities and Exchange Commission by some of the world’s largest asset managers.</p><blockquote>“This money will come in, the BTC demand will increase, while the supply has decreased, and the price will increase.”</blockquote><p>Hui also noted that it had become difficult for most miners to continue operating in highly competitive market conditions, with all-time hash rates and network difficulties directly eating into miner profitability.</p><p>Those who could not cover electricity costs with the Bitcoin mining rewards earned will simply shut off those machines, while those who continue operating will do so with a view of the potential upside ahead of the 2024 halving, he said.</p><p>Miners who can upgrade to more efficient and powerful machines are able to maintain better profitability, he said. Hui predicts that mining companies in the U.S. might be particularly hard pressed, given high electricity and administrative costs.</p><p>Hui also conceded that Canaan was among the industry companies to have reported a financial loss in the first quarter of 2023, highlighting the impact of a prolonged cryptocurrency bear market.</p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\">Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T11:44:48.000Z",
    "title": "New UK crypto laws pose stiff challenge for most firms, cautions Delphi Labs counsel",
    "url": "https://cryptoslate.com/new-uk-crypto-laws-pose-stiff-challenge-for-most-firms-cautions-delphi-labs-counsel/",
    "description": "<p>Delphi Labs general counsel Gabriel Shapiro warned that most crypto firms will struggle to comply with the new financial promotions regulations by the U.K. Financial Conduct Authority (FCA). In a Sept. 11 post on X (formerly Twitter), Shapiro noted that strict compliance with the regulations may be feasible only for centralized exchanges and a select [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/new-uk-crypto-laws-pose-stiff-challenge-for-most-firms-cautions-delphi-labs-counsel/\">New UK crypto laws pose stiff challenge for most firms, cautions Delphi Labs counsel</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T12:02:27.000Z",
    "title": "Bitcoin avoids lower low",
    "url": "https://cryptodaily.co.uk/2023/09/bitcoin-avoids-lower-low",
    "description": "Bitcoin came within a whisker of making a new lower low late on Monday. A bounce back to $25,850 happened instead."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T11:40:56.000Z",
    "title": "CCDAS, London’s Flagship Institutional Digital Asset Summit, Returns to London October 2-3",
    "url": "https://cryptodaily.co.uk/2023/09/ccdas-londons-flagship-institutional-digital-asset-summit-returns-to-london-october-2-3",
    "description": "CCDAS, London’s Flagship Institutional Digital Asset Summit, Returns to London October 2-3"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T11:52:38.000Z",
    "title": "MixMarvel and Yeeha Games Announce Trailblazing Partnership at Exclusive TOKEN2049 Side Event",
    "url": "https://cryptodaily.co.uk/2023/09/mixmarvel-and-yeeha-games-announce-trailblazing-partnership-at-exclusive-token2049-side-event",
    "description": "MixMarvel and Yeeha Games Announce Trailblazing Partnership at Exclusive TOKEN2049 Side Event"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T12:00:50.000Z",
    "title": "Chancer Platform Releases Product Teaser as Presale Rockets Past $1.7M",
    "url": "https://www.cryptopolitan.com/chancer-platform-releases-product-teaser-as-presale-rockets-past-1-7m/",
    "description": "London, United Kingdom, September 12th, 2023, Chainwire Chancer has released their first product update, aligning with the exciting vision laid out in their whitepaper. This accompanies the rapid trajectory of the presale raise, which accumulated over $1.7M &#8211; with the few remaining tokens at this stage priced at $0.011 before the raise enters Stage 3 ... <a title=\"Chancer Platform Releases Product Teaser as Presale Rockets Past $1.7M\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chancer-platform-releases-product-teaser-as-presale-rockets-past-1-7m/\" aria-label=\"More on Chancer Platform Releases Product Teaser as Presale Rockets Past $1.7M\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T11:59:30.000Z",
    "title": "Cloud-Based AI System Achieves 90% Accuracy in Detecting Sewer Blockages to Reduce River Pollution",
    "url": "https://www.cryptopolitan.com/cloud-based-ai-system-detect-sewer-blockages/",
    "description": "A remarkable collaboration between the University of Sheffield, Yorkshire Water, and Siemens has resulted in a cloud-based artificial intelligence (AI) system that boasts nearly 90% accuracy in detecting sewer blockages. This groundbreaking development promises to play a pivotal role in reducing river pollution caused by sewer overflow incidents. Tackling pollution with a strategic plan The ... <a title=\"Cloud-Based AI System Achieves 90% Accuracy in Detecting Sewer Blockages to Reduce River Pollution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cloud-based-ai-system-detect-sewer-blockages/\" aria-label=\"More on Cloud-Based AI System Achieves 90% Accuracy in Detecting Sewer Blockages to Reduce River Pollution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T11:50:10.000Z",
    "title": "Why Apple’s iPhone 15 launch isn’t all it could’ve been",
    "url": "https://www.cryptopolitan.com/apple-iphone-15-launch-not-it-why/",
    "description": "In a world where technology and innovation reign supreme, Apple&#8217;s much-anticipated iPhone 15 launch left many with a taste of déjà vu. But for a company that often prides itself on groundbreaking transformations, was this launch up to the mark? Navigating Market Challenges The iPhone, a flagship product for the tech giant, accounting for over ... <a title=\"Why Apple&#8217;s iPhone 15 launch isn&#8217;t all it could&#8217;ve been\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apple-iphone-15-launch-not-it-why/\" aria-label=\"More on Why Apple&#8217;s iPhone 15 launch isn&#8217;t all it could&#8217;ve been\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T12:05:08.000Z",
    "title": "Chancer Platform Releases Product Teaser as Presale Rockets Past $1.7M",
    "url": "https://www.crypto-news-flash.com/chancer-platform-releases-product-teaser-as-presale-rockets-past-1-7m/?utm_source=rss&utm_medium=rss&utm_campaign=chancer-platform-releases-product-teaser-as-presale-rockets-past-1-7m",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/chancerpr_1694183508ZB8zrGP2EV.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/chancerpr_1694183508ZB8zrGP2EV.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/chancerpr_1694183508ZB8zrGP2EV-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/chancerpr_1694183508ZB8zrGP2EV-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/chancerpr_1694183508ZB8zrGP2EV-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, September 12th, 2023, Chainwire Chancer has released their first product update, aligning with the exciting vision laid out in their whitepaper. This accompanies the rapid trajectory of the presale raise, which accumulated over $1.7M &#8211; with the few remaining tokens at this stage priced at $0.011 before the raise enters Stage 3 [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T12:00:04.000Z",
    "title": "Rothschild Drops Bombshell: Ripple and XRP Mentioned in Annual Report",
    "url": "https://www.crypto-news-flash.com/rothschild-drops-bombshell-ripple-and-xrp-mentioned-in-annual-report/?utm_source=rss&utm_medium=rss&utm_campaign=rothschild-drops-bombshell-ripple-and-xrp-mentioned-in-annual-report",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />SBI Holdings&#8217; exposure to Ripple’s XRP significantly boosts its performance. Convertible bond market sees a resurgence, offering investors diverse opportunities. SBI and the Ripple Effect SBI Holdings, a leading Japanese financial services company, made headlines in the convertible bond market when it launched a dual-tranche ¥40 billion convertible bonds (CBs) in August 2017. These bonds [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-12T11:41:57.000Z",
    "title": "HIGH POTENTIAL ALTCOIN GEM For 2025 Crypto BULLRUN",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/high-potential-altcoin-gem-for-2025-crypto-bullrun/",
    "description": "<p>Imagine one protocol growing from 3 million to 5 million active accounts in only 14 days. That’s 66% GROWTH in only 2 weeks. But wait! I thought all the crypto headlines outside of Bitcoin were the same. No money in the system. No liquidity. Nothing is growing. Alts look like they are dead. But we [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/high-potential-altcoin-gem-for-2025-crypto-bullrun/\">HIGH POTENTIAL ALTCOIN GEM For 2025 Crypto BULLRUN</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-12T12:01:00.000Z",
    "title": "Ethereum’s (ETH) Weekly Chart Reveals Possible $3K Target",
    "url": "https://coinedition.com/ethereums-eth-weekly-chart-reveals-possible-3k-target/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum’s (ETH) Weekly Chart Reveals Possible $3K Target\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Ethereum-Price-Rebounds-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Breakout patterns on ETH’s weekly chart suggested that the altcoin may rise to $3K in the next few months. If these patterns are validated, the altcoin’s price may enter into a rally between the end of this year and Q1 of 2024. According to CoinMarketCap, ETH’s price dropped 2.40% in the past 24 hours, which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereums-eth-weekly-chart-reveals-possible-3k-target/\">Ethereum’s (ETH) Weekly Chart Reveals Possible $3K Target</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-12T11:45:54.000Z",
    "title": "Crypto Investor Chris Burniske Predicts ‘Santa Clause Rally’ Before Fed Cuts Rates in 2024",
    "url": "https://dailyhodl.com/2023/09/12/crypto-investor-chris-burniske-predicts-santa-clause-rally-before-fed-cuts-rates-in-2024/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Santa-Clause-Rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A prominent crypto venture capitalist believes that the digital assets market will likely rally around Christmas time after a tough start to September. Chris Burniske, the founder of Placeholder Capital, tells his 263,400 followers on the social media platform X that his recent prediction of a possible “upside surprise” breakout in crypto is no longer valid [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/12/crypto-investor-chris-burniske-predicts-santa-clause-rally-before-fed-cuts-rates-in-2024/\">Crypto Investor Chris Burniske Predicts ‘Santa Clause Rally’ Before Fed Cuts Rates in 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]