[
  {
    "source": "Decrypt",
    "date": "2023-10-04T18:33:32.000Z",
    "title": "Starbucks Is Selling Pumpkin Spice Latte NFTs—No, Really",
    "url": "https://decrypt.co/200163/starbucks-selling-pumpkin-spice-latte-nfts-no-really",
    "description": "Will Pumpkin Spice Latte aficionados go for $20 NFTs inspired by the popular seasonal drinks? Starbucks is about to find out."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-04T18:26:59.000Z",
    "title": "'He Kept Lying': Prosecutors Unload on Sam Bankman-Fried as Defense Tries to Shift Blame",
    "url": "https://decrypt.co/200161/he-kept-lying-sbf-trial-opening-statements",
    "description": "The DOJ said Sam Bankman-Fried confided in his inner circle about lying to cover his tracks. The defense called transfers to Alameda \"loans.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T18:30:00.000Z",
    "title": "Su Zhu's $36M mansion transformed into eco-farm post-3AC collapse: Report",
    "url": "https://cointelegraph.com/news/su-zhu-36-million-mansion-transformed-ecofarm-post-3ac-collapse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/dbe97aa4-7b7a-4980-a4b3-663ce55212c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The 3AC co-founder purchased the Singaporean bungalow in March 2022, shortly before the hedge fund collapsed. </p>\n                    <p><p>Crypto businessman and fugitive Su Zhu's $36 million luxury real estate in Singapore has been converted into an eco-farm.</p><p>According to recent local media <a href=\"https://mp.weixin.qq.com/s/bbQjpX3xDR_gT1ALGxeSGA\" target=\"_blank\" rel=\"noopener nofollow\">reports</a>, Zhu's residential property in the city-state's upscale Yarwood Avenue has been rebranded as \"Yarwood Homestead\" and operated by Abundant Cities, a company his wife, Evelyn Tao, co-founded.</p><p>Through ecological design and agroecology, the firm transformed the mansion's gardens into a mini farmland, producing vegetables, herbs, fruits, fish, and poultry. In addition, the bungalow's front lawn has been reworked into 36 vegetable gardens, growing okra, spinach, beans, kale, sesame seeds, and radishes. As for the swimming pool, it is now a natural pond containing aquatic plants, streams, and various fish and shrimp. The farm hosts a variety of on-site private gatherings. </p><p>Zhu and his spouse purchased the property in March 2022 for $36 million, shortly before his Singaporean hedge fund, Three Arrows Capital (3AC), collapsed. During the height of the crypto bull market, 3AC reportedly managed over $10 billion in digital assets. The firm filed for bankruptcy in July 2022 following a series of failed leveraged bets on the Terra Luna ecosystem and faces up to $3.5 billion in creditor claims.</p><p>On September 29, Cointelegraph reported that Su Zhu was arrested at Singapore's Changyi International Airport while <a href=\"https://cointelegraph.com/news/3ac-su-zhu-arrested-in-singapore\">attempting to leave the country </a>after a court granted a committal order. A few days prior, Teneo, 3AC's liquidator was granted its committal request in Singapore, claiming Zhu failed to comply with a court order relating to the recovery of corporate assets. Zhu was sentenced to four months in prison for the violation.</p><p>His co-founder, Kyle Davies, a former U.S. citizen who is now a Singaporean national, was also committed to four months in prison. However, Davies' whereabouts remain unknown. Earlier this year, Davies publicly <a href=\"https://www.coindesk.com/business/2023/03/13/three-arrows-capital-co-founder-kyle-davies-no-pending-lawsuits-or-regulatory-action/\" target=\"_blank\" rel=\"noopener nofollow\">boasted</a> that there were no \"pending lawsuits or regulatory action\" against him at the time. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a7b9964e-4ddb-41f5-a0a1-e0c68d0e89b5.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The Yarwood Homestead \"Tropical R&amp;D Site\".  Source: Abundant Cities</em></figcaption></figure><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/china-dev-fined-salary-vpn-10m-ecny-airdrop-asia-express/\">China dev fined 3 yrs’ salary for VPN use, 10M e-CNY airdrop</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-04T18:11:03.000Z",
    "title": "Elon Musk Believes Fiat Money is a Scam",
    "url": "https://cryptobriefing.com/elon-musk-believes-fiat-money-scam/?utm_source=feed&utm_medium=rss",
    "description": "Elon Musk recently called fiat currencies a \"scam\" on Twitter, despite his platform X planning fiat money transfers."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-04T18:17:28.000Z",
    "title": "MEXC Ventures Makes Eight-Figure Investment in Toncoin and Launches Strategic Partnership With TON Foundation",
    "url": "https://www.cryptoglobe.com/latest/2023/10/mexc-ventures-makes-eight-figure-investment-in-toncoin-and-launches-strategic-partnership-with-ton-foundation/",
    "description": "Zug, Switzerland, October 4th, 2023, Chainwire MEXC Ventures, a subsidiary of MEXC’s global cryptocurrency exchange MEXC, has announced a significant investment in The Open Network, the largest layer-1 investment the firm has ever made. This investment works alongside a strategic partnership with The Open Network (TON) Foundation. This symbiotic partnership represents the shared vision of both […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T18:32:00.000Z",
    "title": "Binance CEO CZ’s Refusal of FTX’s $40 Million Proposal Revealed in Latest Book",
    "url": "https://www.cryptopolitan.com/czs-refusal-of-ftxs-40-million-proposal/",
    "description": "In Michael Lewis&#8217;s latest book, &#8220;Going Infinite: The Rise and Fall of a New Tycoon,&#8221; a fascinating chapter unfolds, shedding light on a pivotal moment in the crypto world. Back in March 2019, Binance CEO Changpeng &#8220;CZ&#8221; Zhao rejected a $40 million proposal from former FTX CEO Sam Bankman-Fried (SBF) for a futures crypto exchange. ... <a title=\"Binance CEO CZ&#8217;s Refusal of FTX&#8217;s $40 Million Proposal Revealed in Latest Book\" class=\"read-more\" href=\"https://www.cryptopolitan.com/czs-refusal-of-ftxs-40-million-proposal/\" aria-label=\"More on Binance CEO CZ&#8217;s Refusal of FTX&#8217;s $40 Million Proposal Revealed in Latest Book\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T18:14:49.000Z",
    "title": "El Salvador’s Pioneering Bitcoin Mining Pool Powered by Volcano Energy and Luxor",
    "url": "https://www.cryptopolitan.com/el-salvadors-pioneering-bitcoin-mining/",
    "description": "El Salvador, a pioneer in embracing Bitcoin as a national currency, has taken a significant step forward in its ambitious renewable energy Bitcoin mining project. In a groundbreaking development, the country has officially launched its first local Bitcoin mining pool, marking a crucial milestone in its quest to harness the power of renewable energy for ... <a title=\"El Salvador&#8217;s Pioneering Bitcoin Mining Pool Powered by Volcano Energy and Luxor\" class=\"read-more\" href=\"https://www.cryptopolitan.com/el-salvadors-pioneering-bitcoin-mining/\" aria-label=\"More on El Salvador&#8217;s Pioneering Bitcoin Mining Pool Powered by Volcano Energy and Luxor\">Read more</a>"
  }
]