[
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T15:15:00.000Z",
    "title": "Energy Web X Taps Into The Polkadot Blockchain",
    "url": "https://cryptodaily.co.uk/2023/06/energy-web-x-taps-into-the-polkadot-blockchain",
    "description": "<p>Energy Web will leverage Polkadot&rsquo;s interoperable multichain technology to bring decarbonization to Web3.</p>\n<p>Energy Web, the world&rsquo;s largest ecosystem of companies using open source, decentralized technologies to accelerate the energy transition, is coming to Polkadot, the next-generation blockchain network powering the movement for a better web.</p>\n<p>The move will allow Energy Web to create the framework for a new technology, dubbed &lsquo;Energy Web X&rsquo;, which will help its partners, including major players such as Shell, Vodafone, Volkswagen, and RMI - accelerate their decarbonization strategies.&nbsp;&nbsp;</p>\n<p>Having developed digital solutions with dozens of major energy companies and non-profit organizations from over 25 countries, Energy Web is focused on two key areas:</p>\n<p>Firstly, Energy Web wants to help electric utilities digitize and integrate distributed energy resources into the grid.</p>\n<p>Secondly, Energy Web aims to bring deep transparency and verifiability to emerging green product supply chains &ndash; including 24/7 matched renewable electricity, sustainable aviation fuel, and sustainably produced Bitcoin.</p>\n<p>Jesse Morris, CEO of Energy Web, commented:</p>\n\n<p>&ldquo;Energy Web and our global enterprise partners are collectively on a mission to make clean energy an integral and widely-accessible part of the global electricity system. To achieve this important goal, we decided to search for a blockchain platform that offers real enterprise-grade security and seamless upgradeability to ensure a safe and future-proof environment.</p>\n<p>Polkadot excels on both of these fronts with its shared security model and best-in-class core technology. We couldn&rsquo;t be more excited to build out the energy transition vertical on Polkadot.&rdquo;&nbsp;</p>\n\n<p>Adding:</p>\n\n<p>&ldquo;Energy Web X will be based on worker node networks. Each of these is a decentralized group of computers jointly executing sensitive business processes that involve or impact multiple companies. Enterprises will be able to deploy thousands of independent worker nodes, coordinate them in cohesive networks, and allow the public to verify the results of their work.&rdquo;</p>\n\n<p>Bj&ouml;rn Wagner, CEO of Parity Technologies, a leading contributor to the Polkadot network, said:</p>\n\n<p>&ldquo;The energy transition vertical is a perfect use case to take advantage of the benefits of blockchain technology, and it&rsquo;s a space where Polkadot is well positioned to be a market leader. We&rsquo;re especially pleased to see Polkadot bring competitive advantages to initiatives and enterprises making a positive environmental and social impact.</p>\n<p>In choosing to build a custom Polkadot parachain, Energy Web will get the performance and security its industry partners require and faster time to market and access to Polkadot&rsquo;s best-in-class interoperability. I&rsquo;m excited to partner with the Energy Web team to accelerate the transition to clean energy.&rdquo;</p>\n\n<p>Energy Web will launch a bid for a parachain slot on Polkadot to build a thriving ecosystem focused on the global energy transition. Further details about Energy Web X&rsquo;s plans will be revealed at Polkadot Decoded, the network&rsquo;s flagship summit, in Copenhagen, June 28-29.</p>\n<p>Ana Trbovich, vice chair of the Energy Web Foundation, will also appear on a regulatory panel at the event.</p>\n<p>The announcement comes soon after other big names from the music, gaming and accounting industries joined the Polkadot blockchain. The Energy Web X parachain will join the many other projects built on the Polkadot Relay Chain. By the end of Q1, 42 parachains had joined Polkadot, representing sectors such as decentralized finance (DeFi), privacy, social media, sustainability, NFTs, gaming, and the metaverse. Many of these parachains are platforms in themselves, collectively hosting hundreds of Web3 applications.</p>\n<p>Parachains help projects expand at scale by leveraging each other&rsquo;s strengths to unlock new use cases and enjoy the shared security advantages provided by Polkadot.</p>\nAbout Energy Web\n<p>Energy Web is a global non-profit on a mission to accelerate the transition to cleaner, more renewable energy sources by developing and deploying open-source Web3 technologies that help companies unlock business value from clean and distributed energy resources. It has partnerships with Shell, Engie, Elia Group, Singapore Power Group, and AEMO.</p>\nAbout Polkadot\n<p>Polkadot is a network that provides the technical advances necessary to make blockchain technology practical, accessible, scalable, interoperable and future-proof. It removes limitations and barriers to entry and fuels innovation, growing the decentralized technology space and bringing the Web3 vision to life.</p>\nAbout Parity Technologies\n<p>Parity Technologies has offices in Berlin, London and Lisbon, staffed by some of the world&rsquo;s leading blockchain innovators, core engineers, Rust developers, and solutions architects. It launched Polkadot in tandem with Web3 Foundation in May 2020 and continues to support and develop the network.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T15:36:28.000Z",
    "title": "Binance Brazil faces probe as parliament asks its director to testify",
    "url": "https://www.cryptopolitan.com/binance-brazil-parliament-director-testify/",
    "description": "Congressman Alfredo Gaspar, a member of the Parliamentary Commission of Inquiry (CPI) on Financial Pyramids, has formally requested the summoning of Guilherme Haddad, the Director of Binance Brazil, to appear before the Brazilian parliament. The inquiry aims to investigate alleged pyramid schemes operating in the country. Gaspar’s request, published on Wednesday, June 21, awaits the ... <a title=\"Binance Brazil faces probe as parliament asks its director to testify\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-brazil-parliament-director-testify/\" aria-label=\"More on Binance Brazil faces probe as parliament asks its director to testify\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T15:25:33.000Z",
    "title": "Xapo bank makes waves in India, pioneering cryptocurrency banking services",
    "url": "https://www.cryptopolitan.com/xapo-bank-makes-waves-in-india-pioneering-cryptocurrency-banking-services/",
    "description": "Gibraltar-based cryptocurrency bank, Xapo Bank, has set its sights on the vast Indian market, announcing plans to provide banking and cryptocurrency services in the country. With a population of over 1.3 billion, India presents an immense opportunity for Xapo Bank, backed by notable investors, including SoftBank, DST Global, and Ribbit Capital. The move comes when ... <a title=\"Xapo bank makes waves in India, pioneering cryptocurrency banking services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xapo-bank-makes-waves-in-india-pioneering-cryptocurrency-banking-services/\" aria-label=\"More on Xapo bank makes waves in India, pioneering cryptocurrency banking services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T15:22:54.000Z",
    "title": "Shibarium Zoomed Out upgrade by Shytoshi stirs excitement in the Shiba Inu community",
    "url": "https://www.cryptopolitan.com/shiba-inu-zoomed-out-upgrade-by-shytoshi/",
    "description": "Shytoshi Kusama, the creator of the renowned memecoin Shiba Inu, has recently published a substantial update that provides the dog community with a great deal of thrilling news. The update contains information regarding Shibarium, the introduction of authenticated collectibles (Shibacals), and the forthcoming World Paper. In this update, the Shiba team discusses its vision for ... <a title=\"Shibarium Zoomed Out upgrade by Shytoshi stirs excitement in the Shiba Inu community\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-zoomed-out-upgrade-by-shytoshi/\" aria-label=\"More on Shibarium Zoomed Out upgrade by Shytoshi stirs excitement in the Shiba Inu community\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T15:21:37.000Z",
    "title": "OPTI surges 38.6% after Elon Musk’s mention of ‘Optimus’ in tweet",
    "url": "https://crypto.news/opti-surges-38-6-after-elon-musks-mention-of-optimus-in-tweet/",
    "description": "On June 21, Elon Musk sent out a tweet stating Optimus (OPTI) will come in many forms."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T15:11:14.000Z",
    "title": "Huobi founder files lawsuit for trademark infringement",
    "url": "https://crypto.news/huobi-founder-files-lawsuit-for-trademark-infringement/",
    "description": "Li Lin's company, X-Spot Co. Limited, has taken legal action against Huobi Global, filing a trademark infringement lawsuit in the High Court of Hong Kong."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T15:30:27.000Z",
    "title": "PEPE Surges By 34% Amid General Market Recovery",
    "url": "https://www.newsbtc.com/analysis/pepe/pepe-surges-by-34-amidst-general-market-recovery/",
    "description": "Meme season sensation Pepecoin (PEPE) has gained by 34.23% in the last day as the crypto market maintains its Bitcoin-fuelled recovery. According to data from CoinMarketCap, PEPE&#8217;s impressive price movement has allowed the token to emerge as the top gainer of the day, outperforming the likes of Conflux (CFX) and Stacks (STX) who have held the headlines in recent days.  PEPE initially began the week slowly, showing no significant price movement on Monday, June 19,  as it hovered around the price region of $0.000000922. Thereafter, the meme token recorded a slight price gain before hitting a resistance level at 0.00000107 on June 20. Following some sideways movements, PEPE resumed its bullish course to trade as high as $0.00000154 today for the first time since last month. In the last two days, the PEPE has jumped by over 61% in market price. At the time of writing, Pepecoin is trading at $0.00000148, gaining by 3.54% in the last hour based on CoinMarketCap data. The token’s daily trading volume is also up by 253.38%, sitting at $694 million.  Related Reading: Crypto Market Sees Liquidations Over $260 Million Amid Bitcoin’s Leap Above $30,000 That said, PEPE’s market cap drifts around $579 million, allowing it to retain its position as the 3rd largest meme coin in the market.  Could PEPE’s Market Struggles Be Over?  Following its launch in April, PEPE took the crypto world by storm, surging by over 2,000% to become the “undisputed king of the meme season.” However, PEPE soon fell from its sturdy heights sliding by 78% off its all-time high value &#8211; 0.00000435 &#8211; attained in May. After its market surge today, it appears that PEPE may be on its way back up to this level. Although it is still too early to tell.  Based on PEPE’s 1-hour chart, its Relative Strength Index (RSI) shows the token has just left the overbought zone, indicating the bullish momentum may be over and a bearish trend lies on the horizon.  Furthermore, the Moving Average Convergence Divergence (MACD) has crossed below the signal line, which is also considered a bearish signal. Looking at the PEPE’s price action, the token continues to hover around the key resistance level of 0.00000146. If the buying pressure increases and PEPE manages to break through this threshold, it could be back on its bullish course. That said, if the resistance zone holds strong and PEPE fails to break out, this may confirm the initial bearish prediction.  PEPE Trading At $0.0000014554 &#124; Source: PEPEUSD Chart on Tradingview.com The Crypto Market Recovery Continues Aside from Pepecoin, the majority of the crypto market is on an uptrend, with the total market cap boosting by 3.5% in the last day based on data from Coingecko.  Related Reading: When BlackRock Bitcoin ETF? Detailed Timeline And Implications This significant influx of capital could possibly be due to the interest generated by the recent Bitcoin ETF filings by many prominent traditional finance companies, most notably BlackRock.  Market leader Bitcoin (BTC) is up by 3.2%, with Ethereum (ETH) gaining by 3.0% in the last day.  Meanwhile, other notable assets such as Dogecoin (DOGE), Cardano (ADA), and Polygon (MATIC) are also on the upswing surging by 2.8%, 5.2%, and 4.1%, respectively.  Featured: Telegraph India, Chart from Tradingview."
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-22T15:11:07.000Z",
    "title": "AlterVerse Launches First Conversational AI NPCs",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/alterverse-launches-first-conversational-ai-npcs/",
    "description": "<p>AlterVerse has launched conversational AI companions as part of its ongoing Sky City Beta sessions. This world and game creation platform is backed by Binance Labs, Polygon Ventures, and incubated by Altcoin Buzz Labs. Let&#8217;s discover more about AI NPCs, what are their use cases, and more.  What are AI NPCs? Powered by Convai, an NVIDIA [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/alterverse-launches-first-conversational-ai-npcs/\">AlterVerse Launches First Conversational AI NPCs</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-22T15:25:00.000Z",
    "title": "Renowned Lawyer Claims SEC is Likely to Win All Crypto Cases",
    "url": "https://coinedition.com/renowned-lawyer-claims-sec-is-likely-to-win-all-crypto-cases/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"U.S. Parliament Summons SEC Chair Over Role in FTX Investigation\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent interview, Thomas Gorman, Partner at the American law firm Dorsey &#38; Whitney, defended the SEC’s scrutiny of the crypto industry, claiming its lawsuits were all “winnable.” Notably, Gorman specializes in defending SEC investigations and enforcement actions and criminal white-collar securities cases. “I think Gary has a very well-laid-out agenda. People who are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/renowned-lawyer-claims-sec-is-likely-to-win-all-crypto-cases/\">Renowned Lawyer Claims SEC is Likely to Win All Crypto Cases</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]