[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T10:25:34.000Z",
    "title": "EU Lawmakers Call to Reduce Tech Dependency on Other Countries With Metaverse Strategy",
    "url": "https://www.coindesk.com/policy/2023/11/28/eu-lawmakers-call-to-reduce-tech-dependency-on-other-countries-with-metaverse-strategy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The European Parliament's Committee on Internal Market and Consumer Protection calls for the bloc to shape virtual worlds according to EU values."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T10:26:59.000Z",
    "title": "Spanish citizens to declare foreign crypto holdings by the end of March",
    "url": "http://cointelegraph.com/news/spanish-citizens-declare-foreign-crypto-holdings-end-march",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6ebf8345-66ed-45fa-a92c-183dd6983f34.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Only individuals with balance sheets exceeding the equivalent of 50,000 euros  in crypto assets are obliged to declare their foreign holdings.</p>\n                    <p><p>Spanish residents holding any crypto assets on non-Spanish platforms will have to declare them by March 31, 2024 under new laws governing the taxation of virtual assets. </p><p>The Spanish Tax Agency (AEAT) has published <a href=\"https://sede.agenciatributaria.gob.es/Sede/procedimientoini/GI55.shtml\" target=\"_blank\" rel=\"noopener nofollow\">Form 721</a>, a tax declaration form for virtual assets abroad, first announced in the Official State Gazette on July 29, 2023. </p><p>The submission period for Form 721 declaration will commence on Jan.1, 2024, and end on the last day of March. Individual and corporate taxpayers must declare the amount of funds stored on their crypto accounts abroad as of Dec. 31. </p><p>However, only individuals with balance sheets exceeding the equivalent of 50,000 euros (around $55,000) in crypto assets are obliged to declare their foreign holdings. Those who store their assets in self-custodied wallets must report their holdings through the standard wealth tax form, Form 714. </p><p>The AEAT has recently been <a href=\"https://cointelegraph.com/news/spanish-tax-agency-to-send-over-328k-notices-to-crypto-holders\">increasing its efforts</a> to charge the local holders of crypto assets. In April 2023, it dispatched 328,000 warning notices to those who didn’t pay their taxes on crypto for the 2022 fiscal year. The number of notices increased by 40% annually, with 150,000 warnings in 2022. In 2021, there were only 15,000 notifications. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/survey-65-percent-spaniards-not-interested-in-digital-euro\"><strong><em>Survey: 65% of Spaniards aren’t interested in using digital euro</em></strong></a></p><p>The country is<a href=\"https://cointelegraph.com/news/spain-implement-mica-six-months-before-july-2026-deadline\"> trying to move proactively</a> with a variety of regulations to govern crypto. In October, the Spanish Ministry of Economy and Digital Transformation reported that the first comprehensive European Union crypto framework, the Markets in Crypto-Assets (MiCA) Act, will come into force nationally in December 2025, six months ahead of the official deadline. </p><p>In November, the principal financial regulator in Spain, the National Securities Market Commission (CNMV), <a href=\"https://cointelegraph.com/news/spanish-regulators-precedent-crypto-ad-violations-case\">opened its first case</a> against a technology provider for violating crypto promotion rules in the country. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/use-case-ai-crypto-money-payments/\"><strong><em>Real AI use cases in crypto, No. 1. The best money for AI is crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T10:14:28.000Z",
    "title": "Binance, CZ paid for defying financial, political status quo: Arthur Hayes",
    "url": "http://cointelegraph.com/news/binance-cz-challenged-financial-systems-says-arthur-hayes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/439c4b9b-9223-4266-9ba7-c640a94ef5bd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Global cryptocurrency exchange Binance paid one of the largest corporate fines in history for challenging the financial and political status quo in America, according to Arthur Hayes.</p>\n                    <p><p>The explosive growth and success of Binance outside of the control of traditional financial and political establishments led to heavy-handed enforcement actions against the exchange, according to former BitMEX CEO Arthur Hayes. </p><p>Hayes delved into the recent <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">$4.3 billion settlement</a> paid out by Binance in a lengthy Substack <a href=\"https://cryptohayes.substack.com/p/panda-power\" target=\"_blank\" rel=\"noopener nofollow\">blog</a>. This comes after the exchange and its founder, Changpeng “CZ” Zhao, admitted to violating United States laws around money laundering and terror financing.</p><p>As Hayes highlights, CZ’s global exchange became the largest by trading volume in the six years since its inception in 2017. The former BitMEX CEO points out that Binance would also be rated in the top 10 traditional exchanges by average daily volume, which is indicative of its growing influence on a global scale.</p><p>“The problem for the financial and political establishment was that the intermediaries facilitating flows into and out of the industrial revolution named blockchain were not run by members of their class,” Hayes opined.</p><h2>Binance challenged the status quo</h2><p>The former BitMEX CEO, who <a href=\"https://cointelegraph.com/news/arthur-hayes-to-serve-2-year-probation-owning-up-to-bitmex-s-aml-mishap\">himself fell foul</a> of violating United States Bank Secrecy Act (BSA) regulations after the exchange <a href=\"https://www.justice.gov/usao-sdny/pr/founders-cryptocurrency-exchange-plead-guilty-bank-secrecy-act-violations\" target=\"_blank\" rel=\"noopener nofollow\">failed to implement</a> adequate KYC procedures, highlighted Binance’s role in allowing everyday people to own intermediaries and cryptocurrency assets without needing traditional players.</p><blockquote>“Never before had people been able to own a piece of an industrial revolution in under ten minutes via desktop and mobile trading apps.”</blockquote><p>Hayes adds that from a fundamental standpoint, centralized exchanges used tools of the state, the company and legal structures to “disintermediate the very institutions that were supposed to run the global financial and political system\".</p><blockquote> “How dearly did CZ pay? CZ – and by extension, Binance – paid the largest corporate fine in Pax Americana history.”</blockquote><p>Hayes then makes reference to a number of high profile mainstream banking scandals as well as the <a href=\"https://www.britannica.com/money/topic/financial-crisis-of-2007-2008\" target=\"_blank\" rel=\"noopener nofollow\">2008 global financial crisis</a> and subsequent ‘Great Recession’ which was directly attributed to the collapse of the U.S. housing market.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The US and China are kinda sorta friends again. How does this new found love translate into stacking sats? Read &quot;Panda Power&quot; for my take. Bonus feature: a small riff on the <a href=\"https://twitter.com/hashtag/BENANCE?src=hash&amp;ref_src=twsrc%5Etfw\">#BENANCE</a> situation.<a href=\"https://t.co/ohSBPPhJyz\">https://t.co/ohSBPPhJyz</a> <a href=\"https://t.co/vKBPjMZ0Ce\">pic.twitter.com/vKBPjMZ0Ce</a></p>&mdash; Arthur Hayes (@CryptoHayes) <a href=\"https://twitter.com/CryptoHayes/status/1729341960459063572?ref_src=twsrc%5Etfw\">November 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the majority of these instances, mainstream banking and financial institutions were largely absolved, or held to limited accountability. On the flip side, CZ and Binance were hammered hard by the U.S. department of justice:</p><blockquote>“Obviously, the treatment of CZ and Binance is absurd, and only highlights the arbitrary nature of punishment at the hands of the state.”</blockquote><p>Hayes then delves deeply into the intricacies of the current state of the U.S. and Chinese economies and how the latter could drive massive inflows of capital into Bitcoin in the next few years.</p><h3>Capital making its way from China to Bitcoin</h3><p>The former BitMEX CEO suggests that Chinese state-owned enterprises, manufacturers and investors are set to begin investing capital offshore due to a lack of attractive returns locally. </p><p>Quoting Peking University professor and former Bear Stearns trader Michael Pettis, Hayes writes that China cannot profitably absorb more debt due to the fact that investments do not yield returns that exceed the debt’s rate of interest. </p><p>“It gets punted in the financial markets instead. Capital, by which I mean digital fiat credit money, is globally fungible. If China is printing yuan, it will make its way into the global markets and support the prices of all types of risk assets,” Hayes explains.</p><p>Hong Kong’s recent approval of a handful of licensed cryptocurrency exchanges and brokers means that Chinese companies and individual investors have a means to purchase Bitcoin. </p><p>Given that China was once a powerhouse Bitcoin mining nation, Hayes suggests that many Chinese investors are well acquainted with the asset and its “promise as a store of value” and will </p><blockquote>“If there is a way to legally move cash from the Mainland to Hong Kong, Bitcoin will be one of many risk assets that will be purchased.”</blockquote><p>From a macro perspective, Hayes outlines an argument for China increasing the availability and affordability of Yuan-based credit locally. This in effect may lead to the price of Dollar-based credit to fall given that Chinese companies have an affordable domestic option. </p><blockquote>“Given that the dollar is the world’s largest funding currency, if the price of credit falls, all fixed supply assets like Bitcoin and gold will rise in dollar fiat price terms.”</blockquote><p>Hayes adds that the “fungible nature of global fiat credit” will lead to dollars flowing into hard monetary assets like Bitcoin.</p><p><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>Magazine: The truth behind Cuba’s Bitcoin revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T10:10:07.000Z",
    "title": "Buterin sees benefit of ‘uploading’ minds and need for open-source innovation in AI",
    "url": "https://cryptoslate.com/buterin-sees-benefit-of-uploading-minds-and-need-for-open-source-innovation-in-ai/",
    "description": "<p>In a recent blog post, Ethereum co-founder Vitalik Buterin presents his views on an ongoing debate around &#8220;techno-optimism.&#8221; The post was notably sparked by Marc Andreessen&#8217;s &#8220;Techno-Optimist Manifesto,&#8221; which advocates for an enthusiastic embrace of technology, markets, and capitalism as tools to propel humanity toward a brighter future. Andreessen&#8217;s manifesto firmly opposes what he terms [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/buterin-sees-benefit-of-uploading-minds-and-need-for-open-source-innovation-in-ai/\">Buterin sees benefit of &#8216;uploading&#8217; minds and need for open-source innovation in AI</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T10:13:53.000Z",
    "title": "Australian crypto exchange Swyftx taps TRM Labs to combat fraudsters",
    "url": "https://crypto.news/australian-crypto-exchange-swyftx-taps-trm-labs-to-combat-fraudsters/",
    "description": "As crypto losses keep surging, Australian crypto exchange Swyftx tapped TRM Labs to clamp down on scammers. Australian cryptocurrency exchange Swyftx has signed a collaboration agreement with TRM Labs, a blockchain forensic firm, in a bid to clamp down on&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T10:20:05.000Z",
    "title": "Institutional Investors Pour $346 Million Into Crypto – Here Are The Winners",
    "url": "https://www.newsbtc.com/crypto/institutional-investors-346-million-crypto/",
    "description": "Crypto investment products have experienced another week of inflows, bringing the run to nine consecutive weeks of inflows. According to CoinShares&#8217; latest report on digital asset investment funds, inflows into crypto products totaled $346 million last week, with some cryptos receiving more investments than others.  With last week’s numbers, the total value of inflows into crypto investment funds this year now stands at $1.663 billion. Overview Of Institutional Investment In Crypto This Week Although volatile and still in its nascent phase, the crypto market has attracted its fair share of rich visionaries and institutional traders. While companies like MicroStrategy and Tesla are investing on the spot end of things by buying crypto assets, others are getting exposure to assets through exchange-traded products (ETPs). This is particularly good, as institutional backing in ETPs also brings more stability and legitimacy to the space. Related Reading: Ripple IPO May Be Delayed, Crypto Pundit Gives Reasons Why According to CoinShares, Bitcoin has attracted most of the inflows. Bitcoin has been in the spotlight for the past few months, particularly with Spot Bitcoin ETFs waiting to be approved in the US.  Bitcoin ETPs received a total of $312 million in new inflows last week, bringing its total inflows this year to $1.55 billion. At the same time, Ethereum ETPs witnessed an inflow of $33.5 million, a 915% increase from the previous week&#8217;s inflows of $3.3 million.  Solana ETPs on the other hand, saw an inflow of $3.5 million, a 74% drop from the previous week&#8217;s inflow of $13.6 million. Polkadot and Chainlink also saw inflows of $0.8 million and $0.6 million respectively. On the other hand, short Bitcoin products had outflows of $0.9 million last week, a third consecutive week of outflows. What Is Driving The Institutional Interest? Institutional investments in digital asset products are now at the highest point since the bull market in late 2021. According to CoinShares, the total assets under management (AuM) are now at $45.3 billion. Most of the momentum for this surge came after the announcement of applications of spot Bitcoin ETFs in the US.  Applications of spot Ethereum ETFs joined the list last week, spiking the flurry of inflows into Ethereum ETPs last week to extend a positive four-week run of $103 million. Related Reading: Road To $1: Why Did Terra Classic (USTC) Rise 300% In One Day? ETPs are still one of the best ways for institutional investors to get exposure to cryptocurrencies like Bitcoin and Ethereum. Their use has been on the rise in recent months, and ETP volumes as a percentage of total spot Bitcoin reached 18% last week.  This is poised to change soon when spot ETFs are approved and institutional investors have another way to get exposure to Bitcoin. Experts say the first approval for spot ETFs could come early in 2024. BTC price jumps above $37,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Kanakkupillai, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T10:38:16.000Z",
    "title": "IMF in Panic Mode as Ripple’s XRP and Bitcoin (BTC) Gains Favor Over CBDCs: The Battle for Financial Freedom",
    "url": "https://www.crypto-news-flash.com/imf-in-panic-mode-as-ripples-xrp-and-bitcoin-btc-gains-favor-over-cbdcs-the-battle-for-financial-freedom/?utm_source=rss&utm_medium=rss&utm_campaign=imf-in-panic-mode-as-ripples-xrp-and-bitcoin-btc-gains-favor-over-cbdcs-the-battle-for-financial-freedom",
    "description": "<img width=\"2560\" height=\"1348\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC-1024x539.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC-768x404.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC-1536x809.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC-2048x1078.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/CBDC-351x185.jpg 351w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />IMF Director Kristalina Georgieva emphasizes the need to guide CBDC implementations, acting as a catalyst for safety, efficiency, and countering fragmentation. Despite efforts to promote CBDC adoption, countries with CBDCs face limited uptake. The IMF warns that a lack of CBDC consensus could lead to increased cryptocurrency adoption. IMF Officials have made aggressive efforts in [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-28T10:33:54.000Z",
    "title": "Top 5 Mind-Blowing AI Crypto Projects",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-mind-blowing-ai-crypto-projects/",
    "description": "<p>Artificial Intelligence (AI) made an entrance with an impact on a global level. This included the crypto space. As a result, AI is set to change and influence the crypto space. For example, worldwide investment in AI by 2025 should be around $200 billion. Let&#8217;s discover more about these AI crypto projects that could do [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-mind-blowing-ai-crypto-projects/\">Top 5 Mind-Blowing AI Crypto Projects</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-28T10:15:05.000Z",
    "title": "100 Biggest Tether Whales Add $1,670,000,000 in USDT in Six Months, Says Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/11/28/100-biggest-tether-whales-add-1670000000-in-usdt-in-six-months-says-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Biggest-Tether-Whales-Add.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Leading crypto analytics firm Santiment says that the largest Tether whales have been gobbling up the stablecoin USDT in the past six months. Santiment notes that the top 100 USDT addresses have added $1.67 billion worth of the top stablecoin by market cap over a six-month period, indicating a nearly 10% rise in buying power. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/28/100-biggest-tether-whales-add-1670000000-in-usdt-in-six-months-says-analytics-firm-santiment/\">100 Biggest Tether Whales Add $1,670,000,000 in USDT in Six Months, Says Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]