[
  {
    "source": "Cointelegraph",
    "date": "2023-11-11T02:41:26.000Z",
    "title": "Ethics watchdog rats out Circle for links to Tron in letter to Sens. Warren, Brown",
    "url": "http://cointelegraph.com/news/ethics-watchdog-rats-out-circle-for-links-to-tron-in-letter-to-sens-warren-brown",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/79d2577f-1b7e-46a0-ae01-a0deeba8ee53.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Campaign for Accountability wanted to let the anti-crypto senators know that the threat of terrorist financing with crypto was worse than they thought.</p>\n                    <p><p>Nonprofit ethics group Campaign for Accountability (CfA) sent a letter to U.S. Senators Elizabeth Warren and Sherrod Brown on Nov. 9 to present them with information on the alleged use of cryptocurrency in money laundering. The letter discussed the Tron blockchain and stablecoin issuer Circle in particular.</p><p>In the letter signed by CfA executive director Michelle Kuppersmith, it is alleged that USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) issuer Circle has extensive ties to both Justin Sun’s Tron Foundation (<a href=\"https://cointelegraph.com/tron-price-index\">TRX</a>) and major Wall Street investors such as Goldman Sachs, Bank of New York Mellon and Blackrock.</p><p>Kuppersmith called Circle’s connections to Wall Street “surprising\" in light of  its supposed lack of regulation and Tron's alleged connections with terrorism financing.</p><p>Tron <a href=\"https://cointelegraph.com/news/sec-files-lawsuit-against-tron-s-justin-sun-and-celebrities-over-crypto-securities-offering\">is under investigation</a> by the U.S. Securities and Exchange Commission for unregistered securities sales and has been linked to the alleged financing of the Palestinian Islamic Jihad and possibly Hamas and Hezbollah, the letter outlined. Meanwhile, it claimed that $400 million worth of USDC is in the Tron ecosystem. The letter <a href=\"https://s3.documentcloud.org/documents/24142841/cfa-senate-banking-11-9-23.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a>:</p><blockquote>“Recently published studies and reports of law enforcement operations indicate a prominent US- based cryptocurrency company backed by major Wall Street investment houses [Circle] may be directly or indirectly compromised by its integration with an Asia-based network of trading platforms and cryptocurrencies.” </blockquote><p>That network, Tron, “has been named in multiple international law enforcement actions involving billions of dollars in transactions by alleged organized crime groups and sanctioned entities.” </p><p>These concerns go beyond the issues raised in the letter the senators, along with over 100 other legislators, sent to the National Security Advisor and Treasury Undersecretary for Terrorism and Financial Intelligence, Kuppersmith added.<strong> </strong>The letter referred to <a href=\"https://cointelegraph.com/news/sen-warren-100-legislators-write-white-house-treasury-crypto-terrorism\">was sent by the bipartisan group</a> of lawmakers on Oct. 17. Crypto advocacy groups <a href=\"https://cointelegraph.com/news/crypto-advocacy-groups-rebuttal-links-terrorism\">took issue with several of the claims</a> made in that letter.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6bc4a68e-43d4-4b3c-afde-68e98f02fbc0.png\"  /><figcaption style=\"text-align: center;\">The CfA letter to Sens. Brown and Warren. Source: CfA</figcaption></figure><p>Furthermore, the letter questions Circle's apparent lack of regulation, and its operation of an <a href=\"https://cointelegraph.com/news/circle-launches-cross-chain-usdc-transfer-protocol-for-ethereum-avalanche\">“unregulated cross chain protocol.”</a></p><p>\"While Goldman, BNY and Blackrock are all registered with and regulated by multiple federal and state banking and securities authorities, Circle has either avoided or failed to subject itself to primary prudential regulation since its founding a decade ago, a concern Campaign for Accountability flagged to the SEC in May of 2022,\" the letter outlines. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\">Binance freezes Hamas-linked accounts after Israeli request</a></em></strong></p><p>On Nov. 10, the CfA also <a href=\"https://s3.documentcloud.org/documents/24142840/cfa-comment-to-financial-crimes-enforcement-network-final-11923.pdf\" target=\"_blank\" rel=\"noopener nofollow\">submitted</a> a comment on the Department of Treasury Financial Crimes Enforcement Network’s October <a href=\"https://cointelegraph.com/news/us-treasury-crypto-mixers-money-laundering\">proposal to designate crypto mixers</a> as money-laundering hubs. </p><p>The proposal “is worthwhile but may soon be obsolete unless the scope of  the regulation is broadened to include newer methods criminal groups have adopted using virtual currencies,” the organization said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Despite being a US company, Circle has either avoided or failed to subject itself to primary or prudential regulation since its founding a decade ago, a concern Campaign for Accountability flagged to the SEC in May of 2022. <a href=\"https://t.co/4s8w98JL8S\">https://t.co/4s8w98JL8S</a></p>&mdash; Campaign for Accountability (@Accountable_Org) <a href=\"https://twitter.com/Accountable_Org/status/1722684343120695783?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the comment, the CfA discusses cross-chain protocols and Sun’s SunSwap decentralized exchange protocol, which blockchain forensics firm Elliptic has identified as “the medium where terrorist organizations obtain the necessary [digital currency].” </p><p>The organization adds that “Sun is reported to have direct ties to the Communist Party of China,” citing a report that Sun participated in a research project at China’s Central Party School.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/justin-suns-sui-farming-sins-pepes-wild-run-3acs-oyster-philosophy-asia-express/\">Justin Sun’s SUI-farming sins, PEPE’s wild run, 3AC’s oyster philosophy: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-11T03:00:00.000Z",
    "title": "Ethereum Whale Could Lose $118 Million Even as ETH Price Breaks $2,000 Mark",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ethereum-whale-could-lose-118-million-even-as-eth-price-breaks-2000-mark/",
    "description": "The price of the second-largest cryptocurrency by market capitalization Ethereum ($ETH) has recently surpassed the $2,000 mark after the world’s largest asset manager moved to launch a spot ETH exchange-traded fund (ETF). Despite the rise, an ETH whale is expected to lose $118 million on its investment. As reported, BlackRock recently registered the iShares Ethereum […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-11T02:45:21.000Z",
    "title": "Bitop Exchange Renews Support for UNHCR Amid Global Refugee Crisis",
    "url": "https://cryptodaily.co.uk/2023/11/bitop-exchange-renews-support-for-unhcr-amid-global-refugee-crisis",
    "description": "Bitop Exchange Renews Support for UNHCR Amid Global Refugee Crisis"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-11T03:00:45.000Z",
    "title": "Ethereum Daily Revenue Soars To A 4-Month High Of $10 Million",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-daily-revenue-soars-to-4-month-high/",
    "description": "When Ethereum (ETH) exploded past $2,000 on November 9, Erik Smith, the Chief Investment Officer of 401 Capital, observed that the platform&#8217;s average daily revenue surged to the highest level in four months. According to data, Ethereum generated $10 million in daily revenue, extending gains registered on the previous day and pushing the metric to the highest point since July. Ethereum Prices Above $2,000, Revenue Rising In November For now, ETH prices remain muted but are trading around November 9 highs and remain within a bullish formation backed by decent trading volumes. Prices are still trending above the $2,000 psychological support, a critical reaction level. A look at the Ethereum candlestick arrangement in the daily chart shows that while there is a notable spike in daily revenue, prices are still below July 2023 highs. Then, the coin soared to as high as $2,100 before pulling back as the momentum triggered by the broader crypto&#8217;s expectation of a Bitcoin Exchange-Traded Fund (ETF) approval faded. However, prices have since sharply recovered, adding roughly 40% from October lows and shaking off the weakness registered on August 17 when the coin plunged by 14%. Related Reading: $5 Million Reward: Justin Sun’s Bold Move Against Poloniex Attackers Token Terminal data shows that Ethereum&#8217;s daily revenue has steadily risen in the first ten days of November. Looking at trends, the average daily income has doubled from $5 million in the first five days of the month. Usually, an uptick in daily average revenue in a network points to increasing on-chain activity either through smart contract deployment or simple transfers, which necessitates the payment of gas fees.  Improving Scalability In The Long Term How the widespread adoption of Ethereum layer-2 and sidechain scaling solutions will impact the network revenue is not immediately apparent. } What&#8217;s clear is that the more protocols leverage the protocol, deploying multiple solutions, the more revenue the network will generate for validators and stakers. Staking rewards are drawn partly from transaction fees paid as gas, new issuance, and burned miner extractable value (MEV).  Still, the dollar value of ETH minted as revenue depends on spot rates. If the uptrend is sustained, this figure will continue expanding. Even so, there might be more demand for the network, which is still struggling to scale on-chain.  Related Reading: Polygon (MATIC) Poised For A Bullish Surge, Analyst Who Predicted 2021 Fall Says Ethereum 2.0 aims to resolve these challenges in the coming years by increasing the general throughput via solutions like Sharding. Sharding will split Ethereum into small but interconnected networks called shards. Each shard will independently process each set of transactions and maintain its state, allowing the mainnet to scale. Feature image from Canva, chart from TradingView"
  }
]