[
  {
    "source": "Decrypt",
    "date": "2024-01-28T15:44:49.000Z",
    "title": "Bitcoin Ordinals Inscription Marks First Individual Poem Sale by Sotheby's",
    "url": "https://decrypt.co/214475/bitcoin-ordinals-inscription-marks-first-individual-poem-sale-sothebys",
    "description": "Inscribed using Bitcoin Ordinals, Ana Maria Caballero's poem \"Cords\" fetched over $11,000 at auction. She speaks to SCENE about the moment."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-28T15:43:21.000Z",
    "title": "Microsoft’s AI Challenge According to Apple and Samsung",
    "url": "https://www.cryptopolitan.com/microsofts-ai-challenge-to-apple-and-samsung/",
    "description": "In the ever-evolving landscape of technology, brand loyalty plays a pivotal role in consumers&#8217; choices. However, as the world transitions into an era dominated by artificial intelligence (AI), the question arises: will there be brand loyalty when it comes to AI providers? Apple and Samsung&#8217;s recent dominance in various tech categories has left Microsoft pondering [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-28T15:41:14.000Z",
    "title": "Tether Treasury initiates massive transfer of USDT tokens to Bitfinex",
    "url": "https://www.cryptopolitan.com/tether-massive-transfer-of-usdt-bitfinex/",
    "description": "Tether&#8217;s Treasury substantially transferred USDT tokens to the well-known exchange, Bitfinex. The transaction, valued at approximately $229,956,875 at the time of disclosure, involved a staggering 230,000,000 USDT tokens. While not entirely unusual for Tether, this move has drawn considerable attention due to its sheer volume and potential implications for the broader crypto market. Liquidity management [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-28T15:59:00.000Z",
    "title": "KUSAMA PRICE ANALYSIS & PREDICTION (January 28) – KSM Finds Support After 50% Correction, Time For Rebound? ",
    "url": "https://nulltx.com/kusama-price-analysis-prediction-january-28-ksm-finds-support-after-50-correction-time-for-rebound/",
    "description": "The recent correction saw Kusama, KSM through a 50% drop near $33.5 this week, marking its lowest price level in a month. Following a sharp rejection, it bounced slightly and held the weekly low as temporal support. Following last week&#8217;s drop from around $40, KSM crossed over into this week&#8217;s [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-28T15:53:07.000Z",
    "title": "LITECOIN PRICE ANALYSIS & PREDICTION (January 28) – LTC Remains Under Bears’ Radar But Showing Signs Of Strength In The Latest Price Recovery",
    "url": "https://nulltx.com/litecoin-price-analysis-prediction-january-28-ltc-remains-under-bears-radar-but-showing-signs-of-strength-in-the-latest-price-recovery/",
    "description": "Litecoin appeared bearish on the daily chart but has seen little increase in the last 24 hours. After days of consolidation, it found support and now tries to recover some loss. Trading volume currently appears low. This month has been quite horrible for Litecoin following a price crash near the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-28T16:02:40.000Z",
    "title": "Google to tweak crypto ad policy, amplify Bitcoin ETF visibility",
    "url": "https://crypto.news/google-new-ad-policy-boosts-bitcoin-etf-visibility/",
    "description": "Now that the SEC approved 11 spot Bitcoin (BTC) ETFs on Jan. 10, Google is expected to amend its rules and enable asset managers to advertise these products to a broader U.S. audience."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-28T16:00:00.000Z",
    "title": "Analysts bullish on LINK, SOL, and ETH as GFOX presale eyes $4m",
    "url": "https://crypto.news/analysts-bullish-on-link-sol-and-eth-as-gfox-presale-eyes-4m/",
    "description": "Galaxy Fox is targeting $4 million in their GFOX presale. Meanwhile, Chainlink (LINK), Solana (SOL), and Ethereum (ETH) prices are steady and firm"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-28T15:48:44.000Z",
    "title": "Bitcoin could hit $170k post halving, says Anthony Scaramucci ",
    "url": "https://crypto.news/bitcoin-btc-could-hit-170k-post-halving-anthony-scaramucci/",
    "description": "Scaramucci makes a bullish prediction on The Wolf Of All Streets Podcast: 'In the long term, I foresee Bitcoin nearing half of gold's market capitalization.'"
  }
]