[
  {
    "source": "CoinDesk",
    "date": "2023-06-29T11:00:00.000Z",
    "title": "New deBridge Feature Lets Solana Users Easily Access Any Ethereum-Based Blockchain",
    "url": "https://www.coindesk.com/tech/2023/06/29/new-debridge-feature-lets-solana-users-easily-access-any-ethereum-based-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm today launched a tool to allow for limitless information and liquidity transfers between Solana and EVM-based blockchains."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-29T10:47:18.000Z",
    "title": "Bitcoin-Friendly Damus Will Remain on Apple App Store—With ‘Core Feature’ Removed",
    "url": "https://decrypt.co/146687/bitcoin-friendly-damus-will-remain-on-apple-app-store-with-core-feature-removed",
    "description": "Damus, a Bitcoin-friendly social media app, has won a reprieve in its battle to remain in the Apple App Store. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T10:56:26.000Z",
    "title": "Slovakian parliament votes in approval of lower crypto taxes  ",
    "url": "https://cointelegraph.com/news/slovakian-parliament-approvs-lower-crypto-taxes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b2791052-6f08-4340-a4aa-d5cf6802060a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A parliamentary vote held by officials in Slovakia approved an amendment that will reduce the taxation of cryptocurrencies, which is currently on a sliding scale.  </p>\n                    <p><p>Parliament members in the European country of Slovakia voted in approval of lowering crypto taxes, among additional measures affecting cryptocurrency holders. </p><p>On June 28 the Slovakian parliament <a href=\"https://www.nrsr.sk/web/Default.aspx?sid=schodze/hlasovanie/hlasklub&amp;ID=50749\" target=\"_blank\" rel=\"noopener nofollow\">voted</a> to approve an amendment that will reduce personal income tax for profits gained from the sale of cryptocurrencies that have been held by the user for at least a year. </p><p>The taxes will be lowered to 7%, which is a significant decrease from the current taxation sliding scale of either 19% or 25%. Payments received in cryptocurrencies up to 2400 euros - roughly, $2,622.20 - will not be taxed.</p><p>In addition, the bill excludes income in the form of cryptocurrency from a health insurance contribution of 14%. </p><p>According to a <a href=\"https://e.dennikn.sk/minuta/3447018\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from a local Slovakian media outlet, the Ministry of Finance anticipates a financial impact from the amendment to be around 30 million euros per year. </p><p>This amendment comes a few weeks after parliament passed another amendment to the constitution, which <a href=\"https://cointelegraph.com/news/fear-of-digital-euro-prompts-slovakia-to-add-cash-rule-to-constitution\">codified the citizen’s right</a> to use cash as a method of payment in light of talk around a digital euro. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/binance-relists-privacy-coins-in-europe\"><strong><em>Binance reverses decision to delist privacy coins in Europe</em></strong></a></p><p>Slovakia is one of the 27 member states of the European Union, which has been proactively monitoring developments in the crypto industry throughout the region. </p><p>Most recently, the EU signed its landmark <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">Markets in Crypto-Assets (MiCA)</a> regulations into law on May 31. The set of regulations was created with the aim of making Europe a hub for digital asset activity. </p><p>MiCA came on the table back in 2020 and has been <a href=\"https://cointelegraph.com/news/100-teslas-democratize-and-decentralize-web3-ride-sharing\">praised by companies</a> in the space for providing regulatory clarity. </p><p>This is opposed to the situation in other major markets, like the United States, which has yet to implement comprehensive guidelines for the industry. U.S. Republicans proposed a <a href=\"https://cointelegraph.com/news/us-lawmaker-calls-for-info-from-treasury-and-sec-on-crypto-market-structure-bill\">“Digital Asset Market Structure” bill</a>, which is currently under review for its potential impact on the industry. </p><p>On June 29, the U.S. Securities and Exchange Commissioner, Hester Peirce, appeared remotely at Australian Blockchain Week and <a href=\"https://cointelegraph.com/news/hester-peirce-dont-label-all-crypto-financial-asset\">delivered a message reminding regulators</a> that crypto laws shouldn’t assume “everything is a financial asset.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\"><strong><em>Home loans using crypto as collateral: Do the risks outweigh the reward?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T10:44:00.000Z",
    "title": "German regulator reportedly rejects Binance's crypto custody license demand",
    "url": "https://cointelegraph.com/news/germany-rejects-binance-crypto-custody-license-demand",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/15e6173e-8252-4dc2-8de0-2b055bbe2be2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance’s regulatory trouble continues to mount as the exchange faced pushback in Europe after the US. </p>\n                    <p><p>The Federal Financial Supervisory Authority (BaFin), the German financial regulator has reportedly rejected Binance’s crypto custody license application.</p><p>The news was first <a href=\"https://financefwd.com/de/binance-lizenz-deutschland/\" target=\"_blank\" rel=\"noopener nofollow\">reported </a>by Forward Finance citing people familiar with the matter. Later Cointelegraph reached out to Binance to confirm the same and a spokesperson from the firm said that they are “unable to share details of conversations with regulators,” while adding:</p><blockquote>“We continue to work to comply with BaFin‘s requirements. As expected, this is a detailed and ongoing process. We are confident that we have the right team and measures in place to continue our discussions with regulators in Germany.”</blockquote><p>Based on the comments from Binance and the exclusive report, it is unclear whether BaFin has officially rejected Binance’s bid to acquire the license or verbally informed of the same and the exchange may withdraw the license in the near future.</p><p>The reported denial of a custody license hinders Binance’s advertising plans in Germany. As per law, only licensed firms can advertise in the country. However, Binance still remains a large trading platform with a reported 2 million customers.</p><p>Binance’s struggle with regulators continues to mount as the exchange finds itself in regulatory soup quite similar to 2021 when the exchange faced regulatory warnings from more than half a dozen countries. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-australia-new-ceo-takes-aim-regulation-by-enforcement-united-states\"><strong><em>Don’t follow the US: Blockchain Aus CEO hammers ‘regulation by enforcement’</em></strong></a></p><p>After its recent regulatory troubles in the United States, Binance's CEO has proclaimed its focus on the European market and become compliant with the <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">Market’s Crypto Assets (MiCA) regulations</a>. However, just like the U.S., the crypto exchange has faced regulatory pushback in many European countries as well. </p><p>A recent report revealed that the exchange has been under <a href=\"https://cointelegraph.com/news/binance-france-investigation-report\">investigation in France since early 2022</a> on “aggravated money laundering” charges. The exchange had to recently exit the Dutch market after failing to secure a virtual asset service provider license from regulators in the Netherlands. The crypto exchange also applied to <a href=\"https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny\">wind down its services in the United Kingdom</a> and <a href=\"https://cointelegraph.com/news/binance-applies-to-deregister-in-cyprus\">Cyprus.</a></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-city-guide-sydney-harbor-bridge-synthetix-finder/\">Crypto City guide to Sydney: More than just a ‘token’ bridge</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-29T11:00:36.000Z",
    "title": "Mind Network Secures $2․5 Million in Initial Funding From Binance Labs and Other Prominent Venture Capitalists",
    "url": "https://news.bitcoin.com/mind-network-secures-2%e2%80%a45-million-in-initial-funding-from-binance-labs-and-other-prominent-venture-capitalists/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/3c92ae46-bc85-4ce6-8927-164606a1757c.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Mind Network, an innovative platform leading the way in data security and privacy within the Web3 ecosystem, is delighted to announce the successful completion of its initial funding round, raising $2.5 million. Binance Labs, Comma3 Ventures, SevenX Ventures, HashKey Capital, Big Brain Holdings, Arweave SCP Ventures, Mandala Capital, and other notable investors participated [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-29T11:04:51.000Z",
    "title": "Crypto Price Prediction: Traders Are Supporting Golteum (GLTM) Presale To Surpass Lido DAO (LDO) And The Graph (GRT)",
    "url": "https://nulltx.com/crypto-price-prediction-traders-are-supporting-golteum-gltm-presale-to-surpass-lido-dao-ldo-and-the-graph-grt/",
    "description": "In recent times, the DeFi market has witnessed explosive growth, and traders are always on the lookout for the next big thing to continue their profit-booking journey. Currently, that&#8217;s Golteum (GLTM), a multi-asset Web3 trading platform that&#8217;s poised to surpass both Lido DAO (LDO) and The Graph (GRT) in terms of potential and functionality.  Golteum [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-29T10:53:31.000Z",
    "title": "Did You Pass Up Uniswap? Introducing hybrid exchange Tradecurve",
    "url": "https://nulltx.com/did-you-pass-up-uniswap-introducing-hybrid-exchange-tradecurve/",
    "description": "The cryptocurrency market has been renowned for its turmoil, where the values can vary quickly, directly dependent on the state of the market and the rate at which investors buy or sell altcoins. Join us as we explore the current market trends for Uniswap and Tradecurve, a hybrid exchange platform that is currently in its [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T11:00:03.000Z",
    "title": "Ethereum (ETH) Price Drops Due Whale Selling, Key Levels To Watch",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-eth-drops-due-whale-selling-key-levels/",
    "description": "Ethereum (ETH), the second largest cryptocurrency by market cap, experienced a price drop of over 3% within the last 24 hours. The reason is presumably a significant sell-off carried out by a prominent whale. The whale deposited 25,000 ETH (worth around $47.24 million) on Binance, only to withdraw a significant amount of USDT shortly afterwards. As the on-chain data provider Lookonchain reports, the whale has probably already sold a part of his ETH. According to the on-chain data, the whale withdrew 16 million in USDT. &#8220;The drop in ETH price [a few hours] ago was most likely due to the sell-off of this whale,&#8221; the analysts note, further explaining that the whale still owns around 8,000 ETH ($14.7 million) unsold. Nevertheless, ETH bulls continue to show strength. A look at the 1-hour chart of Ethereum reveals that the price has formed a bull flag. In technical analysis, a flag is a short-term consolidation pattern that occurs after a strong price move and indicates a temporary break in the trend. Related Reading: Ethereum Price Grinds Lower As The Bulls Take Back Seat A bullish flag forms during an uptrend with the flagpole pointing upwards, followed by a consolidation phase before a possible continuation of the upward movement. For now, the pattern has held, ETH has bounced up from the 4H 200 EMA at $1,825. In this respect, the bulls remain in control (despite the whale) for the time being. Basically, two scenarios are conceivable. If the aforementioned support levels are broken to the downside, especially the underside of the flag, Ethereum could face a further price decline towards $1,750. Conversely, a breakout from the flag pattern to the upside (around $1,900) could trigger a price rise towards $2,000. Related Reading: Ethereum Poised To Break $2,000 As $12 Million Short Seller Nears Liquidation However, according to analyst Ali Martinez, that&#8217;s where the price will hit Ethereum&#8217;s key supply wall, which is in the $2,000 to $2,060 range, where 832,640 addresses have bought over 26 million ETH. &#8220;If ETH can break through this resistance barrier, we can expect an upswing to $2,330 or even $2,750,&#8221; Martinez believes. Ethereum Options Expiry On Friday Confirms Outlook The most important event this week for Bitcoin, Ethereum and the entire crypto market will be the expiration of over $7 billion in options tomorrow, Friday, June 30. The current options volume on the largest exchange Deribit is 14,107 calls, 9,445 puts and a put-call ratio of 0.67 for Bitcoin. For Ethereum, there are currently 76,776 calls, 39,779 puts and a put-call ratio of 0.52. Options Volume [Deribit]$BTC: 📈Calls=14,107.70, 📉Puts=9,445.50, ⚖️Put-call ratio=0.67 $ETH: 📈Calls=76,776.00, 📉Puts=39,779.00, ⚖️Put-call ratio=0.52 — coinoptionstrack bot (@optionstrackbot) June 29, 2023 A put-call ratio below 1 typically means that the number of call options is higher than the number of put options, which indicates a more bullish market sentiment. In this case, the put-call ratio for ETH is 0.52, which means that there are more call options compared to put options. Thus, the ratio indicates that market participants are more prone to bullish bets on the ETH price. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T10:45:03.000Z",
    "title": "Dogecoin Faces Downward Pressure – Will DOGE Bulls Avert A Further Slide?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-faces-downward-pressure-will-doge-bulls-avert-a-further-slide/",
    "description": "Dogecoin (DOGE) is currently facing a critical juncture in its price movement. The DOGE price is teetering above the last horizontal support level before a potential substantial decline. In order to avoid a steep fall, it is imperative for Dogecoin to muster a decisive bounce at its current level.  However, this task may prove to be challenging as a persistent downtrend, marked by a descending trendline, has been undermining the efforts of buyers to establish a sustained bullish recovery for nearly two months.  Will Dogecoin be able to break free from this downward pressure and embark on a new upward trajectory? A Crucial Juncture For DOGE Price Analyzing the technical aspects of Dogecoin&#8217;s price movement on the weekly time frame reveals a significant decrease at the beginning of June, ultimately reaching the $0.06 horizontal support area. This particular zone holds immense importance as it has remained intact for an impressive 378-day period. Source: TradingView Related Reading: Avalanche (AVAX) Rumbles With 18% Gain – Is A Trend Reversal On The Horizon? Whether the price manages to bounce back above this critical level or succumbs to a breakdown could potentially dictate the future trend for DOGE. At present, according to CoinGecko, the value of Dogecoin stands at $0.063. However, recent market conditions have not been favorable, leading to a slump in DOGE&#8217;s price. DOGE price at $0.063. Source: Coingecko Over the course of the past 24 hours alone, Dogecoin witnessed a notable 2.0% decrease. This downward trend has persisted over the past week, with DOGE experiencing an overall decline of 7.2%. Considering these developments, the current state of Dogecoin&#8217;s price raises important questions about its trajectory moving forward. Potential For Bullish Breakout Should the overall market sentiment shift back towards recovery, there is a possibility of Dogecoin&#8217;s price experiencing a bullish breakout from the overhead resistance it currently faces. Such a breakout has the potential to alter traders&#8217; mindset, transitioning from actively selling during price rallies to adopting a strategy of buying on price dips. This shift in sentiment could have a significant impact on the market dynamics surrounding Dogecoin. DOGE market cap currently at $8.83 billion. Chart: TradingView.com A key factor in this potential shift lies in the concept of flipped support. If the $0.06 horizontal support area manages to hold strong and repel further downward pressure, it could potentially transform into a flipped support level. Related Reading: Stellar (XLM) Outshines Altcoins With 17% Rally – Here’s Why Flipped support refers to a situation where a previous resistance level, once broken, now acts as a supportive floor for price movements. In this scenario, the flipped support at $0.06 could serve as a bolstering force, encouraging buyers to step in and drive further recovery for Dogecoin. Should this bullish scenario unfold, the price of Dogecoin may find itself eyeing the next resistance level at $0.75. Breaking through this resistance could signify a significant achievement for DOGE and attract even more buyers and investors. A successful breach of the $0.75 resistance could mark a notable milestone, potentially setting the stage for further upward momentum and renewed market enthusiasm surrounding Dogecoin. Featured image from Personnel Today"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T11:01:34.000Z",
    "title": "Building The Perfect Crypto Community: Dogecoin, Shiba Inu and Caged Beasts Coin",
    "url": "https://www.crypto-news-flash.com/building-the-perfect-crypto-community-dogecoin-shiba-inu-and-caged-beasts-coin/?utm_source=rss&utm_medium=rss&utm_campaign=building-the-perfect-crypto-community-dogecoin-shiba-inu-and-caged-beasts-coin",
    "description": "Communities play a vital role in driving brand awareness and establishing trust. This article aims to examine and analyze the similarities and differences between the Caged Beasts Coin community and the communities surrounding popular meme coins Dogecoin and Shiba Inu. By exploring the unique features of Caged Beasts Coin&#8217;s referral system, we can understand how [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T10:42:07.000Z",
    "title": "Bitcoin, Ethereum, LTC, and Bitcoin Cash Can Be Considered Non-Securities as Wall Street Giant Citadel-Backed EDX Lists All of Them",
    "url": "https://www.crypto-news-flash.com/bitcoin-ethereum-ltc-and-bitcoin-cash-can-be-considered-non-securities-as-wall-street-giant-citadel-backed-edx-lists-all-of-them/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-ethereum-ltc-and-bitcoin-cash-can-be-considered-non-securities-as-wall-street-giant-citadel-backed-edx-lists-all-of-them",
    "description": "Institutionally-backed EDX Markets announced trading for Bitcoin Cash along with three other cryptocurrencies with BCH shooting by over 100 percent in a week&#8217;s time. The listing of these cryptocurrencies on EDX Markets provides them legal advantage while being perceived as commodities, and not securities. EDX Markets, a cryptocurrency exchange backed by financial giants such as [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T10:39:36.000Z",
    "title": "Web3 Is Changing The Travel Industry through Unique NFT Use Cases",
    "url": "https://www.crypto-news-flash.com/web3-is-changing-the-travel-industry-through-unique-nft-use-cases/?utm_source=rss&utm_medium=rss&utm_campaign=web3-is-changing-the-travel-industry-through-unique-nft-use-cases",
    "description": "The travel industry has seen its fair share of ups and downs in the last three years.  And this could be one of the biggest understatements of the century.  While airlines and large hotel chains suffered and worked with governments for financial help, there were countless casualties in the form of small hotels, tour companies, [...]"
  }
]