[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T22:52:29.000Z",
    "title": "Ethereum NFT game Symbiogenesis unveils auction dates by Square Enix",
    "url": "https://www.cryptopolitan.com/symbiogenesis-unveils-auction-dates-square-enix/",
    "description": "Square Enix, the renowned video game publisher known for its highly successful Final Fantasy and Kingdom Hearts series, is venturing into new territory with its first original Ethereum NFT game, Symbiogenesis. The company has officially announced the auction dates for this much-anticipated release, marking a significant step into the burgeoning NFT space. Unique auction structure ... <a title=\"Ethereum NFT game Symbiogenesis unveils auction dates by Square Enix\" class=\"read-more\" href=\"https://www.cryptopolitan.com/symbiogenesis-unveils-auction-dates-square-enix/\" aria-label=\"More on Ethereum NFT game Symbiogenesis unveils auction dates by Square Enix\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T23:00:15.000Z",
    "title": "Crypto Market Cap Soars: $1.5 Trillion Milestone Achieved, Bitcoin Sets New Record",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-market-cap-soars-1-5-trillion-milestone-achieved-bitcoin-sets-new-record/",
    "description": "Bitcoin (BTC) and the cryptocurrency market have seen a significant uptrend, hitting a new annual high and surpassing $1.45 trillion, paving the way for potential gains in the final days of November. Notably, BTC, the largest cryptocurrency in the market, has achieved a remarkable milestone, approaching the $40,000 level with a price surge to $38,400.  The catalysts behind this recent surge include the anticipated acceptance of the BlackRock Bitcoin Spot exchange-traded fund (ETF) within the next 45 days and speculation that BlackRock itself may influence Bitcoin&#8217;s price through significant buying pressure on Coinbase. BlackRock Driving BTC’s Recent Price Surge?  According to CoinGecko, the global cryptocurrency market cap currently stands at $1.5 trillion, reflecting a 2.05% change in the last 24 hours and an impressive 72.26% change compared to the same period last year.  This surge in market capitalization has not only boosted Bitcoin but has also contributed to gains in other major cryptocurrencies within the Top 100, such as Blur (BLUR), which soared a staggering 27%, Mina Protocol (MINA), which gained 9%, and Bittensor (TAO), which has seen a 14% surge in the last 24 hours, to name a few. Related Reading: Big Money Returns To Dogecoin: Rally To $0.2 Already Programmed? Regarding the recent surge of BTC to a new yearly high, crypto expert known by the pseudonym &#8220;Crypto Rover&#8221; has shed light on potential catalysts driving the recent surge. According to Rover, the BlackRock Bitcoin Spot ETF launch is expected to occur within the next 45 days. In this regard, Rover&#8217;s analysis suggests that BlackRock, the world&#8217;s largest asset manager, may play a role in Bitcoin&#8217;s recent surge. The speculation is based on the observation that a significant amount of Bitcoin buying pressure appears to be coming from Coinbase, the largest cryptocurrency exchange in the United States, with the platform serving as BlackRock&#8217;s custodial partner.  Promising Bitcoin Price Targets For Late 2025 Renowned crypto analyst Crypto Con has unveiled what he claims to be the most accurate Log Regression Curves for Bitcoin to date. These curves have provided insights into the future cycle top, an elusive aspect of Bitcoin analysis.  According to projections derived from the curve matching technique, late 2025 could witness two potential price targets for Bitcoin: $130,000, referred to as Layer 6, and Layer 7, with a target price of $180,000. The analyst says several models and projections support the $130,000 target, adding to its credibility. According to Crypto Con, even the most conservative estimate, known as Layer 5 at $94,000, seems less likely.  Based on historical trends, it is improbable that the entire red band, representing potential price ranges, would fail during this cycle. Therefore, one of the projected targets is expected to be accurate. Related Reading: Ripple CEO Offers Perspective On Legal Fallout With The SEC Based on the available information, Crypto Con favors layer 6 at $130,000 as the more likely target for Bitcoin&#8217;s late 2025 price surge. This projection aligns with the Halving Cycles Theory, suggesting a timeframe of approximately 21 days from November 28th, 2025. Bitcoin has undergone a recent pullback within the last hour following its attainment of a new yearly high. As of now, it is trading at $37,800. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T23:01:34.000Z",
    "title": "NFT Marketplace Altcoin Blur Leaps After Listing on Top Crypto Exchange by Trading Volume Binance",
    "url": "https://dailyhodl.com/2023/11/24/nft-marketplace-altcoin-blur-leaps-after-listing-on-top-crypto-exchange-by-trading-volume-binance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/NFT-Gaming-Studio-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A non-fungible token (NFT) marketplace is surging after being listed by the largest crypto exchange platform by volume in the world. In a new announcement, crypto exchange Binance says it is listing BLUR, the governance token of Altcoin Blur, a decentralized NFT marketplace that offers real-time price streams and comparisons. According to Binance, BLUR will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/nft-marketplace-altcoin-blur-leaps-after-listing-on-top-crypto-exchange-by-trading-volume-binance/\">NFT Marketplace Altcoin Blur Leaps After Listing on Top Crypto Exchange by Trading Volume Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]