[
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T02:45:02.000Z",
    "title": " BlackRock, Fidelity ETFs see largest debut month of any ETF in 30 years ",
    "url": "https://cointelegraph.com/news/blackrock-fidelity-etfs-largest-debut-month-30-years",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTlmMDcyYWQtOWIzNy00NTkyLWIzNmQtYWMwODNjYzQ4YzBkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Out of 5,535 “newborn” ETFs that launched in the United States over the last 30 years, only two have acquired over $3 billion in assets in the first month.</p>\n                    <p><p>BlackRock and Fidelity’s spot Bitcoin exchange-traded funds have tallied more assets in their first month of trading than any ETF launched in the United States over the last 30 years.</p><p>Bloomberg Intelligence data shows BlackRock’s IBIT and Fidelity’s FBTC have each secured more than $3 billion in assets in the first 17 trading days, the only ones to do so out of a list of over 5,500 ETFs. </p><p>IBIT and FBTC are in a “league of [their] own,” <a href=\"https://twitter.com/EricBalchunas/status/1755702963778023718\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Bloomberg ETF analyst Eric Balchunas in a Feb. 8 post on X. </p><p><a href=\"https://cointelegraph.com/news/blackrock-fidelity-etfs-largest-debut-month-30-years\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-09T02:55:22.000Z",
    "title": "Bitcoin Price Climbs To $46K, Uptrend Could Extend To $48K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-climbs-to-46k/",
    "description": "Bitcoin price is gaining pace above the $45,500 resistance. BTC tested $46,000 and could extend its rally toward the $48,000 resistance. Bitcoin price climbed higher above the $44,500 and $45,000 resistance levels. The price is trading above $45,000 and the 100 hourly Simple moving average. There is a key connecting bullish trend line forming with support at $45,480 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move up if it clears the $46,000 resistance zone. Bitcoin Price Jumps 5% Bitcoin price started a steady increase above the $43,500 resistance zone. BTC cleared a few hurdles near the $44,000 and $44,200 levels to move into a positive zone. The bulls gained strength and were able to pump the price above the $45,000 resistance. It traded close to the $46,000 level. A new multi-day high is formed near $45,955 and the price is showing signs of more gains in the near term. Bitcoin is trading well above the 23.6% Fib retracement level of the recent surge from the $42,765 swing low to the $45,955 high. It is also trading above $45,000 and the 100 hourly Simple moving average. Besides, there is a key connecting bullish trend line forming with support at $45,480 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $46,000 level. The next key resistance could be $46,200, above which the price could start another decent increase. Source: BTCUSD on TradingView.com The next stop for the bulls may perhaps be $46,850. A clear move above the $46,850 resistance could send the price toward the $47,500 resistance. The next resistance could be near the $48,000 level. Downside Correction In BTC? If Bitcoin fails to rise above the $46,000 resistance zone, it could start a downside correction. Immediate support on the downside is near the $45,500 level or the trend line. The first major support is $44,400 and the 50% Fib retracement level of the recent surge from the $42,765 swing low to the $45,955 high. If there is a close below $44,400, the price could gain bearish momentum. In the stated case, the price could dive toward the $43,500 support. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $45,500, followed by $44,400. Major Resistance Levels – $46,000, $46,200, and $47,500."
  }
]