[
  {
    "source": "Decrypt",
    "date": "2023-07-19T19:49:45.000Z",
    "title": "Italian Soccer Club AC Milan Extends Crypto Sponsorship With BitMEX",
    "url": "https://decrypt.co/149241/italian-soccer-club-ac-milan-extends-crypto-sponsorship-bitmex",
    "description": "Soccer giant AC Milan is sticking with BitMEX, two years after naming the exchange its official cryptocurrency trading partner."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T20:00:00.000Z",
    "title": "Scientists warn the ‘quantum revolution’ may stagnate economic growth",
    "url": "https://cointelegraph.com/news/scientists-warn-the-quantum-revolution-may-stagnate-economic-growth",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0fa7ff43-e97e-4f9b-90f5-fecf40649837.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>There are “traps” lying in wait for innovators at the vanguard of fintech and quantum computing, according to researchers.</p>\n                    <p><p>Quantum computing technologies are slowly beginning to trickle out of the laboratory setting and into commercial industries. While it remains to be seen when mainstream adoption will occur, a number of companies are currently engaged in experiments and trials with paying clients to develop quantum computing solutions. </p><p>According to a pair of researchers from the University of Cambridge and Bandung Institute of Technology, respectively, this represents a critical period wherein the world still has the opportunity to prepare itself for what they’re deeming “the quantum revolution.” </p><p>In a recently published commentary in the Nature journal, researchers Chander Velu and Fathiro Putra <a href=\"https://www.nature.com/articles/d41586-023-02317-x\" target=\"_blank\" rel=\"noopener nofollow\">describe</a> the ‘productivity paradox’ and explain how the mainstream adoption of quantum computing could slash economic growth for a decade or more. </p><p>Per their commentary:</p><blockquote>“The digital revolution took decades and required businesses to replace expensive equipment and completely rethink how they operate. The quantum computing revolution could be much more painful.”</blockquote><p>The productivity paradox is a business and finance term that explains why the introduction of new, better technology doesn’t usually result in an immediate increase in productivity. </p><p>We’ve seen this in nearly every aspect of the nascent blockchain and cryptocurrency industries. As the requirements for mining increase, for example, so do the costs associated with entering the space in any competitive capacity. </p><p>Less than a decade ago, it was fashionable to mine cryptocurrency with your desktop PC’s spare compute. As the rates of adoption have risen, so have corporate interests and the costs of entry.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6c978264-5a8a-4e1c-8cd3-27feb36fd203.jpg\"  /><figcaption style=\"text-align: center;\">Screenshot of chart showing mining hashrates over time on <a href=\"https://www.blockchain.com/explorer/charts/hash-rate\" target=\"_blank\" rel=\"noopener nofollow\">Blockchain.com</a></figcaption></figure><p>And, as fintech is one of the industries experts <a href=\"https://www.mckinsey.com/industries/financial-services/our-insights/how-quantum-computing-could-change-financial-services#:~:text=Quantum%20computers%20are%20particularly%20promising%20where%20algorithms%20are,risk%20remains%20a%20serious%20challenge%20for%20financial%20institutions.\" target=\"_blank\" rel=\"noopener nofollow\">predict</a> will experience immediate disruption from the quantum computing sector, it’s likely we’ll see <a href=\"https://cointelegraph.com/news/quantum-miners-would-yield-massive-energy-savings-for-blockchain-study\">direct integration with mining</a>, blockchain and cryptocurrency technologies immediately. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/researchers-demonstrate-unconditionally-secure-quantum-digital-payments\"><strong><em>Researchers demonstrate ‘unconditionally secure’ quantum digital payments</em></strong></a></p><p>To explain the productivity paradox, the researchers cite a period lasting from 1976 through 1990 where labor productivity growth — a measure of how productive individuals are at work over time — slowed to a crawl. The reason for this stagnation involved the onset of the computer era.</p><p>Essentially, the costs associated with the global switch from paper to computers combined with the need to retrain the entire workforce and create entirely solution ecosystems and workflows caused the trend of growth to stall out until the integration finally completed during the mid-1990s. </p><p>The researchers see a similar predicament occurring as quantum computers go from brushing up against usefulness to, potentially, becoming a backbone technology for business. </p><p>The two main roadblocks to a smooth transition into the quantum age, according to the researchers, are a lack of general understanding of the technology among leaders and risk aversion.</p><p>While businesses with a clear use case, such as shipping or pharmaceutical companies, may be quick to adopt quantum solutions, the rate-of-return might not appeal to risk-averse businesses looking for immediate impact. </p><p>To mitigate these concerns and accelerate the adoption of quantum computing, the researchers suggest a renewed focus from governments and researchers on illustrating the potential benefits of quantum computing and the development of language and terminology to explain the necessary concepts to the business community and the general public. </p><p>The researchers conclude by stating that the first order of business when it comes to preparing for the quantum computing future is to <a href=\"https://cointelegraph.com/news/hsbc-trialing-quantum-safe-financial-transaction-network-in-the-uk\">ensure that the “quantum internet” is ready</a> for secure networking.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T19:43:58.000Z",
    "title": "DeFi bill introduced in Senate would hold major investors responsible for illegal use",
    "url": "https://cryptoslate.com/bipartisan-defi-bill-introduced-to-senate-would-hold-major-defi-shareholders-responsible-for-their-misuse/",
    "description": "<p>Senators Jack Reed (D-RI) and Mark Warner (D-VA) have introduced a new bill that aims to combat illicit financial activity like money laundering and terrorism financing in decentralized finance (DeFi), Bloomberg News reported on July 19. The legislation stipulates that any violations or illegal transactions on a DeFi protocol should be punished to discourage such [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bipartisan-defi-bill-introduced-to-senate-would-hold-major-defi-shareholders-responsible-for-their-misuse/\">DeFi bill introduced in Senate would hold major investors responsible for illegal use</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T20:00:13.000Z",
    "title": "Crypto Market Analysis for H1 According to CoinMarketCap",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-market-analysis-for-h1-according-to-coinmarketcap",
    "description": "<p>CoinMarketCap has released a report on the global crypto market after H1. The report delves into a general market overview, recent key events, and what it expects H2&rsquo;s key themes will be. </p>\n<p>Today, CoinMarketCap, the world&rsquo;s leading price-tracking website for crypto assets, released its 2023 H1 Crypto Market Analysis Report.&nbsp;</p>\nCrypto Market Kicks 2023 Off Strong\n<p>The crypto market started this year with a bang witnessing the bitcoin price doubling, the rise of L2s such as Arbitrum and ZK, and the NFT market showing signs of improvement. By the end of Q2, the global crypto market capitalization reached an impressive $1.17 trillion, marking a 48% YTD increase. Q1 and Q2, however, concluded with similar total market caps, meaning Q2 showed much less growth.</p>\n<p>Q2 was instead characterized by trends such as the &ldquo;memecoin&rdquo; frenzy and the rise of BRC20 tokens, which, despite being noteworthy, did not garner the same excitement as the previous quarter&rsquo;s developments.</p>\n<p>Market sentiment improved significantly by the end of Q1, with the CMC Crypto Fear and Greed Index registering at a neutral 52 &ndash; a vast improvement over the start of the year, which registered a fearful 30.</p>\n<p>According to CMC&rsquo;s report, the Total Spot Trade Volume of the Top 20 Crypto Exchanges peaked in March but declined by around 36% quarter-on-quarter.</p>\nTop Growing Sectors\n<p>Despite what can only be called challenging market conditions, certain industry sectors witnessed remarkable growth in market cap year-to-date. VR/AR (704%0 and AI &amp; Big Data (323%) exceeded expectations, while blue-chip decentralized finance (DeFi) projects appear to be making a strong comeback.</p>\n<p>The &ldquo;memecoin&rdquo; frenzy saw the sector add over 260 new coins YTD, with AI &amp; Big Data taking second place, adding 61 coins. DeFi ranked third, adding 47 new listings YTD.</p>\n<p></p>\nBitcoin and Ethereum Developments\n<p>The market&rsquo;s top tokens, Bitcoin (BTC) and Ethereum (ETH) experienced several events, resulting in noteworthy price fluctuations.</p>\n<p></p>\n<p></p>\nCMC&rsquo;s Top Views\n<p>CoinMarketCap saw a surge in views from the memecoin sector as $PEPE took the industry by storm. PEPE&rsquo;s explosive rally of over 3700x from April to May sparked particular interest in the sector, and it joined CMC&rsquo;s &ldquo;Most Added to Watchlist.&rdquo; Memes also registered the most engagement in CMC Community.</p>\n<p>The DeFi sector registered sustained interest throughout the year&rsquo;s first half to become the second most viewed. Sector interest largely focused on Terra Classic (LUNC) as Binance burned 2.65 billion LUNC tokens, worth approximately $236,000. &nbsp;</p>\n<p>AI and Big Data have undoubtedly marked 2023 following the launch of OpenAI&rsquo;s revolutionary ChatGPT, and it is reflected in views.</p>\nBest Performing Coins\n<p>Arbitrum ecosystem tokens such as Pendle (PENDLE) and Radiant Capital (RDNT) appeared to be H1&rsquo;s top gainers, along with Optimist ecosystem tokens such as Velodrome Finance (VELO).</p>\n<p></p>\n<p>Other top gainers include layer-one blockchains, including Dione Protocol (DIONE), Conflux (CFX), and Injective (INJ). AI-related tokens such as SingularityNET (AGIX) and Render (RNDR) also performed well.</p>\nKey Themes for H2\n<p>CoinMarketCap identified the key themes for the second half of 2023.</p>\nBitcoin ETFs\n<p>The crypto news cycle has recently been dominated by talks of Bitcoin ETFs after BlackRock, the world&rsquo;s largest asset manager, filed for a Bitcoin spot ETF with the SEC. News of BlackRock&rsquo;s application spurred a host of other firms, such as Valkyrie, Fidelity and 21 Shares, to announce they are also seeking ETF approval.</p>\n<p>The SEC has yet to approve any of the applications. Should the regulator grant these ETFs, they could unlock substantial investor demand by offering regulated products for asset allocation.</p>\nDecentralized Public Infrastructure Networks\n<p>One of H2&rsquo;s key themes will be Decentralized Physical Infrastructure (DePIN). DePIN is still in its early stages of expansion and aims to provide solutions for access sharing of physical assets or services like warehousing and data networks.</p>\nReal World Assets (RWAs)\n<p>The tokenization of assets has become an increasing focus for the crypto asset industry. Projects focused on making RWAs tradeable on-chain largely consist of credit market protocols such as Maple Finance and Goldfinch allow businesses to use DeFi to secure financing and loans.</p>\nLiquid Staking Derivative (LSDs)\n<p>Liquid Staking Derivative witnessed a dramatic surge in activity in H1 owing largely to Ethereum&rsquo;s Shapella upgrade. Market leaders such as Lido and Rocket Pool saw their TVLs rise 138% and 220%, respectively.</p>\n<p>By the end of June, LSD platforms secured over a third of Ethereum&rsquo;s Total Value Staked.</p>\n<p></p>\nRestaking\n<p>The introduction of EigenLayer &ndash; a middleware platform which allows staked ETH or liquid staked ETH tokens to be reused on the consensus layer, prompted restaking as an emerging theme in H1.</p>\n<p>Restaking was in demand after EigenLayer&rsquo;s Restaking Smart Contracts were deployed and reached their maximum limits within a day of the mainnet launch.</p>\nzkSync\n<p>zkSync, a zero-knowledge roll-up solution, emerged as a popular Ethereum-based layer-2 solution and strong competitor against Ethereum optimistic roll-ups, including Optimism and Arbitrum.</p>\n<p>zkSync utilizes zero-knowledge technology to offload traffic from Ethereum to an efficient second layer, helping to increase Ethereum&rsquo;s throughput while enabling an array of new applications.</p>\nModular Blockchains (Celestia)\n<p>Most layer-1 blockchains are monolithic chains that result in issues surrounding efficiency, stemming from the blockchain trilemma of decentralization, security and scalability.</p>\n<p></p>\n<p>Modular blockchains like Celestia address these issues by separating blockchains into three layers: execution, settlement, consensus and data availability. In doing so, modular blockchains provide developers with modular data availability and consensus layers which dApps and sidechains can leverage to bootstrap development.</p>\nFTX Bankruptcy Developments\n<p>After FTX collapsed, its depositors could not determine how much of the almost $9 billion shortfall could be collected during the liquidation process.</p>\n<p>In January, it emerged that more than $5 billion in liquid assets were collected, and this number subsequently increased to $7 billion. The firm overseeing FTX&rsquo;s restructuring recently contacted creditors, giving them a &ldquo;Customer Bar Date&rdquo; of September 29, 2023.</p>\n<p>Debtors are, however, unlikely to receive a payout until at least H2 2024.</p>\nBitcoin Remains Most-Viewed Crypto Across All Regions\n<p>Regional differences in interest in various crypto sectors were insignificant. Bitcoin continues as the most-viewed crypto across all regions in H1 2023, similar to data from Q4 2022. Bitcoin&rsquo;s dominance over altcoins increased by 25% from 40.09% at the beginning of the year to 50.39% at the end of H1.</p>\n<p></p>\n<p>As expected, the US continues to dominate the distribution of crypto users worldwide.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T20:04:47.000Z",
    "title": "Meta and Microsoft join forces to launch Llama 2",
    "url": "https://www.cryptopolitan.com/meta-and-microsoft-join-force-launch-llama-2/",
    "description": "Big Tech companies Meta and Microsoft have joined forces to unveil Llama 2, a cutting-edge open-source large language model (LLM) developed by Meta. The announcement, made on July 18, revealed that Llama 2 is set to be integrated into Microsoft’s Windows operating system and cloud computing platform, Azure. This collaboration aims to empower businesses and ... <a title=\"Meta and Microsoft join forces to launch Llama 2\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-and-microsoft-join-force-launch-llama-2/\" aria-label=\"More on Meta and Microsoft join forces to launch Llama 2\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T20:02:54.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $2?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $2?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $2?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T19:52:37.000Z",
    "title": "Reddit’s Moons token skyrockets after Crypto.com listing",
    "url": "https://www.cryptopolitan.com/reddits-moons-token-skyrockets-after-listing/",
    "description": "The native token of cryptocurrency enthusiasts on Reddit, known as Moons, has witnessed a dramatic surge in price following its listing on Crypto.com. The token’s value has soared for two consecutive days, with an impressive 141% increase in a single day, reaching a trading price of $0.41. Moons had already experienced significant gains earlier when ... <a title=\"Reddit’s Moons token skyrockets after Crypto.com listing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/reddits-moons-token-skyrockets-after-listing/\" aria-label=\"More on Reddit’s Moons token skyrockets after Crypto.com listing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T19:42:11.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-19T20:00:44.000Z",
    "title": "As Polygon (MATIC) and Binance Coin (BNB) Lead Declines, DigiToads (TOADS) Emerges as the memecoin king",
    "url": "https://nulltx.com/as-polygon-matic-and-binance-coin-bnb-lead-declines-digitoads-toads-emerges-as-the-memecoin-king/",
    "description": "The emerging narrative developing on Crypto Twitter amongst investors who have witnessed several cycles is the underperformance of the last cycle’s top altcoins and the overperformance of new DeFi projects. Seasoned investors cite how the tech stack and tokenomics improve, leading newer investors to newer projects. Additionally, old coins suffer from investors holding at a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T20:07:41.000Z",
    "title": "Arkham’s beta complete, on-chain intelligence exchange live",
    "url": "https://crypto.news/arkhams-beta-complete-on-chain-intelligence-exchange-live/",
    "description": "Arkham Intelligence has unveiled what they claim to be the world's first on-chain intelligence exchange"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T20:00:19.000Z",
    "title": "Crypto Trader Says $55,000 Bitcoin (BTC) on the Horizon – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/07/19/crypto-trader-says-55000-bitcoin-btc-on-the-horizon-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/crypto-says-btc-horizon.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst is predicting that Bitcoin (BTC) will cross the $55,000 level following one upcoming event as he warns of a near-term market correction. In a new video update, pseudonymous crypto trader Rekt Capital tells his 45,600 YouTube subscribers that Bitcoin will likely repeat a historic pattern after halving events, which occur every four [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/crypto-trader-says-55000-bitcoin-btc-on-the-horizon-heres-his-timeline/\">Crypto Trader Says $55,000 Bitcoin (BTC) on the Horizon – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T19:55:04.000Z",
    "title": "SEC Fishing for Publicity and Political Impact With Crypto Agenda, Republican Representatives Say",
    "url": "https://dailyhodl.com/2023/07/19/sec-fishing-for-publicity-and-political-impact-with-crypto-agenda-republican-representatives-say/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Performing-Crypto-Sectors-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Republican members of the U.S. House of Representatives say that the U.S. Securities and Exchange Commission (SEC) is looking for publicity and political impact with its anti-crypto strategy. Representatives French Hill of Arkansas and Dusty Johnson of South Dakota recently penned a letter to SEC Chairman Gary Gensler highlighting the need for clear crypto guidelines. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/sec-fishing-for-publicity-and-political-impact-with-crypto-agenda-republican-representatives-say/\">SEC Fishing for Publicity and Political Impact With Crypto Agenda, Republican Representatives Say</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]