[
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T08:00:00.000Z",
    "title": "India G20 confirms 'active discussions' around global crypto framework",
    "url": "https://cointelegraph.com/news/india-g20-global-crypto-framework-discussions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/112c1c79-f8b3-4d1b-836f-db7a93e1c696.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sitharaman said crypto was a “threat as well as an opportunity” while confirming that the G20 members are working toward this vision of establishing a global crypto framework.</p>\n                    <p><p>Under India's G20 presidency, active discussions around establishing a global framework for cryptocurrencies are underway, India’s minister of finance Nirmala Sitharaman has said. </p><p>On Aug. 28, Indian Prime Minister Narendra Modi pushed for <a href=\"https://cointelegraph.com/news/india-modi-global-cryptocurrency-framework-g20-summit\">global collaboration on formulating crypto regulations</a> among G20 (Group of 20) member states, which include 19 countries and the European Union. Modi believes that emerging technologies — like cryptocurrencies — that have global impact should be accompanied by regulations and framework that is adhered to globally.</p><p>Sitharaman <a href=\"https://www.youtube.com/watch?v=C0ASAWNUwAM&amp;ab_channel=GlobalFintechFest\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> that the G20 members are working toward this vision of establishing global crypto framework during the Global Fintech Fest on Sept 5. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7cf804cf-a1a4-42f4-819f-c94350860827.png\"  /><figcaption style=\"text-align: center;\"><em>Indian Finance Minister Nirmala Sitharaman on establishing global crypto regulations. Source: Global Fintech Fest</em></figcaption></figure><p>During the summit, Sitharaman said crypto was a “threat as well as an opportunity.” She highlighted the need for global co-operation to build a responsible financial ecosystem that can effectively help regulate cryptocurrencies worldwide. “Global co-operation is absolutely critical,” she added. </p><blockquote>“In an inter-connected world, financial technology transcends broders, therefore, making cross-border partnerships absolutely crucial.”</blockquote><p>Ever since India took over the G20 presidency in Q4 2022, the country consistently highlighted the need for global collaboration when it comes to financial security and stability. However, the finance minister confirmed that G20 members are together working on the the highly anticipated crypto regulations.</p><blockquote>“India’s (G20) presidency has laid out issues related to regulating or understanding that there should be a framework for handling issues related to crypto assets. Active discussions are happening, content-rich papers from institutions like IMF, FSB, OECD are all being discussed on various issues.”</blockquote><p>Sitharaman also confirmed that the International Monetary Fund (IMF) and the Financial Stability Board (FSB) have submitted their synthesis papers on cryptocurrency. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-india-puts-forward-suggestions-for-g20-crypto-roadmap\"><strong><em>India makes suggestions for G20 crypto roadmap</em></strong></a></p><p>India’s rising interest in blockchain and crypto becomes more evident after the National Payments Corporation Of India’s (NPCI) recent job posting. NPCI, an initiative led by the Reserve Bank of India (RBI) and 247 Indian banking companies, is looking to hire a head of blockchain. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4e1fa340-6f91-4854-a14b-82b47d72d67c.jpeg\"  /><figcaption style=\"text-align: center;\"><em>NPCI’s job posting for a head of blockchain. Source: LinkedIn</em></figcaption></figure><p>The ideal candidate will be a seasoned technologist with at least six years of experience in developing and implementing blockchain, who will be primarily tasked with identifying “avenues wherever blockchain-driven solutions can be used.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T07:56:25.000Z",
    "title": "New $20M fund eyes blockchain gaming and NFTs  ",
    "url": "https://cointelegraph.com/news/new-20m-fund-eyes-blockchain-gaming-nf-ts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/2bd0c617-254d-4118-8ce3-2cdfc133b447.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Web3 venture capitalists will look to invest in blockchain gaming and collectibles projects through a new $20 million fund.</p>\n                    <p><p>A group of cryptocurrency venture investors has established a $20 million fund to invest in undervalued Web3 projects and companies focused on blockchain gaming and digital collectibles.</p><p>Alpha Protocol Ventures (APV) will look to invest in a variety of projects across the Web3 ecosystem, CEO and founder Vagelis Diamantis told Cointelegraph in an emailed interview. Gaming and collectibles will be a priority focus, he said, while DeFi and layer 1 and 2 protocols will also fall within the scope of the fund's capital allocation.</p><blockquote>“We will also explore projects that will try to solve real world problems such as supply chains, data protection and infrastructure.”</blockquote><p>APV has drawn funding from Diamantis, Ethernity CEO Nick Rose as well as Web3 investment firm Morningstar Ventures and a group of Web3 angel investors.</p><p>Diamantis, formerly CFO of Ethernity, added that APV had identified a number of potential investment targets, while it would add support to “undervalued projects” that were launched as “buy-and-hold funds” including the likes of Polygon, Polkastarter, Axie Infinity and Ethernity.</p><p><em><strong></strong></em><a href=\"https://cointelegraph.com/news/cricket-star-ab-de-villiers-ventures-into-web3\"><strong><em>Related: From cricket to crypto: AB de Villiers ventures into Web3</em></strong></a><a href=\"https://cointelegraph.com/news/cricket-star-ab-de-villiers-ventures-into-web3\"><strong><em></em></strong></a></p><p>Diamantis also added that a prolonged bear market still presents an opportunity for investors to get behind projects in their infancy that are developing innovative solutions based on blockchain technology.</p><blockquote>“The crypto ecosystem has been through many cycles since it started. It’s a whole new asset class that we think will only grow exponentially.”</blockquote><p>Diamantis said that APV would double down on blockchain companies and Web3 applications, targeting undervalued companies and undiscovered blockchain technologies.</p><p>Web3 projects and platforms have continued to attract sizeable investments from VC firms and fund managers through 2023.</p><p>Animoca Brands announced that it would invest $30 million into Web3 neobank Hi in <a href=\"https://cointelegraph.com/news/nft-styled-debit-cards-the-future-of-web3-animoca-founder\">July 2023</a>, with founder Yat Siu outlining innovative products like it's customizable nonfungible token (NFT)-styled crypto debit card as a potential draw card for Web3 enthusiasts in an exclusive interview with Cointelegraph.</p><p>Meanwhile another venture firm, Vessel Capital, announced a $55 million fund that will also look to back Web3 infrastructure and applications in <a href=\"https://cointelegraph.com/news/vessel-capital-secures-55m-invest-web3-infrastructure\">Aug. 2023</a>. That number was eclipsed by cryptocurrency exchange Bitget, which unveiled a reported $100 million fund that would look to target Asia-based Web3 and blockchain projects.</p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T07:48:29.000Z",
    "title": "Marathon’s Bitcoin mining rate fell 9% in August",
    "url": "https://cointelegraph.com/news/marathon-s-bitcoin-mining-rate-fell-9-in-august",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3240b08f-37b6-4720-b2f1-32e0e0c530e5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company still mined five times more Bitcoin than in August 2022, producing 1,072 last month, and said unfavorable weather conditions caused the decrease from July. </p>\n                    <p><p>United States-based crypto mining operator Marathon Digital Holdings produced 1,072 Bitcoin in August — 9% less than in July but five times more than in August 2022.</p><p>On Sept. 5, Marathon <a href=\"https://www.globenewswire.com/news-release/2023/09/05/2737556/0/en/Marathon-Digital-Holdings-Announces-Bitcoin-Production-and-Mining-Operation-Updates-for-August-2023.html\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> the unaudited BTC production and miner installation updates for August. According to the press release, last month the company increased its U.S. operational hash rate by 2% month-over-month to 19.1 exahashes, and its installed hash rate by 1% month-over-month to 23.1 exahashes. The rise occurred due to the update of BITMAIN S19 J Pro miners for more efficient S19 XPs. </p><p>Marathon reached its primary domestic growth target of 23 exahashes and now aims at 30 exahashes with two of them planned to be obtained through international facilities and 5 by contract from other entities. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/marathon-digital-q2-results-miss-forecasts\"><strong><em>Marathon Digital Q2 results miss revenue and earnings forecasts</em></strong></a></p><p>Right now Marathon is finalizing paperwork on its new mining facility in Garden City, Texas and its joint venture in Abu Dhabi mined 50 Bitcoin in August.</p><p>As to the relative decrease in BTC production, Marathon CEO Fred Thiel blames it on the climate conditions: </p><blockquote>“The decrease in Bitcoin production from July was largely due to increased curtailment activity in Texas due to record high temperatures. These temporary shutdowns more than offset the progress we have made to increase our operational hash rate and optimize our operations.”</blockquote><p>Last month Marathon published its Q2 2023 financial results, claiming the increase of the revenue by 228% compared to the Q2 2022. The company reported a $23.4 million gain due to selling 63% of the Bitcoin mined in the quarter, used to fund operating costs. Impairment charges on the value of its held digital assets were $8.4 million.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market. Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-06T08:00:00.000Z",
    "title": "India G20 confirms 'active discussions' around global crypto framework",
    "url": "https://cointelegraph.com/news/india-g20-global-crypto-framework-discussions",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/112c1c79-f8b3-4d1b-836f-db7a93e1c696.jpg\"></p><p>Sitharaman said crypto was a “threat as well as an opportunity” while confirming that the G20 members are working toward this vision of establishing a global crypto framework.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-06T07:53:00.000Z",
    "title": "Crypto Analytics Firm Santiment Set to Integrate Free XLS-30 AMM Metrics for the XRP Ledger",
    "url": "https://www.cryptoglobe.com/latest/2023/09/santiment-set-to-integrate-free-xls-30-amm-metrics-for-the-xrp-ledger/",
    "description": "Crypto analytics firm Santiment has recently rolled out an array of free metrics for the XRP Ledger (XRPL) aiming to be a comprehensive data source for the platform. These metrics cover a wide range of on-chain, social, and developmental indicators, and are even utilized by Ripple itself. The announcement also hinted at the firm’s plans […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-06T07:59:21.000Z",
    "title": "Crypto.com Launches Its First-ever Game on the Cronos Network",
    "url": "https://cryptodaily.co.uk/2023/09/cryptocom-launches-its-first-ever-game-on-the-cronos-network",
    "description": "Cronos Play’s SDK team and Crypto.com introduces “Loaded Lions: Mane City” with blockchain gaming and NFT utility."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T08:04:33.000Z",
    "title": "Exploring New Horizons: AI and the Realm of Emotional Intelligence",
    "url": "https://www.cryptopolitan.com/exploring-new-horizons-for-ai-and-emotion/",
    "description": "Scientists and researchers are venturing into uncharted territory in artificial intelligence (AI). Their mission is to integrate Emotional Quotient (EQ) into AI systems, a bold step that could redefine the future of human-computer interactions. Unlocking the emotion code At the heart of this endeavor lies a groundbreaking idea, emotions often seen as mysterious and elusive, ... <a title=\"Exploring New Horizons: AI and the Realm of Emotional Intelligence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exploring-new-horizons-for-ai-and-emotion/\" aria-label=\"More on Exploring New Horizons: AI and the Realm of Emotional Intelligence\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T07:57:46.000Z",
    "title": "AI and Machine Learning Revolutionize Data Center Management",
    "url": "https://www.cryptopolitan.com/ai-and-machine-learning-revolutionize-data-management/",
    "description": "In an age dominated by artificial intelligence (AI) and machine learning, the impact of these transformative technologies extends far beyond the confines of science fiction. The data center industry, which forms the backbone of our increasingly digital world, has not remained untouched by this AI-driven wave of innovation. These intelligent systems are ushering in a ... <a title=\"AI and Machine Learning Revolutionize Data Center Management\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-and-machine-learning-revolutionize-data-management/\" aria-label=\"More on AI and Machine Learning Revolutionize Data Center Management\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T08:00:02.000Z",
    "title": "Crypto’s Newest Sensation: Everlodge (ELDG) Pulls Fans from Tezos (XTZ) and Klaytn (KLAY) – Find Out Why",
    "url": "https://www.crypto-news-flash.com/cryptos-newest-sensation-everlodge-eldg-pulls-fans-from-tezos-xtz-and-klaytn-klay-find-out-why/",
    "description": "<img width=\"512\" height=\"242\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T101903.871.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T101903.871.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T101903.871-300x142.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Everlodge (ELDG) is making waves and attracting a strong fan base from established cryptos like Tezos (XTZ) and Klaytn (KLAY). But what&#8217;s causing this shift and why is Everlodge resonating so profoundly with the crypto community? This article will explore these intriguing developments. It&#8217;s worth noting that Everlodge is currently in its presale phase, presenting [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T07:45:14.000Z",
    "title": "Elon Musk’s Twitter Expands Crypto Reach: Mississippi Grants Payment License – Is Dogecoin (DOGE) Integration Next for X?",
    "url": "https://www.crypto-news-flash.com/elon-musks-twitter-expands-crypto-reach-mississippi-grants-payment-license-is-dogecoin-doge-integration-next-for-x/",
    "description": "<img width=\"1280\" height=\"943\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Elon Musk\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280-300x221.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280-1024x754.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280-768x566.png 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Elon Musk is realizing his vision of making the &#8216;everything app&#8217; for his X platform (formerly Twitter). X has received a transmitter license in Michigan, New Hampshire, and Missouri, and in the latest development, Mississippi. Elon Musk&#8217;s X has received a transmitter license in Mississippi. So far, X (formerly Twitter) has received the license in [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T07:54:00.000Z",
    "title": "Ordinals and Restaking to Fuel Next BTC Bull Run: DEFI Researcher",
    "url": "https://coinedition.com/ordinals-and-restaking-to-fuel-next-btc-bull-run-defi-researcher/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/DEFI-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Compound Finance’s [COMP] TVL May Not Stop a Pullback, Here’s Why\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/DEFI-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/DEFI-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ignas, a prominent DEFI researcher shared several factors that will drive the next bull run. The researcher said the groundwork for Bitcoin’s breakout is already on, and will fuel an uptrend to $69 by Q4 2024, ultimately culminating in the 2025 breakout. According to Ignas, the groundwork for this bull run will rely on two [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ordinals-and-restaking-to-fuel-next-btc-bull-run-defi-researcher/\">Ordinals and Restaking to Fuel Next BTC Bull Run: DEFI Researcher</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]