[
  {
    "source": "NewsBTC",
    "date": "2024-02-10T23:00:29.000Z",
    "title": "Crypto Analyst Says Bitcoin At $100,000 Not Far Off, Here’s When",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-100000-not-far-of/",
    "description": "Kevin Svenson, a crypto analyst on YouTube, recently provided an analysis of the future price trajectory of Bitcoin, predicting a strong surge to $100,000 this year. According to the analyst, BTC is poised to go parabolic after its halving in April as the crypto is looking very bullish on the weekly chart. The halving cuts the block reward for Bitcoin miners in half, reducing the supply of new Bitcoins in circulation. With demand remaining steady or increasing, the reduced supply has been historically known to drive up the price of BTC. Bitcoin Parabolic Surge Not Far Off Bitcoin is currently leading a crypto market surge after four weeks of lackluster action following the launch of spot Bitcoin ETFs in the US. Bitcoin recently broke above $47,000 for the first time this year, pushing the narrative of the return of a strong crypto market bull run. Related Reading: Why Cardano (ADA) Is A Top Altcoin Pick In The Next Bull Run Svenson noted in his YouTube video that Bitcoin is yet to close above $44,000 on the weekly timeframe this year. However, recent price action indicates this is about to change, giving the highest weekly close so far in the current cycle. The analyst noted that if Bitcoin were to successfully clear trapped liquidity around the wicks, it could lead to the crypto reaching the first step of the $60,000 price level. On a larger timeline, Svenson looked at past Bitcoin halvings to note a recurring trend before and after each halving. History shows that the price of BTC has always trended up in the months leading to the halving and then going on a parabolic trend in the months after.  Of course, past performance does not necessarily guarantee future price action, but Svenson believes several factors are lining up that could send Bitcoin surging past its all-time high once again. &#8220;There&#8217;s no reason for me to not think that we&#8217;re just going to do what we&#8217;ve been doing in these past cycles,&#8221; he said. Now, looking forward, the analyst noted past halvings were set up by Satoshi to correlate with election years in the US, which have always led to a spike in the financial markets.  In addition, Svenson mentioned that the profitability of Bitcoin has always increased until 80 weeks following each halving, which marks the beginning of a new bear market. If history repeats itself, an 80-week timeline after the upcoming halving should be around October 2025, which is when a new bear market cycle is expected to begin. Related Reading: Crypto CEO Says Get Ready For Solana To ‘Rally Higher Again’ With New Target Institutional interest in Bitcoin is surging, contributing to a 9.57% surge in the past seven days. Bitcoin is trading at $47,211 at the time of writing.  ‼️JUST IN: #Bitcoin ETFs are the most successful ETFs 1 month after launch EVER! 🚀 (out of 5,535 total launches in 30 years) They hold the #1 ($IBIT), #2 ($FBTC), #20 ($ARKB), and #22 ($BITB) spots. And there is still 2 days left. pic.twitter.com/NAVoyraPHT — Swan Media (@Swan) February 9, 2024 BTC price recovers after brief dip &#124; Source: BTCUSD on Tradingview.com Featured image from Dall.E, chart from Tradingview.com"
  }
]