[
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T20:32:30.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Coinbase's Custody division has a new CEO ahead the United States Securities and Exchange Commission's decision on a spot Bitcoin exchange-traded fund (ETF). A Solana trader hit a $2M jackpot after putting $62 into a Solana memecoin called Silly Dragon. Meanwhile, a U.S. federal judge has sided with the United States Securities and Exchange Commission over accusations that Terraform Labs and Do KwonARK Invest liquidated its entire remaining Grayscale Bitcoin Trust (GBTC) holdings worth $200 million on Dec. 28, and Marathon Digital rocketed to the top of the U.S. stock charts in trading volume just weeks ahead of an anticipated Bitcoin ETF approval.</p><p>According to Bloomberg, <a href=\"https://cointelegraph.com/news/coinbase-custody-changes-leadership-bitcoin-etf-decision-report\">Coinbase has replaced</a> the leadership of its Custody division ahead of the U.S. Securities and Exchange Commission's (SEC) spot Bitcoin ETF decision in January. </p><p>Aaron Schnarch has reportedly resigned as chief executive officer of Coinbase Custody and is being replaced by Rick Schonberg, a senior executive who has been at the firm since 2022. Schonberg has career stops at Goldman Sachs, State Street and JPMorgan, among others. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T20:25:22.000Z",
    "title": " BlackRock, Van Eck file last-minute BTC ETF amendments ",
    "url": "https://cointelegraph.com/news/blackrock-van-eck-file-last-minute-btc-etf-amendments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZDYyYWMwODAtMjMyOS00YzExLWFlMmMtYzMzN2ZiZTY4Njg5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Wall Street asset managers are considered front-runners in the race to land the first U.S. spot Bitcoin exchange-traded fund.</p>\n                    <p><p>Asset managers BlackRock and Van Eck submitted amended S-1 forms to the United States Securities and Exchange Commission (SEC) on Dec. 29, the last day for SEC consideration in January 2024.</p><p>Van Eck <a href=\"https://www.sec.gov/Archives/edgar/data/1838028/000093041323002749/c106800_s1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> in its revised application, “Financial firms that are authorized to purchase or redeem Shares with the Trust (known as “Authorized Participants” or “APs”) will deliver only cash to create Shares and will receive only cash when redeeming Shares.” This <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-updates-deadline\">is in keeping with the preference</a> of the SEC.</p><p>BlackRock's updated filing names Jane Street and JP Morgan Securities as \"Authorized Participants\" in its proposed Bitcoin spot ETF application.</p><p><a href=\"https://cointelegraph.com/news/blackrock-van-eck-file-last-minute-btc-etf-amendments\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T20:30:49.000Z",
    "title": "Avalanche To Support Meme Coins; AVAX To The Moon?",
    "url": "https://www.newsbtc.com/avalanche/avalanche-to-support-meme-coins-avax-to-the-moon/",
    "description": "The Avalanche Foundation is expanding its support of meme coins. This move could further boost the popularity of Avalanche, a low-fee and high-throughput blockchain, and even support its native coin, AVAX. Avalanche Foundation To Support Meme Coins Taking to X on December 29, the foundation said it would continue its Culture Catalyst initiative to encourage meme coin activity, among others, including Real-World Assets (RWAs), non-fungible tokens (NFTs), and more. This campaign, they continue, aims to foster innovation and propel the adoption of blockchains by supporting the creation of &#8220;new forms of creativity, culture, and lifestyle.&#8221; Related Reading: Bitcoin Erases Recovery As Miners Cash Out 3,000 BTC The Avalanche Foundation believes that meme coins have carved out a significant niche in crypto, representing the collective spirit and shared interests of diverse crypto communities. By recognizing and encouraging this culture, the foundation hopes to develop and expand the Avalanche ecosystem, attracting new users. As they resume Culture Catalyst, the foundation will start by purchasing select Avalanche-based meme coins to create a collection. The selection process will be based on several critical criteria, including the number of holders, liquidity thresholds, project maturity, principles of a fair launch, and overall social sentiment. This move is a significant step for the Avalanche Foundation, as it indicates a growing recognition of the potential of meme coins to drive innovation and growth. It is because meme coins have become increasingly popular in recent years, often attracting large communities and generating significant trading volume. According to CoinMarketCap data on December 29, meme coins have a cumulative market cap of over $23 billion. Will AVAX And COQ Extend Gains In 2024? The foundation&#8217;s support for meme coins could further boost the popularity of Avalanche, as it will bring more attention to AVAX, a coin used for paying network fees. Thus far, AVAX remains in an uptrend, adding nearly 400% from October 2023 lows. Though there has been a cool-off, buyers have the upper hand. With rising demand triggered by more meme coins deploying on Avalanche, AVAX prices will likely float even higher. One of the Avalanche-based meme coins, COQ, is among the top 10 most liquid. According to DEX Tools data, there are over 34,000 COQ holders when writing. As of December 29, Dogecoin (DOGE) is the largest and most valuable meme coin, with over $13.2 billion in market cap. However, the launch and subsequent stellar performance of COQ propelled it to command a market cap of $114 million.  Related Reading: Storj (STORJ) Wyckoff Analysis (11 to 20 Dec 2023) Feature image from Canva, chart from TradingView"
  }
]