[
  {
    "source": "Crypto Daily",
    "date": "2023-12-29T22:06:00.000Z",
    "title": "Solana (SOL) races over $100, Ethereum (ETH) nears $2,500 new token Pushd (PUSHD) set for Gold",
    "url": "https://cryptodaily.co.uk/2023/12/solana-sol-races-over-100-ethereum-eth-nears-2500-new-token-pushd-pushd-set-for-gold",
    "description": "With values continuously changing and new projects being born, the cryptocurrency market has been inhaling people's investment."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-29T21:54:51.000Z",
    "title": "Dogecoin (DOGE) price leads holders to switch to Solana (SOL) and Everlodge (ELDG) ahead of bull market",
    "url": "https://cryptodaily.co.uk/2023/12/dogecoin-doge-price-leads-holders-to-switch-to-solana-sol-and-everlodge-eldg-ahead-of-bull-market",
    "description": "Despite crypto market growth slowing down, Dogecoin’s value has remained relatively strong. The project’s value has increased by 17.70% in the last 30 days"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-29T21:44:30.000Z",
    "title": "Critical Ethereum (ETH) Levels Propel Investors Toward BONK (BONK) and Promising Pullix (PLX)",
    "url": "https://cryptodaily.co.uk/2023/12/critical-ethereum-eth-levels-propel-investors-toward-bonk-bonk-and-promising-pullix-plx",
    "description": "Ethereum (ETH) shows signs of weakness, but there are mixed signals as whales keep amassing impressive amounts of ETH."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T22:07:29.000Z",
    "title": "How Justin Sun played a part in creating Ethereum",
    "url": "https://www.cryptopolitan.com/justin-sun-played-part-in-creating-ethereum/",
    "description": "Exploring the hidden corridors of the cryptocurrency world often reveals untold stories of collaboration and influence. One such narrative is that of Justin Sun, the founder of Tron, and his impact on the early development of Ethereum, a leading name in the crypto universe. This tale isn&#8217;t just about technological innovation; it’s a story of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:57:47.000Z",
    "title": "Spot Bitcoin ETF gains favor with Goldman Sachs",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-gains-favor-with-goldman-sachs/",
    "description": "In a recent interview, Mathew McDermott, the Head of Digital Assets at Goldman Sachs, expressed his optimism about the potential approval of spot Bitcoin and Ethereum ETFs (Exchange Traded Funds). McDermott believes that these ETFs will not only broaden and deepen the liquidity in the crypto market but also pave the way for increased institutional [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:48:41.000Z",
    "title": "Crypto stocks ending 2023 on a sour note",
    "url": "https://www.cryptopolitan.com/crypto-stocks-ending-2023-on-a-sour-note/",
    "description": "As 2023 draws to a close, the crypto market is witnessing a downturn in the performance of crypto-related stocks. Investors are rushing to cash in their profits on the final trading day of the year, leading to significant dips in the prices of various crypto assets. Crypto&#8217;s Volatile Year Crypto exchange Coinbase and business intelligence [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:43:00.000Z",
    "title": "The great 2023 crypto performance award – Who won?",
    "url": "https://www.cryptopolitan.com/the-great-2023-crypto-performance-award/",
    "description": "The cryptocurrency market has had a rollercoaster year in 2023, with soaring highs and unexpected twists. Bitcoin, the king of cryptocurrencies, has seen impressive gains of over 150%, while Ethereum, its closest rival, recorded nearly 100% growth. However, the spotlight isn&#8217;t just on these digital assets; stocks and ETFs tied to the crypto world have [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T22:08:59.000Z",
    "title": "Web3 needs to regress before we can progress in 2024 | Opinion",
    "url": "https://crypto.news/web3-needs-to-regress-before-we-can-progress-in-2024-opinion/",
    "description": "On the surface, things now seem very different from a year ago, with Bitcoin  (BTC) being more than double the $16,000-17,000 and the total market cap of crypto being comfortably above a trillion dollars. While the prices do indeed reflect&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T22:00:50.000Z",
    "title": "Record Crypto Options Volume Expires Pre-Bitcoin ETF Deadline: Analyzing BTC And ETH Reactions",
    "url": "https://www.newsbtc.com/news/record-crypto-options-volume-expires-pre-bitcoin-etf-deadline-analyzing-btc-and-eth-reactions/",
    "description": "The recovery of the overall crypto market this year has spurred a surge in the digital-asset derivatives market as institutional investors seek exposure to the crypto space.  According to a recent Bloomberg report, the deadline for US regulators to approve or reject Bitcoin (BTC) exchange-traded funds (ETFs) has prompted traditional investors to turn to crypto options and futures, leading to unprecedented trading volumes. Crypto Options Trading Hits Record High Before the options expiry on Friday morning, crypto options trading volume reached a new all-time high, with options worth a notional value of $11 billion, as highlighted by Bloomberg. Of this total, Bitcoin contracts accounted for $7.7 billion, while Ethereum (ETH) options represented $3.5 billion. Related Reading: Here’s The Reason The Solana price Fell 8% To $98 Despite the expiration of many options, the impact on the major cryptocurrencies has been limited.  With its strong support floor at $42,000, Bitcoin has maintained its position for a potential uptrend once bullish momentum returns and buying pressure increases.  Over the past 24 hours, Bitcoin has traded within the same range as the previous day, at $42,200, experiencing only a 0.4% decline. Nevertheless, Bitcoin has yet to fully recover from its 3.4% drop over the past seven days. In contrast, ETH was hit by the expiration of options contracts. Ethereum, the second-largest cryptocurrency on the market, fell more than 2%. EHT dropped to $2,316 after hitting an annual high of $2,445 on Thursday. However, while heightened trading activity may accompany the expiration of options, it is unlikely to impact spot market prices, according to Luuk Strijers significantly, Deribit&#8217;s chief commercial officer.  Strijers notes that clients are rolling their positions to 2024 expiries, and additional activity is anticipated after the expiry. The focus of attention and trading activity will primarily be on the impending ETF decision, Bloomberg notes. Surge From Traditional Asset Managers  The cryptocurrency market has undergone a strong rally this year, with Bitcoin surging nearly 160% following a turbulent 2022 marked by industry scandals and price declines.  The recovery has been fueled partly by the optimism surrounding the potential approval of spot Bitcoin ETFs, which would attract a broader range of investors to the asset class. Ryan Kim, head of derivatives at digital-asset prime brokerage FalconX, highlights the growing participation from crossover macro accounts, referring to large traditional asset managers allocating a small percentage of their portfolios to cryptocurrencies and crypto-focused hedge funds. In addition, according to Bloomberg, perpetual futures, a favored tool for leveraging crypto trades, are trading at a significant premium compared to spot prices, indicating rising demand for such products. Related Reading: ARK Invest Pivots To Bitcoin As Cathie Wood Expects BTC Price To Explode Overall, the surge in the cryptocurrency derivatives market, driven by options expiry and the pending decision on Bitcoin ETFs, reflects the growing interest of institutional investors in the crypto space.  The record-breaking trading volumes and increased participation from traditional asset managers highlight the evolving landscape of digital assets.  As the market awaits the regulatory verdict on Bitcoin ETFs, it remains to be seen how these developments will shape the future trajectory of the crypto market and its integration with traditional financial systems. Featured image from Shutterstock, chart from TradingView.com "
  }
]