[
  {
    "source": "CoinDesk",
    "date": "2023-10-26T19:46:51.000Z",
    "title": "Arbitrum Foundation Says 'Orbit' for Layer-3 Networks Now Ready for Mainnet",
    "url": "https://www.coindesk.com/tech/2023/10/26/arbitrum-foundation-says-orbit-for-layer-3-networks-now-ready-for-mainnet/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Orbit is a program for developers to spin up their own layer-3 blockchains atop Arbitrum, which in turn is the largest layer-2 network atop the Ethereum blockchain."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-26T20:00:36.000Z",
    "title": "Bitcoin Senator Urges ‘Swift Action’ Against Binance, Tether for Links to Terrorist Groups",
    "url": "https://decrypt.co/203416/us-lawmakers-urge-doj-to-choke-off-terrorist-funding-by-targeting-binance-and-tether",
    "description": "The bipartisan letter comes after lawmakers flagged the use of crypto in terrorism to the Biden Administration. "
  },
  {
    "source": "Decrypt",
    "date": "2023-10-26T19:52:50.000Z",
    "title": "Future Fashion Summit Connects Luxury Houses, Digital Platforms in Paris",
    "url": "https://decrypt.co/203414/future-fashion-summit-connects-luxury-houses-digital-platforms-in-paris",
    "description": "“There’s definitely a shift happening from mobile devices to wearables,” said Snapchat’s global head of luxury."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T19:49:03.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Sam Bankman-Fried testified at his criminal trial in New York on Oc.t 26. Meanwhile, the SEC's Gary Gensler revealed the extent of the regulator's enforcement actions against the crypto sector, and blockchain forensics firm Elliptic has cleared the record on the amount of crypto donations to Hamas.</p><h3>SBF reportedly believed his dealings with Alameda were legal</h3><p>Former FTX CEO Sam Bankman-Fried didn't think there was anything wrong with <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testifies-without-jury\">taking FTX deposits through Alameda Research</a>, according to reports from his ongoing trial in New York.</p><p>Bankman-Fried took the stand on Oct. 26, where he was questioned about his use of the Signal messaging app and other matters related to his failed crypto empire.</p><p>\"Did you believe taking FTX deposits through Alameda was legal?” defense attorney Mark Cohen asked. \"I did,\" Bankman-Fried said. “I was CEO of both at that time.”</p><p>Bankman-Fried is <a href=\"https://cointelegraph.com/news/prosecutors-rest-case-sam-bankman-fried-testify\">the last witness</a> to take the stand in his criminal proceedings. Judge Kaplan said the jury will decide Bankman-Fried's fate \"in the first few days of next week.\"</p><p>The former FTX CEO has pleaded not guilty to all seven charges in his criminal case. However, he's expected to face five more counts in a second trial slated for March 2024. </p><h3>Gary Gensler teases details of SEC’s $5B take from enforcement actions, shades crypto</h3><p>United States Securities and Exchange Commission (SEC) Chair Gary Gensler’s speech at the 2023 Securities Enforcement Forum shed light on the regulatory body’s enforcement actions amounting to $5 billion in judgments and orders. </p><p>However, Gensler’s dig at the cryptocurrency market became a talking point for the crypto community on social media when he said: “Don’t get me started on crypto. I won’t even name all the individuals we’ve charged in this highly noncompliant field.”</p><p>While talking about the economic perspective of the SEC’s enforcement action, Gensler noted that the agency filed more than 780 enforcement actions in 2023, including over 500 standalone cases. The enforcement actions led to judgments and orders totaling $5 billion, of which $930 million was distributed to harmed investors.</p><p>Gensler added that the SEC had filed lawsuits against 40 firms for violations of various rules and regulations since December 2021, leading to more than $1.5 billion in penalties. Gensler revealed that the SEC settled recordkeeping-related charges with 23 firms in the last fiscal year alone.</p><p>In his speech, the SEC chief reiterated his earlier stance on crypto, claiming that most of the crypto market falls under the securities bracket and must be governed under the same law. In his explanation of the broad definition of security, Gensler explained the concept of an investment contract and why a major chunk of the cryptocurrency market resembles it. </p><p>According to Gensler, most cryptocurrency assets will pass the investment contract test, bringing them under securities regulations.</p><h3>'No evidence' Hamas is raising millions in crypto, says Elliptic</h3><p>Blockchain forensic firm Elliptic has clarified there is “no evidence” suggesting that Hamas is receiving a significant volume of cryptocurrency donations, contrary to recent media reports. </p><p>“There is no evidence to support the assertion that Hamas has received significant volumes of crypto donations,” Elliptic <a href=\"https://www.elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in an Oct. 25 statement. The amounts raised “remain tiny,” the firm added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Elliptic corrects the record. Your move, <a href=\"https://twitter.com/WSJ?ref_src=twsrc%5Etfw\">@wsj</a><a href=\"https://t.co/eDXmsRAPhq\">https://t.co/eDXmsRAPhq</a></p>&mdash; nic  carter (@nic__carter) <a href=\"https://twitter.com/nic__carter/status/1717254993638469833?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Elliptic’s <a href=\"https://www.elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> was framed as a rebuttal to recent articles and letters written by The Wall Street Journal and United States lawmakers, which the firm says had misinterpreted data to make the case that cryptocurrency is widely used to fund Hamas’ \"terrorist” activities.</p><p>As an example, Elliptic pointed to a “prominent” Hamas cryptocurrency fundraising campaign, operated by Gaza Now, a pro-Hamas news outlet, which has only raised $21,000 since the Hamas attack on Israel on Oct. 7.</p><p>Of the $21,000 raised, $9,000 was frozen by stablecoin issuer Tether, while another $2,000 was frozen after it was <a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\">sent to a cryptocurrency exchange</a> — presumably to cash out, Elliptic noted.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-26T20:00:28.000Z",
    "title": "Kraken to turn over select customer data to IRS after July court loss",
    "url": "https://cryptoslate.com/kraken-to-turn-over-select-customer-data-to-irs-after-july-court-loss/",
    "description": "<p>Kraken alerted users by email t on Oct. 25 that it would provide certain customer information to the Internal Revenue Service (IRS). The crypto exchange company said that the IRS issued a summons in May 2021 and ordered it to provide a variety of records and data. Kraken explained that it attempted to fight those [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kraken-to-turn-over-select-customer-data-to-irs-after-july-court-loss/\">Kraken to turn over select customer data to IRS after July court loss</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T20:00:37.000Z",
    "title": "Forget 2023, Here Are The Major XRP Price Predictions For 2024",
    "url": "https://www.newsbtc.com/analysis/xrp/2023-xrp-price-predictions-2024/",
    "description": "The official dismissal of the US Securities and Exchange Commission’s (SEC) claims against Ripple’s CEO Brad Garlinghouse and its co-founder Chris Larsen has reinvigorated predictions about the XRP price future trajectory. With the year coming to a close, some financial experts are already looking to 2024 and have made their expectations known as to the XRP price in 2024.   XRP Price Could Go Above $1 Some financial specialists have given their thoughts on XRP’s price and factors that could ultimately affect the token’s trajectory. One of these experts happens to be Gillian Dewar, the Chief Financial Officer (CFO) of Crediful, who believes that the token could rise to as high as $1 (and even go higher)  based on certain conditions.  Related Reading: Anatomy Of A Bull Market: The Bitcoin Roadmap To $70,000 These conditions include XRP’s adoption rate and the state of the broader crypto market. Ripple uses XRP as its utility token in processing cross-border transactions for its clients. Some of these clients include global financial institutions, and Dewar believes that XRP’s adoption, among them, could have a significant impact on the token’s future price pattern.  Rising To $2 Financial analyst Lauren Yarpei didn’t give an exact price that XRP could attain at the start of 2024, although she noted that some other financial experts project that it could rise to as high as $2 at the start of next year. Dom Farnell, a co-founder of The Investors Center, is really bullish on the token as he labels XRP as one of the best altcoins. Although he didn’t give a timeframe, he believes that the XRP community will soon witness the token hitting a new all-time high (ATH).  XRP Above $10 On the more optimistic side, crypto analyst Egrag Crypto believes that 2024 will be the year when the XRP price experiences parabolic growth. In an analysis posted on X (formerly Twitter), Egrag told their followers that the altcoin could explode 2,500% in 2024 which would mean that the XRP price climbs above $10. In another prediction, Egrag has outlined a possible XRP price move to $30, which would happen sometime in the bull market. XRP showing strength &#124; Source: XRPUSD on Tradingview.com XRP Price Between $14 And $17 Another crypto analyst puts the XRP price between $14 and $17 in the upcoming year. Like Egrag, the analyst sees the altcoin crossing the $10 dollar mark next year, something that would validate the expected 2,500% move upward. On a longer time frame, the analyst expects XRP to climb as high as $24 around 2026-2027. Once again, validating Egrag&#8217;s prediction for the altcoin&#8217;s price. Related Reading: Top 3 XRP Developments You Should Be Aware Of That Could Boost Price Sending XRP To $500 Although the prediction of Wells Fargo Manager Shannon Thorp, is on a much longer timeframe, it is important to mention that the analyst believes that the XRP price will reach $500. Thorp uses the fact that Ripple is moving into the cross-border payments sector, and capturing a good portion of that market share will send XRP surging in no time. The analyst, however, puts the timeframe for this sometime in 2027. Featured image from YouTube, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-26T20:00:34.000Z",
    "title": "One Bitcoin Indicator Strongly Suggesting BTC Not Going Back To Significantly Lower Prices: Jason Pizzino",
    "url": "https://dailyhodl.com/2023/10/26/one-bitcoin-indicator-strongly-suggesting-btc-not-going-back-to-significantly-lower-prices-jason-pizzino/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/not-going-back-lower.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst thinks one metric indicates Bitcoin (BTC) is likely to continue upward rather than reversing course. In a new YouTube video, Jason Pizzino tells his 291,000 YouTube subscribers to pay attention to the market-value-to-realized-value (MVRV) Z-score, which pulls out the extremes in the data between market value and realized value to attempt [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/26/one-bitcoin-indicator-strongly-suggesting-btc-not-going-back-to-significantly-lower-prices-jason-pizzino/\">One Bitcoin Indicator Strongly Suggesting BTC Not Going Back To Significantly Lower Prices: Jason Pizzino</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-26T19:55:17.000Z",
    "title": "Trader Updates Outlook on Altcoin That’s Exploded Over 1,000% in Two Months, Sets Targets for Solana",
    "url": "https://dailyhodl.com/2023/10/26/trader-updates-outlook-on-altcoin-thats-exploded-over-1000-in-two-months-sets-targets-for-solana/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Based-Gaming-Altcoin-Suddenly.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst is updating his outlook on one Ethereum (ETH)-based altcoin after an explosive two months. Pseudonymous trader Altcoin Sherpa tells his 197,000 followers on the social media platform X that the decentralized oracle protocol Tellor Tributes (TRB) is showing how quickly altcoins can soar out of lengthy market corrections. TRB was trading [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/26/trader-updates-outlook-on-altcoin-thats-exploded-over-1000-in-two-months-sets-targets-for-solana/\">Trader Updates Outlook on Altcoin That’s Exploded Over 1,000% in Two Months, Sets Targets for Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]