[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T06:33:17.000Z",
    "title": "Forget Cardano: These Altcoins Ready to Surge",
    "url": "https://www.cryptopolitan.com/forget-cardano-these-altcoins-ready-to-surge/",
    "description": "The current crypto market is witnessing a notable phase in the journey of Cardano (ADA), which has been trading inside a corrective pattern since reaching its high in December 2023. Despite several attempts, ADA has struggled to break out from this pattern, leading to a significant fall in its value. This trend is evident in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-20T06:18:35.000Z",
    "title": "Fidelity Bitcoin Spot ETF Records $1 Billion In Net Inflows – Details",
    "url": "https://www.newsbtc.com/news/bitcoin/fidelity-bitcoin-spot-etf-records-1-billion-in-net-inflows-details/",
    "description": "Data from the trading analytics platform BitMEX Research reveals that Fidelity&#8217;s Bitcoin spot ETF &#8211; FBTC &#8211; has now witnessed a total inflow of over $1 billion. This development comes as BTC attempts to rebound from its recent dip over the last two weeks with a 1.56% gain in the past day, based on data from CoinMarketCap.   Related Reading: Crypto Analyst Predicts Potential Trend For Bitcoin As Price Slips Fidelity Joins BlackRock On Exclusive $1-B List, As Grayscale’s ETF Continues To Bleed Following the official launch of Bitcoin spot ETF trading on January 11, Fidelity has now become the second asset manager, with its BTC spot ETF recording an accumulative inflow of $1 billion. According to BitMEX Research, Fidelity’s FBTC experienced an inflow of $177.9 million on January 18, bringing its total inflows to $1.1 billion within five days of trading.  FBTC now sits at the same table as BlackRock’s IBIT, whose total inflows are valued at $1.2 billion. Together, both investment funds by Fidelity and BlackRock now account for over 67% of the $3.4 billion inflows recorded in the Bitcoin spot ETF market so far.  Other Bitcoin spot ETFs with a notable positive performance include Bitwise’s BITB, Ark Invest’s ARKB, and Invesco’s BTCO, which have posted individual total inflows of $395.5 million, $320.9 million, and $194.8 million, respectively.  Bitcoin Spot ETF Flow data &#8211; Day 5 Data out for all providers Net outflow of $131.6m on day 5 for all spot ETFs, large $579.6m GBTC outflow pic.twitter.com/McHZrRghtu — BitMEX Research (@BitMEXResearch) January 19, 2024 On the other hand, Grayscale’s GBTC continues to experience outflows on a massive scale.  BitMEX Research reveals that GBTC recorded an outflow of $579.6 million on January 18, leading the Bitcoin spot ETF market to witness a net outflow of $131.6 million. This represented the second day the BTC spot ETF market recorded a net outflow since its launch.  GBTC&#8217;s total outflows are now valued at $2.1 billion, resulting in Bitcoin spot ETFs having a cumulative net inflow of only $1.3 billion despite the $1 billion status of BlackRock and Fidelity’s ETFs. Source: BitMEX Research Related Reading: Analyst: Until Bitcoin Retests $61k, The BTC Top Is Not In Bitcoin’s Price Overview Against popular predictions, Bitcoin has witnessed a price decline in the last two weeks following the approval of the much-anticipated BTC spot ETF on January 10. Many analysts have attributed this unexpected development to the massive selling pressure generated by GBTC’s outflows.  At the time of writing, Bitcoin trades at $41,536, with a decline of 2.55% and 5.50% in the last seven and 14 days, respectively. As earlier stated, the premier cryptocurrency has garnered some gains of 1.56% in the last day, which may be indicative of a recovery, however, it is too early to call. BTC trading at $41,561 on the daily chart &#124; Source: BTCUSDT chart on Tradingview.com Featured image from Investopedia, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-20T06:26:37.000Z",
    "title": "XRP Lawyers Laugh at the SEC’s Analogy for Crypto Investment ",
    "url": "https://coinedition.com/xrp-lawyers-laugh-at-the-secs-analogy-for-crypto-investment/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyers Laugh at the SEC’s Analogy for Crypto Investment \" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Stuart Alderoty slams SEC for their ‘laughable’ analogy of an ecosystem of oranges for cryptocurrencies. When the SEC marked Bitcoin as a non-security, the reason put forward was that Bitcoin doesn’t own a network. John Deaton criticizes the SEC, stating that are not stupid, but they lack integrity. XRP advocate John Deaton, who has gathered [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-lawyers-laugh-at-the-secs-analogy-for-crypto-investment/\">XRP Lawyers Laugh at the SEC’s Analogy for Crypto Investment </a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]