[
  {
    "source": "Decrypt",
    "date": "2024-01-26T20:31:02.000Z",
    "title": "Bitcoin Will Crash—and Hard, Says This Crypto Bigwig",
    "url": "https://decrypt.co/214444/bitcoin-will-crash-hard-2024-burniske",
    "description": "The price of the biggest cryptocurrency could drop as low as $25,000, says ARK Invest’s ex-crypto lead."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T20:30:02.000Z",
    "title": " BlackRock’s IBIT Bitcoin ETF crosses $2B in market cap ",
    "url": "https://cointelegraph.com/news/blackrock-ibit-bitcoin-etf-crosses-2-billion-market-cap",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZWZlOTNkMTUtYzIxZS00MGRmLWE5NjctM2E3ZDQ3YzY5MWMwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Inflows in recent days and a recovery in Bitcoin’s price on Jan. 26 contributed to BlackRock's ETF performance. </p>\n                    <p><p>BlackRock's Bitcoin exchange-traded fund (ETF) reached $2 billion in assets under management (AUM) on Jan. 26, just two weeks after it <a href=\"https://cointelegraph.com/news/bitcoin-etfs-trading-cboe-nyse-arca-nasdaq\">debuted on the Nasdaq</a>. </p><p>According to data <a href=\"https://twitter.com/JSeyff/status/1750944975901086199\" target=\"_blank\" rel=\"noopener nofollow\">released</a> by Bloomberg analyst James Seyffart, Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price performance intraday has pushed the fund’s market capitalization to $2.11 billion. The cryptocurrency price<a href=\"https://cointelegraph.com/news/bitcoin-traders-expect-a-return-to-swing-highs-after-btc-price-hits-42-000\"> has broken through $42,000 for the first time</a> in nearly seven days after a recent sell-off following the launch of ETFs on Jan. 11.</p><p>Assets under management is a term used to describe the total market value of all the financial assets held by a fund on behalf of its clients. This means that BlackRock's iShares Bitcoin Trust (IBIT) is leading in the race for investors’ capital, just ahead of Fidelity’s Wise Origin Bitcoin Fund (FBTC) with $1.8 billion in flows over the previous ten days. </p><p><a href=\"https://cointelegraph.com/news/blackrock-ibit-bitcoin-etf-crosses-2-billion-market-cap\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T20:39:04.000Z",
    "title": "CFTC issues warning on AI-powered crypto scams",
    "url": "https://www.cryptopolitan.com/cftc-issues-warning-ai-powered-crypto-scams/",
    "description": "The Commodity Futures Trading Commission (CFTC) has issued a consumer alert cautioning individuals about the proliferation of artificial intelligence-fueled scams, particularly those promising significant returns through the use of cryptocurrency arbitrage algorithms. The agency has highlighted the dangers posed by scammers who make bold claims about AI&#8217;s capabilities to generate substantial profits through trading. Growing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T20:24:36.000Z",
    "title": "ECB sees Euro becoming a political weapon in Europe",
    "url": "https://www.cryptopolitan.com/euro-becoming-a-political-weapon-in-europe/",
    "description": "The recent rumblings within the European Central Bank (ECB) signal a growing concern that the Euro, Europe&#8217;s flagship currency, might be edging towards becoming a political pawn amidst the escalating geopolitical tensions. With the European Union (EU) eyeing the hefty reserves of frozen Russian assets, a debate rages on the implications of such a move, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T20:15:08.000Z",
    "title": "Bitcoin’s troubled times: Is there an end in sight?",
    "url": "https://www.cryptopolitan.com/bitcoins-troubled-times-is-an-end-in-sight/",
    "description": "The realm of Bitcoin (BTC) is currently navigating through a turbulent phase, with recent developments stirring the pot and leaving investors and enthusiasts alike pondering the future of this digital currency giant. The past fortnight alone has witnessed a precipitous 20% decline in Bitcoin&#8217;s value, a development that has left market watchers scratching their heads [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-26T20:29:38.000Z",
    "title": "Silk Road drug lord forfeits $150m in DEA’s largest ever crypto seizure",
    "url": "https://crypto.news/silk-road-drug-lord-forfeits-150m-in-deas-largest-ever-crypto-seizure/",
    "description": "Silk Road drug lord, who was extradited from the U.K., admits to operating an illicit drug network and surrenders $150 million in crypto. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-26T20:22:30.000Z",
    "title": "HTX temporarily suspends proof-of-reserves amid TUSD concerns",
    "url": "https://crypto.news/htx-temporarily-suspends-proof-of-reserves-amid-tusd-concerns/",
    "description": "Crypto exchange HTX, previously known as Huobi, has unexpectedly deactivated its proof-of-reserves feature."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-26T20:15:52.000Z",
    "title": "Bitwise: Bitcoin sent to ETF wallet to benefit fund investors",
    "url": "https://crypto.news/bitwise-bitcoin-sent-to-etf-wallet-to-benefit-fund-investors/",
    "description": "Bitwise has publicly disclosed its Bitcoin ETF fund wallet, attracting unsolicited Bitcoin from ETF supporters."
  }
]