[
  {
    "source": "CoinDesk",
    "date": "2023-11-29T18:53:03.000Z",
    "title": "Protocol Village: It's Crypto Spring, as Smart-Contract Platform Index Jumps Most in 10 Months",
    "url": "https://www.coindesk.com/tech/2023/11/29/protocol-village-its-crypto-spring-as-smart-contract-platform-index-jumps-most-in-10-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Digital-asset markets are heating up, especially for blockchain tokens. In this week's Protocol issue, we highlight November's 19% jump in the CoinDesk Smart Contract Platforms Index (SMT), the biggest gain in 10 months."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-29T18:44:38.000Z",
    "title": "Binance Will Cease Support for Its BUSD Stablecoin on Dec. 15",
    "url": "https://www.coindesk.com/business/2023/11/29/binance-will-cease-support-for-its-busd-stablecoin-on-dec-15/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance said it will end support for its BUSD stablecoin on Dec. 15, following the exchange's August announcement that it would “gradually” do so after Paxos, the company that actually issued it, was ordered to stop minting the coin in February."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-29T19:06:08.000Z",
    "title": "You Can Soon Play Grand Theft Auto Games on Netflix—Here's How",
    "url": "https://decrypt.co/207889/you-can-soon-play-grand-theft-auto-games-netflix-heres-how",
    "description": "Streaming giant Netflix previously said a Grand Theft Auto deal was just a rumor, but three mobile games will launch soon to subscribers."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T19:00:00.000Z",
    "title": "NFT sales and pricing are driven by luck, scarcity, and optimism, according to multiple studies",
    "url": "http://cointelegraph.com/news/nft-sales-web3-pricing-cryptocurrency-luck-scarcity-optimism",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5f29f3ef-7b04-4319-9930-0ffa2e8fee66.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A glut of new research indicates that personal experiences may be the NFT market’s primary mover.</p>\n                    <p><p>A trio of studies published in November may shine some light on the social and psychological factors that motivate movement in the non-fungible token (NFT) market. </p><p>Researchers from Western University in Canada, Tilburg University in the Netherlands, the University of North Carolina at Chapel Hill in the U.S., and Rennes School of Business in France, across three independent studies, found that personal experiences and luck, along with asset scarcity and consumer optimism, were catalysts for the majority of market movement in the NFT space. </p><h2>NFT market movement</h2><p>In a study conducted by Guneet Kaur Nagpal of Western University and Luc Renneboog of Tilburg University, <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4622618\" target=\"_blank\" rel=\"noopener nofollow\">entitled</a> “On Non-fungible Tokens, Blockchain Hypes, and the Creation of Scarcity,” the researchers analyzed the market dynamics of “Crypto Punks,” a popular series of NFT assets. </p><p>“CryptoPunks,” write the researchers, “are among the most valued Non-Fungible Tokens (NFTs), with remarkable sales such as CP #5822 fetching USD 23.7 million in February 2022, and CP #7523 obtaining USD 11.8 million in December 2021.”</p><p>The primary findings, according to the paper, include the assessment that buyers who were already invested in Ethereum (the blockchain on which CryptoPunks assets reside) were more likely to engage in the market at higher costs and also saw higher gains. The researchers also noted that Ethereum gains and losses didn’t necessarily affect the price of NFTs, but did influence the decision to sell or resell assets. </p><p>Furthermore, the study states:</p><blockquote>“The authors establish that the creation of rarity, for both CP types and accessory combinations, which can be captured by statistical and visual measures, determines pricing.”</blockquote><p>In a separate study <a href=\"https://deliverypdf.ssrn.com/delivery.php?ID=478069124110095024111031018008008092030042006012089031090114082070104030104019080087043038022017031001018004103001000076014066110010017028007093088097086125112104100010008001005005106097120030075092077087074001010086092025095127095065083098113004003081&amp;EXT=pdf&amp;INDEX=TRUE\" target=\"_blank\" rel=\"noopener nofollow\">entitled</a> “Personal Experience Effects across Markets: Evidence from NFT and Cryptocurrency Investing,” researcher Chuyi Sun of the University of North Carolina at Chapel Hill examined transaction-level data from “about one million” wallets to study how “personal experiences” contributed to bubbles in the NFT market.</p><p>”I find that NFT investors who randomly receive more valuable NFTs in the primary market are more likely to participate in subsequent primary market sales,” writes Chuyi Sun. They add that investors who randomly receive more valuable NFT tokens are more likely to eventually purchase “more lottery-like” cryptocurrencies. </p><h2>Counterintuitive findings</h2><p>A third study, conducted by Akanksha Jalan and Roman Matkovskyy of Rennes School of Business, <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4616047\" target=\"_blank\" rel=\"noopener nofollow\">entitled</a> “The Impact of Experience, Overconfidence and Optimism on Future Cryptocurrency Ownership,” takes a deep dive into the dynamics surrounding investor optimism and their knock-on effect for the cryptocurrency and NFT markets. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/wagmi-mentality-undermining-crypto\"><strong><em>The ‘WAGMI’ mentality is undermining crypto</em></strong></a></p><p>In this study, the researchers found, counter-intuitively, that negative past experiences and investor optimism both positively affect the odds of future cryptocurrency and NFT ownership. </p><p>“The fact that individual crypto investors with negative experiences with cryptocurrencies continue to show interest in the asset class could reflect some form of self-serving bias,” write the authors, before adding “with these investors likely attributing their losses to factors beyond their control (like market volatility) rather than poor decision-making on their part.”</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T18:48:30.000Z",
    "title": "Price analysis 11/29: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, LINK, AVAX",
    "url": "http://cointelegraph.com/news/price-analysis-11-29-btc-eth-bnb-xrp-sol-ada-doge-ton-link-avax",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b6457b11-7869-44b6-b34c-df0c7c696e61.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is struggling to sustain above $38,000, but the bulls have not given up much ground, which some analysts say increases the chance of a rally to $40,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is trying to sustain above the overhead resistance of $38,000 for the second consecutive day and start the next leg of the uptrend. The excitement among market observers may have increased after the United States Securities and Exchange Commission (SEC) delayed its decision on the applications of Franklin Templeton and Hashdex exchange-traded funds. </p><p>Bloomberg ETF analyst James Seyffart speculated in a X (formerly Twitter) post that <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-january-approvals-possible-analysts\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spot-bitcoin-etf-january-approvals-possible-analysts/amp\">the SEC may have taken this step</a> “to line every applicant up for potential approval by the Jan. 10, 2024 deadline.”</p><p>While many analysts believe that the ETF listing will be a watershed moment for Bitcoin, Genesis Trading head of derivatives Joshua Lim cautioned in a X post that <a href=\"https://cointelegraph.com/news/buy-the-rumor-sell-the-news-bitcoin-etf-tradfi-sell-off\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/buy-the-rumor-sell-the-news-bitcoin-etf-tradfi-sell-off/amp\">traditional finance investors have already bought the rumor</a> and may exit the trade close to the ETF announcement when retail tries to get in.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6705c9cd-41da-47ed-960c-1a6e153010ee.png\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>However, the macroeconomic conditions in early 2024 may limit the downside. Pershing Square Capital Management CEO and founder Bill Ackman said in an interview with Bloomberg that the <a href=\"https://cointelegraph.com/news/bitcoin-whale-games-warning-btc-price-40k-us-data\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-whale-games-warning-btc-price-40k-us-data/amp\">U.S. Federal Reserve will cut rates sooner</a> than people expect. He anticipates rate cuts to start in Q1 instead of the market expectations of the middle of the year.</p><p>Could Bitcoin and altcoins witness a shallow correction before resuming their uptrend?</p><p>Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin again rose above the $37,980 resistance on Nov. 28, but the bulls could not achieve a close above it. This shows that the bears are fiercely defending the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/409f932b-8aa8-44ae-acf7-9926a5cd12df.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The repeated retest of a resistance level tends to weaken it. If bulls sustain the price above the 20-day exponential moving average ($36,820), the possibility of a rally to $40,000 improves. This level may act as a significant hurdle.</p><p>If bears want to prevent the up-move, they will have to quickly pull the price below the 20-day EMA and the uptrend line. That could start a decline to the solid support at 34,800. A strong bounce off this level may keep the BTC/USDT pair inside the large range between $34,800 and $38,000 for a while longer.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) again found support at the 20-day EMA ($2,006) on Nov. 27 and 28, indicating that the bulls view the dips as a buying opportunity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fe5b9afd-5ced-4097-9244-590737684956.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are expected to face stiff resistance in the zone between $2,137 and $2,200, but if buyers do not give up much ground, it will increase the possibility of a rally above $2,200. If that happens, the ETH/USDT pair will complete a large ascending triangle pattern. That could start a new uptrend, with a pattern target of $3,400.</p><p>Instead, if the price turns down and breaks below the 20-day EMA, it will signal that the bears are trying to get back in the game. The pair may then slump to the 50-day SMA ($1,853).</p><h2>BNB price analysis</h2><p>The bears tried to yank BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) below the $223 support on Nov. 27, but the bulls did not relent. This suggests demand at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7fa9a744-4985-4a7a-a007-c9e54c56d559.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will have to force the price above the 20-day EMA ($235) to start a meaningful recovery. The BNB/USDT pair could then attempt a rally to $265, where the bears may again offer a stiff resistance.</p><p>If the price again turns down from the 20-day EMA, it will suggest that the bears are trying to flip the level into resistance. That will enhance the prospects of a fall below $223. If this level gives way, the pair may collapse to $203.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) has been stuck between the moving averages for the past few days, indicating indecision among the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/08cfdcbf-f627-4b9c-b835-55815289e521.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The slightly downsloping 20-day EMA ($0.61) and the RSI near the midpoint do not indicate an advantage either to the bulls or the bears. </p><p>If buyers kick the price above the 20-day EMA, the XRP/USDT pair may rise to $0.67. Instead, if the price turns down sharply from the 20-day EMA and skids below the 50-day SMA ($0.58), it will signal that bears are trying to seize control. The selling could accelerate further if the pair plunges below $0.56.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) snapped back from the 20-day EMA ($54.71) on Nov. 28, indicating that the sentiment remains positive.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f28661d5-d984-4881-90b9-eab7eed25a15.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\">SOL/USDT daily chart. Source: <a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a></figcaption></figure><p>The bulls will try to push the price above the immediate resistance at $62.10. If they succeed, the SOL/USDT pair could climb to the local high at $68. The bulls will have to overcome this obstacle to invalidate the head-and-shoulders pattern. The failure of a bearish pattern is a bullish sign. That may start a sharp rally in the pair to $85.</p><p>The $51 level remains the key support on the downside. A break and close below this level could start a deeper correction toward the 50-day SMA ($42.25).</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) slid to the 20-day EMA ($0.38) on Nov. 27, but the bulls held their ground. This suggests that lower levels are being aggressively bought.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0881d940-fcef-4636-84f7-64d111ade543.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The higher lows of the past few days improves the prospects of an upside breakout. If the bulls shove the price above $0.40, the ADA/USDT pair could pick up momentum and climb to $0.42 and later to $0.46.</p><p>Time is running out for the bears. If they want to make a comeback, they will have to tug the price below the 20-day EMA. That may hit stops of short-term traders and the pair may fall to the solid support at $0.34. </p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been repeatedly taking support at the 20-day EMA ($0.08), indicating that lower levels are being purchased.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/73ca8fc4-7cdc-427b-94f0-b0325cb160d1.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The upsloping moving averages and the RSI in the positive territory indicate that the path of least resistance is to the upside. Buyers will try to propel the price to $0.09 and next to $0.10, where they are likely to encounter selling by the bears.</p><p>On the downside, the 20-day EMA remains the key level to watch out for. If this level crumbles, the DOGE/USDT pair may drop to the 50-day SMA ($0.07) and subsequently to the crucial support at $0.06.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sofi-technologies-cease-crypto-services-december-19\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sofi-technologies-cease-crypto-services-december-19/amp\"><strong><em>SoFi Technologies to cease crypto services by Dec. 19</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) has been trading above the 20-day EMA ($2.37) for the past few days, but the bulls are struggling to push the price to $2.59. This suggests that demand dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e7bafe2c-b9d4-449d-b904-797080f2bfb5.png\"><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears will try to gain the upper hand by yanking the price below the moving averages. If they manage to do that, the TON/USDT pair could decline to the psychological level of $2 and then to $1.89.</p><p>On the upside, the first hurdle is at $2.59. If buyers surmount this resistance, the pair could rally to $2.77. Sellers may offer stiff opposition in the zone between $2.77 and $2.90, but if bulls do not allow the price to dip below $2.59, a new uptrend to $4.03 could begin.</p><h2>Chainlink price analysis</h2><p>Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) again found support at the 20-day EMA ($14.07) on Nov. 28, indicating that the bulls are vigorously guarding this level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d6aff777-39a1-44c5-84ce-6f46527d19b5.png\"><figcaption style=\"text-align: center;\"><em>LINK/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AlinkUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The LINK/USDT pair is likely to face selling at the $15.40 mark as the bears have successfully held this resistance during three previous attempts. If the price turns down from $15.40, it will increase the likelihood of a drop to $12.83.</p><p>On the contrary, if bulls drive the price above $15.40, the pair may challenge the local high at $16.60. The up-move could resume, and the pair may reach $18.30 if this level is surpassed.</p><h2>Avalanche price analysis</h2><p>Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) rebounded off the 20-day EMA ($19.35) on Nov. 28, indicating that the sentiment remains positive and traders are buying on dips. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fde92ca0-39a3-4c8e-a31b-a3cb48611e0b.png\"><figcaption style=\"text-align: center;\"><em>AVAX/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AavaxUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will have to overcome the resistance at $22 to strengthen their position. The AVAX/USDT pair may then rise to $24.69. Sellers are likely to mount a strong defense at this level because if this resistance is taken out, the pair could travel to $28.50 as there is no major resistance in between.</p><p>Contrary to this assumption, if the price turns down from $22, it will suggest that bears remain active at higher levels. The advantage will tilt in favor of the bears if they sink the pair below $18.90.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T19:00:55.000Z",
    "title": "Genesis, Digital Currency Group reach agreement on new settlement plan",
    "url": "https://cryptoslate.com/genesis-digital-currency-group-reach-agreement-on-new-settlement-plan/",
    "description": "<p>Genesis Global and its parent company, Digital Currency Group (DCG), are closing in on a settlement agreement, according to a Nov. 28 court filing. The filing includes an amended settlement plan that both companies have agreed on and urged other stakeholders to vote in favor. In a complex bankruptcy case, Genesis Global had previously filed [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/genesis-digital-currency-group-reach-agreement-on-new-settlement-plan/\">Genesis, Digital Currency Group reach agreement on new settlement plan</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-29T18:45:28.000Z",
    "title": "Binance Called Out by Philippines for Not Having Operating License",
    "url": "https://cryptobriefing.com/binance-called-out-by-philippines-for-not-having-operating-license/?utm_source=feed&utm_medium=rss",
    "description": "Philippine regulator flag Binance over licensing issues and warn of potential fines for local promoters of the cryptocurrency exchange."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T19:00:51.000Z",
    "title": "99% of Americans unable to afford housing right now",
    "url": "https://www.cryptopolitan.com/99-of-americans-unable-to-afford-housing/",
    "description": "America’s housing market, once a symbol of the country&#8217;s robust economy, has now turned into an elusive dream for nearly all Americans. In an astonishing turn of events, recent data reveals that a staggering 99% of the population is priced out of the housing market. This crisis is not confined to the bustling city centers ... <a title=\"99% of Americans unable to afford housing right now\" class=\"read-more\" href=\"https://www.cryptopolitan.com/99-of-americans-unable-to-afford-housing/\" aria-label=\"More on 99% of Americans unable to afford housing right now\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T18:47:03.000Z",
    "title": "Crypto’s tumult: Altcoins stall ahead of $650m token release",
    "url": "https://www.cryptopolitan.com/altcoins-stall-ahead-of-650m-token-release/",
    "description": "The cryptocurrency market is witnessing a significant shakeup as several major altcoins, including the likes of dYdX (DYDX), Optimism (OP), and Sui (SUI), experience a downturn. This slump comes at a crucial juncture when these cryptocurrencies brace for an influx of nearly $650 million in tokens, potentially altering their market dynamics drastically. The Ripple Effect ... <a title=\"Crypto&#8217;s tumult: Altcoins stall ahead of $650m token release\" class=\"read-more\" href=\"https://www.cryptopolitan.com/altcoins-stall-ahead-of-650m-token-release/\" aria-label=\"More on Crypto&#8217;s tumult: Altcoins stall ahead of $650m token release\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T18:44:47.000Z",
    "title": "New Bitcoin mining pool ‘Ocean’ makes waves with Jack Dorsey’s $6.2M investmen",
    "url": "https://www.cryptopolitan.com/new-bitcoin-mining-pool-ocean-makes-waves/",
    "description": "Jack Dorsey, co-founder of Twitter and a prominent advocate for Bitcoin, has taken a bold step in the world of cryptocurrency by leading a $6.2 million seed round for Mummolin, the parent company of a new decentralized Bitcoin mining pool called Ocean. This move is aimed at helping miners regain control of block rewards and ... <a title=\"New Bitcoin mining pool &#8216;Ocean&#8217; makes waves with Jack Dorsey&#8217;s $6.2M investmen\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-bitcoin-mining-pool-ocean-makes-waves/\" aria-label=\"More on New Bitcoin mining pool &#8216;Ocean&#8217; makes waves with Jack Dorsey&#8217;s $6.2M investmen\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T19:08:16.000Z",
    "title": "BIS illustrates how CBDC payments can balance privacy and transparency",
    "url": "https://crypto.news/bis-illustrates-how-cbdc-payments-can-balance-privacy-and-transparency/",
    "description": "A recent report from Project Tourbillon, led by the Bank for International Settlements' Innovation Hub, reveals significant advancements in balancing privacy and transparency in CBDCs."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T19:00:12.000Z",
    "title": "Chainlink Signal Resurfaces: Is Another 31% Rally Coming?",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-signal-resurfaces-31-rally-coming/",
    "description": "On-chain data shows that a Chainlink signal that last preceded a 31% rally for the asset&#8217;s price has just reversed. Chainlink Age Consumed Metric Has Observed A Sharp Spike Recently According to data from the on-chain analytics firm Santiment, LINK has recently seen a significant movement from old coins. The relevant indicator here is the &#8220;Age Consumed,&#8221; which tells us whether the dormant Chainlink tokens are on the move or not right now. When the indicator&#8217;s value registers a large spike, it&#8217;s a sign that the blockchain is currently observing the transfer of a significant number of old coins. Such dormant tokens belong to a cohort called the &#8220;long-term holders&#8221; (LTHs), made up of the relentless hands of the sector. Related Reading: XRP, BNB Among Altcoins Losing Correlation With Bitcoin: Data As such, this metric surging can be something to watch out for, as it means that these LTHs, who usually remain quiet no matter what&#8217;s going on in the wider market, have decided to break their dormancy. Now, here is a chart that shows the trend in the Chainlink Age Consumed over the last few months: The value of the metric appears to have shot up recently &#124; Source: Santiment on X As displayed in the above graph, the Chainlink Age Consumed indicator has observed a sharp rise recently, implying that the LTHs have been making transactions. At the peak of this latest spike, the metric&#8217;s value touched 4.28 billion, which is the highest level seen since the middle of September. Back then, the indicator registered a spike almost double in scale, and interestingly, what followed in the next couple of weeks was a 31% rally as LINK went from $6.36 to $8.22. It&#8217;s hard to say if a similar pattern would repeat for Chainlink this time since the LTHs could have broken their silence for several reasons, including for selling. An analyst has pointed out that yesterday (which was about the same time as this spike in the Age Consumed), the whales made many transactions, as the chart below shows. Looks like the metric has spiked up &#124; Source: @ali_charts on X In total, the Chainlink network observed 2,600 transactions valued over $100,000 yesterday. The spike would confirm that the LTHs who broke their dormancy weren&#8217;t just ordinary investors but the whales. Related Reading: Dogecoin To Double Its Price If This Barrier Breaks, Analyst Predicts In isolation, it&#8217;s hard to say why these two indicators recently observed a spike. Still, when looking at the latest LINK news, perhaps the most likely explanation becomes apparent. Yesterday, Chainlink staking v0.2 went live on the Ethereum blockchain, allowing the v0.1 stakers to migrate toward the new network. Thus, given the close timing of the spikes in the Age Consumed and Whale Transaction Count, it would appear quite probable that these LTHs were making transfers toward the new staking pools. LINK Price Chainlink had observed some drawdown towards the $13.7 mark just recently, but it would seem like the asset has already recovered as it&#8217;s now trading around $14.7. LINK has already recovered from its recent lows &#124; Source: LINKUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T19:08:21.000Z",
    "title": "Chainlink’s LINK Token Surges with Strong Support, Eyes New Heights",
    "url": "https://www.crypto-news-flash.com/chainlinks-link-token-surges-with-strong-support-eyes-new-heights/?utm_source=rss&utm_medium=rss&utm_campaign=chainlinks-link-token-surges-with-strong-support-eyes-new-heights",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chainlink (LINK) has been one of the most stellar performers in the past two months and analysts say that more gains are coming with strong support at $13.10. Chainlink launched a new version of its staking program this week and it has attracted 9.5 LINK tokens, with the maximum capped at 45 million tokens, or [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T18:55:00.000Z",
    "title": "Analyst Predicts Ethereum to Peak $28,000 Pushed by ETF Approval",
    "url": "https://coinedition.com/analyst-predicts-ethereum-to-peak-28000-pushed-by-etf-approval/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analyst Predicts Ethereum to Peak $28,000 Pushed by ETF Approval\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock_Plans_Another_Crypto_ETF_After_Weak_Debut_of_Its_First-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Blackrock’s Ethereum spot exchange-traded-fund filing continues to drive excitement through the crypto community as investors expect the move to push the digital asset’s price up.&#160; In a recent video, Aaron Arnold, the host of the crypto channel Altcoin Daily, noted these bullish potentials. According to the analyst, Blackrock’s ETF approval will be the demand shock [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-predicts-ethereum-to-peak-28000-pushed-by-etf-approval/\">Analyst Predicts Ethereum to Peak $28,000 Pushed by ETF Approval</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-29T19:05:46.000Z",
    "title": "‘Giant Whale’ Accumulates Over $54,000,000 Worth of Ethereum (ETH) Since September: Lookonchain",
    "url": "https://dailyhodl.com/2023/11/29/giant-whale-accumulates-over-54000000-worth-of-ethereum-eth-since-september-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto whale is drawing attention for accumulating a massive amount of Ethereum (ETH) within the last couple of months. According to blockchain tracking service Lookonchain, a deep-pocketed investor has amassed 31,149 ETH worth about $54,900,000 since September. Lookonchain says that this week, the whale purchased 4,865 additional ETH while the leading smart contract platform [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/29/giant-whale-accumulates-over-54000000-worth-of-ethereum-eth-since-september-lookonchain/\">‘Giant Whale’ Accumulates Over $54,000,000 Worth of Ethereum (ETH) Since September: Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]