[
  {
    "source": "CoinDesk",
    "date": "2023-09-06T09:42:00.000Z",
    "title": "Bitcoin Set to Form Death Cross as Dollar Index Teases Golden Crossover",
    "url": "https://www.coindesk.com/markets/2023/09/06/bitcoin-set-to-form-death-cross-as-dollar-index-teases-golden-crossover/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A death cross indicates a potential long-term bearish shift in momentum while a golden cross suggests the opposite."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-06T09:42:39.000Z",
    "title": "PUBG Developers Unveil Cosmos-Based Settlus Blockchain for USDC Settlements",
    "url": "https://decrypt.co/155092/pubg-developers-unveil-settlus-a-cosmos-based-blockchain-for-usdc-settlements",
    "description": "Krafton, the developer behind popular battle royale title PUBG: Battlegrounds, has joined the Cosmos with new layer-1 blockchain Settlus."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T09:58:33.000Z",
    "title": "Sam Bankman-Fried appeal against bail revocation 'meritless': Prosecutors",
    "url": "https://cointelegraph.com/news/prosecutors-call-former-ftx-ceo-sbf-appeal-against-bail-revocation-meritless",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/28d0ccbd-b70a-434e-bba6-8f601b2ea11f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The New York South District court revoked former FTX CEO Sam Bankman-Fried’s bail on Aug. 11 after an appeal from the prosecution in July citing multiple instances of violation of bail conditions. </p>\n                    <p><p>The United States Attorney's Office has filed an affirmation of the denial of bail to former FTX CEO Sam Bankman-Fried, claiming that he could attempt witness tampering, and stating that no release conditions would assure the safety of the witnesses. Prosecutors responded to several claims made in his appeal against the bail revocation, calling it \"meritless.\"</p><p>The prosecutors in their response argued that SBF was found to have twice committed/attempted witness tampering in violation of the court orders. Thus, in light of the continued evasions of his pre-trial release conditions, Bankman-Fried was unlikely to abide by the conditions of release.</p><p>The first time SBF attempted to contact witnesses came to light in January earlier this year when the former FTX CEO initiated contact with the then-General Counsel of FTX US, who is also a potential trial witness represented by counsel. </p><p>The second such instance came in July 2023, when a New York Times report published private journal messages of Caroline Ellison, the former CEO of Alameda and SBF’s associate. SBF’s counsel confirmed that the journal was leaked by the former FTX CEO himself. The prosecutors reached out to the District Court to highlight how SBF had covertly provided private and potentially embarrassing writings of Ellison to discredit her and potentially influence the perception of the jury in the case when it goes to trial.</p><p>On July 26 during a court conference, prosecutors appealed to revoke SBF’s bail plea based on his violations of the bail conditions and attempts to influence witnesses. Federal judge Lewis Kaplan from the District Court for the Southern District of New York, <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">revoked SBF’s bail on Aug. 11</a> after he was found to have contacted witnesses in an attempt to influence or intimidate them. The former FTX CEO had been out on bail on a $250 million bond since December 2022.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/coin-center-takes-aim-at-unconstitutional-sec-redefinition-of-an-exchange\">Coin Center takes aim at ‘unconstitutional’ SEC redefinition of an 'exchange'</a></em></strong></p><p>On Aug. 28, SBF lawyers <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyers-appeal-decision-bail-first-amendment-issues\">appealed against the revocation of the bail</a> ruling and claimed that the former FTX CEO was well within his right to talk to the press about Caroline Ellison as it was protected under the First Amendment. However, prosecutors argued that Judge Kaplan took SBF’s First Amendment rights into consideration in the ruling. The judge in the ruling had noted that “the law is that once communication is undertaken as part of or with the intent to intimidate or influence a witness, it’s a crime, and the First Amendment has nothing to do with it.”</p><p>The prosecutors made two key arguments against the SBF appeal:</p><blockquote>The District Court did not clearly err in finding probable cause to believe Bankman-Fried twice committed attempted witness tampering while on pretrial release.</blockquote><blockquote>Judge Kaplan did not clearly err in finding probable cause that Bankman-Fried attempted to tamper with Witness 1</blockquote><p>The prosecutors also argued that the defendants didn’t argue or dispute against the ruling in SBF’s attempt to witness former FTX US counsel which the judge found a clear attempt of witness tampering.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\"><strong><em>Get your money back: The weird world of crypto litigation</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-06T10:07:20.000Z",
    "title": "Owocki rejoins Gitcoin amid shifting landscape and open-source funding needs",
    "url": "https://cryptoslate.com/owocki-rejoins-gitcoin-amid-shifting-landscape-and-open-source-funding-needs/",
    "description": "<p>In a recent Gitcoin forum post, Kevin Owocki, co-founder of Gitcoin, outlined his intentions for the platform following significant changes within the company. Owocki announced his departure from Supermodular, now Buildbox, with plans to refocus his efforts on Gitcoin and its Decentralized Autonomous Organization (DAO). Owocki&#8217;s decision to return to Gitcoin, albeit in a different [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/owocki-rejoins-gitcoin-amid-shifting-landscape-and-open-source-funding-needs/\">Owocki rejoins Gitcoin amid shifting landscape and open-source funding needs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T10:07:10.000Z",
    "title": "India leads G20 in active discussions for global crypto framework",
    "url": "https://www.cryptopolitan.com/india-leads-g20-in-active-discussions-for-global-crypto-framework/",
    "description": "The G20 countries, under India&#8217;s presidency, are actively discussing the creation of a global framework for regulating cryptocurrencies. Indian Finance Minister Nirmala Sitharaman confirmed the ongoing discussions during the Global Fintech Fest on September 5, emphasizing the need for a unified approach to this emerging asset class. India&#8217;s role in shaping global crypto policy India ... <a title=\"India leads G20 in active discussions for global crypto framework\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-leads-g20-in-active-discussions-for-global-crypto-framework/\" aria-label=\"More on India leads G20 in active discussions for global crypto framework\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T09:44:34.000Z",
    "title": "Microsoft Revolutionizes AI Development with New Compiler Suite",
    "url": "https://www.cryptopolitan.com/microsoft-revolutionizes-ai-development/",
    "description": "Microsoft has taken a significant leap forward in the field of artificial intelligence with the unveiling of a suite of four cutting-edge AI compilers—Rammer, Roller, Welder, and Grinder. These powerful tools are set to revolutionize the way AI models are optimized, making development faster, better, and more powerful. A collaborative endeavor with academic institutions Developed ... <a title=\"Microsoft Revolutionizes AI Development with New Compiler Suite\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-revolutionizes-ai-development/\" aria-label=\"More on Microsoft Revolutionizes AI Development with New Compiler Suite\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-06T10:00:42.000Z",
    "title": "Crypto millionaires number exceeds 88k, report reveals",
    "url": "https://crypto.news/crypto-millionaires-number-exceeds-88k-report-reveals/",
    "description": "According to a report by the investment migration company Henley and Partners, there are 88,200 crypto millionaires worldwide, with almost half owning Bitcoin (BTC). The report reveals around 40,500 of the millionaires hold Bitcoin despite the recent price fluctuations.  Moreover,&#8230;"
  }
]