[
  {
    "source": "Decrypt",
    "date": "2023-11-22T23:46:02.000Z",
    "title": "Stability AI Audio Head Quits Over Training on Copyrighted Material. Will It Change Anything?",
    "url": "https://decrypt.co/207149/ed-newton-rex-quit-stability-ai-over-fair-use-copyright-training",
    "description": "Ed Newton-Rex shares further insights into the AI industry's approach to copyright following his very public resignation."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T00:00:52.000Z",
    "title": "BNB Price Crash To $5 Unlikely Despite Binance Critic’s Dire Predictions",
    "url": "https://www.newsbtc.com/binance/bnb-to-5-unlikely-despite-binance-critic-predictions/",
    "description": "A Binance critic, &#8220;Whale Wire,&#8221; on X, who also claims to be a crypto whale, has issued a bold prediction that BNB, the native currency of the BNB Chain and which is used to incentivize trading activity on Binance, could plunge 95% to under $5 in the coming months.  Regarding Binance agreeing to pay $4 billion in fines related to legal settlements with U.S. regulators, Whale Wire argued that tighter oversight will supposedly &#8220;destroy Binance&#8217;s entire business model.&#8221; He further contended bankruptcy could be imminent as the effects of the BNB lead to a contagion. Will The BNB Price Flash Crash? However, while increasing regulatory oversight, wind-downs, and decreased risk tolerance among traders have impacted volumes, Binance remains the world&#8217;s largest crypto exchange by client count and still facilitates the most trading globally by a wide margin as of writing on November 22.  Related Reading: Has Bitcoin Reached “Euphoria” Yet? What On-Chain Data Says For context and pulling data from CoinMarketCap (CMC), Binance continues to dominate spot crypto trading, generating over $14.7 billion in average trading volume, over 6X Coinbase, with $2.3 billion, and ahead by huge margins from Kraken, which draws 41.2 billion. The same trend can be observed in derivatives trading, where Binance leads ahead of OKX. BNB also remains firmly among the top 5 cryptos in the market cap. Besides USDT, BNB is the third largest coin by market cap, leading other altcoins, including XRP, Solana (SOL), and Cardano (ADA).  Related Reading: Ripple Integration With ISDA Ushers In $1.2 Quadrillion Market, Can XRP Breach $100? Besides its dominance, Binance has been given over a year to pay assessed fines. Meanwhile, its new CEO, Richard Teng, said the exchange will continue to enact compliance overhauls. At the same time, it is assuring clients that funds remain safe. Considering the exchange will continue operating both in the United States and globally, the transitional window offered by the DOJ could make its collapse, and that of BNB, unlikely. Binance Under Pressure, Trading Volume Falling  Even so, factoring in dropping trading volume in 2023 and the impact of losing users, especially in areas Binance pulled out from, the resulting dip in revenue could, at the end of the day, apply downward pressures on BNB. Thus far, Binance sold its business in Russia while exiting Canada and the Netherlands.  Presently, $200 remains a critical support level for BNB. Whether this line will be retested in the months ahead remains to be seen. Changing hands at around $230, BNB is technically in an uptrend in the shorter time frame. It is up 15% from October 2023 lows. However, it is still down 65% from 2021 peaks when it soared to around $670. Feature image from Canva, chart from TradingView"
  }
]