[
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T09:55:00.000Z",
    "title": "Reddit NFTs Hit $32M In Sales, Cross 10M Holders",
    "url": "https://cryptodaily.co.uk/2023/05/reddit-nfts-hit-32m-in-sales-cross-10m-holders",
    "description": "<p>Reddit NFTs have seen staggering success since their launch, with the platform registering 10 million NFT holders and hitting $32 million in sales.&nbsp;</p>\n<p>The most expensive Reddit avatar was sold for a whopping $50,000.&nbsp;</p>\nCrunching The Numbers&nbsp;\n<p>The Reddit NFT collection was released in July 2022 and has gained significant traction since and is loved by the platform&rsquo;s community. According to the available on-chain data, a staggering 9,900,465 Reddit accounts hold NFTs, with the collectibles having a market capitalization of over $38 million. Most of this success can be attributed to its trademark collections, such as Foustlings, The Senses, and poieeeyee, which have individually topped over $1 million in sales.</p>\n<p>Out of the over 9 million Reddit NFT holders, 7.7 million are single collective avatar holders. This means that these users hold a single avatar and do not operate multiple wallet addresses. The Reddit avatar marketplace on Polygon also features NFTs designed and created by independent artists from the Reddit community.&nbsp;</p>\nRapid Growth In 2023&nbsp;\n<p>While the initial surge of users collecting avatars stagnated after hitting the 3 million mark, 2023 has seen the pace pick up again. Specifically, the number of wallets has tripled over the past six months, with Reddit NFT holders increasing by 80% since the beginning of 2023. The growing user base has also resulted in thriving secondary markets for these NFTs. Data has suggested that there have been 303,033 sales, leading to a sales volume of over $32 million.&nbsp;</p>\n<p>The spike in Reddit NFT activity was pointed out by Reddit user &ldquo;ContextMelodic4212,&rdquo; who congratulated the platform. However, the user raised concerns regarding bot activity on the platform driving the growth of Reddit NFTs.</p>\nReddit Adds Support For Ubisoft&rsquo;s Rabbids&nbsp;\n<p>Reddit also announced that it is adding support for Ubisoft&rsquo;s Rabbids NFT collection. The platform tweeted the announcement from its official Twitter handle. stating,</p>\n\n<p>&ldquo;Who knew a plunger was just what your Avatar needed? In partnership with Ubisoft, we&rsquo;re bringing @RabbidsOfficial to Reddit! Get your Rabbids #RedditCollectibles now.&rdquo;</p>\n\n<p>Rabbids originally originated from the popular video game series Rayman. Ubisoft had launched the Rabbids NFT avatar collection for the metaverse game The Sandbox, becoming a pioneer for in-game NFT items. To claim the Reddit x Ubisoft Rabbid NFTs, users must log in to their Reddit account and click on &ldquo;Style Avatar.&rdquo; Users will be redirected to a new dialog box where they can select the Rabbid NFTs under the &ldquo;Explore&rdquo; tab. After selecting the NFT, they can click on &ldquo;Get&rdquo; and initiate the minting process on Polygon.&nbsp;</p>\n<p>Sandeep Nailwal, the co-founder of Polygon, praised the platform while talking about the collectible avatars in a recent AMA (Ask Me Anything) on Reddit. According to Nailwal, Reddit has been the only platform to &ldquo;crack the code&rdquo; for NFT adoption. Reddit is one of the biggest social media platforms, with over 1.6 billion users.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T10:10:34.000Z",
    "title": "Silvergate drives demand for crypto compliance",
    "url": "https://www.cryptopolitan.com/silvergate-drives-demand-crypto-compliance/",
    "description": "In the wake of Silvergate Capital Corp&#8217;s and Signature Bank&#8217;s downfall, Europe&#8217;s financial institutions catering to cryptocurrency ventures are racing to bolster their compliance teams. With a surge in demand for top-notch compliance staff, these firms are striving to meet the stringent anti-money laundering and regulatory benchmarks that come with the influx of new clientele. ... <a title=\"Silvergate drives demand for crypto compliance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/silvergate-drives-demand-crypto-compliance/\" aria-label=\"More on Silvergate drives demand for crypto compliance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T10:09:06.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T10:06:29.000Z",
    "title": "Metaverse and blockchain boost North American digital gaming markets",
    "url": "https://crypto.news/metaverse-and-blockchain-boost-north-american-digital-gaming-markets/",
    "description": "New research shows that the North American digital gaming market is poised for growth, as emerging trends, including the metaverse and blockchain technology, are reshaping the industry."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T10:00:00.000Z",
    "title": "DigiToads aims to achieve bitcoin-like growth",
    "url": "https://crypto.news/digitoads-aims-to-achieve-bitcoin-like-growth/",
    "description": "DigiToads (TOADS) could achieve growth over the next few months comparable to those registered in the early days of bitcoin"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T09:48:06.000Z",
    "title": "Worst performing crypto in May 2023",
    "url": "https://crypto.news/worst-performing-crypto-in-may-2023/",
    "description": "The global crypto market capitalization witnessed a $100 billion fall in the first two weeks of May, dropping from $1.22 trillion to $1.12 trillion. This has caused a stir in the industry, making investors worry about their assets. Here are&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T09:59:21.000Z",
    "title": "Polygon: Billion-Dollar Gateway Provider to Launch on MATIC Network, Unlocking Ethereum Scaling Advantages",
    "url": "https://www.crypto-news-flash.com/polygon-billion-dollar-gateway-provider-to-launch-on-matic-network-unlocking-ethereum-scaling-advantages/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-billion-dollar-gateway-provider-to-launch-on-matic-network-unlocking-ethereum-scaling-advantages",
    "description": "<p>AsetPay is to launch on the Polygon Network with the benefits of operating on the network to be confirmed. It seeks to leverage the power of the blockchain to provide a future-proof entry pass solution. AsetPay, a platform that enables users to buy, sell, and store cryptos, has disclosed that it would soon integrate its [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-billion-dollar-gateway-provider-to-launch-on-matic-network-unlocking-ethereum-scaling-advantages/\">Polygon: Billion-Dollar Gateway Provider to Launch on MATIC Network, Unlocking Ethereum Scaling Advantages</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T09:54:40.000Z",
    "title": "Can This GameFi Beat Stacks Crypto (STX) for Explosive Returns? Top Analysts Weigh In",
    "url": "https://www.crypto-news-flash.com/can-this-gamefi-beat-stacks-crypto-stx-for-explosive-returns-top-analysts-weigh-in/?utm_source=rss&utm_medium=rss&utm_campaign=can-this-gamefi-beat-stacks-crypto-stx-for-explosive-returns-top-analysts-weigh-in",
    "description": "<p>The crypto market is a spinning wheel that never stops. While you may be thinking the market is bearish across the board and nothing interesting seems to be happening, voila, a coin springs out of nowhere and rakes in over 20,000% return for investors. Stacks is a DeFi crypto project with high-value utility. Stack enables [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/can-this-gamefi-beat-stacks-crypto-stx-for-explosive-returns-top-analysts-weigh-in/\">Can This GameFi Beat Stacks Crypto (STX) for Explosive Returns? Top Analysts Weigh In</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-30T10:13:44.000Z",
    "title": "Meta World NFT Is Tradable on MBX Marketplace ",
    "url": "https://www.altcoinbuzz.io/blockchain-gaming/meta-world-nft-is-tradable-on-mbx-marketplace/",
    "description": "<p>Meta World My City is a real estate board-game and metaverse. MARBLEX is behind this game. They have some big news to share. Meta World NFTs are now tradable on the MBX Marketplace. This opens three new ways of earning rewards.  So, let&#8217;s dive into this new Meta World adventure, so you can get the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/blockchain-gaming/meta-world-nft-is-tradable-on-mbx-marketplace/\">Meta World NFT Is Tradable on MBX Marketplace </a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-05-30T10:00:00.000Z",
    "title": "Bitfinex to List WhiteBIT’s Native Utility Token, WhiteBIT Token",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-to-list-whitebits-native-utility-token-whitebit-token/",
    "description": "<p>ROAD TOWN, British Virgin Islands – May 30, 2023&#160; Bitfinex (https://www.bitfinex.com/), a state-of-the-art digital asset trading platform, announced today that it will be listing WhiteBIT Token, the native utility token of WhiteBIT Exchange. Founded in 2018 and originally from Ukraine, WhiteBIT is a top 20...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-to-list-whitebits-native-utility-token-whitebit-token/\">&lt;strong&gt;Bitfinex to List WhiteBIT’s Native Utility Token, WhiteBIT Token&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]