[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T12:54:20.000Z",
    "title": "Uniswap Labs Releases Its Plan for Uniswap v4, Invites Community Feedback",
    "url": "https://www.coindesk.com/tech/2023/06/13/uniswap-labs-releases-its-plan-for-uniswap-v4-invites-community-feedback/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The biggest decentralized crypto exchange is opening its development process to the public for the first time as the SEC cracks down on its centralized competitors."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T13:01:02.000Z",
    "title": "Uniswap Update Means 'The Possibilities Are Pretty Endless,' Says Developer",
    "url": "https://decrypt.co/144307/uniswap-v4-open-source-hooks-singleton",
    "description": "The platform has announced its fourth version, open sourcing the draft core code for others to build upon."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T12:56:02.000Z",
    "title": "What Is Sui? The Latest 'Solana Killer' From Former Diem Devs",
    "url": "https://decrypt.co/resources/what-is-sui-the-latest-solana-killer-from-former-diem-devs",
    "description": "Sui sets itself apart from other Layer 1 chains with its focus on instant transaction finality, reduced latency in smart contract deployment, and overall transaction speed."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T12:55:41.000Z",
    "title": "Bitcoin, Ethereum Rise as Inflation Eases to 4% in May",
    "url": "https://decrypt.co/144362/bitcoin-ethereum-rise-inflation-eases-4-may",
    "description": "The Federal Reserve is watching, with a key meeting later this week."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T12:56:28.000Z",
    "title": "Bitcoin gets closer to '51% attack' on altcoin market",
    "url": "https://cointelegraph.com/news/bitcoin-price-closer-51-attack-altcoin-cryptocurrency-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/140c6e95-f450-43ee-ace3-0336d3daad2e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin's market dominance index has failed to sustain above 50% since April 2021 — so will this time be any different?</p>\n                    <p><p>Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) percentage share in the crypto market has risen to nearly 50% in the aftermath of the last week's altcoin market rout.</p><p>On June 13, the Bitcoin Dominance Index (BTC.D), which tracks BTC's weight against other cryptocurrencies, reached 49.29%, slightly down from its two-year highs of 49.66% seen earlier this week. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f73649b2-0200-447f-9acd-eb4876d69a95.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BTC.D daily price chart. Source: TradingView</em></figcaption></figure><h2>BTC not an \"unregistered security\" </h2><p>The surge in Bitcoin dominance comes after the United States' Securities and Exchange Commission's (SEC) <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">lawsuit</a> against the crypto exchanges Binance and Coinbase. In its court filings, the commission accused many leading altcoins, including Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), of being \"unregistered securities.\"</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/sec-gary-gensler-in-2018-video-says-btc-eth-not-securities\">SEC’s Gensler says BTC, ETH ‘not securities’ in a newly surfaced video</a></strong></em></p><p>Bitcoin's market share typically rises during high market stress, given that traders view it as the least volatile, non-stablecoin crypto asset than most cryptocurrencies. For instance, at the height of <a href=\"https://cointelegraph.com/news/bitcoin-dominance-nears-50-as-research-hails-bullish-narrative-flip\">banking crisis in March 2023</a>, Bitcoin's dominance versus altcoins had also rebounded to 50%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0ea54629-b2d8-47a7-bff4-025da01b2437.png\"  /><figcaption style=\"text-align: center;\"><em>Altcoins' seven-day performance versus the U.S. dollar and Bitcoin. Source: Messari</em></figcaption></figure><p>There's also other cues suggesting Bitcoin's dominance could grow further to finally break 50%. </p><p>For instance, DWF Labs, a crypto market maker, has <a href=\"https://twitter.com/lookonchain/status/1668170561095364619\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> sent millions of dollars worth of non-Bitcoin tokens to exchanges, this potentially adding selling pressure for certain altcoins. </p><p>Independent market analyst Stack Hodler also <a href=\"https://twitter.com/stackhodler/status/1667435638033981442?s=12&amp;t=9Z7eZQ2MAn7cgruZycHUFw\" target=\"_blank\" rel=\"noopener nofollow\">suggests</a> that most crypto hedge funds would first and foremost abandon their altcoin exposure. </p><p>But not everyone is bullish on BTC dominance. Fellow analyst Moustache, for example, argues the altcoin market may have bottomed once again as Bitcoin will be unable to break the 50% mark.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a><br><br>Is the USDT-Dominance about to fall? <br><br>If so, we&#39;re in for a massive Altseason.<br><br>-Head and Shoulders pattern forming (W)?<br>-Stoch RSI heavily overbought. <br><br>In the last 3 years this has led to an Altseason 4 out of 5 times.<br><br>+ Sentiment is in the basement for most = Good. <a href=\"https://t.co/odU5jg8srF\">pic.twitter.com/odU5jg8srF</a></p>&mdash; ⓗ  (@el_crypto_prof) <a href=\"https://twitter.com/el_crypto_prof/status/1668290670547677190?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Bitcoin dominance risks pullback in June</h2><p>Chart technicals suggest that Bitcoin's dominance can indeed drop in the coming weeks as altcoins rebound.</p><p><strong><em>Related: ‘<a href=\"https://cointelegraph.com/news/btc-prague-2023-samson-mow-interview\">There’s no more exciting time than now’ for Bitcoin: BTC Prague 2023</a></em></strong></p><p>Most notably, BTC.D has failed to close decisively above the 50%-mark since April 2021, often reversing its gains due to an overbought weekly relative strength index (RSI).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/435825cd-09cc-4b32-bf3c-10092a47fae7.png\"  /><figcaption style=\"text-align: center;\"><em>BTC.D weekly performance chart. Source: TradingView</em></figcaption></figure><p>Bitcoin now faces a similar scenario with a retest of the 50% level for the first time since last summer. Meanwhile, its RSI hangs just two points below its overbought level of 70. </p><p>Therefore, if history repeats, Bitcoin's dominance will decline toward 39% by late 2023 or early 2024.</p><p>On the other hand, a breakout here will be key for BTC — to reach levels not seen in over two years. For example, analyst Crypto Rover <a href=\"https://twitter.com/rovercrc/status/1668273953637548032\" target=\"_blank\" rel=\"noopener nofollow\">sees</a> a classic bullish continuation setup with 52% being the next major hurdle if such a scenario pans out. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T12:49:16.000Z",
    "title": "May CPI report shows disinflation persisting as Bitcoin rises",
    "url": "https://cryptoslate.com/insights/may-cpi-report-shows-disinflation-persisting-as-bitcoin-rises/",
    "description": "<p>Quick Take The U.S. consumer price index report for May came in today with numbers lower than expected. The trend of decreasing inflation persists in the U.S.; however, the core index remains persistently high. Following the release of the CPI report, Bitcoin experienced a boost, increasing by 1.8% to a new value of $26,400. Based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/may-cpi-report-shows-disinflation-persisting-as-bitcoin-rises/\">May CPI report shows disinflation persisting as Bitcoin rises</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T13:00:00.000Z",
    "title": "Polygon Introduces Version 2.0, Calls It The Value Layer Of The I",
    "url": "https://cryptodaily.co.uk/2023/06/polygon-introduces-version-2-0-calls-it-the-value-layer-of-the-internet",
    "description": "<p>Ethereum Layer-2 scaling solution Polygon (MATIC) has unveiled its Version 2.0, the blueprint for which will be revealed over the next few weeks.</p>\n<p>The layer-2 scaling solution is calling its latest iteration the &ldquo;value layer of the internet.&rdquo;&nbsp;</p>\nThe Blueprint For Polygon 2.0&nbsp;\n<p>According to a blog post published by Polygon, it will be revealing the blueprint over the next few weeks. It would also address several topics, including the future of the Polygon Proof-of-Stake chain, the utility and evolution of Polygon&rsquo;s token, and the transition to greater community governance and involvement when it comes to the protocol and treasury. The blog post stated,&nbsp;</p>\n\n<p>&ldquo;Over the coming weeks, we will detail each component of Polygon 2.0, addressing topics like the future of the Polygon PoS chain, the utility and evolution of the Polygon token, and the transition to greater community governance of the protocol and treasury. We will lay out a roadmap for how Polygon will become the Value Layer of the Internet, offering unlimited scalability and unified liquidity via ZK technology.&rdquo;</p>\n\nThe Value Layer Of The Internet&nbsp;\n<p>Polygon added that its vision behind creating the &ldquo;value layer of the internet,&rdquo; as it calls Polygon 2.0, is to enable digital ownership, decentralized finance (DeFi), and new means for coordination. Polygon 2.0 will consist of a network of zero-knowledge (ZK) layer 2 chains. These chains will be able to communicate seamlessly among themselves, giving users the feeling that they are using a single chain. The blog post highlighted the limitations of individual blockchains when it comes to throughput.&nbsp;</p>\n\n<p>&ldquo;Individual blockchains aren&rsquo;t infinitely scalable; they have strict throughput limits. We can add capacity by creating new chains, but not without fragmenting liquidity and reducing security and capital efficiency.&rdquo;</p>\n\n<p>According to the blog post, Polygon 2.0 could support an unlimited number of chains, enabling cross-chain interactions to occur seamlessly, securely, and instantly.&nbsp;</p>\n\n<p>&ldquo;Polygon 2.0 is a network of ZK-powered L2 chains, unified via a novel cross-chain coordination protocol. For a user, the entire network will feel like using a single chain. The network can support a practically unlimited number of chains, and cross-chain interactions can happen safely and instantly, without additional security or trust assumptions. Unlimited scalability and unified liquidity.&rdquo;</p>\n\nVersion 2.0 Rollout&nbsp;\n<p>Polygon 2.0 has been created after collaboration between Polygon Labs, researchers, developers, node operators, validators, applications, and the larger Ethereum and Polygon communities. Polygon plans to detail all the components of Version 2.0 over the next few weeks through a series of podcasts, community meets, blog posts, and AMAs. The protocol also highlighted a series of important dates for the community to follow over the next four weeks, on which it will make a series of announcements related to the blockchain&rsquo;s architecture, token, and governance.&nbsp;</p>\n<p>The only chain from Polygon that incorporates ZK technology is the Polygon zkEVM Beta, which was released to the public in March. ZK technology is a type of scaling solution that utilizes zero-knowledge proofs to reduce transaction fees and help blockchains scale. While Polygon&rsquo;s primary Proof-of-Stake chain is not ZK-compatible, the protocol is exploring the possibility of incorporating ZK technology into its primary chain.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T13:04:24.000Z",
    "title": "Bill to dismiss SEC chairman Gary Gensler gains support",
    "url": "https://crypto.news/bill-to-dismiss-sec-chairman-gary-gensler-gains-support/",
    "description": "US lawmakers have introduced a bill to remove Gary Gensler from his position as Chair of the SEC. The bill responds to what the representatives describe as a &#8220;long series of abuses&#8221; under Gensler&#8217;s leadership. In a recent press release&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T12:44:02.000Z",
    "title": "Singapore-based Haru Invest comments on rug pull rumors ",
    "url": "https://crypto.news/singapore-based-haru-invest-comments-on-rug-pull-rumors/",
    "description": "Haru Invest has responded via Twitter to rumors that it has rug-pulled investors. The high-yield crypto investment company suspended deposits and withdrawals today, citing “an issue with one of its service partners.” Haru Invest, a Singapore-based web3 company offering investors&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T13:00:57.000Z",
    "title": "Chainlink (LINK) Whale Transfers Spike, Bearish Sign?",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-link-whale-transfers-spike-bearish-sign/",
    "description": "On-chain data shows that Chainlink (LINK) whales have become quite active in recent days, a sign that may be bearish for the asset&#8217;s price. Chainlink Whale Transactions Have Shot Up In Number Recently According to data from the on-chain analytics firm Santiment, whale transactions hit a 2023 high just as the price dipped toward the $5 mark. The &#8220;whale transaction count&#8221; is an indicator that keeps track of the number of Chainlink transfers taking place on the blockchain that involve the movement of tokens worth at least $1 million in value. When the value of this metric is high, it means that there are a large number of sizeable LINK transactions occurring on the network right now. Generally, transfers worth more than $1 million are thought to be coming from the whales, so this kind of trend can be a sign that the whales are active currently. On the other hand, the low values of the indicator imply the whales aren&#8217;t making that many moves at the moment. As whale transactions are quite large in scale, a lot of them happening at once can cause fluctuations in the market. Thus, a lack of them happening (that is, low values) can result in a more stable market. Now, here is a chart that shows the trend in the Chainlink whale transaction counts over the last few months: The value of the metric seems to have been quite high in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the Chainlink whale transaction count saw a couple of spikes during the last week or so. This would hint that whales of the cryptocurrency may have been actively trading in this period. These high values of the indicator took place simultaneously with the asset&#8217;s price sliding down and hitting a three-year low of around $5, implying that at least some of the transactions may have been made for selling-related purposes. Related Reading: Bitcoin Stuck In Historically Tight Range, Calm Before The Storm? Interestingly, the whale activity continued to remain elevated even after the coin hit its $5 local bottom and saw a rebound. In fact, the largest of the metric&#8217;s spikes, which set a new high for the year 2023, came just as Chainlink bottomed out. The timing of this extreme elevation in the whale transactions may be a sign that some of these humongous investors saw the dip as a profitable buying opportunity and participated in some accumulation, leading to the price being able to rebound. In the chart, Santiment has also displayed the trend in the supplies of the investor groups holding between 1,000-10,000 LINK and 10,000-100,000 LINK. Both these cohorts seem to have done some buying recently as their supplies have shot up, implying that market-wide buying may have taken place at the lows. Related Reading: Bitcoin Bearish Signal: Miners Sell At 3rd Largest Scale Ever Since the bottom, however, Chainlink has only seen a minute increase as it&#8217;s still trading quite near the low itself. Whale transactions are also still at higher-than-average levels for the year, and it&#8217;s hard to say what behavior these investors may be showing this time. Naturally, if the whales are still selling, then LINK might see further bearish price action in the near future. LINK Price At the time of writing, LINK is trading around $5.2, down 15% in the last week. Looks like the value of the asset has plunged &#124; Source: LINKUSD on TradingView Featured image from Thomas Lipke on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T13:00:47.000Z",
    "title": "Foreon Network Building A People Powered Prediction Market On Cardano, Kicks Off Initial NFT Offering",
    "url": "https://www.crypto-news-flash.com/foreon-network-building-a-people-powered-prediction-market-on-cardano-kicks-off-initial-nft-offering/?utm_source=rss&utm_medium=rss&utm_campaign=foreon-network-building-a-people-powered-prediction-market-on-cardano-kicks-off-initial-nft-offering",
    "description": "Foreon Network is a decentralized prediction market that allows you to speculate on the outcome of real world events. The roots of prediction markets can be traced back to the 1500s when they were used as an instrument for predicting papal elections. Fast forward to the 21st century, they&#8217;ve transformed into a sophisticated methodology, referred [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-13T12:55:00.000Z",
    "title": "Mid-Sized Wallets Accumulate LINK at its Lowest Price in 3 Years",
    "url": "https://coinedition.com/mid-sized-wallets-accumulate-link-at-its-lowest-price-in-3-years/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/🐳_The_amount_of_Chainlink_whale_transactions_has_hit_a_2023_high-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/🐳_The_amount_of_Chainlink_whale_transactions_has_hit_a_2023_high-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/🐳_The_amount_of_Chainlink_whale_transactions_has_hit_a_2023_high-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/🐳_The_amount_of_Chainlink_whale_transactions_has_hit_a_2023_high.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Data from Santiment shows a spike in the LINK whale transactions even with the crypto token dropping to its lowest price in three years. In a tweet, the on-chain market intelligence platform revealed LINK accumulators to be mid-sized wallets holding between 1,000 and 100,000 LINK. Santiment’s data shows that Chainlink users see the falling price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mid-sized-wallets-accumulate-link-at-its-lowest-price-in-3-years/\">Mid-Sized Wallets Accumulate LINK at its Lowest Price in 3 Years</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T13:04:38.000Z",
    "title": "$7,600,000,000 Venture Capital Firm Expands to the UK, Says Crypto Can Only Succeed With Clear Regulatory Regime",
    "url": "https://dailyhodl.com/2023/06/13/7600000000-venture-capital-firm-expands-to-the-uk-says-crypto-can-only-succeed-with-clear-regulatory-regime/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/venture-capital-can-only.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US-based venture capital firm Andreessen Horowitz (a16z) says that it is expanding to the United Kingdom (UK) because crypto regulations are clearer there. In a new announcement, Chris Dixon, the founder of Andreessen&#8217;s $7.6 billion a16z crypto fund, says that crypto can only succeed where governments are establishing clear rules for digital assets. The announcement [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/7600000000-venture-capital-firm-expands-to-the-uk-says-crypto-can-only-succeed-with-clear-regulatory-regime/\">$7,600,000,000 Venture Capital Firm Expands to the UK, Says Crypto Can Only Succeed With Clear Regulatory Regime</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]