[
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T21:00:00.000Z",
    "title": "Shibarium denies bridge issues, calls it FUD",
    "url": "https://cointelegraph.com/news/shibarium-denies-bridge-issues-calls-it-fud",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/380f807e-f123-42ed-a487-a768ed4efe2c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Shytoshi Kusama, co-founder of the Shiba Inu ecosystem, blamed a massive influx of transactions and user activity for technical difficulties in Shibarium.</p>\n                    <p><p>The team behind the newly released Shibarium mainnet has denied reports of bridge problems and asset losses, saying screenshots floating around the crypto community are false.</p><p>In a blog post on Aug. 17, Shytoshi Kusama, co-founder of the Shiba Inu ecosystem, <a href=\"https://blog.shib.io/shibarium-insane-influx/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://blog-shib-io.cdn.ampproject.org/c/s/blog.shib.io/shibarium-insane-influx/amp/\">blamed</a> a massive influx of transactions and users activity for causing technical difficulties in Shibarium, an Ethereum layer-2 scaling blockchain <a href=\"https://cointelegraph.com/news/shiba-inu-shibarium-ethereum-l2-blockchain-goes-live-mainnet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/shiba-inu-shibarium-ethereum-l2-blockchain-goes-live-mainnet/amp\">launched hours earlier</a>. </p><p>Sharing data from Alchemy, Kusama said the project has allotted 400 million compute units per month, but experienced 160 million compute units in nearly 30 minutes after Shibarium's launch. \"Although we expected a very busy moment, we never expected this much traffic, instantly,\" he said, adding that:</p><p>\"Our team has been working tirelessly to scale (even though validators were already on autoscale when we made the announcement) and bring up the chain again to an extent that we can handle the influx of our decentralized nation state.\" </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3af9063c-4860-43dd-b1b9-7be61e06e5e1.jpg\"><figcaption style=\"text-align: center;\"><em>Shibarium's compute units consume. Source: Alchemy/Shibarium.</em></figcaption></figure><p>First concerns about Shibarium surfaced in the crypto community after screenshots reportedly captured an internal Telegram conversation between Shibarium developers, indicating the team was allegedly unable to recover assets bridged to the Shibarium network. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In case yall were wondering how Shibarium is going <a href=\"https://t.co/S5vjTxoMDk\">pic.twitter.com/S5vjTxoMDk</a></p>— ʎppɐꓷ ɯooɹɥS (@shroom_daddy) <a href=\"https://twitter.com/shroom_daddy/status/1691953231289528683?ref_src=twsrc%5Etfw\">August 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Contributing to the investigation, blockchain sleuth ZachXBT explained that while he was unable to confirm whether the assets had been lost, the RPC - the node that runs key blockchain client software - was compromised. At the time of writing, the Shibarium RPC website<a href=\"https://www.shibrpc.com/\" target=\"_blank\" rel=\"noopener nofollow\"> remains</a> down.</p><p>\"Give us time to scale [...] and then bring up our amazing chain once again,\" Kusama asked in the blog post, dismissing the rumors as FUD, an acronym for “fear, uncertainty, and doubt.”</p><p>Shibarium relies on a new consensus mechanism called proof-of-participation (PoP), in which validators are selected based on their cryptocurrency holdings. It is designed to interact with the primary Ethereum layer-1 blockchain, seeking to offer more efficient and scalable transactions. Its mainnet was released after months of testing involving millions of users and 21 million wallets created.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T20:43:27.000Z",
    "title": "Tether discontinues Bitcoin stablecoin, citing lack of usage",
    "url": "https://cointelegraph.com/news/tether-discontinues-bitcoin-stablecoin-citing-lack-of-usage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-02/04469f3c-ba43-4bc2-aaef-d923d2cf84f4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Tether (USDT) stablecoin will no longer be issued on the Bitcoin Omni Layer, while redemptions will still be open for at least a year.</p>\n                    <p><p>The issuer of stablecoin Tether will discontinue its Bitcoin Omni Layer version, citing a lack of interest from users. This Bitcoin version of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) was one of the first stablecoins ever created. The Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) and Kusama (<a href=\"https://cointelegraph.com/kusama-ksm-price-index\">KSM</a>) versions will also be <a href=\"https://tether.to/en/tether-makes-strategic-transition-to-meet-community-demands-and-foster-innovation/\" target=\"_blank\" rel=\"noopener nofollow\">discontinued</a>, according to an Aug. 17 announcement from the team.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today <a href=\"https://twitter.com/hashtag/Tether?src=hash&amp;ref_src=twsrc%5Etfw\">#Tether</a> announces the ending of the support of 3 blockchains <a href=\"https://twitter.com/search?q=%24USDt&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDt</a>: OmniLayer, BCH-SLP and Kusama.<br>Customers will be able to continue to redeem and swap <a href=\"https://twitter.com/search?q=%24USDt&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDt</a> tokens (to another of the many supported blockchains), but Tether won&#39;t issue any new additional <a href=\"https://twitter.com/search?q=%24USDt&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDt</a> on those 3… <a href=\"https://t.co/aghLgqtSuO\">https://t.co/aghLgqtSuO</a></p>&mdash; Paolo Ardoino  (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1692154723875328228?ref_src=twsrc%5Etfw\">August 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the announcement, no new Tether tokens will be issued on the Bitcoin Omni Layer, Kusama or Bitcoin Cash going forward. Redemptions will remain available for at least a year, and the company will issue further announcements before the year passes as to how it will handle redemptions after that point.</p><p>The Bitcoin Omni Layer is a smart contract system built on top of the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) blockchain. Originally called “Mastercoin,” it was released in July 2013, a full two years before Ethereum. Omni Layer Tether became the first stablecoin to be released on the system in October 2014. It quickly grew to be the highest market cap stablecoin, surpassing earlier stablecoins such as BitUSD and NuBits.</p><p>In its Aug. 17 announcement, Tether sought to acknowledge the important historical role that Omni Layer Tether played in crypto history, stating:</p><blockquote>“We understand the significance of this decision, particularly for Omni, as it was the first transport layer that Tether used in 2014. The Omni Layer, built on top of Bitcoin, played a crucial role in Tether’s early journey, and we acknowledge the contributions and innovations the team has made to the crypto landscape.”</blockquote><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/paypal-stablecoin-crypto-adoption\"><strong>PayPal’s stablecoin opens door for crypto adoption in traditional finance</strong></a></em></p><p>However, the team stated that the Omni Layer “faced challenges due to the lack of popular tokens and the availability of USDT on other blockchains.” This led exchanges to use other transport layers instead of Omni, which in turn led to a decline in USDT Omni usage and forced the company to end its issuance.</p><p>Tether claimed that it would consider reissuing the Omni Layer version if usage of Omni picks up. The company also stated that it is working on a new Bitcoin smart contract system called “RGB” and that it plans to reissue Tether in an RGB version once it is completed, bringing Tether back to the Bitcoin blockchain.</p><p>Competition between stablecoins has been heating up in 2023, challenging Tether’s dominance. PayPal <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">released its PayPal USD (PYUSD)</a> on Aug. 7, and Binance <a href=\"https://cointelegraph.com/news/changpeng-zhao-cz-binance-stablecoin-strategy-tether-busd\">listed First Digital USD</a><a href=\"https://cointelegraph.com/news/changpeng-zhao-cz-binance-stablecoin-strategy-tether-busd\"> (FDUSD)</a> on July 26.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T21:05:09.000Z",
    "title": "Unpacking SpaceX Bitcoin 2021-2022 sales worth $373M",
    "url": "https://www.cryptopolitan.com/spacex-bitcoin-2021-2022-sales-worth-373m/",
    "description": "SpaceX reportedly sold Bitcoin worth approximately $373 million that it acquired beginning in 2021. According to a Wall Street Journal report published on August 17, SpaceX recorded Bitcoin holdings worth $373 million on its balance sheet in 2021 and 2022 but has since sold the cryptocurrency.&#160; According to documents viewed by the news organization, the ... <a title=\"Unpacking SpaceX Bitcoin 2021-2022 sales worth $373M\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spacex-bitcoin-2021-2022-sales-worth-373m/\" aria-label=\"More on Unpacking SpaceX Bitcoin 2021-2022 sales worth $373M\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T20:47:37.000Z",
    "title": "Babylon’s Hydroponic System to Reshape Agriculture",
    "url": "https://www.cryptopolitan.com/babylons-hydroponic-reshape-agriculture/",
    "description": "In a world where innovation is redefining traditional industries, Babylon&#8217;s soilless hydroponic growing system has emerged as a game-changer in agriculture. This groundbreaking technology, featured on leaps.org, is reshaping how crops are cultivated and distributed, with profound implications for industries ranging from hospitality to food services. A New era in farming While effective, the traditional ... <a title=\"Babylon&#8217;s Hydroponic System to Reshape Agriculture\" class=\"read-more\" href=\"https://www.cryptopolitan.com/babylons-hydroponic-reshape-agriculture/\" aria-label=\"More on Babylon&#8217;s Hydroponic System to Reshape Agriculture\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T20:44:25.000Z",
    "title": "Mastercard launches CBDC Partner Program in partnership with leading blockchain firms to foster the implementation of digital currencies",
    "url": "https://www.cryptopolitan.com/mastercard-cbdc-partner-program-partnership-leading-blockchain-firms/",
    "description": "Mastercard has taken a significant step in the digital currency industry by launching its CBDC Partner Program. The program aims to foster collaboration with key blockchain and payment service industry players to drive innovation and efficiencies in implementing central bank digital currencies (CBDCs). Mastercard convenes leading blockchain and payment providers Mastercard’s CBDC Partner Program aims ... <a title=\"Mastercard launches CBDC Partner Program in partnership with leading blockchain firms to foster the implementation of digital currencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mastercard-cbdc-partner-program-partnership-leading-blockchain-firms/\" aria-label=\"More on Mastercard launches CBDC Partner Program in partnership with leading blockchain firms to foster the implementation of digital currencies\">Read more</a>"
  }
]