[
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T02:05:38.000Z",
    "title": " A ‘simple’ hard fork could subvert a quantum attack on Ethereum: Vitalik Buterin ",
    "url": "https://cointelegraph.com/news/simple-hard-fork-subvert-quantum-attack-ethereum-vitalik-buterin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZjExZTk2ZjQtNmUyYi00N2UyLTkxYjMtZGZhMzA3MDdhMmE1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The technology required to make Ethereum immune from a quantum attack could be developed starting “tomorrow,” said Buterin. </p>\n                    <p><p>Ethereum is already “well-positioned” to mitigate the impact of a massive quantum computing attack on the network, according to Ethereum co-founder Vitalik Buterin.</p><p>In a March 9 <a href=\"https://ethresear.ch/t/how-to-hard-fork-to-save-most-users-funds-in-a-quantum-emergency/18901\" target=\"_blank\" rel=\"noopener nofollow\">post</a> to Ethereum Research, Buterin discussed what would happen if a “quantum emergency” happened as early as tomorrow.</p><p>“Suppose that it is announced tomorrow that quantum computers are available, and bad actors already have access to them and are able to use them to steal users’ funds,” Buterin postulated. </p><p><a href=\"https://cointelegraph.com/news/simple-hard-fork-subvert-quantum-attack-ethereum-vitalik-buterin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T02:09:33.000Z",
    "title": "Shiba Inu Whale Is Bullish On These Crypto Picks",
    "url": "https://www.cryptopolitan.com/shiba-inu-whale-is-bullish-on-these-crypto-picks/",
    "description": "The Bitcoin record has been making waves recently, as the world waits for Gary Gensler and the SEC&#8217;s decision on Bitcoin ETFs. This monumental event closely aligns with the mysterious Shiba Inu whale&#8217;s bullish behavior towards selected cryptos. Their picks signal potential shifts in the crypto landscape, tying into the conversation surrounding SEC&#8217;s impending move. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T02:09:26.000Z",
    "title": "Solana Competitors That Can Outperform SOL Growth In 2024",
    "url": "https://www.cryptopolitan.com/solana-competitors-that-can-outperform-sol-growth-in-2024/",
    "description": "Bitcoin ETFs have recently hit record levels under Gary Gensler&#8217;s leadership at the SEC. In connection with this event, the crypto market appears to be diversifying its strengths. Several of Solana&#8217;s competitors are showing potential for significant performance in 2024, demonstrating the shifting dynamics within the digital asset landscape. BlastUP Presale Exceeds $1 Million: Anticipating [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T01:41:28.000Z",
    "title": "Vitalik Buterin advocates quantum-proofing Ethereum blockchain",
    "url": "https://www.cryptopolitan.com/vitalik-buterin-advocates-quantum-proofing-ethereum-blockchain/",
    "description": "In a recent development, Ethereum co-founder Vitalik Buterin has shared insights into the platform&#8217;s strategy to combat potential quantum computing threats. This move comes amid growing concerns over the security of cryptographic systems against the advancing capabilities of quantum technology. Buterin&#8217;s approach focuses on enhancing Ethereum&#8217;s resilience through strategic updates and the integration of quantum-resistant [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-11T01:53:30.000Z",
    "title": "RIPPLE PRICE ANALYSIS & PREDICTION (March 11) – XRP Halts Buying After Facing Resistance, Possible Retracement Ahead",
    "url": "https://nulltx.com/ripple-price-analysis-prediction-march-11-xrp-halts-buying-after-facing-resistance-possible-retracement-ahead/",
    "description": "Ripple&#8217;s XRP bullish trajectory is still looking intact weekly, but it has slowed down buying after facing resistance some days back. Due to this, it lost buzz and appeared weak today, initiating drops in the intra-day trading. Since the market bounced back in late January, XRP posted a nice gain [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-11T01:48:37.000Z",
    "title": "POLYGON MATIC PRICE ANALYSIS & PREDICTION (March 11) – Matic Taps A Year High Following 10% Surge But Facing This Resistance, Can It Break Higher",
    "url": "https://nulltx.com/polygon-matic-price-analysis-prediction-march-11-matic-taps-a-year-high-following-10-surge-but-facing-this-resistance-can-it-break-higher/",
    "description": "Polygon’s MATIC market cap continued to increase by the day, causing a notable surge above a key psychological level this month. It just tapped a year high following a daily 10% gain and seems set to claim more in the coming days.  The past weeks have been a back-to-back increase for [&#8230;]"
  }
]