[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T06:28:33.000Z",
    "title": "OKX sets industry standard with 10th consecutive monthly Proof of Reserves",
    "url": "https://www.cryptopolitan.com/okx-10-consecutive-monthly-proof-of-reserves/",
    "description": "In a move that underscores its commitment to transparency and security, OKX, a global leader in Web3 technology and cryptocurrency exchange, has released its 10th consecutive monthly Proof of Reserves (PoR) report. The report reveals that the exchange holds $10.4 billion in primary assets, making it the only major crypto exchange to achieve this milestone. ... <a title=\"OKX sets industry standard with 10th consecutive monthly Proof of Reserves\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-10-consecutive-monthly-proof-of-reserves/\" aria-label=\"More on OKX sets industry standard with 10th consecutive monthly Proof of Reserves\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T06:24:59.000Z",
    "title": "Top 10 European blockchain companies",
    "url": "https://www.cryptopolitan.com/top-10-european-blockchain-companies/",
    "description": "In the advancing world of blockchain technology, blockchain companies in Europe have emerged as a hub for innovation and advancement.&#160; This article sheds light on the vanguard entities that are reshaping industries through cutting-edge blockchain solutions. From pioneering startups to established players, these companies span various sectors, including finance, supply chain, healthcare, and more. Exploring ... <a title=\"Top 10 European blockchain companies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-10-european-blockchain-companies/\" aria-label=\"More on Top 10 European blockchain companies\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-31T06:11:32.000Z",
    "title": "Ethereum Shows Price Rebound Potential As Opportunity Rises For Patient Traders",
    "url": "https://nulltx.com/ethereum-shows-price-rebound-potential-as-opportunity-rises-for-patient-traders/",
    "description": "Ethereum&#8217;s current price of $1,700 presents a scenario where $ETH stands out within the realm of top cryptocurrencies, drawing attention due to growing trader impatience. This impatience stems from its historically significant price volatility and the tendency for wallets to offload coins at lower price levels. The relationship between wallet behavior and price trends is [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T06:20:32.000Z",
    "title": "Bitcoin And Cryptos Poised For Final Surge Before US Recession, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin-cryptos-final-surge-before-us-recession/",
    "description": "In the intricate dance of global finance, traditional economic indicators and the burgeoning Bitcoin and crypto market are becoming increasingly intertwined. Recent macroeconomic data from the US suggests a cooling economy, and this could have profound implications for Bitcoin and other cryptocurrencies. Macro Data Snapshot: A Cooling US Economy Yesterday&#8217;s data release paint a clear picture of a slowing US economy: Job Openings: The July JOLTS report indicated a significant drop in job openings, falling to 8.827 million from the previous 9.165 million, and notably below the expected 9.5 million. US ADP Nonfarm Employment Change (August): Actual figures came in at 177K, missing the estimate of 195K and showing a sharp decline from the previous 324K. US GDP (QoQ) (Q2): The actual growth rate was 2.1%, slightly below the estimated 2.4% and just above the previous 2.0%. PCE Prices (Q2): The actual figure was 2.5%, marginally below the 2.6% estimate and a significant drop from the previous 4.1%. Core PCE Prices (Q2): The actual data showed 3.7%, just below the 3.8% estimate and down from the previous 4.9%. Real Consumer Spending (Q2): The actual figure was 1.7%, slightly above the 1.6% estimate and down from the previous 4.2%. Pending Home Sales (July): The month-on-month data showed an increase of 0.9%, defying the -0.60% estimate. Pending Home Sales Index (July): The index stood at 77.6, slightly above the previous 76.9. Implications For Bitcoin And Crypto The cooling US economy, as indicated by the recent macro data, might be setting the stage for a (last) significant surge in BTC and crypto prices before a recession. Why? Because bad news is good news for the currently short-sighted financial world. Bad data means that the US Federal Reserve will not raise interest rates further and that Quantitative Easing (QE) is getting closer. The long-term consequences in the form of a recession are being overlooked. Related Reading: New Bull Run For Bitcoin If It Breaks This Level, Expert Addresses Elephant In The Room Joe Consorti, a renowned Bitcoin Layer analyst, highlighted the significant drop in job openings and the slowing job growth in August. He stated, &#8220;US job openings are at 8.827 million, the lowest level since September 2021. Worse yet &#8211; last month&#8217;s data was severely overestimated. Cracks are spreading in the labor market. Rate hikes&#8217; impact finally hitting.&#8221; He further emphasized the paradox of weak economic data driving stock market surges, suggesting, &#8220;Bad news is good news right now. Sour data relaxes investor fears of a hawkish Fed &#8211; igniting hopes of relaxed policy to support asset prices. I don&#8217;t make the rules.&#8221; Michaël van de Poppe delved deeper into the relationship between traditional economic indicators and Bitcoin&#8217;s performance. According to him, the most likely case are no more rate hikes as the economic data is coming in terribly, through which Gold, Silver and Bitcoin will be running upwards. He pointed out the inverse correlation between the Yields markets and Bitcoin, suggesting that as Yields show signs of peaking, Bitcoin could be poised for a surge. &#8220;The 2-Year Yields are even more apparent than the 10-Year Yields, indicating a potential top in the making, said van de Poppe. Related Reading: Coinbase (COIN) And Bitcoin-Related Stocks Soar Following Grayscale’s Victory He explained that the previous top in November of 2018 marked the low on Bitcoin. Afterwards BTC broke down, but the top of the Yields resulted into the bottom of the bear market for Bitcoin. The continuation of the selloff on the Yields resulted in more and more strength on the Bitcoin markets. Van de Poppe added: The first real high in November of 2022 also marked the low of Bitcoin. And the previous time we started to have a substantial selloff on the markets for Yields (March &#8217;23), the price of Bitcoin started to rally upwards significantly. Macro analyst Mortensen Bach&#8217;s predictions for the next 6-10 months also suggests a potential downturn for the USD, a decrease in rates, and an uptick for both stocks and crypto. According to him, the expansion phase of financial markets is coming to an end. However, there’s one last leg up for markets. While he believes that the soft landing narrative is nonsense, he warned of the repercussions of the Federal Reserve&#8217;s aggressive rate hikes, stating, &#8220;FED jacked up rates by 500bp in 12 months, in order to try and manipulate the economy to cool off. This was a big mistake and we will pay the price for it, likely in 2024.&#8221; Crypto trader Daan emphasized the looming recession fears and the potential for rate cuts and increased money printing in the near future. He commented, &#8220;Recession fears will be all over the media soon. Bring on the Rate cuts &#38; Money printing! (Not yet but doubt it takes much longer than ~6 months).&#8221; At press time, BTC traded at $27,264. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T06:30:45.000Z",
    "title": "Bitcoin ETF Approval Estimated at 75% This Year, 95% by 2024 – Anticipating New All-Time High of $150,000 for BTC Price on the Horizon",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-approval-estimated-at-75-this-year-95-by-2024-anticipating-new-all-time-high-of-150000-for-btc-price-on-the-horizon/",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Bloomberg raises Bitcoin ETF approval odds to 75% for 2023 and 95% by 2024, influenced by Grayscale&#8217;s recent legal triumph. A flurry of Bitcoin ETF applications awaits SEC&#8217;s &#8216;first deadline&#8217; decisions, including those from industry giants like BlackRock, Fidelity, and VanEck. Through his X account, Independent blockchain researcher and writer for various crypto news websites, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T06:23:50.000Z",
    "title": "XRP Rallies Over 6% Following Game-Changing Grayscale v. SEC Verdict",
    "url": "https://www.crypto-news-flash.com/xrp-rallies-over-6-following-game-changing-grayscale-v-sec-verdict/",
    "description": "<img width=\"1024\" height=\"538\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-768x404.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-351x185.jpg 351w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />Ripple-backed XRP recorded a spike of over 114 percent in the daily average traded volume to about $1.572 billion. The Grayscale XRP Trust was closed early in 2021 following the lawsuit filed by the SEC against Ripple. The fifth-largest digital asset, XRP, rallied in tandem with Bitcoin price action in the past 24 hours following [...]"
  }
]