[
  {
    "source": "CoinDesk",
    "date": "2023-09-04T12:25:04.000Z",
    "title": "Singapore's New President, a Former Central Bank Chairman, Has Called Crypto 'Slightly Crazy'",
    "url": "https://www.coindesk.com/policy/2023/09/04/singapores-new-president-a-former-central-bank-chairman-has-called-crypto-slightly-crazy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tharman Shanmugaratnam, who has previously called crypto \"purely speculative\" and \"slightly crazy,\" was officially elected as Singapore's president early Saturday morning."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-04T12:30:35.000Z",
    "title": "Binance-backed BUSD circulating supply drops to less than $3B",
    "url": "https://cryptoslate.com/binance-backed-busd-circulating-supply-drops-to-less-than-3b/",
    "description": "<p>The circulating supply of Binance USD (BUSD) has fallen to $2.8 billion, marking its lowest point since early 2021, when the stablecoin was still relatively new to the crypto market, according to CryptoSlate&#8217;s data. The Binance-backed stablecoin has seen its market share rapidly decline this year after it was labeled securities by the U.S. Securities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-backed-busd-circulating-supply-drops-to-less-than-3b/\">Binance-backed BUSD circulating supply drops to less than $3B</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-04T12:30:25.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Consolidates, ETH Avoids Falling Below $1,600 on Labor Day",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-consolidates-eth-avoids-falling-below-1600-on-labor-day/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Consolidates, Whilst ETH Avoids Falling Below $1,600 on Labor Day\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1900947661.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sentiment in bitcoin remained bearish to start the week, as the cryptocurrency remained below $26,000 on Monday. Market volume was relatively low in today&#x2019;s session, as a result of the U.S. Labor Day celebration. Ethereum was slightly higher, as the price managed to remain above $1,600. Bitcoin Bitcoin was trading below $26,000 on Labor Day, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T12:15:49.000Z",
    "title": "Binance’s head of product, Mayur Kamat, steps down amidst growing scrutiny",
    "url": "https://www.cryptopolitan.com/binance-head-of-product-kamat-step-down/",
    "description": "Mayur Kamat, Binance&#8217;s head of product, has departed from the cryptocurrency exchange. His exit comes amid a wave of high-profile resignations at the company, facing increasing scrutiny from global regulators. Kamat&#8217;s decision to step down follows nearly two years of service at Binance, where he played a pivotal role in expanding the user base from ... <a title=\"Binance&#8217;s head of product, Mayur Kamat, steps down amidst growing scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-head-of-product-kamat-step-down/\" aria-label=\"More on Binance&#8217;s head of product, Mayur Kamat, steps down amidst growing scrutiny\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-04T12:12:46.000Z",
    "title": "Crypto insiders focusing on Monero, Aave, and Everlodge",
    "url": "https://crypto.news/crypto-insiders-focusing-on-monero-aave-and-everlodge/",
    "description": "Everlodge plans to reshape real estate and comes amid crypto insiders considering ELDG, AAVE, and XMR"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T12:30:47.000Z",
    "title": "Expert Market Analysts Agree A Spot Bitcoin ETF Is A Matter Of When, Not If",
    "url": "https://www.newsbtc.com/bitcoin-news/analysts-spot-bitcoin-etf/",
    "description": "The crypto community has been kept at the edge of its seat as the SEC decided to postpone a decision on the 7 Spot Bitcoin ETFs filed over the last few months. During such a pensive time, market analysts have predicted the SEC authorizing a Spot Bitcoin ETF while the former SEC Chairman foresees a losing battle for the regulator.  JP Morgan Analysts Foresee ETFs Approval The United States Securities and Exchange Commission (SEC) and Grayscale, an American digital currency investing and crypto asset management company have been embroiled in a legal battle since June 2022.  The SEC had previously rejected Grayscale’s request to convert its GBTC vehicle to an ETF. The digital currency investment company had responded to the rejection with a lawsuit, suing the SEC and filing a petition for a review by the United States Court of Appeal for the District of Columbia Circuit.  Related Reading: Pro-XRP Legal Expert Takes The Spotlight With Daring Ripple Vs SEC Settlement Theory The legal proceedings have not been favorable with the SEC, and analysts led by Nikolaos Panigirtzoglou from JP Morgan, a New York-based universal bank have predicted the eventual acceptance of Bitcoin ETF applications by the SEC.  The prediction is also largely supported by Grayscale’s victory against the SEC in a recent court ruling that classified the SEC’s denial of Bitcoin ETF applications as unreasonable and without substance, mandating the SEC to reevaluate its decision to deny Grayscale’s Bitcoin ETF application. While the SEC deliberates on its next move, the regulator has announced that it requires more time to decide on Bitcoin ETF propositions from several companies including WisdomTree and Blackrock. The regulator has also requested a postponement until mid-October.  The JPMorgan analysts believe that the SEC’s delay is a positive sign that Bitcoin ETFs will be approved soon. The analysts have also stated that the SEC would find it difficult to justify their rejection of Bitcoin ETF approval after accepting a previous proposal for future-based Bitcoin ETFs. The situation places the SEC in a precarious predicament and consequently, JP Morgan analysts have concluded that the SEC is likely to be compelled to approve the pending Bitcoin ETF applications from Grayscale and various asset management companies.  Former SEC Chairman Says “Spot Bitcoin ETF Is Inevitable” A prominent X (formerly Twitter) influencer, Collin Brown released a post on Monday, 4th September revealing that the former Chairman of the US SEC, Jay Clayton sees an undisputed win for Grayscale in the Bitcoin ETF case.  Brown stated that Clayton foresaw the “inevitable” acceptance of Bitcoin ETF proposals by the SEC and the post highlighted the time the SEC may conclude their decision on Bitcoin ETF applications, ultimately ending the legal feud between the SEC and Grayscale. “Former SEC Chairman Jay Clayton predicts the approval of a spot Bitcoin ETF is inevitable! The SEC might make the announcement in mid-October, or it could take a bit longer, but progress is on the horizon for crypto enthusiasts,” the post read.  Related Reading: Shiba Inu Marketing Lead Sends Important Message To SHIB Holders However, the X account was later suspended following the announcement.  In contrast, an ex-SEC Attorney, John Reed Stark declared in an X post that the chances of the SEC approving Bitcoin ETFs are implausible and crypto enthusiasts should not expect any other outcome. While the crypto community is cheering and hoping for Grayscale’s complete victory over the SEC, investors are preparing for a possible Bitcoin price surge that may follow the SEC’s approval of Bitcoin ETFs. BTC price loses footing above $26,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-04T12:38:33.000Z",
    "title": "What Are The Odds That a Bitcoin ETF Will be Launched in 2023?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/what-are-the-odds-that-a-bitcoin-etf-will-be-launched-in-2023/",
    "description": "<p>The recent victory secured by Grayscale over the US Securities and Exchange Commission has increased the likelihood that a spot Bitcoin exchange-traded fund (ETF) will be approved pretty soon. Analysts at Bloomberg believe we could see such approval by the end of 2023. In this article, you will discover more about this. Bloomberg Might Know [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/what-are-the-odds-that-a-bitcoin-etf-will-be-launched-in-2023/\">What Are The Odds That a Bitcoin ETF Will be Launched in 2023?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-04T12:15:00.000Z",
    "title": "Shibarium, Social Factors, and Whale Action Behind SHIB’s Growth",
    "url": "https://coinedition.com/shibarium-social-factors-and-whale-action-behind-shibs-growth/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/shib2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/shib2.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/shib2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/shib2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/shib2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/shib2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/shib2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Clay, host of the ClayBro crypto YouTube channel, the three factors affecting Shiba Inu’s growth are whale transactions, Shibarium statistics, and social statistics. Clay noted that a combination of these three factors is generating healthy growth for the Shiba Inu ecosystem, despite not reflecting on the SHIB price. In a recent video uploaded [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shibarium-social-factors-and-whale-action-behind-shibs-growth/\">Shibarium, Social Factors, and Whale Action Behind SHIB’s Growth</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]