[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T15:54:55.000Z",
    "title": "U.S. Banking Watchdog Makes Case for Tokenization, Just Not on Public Blockchains",
    "url": "https://www.coindesk.com/policy/2023/06/16/us-banking-watchdog-makes-case-for-tokenization-just-not-on-public-blockchains/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Self-styled crypto skeptic Michael Hsu, the acting head of the U.S. Office of the Comptroller of the Currency (OCC), said tokenization of assets is a serious advance into the future of finance, but decentralized blockchains may be too problematic to handle that movement."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-16T15:54:26.000Z",
    "title": "What Winter? Institutions’ Crypto View Rosier Than You Think",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/16/what-winter-institutions-crypto-view-rosier-than-you-think/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Nomura’s global survey shows that commitment to digital assets remains strong outside the U.S., offering a way forward for the sector, says Michael Casey."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-16T15:41:21.000Z",
    "title": "Politics Is Interested in Crypto, Even if Crypto Isn't Interested in Politics",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/16/politics-is-interested-in-crypto-even-if-crypto-isnt-interested-in-politics/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If U.S. policymakers want to help direct crypto, benefitting consumers an innovation, they will need to learn to compromise, says John Rizzo."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T15:44:44.000Z",
    "title": "Bitcoin withdrawals surpass deposits for the second time in six months",
    "url": "https://cryptoslate.com/insights/bitcoin-withdrawals-surpass-deposits-for-the-second-time-in-six-months/",
    "description": "<p>Quick Take The following chart presents the relative dominance of exchange-related deposits and withdrawals with respect to all confirmed transactions, according to Glassnode data as of June 16. The chart presents the following traces: 🟠 Total Transaction Count 🟢 Total Deposit Transactions 🔴 Total Withdrawal Transactions ⚫ Exchange Transaction Dominance (%) In the past six months, exchange withdrawals have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-withdrawals-surpass-deposits-for-the-second-time-in-six-months/\">Bitcoin withdrawals surpass deposits for the second time in six months</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-16T15:55:37.000Z",
    "title": "Bakkt Bids Adieu to Solana, Polygon, and Cardano Amid Regulatory Whirlwinds",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bakkt-bids-adieu-to-solana-polygon-and-cardano-amid-regulatory-whirlwinds/",
    "description": "New York-based digital assets trading platform Bally has taken a step back, delisting Solana, Polygon, and Cardano, according to the report by James Hunt for The Block, citing an article published in Fortune. The reason? A cloud of regulatory uncertainty that’s casting long shadows over the crypto stage. Marc D’Annunzio, the company’s general counsel and […]\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T16:00:05.000Z",
    "title": "6 Best Ways to Earn Passive Income with Cloud Mining Sites and NFT Investments",
    "url": "https://www.crypto-news-flash.com/6-best-ways-to-earn-passive-income-with-cloud-mining-sites-and-nft-investments/?utm_source=rss&utm_medium=rss&utm_campaign=6-best-ways-to-earn-passive-income-with-cloud-mining-sites-and-nft-investments",
    "description": "Whether you&#8217;re attempting to start a side business or are just looking to make a little extra money each month, passive income can be an excellent approach to help you generate additional cash flow. This is especially true now that the economy is experiencing widespread inflation. When times are good, passive income can help you [...]"
  }
]