[
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T04:21:35.000Z",
    "title": "BlackRock's Bitcoin ETF ‘is the best thing to happen' to BTC, or is it?",
    "url": "https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d22a4252-82e4-46c0-b1a7-c580417aefdf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Galaxy Digital CEO Mike Novogratz was among those over the moon with the news, others warn it could be the start of a major institutional takeover.</p>\n                    <p><p>BlackRock’s latest <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">filing for a spot Bitcoin (</a><a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>)<a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\"> trust</a> will drive investors’ confidence in Bitcoin and may even be “the best thing that could happen” to BTC, according to some crypto industry observers — but others warn of a hidden cost.</p><p>During an interview on June 16, Galaxy Digital CEO Mike Novogratz <a href=\"https://twitter.com/novogratz/status/1669506355143557121\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the approval of BlackRock’s ETF application would be “the best thing that could happen to $BTC.”</p><p>“I say a Hail Mary every night that Larry Fink and @blackrock pull off a @bitcoin ETF,\" Novogratz reportedly said on a Fox News segment.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Fun being on <a href=\"https://twitter.com/LizClaman?ref_src=twsrc%5Etfw\">@LizClaman</a> show!!  And yes, <a href=\"https://twitter.com/BlackRock?ref_src=twsrc%5Etfw\">@BlackRock</a> getting a <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> ETF through would be the best thing that could happen to <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a>. <a href=\"https://t.co/2fFBeB9eyo\">https://t.co/2fFBeB9eyo</a></p>&mdash; Mike Novogratz (@novogratz) <a href=\"https://twitter.com/novogratz/status/1669506355143557121?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Meanwhile, cryptocurrency analyst James Edwards of Finder.com — a financial product comparison website — told Cointelegraph that the timing of BlackRock’s filing should provide “confidence” in both Bitcoin as an asset and also <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase in its upcoming legal battle fight with the SEC:</a></p><p>“BlackRock's willingness to press on with a Bitcoin ETF at a time when the SEC is on a warpath against crypto is very telling. It shows confidence in Bitcoin’s status as a commodity – rather than a security,” he said, adding:</p><blockquote>“It’s unlikely that BlackRock would push forward with an ETF of this nature without serious consultation with regulators and confidence in Bitcoin's future legal status.”</blockquote><p>BlackRock’s intention to use Coinbase Custody to control funds should also be seen as a massive confidence booster for Coinbase as it prepares its legal defense, Edwards explained. </p><p>He added that BlackRock — the world’s largest asset manager — likely wouldn’t partner with Coinbase had they not been “confident” in Coinbase’s legal position.</p><h3>The downside</h3><p>Others argue that the traditional investment giant's latest moves undermine the \"ethos\" of decentralized cryptocurrencies, or, that the company may find a way to profit from retail investors.</p><p>Investor Scott Melker <a href=\"https://twitter.com/YahooFinance/status/1669445593498890241\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> in a June 16 <a href=\"https://twitter.com/YahooFinance/status/1669445593498890241\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> that such an approval would be a disservice to crypto-native innovators who built the industry:</p><blockquote>“As good as this may be for institutional adoption of the space, it kind of violates the ethos, it is a bit of a dishonest push away from the people who built the industry in the United States.”</blockquote><p>Cinneamhain Ventures partner and Ethereum bull Adam Cochran <a href=\"https://twitter.com/adamscochran/status/1669338565820465153\" target=\"_blank\" rel=\"noopener nofollow\">believes</a> that BlackRock will swoop in on the “discounted coins” of retail investors, a theory also shared by Melker.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Blackrock ETF… <a href=\"https://t.co/3g77QNdAun\">https://t.co/3g77QNdAun</a></p>&mdash; The Wolf Of All Streets (@scottmelker) <a href=\"https://twitter.com/scottmelker/status/1669469890883846150?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Steven Lubka, a managing director at Swan Bitcoin shared a similar view, <a href=\"https://twitter.com/DzambhalaHODL/status/1669334062673133568?s=20\" target=\"_blank\" rel=\"noopener nofollow\">predicting</a> that BTC will reach $1 million, but few retail investors will reap the rewards because the bulk of BTC will be owned by BlackRock, Goldman Sachs, and other ETF issuers.</p><p>Melker <a href=\"https://twitter.com/scottmelker/status/1669382875592917008?s=20\" target=\"_blank\" rel=\"noopener nofollow\">added</a> that Wall Street firms will continue to move into the space and that U.S. regulators will likely “choose them” over incumbent platforms.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\"><strong>Bitcoin ETFs: A beginner's guide to exchange-traded funds</strong></a></p><p>ARK Invest, <a href=\"https://cointelegraph.com/news/judges-hear-oral-arguments-in-grayscale-suit-against-sec-over-btc-spot-etf-rejection\">Grayscale,</a> Fidelity, Galaxy Digital, VanEck, Valkyrie Investments, NYDIG, SkyBridge and WisdomTree are among the other investment firms that have applied to the SEC for similar Bitcoin and cryptocurrency ETFs.</p><p>Since the news was first reported, the price of BTC has increased 2.2% to $25,584 at the time of writing. </p><p>Interestingly, the Fear &amp; Greed Crypto Index <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">increased</a> from 41 to 47 — leaving the fear zone — following the news of BlackRock’s filing.</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T04:15:00.000Z",
    "title": "Blockchain Association Files FOI Inquiry Into Prometheum",
    "url": "https://cryptodaily.co.uk/2023/06/blockchain-association-files-foi-inquiry-into-prometheum",
    "description": "<p class=\"md-end-block md-p\">The Blockchain Association has filed a Freedom of Information Act (FOIA) request with the U.S. Securities and Exchange Commission (SEC), with an inquiry into the regulator's interactions with Prometheum, a relatively lesser-known cryptocurrency exchange that has recently garnered significant attention.</p>\n<p class=\"md-end-block md-p md-focus\">Prometheum's co-CEO Aaron Kaplan was recently invited to testify before Congress, a rare occurrence for an executive from a relatively obscure company in a nascent industry. During the session, Kaplan voiced his support for the SEC's existing regulatory framework for cryptocurrency exchanges, while casting criticism on a significant portion of the industry. His statements have sparked intense discussions within the industry, and have elicited skepticism from some quarters.</p>\n<p class=\"md-end-block md-p\">Possible Inconsistencies: Prometheum's Relationship with the SEC</p>\n<p class=\"md-end-block md-p\">Adding to the intrigue surrounding Prometheum's operations is a revelation that the company paid over $1.5 million in sales commissions to a Chinese-affiliated entity, which carries a less-than-stellar regulatory track record. This has raised concerns within the Blockchain Association, leading it to further investigate the company's regulatory dealings.</p>\n<p class=\"md-end-block md-p\">The criticisms are mainly centered on the fact that, despite being approved as a SPBD, Prometheum faces a considerable challenge in terms of regulatory compliance, and, for its end, the capacity to do so. The company's trading platform will not be able to facilitate the trading of any tokens until the projects behind those tokens have registered with the SEC.</p>\n<p class=\"md-end-block md-p\">As it stands, there is no clear pathway for such registration under the existing SEC regime. This highlights a glaring contradiction in Prometheum's claims of offering a regulatory compliant platform for digital asset securities.The skepticism is well-founded, with several red flags raising questions about Prometheum's operations. The company reportedly paid in excess of $1.5 million in sales commissions to a Chinese-affiliated entity, which carries a dubious regulatory record. Such practices would typically invite scrutiny, but they appear to have been overlooked in Prometheum's case. These findings are the result of diligent work by the Blockchain Association, which continues to investigate the company's actions and interactions with the SEC.</p>\n<p class=\"md-end-block md-p\">Further, Prometheum's claims of being a compliant path were brought into question during Kaplan's congressional hearing and an interview with journalist Laura Shin. It was suggested that Kaplan misinterpreted the legalities surrounding the crypto industry, thereby misrepresenting his company's position. This was reflected in the words of Representative Mike Flood, who dismissed Prometheum's assertions as unfounded.</p>\n<p class=\"md-end-block md-p\">Regulatory Concessions</p>\n<p class=\"md-end-block md-p\">Despite its status as a SPBD, Prometheum's Alternative Trading System (ATS) faces a considerable regulatory hurdle. The platform will be unable to trade any tokens until those tokens' creators have first registered with the SEC. This presents a roadblock, given the lack of a clear path to registration under the current SEC regime&mdash;a reality at odds with Prometheum's proclamations of offering a regulated platform for digital asset securities.</p>\n<p class=\"md-end-block md-p\">Prometheum's unusual trajectory underscores the broader struggle within the crypto industry to navigate the complex and rapidly evolving regulatory environment. It highlights the critical need for greater transparency and a well-defined regulatory framework that can keep pace with innovation in the digital asset space.</p>\n<p class=\"md-end-block md-p\">Prometheum has been under scrutiny since its co-CEO, Aaron Kaplan, testified before Congress and made statements supporting the SEC's regulatory approach towards crypto exchanges, while criticizing much of the crypto industry. Prometheum claims to be a broker-dealer approved by the Financial Industry Regulatory Authority as an alternative trading system.</p>\n<p class=\"md-end-block md-p\">Current Tensions In U.S. Crypto Regulation</p>\n<p class=\"md-end-block md-p\">Prometheum's position comes at a time when the crypto industry has been expressing concerns over what they perceive to be an antagonistic regulatory environment in the U.S., especially in the wake of recent lawsuits filed by the SEC against major exchanges like Coinbase and Binance.</p>\n<p class=\"md-end-block md-p\">Prometheum plans to list regulated cryptocurrencies. However, this has been met with criticism. Rodrigo Seira, special counsel at Paradigm, pointed out that the SEC's stance is that most cryptocurrencies are unregistered securities, and therefore cannot be traded even on regulated exchanges.</p>\n<p class=\"md-end-block md-p\">In response to a question during the congressional hearing from Congressman Mike Flood about whether Prometheum lists bitcoin or ether, Kaplan confirmed that the platform does not list either of these. Kaplan's statement seems to contradict the idea that no additional legislation is needed, as argued by Flood.</p>\n<p class=\"md-end-block md-p\">Prometheum had previously announced plans to support digital asset securities, including Flow, Filecoin, The Graph, Compound, and Celo. The company has yet to provide a public disclosure on the matter.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T04:20:00.000Z",
    "title": "How Can You Rate Plasma vs Sidechains Based on Features and Applications?",
    "url": "https://www.cryptopolitan.com/plasma-vs-sidechains-comparative-analysis/",
    "description": "As blockchain technology continues its rapid evolution, the challenges of scalability and efficiency remain at the forefront of discussions. Among the myriad of proposed solutions, two innovative approaches &#8211; Plasma and Sidechains &#8211; have gained significant traction.  Plasma proposes a hierarchical model of child chains, whereas Sidechains suggest a parallel blockchain model. Both offer unique ... <a title=\"How Can You Rate Plasma vs Sidechains Based on Features and Applications?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/plasma-vs-sidechains-comparative-analysis/\" aria-label=\"More on How Can You Rate Plasma vs Sidechains Based on Features and Applications?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T04:14:00.000Z",
    "title": "Why You Should Keep An Eye On Popular BRC-20 Tokens",
    "url": "https://www.cryptopolitan.com/popular-brc-20-tokens/",
    "description": "BRC-20 tokens are a new and exciting development in cryptocurrency. They are tokens created on the Bitcoin blockchain using the Ordinals protocol, allowing developers to create fungible tokens on the most secure decentralized blockchain. With a total market cap of over $475 million, BRC-20 tokens are quickly gaining popularity and offer many advantages over other ... <a title=\"Why You Should Keep An Eye On Popular BRC-20 Tokens\" class=\"read-more\" href=\"https://www.cryptopolitan.com/popular-brc-20-tokens/\" aria-label=\"More on Why You Should Keep An Eye On Popular BRC-20 Tokens\">Read more</a>"
  }
]