[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T04:00:19.000Z",
    "title": "IMF Economists Say Countries Should Address Crypto Demand Drivers Instead of Banning",
    "url": "https://news.bitcoin.com/imf-economists-say-countries-should-address-crypto-demand-drivers-instead-of-banning/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"IMF Economists Say Countries Should Address Crypto Demand Drivers Instead of Banning\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/imf-crypto-demand.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The International Monetary Fund&#8217;s (IMF) economists have cautioned that banning cryptocurrency “may not be effective in the long run.&#8221; Instead of outlawing crypto, they suggest countries should address “the drivers of crypto demand, including citizens’ unmet digital payment needs.&#8221; IMF Economists on Crypto Adoption, Banning, and Regulation The International Monetary Fund (IMF) published an article [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T04:00:01.000Z",
    "title": "Shiba Inu Burn Surges Over 6,000% As SHIB Price Continues Uptrend",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-surges-over-6000-as-shib-price-continues-uptrend/",
    "description": "The recent surge in the Shiba Inu token burn has impacted the SHIB market again. Within 24 hours, over 341 million SHIB tokens were destroyed, sending the burn rate skyrocketing by roughly 6,936%. This development has bolstered the price of the popular meme coin as it continues an upward trajectory. The Shiba Inu community, affectionately known as the SHIB Army, has since been consistent in its token-burning efforts, a move that has significantly influenced the SHIB market dynamics. The burning process, which involves sending tokens to an unusable address, effectively takes them out of circulation, reducing supply and increasing scarcity. A Record Token Burn Among the transactions contributing to this burn rate, address “0xcf6” took the lead, accounting for nearly 252.8 million SHIB tokens dispatched to a dead wallet, as per data from etherscan.io. The acceleration of the token burn represents a community effort, with 341 million SHIB tokens destroyed in a mere five transactions within a single day. Related Reading: SHIB Jumps By 14% In A Single Day, As Shiba Inu “Worldpaper” Gets Closer This amount nearly equals 377 million SHIB tokens burned the previous week. Given supply and demand dynamics, this significant reduction in circulating SHIB tokens contributes to a higher token value in the long run. Notably, the impact was swiftly observed in the price of Shiba Inu, which recorded a gain of 5.6% in the past 24 hours and nearly 20% over the past seven days. The burn surge and its subsequent positive impact on the Shiba Inu price highlight the community&#8217;s power and commitment to their chosen crypto. While some critics dismiss meme coins like SHIB as lacking intrinsic value, the SHIB Army&#8217;s dedication and market dynamics seem to drive the price upward. Shiba Inu Continues Uptrend The SHIB token price has increased in the past few days, with the meme coin breaking multiple resistance levels. SHIB is trading at $0.00000791, up 19.6% over the past week. The token currently has a market capitalization of $4.6 billion, making it the 16th largest cryptocurrency by market cap. SHIB&#8217;s daily trading volume has also significantly moved in the past 7 days. Shiba Inu volume has surged from as low as $98 million last Thursday to as high as $300 million in the past 24 hours. The uptrend in the SHIB token price can be attributed to the overall bullish sentiment in the cryptocurrency market. Bitcoin, the leading cryptocurrency by market cap, has been in an upward trend, positively impacting the prices of other cryptocurrencies, including SHIB. Related Reading: Shiba Inu Becomes 14th Largest Cryptocurrency As Bull Rally Heats Up It is worth noting that the recent burn surge again sheds light on an essential aspect of tokenomics, the study of the economic systems related to cryptocurrency tokens. With less SHIB available, the token’s scarcity increases, theoretically increasing the token&#8217;s value over time. Featured image from Shutterstock, Chart from TradingView"
  }
]