[
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T04:00:49.000Z",
    "title": "Binance Launching New Crypto Trading Platform in Japan This Summer to Comply With Regulations",
    "url": "https://news.bitcoin.com/binance-launching-new-crypto-trading-platform-in-japan-this-summer-to-comply-with-regulations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance to Launch New Crypto Trading Platform for Japan Residents This Summer\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binance-japan-summer.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Global cryptocurrency exchange Binance says it has created a new crypto trading platform for Japan residents that will be available this summer. The new exchange will fully comply with Japanese crypto regulations and will offer trading of a limited number of tokens initially, according to the exchange. Binance Has Created New Crypto Trading Platform for [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T04:00:01.000Z",
    "title": "Shiba Inu Network Records 2,538 New Addresses In A Day, Surpassing 3-Month Record",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-network-records-2538-new-addresses-in-a-day/",
    "description": "Shiba Inu (SHIB), the popular meme-inspired cryptocurrency, has witnessed a remarkable surge in network activity as it recently recorded an unprecedented number of new addresses. According to data shared by prominent analyst Ali Charts, 2,538 new SHIB addresses were created on May 26, marking the highest increase in three months. This surge in address creation has propelled the total number of addresses on Shiba Inu&#8217;s Shibarium&#8217;s Puppynet testnet to a milestone of over 16 million. The significant growth in network engagement reflects the growing adoption and use of Shiba Inu within the community. Shiba Inu Network Adoption And Activity The Puppynet dashboard of Shiba Inu reveals that more than 16 million wallet addresses are actively interacting with the network, indicating a vibrant ecosystem. With over 1 million total blocks on the network and an average block time of just five seconds, Shiba Inu&#8217;s blockchain demonstrates its efficiency and scalability. Related Reading: Shiba Inu Burn Rate Surges 1500% In 24 Hours, Yet Price Continues To Struggle In Red Furthermore, the network has processed a remarkable number of transactions, surpassing 13 million in total. These statistics highlight the increasing popularity and utilization of Shiba Inu within the cryptocurrency space. Meanwhile, Shiba Inu&#8217;s surging network activity is closely aligned with its soaring social metrics. According to data from Lunar Crash, a reputable data aggregator, SHIB ranks among the top 10 coins by social mentions over the past week. Notably, SHIB&#8217;s social mentions reached 10,240, while its social engagements reached 344.8 million over the past week. Analyzing its weekly performance, SHIB&#8217;s social engagement witnessed a significant rise of 20.7%, reaching 2 billion, while its total mentions grew by 6.5% to 168,000. It is worth noting that the token attracted an average of 1,200 unique social contributors per hour, emphasizing its strong community engagement. Latest Update On Shibarium According to an official statement from Lucie, a key figure in the Shiba Inu&#8217;s ecosystem, the highly anticipated launch of Shibarium&#8217;s mainnet is expected to take place before the year&#8217;s end. Lucie revealed that Shibarium developer Shibarium 1 has speculated a launch date in August, while Shiba Inu lead Shytoshi Kusama predicts a slightly earlier launch in July. Related Reading: Shiba Inu Jumps 4% As Lead Dev Answers ‘When Shibarium’ Lucie emphasized the confidence of the Shiba team in the upcoming mainnet launch and highlighted the concerted efforts of multiple teams, including the integration of artificial intelligence (AI). However, the team remains focused on sustainable growth and is not engaging in any promotional tactics. Lucie stated that thorough testing processes and security audits are of utmost importance before the official launch, ensuring the reliability and robustness of the platform. Notably, it is evident that the Shiba Inu ecosystem is diligently working towards a successful mainnet launch, prioritizing security and long-term viability. As the project continues to progress, stakeholders eagerly anticipate the forthcoming release, which is poised to play a pivotal role in shaping the future of SHIB. Meanwhile, the Shiba Inu (SHIB) market has shown a brewing uptick following a significant retracement in the past week. Over the past 24 hours, SHIB has surged 2.2% with a trading price of $0.00000879. -Featured image from Shutterstock, Chart from TradingView"
  }
]