[
  {
    "source": "Decrypt",
    "date": "2023-12-12T03:05:10.000Z",
    "title": "‘Brainoware’: Brain Cells Fused With AI Could Recognize Voices",
    "url": "https://decrypt.co/209387/brainoware-bioscience-ai-organoids-brain-cells",
    "description": "Biotech enthusiasts are elated at the news, even though the discovery is only viable for research purposes today."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-12T03:00:41.000Z",
    "title": "Bitcoin “Washout” Completed, BTC Ready For $48,000—And Higher",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-washout-completed-btc-ready-for-48000/",
    "description": "Earlier today, Bitcoin (BTC) flash crashed to as low as $40,400 before rebounding to spot levels. This sudden drop triggered what Mike Alfred, a crypto value investor, said was a &#8220;textbook washout&#8221; necessary to liquidate speculators. The drop and bounce, Alfred further explained, has &#8220;wiped out open interest and is exactly what you want to see&#8221; before prices recover, possibly edging to $48,000 in the coming sessions. Bitcoin Drops, Over $120 Million Liquidated The washout, if past even guides, might have dented sentiment, forcing inexperienced holders and traders to take profit, allowing HOLDers more control. If that&#8217;s the case, considering that the uptrend remains when Bitcoin&#8217;s price action is analyzed from a top-down preview, it could be the foundation for further gains in the days ahead. Related Reading: Why Is Ethereum Price Down To $2,200 Today? Besides the heightened volatility and likelihood of potential profit-taking volatility, the resulting correction also led to some liquidation. According to Coinglass data on December 11, the flash crash saw over $105 million of leveraged long positions liquidated. Conversely, more than $15 million in short positions forcefully closed as prices quickly recovered, going against some traders&#8217; positions.  While responding to Alfred&#8217;s preview, some observers noted that liquidating high-leveraged long positions has effectively removed bearish elements from the market. In turn, this has positively paved the way for more price gains in the days ahead.  Will BTC Float To New All-Time Highs? Looking at the Bitcoin daily price chart, the uptrend remains even with the coin consolidating in lower time frames. Whether today&#8217;s sell-off will be confirmed in the next 24 hours remains to be seen. However, from the candlestick arrangement in the daily chart, the long lower wick suggests that lower lows are being rejected. Notably, the coin has support at the 20-day moving average, highlighting the importance of this dynamic line. Related Reading: Avalanche Rules Top 10 Ranking With 61% Weekly Gain – Here’s The Scoop The price chart shows that the $45,000 level is critical resistance. If there is a solid, high volume growth above this level, BTC might not only expand above $48,000 and $50,000, but it could anchor the leg up towards $69,000 in the next coming weeks. Market participants view the potential approval of the first Bitcoin ETF in early January 2024 by the Securities and Exchange Commission (SEC) as a bullish catalyst for BTC bulls. Amid evolving crypto regulations in the US, Europe, and beyond, a regulated ETF would provide institutional investors with a more accessible way to gain exposure to Bitcoin, potentially driving demand and pushing prices higher. Feature image from Canva, chart from TradingView"
  }
]