[
  {
    "source": "Decrypt",
    "date": "2024-03-22T01:50:56.000Z",
    "title": "Bitcoin Creator Satoshi Now Holds the Ultimate Runestone Ordinal—Here's Why",
    "url": "https://decrypt.co/222856/bitcoin-creator-satoshi-holds-ultimate-runestone-ordinal",
    "description": "The Runestone parent inscription, a 4MB Bitcoin Ordinal, was effectively burned via the move, sealing the broader collection forever."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-22T01:53:00.000Z",
    "title": "Fed Holds Rates, Hints at Cuts: Bitcoin Soars as BlackRock Enters ‘$5 Trillion Market by 2030’",
    "url": "https://www.cryptoglobe.com/latest/2024/03/fed-holds-rates-hints-at-cuts-bitcoin-soars-as-blackrock-enters-5-trillion-market-by-2030/",
    "description": "The price of Bitcoin has recently rallied to add more than $100 billion to its market capitalization after the Federal Reserve decided to maintain interest rates, and Fed Chair Jerome Powell suggested up to three rate cuts could be seen this year. However, even before the Fed’s announcement triggered a BTC price surge, BlackRock, the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T01:58:44.000Z",
    "title": "A look at the implications of US’s new restrictions on big bank mergers",
    "url": "https://www.cryptopolitan.com/implications-us-restriction-big-bank-mergers/",
    "description": "Recent moves by US banking watchdogs are signaling tough times ahead for big bank mergers. At the heart of this is the Federal Deposit Insurance Corporation (FDIC), which just proposed a set of rules designed to add layers of complexity to the process of bank mergers. The rules are aimed squarely at financial giants contemplating [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T02:00:40.000Z",
    "title": "Beyond Bitcoin ETFs: ‘There Are Other Players Controlling This Market’ – Says Analyst",
    "url": "https://www.newsbtc.com/bitcoin-news/beyond-bitcoin-etfs-there-are-other-players/",
    "description": "Recent observations by Eric Balchunas, a senior ETF analyst at Bloomberg, suggest that the movements in Bitcoin&#8217;s price are influenced by factors beyond just the flows of spot Bitcoin Exchange Traded Funds (ETFs). According to Balchunas, who shared his insights on X, &#8220;bigger forces at work&#8221; shape the largest cryptocurrency&#8217;s valuation. This indicates that the correlation between spot ETF flows and Bitcoin&#8217;s price action is less direct than some assume. Related Reading: Bitcoin Supply On Exchanges Hit 4-Year Low, But Why Is Price Crashing? The ETF Influence And Market Movements This analysis emerges amid a period of significant financial activity for Grayscale, which has seen substantial outflows, described by Balchunas as experiencing a &#8220;second wind&#8221; of departures. Yesterday, Grayscale reported outflows of $281.57 million, marking a notable decrease in its Bitcoin holdings by more than 40% since the inception of spot Bitcoin ETFs on January 11. This scenario highlights a broader narrative within the cryptocurrency investment sphere, where the relationship between ETF activities and Bitcoin&#8217;s market performance is complex and multifaceted. Interesting is price of bitcoin still went up yesterday and yet it went down second half of last week when Ten saw net inflows = there are other players controlling this market. ETFs def a factor but bigger forces at work here. — Eric Balchunas (@EricBalchunas) March 21, 2024 Despite the record outflows from Grayscale&#8217;s GBTC, Bitcoin&#8217;s market behavior has shown resilience. The cryptocurrency recently exceeded the $67,000 mark before experiencing a slight retracement, currently trading at a price of $66,106. This movement coincides with comments from Federal Reserve Chair Jerome Powell, which seemingly spurred a rally across various risk assets, including cryptocurrencies. Powell&#8217;s reassurances regarding the outlook on rate cuts prompted a slight recovery in Bitcoin&#8217;s price, demonstrating how external economic factors and sentiments can impact cryptocurrency markets. It is worth noting that Bitcoin traded below $65,000 before the announcement. On-Chain Insights And Bitcoin Future Prospects Further deepening the analysis, Charles Edwards, a crypto analyst, recently suggested that pullbacks are common in Bitcoin&#8217;s bull runs, with corrections of around 30% within the realm of possibility. A normal Bitcoin bullrun pullback is 30%. Back in December, we were already in the longest winning streak in Bitcoin&#8217;s history. A 20% pullback here takes us to $59K. A 30% pullback would be $51K. These are all levels we should be comfortable expecting as possibilities. — Charles Edwards (@caprioleio) March 19, 2024 In related news, data from the on-chain analysis platform CryptoQuant has recently indicated a nearly 40% reduction in Bitcoin&#8217;s supply on exchanges over the past four years. This trend points towards a bullish sentiment within the Bitcoin ecosystem, suggesting that investors are inclined to hold onto their assets in anticipation of future value increases. Moreover, CryptoQuant&#8217;s data reveals that Bitcoin&#8217;s demand has consistently outstripped its supply since 2020, a trend that supports the asset&#8217;s value on the premise that scarcity enhances perceived value. Related Reading: Hold Your Horses: ‘Buying The Crypto Dip Is Still Too Early’ Warns Top Analyst — Here’s Why This dynamic is expected to intensify following the upcoming Bitcoin halving event, which will reduce the miners&#8217; supply by half, potentially leading to further increases in Bitcoin&#8217;s price. Featured image from Unsplash, Chart from TradingView"
  }
]