[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T14:54:41.000Z",
    "title": "Riot Platforms at the Heart of Texas' Debate Over Bitcoin Mining’s Effect on the Grid",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/25/riot-platforms-at-the-heart-of-a-texas-debate-over-bitcoin-minings-effect-on-the-grid/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The world’s biggest bitcoin mine has drawn the ire of some local residents concerned with Bitcoin's community impact."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-25T14:51:48.000Z",
    "title": "Overheard at EthCC — Is Crypto Back, Boosted by Artificial Intelligence?",
    "url": "https://www.coindesk.com/tech/2023/07/25/overheard-at-ethcc-is-crypto-back-boosted-by-artificial-intelligence/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The intersection of AI and crypto has everyone riled up, but there is little agreement on what is its best iteration."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-25T14:51:48.000Z",
    "title": "Avalanche Foundation Launches $50M Asset Tokenization Initiative",
    "url": "https://decrypt.co/149978/avalanche-foundation-launches-50m-asset-tokenization-initiative",
    "description": "The Avalanche Foundation is looking to cash in on tokenization, launching a new $50 million initiative to bring activity to the network."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T15:00:00.000Z",
    "title": "8 ways crypto companies can improve their financial compliance in the US",
    "url": "https://cointelegraph.com/innovation-circle/8-ways-crypto-companies-can-improve-their-financial-compliance-in-the-us",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/882f285f-cb4e-4047-bc92-70f12bb253ec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Absent clear, comprehensive regulatory guidance in the U.S., crypto companies would be wise to shore up their accounting systems.  </p>\n                    <p><p>The U.S. presents many obstacles to crypto companies, with a multiplicity of federal and state regulatory agencies having real or potential jurisdiction over the industry. Its unique political environment has contributed to more governmental skepticism toward crypto than is seen in other countries, and high-profile punitive actions by the Securities and Exchange Commission are making many crypto companies nervous about maintaining a foothold in the U.S.</p> <p>Despite all this, there is also high-profile support for crypto in the U.S., so many crypto companies will be unwilling to abandon or postpone entry to the U.S. market. While there may not be a single set of clear, comprehensive guidelines for crypto companies in the U.S., there are smart strategies that can help them stay on the right side of regulators. Below, eight members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\" target=\"_blank\" rel=\"noreferrer noopener\">Cointelegraph Innovation Circle</a> share tips to help crypto companies improve their accounting procedures and compliance standing in the U.S.</p> <h2 id=\"use-private-blockchains-919f846c-ef18-44fe-ba4a-ff71bdfdb991\">Use private blockchains</h2> <p>The obvious answer is to use private blockchains. The entire purpose of blockchain is to enhance the ability to do credible accounting at scale. Permissioned access preserves privacy while lowering the cost of delivering provably raw data for accounting. Those proofs, rather than the data itself, can be sent for compliance to a blockchain shared with regulators.  –<a href=\"https://circle.cointelegraph.com/u/565d28ae-aad2-4ed9-bc34-a68b9954700e\" target=\"_blank\" rel=\"noreferrer noopener\"> Stephanie So</a>,<a href=\"http://geeq.io/\" target=\"_blank\" rel=\"noreferrer noopener\"> Geeq</a></p> <h2 id=\"maintain-precise-records-e3d1657b-214c-4167-8fdc-693e478b878e\">Maintain precise records</h2> <p>After the U.S. stablecoin, Binance and Coinbase crackdowns, I think it’s clear the current U.S. administration and the SEC are on a crypto witch hunt. Companies based in the United States may be targeted by regulators even if they believe they are fully compliant. Because of this, maintaining precise records of customer funds and money movements has never been more crucial. –<a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\" target=\"_blank\" rel=\"noreferrer noopener\"> Sheraz Ahmed</a>,<a href=\"http://storm.partners/\" target=\"_blank\" rel=\"noreferrer noopener\"> STORM Partners</a></p> <h2 id=\"adopt-a-rulebased-system-34b3a1dd-2004-4134-83e6-4e2798dffdfa\">Adopt a rule-based system</h2> <p>We have seen many crypto companies fall due to accounting issues. Adopting a rule-based system improves the situation. Compliance and procedures should follow established rules to safeguard accounts. Even though the SEC and other key players haven’t clarified crypto regulations, blockchain solutions ensure accountability. Therefore, maintaining clear records of customer funds and money movement remains crucial. –<a href=\"https://circle.cointelegraph.com/u/923e790f-d991-437d-a1eb-575af185daca\" target=\"_blank\" rel=\"noreferrer noopener\"> Ilias Salvatore</a>,<a href=\"http://flooz.xyz/\" target=\"_blank\" rel=\"noreferrer noopener\"> Flooz XYZ</a></p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://hubs.ly/Q0152XyT0\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <h2 id=\"prioritize-transparency-and-collaboration-bb3f827d-f8f8-4483-bc21-a10dfeaf6651\">Prioritize transparency and collaboration</h2> <p>Crypto companies must prioritize transparency, comply with existing regulations and collaborate with stakeholders to improve their accounting procedures and compliance in the U.S. Robust accounting systems, adherence to Anti-Money Laundering and Know Your Customer requirements, and active engagement will foster trust and industry growth. –<a href=\"https://circle.cointelegraph.com/u/a27b7ccb-dfb8-468f-83ae-4aac596f0a40\" target=\"_blank\" rel=\"noreferrer noopener\"> Vinita Rathi</a>,<a href=\"https://www.systango.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Systango</a></p> <h2 id=\"give-wallet-holders-pl-summaries-febb0651-bc37-4f11-b59b-ac336e6879e5\">Give wallet holders P&L summaries</h2> <p>Summarizing the trades done by each wallet and presenting that summary to the wallet holder in a detailed profit and loss summary would be a good start. Obviously, there are issues like mark-to-market considerations, current tax laws and loopholes, but for now, providing a summary of trades and a P&L statement would be a good start. –<a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\" target=\"_blank\" rel=\"noreferrer noopener\"> Zain Jaffer</a>,<a href=\"http://www.zain-ventures.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Zain Ventures</a></p> <h2 id=\"implement-blockchainspecific-accounting-software-86e5c6de-d98d-4c90-ae85-9e4a1b0252f6\">Implement blockchain-specific accounting software</h2> <p>One vital step crypto companies can take is implementing blockchain-specific accounting software. It accurately tracks and records transactions and assists with tax reporting. Furthermore, engaging regularly with crypto-focused accountants or legal experts can help crypto companies navigate evolving regulations and ensure ongoing compliance. –<a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\" target=\"_blank\" rel=\"noreferrer noopener\"> Tomer Warschauer Nuni</a>,<a href=\"http://www.kryptomon.co/\" target=\"_blank\" rel=\"noreferrer noopener\"> Kryptomon</a></p> <h2 id=\"establish-regular-internal-audits-4a3d6190-b7cf-45a7-8854-71c66d4f5c9e\">Establish regular internal audits</h2> <p>Implement robust internal controls and regular audits. This includes establishing clear financial policies and procedures, segregating duties, conducting periodic independent audits and ensuring proper documentation and record-keeping. These measures can help ensure accurate financial reporting, detect and prevent fraud, and demonstrate compliance with regulatory requirements. –<a href=\"https://circle.cointelegraph.com/u/984f8954-d388-45bf-bcb5-d6dd3f8be93c\" target=\"_blank\" rel=\"noreferrer noopener\"> Theo Sastre-Garau</a>,<a href=\"https://nftevening.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> NFTevening</a></p> <h2 id=\"dont-wait-to-bring-in-the-experts-04557966-4695-4969-9cfd-bc15f45521c2\">Don’t wait to bring in the experts</h2> <p>It may be expensive for early-stage crypto companies to hire lawyers and compliance professionals, but doing so can actually reduce costs down the road. If you wait until later stages to prioritize legal and regulatory compliance, it can be very burdensome to implement best practices and fix noncompliant products. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\" target=\"_blank\" rel=\"noreferrer noopener\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global/\" target=\"_blank\" rel=\"noreferrer noopener\"> ENT Technologies AG</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T15:00:00.000Z",
    "title": "Vitalik Buterin Voices Concerns Over Overloading Ethereum’s Consensus Mechanism",
    "url": "https://www.cryptoglobe.com/latest/2023/07/vitalik-buterin-voices-concerns-over-overloading-ethereums-consensus-mechanism/",
    "description": "Disclaimer: This article is sponsored content and should not be considered as financial or investment advice. Always do your own research before making any financial decisions. The opinions expressed in this article are those of the author and do not necessarily reflect the views of CryptoGlobe. Over the years, Ethereum has emerged as one of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T15:00:38.000Z",
    "title": "Borderless Capital Leads $1.5M Investment into the GEODNET Foundation to Support a Precise and Trusted Decentralized Location Service",
    "url": "https://cryptodaily.co.uk/2023/07/borderless-capital-leads-15m-investment-into-the-geodnet-foundation-to-support-a-precise-and-trusted-decentralized-location-service",
    "description": "<p>Palo Alto, California, USA, July 25th, 2023, Chainwire</p><p>GEODNET&rsquo;s growing Global Network of 3000+ web3 GNSS Base-stations is recognized by industry as a leading commercial solution for Real-Time Kinematic (RTK) applications</p><p>The GEODNET Foundation (GeoDAO PTE, LTD) announced the completion of a private $1.5M token sale at EthCC (The Ethereum Community Conference). The round was led by Borderless Capital&rsquo;s EdgeFi Fund, the first web3 investment fund exclusively focused on Decentralized Physical Infrastructure Networks (DePIN). The investment round includes additional participation from IoTeX, a web3 technology provider and blockchain for Internet of Things, as well as angel investors.&nbsp;</p><p>Introduced at the Institute of Navigation 2021 GNSS+ Conference, the Global Earth Observation Decentralized Network, GEODNET, received the Institute of Navigation&rsquo;s best presentation award and has rapidly grown since the official launch in early 2022.&nbsp;With over 3000 reference stations online in every major continent, the real-time GEODNET network is the world&rsquo;s largest decentralized Geo-Spatial Reference Network.&nbsp;</p><p>The GEODNET location service offers reliable centimeter location accuracy for applications such as drones, robotic vehicles, augmented reality, and IoT/mobile devices.&nbsp;</p><p>GEODNET station data is actively being utilized by leaders in high-precision applications including Hemisphere GNSS, Quectel Wireless Solutions, and Rock Robotic.&nbsp;GEODNET station owners set up their own Satellite Miner and are rewarded with $GEOD, the project&rsquo;s native Polygon token.</p><p>&ldquo;We led this investment because the GEODNET community is proving that thoughtfully deployed DePIN networks offer high-value, revenue-generating solutions to real-world problems&rdquo;, said &Aacute;lvaro Gracia, Partner at Borderless Capital.&nbsp;</p><p>The GEODNET Foundation manages the open network protocol and promotes service usage within the traditional GNSS and IoT industry. GEODNET will utilize the investment proceeds to strengthen the project overall, and emphasize on growing the reliable Global Coverage, and introducing a Mobile operating-system Software Development Kit.&nbsp;</p><p>&ldquo;GEODNET&rsquo;s unique combination of Artificial Intelligence, the Internet of Things, and Blockchain is a game changer for numerous mobile applications.&nbsp;&nbsp;This investment will help pave the way to a broader developer ecosystem in both Enterprise and Consumer applications&rdquo;, said Mike Horton, Project Creator of GEODNET.</p><p>&nbsp;About GEODNET</p><p>GEODNET is a decentralized network of high-precision multi-band GNSS base stations for AIoT, Geo-Scientific, and Metaverse applications.&nbsp;&nbsp;GEODNET stations #MineTheSky for real-time satellite data, and GEODNET is the basis of a new class of distributed cryptographic sensor networks powered by blockchain.&nbsp;&nbsp;https://geodnet.com</p><p>About Borderless</p><p>Borderless is a leading investment manager specialized in Web3 technology. Our mission is to support the next wave of creators who are driving the development of innovative technologies that will enable borderless value creation. We are committed to empowering our founders to reach their maximum potential and create a positive change in the world.&nbsp;https://borderlesscapital.io</p><p>About IoTeX</p><p>&nbsp;IoTeX is a modular Web3 platform connecting smart devices to blockchains for Web3 integration in real world applications. IoTeX is a leading technology provider of Decentralized Physical Infrastructure Network (DePIN).&nbsp;&nbsp;IoTeX combines blockchain, middleware, and open hardware to connect billions of devices and dApps with privacy and trust.&nbsp;https://iotex.io</p>ContactCEO/FounderMike HortonGEODNETinfo@geodnet.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  28095 Remains Pivotal - 26 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-28095-remains-pivotal-26-july-2023",
    "description": "<p>BTC/USD 28095 Remains Pivotal:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 26 July 2023</p>\n<p>Bitcoin (BTC/USD) remained pressured early in the Asian session as the pair glided higher from the 29046 level and reached the 29278.23 area after Stops were elected above the 29228.77 area, an upside price objective associated with buying pressure around the 28850 and 28981 levels.&nbsp; Buying pressure emerged around the 29092.07 area during a pullback, deriving technical support just above a related price objective around the 29084 area.&nbsp; &nbsp;After recently trading as high as the 30350.70 area, BTC/USD rapidly depreciated to the 28973.24 area.&nbsp; Stops were elected below the 29403 and 29089 levels during the acute depreciation, downside price objectives linked to recent selling pressure around the 30421.29 and 29851.28 levels.&nbsp; Related downside price objectives include the 28775, 29386, and 27757 levels.&nbsp; Additional downside price objectives include the 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp;</p>\n<p>Below current price activity, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp;&nbsp; Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29835.43 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29488.31.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:09:00.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:04:54.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:00:31.000Z",
    "title": "Borderless Capital Leads $1.5M Investment into the GEODNET Foundation to Support a Precise and Trusted Decentralized Location Service",
    "url": "https://www.cryptopolitan.com/borderless-capital-leads-1-5m-investment-into-the-geodnet-foundation-to-support-a-precise-and-trusted-decentralized-location-service/",
    "description": "Palo Alto, California, USA, July 25th, 2023, Chainwire GEODNET’s growing Global Network of 3000+ web3 GNSS Base-stations is recognized by industry as a leading commercial solution for Real-Time Kinematic (RTK) applications The GEODNET Foundation (GeoDAO PTE, LTD) announced the completion of a private $1.5M token sale at EthCC (The Ethereum Community Conference). The round was ... <a title=\"Borderless Capital Leads $1.5M Investment into the GEODNET Foundation to Support a Precise and Trusted Decentralized Location Service\" class=\"read-more\" href=\"https://www.cryptopolitan.com/borderless-capital-leads-1-5m-investment-into-the-geodnet-foundation-to-support-a-precise-and-trusted-decentralized-location-service/\" aria-label=\"More on Borderless Capital Leads $1.5M Investment into the GEODNET Foundation to Support a Precise and Trusted Decentralized Location Service\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T14:57:53.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T14:45:38.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T15:00:44.000Z",
    "title": "Borderless Capital Leads $1.5M Investment into the GEODNET Foundation to Support a Precise and Trusted Decentralized Location Service",
    "url": "https://www.crypto-news-flash.com/borderless-capital-leads-1-5m-investment-into-the-geodnet-foundation-to-support-a-precise-and-trusted-decentralized-location-service/?utm_source=rss&utm_medium=rss&utm_campaign=borderless-capital-leads-1-5m-investment-into-the-geodnet-foundation-to-support-a-precise-and-trusted-decentralized-location-service",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Strengthening_the_foudation_1688784886RDNXxflHH8.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Strengthening_the_foudation_1688784886RDNXxflHH8.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Strengthening_the_foudation_1688784886RDNXxflHH8-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Strengthening_the_foudation_1688784886RDNXxflHH8-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Strengthening_the_foudation_1688784886RDNXxflHH8-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Palo Alto, California, USA, July 25th, 2023, Chainwire GEODNET’s growing Global Network of 3000+ web3 GNSS Base-stations is recognized by industry as a leading commercial solution for Real-Time Kinematic (RTK) applications The GEODNET Foundation (GeoDAO PTE, LTD) announced the completion of a private $1.5M token sale at EthCC (The Ethereum Community Conference). The round was [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T15:00:06.000Z",
    "title": "Uwerx (WERX) Price Prediction as Presale Winds Down: Ripple (XRP) Climbs Up By 12%",
    "url": "https://www.crypto-news-flash.com/uwerx-werx-price-prediction-as-presale-winds-down-ripple-xrp-climbs-up-by-12/?utm_source=rss&utm_medium=rss&utm_campaign=uwerx-werx-price-prediction-as-presale-winds-down-ripple-xrp-climbs-up-by-12",
    "description": "<img width=\"1200\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uuuu.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uuuu.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uuuu-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uuuu-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/uuuu-768x492.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The cryptocurrency market is enthusiastic as the Uwerx presale reaches its final stages. Investors are eagerly observing the progress of Uwerx, a platform set to revolutionize the freelance industry. Simultaneously, Ripple (XRP) has garnered attention with a remarkable 12% surge in its value. In this article, we delve into the latest developments surrounding Uwerx and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T14:53:58.000Z",
    "title": "Bitcoin, Ethereum, Ripple’s XRP Price Prediction: BTC Breaks Crucial Support Ahead of FOMC Meeting – What’s Next for The Apex Coins?",
    "url": "https://www.crypto-news-flash.com/bitcoin-ethereum-ripples-xrp-price-prediction-btc-breaks-crucial-support-ahead-of-fomc-meeting-whats-next-for-the-apex-coins/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-ethereum-ripples-xrp-price-prediction-btc-breaks-crucial-support-ahead-of-fomc-meeting-whats-next-for-the-apex-coins",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-01T131153.585.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-01T131153.585.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-01T131153.585-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-01T131153.585-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As Bitcoin approaches the 100-day EMA at $28,344, the bearish outlook suggests a potential retest of the $27,500 level. Ripple&#8217;s XRP could potentially start the upward journey after collecting enough liquidity at $0.70. Bitcoin and the broader cryptocurrency market have come under strong selling pressure just ahead of the upcoming Federal Open Market Committee (FOMC) [...]"
  }
]