[
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T19:00:05.000Z",
    "title": "CBOE to launch BTC, ETH margin futures trading in January with 11 firms supporting",
    "url": "http://cointelegraph.com/news/cboe-launch-btc-bitcoin-ethereum-eth-margin-futures-trading-january-11-firms-supporting",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2dfd913c-6ee0-43f8-9e05-a60e6e8e48d6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new trading capability comes simultaneously with a surge in interest in crypto financial products in the United States.</p>\n                    <p><p>Cboe Digital has announced the launch date of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) margin futures trading – Jan. 11, 2024. The regulated crypto-native exchange and clearinghouse will become the first in the United States to offer both spot and leveraged derivatives trading on a single platform, it <a href=\"https://www.prnewswire.com/news-releases/cboe-digital-to-launch-margined-bitcoin-and-ether-futures-on-january-11-2024-backed-by-crypto-and-traditional-finance-players-301986086.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement.</p><p>Margin trading increases capital efficiency by allowing customers to trade futures without posting full collateral. The ability to carry out spot and derivative trading on the same platform will also increase efficiency. </p><p>Cboe Digital president John Palmer said:</p><blockquote>“We believe derivatives will foster additional liquidity and hedging opportunities in crypto and represent the next critical step in this market's continued growth.\"</blockquote><p>Cboe Digital provides trading for individuals and institutions. Eleven firms, including crypto and traditional financial firms, will support the new capability from its launch. They include B2C2, BlockFills, Cumberland DRW and Talos, among others.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/talos-raises-105m-to-become-the-latest-crypto-unicorn-valued-at-1-3b\">Talos raises $105M to become the latest crypto unicorn valued at $1.3B</a></em></strong></p><p>Cboe Digital <a href=\"https://cointelegraph.com/news/cboe-digital-approved-margin-trades-crypto-futures-exchange\">received approval for margin futures trading</a> from the U.S. Commodity Futures Trading Commission (CFTC) in June. At the time, CFTC Commissioner Christy Goldsmith Romero praised Cboe Digital for “operating within the parameters of the traditional futures market structure and regulatory framework.” </p><p>Cboe Digital said it plans to expand into physically delivered products eventually, subject to regulatory approval.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Cboe Digital to adopt a Default Liquidity Incentive Program, in effect as early as November 17⚠️ <a href=\"https://t.co/NlSC0xH8Ff\">pic.twitter.com/NlSC0xH8Ff</a></p>&mdash; M.B. (@741trey) <a href=\"https://twitter.com/741trey/status/1722348378158141450?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>BTC futures open interest has been surging on the Chicago Mercantile Exchange (CME), which is a Cboe Digital competitor. The CME <a href=\"https://cointelegraph.com/news/cme-second-largest-bitcoin-futures-exchange-open-interest-surges\">became the second-largest</a> BTC futures exchange after Binance in October, and it <a href=\"https://cointelegraph.com/news/cme-bitcoin-futures-hit-record-high-but-uncertainty-looms-above-36k\">hit a record high on Nov. 3</a>.</p><p>Meanwhile, the industry is waiting for a decision from the Securities and Exchange Commission decision on 12 applications for BTC spot exchange-traded funds. The eight-day window for <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">approvals began on Nov. 9</a>.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\">Cryptocurrency trading addiction: What to look out for and how it is treated</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T19:08:52.000Z",
    "title": "The Beatles’ Historic Return to UK No. 1 with ‘Now and Then",
    "url": "https://www.cryptopolitan.com/the-beatles-historic-return-to-uk-no-1/",
    "description": "In a stunning and historic comeback, The Beatles have once again claimed the coveted No. 1 spot on the UK charts with their latest release, &#8220;Now and Then.&#8221; This song, which is rumored to be their &#8220;last,&#8221; has taken the music world by storm and achieved a remarkable feat after 60 years. Released on November ... <a title=\"The Beatles&#8217; Historic Return to UK No. 1 with &#8216;Now and Then\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-beatles-historic-return-to-uk-no-1/\" aria-label=\"More on The Beatles&#8217; Historic Return to UK No. 1 with &#8216;Now and Then\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T18:40:45.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T18:56:34.000Z",
    "title": "YouTuber gambles on XRP’s recovery with high leverage",
    "url": "https://crypto.news/youtuber-gambles-on-xrps-recovery-with-high-leverage/",
    "description": "The trade exemplifies Tom's short-term bullish view on XRP and his very high-risk trading approach employing leverage."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T18:40:31.000Z",
    "title": "Tellor (TRB) price falls 35% following massive whale sell-off",
    "url": "https://crypto.news/tellor-trb-price-falls-35-following-mass-whale-sell-off/",
    "description": "The price of Tellor (TRB) fell more than 35% in the past 7 days."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T19:00:43.000Z",
    "title": "Crypto Expert Reveals One Major Reason The XRP Price Will Do Well In The Bull Run",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-do-well-bull-run/",
    "description": "A crypto expert has disclosed a bullish outlook for the XRP price during the upcoming bull run, highlighting XRP’s advantage over other altcoins due to its lack of ties with China’s CCP. Crypto Influencer Predict XRP Bull Success A crypto influencer on X (formerly Twitter) called BoringSleuth has expressed his sentiment about XRP’s potential success in the eagerly anticipated bull run.  Related Reading: Renowned Economist Warns Of Bitcoin Crash Before Spot ETF Approvals BoringSleuth has stated that the XRP price could stand to benefit considerably from the bull market due to its lack of affiliations with the Chinese Communist Party (CCP). He said that other cryptocurrencies like DAG which have no links with the CCP may also experience a successful bull run.  “The protocols that weren’t in bed with the CCP will be the benefactors of future bull cycles. A protocol like DAG, which works with the DOD is one example of a well-positioned protocol. XRP is another,” BoringSleuth stated.  Responding to BoringSleuth’s declaration, an X (formerly Twitter) user posted a screenshot stating that Ripple had deep ties with the IDG which is strongly backed by the CCP.  “The Protocol may or may not be clear…but Ripple has deep ties to IDG, which has strong support from the CCP. IDG are also investors in Coinbase and KuCoin,” an X member, AltarofEgo stated. Additionally, when asked by a crypto member on X what he meant by “well positioned,” BoringSleuth responded by saying that crypto companies that have no links to the CCP are strategically positioned to become the prime beneficiaries position of retail and investment cash flows in the case CCP-linked companies ever faces scrutiny.  “If there is a crackdown on CCP-affiliated companies, then that investment and retail money will flow somewhere. The companies well positioned to get those dollars will be the ones not in bed with the CCP,” BoringSleuth stated.  XRP suffers another price dip &#124; Source: XRPUSD on Tradingview.com XRP Price Maintains Bullish Momentum Recently, the crypto market seems to be on a rallying trend and XRP has taken advantage of the market sentiments to push its price higher. According to a crypto analysis by ProSignalsfx on TradingView, the XRP price is on an upward trend and may continue rising.  “RIPPLE is trading in an uptrend along the rising support line and after the retest of the said support. We will be expecting a further move up,” ProSignalsfx stated.  Related Reading: Bitcoin Price Hard Crash Or Mega Pump: Why $31,000 Holds The Key According to CoinMarketCap, the price of XRP at the time of writing is $0.65 with a 24-hour trading volume of over $101 billion. The cryptocurrency’s value has recovered steadily following several partial victories during its intense legal battle with the United States Securities and Exchange Commission (SEC).  Many investors and XRP community members are looking forward to a bullish rally for the token following the conclusion of its court case with the SEC. Featured image from Finder, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-13T19:05:15.000Z",
    "title": "Altcoin Project Skyrockets Over 200% Amid Support From Crypto Exchange Binance",
    "url": "https://dailyhodl.com/2023/11/13/altcoin-project-skyrockets-over-200-amid-support-from-crypto-exchange-binance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A six-month-old altcoin project is soaring after earning surprise support from crypto exchange Binance, the largest digital asset exchange in the world. After Binance announced on November 7th that it was listing ORDI for trading, the new token soared from $7.43 to a high of $23.80, a 220% increase. ORDI tokens, which adhere to the &#8220;BRC-20&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/13/altcoin-project-skyrockets-over-200-amid-support-from-crypto-exchange-binance/\">Altcoin Project Skyrockets Over 200% Amid Support From Crypto Exchange Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]