[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T17:03:48.000Z",
    "title": "Celsius Winner Proof Group Is in Running to Relaunch FTX, Sources Say",
    "url": "https://www.coindesk.com/business/2023/11/06/celsius-winner-proof-group-is-in-running-to-relaunch-ftx-sources-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Silicon Valley investment firm was part of the Fahrenheit consortium that successfully bid for bankrupt cryptocurrency lender Celsius."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-06T16:45:47.000Z",
    "title": "ApeFest Attendees Report Severe Eye Burn. BAYC Says Less Than 1% Have Symptoms",
    "url": "https://www.coindesk.com/business/2023/11/06/apefest-attendees-report-severe-eye-burn-bayc-says-less-than-1-have-symptoms/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Attendees of a ApeFest, an event hosted by Bored Ape Yacht Club creators Yuga Labs, have been receiving medical care after reporting blurred vision and burning eyes."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-06T17:05:47.000Z",
    "title": "Bitcoin, Ethereum and Other Crypto Funds Nab $767 Million in Just 6 Weeks",
    "url": "https://decrypt.co/204481/bitcoin-ethereum-and-other-crypto-funds-nab-767-million-just-6-weeks",
    "description": "Institutions are showing sustained interest in crypto investment products, pushing a six-week inflows streak to $767 million."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T17:00:00.000Z",
    "title": "Binance's spot trading market share falls to 40% in 2023: Report",
    "url": "http://cointelegraph.com/news/binance-spot-trading-market-share-falls-40-percent-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/8ad4a50c-9b68-4856-8999-8233ac01aaf7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The exchange's share in crypto spot trading was slashed by one-third over the past year. </p>\n                    <p><p>Crypto exchange Binance's market share in spot trading has fallen to 40% in late 2023, compared to 62% a year ago.</p><p>According to the November 6 <a href=\"https://www.0xscope.com/blog/The-2023-CEX-Market-Report-1721474978107490304\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by blockchain analytics firm 0xScope, the exchange has lost one-third of its market share in the past 12 months. \"Binance's spot trading volume has seen a significant decline in the past year, perhaps due to its listing strategy,\" researchers wrote, \"Most popular coins experienced a downturn immediately after being listed on Binance.\" At the same time, Korean crypto exchange Upbit saw the most significant increase, with its spot market share increasing from 5% to 15.3% during the same period.</p><p>When all crypto trading volumes, including both spot and derivatives, are included, <a href=\"https://cointelegraph.com/news/german-regulator-raised-concerns-binance-ceo-license-application\">Binance's market share</a> came at 51.2% in October 2023. This was followed by OKX (13.4%), Bybit (9.6%), Bitget (7.0%), and MEXC Global (6.9%). </p><p>\"Despite still being in the lead, Binance saw its gap shrink against main competitors, such as OKX and other second-tier exchanges,\" researchers wrote, noting that its overall market share stood at 54.6% in October 2022.</p><p>Throughout this time period, Bybit, Bitget, and MEXC have grown to become second-tier exchanges, trailing Binance and OKX, with a combined market share of 42.3%. \"Huobi, which has gradually fallen behind, forms the third tier along with Kucoin, Gate, and others,\" researchers claim.</p><p>While noting that website traffic and social media followers have \"little to no correlation\" to an exchange's market performance, the 0xScope team found that Binance's share of Twitter follower count has decreased by 5% in the past year despite an overall increase in base value. At the same time, OKX grew its raw follower count by over 200%.</p><p><strong>Related: <a href=\"https://cointelegraph.com/news/binance-ceo-changpeng-zhao-fortune-slashed-billionaires-index\">Binance founder CZ’s fortune gets slashed $12B, while SBF is still at $0</a></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-06T17:05:46.000Z",
    "title": "XRP surges 10% after flurry of positive news",
    "url": "https://cryptoslate.com/xrp-surges-10-after-flurry-of-positive-news/",
    "description": "<p>The Ripple ecosystem&#8217;s native token, XRP, surged more than 10% on Nov. 6 to become the fourth-largest cryptocurrency by market capitalization as weekday trading began. The token is trading at $0.714 as of press time, according to CryptoSlate data. The rally may be attributable to a combination of factors, including anticipation surrounding Ripple&#8217;s Swell conference, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/xrp-surges-10-after-flurry-of-positive-news/\">XRP surges 10% after flurry of positive news</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-06T16:45:24.000Z",
    "title": "Breaking: VC Spectra Gains Investor Preference Over Maker (MKR) and Bitcoin Cash (BCH)",
    "url": "https://cryptodaily.co.uk/2023/11/breaking-vc-spectra-gains-investor-preference-over-maker-mkr-and-bitcoin-cash-bch",
    "description": "Analysts believe that the decreased market performance of Maker (MKR) and Bitcoin Cash (BCH) has contributed to the outstanding bullish surge of VC Spectra (SPCT). T"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T17:05:57.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T16:56:52.000Z",
    "title": "BRICS doesn’t need a new currency to defeat USD",
    "url": "https://www.cryptopolitan.com/brics-doesnt-need-new-currency-to-defeat-usd/",
    "description": "As the BRICS nations coalesce around the ambition of reshaping the financial world order, the whisper of a new currency intended to challenge the U.S. dollar has been echoing in the corridors of global finance. This move by BRICS, which includes Brazil, Russia, India, China, and South Africa, embodies a defiance against the long-standing dollar ... <a title=\"BRICS doesn&#8217;t need a new currency to defeat USD\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brics-doesnt-need-new-currency-to-defeat-usd/\" aria-label=\"More on BRICS doesn&#8217;t need a new currency to defeat USD\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T16:54:02.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T16:57:20.000Z",
    "title": "SEC Chair Gensler takes dig at lawyers advising crypto and defi projects",
    "url": "https://crypto.news/sec-chair-gensler-takes-dig-at-lawyers-advising-crypto-and-defi-projects/",
    "description": "Gary Gensler alluded that cryptocurrency operators tapping legal consultants could be doing so due to their supposedly unlawful securities offerings."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T16:43:05.000Z",
    "title": "London Stock Exchange Group seeks digital assets director amid regulatory shifts",
    "url": "https://crypto.news/london-stock-exchange-group-seeks-digital-assets-director-amid-regulatory-shifts/",
    "description": "The London Stock Exchange Group is expanding its fintech horizons by recruiting a director for digital assets, navigating the complex interplay between innovation in blockchain technology and the UK's tightening financial regulations."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T17:00:58.000Z",
    "title": "Bitcoin Has Just Cleared A Level That Historically Lead To Rallies Of 99%+",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-cleared-level-historically-lead-rallies-99/",
    "description": "On-chain data shows Bitcoin has recently made a break that led to rallies of at least 99% during the last three times it happened. Bitcoin Has Now Crossed Above &#8220;Single Cycle HODLers&#8221; Cost Basis In a new post on X, analyst Ali has talked about a level that BTC has broken recently. The level in question is the cost basis of the single-cycle Bitcoin long-term holders. The terms may be unfamiliar, so here&#8217;s what they mean, one by one. First, the &#8220;long-term holders&#8221; (LTHs) here refer to the investors who have been holding onto their coins since at least 155 days ago. The LTHs are made up of the resolute diamond hands or HODLers, who rarely sell even when volatility occurs in the market. Related Reading: XRP Enjoys 11% Rally As Sharks &#38; Whales Hit 2023 High Holdings Next, the &#8220;single cycle HODLers&#8221; specifically refer to those LTHs who bought within the span of a single BTC cycle. Their range is typically taken to be 6 months to 3 years. This means that the oldest among these investors (with coins aged 3 years) would have gone through the entire chaos of the current cycle, from the highs of the 2021 bull to the lows of the 2022 bear. Lastly, &#8220;cost basis&#8221; refers to the average buying price of a group of Bitcoin investors. If the spot price of the cryptocurrency is trading below this value, it means that the cohort in question is in a state of net loss. Similarly, the asset being above implies the dominance of profits. Now, here is a chart that shows the trend in the cost basis of the single-cycle LTHs over the past few years: Looks like the price of the asset has interacted with this level in recent days &#124; Source: Glassnode on X Currently, this metric has a value of $34,150, which means that Bitcoin has already surged above it with the latest rally. This means that the average single cycle HODLer who had been in losses since the first half of 2022 has now finally returned to profits. In the graph, Ali has also highlighted the trajectory that BTC followed during the last three times a break above this level took place. It would appear that each of the last two major bull rallies occurred after the breaks that took place in 2016 and 2020, respectively. From the point of this breach, the cryptocurrency enjoyed returns of 4,778% and 787% over the course of the respective rallies. The recovery rally that started in April 2019 also observed a break of this cost basis, following which BTC registered gains of 99%. If this pattern of the single cycle HODLer cost basis paving the way for a Bitcoin rally is anything to go by, then the asset could potentially see a surge now that it has once again broken above it. Related Reading: Ethereum Yet To Shake Off 2022 Bear Hangover: Glassnode As Bitcoin&#8217;s current rally is most similar to the April 2019 recovery rally, it&#8217;s possible that, if a surge does take place, it would be more in line with this rally, rather than the full-blown bull runs. BTC Price Bitcoin has gone silent recently as it has only registered gains of 2% in the past week, with the price now floating above $35,200. BTC has been stuck in consolidation recently &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-06T17:02:57.000Z",
    "title": "German Banking Giant DZ Bank Partners with Ripple for Digital Asset Custody: A Boost for XRP’s All-time High?",
    "url": "https://www.crypto-news-flash.com/german-banking-giant-dz-bank-partners-with-ripple-for-digital-asset-custody-a-boost-for-xrps-all-time-high/?utm_source=rss&utm_medium=rss&utm_campaign=german-banking-giant-dz-bank-partners-with-ripple-for-digital-asset-custody-a-boost-for-xrps-all-time-high",
    "description": "<img width=\"960\" height=\"566\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Temenos\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Ripple.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Ripple-300x177.jpg 300w\" sizes=\"(max-width: 960px) 100vw, 960px\" />The partnership between DZ Bank and Ripple-backed Metaco was announced in mid-February but recently went live amid the fast-changing crypto regulatory landscape in Europe to ensure a sustainable adoption of crypto securities and digital currencies. The adoption of Ripple-backed products by a leading custody provider in Germany will help solidify XRP as the cross-border digital [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-06T16:40:52.000Z",
    "title": "Kuwait Finance House Recognizes Ripple as World-class Partner for Instant Cross-border Services",
    "url": "https://www.crypto-news-flash.com/kuwait-finance-house-recognizes-ripple-as-world-class-partner-for-instant-cross-border-services/?utm_source=rss&utm_medium=rss&utm_campaign=kuwait-finance-house-recognizes-ripple-as-world-class-partner-for-instant-cross-border-services",
    "description": "<img width=\"720\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480.jpg 720w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480-104x69.jpg 104w\" sizes=\"(max-width: 720px) 100vw, 720px\" />Kuwait Finance House (KFH) has partnered with international fintech companies led by Ripple. The past two years have been transformative for Kuwait’s financial sector, especially after the country’s Central Bank facilitated the launch of Weyay, the first digital bank. The Middle East has quickly transformed into a digital hub in a bid to leverage the [...]"
  }
]