[
  {
    "source": "Decrypt",
    "date": "2023-07-29T16:04:29.000Z",
    "title": "This Week in Coins: Weak Week for Bitcoin and Ethereum—and Worldcoin",
    "url": "https://decrypt.co/150521/this-week-in-coins-weak-week-bitcoin-ethereum-worldcoin-xrp",
    "description": "It was another slow week for crypto prices as another hike by the Federal Reserve took interest rates to a 22-year-high. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-29T15:53:55.000Z",
    "title": "Kansas Heartland Tri-State Bank closed by FDIC as banking crisis deepens",
    "url": "https://cointelegraph.com/news/heartland-tri-state-closed-by-fdic-as-banking-crisis-deepens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fb40d586-f710-4c84-9bbb-5e229cfd565a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Heartland Tri-State Bank of Elkhart was closed on July 29, with the Federal Deposit Insurance Corporation (FDIC) taking control.</p>\n                    <p><p>The ongoing crisis surrounding the U.S. banking system struck again as Heartland Tri-State Bank of Elkhart was <a href=\"https://www.fdic.gov/news/press-releases/2023/pr23058.html\" target=\"_blank\" rel=\"noopener nofollow\">closed</a> on July 29 by the Kansas Office of the State Bank Commissioner, with the Federal Deposit Insurance Corporation (FDIC) taking control. </p><p>On July 31, the four branches of Heartland Tri-State Bank will reopen as branches of Dream First Bank under normal business hours, the FDIC noted in a statement. Depositors of the failed bank will become customers of Dream First Bank, meaning that withdrawals, deposits, and loan transactions will be processed through Dream First Bank. Customers of Heartland Tri-State Bank should continue to use their existing branch location until the bank has completed the transition. </p><p>Heartland Tri-State Bank is the first bank to collapse since troubled First Republic Bank <a href=\"https://cointelegraph.com/news/jpmorgan-first-republic-bank-acquisition\">was acquired by J.P. Morgan</a> in May after efforts to rescue the company failed. It also follows the <a href=\"https://cointelegraph.com/news/silicon-valley-bank-collapse-everything-that-s-happened-until-now\">dramatic collapse of Silicon Valley Bank</a> in March that triggered days of chaos in the US banking system. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This evening, the Kansas bank commissioner closed Heartland Tri-State Bank of Elkhart. To protect depositors, the FDIC entered into an agreement with Dream First Bank of Syracuse, Kansas, to assume all of the deposits of Heartland Tri-State Bank. <a href=\"https://t.co/bQs4bnhEN2\">https://t.co/bQs4bnhEN2</a> <a href=\"https://t.co/e62HdCSiXN\">pic.twitter.com/e62HdCSiXN</a></p>&mdash; FDIC (@FDICgov) <a href=\"https://twitter.com/FDICgov/status/1685062401341743104?ref_src=twsrc%5Etfw\">July 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Heartland Tri-State Bank collapse also marks the second bank crisis of the week. On July 25, PacWest <a href=\"https://cointelegraph.com/news/pacwest-stock-flash-crash-recovers-with-banc-of-cali-merger\">merged with Banc of California</a>, with both banks seemingly looking to shore up amidst the banking industry turmoil. </p><p>Behind the bank's failures is believed to be the rising interest rates in the United States along with poor risk management from financial institutions. The Federal Reserve<a href=\"https://tradingeconomics.com/united-states/interest-rate\" target=\"_blank\" rel=\"noopener nofollow\"> increased</a> its benchmark rate over the past year to more than 5.25% in July — the highest rate since 2007 — in an effort to curb inflation in the country. In June, the inflation rate in the U.S. was 4.1% year-over-year.</p><p>Heartland Tri-State Bank had approximately $139 million in total assets and $130 million in total deposits as of March. Along with deposits, Dream First Bank agreed to purchase all the failed bank’s assets.</p><p>The FDIC estimates that the cost to the Deposit Insurance Fund (DIF) will be $54.2 million. The DIF is an insurance fund created by Congress in 1933 and managed by the FDIC to protect the deposits at the nation’s banks. \"Compared to other alternatives, Dream First Bank, National Association’s, acquisition was the least costly resolution for the DIF,\" said the FDIC.</p><p>Democrats with the House Financial Services Committee have introduced several bills in June in what they described as the “first wave” of legislation <a href=\"https://cointelegraph.com/news/us-lawmakers-propose-bills-to-hold-bank-execs-accountable-for-failures-and-address-risks\">aimed at addressing failures at major banks</a>.</p><p>“The failures of Silicon Valley Bank, Signature Bank, and First Republic Bank make clear that it is past time for legislation aimed at strengthening the safety and soundness of our banking system and enhancing bank executive accountability,” said at the time Congresswoman Maxine Waters. “Congress must not sit idly by.”</p><p><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Magazine:</em></strong></a><strong><em><u> </u></em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T16:03:53.000Z",
    "title": "Wall Street gains as U.S. inflation shows signs of slowing",
    "url": "https://www.cryptopolitan.com/wall-street-gains-as-inflation-signs-slowing/",
    "description": "The specter of inflation, long regarded as Wall Street&#8217;s archnemesis, seems to be tempering its haunting wails. Signs of a slowdown in the relentless inflationary surge have sparked a celebration in the US equity markets, as the odds of an additional interest rate hike by the Federal Reserve in September dissipate. Stellar performance in Wall ... <a title=\"Wall Street gains as U.S. inflation shows signs of slowing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wall-street-gains-as-inflation-signs-slowing/\" aria-label=\"More on Wall Street gains as U.S. inflation shows signs of slowing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T15:53:58.000Z",
    "title": "Crypto industry sees mixed results from Congress pre-recess",
    "url": "https://www.cryptopolitan.com/crypto-industry-mixed-results-from-congress/",
    "description": "As the halls of Congress emptied out for the September recess, the days leading up to the break witnessed a flurry of legislative action around digital assets. In this legislative whirlwind, the crypto industry experienced a mix of fortunes, with significant progress on some fronts contrasted by potential legislative roadblocks on others. Progress amid controversy: ... <a title=\"Crypto industry sees mixed results from Congress pre-recess\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-industry-mixed-results-from-congress/\" aria-label=\"More on Crypto industry sees mixed results from Congress pre-recess\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T15:44:08.000Z",
    "title": "How OpenAI’s ChatGPT Code Interpreter Can Make AI Chatbots Solve Real-World Problems",
    "url": "https://www.cryptopolitan.com/openai-chatgpt-code-interpreter-ai-chatbots/",
    "description": "OpenAI&#8217;s ChatGPT has captured the world&#8217;s imagination with its human-like conversational abilities. While it excels at solving complex problems, it has traditionally been limited to generating text-based responses. However, with the introduction of the ChatGPT Code Interpreter, OpenAI has taken a significant step forward in transforming the AI chatbot into an intelligent agent that can ... <a title=\"How OpenAI&#8217;s ChatGPT Code Interpreter Can Make AI Chatbots Solve Real-World Problems\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-chatgpt-code-interpreter-ai-chatbots/\" aria-label=\"More on How OpenAI&#8217;s ChatGPT Code Interpreter Can Make AI Chatbots Solve Real-World Problems\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-29T15:51:08.000Z",
    "title": "Privacy concerns raised as UK government advances Online Safety Bill",
    "url": "https://crypto.news/privacy-concerns-raised-as-uk-government-advances-online-safety-bill/",
    "description": "The U.K. Parliament is currently reviewing the Online Safety Bill (OSB) which could change the face of internet regulation"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-29T16:00:20.000Z",
    "title": "Shiba Inu Reclaims 14th Spot In Market After 5% Jump",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-reclaims-14th-spot/",
    "description": "After a rough few months of slipping down the ranks, Shiba Inu is back in the top 15 cryptocurrencies by market cap. In the last 24 hours, the price of Shiba Inu has spiked in excess of 5%, allowing it to overtake cryptocurrencies like Wrapped Bitcoin and Bitcoin Cash to reach the 14th spot with a market cap of $4.8 billion. Shiba Inu Jumps 5% In 24 Hours, Reclaiming 14th Spot The price of the majority of cryptocurrencies seems to be plateauing in the past week, with some even losing some of their market cap. However, meme coins like Shiba Inu and Dogecoin seem to be doing slightly well, with DOGE leading the pack with a 7.02% gain in the past seven days.  Related Reading: VC Firm Sequoia Capital Slashes Crypto Fund By 65% Amid Bear Market In the case of Shiba Inu (SHIB), the altcoin has found a bit of momentum, amassing an increase of 293.16% in trading volume in the past 24 hours.  As usual with volatile meme coins, it’s hard to pin down an exact catalyst of the spike. However, the price jump seems to have come after Shiba Inu&#8217;s developers announced the release of a testnet bridge between Shibarium and Ethereum. Shibarium to Ethereum Testnet Bridge Pushes SHIB&#8217;s Price by 5% Shiba Inu has come a long way since its creation as a meme coin made just to challenge the popular Dogecoin (DOGE). However, the Shiba Inu ecosystem now has a lot of following, investors, developers, and an active community.  Shiba Inu developers are now working on a Layer-2 upgrade with the aim of developing the ecosystem and becoming a serious blockchain contender. The network, which will operate on top of Ethereum, is called Shibarium and was announced earlier in March. When Shibarium is launched, it is expected to help minimize costs and increase transaction speeds. 🔥 Shibarium Beta Bridge has gone live for public testing! 🎉 Be among the first to try out this revolutionary cross-chain solution. Remember, always exercise caution and verify authenticity before connecting your wallet to any website. PLEASE DO NOT USE YOUR REAL ASSETS!… pic.twitter.com/7yfhX8gQc6 — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) July 26, 2023 On July 28, SHIB devs began testing a bridge that allows tokens to be easily transferred between the Shibarium and Ethereum. The testnet release is an important step toward making Shibarium a reality. This cross-chain solution seems to have sparked the interest of SHIB investors, as the price of the token spiked in the hours after.  Related Reading: Ripple Attorney Withdraws From SEC Lawsuit, Will It Affect XRP? How High Can The Price Go? Shiba Inu is the second-largest meme coin in terms of market cap. Although the price is now nearly 80% from its all-time high in October 2021, current upgrades show momentum seems to be turning positive. The coming months and the progress of the Shibarium Layer-2 will be crucial in determining whether Shiba Inu can build on this momentum to retest previous highs or whether it continues to plateau.  At the time of writing, SHIB is trading at $0.000008191. SHIB price recovers above $0.000008 &#124; Source: SHIBUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-29T16:00:38.000Z",
    "title": "Ripple’s Future: XRP To Reach $1 – Indicators Signal Soaring Momentum for Borroe ($ROE)",
    "url": "https://www.crypto-news-flash.com/ripples-future-xrp-to-reach-1-indicators-signal-soaring-momentum-for-borroe-roe/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-future-xrp-to-reach-1-indicators-signal-soaring-momentum-for-borroe-roe",
    "description": "The world of cryptocurrencies is always abuzz with excitement and anticipation as investors and traders closely monitor the market&#8217;s movement. Ripple&#8217;s XRP, a prominent digital asset, has been on the radar of many crypto enthusiasts, with its price fluctuations capturing attention and speculation.  Let’s explore the future prognosis of Ripple&#8217;s XRP, aiming to reach $1, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-29T16:00:07.000Z",
    "title": "New ERC-20 Token, Golden Inu, Trending Upward & Likely To Blast Past ATH — Here’s Why",
    "url": "https://www.crypto-news-flash.com/new-erc-20-token-golden-inu-trending-upward-likely-to-blast-past-ath-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=new-erc-20-token-golden-inu-trending-upward-likely-to-blast-past-ath-heres-why",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T161752.082.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T161752.082.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T161752.082-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Following its successful presale funding rounds, the new ERC-20 version of the Golden Inu [$GOLDEN] token, is garnering significant attention with a remarkable price surge. The currency has been on an upward trajectory, making waves as one of the most profitable memecoins in the past seven days.  Even with a required 7% slippage to trade, [...]"
  }
]