[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T08:23:16.000Z",
    "title": "BitGo Granted German Crypto Custody License by BaFin",
    "url": "https://www.coindesk.com/policy/2023/11/01/bitgo-granted-german-crypto-custody-license-by-bafin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BitGo had already been storing crypto assets under the regulator's supervision since 2019 as part of a transitional regime, the firm said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T08:31:24.000Z",
    "title": "Survey: 65% of Spaniards aren’t interested in using digital euro ",
    "url": "http://cointelegraph.com/news/survey-65-percent-spaniards-not-interested-in-digital-euro",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2f731242-902e-4230-8c55-ee3b66c90891.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The country’s population doesn’t demonstrate as high a confidence level in the European Central Bank’s digital currency project as the government does, according to the survey. </p>\n                    <p><p>As the Bank of Spain embraces the potential adoption of a digital euro, the country’s population doesn’t appear to have the same strong appetite for the European Central Bank’s digital currency project. </p><p>This emerges from the results of a survey <a href=\"https://www.bde.es/f/webbe/INF/MenuVertical/BilletesYMonedas/Estudios_e_informes/Estudio_sobre_habitos_efectivo/Informe_Ejecutivo_Habitos_uso_efectivo_2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> by the Bank of Spain entitled “Study on the habits in use of cash.” The survey was conducted by Ipsos on two groups, totaling 1,600 respondents: the general public and the representatives of small businesses. It also included questions on the digital euro, a potential pan-EU central bank digital currency (CBDC). </p><p>The study revealed that only 20% of the general public knows about a “digital euro.” The number among small businessmen is roughly the same, 23%. However, this question was posed in 2022. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/eu-data-protection-regulators-urge-anonymity-smaller-transactions-in-digital-euro\"><strong><em>EU data protection regulators urge anonymity for smaller transactions in digital euro</em></strong></a></p><p>In 2023, only 20% confirmed that they would use the digital euro to complement their regular payment methods, while 65% said they would not. A year ago, these numbers favored the CBDC more: in 2022, only 58% responded with a “No” to that question. </p><p>The age group showing the most enthusiasm for the digital euro is the youth (18-24) — 36% of this cohort said they would use the currency. This proportion gradually declines in age progression: 31% among the age 25-34, 24% among the age 35-44, 18% among the 55-64, and only 7% for those older than 65. </p><p>In October, the Bank of Spain published a text explaining the <a href=\"https://cointelegraph.com/news/bank-of-spain-embraces-digital-euro-explains-benefits\">nature and uses of the digital euro</a>. The bank claimed that the physical cash format “does not allow to exploit all the advantages offered by the growing digitalization of the economy and society.” However, the digital euro will make electronic payments a vital piece of the financial system.</p><p>Spain has recently demonstrated its firm commitment to the EU cause regarding the digital economy, and has decided to implement the Markets in Crypto Assets (MiCA), a pan-EU crypto framework, six months <a href=\"https://cointelegraph.com/news/spain-implement-mica-six-months-before-july-2026-deadline\">earlier than the general deadline demands</a>. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-incredible-rags-riches-tale-polygon-sandeep-nailwal/\"><strong><em>Slumdog billionaire. Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T08:17:39.000Z",
    "title": "Near taps Nym for metadata privacy, encryption services",
    "url": "http://cointelegraph.com/news/near-partners-with-nym-for-privacy-encryption-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/cfaf8757-3c47-4d8e-8c3f-67d1efc41fde.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Layer-1 blockchain Near will integrate Nym Technologies’ data privacy and encryption services for users and DApps operating across its ecosystem.</p>\n                    <p><p>Layer-1 protocol Near has tapped blockchain security firm Nym to provide end-to-end encryption and metadata privacy services for its ecosystem.</p><p>Nym, which provides blockchain agnostic layer-0 privacy infrastructure, will avail its mixnet tools to encrypt and cloak blockchain traffic and communication across the Near Protocol ecosystem. </p><p>Masking off-chain metadata traffic will protect transaction data during communication and create a barrier for malicious actors looking to de-anonymize users through access to IP addresses.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/cricket-world-cup-to-feature-web3-fan-app-icc-near-blockchain\">Cricket World Cup to feature Web3 fan app as ICC taps into Near blockchain</a></em></strong></p><p>An announcement from the collaborating projects states that Near users will be able to access ecosystem decentralized applications, decentralized finance protocols and nonfungible tokens with added security and privacy.</p><p>Nym’s integration aims to provide added privacy to the Near ecosystem, given that permissionless blockchains typically allow for transaction data and some off-chain information to be accessed by savvy users, including IP addresses and geolocation data.</p><p>This provides a vector for unwanted surveillance, targeted attacks and cybercrime. A statement from Nym CEO Harry Halpin highlights the importance of privacy-preserving tools to improve the nascent Web3 space:</p><blockquote>“Blockchain technology is a large change in digital communications but it’s an open secret that by their very nature, blockchains are not private. Only weaving privacy into the fabric of Web3 can ensure its success.”</blockquote><p>Nym’s mixnet protects blockchain traffic from detailed analysis by splitting data into encrypted packets that are then sent to “mix nodes” around the world. “Cover traffic” is randomly inserted into the mix to provide greater obfuscation of the communication system, greatly increasing the difficulty of metadata analysis. </p><p>NEAR Foundation CEO Chris Donovan notes that Nym’s technology will afford ecosystem participants greater privacy when using the protocol and speaks to the ethos of privacy-enhancing services:</p><blockquote>“Privacy is a fundamental human right and a cornerstone of the Web3 vision to create a more secure, user-centric and user-empowered web.”</blockquote><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/privacy-firm-nym-launches-300-m-fund\">reported</a> in October 2023, Nym Technologies launched a $300 million fund to identify and support Web3 projects building security-focused infrastructure. The fund will initially look to support wallets and platforms that store private keys that interact and manage access to DApps as well as RPC protocols and open-source Web3 tools and services.</p><p><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Magazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-01T08:17:44.000Z",
    "title": "FTX Co-Founder Sam Bankman-Fried Defends Use of Client Funds as ‘Risk Management’ in Court Testimony",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ftx-co-founder-sam-bankman-fried-defends-use-of-client-funds-as-risk-management-in-court-testimony/",
    "description": "On October 31, Sam Bankman-Fried, commonly known as SBF, the co-founder and former CEO of the now-defunct cryptocurrency exchange FTX, testified in court that the utilization of clients’ fiat deposits was a component of “risk management” for his associated crypto hedge fund, Alameda Research. The court hearing took place on 31 October, where SBF was […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T08:31:09.000Z",
    "title": "Why is Uniswap V4 A Game-Changer for the Finance Industry?",
    "url": "https://www.cryptopolitan.com/why-is-uniswap-v4-a-game-changer-for-the-finance-industry/",
    "description": "Decentralized Finance (DeFi) has emerged as one of cryptocurrencies&#8217; most groundbreaking and transformative developments. At the heart of this financial revolution lies Uniswap, a decentralized exchange (DEX) that has consistently pushed the boundaries of what&#8217;s possible in crypto. Since its inception, Uniswap has been at the forefront of innovation, reshaping how users swap, trade, and ... <a title=\"Why is Uniswap V4 A Game-Changer for the Finance Industry?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-uniswap-v4-a-game-changer-for-the-finance-industry/\" aria-label=\"More on Why is Uniswap V4 A Game-Changer for the Finance Industry?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T08:23:43.000Z",
    "title": "Safeguarding Against the Perils of AI Safety Amidst Brexit Dilemmas and Rishi Sunak’s Ambitious Gambit",
    "url": "https://www.cryptopolitan.com/perils-of-ai-safety-amidst-brexit-dilemmas/",
    "description": "In a bid to establish Britain as a frontrunner in the realm of tech regulation, Rishi Sunak, the UK&#8217;s Prime Minister, spearheads a two-day international summit at Bletchley Park, with a primary focus on AI safety. In the tumultuous embrace of the ongoing global dialectic with the expeditious evolution of artificial intelligence, the summit emerges ... <a title=\"Safeguarding Against the Perils of AI Safety Amidst Brexit Dilemmas and Rishi Sunak&#8217;s Ambitious Gambit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/perils-of-ai-safety-amidst-brexit-dilemmas/\" aria-label=\"More on Safeguarding Against the Perils of AI Safety Amidst Brexit Dilemmas and Rishi Sunak&#8217;s Ambitious Gambit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T08:10:18.000Z",
    "title": "HashKey unveils first licensed crypto app for retail in Hong Kong",
    "url": "https://www.cryptopolitan.com/hashkey-unveils-first-licensed-crypto-app/",
    "description": "Hong Kong&#8217;s renowned cryptocurrency exchange, HashKey, has officially expanded into the retail sector with the launch of its innovative trading app. This move marks the platform as the premier licensed virtual asset exchange app in Hong Kong. Livio Weng, HashKey&#8217;s Chief Operating Officer, revealed in a recent interview that the app has garnered the green ... <a title=\"HashKey unveils first licensed crypto app for retail in Hong Kong\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hashkey-unveils-first-licensed-crypto-app/\" aria-label=\"More on HashKey unveils first licensed crypto app for retail in Hong Kong\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T08:30:46.000Z",
    "title": "XRP Whale Transactions Spike To 3-Month High As Smart Money Buys",
    "url": "https://www.newsbtc.com/xrp-news/xrp-whale-transactions-3-month-high-smart-money/",
    "description": "XRP has witnessed a remarkable surge of over 29% in its value over the last 12 days. The price has risen from $0.4771 to a two and a half month high of $0.6209 yesterday. Sharks And Whales Make A Splash This impressive price hike coincides with an increase in whale transactions as well as the number of wallets holding more than 10,000 XRP (worth approx. $5,930), indicating heightened interest from retail investors as well as large investors, commonly referred to as “whales” in the crypto community. On-chain analytic firm Santiment shared via X (formerly known as Twitter), “XRP revisited a $0.60 market value for the first time since its tumble back on August 16th. Along this road back, we have seen whales get gradually more involved. Additionally, there are now an alltime high 277.62K wallets holding at least 10,000 XRP.” Santiment presented the below chart and stated that the ledger has shown a noticeable increase in the number of wallets holding 10,000 coins or more, with the current number exceeding 277.6K. Moreover, there has been a significant uptick in the volume of whale transactions, with those exceeding $1 million in value spiking to a 3-month high. To be precise, October 31, 2023, saw a total of 255 such high-value transactions. Related Reading: XRP Price Confirms Breakout Above Multi-Month Resistance: Next Targets The data by Santiment provides a clear visual representation of the increasing trend in XRP&#8217;s price, which is further underscored by the corresponding rise in large transactions and whale wallet count. With an evident increase in the activity of both &#8216;sharks&#8217; and &#8216;whales&#8217;, the market seems to be attracting significant attention from big players. Remarkably, the most popular whale tracker on X has reported quite a few whale transactions in the last 24 hours. First of all, as usual for the 1st of the month, Ripple has released 1 billion XRP from the escrow account. Whale Alert reported 3 transactions of 500 million, 400 million and 100 million XRP. Related Reading: XRP Price Prediction – A Strengthening Case For Rally Above $0.62 In addition, there were also other interesting transactions. Thus, Ripple transferred 50 million XRP (about $29.87 million) to an unknown wallet. 24.9 million tokens (about $14.9 million) were transferred from an unknown wallet to Bitstamp. Moreover, 30 million XRP (about $17.2 million) were transferred from Bybit to an unknown wallet. Smart Money Is Buying XRP Analyst Jaydee has turned his focus to the XRP/BTC chart, suggesting that discerning investors find more than just price ticks and candlesticks. He noted, &#8220;I&#8217;m paying more attention to the XRP/BTC chart. Smart money is respecting the multi-year trendline.&#8221; The multi-year trendline in the 1-week chart, accentuated by four touchpoints, has acted as a crucial support for the altcoin when paired against BTC. Every touch on this line has resulted in a significant price surge, emphasizing its role as a robust line of defense against bearish pressures. The chart further showcases dramatic price increases. At one point, a bullish rally catapulted the price by a staggering 415%. This wasn&#8217;t an isolated incident. Subsequent surges of 230%, 101%, and 60% followed, painting a picture of resilience and bullish momentum for the cryptocurrency against its Bitcoin counterpart. Yesterday, Jaydee drew attention to the recent bounce on the chart. He elaborated, &#8220;Look at that bounce on XRP/BTC chart! Looks like SMART MONEY are buying now while DUMB MONEY were buying the lawsuit narratives.&#8221; At press time, XRP traded at $0.5983. Featured image Mike Doherty / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T08:32:24.000Z",
    "title": "Torobase: A Premier Solution for Algorithmic Trading Professionals",
    "url": "https://coinedition.com/torobase-a-premier-solution-for-algorithmic-trading-professionals/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/pr-1-123.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/pr-1-123.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/pr-1-123-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the evolving landscape of global trading infrastructure, Torobase distinctly positions itself as the pre-eminent choice for algorithmic traders, underpinned by a suite of robust features and sophisticated capabilities. 1. Seamless Online Trading Experience The modern trading ecosystem requires adaptability and continuous engagement. Torobase delivers on these fronts by offering: &#8211; Global Accessibility: Ensuring traders [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/torobase-a-premier-solution-for-algorithmic-trading-professionals/\">Torobase: A Premier Solution for Algorithmic Trading Professionals</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T08:19:59.000Z",
    "title": "KuCoin’s One and Only Pre-Market Trading Attracts Nearly 2M USDT in First Hour",
    "url": "https://coinedition.com/kucoins-one-and-only-pre-market-trading-attracts-nearly-2m-usdt-in-first-hour/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2.png 730w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-313x175.png 313w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-129x73.png 129w, https://coinedition.com/wp-content/uploads/2023/11/KuCoins_New_Pre_Market_Trading_Attracts_Nearly_2M_USDT_in_First-2-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>KuCoin, a leading cryptocurrency exchange, has successfully launched its new Pre-Market Trading product, attracting almost 2 million USDT in trading volume within its first hour, and successfully securing 4.3% of the initial market liquidity before the market was open, which served as an effective anchor point for pricing and reference for users. The exchange announced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/kucoins-one-and-only-pre-market-trading-attracts-nearly-2m-usdt-in-first-hour/\">KuCoin’s One and Only Pre-Market Trading Attracts Nearly 2M USDT in First Hour</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]