[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T20:01:46.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Grammy Awards will consider music with <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> elements from now on. Meanwhile, in Asia, there's hope that account abstraction or Ethereum \"smart accounts\" could onboard a billion users to Web3. Also, the race for a spot Bitcoin ETF is heating up in the United States. </p><h2>Nasdaq joins BlackRock and Fidelity in refiling spot Bitcoin ETF application</h2><p>Nasdaq has <a href=\"https://cointelegraph.com/news/nasdaq-refiles-valkyrie-spot-bitcoin-etf-coinbase-surveillance-partner\">refiled for a proposed rule change</a> with the U.S. Securities and Exchange Commission that would pave the way for a spot Bitcoin ETF for the Valkyrie Bitcoin Fund. The July 3 filing includes information on a \"surveillance-sharing agreement\" with Coinbase, as well as details of a June 30 agreement with Coinbase that would give Nasdaq \"supplemental access to data regarding spot Bitcoin trades.\"</p><p>The move came mere days after asset manager BlackRock refiled its Bitcoin ETF application after the SEC reportedly said that recent ETF filings with Nasdaq and Cboe were \"not sufficiently clear and comprehensive.\"</p><p>The race to list a spot Bitcoin ETF is heating up in the United States, with at least eight issuers vying for approval as of July 5. Issuers expect to hear back from the SEC in August and September, with final approval deadlines slated between December 2023 and March 2024.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: These are the current competitors in the <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF race. There&#39;s still a lot of unknowns right now <a href=\"https://t.co/XDexRHJFlN\">pic.twitter.com/XDexRHJFlN</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1676625042556239877?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Music with AI-created elements eligible for Grammy Awards, CEO confirms</h2><p>The CEO and president of the Recording Academy, Harvey Mason, clarified that AI-generated music will be eligible for the Grammy Awards in 2024. He said:</p><blockquote>“AI, or music that contains AI-created elements is absolutely eligible for entry and for consideration for Grammy nomination. Period.”</blockquote><p>However, the Academy would not give a Grammy or a nomination to the AI portion of the track, which includes AI voice model. “We don’t want to see technology replace human creativity. We want to make sure technology is enhancing, embellishing, or additive to human creativity,” he warned.</p><h3>Account abstraction to lead Asia's Web3 explosion: ConsenSys</h3><p>One billion users from Asia <a href=\"https://cointelegraph.com/news/eth-smart-accounts-drive-billion-asia-users-consensys-exec\">could onboard to Web3</a> due to “smart accounts,” also known as account abstraction, Laura Shi, the director of strategic initiatives at ConsenSys told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/magazine/account-abstraction-supercharges-ethereum-wallets-dummies-guide/\">Account abstraction</a> — as proposed by <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/vitalik-buterin\">Vitalik Buterin</a> and other developers in September 2021 — offers more “bank-like” features than a regular crypto wallet which Shi claims would increase adoption in the Asia-Pacific region:</p><blockquote>“The development of account abstraction will facilitate the onboarding of the billion-level users in APAC to Web3.”</blockquote><p>Shi said the Ethereum and Web3 ecosystem had a strong expansion in Asia so far this year and many dApps are \"improving UX for the Asian market, including introducing Asian language support.\"</p><p>The primary drivers of the expansion are zero knowledge Ethereum Virtual Machine (zkEVM) rollups and the mass adoption  of Optimistic rollups.</p><p>Adoption in Asia is also driven by social and Web3 gaming according to Shi, who pointed to South Korea and China as examples. She added both use cases will rely heavily on zkEVM roll ups and account abstraction development.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T20:00:00.000Z",
    "title": "IMF eyes tens of billions in crypto asset taxes, has few suggestions for collecting them",
    "url": "https://cointelegraph.com/news/imf-eyes-tens-of-billions-in-crypto-asset-taxes-has-few-suggestions-for-collecting-them",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/88a8ea50-d2e3-42b7-8679-102ea239577b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Income tax, property tax, VAT, corrective taxation — there is a tax goldmine out there for governments, but they will have to think hard about accessing it.</p>\n                    <p><p>Governments have yet to address all the ways crypto might be taxed, the <a href=\"https://cointelegraph.com/news/what-is-the-international-monetary-fund-and-how-does-it-work\">International Monetary Fund</a> (IMF) has realized, and the amount of taxes not imposed or collected may reach well into the tens of billions of dollars. That insight does little to reduce the variety of challenges to taxing crypto, however.</p><p>Crypto’s “semi-anonymity,” its dual nature as an investment vehicle and a means of payment and its high volatility complicates the tax collectors’ task beyond their current abilities, a new IMF working paper <a href=\"https://t.co/YYdp2mfD6p\" target=\"_blank\" rel=\"noopener nofollow\">said</a>. There is no consensus yet even on how to tax cryptocurrency —  as income, capital gains (which is most common) or gambling, and it doesn’t help that tax systems were designed before the emergence of blockchain technology, which has spun out a range of assets that needs separate treatment. </p><p>The paper noted that crypto is not an especially effective means for tax evasion due to its high fees and volatility. However, if the potential for crypto tax collection could be harnessed, “corrective” taxation could help offset the undesired influence of crypto on macroeconomic factors, as well as further ecology goals. The paper noted that green taxation is being explored, but more mechanisms must be considered. </p><p>The paper cited research monitoring crypto transactions relative to statements by tax authorities in the United States. It showed that the market does respond to tax authorities’ guidance, sometimes indicating new attempts at evasion.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/kraken-ordered-by-court-disclose-user-data-irs-tax-compliance\">Kraken ordered by court to disclose user data to IRS for tax compliance</a></em></strong></p><p>There is “relatively little analytical work or empirical evidence to draw on” even though the “vast amounts of data are in principle available on transactions in cryptocurrencies,” the IMF said. The popularity of crypto in emerging economies, where collection technology may be limited, is another drawback, although even when crypto is seized, such as by the United States Federal Bureau of Investigation, the method for doing so is left unclear. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">“Policymakers are struggling to accommodate cryptocurrencies within tax systems not designed to handle them; this paper reviews the issues that arise. <br><br>The greatest challenges are for implementation: crypto’s quasi-anonymity is an inherent obstacle to third-party reporting.”… <a href=\"https://t.co/qTCo6jnL6I\">pic.twitter.com/qTCo6jnL6I</a></p>&mdash; Joshua Rosenberg (@_jrosenberg) <a href=\"https://twitter.com/_jrosenberg/status/1676584523704745984?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Furthermore, the crypto market is split between whales and small holders, which may also require separate treatment. Proper tax design is crucial. A flat-rate tax could be imposed on anonymous transactions, for example. The challenge is not anonymity, but technology:</p><blockquote>“What impedes its anonymous implementation in the blockchain case is an inability of the tax authorities to insert themselves into the chain.”</blockquote><p>The desire to solve these problems is also an issue:</p><blockquote>“The distributed ledger technology […] might ultimately prove valuable for tax administration; and the use of smart contracts (self-executing programs) within blockchains, for example, might in principle help secure chains of VAT compliance and enforce withholding.” </blockquote><p>Centralized exchanges could present more opportunities than decentralized exchanges to police for tax compliance, the paper noted, although work would have to be done to implement it. Mandatory Anti-Money Laundering/Know Your Customer measures would be inadequate for tax reporting purposes, it claimed. </p><p>Greater reporting requirements for crypto miners would be one starting point for increasing tax compliance, the IMF said. Sales and value-added taxation (VAT) have been little considered and are a tangle of inconsistencies as regards crypto. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T20:05:19.000Z",
    "title": "Celsius moves altcoins to new wallets in preparation for Bitcoin and Ethereum conversion",
    "url": "https://cryptoslate.com/celsius-moves-altcoins-to-new-wallets-in-preparation-for-bitcoin-and-ethereum-conversion/",
    "description": "<p>Bankrupt crypto lender Celsius Network moved around $70 million worth of altcoins on July 5 following the recent court approval to sell them for Bitcoin (BTC) and Ethereum (ETH). Data from Arkham Intelligence showed that the lender had moved millions of altcoins and stablecoins to different wallets, including those related to crypto market maker Wintermute, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/celsius-moves-altcoins-to-new-wallets-in-preparation-for-bitcoin-and-ethereum-conversion/\">Celsius moves altcoins to new wallets in preparation for Bitcoin and Ethereum conversion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T20:09:02.000Z",
    "title": "Top 30 Interview Questions and Answers for a Web3 Security Engineer Role",
    "url": "https://www.cryptopolitan.com/interview-questions-web3-security-engineer/",
    "description": "The role of a Web3 security engineer is crucial in ensuring the integrity, confidentiality, and availability of decentralized applications and blockchain networks. As the Web3 ecosystem continues to grow and evolve, organizations seek skilled professionals to safeguard their platforms against emerging threats and vulnerabilities. To land a Web3 security engineer role, candidates must demonstrate a ... <a title=\"Top 30 Interview Questions and Answers for a Web3 Security Engineer Role\" class=\"read-more\" href=\"https://www.cryptopolitan.com/interview-questions-web3-security-engineer/\" aria-label=\"More on Top 30 Interview Questions and Answers for a Web3 Security Engineer Role\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:57:04.000Z",
    "title": "Valkyrie resubmits spot Bitcoin ETF application with Coinbase surveillance-sharing agreement",
    "url": "https://www.cryptopolitan.com/valkyrie-resubmits-spot-bitcoin-etf-application/",
    "description": "Valkyrie Investments has resubmitted its application for a spot Bitcoin exchange-traded fund (ETF) in the United States, making a significant update by including a surveillance-sharing agreement with Coinbase. It is important to note that the sudden move comes as a response to the U.S. Securities and Exchange Commission&#8217;s (SEC) request for more clarity and comprehensiveness ... <a title=\"Valkyrie resubmits spot Bitcoin ETF application with Coinbase surveillance-sharing agreement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/valkyrie-resubmits-spot-bitcoin-etf-application/\" aria-label=\"More on Valkyrie resubmits spot Bitcoin ETF application with Coinbase surveillance-sharing agreement\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:54:23.000Z",
    "title": "How to Become a Web3 Security Engineer: Get the Best Opportunities",
    "url": "https://www.cryptopolitan.com/how-to-become-a-web3-security-engineer/",
    "description": "Becoming a Web3 security engineer is an exciting career path that involves protecting and securing decentralized applications (dApps), smart contracts, and blockchain networks. As the Web3 ecosystem expands, the demand for skilled security engineers is also rising. This guide will explore the steps you can take to become a Web3 security engineer. Understand the Fundamentals ... <a title=\"How to Become a Web3 Security Engineer: Get the Best Opportunities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-become-a-web3-security-engineer/\" aria-label=\"More on How to Become a Web3 Security Engineer: Get the Best Opportunities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:47:18.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin (APE) worth? ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-05T19:47:37.000Z",
    "title": "AVALANCHE PRICE ANALYSIS & PREDICTION (July 4) – Avax Finds It Difficult To Flip $13.5 Following Drops In Volatility, Suspends Bullish",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-july-4-avax-finds-it-difficult-to-flip-13-5-following-drops-in-volatility-suspends-bullish/",
    "description": "Avalanche is still looking bearish on the higher time frame. But the recent bounce off a key psychological level seems to have changed the direction of the market as it now turned bullish on the lower timeframe with a 30% gain in a month. Avax has added a few dollars to its price since it [&#8230;]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T20:00:59.000Z",
    "title": "Chart With Historical Precedence Signaling Bitcoin Rallies, According to Top Crypto Analyst",
    "url": "https://dailyhodl.com/2023/07/05/chart-with-historical-precedence-signaling-bitcoin-rallies-according-to-top-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/signaling-bitcoin-rallies-top.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst says one key Bitcoin (BTC) metric suggests the top crypto asset by market cap is officially on the road to recovery. Pseudonymous analyst Dave the Wave tells his 139,200 Twitter followers that Bitcoin&#8217;s monthly moving average convergence divergence (MACD) indicator now looks long-term bullish. &#8220;If the monthly MACD indicator suggested the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/chart-with-historical-precedence-signaling-bitcoin-rallies-according-to-top-crypto-analyst/\">Chart With Historical Precedence Signaling Bitcoin Rallies, According to Top Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T19:55:11.000Z",
    "title": "Crypto-Friendly DBS Bank Launches Digital Yuan Designed for CBDC Payments",
    "url": "https://dailyhodl.com/2023/07/05/crypto-friendly-dbs-bank-launches-digital-yuan-designed-for-cbdc-payments/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/05/digital-yuan-support2.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto-friendly bank founded by the government of Singapore is launching a digital version of the Chinese yuan designed for central bank digital currency (CBDC) payments. According to a new press release by DBS Bank, its Chinese branch will be launching a system that would allow businesses on the mainland to accept CBDC payments. “DBS [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/crypto-friendly-dbs-bank-launches-digital-yuan-designed-for-cbdc-payments/\">Crypto-Friendly DBS Bank Launches Digital Yuan Designed for CBDC Payments</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]