[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T09:41:17.000Z",
    "title": " U.S. Virginia bill seeks working group to study crypto, blockchain ",
    "url": "https://cointelegraph.com/news/us-virginia-bill-working-group-crypto-blockchain-study",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNGMwNGE3MWYtYzE2Yi00NzI1LThlMDgtOTEyZTRlNzQ2ZjRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The current draft of SB338 comes as a substitute amendment to the bill’s initial version, introduced to the Senate in January.</p>\n                    <p><p>Virginia lawmakers propose convening a work group to research blockchain technology, digital asset mining, and cryptocurrency. The proposition was <a href=\"https://lis.virginia.gov/cgi-bin/legp604.exe?241+ful+SB339S1+pdf\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> in the form of a Senate bill on Feb. 5. </p><p>Senate Bill No. 339 (SB339), proposed by the Senate Committee on Commerce and Labor, will authorize the Bureau of the Financial Institutions of the State Corporation Commission to create a work group “for the purpose of studying and making recommendations” on all things crypto.</p><p>According to the bill, the group shall consist of 13 individuals: 5 Senators, 5 Delegates from the lower chamber of Virginia General Assembly, the House of Delegates; two experts on blockchain, appointed by the Bureau and one member of the local government. All the nonlegislative members of the work group must be residing in Virginia.</p><p><a href=\"https://cointelegraph.com/news/us-virginia-bill-working-group-crypto-blockchain-study\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T09:57:49.000Z",
    "title": "ProShares optimistic amidst rise of spot Bitcoin ETFs",
    "url": "https://www.cryptopolitan.com/proshares-optimistic-amidst-rise/",
    "description": "ProShares, a leading issuer of futures-based Bitcoin exchange-traded funds (ETFs), remains bullish despite the emergence of spot Bitcoin ETFs in the United States. The company anticipates operational and commercial benefits from the increased adoption of spot ETFs, highlighting the efficiency of its flagship Bitcoin futures ETF, the ProShares Bitcoin Strategy ETF (BITO). Commercial impact and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T09:50:39.000Z",
    "title": "B2C2 expands EU presence with Luxembourg approval",
    "url": "https://www.cryptopolitan.com/b2c2-expands-eu-presence-with-luxembourg/",
    "description": "Leading liquidity provider B2C2 has announced its expansion into Luxembourg following the acquisition of regulatory approval from the Commission de Surveillance du Secteur Financer (CSSF). The move marks a strategic effort to broaden B2C2&#8217;s presence within the European Union six months after obtaining a license to operate in France. Regulatory approval and expansion B2C2, headquartered [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T09:45:23.000Z",
    "title": "Inside the AI-Powered Transformation of Dover’s Port",
    "url": "https://www.cryptopolitan.com/ai-powered-transformation-of-dovers-port/",
    "description": "The Port of Dover has embarked on an ambitious project in collaboration with the University of Manchester and the University of Plymouth to create a digital twin of the iconic harbor. This innovative endeavor aims to leverage cutting-edge technology to enhance operational efficiency and potentially alleviate traffic congestion in the area. Port of Dover&#8217;s digital [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T09:59:17.000Z",
    "title": "Analysts earmark 4 coins set for gains in 2024",
    "url": "https://crypto.news/analysts-earmark-4-coins-set-for-gains-in-2024/",
    "description": "Galaxy Fox, Solana, Bitcoin, and Chainlink are top coins analysts are bullish on in 2024"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T09:41:47.000Z",
    "title": "BlackRock spot Bitcoin ETF enters top 5 US ETPs by capital inflow",
    "url": "https://crypto.news/blackrock-spot-bitcoin-etf-enters-top-5-us-etps-by-capital-inflow/",
    "description": "A spot Bitcoin ETF from financial giant BlackRock has become one of the top five exchange-traded products (ETPs) in the United States in terms of capital inflows. According to data from YCharts, the cryptocurrency fund under the ticker IBIT was&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T09:55:42.000Z",
    "title": "Dogecoin Massive Dump: 100 Million DOGE Floods Robinhood, Investors Brace For Price Impact",
    "url": "https://www.newsbtc.com/news/dogecoin-massive-dump-100-million-doge-floods-robinhood-investors-brace-for-price-impact/",
    "description": "In a surprising turn of events within the cryptocurrency realm, Dogecoin (DOGE), the popular meme coin, experienced a frenzy in the broader crypto market. The cause of this excitement was a recent significant whale transaction that caught the attention of traders and investors globally. Related Reading: Ronin Plunges Nearly 30% After Binance Debut, Raising Concerns About Pre-Listing Hype DOGE Whales: Surging Transfers, Market Speculations According to blockchain metrics highlighted by the tracker Whale Alert, a staggering 100 million DOGE, equivalent to $7.83 million, was observed on the move. This notable transfer from an unknown wallet, identified as …wwKF, to the renowned American financial services provider Robinhood, sparked immense curiosity among crypto enthusiasts worldwide. 🚨 100,000,000 #DOGE (7,836,678 USD) transferred from unknown wallet to #Robinhoodhttps://t.co/REEoqcGAoe — Whale Alert (@whale_alert) February 7, 2024 Despite expectations of a price dip due to such a substantial selloff by the whale, DOGE managed to trade in the green as of press time. This unexpected movement fueled speculations about a potential run for the meme coin in the near future. Market participants eagerly observed the impact that the colossal selloff might have on DOGE&#8217;s price. In addition to the whale transaction, the token witnessed a surge in wallet adoption in recent days. On-chain analytics firm Santiment reported that approximately 414,000 non-zero wallets were added to the DOGE network over the past two weeks, marking the fastest rate of growth in the brief history of the memecoin. Source: Coinglass The growth in wallet adoption primarily stemmed from retail investor cohorts, as indicated by the dramatic increase in addresses holding between 0.001-1 coins. This surge in new users joining the DOGE community can be attributed to the cryptocurrency&#8217;s cult status in the meme coin space and its widespread popularity. Interestingly, while the DOGE price experienced a marginal jump at the time of the whale transaction, the subsequent market trends displayed a gradual downward momentum. The weekly and monthly charts indicated a drop of 1.5% and 3.1%, respectively. The contrasting movements in the DOGE price and the whale&#8217;s massive selloff, coupled with the decrease in open interest by 2.2%, raised questions about the overall market sentiment. Dogecoin currently trading at $0.07845 on the daily chart: TradingView.com Dogecoin&#8217;s Potential Shift: Enthusiasts Await Action Crypto market enthusiasts worldwide are closely monitoring DOGE, eagerly anticipating a potential shift in price action. The influx of new users and the increased number of non-zero wallets added to the network have added to the intrigue surrounding the meme coin. While the recent whale transaction and the surge in wallet adoption have generated excitement within the DOGE community, it is essential to exercise caution when navigating the highly volatile cryptocurrency market. Factors such as market sentiment, global events, and regulatory developments can have a significant impact on the future price movements of DOGE and other cryptocurrencies. Source: Santiment Meanwhile, a recent analysis of Coinglass data by NewsBTC reveals a consistent trend where negative short bets on Dogecoin have consistently outnumbered bullish long bets over the past week. Related Reading: Market Dip? Not For Dogecoin Wallets As Over 400,000 New Users Drive Frenzy Upward This divergence in sentiment within the options market adds complexity to the DOGE landscape, signaling caution among traders and suggesting uncertainty about the sustainability of recent positive price movements. Featured image from Freepik, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T10:00:02.000Z",
    "title": "Shiba Inu’s Shibarium Sees Spike in New User Activities; Internet Computer’s (ICP) Steady Climb Continues; NuggetRush (NUGX) Eyes 70x Growth",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-sees-spike-in-new-user-activities-internet-computers-icp-steady-climb-continues-nuggetrush-nugx-eyes-70x-growth/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-sees-spike-in-new-user-activities-internet-computers-icp-steady-climb-continues-nuggetrush-nugx-eyes-70x-growth",
    "description": "<img width=\"1200\" height=\"914\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T103821.832.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T103821.832.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T103821.832-300x229.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T103821.832-768x585.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T103821.832-150x114.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T103821.832-450x343.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Shibarium experienced an uptick in new account activity. Internet Computer boasts further upside potential. NuggetRush is the hottest P2E memecoin, with analysts predicting explosive growth post-launch. Shiba Inu (SHIB) is back in the spotlight, for the right reasons this time. Its layer-2 scaling solution, Shibarium, has seen remarkable growth—a staggering 250% increase in new account [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-07T09:45:05.000Z",
    "title": "Conquering Ethereum’s Limitations: Crypto’s Top 4 Layer 2 Chains",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/conquering-ethereums-limitations-cryptos-top-4-layer-2-chains/",
    "description": "<p>Undoubtedly, Ethereum is the biggest ecosystem. But it’s SLOW And expensive. And generally just crappy to use. And that’s why Layer 2 solutions exist for Ethereum. Whether we like it or not, most of the growth and most of the innovation for EVM is happening at the Layer 2 level. It’s not a bad thing as [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/conquering-ethereums-limitations-cryptos-top-4-layer-2-chains/\">Conquering Ethereum&#8217;s Limitations: Crypto&#8217;s Top 4 Layer 2 Chains</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]