[
  {
    "source": "CoinDesk",
    "date": "2023-05-26T00:57:25.000Z",
    "title": "USBTC Aims to Become Bitcoin Mining Giant After Deal to Buy Celsius Assets",
    "url": "https://www.coindesk.com/business/2023/05/26/usbtc-aims-to-become-bitcoin-mining-giant-after-deal-to-buy-celsius-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The miner will receive $15 million management fee for the Celsius mining assets, which it will operate exclusively."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T01:04:50.000Z",
    "title": "Cerus Markets Announces 400:1 Leverage Update",
    "url": "https://cryptodaily.co.uk/2023/05/cerus-markets-announces-4001-leverage-update",
    "description": "<p>Labuan, Malaysia, May 26th, 2023, Chainwire</p><p>Cerus Markets is thrilled to announce an exciting update to its leverage options for non-crypto instruments. Effective immediately, Cerus Markets clients can enjoy leverage of up to 400:1 for Forex, Commodities, Indices, and Single Stocks trading.</p><p>This increase in leverage options allows traders to make the most of their investments, providing greater market exposure and the potential for higher returns. By offering increased leverage options for non-crypto instruments, Cerus Markets aims to provide clients with even more opportunities to capitalize on market movements.</p><p>At Cerus Markets, the company prides itself on its commitment to providing clients with the best possible trading experience. This update is just one example of the company's dedication to ensuring that clients have access to the best tools and trading conditions.</p><p>About Cerus Markets</p><p>Established in 2022, Cerus Markets Limited is a multi-asset broker authorized and regulated by the Labuan Financial Service Authority, Malaysia. With a focus on innovation, Cerus offers unique crypto derivative products that allow clients to trade over 200 instruments paired with cryptocurrencies. Alongside crypto derivatives, Cerus provides trading opportunities in FX, Commodities, Indices, and Single Stocks.</p><p>Cerus Markets believes in empowering traders of all levels with easy and affordable access to the market. The trading platform stands out from traditional brokers by not charging entry fees and allowing trading of a wide range of digital assets starting from just $50, with leverage up to 400:1.</p><p>Moreover, traders can benefit from a 100% deposit matching bonus, doubling the amount of their first deposit and further enhancing their trading experience.</p><p>Visit cerusmarkets.com to learn more about Cerus Markets and its offerings.</p><p>Instagram l Twitter l Telegram</p>ContactMarketing Director at Cerus MarketsVeronica Imashevamarketing@cerusmarkets.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T01:00:00.000Z",
    "title": "Crypto Competition Time With DogeMiyagi, CoinMarketCap And Crypto.com!",
    "url": "https://cryptodaily.co.uk/2023/05/crypto-competition-time-with-dogemiyagi-coinmarketcap-and-cryptocom",
    "description": "<p>There are some exciting crypto competitions taking place in the world of cryptocurrency right now. These competitions are often an exciting backdoor into buying crypto and are always enticing propositions for investors. Right now, there are some exciting crypto competitions taking place and we&rsquo;ll take a closer look at three of them hosted by the meme coin DogeMiyagi (MIYAGI), the crypto exchange Crypto.com and CoinMarketCap.</p>\n<p>DogeMiyagi Widening Its Reach On Twitter With Its Crypto Competition</p>\n<p>DogeMiyagi is the latest meme coin to have caught the attention in recent weeks. It&rsquo;s currently in the process of a presale with real aspirations of being a prominent cryptocurrency when it eventually goes live. Inspired by the iconic Karate Kid films, it&rsquo;s currently hosting a crypto competition, shared on its Twitter pages, to widen its reach.&nbsp;</p>\n<p>The rules of DogeMiyagi&rsquo;s crypto competition are straightforward: whoever spends the most on MIYAGI tokens between the 24th and 30th of May will receive double their amount of tokens in that period. It represents an interesting proposition for investors. They will undoubtedly be racing with others to see who can buy the most in MIYAGI tokens, and for the winner, the rewards will be an incredible return.</p>\n<p></p>\n<p>Crypto.com Offering Competition With SHIB</p>\n<p>Singapore-based cryptocurrency exchange Crypto.com has introduced a fresh trading competition that incorporates Shiba Inu's SHIB. Participants in this contest are required to engage in a spot trade of no less than $100 for SHIB, GEL, or SAND, giving them the opportunity to win up to $1,000.</p>\n<p>As per the official announcement, there is a chance for the top 20 traders to secure a maximum reward of $1,000. It is worth mentioning that Crypto.com recently initiated another trading competition for the governance token of Shiba Inu, known as ShibaSwap (BONE). Winners of this event can participate in a total rewards pool of $5,000. In a similar manner, the top 20 spot traders of BONE have the chance to win up to $1,000. At the time of writing, SHIB experienced a 5.14% decline within the last 24 hours, reaching a value of $0.00001093. BONE also witnessed a decline of 6.76%, settling at $1.</p>\n<p>CoinMarketCap Is Introducing a Novel Crypto Competition</p>\n<p>CoinMarketCap, a crypto price tracking website, is entering reality television by introducing a competition show named \"Killer Whales,\" seemingly inspired by the TV series &ldquo;Shark Tank.&rdquo;&nbsp;</p>\n<p>In collaboration with Web3 entertainment company Hello Labs, this new program offers entrepreneurs the opportunity to present their projects to the panel of \"Killer Whale\" judges, consisting of entrepreneurs, influencers, and founders of Web3 companies. Hello Labs was established by Paul Caslin, who is known for producing the MTV VMA Awards.</p>\n<p>Jonathan Isaac, the chief marketing officer at CoinMarketCap, stated, \"Killer Whales is an enjoyable and thrilling way to bring the entrepreneurial spirit of the Web3 space to households around the world,\" in a press release.</p>\n<p>Starting from the 2nd of May, interested individuals can submit their applications to Hello.one and CoinMarketCap. Selected candidates will undergo multiple rounds of interviews in Hollywood. The show's filming is scheduled to commence in June, and it will be made available on major streaming platforms as well as Hello Labs' on-demand Hello TV service.</p>\n<p>CEO of Hello Labs, Sander Gortjes, stated, \"Our aim is to engage and educate the next billion users about Web3 by providing them with entertainment on various aspects of cryptocurrency,\" emphasising the intention to facilitate broader adoption.</p>\n<p>In recent months, a number of television shows related to Web3 have emerged, showcasing the diverse applications of blockchain technology and the growing interest in cryptocurrencies among mass media consumers. Co-creator of \"Rick and Morty,\"&nbsp;</p>\n<p>For more about DogeMiyagi:</p>\n<p>Website: https://dogemiyagi.com</p>\n<p>Twitter: https://twitter.com/_Dogemiyagi_</p>\n<p>Telegram: https://t.me/dogemiyagi</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T01:00:00.000Z",
    "title": "Take Advantage of Crypto Gambling With The Best P2E Project of 2023: Big Eyes Coin",
    "url": "https://cryptodaily.co.uk/2023/05/take-advantage-of-crypto-gambling-with-the-best-p2e-project-of-2023-big-eyes-coin",
    "description": "<p>Want to be the MVP of your own investment game and make all the right calls?</p>\n<p>&ldquo;Fun meets investment&rdquo; &mdash; that has been the core of meme coins for almost a decade now. As the fandom of these joke coins expands, the time has come to welcome projects that offer a blend of light-hearted investment adventure and adrenaline-pumping gaming experience!</p>\n<p>Enter Big Eyes Coin (BIG), the game-changer that propels your financial ambitions to triumphant heights! With a plethora of product offerings up its alley and exciting dates slated for launch, this rapidly ascending meme and play-to-earn (P2E) project embodies the grace and agility of a crafty striker. No doubt that its GameFi launch on August 29, 2023, will dazzle both seasoned players and newcomers alike, leaving them spellbound and craving for more! The story unfolds.</p>\n<p></p>\n<p>BIG Milestones</p>\n<p>The whistle is about to blow, and the stage is set ablaze with anticipation. Big Eyes Coin emerges as a fireball, casting a radiant glow upon the world of investments.&nbsp;</p>\n<p>June 3, 2023: Presale Wrap-Up</p>\n<p>After nine months of playing in the presale arena, Big Eyes Coin is finally ready to join the big leagues. But before the finale, BIG tries to entice its Kitty Cuddlers one last time, in the shape of Stage 3 Price Rollback!</p>\n<p>As a result of this price slashing, BIG has been rapidly accumulating million-dollar presale funds daily &mdash; currently at $43.7 million! The Stage 3 price comeback has also made way for the unrolling of the ever-shiny Stage 14. If this presses on, BIG would just need $7.8 million to hit its presale hard cap of $51.5 million at Stage 15!</p>\n<p>June 15, 2023: Big Eyes Coin Launching</p>\n<p>Exactly 12 days after the presale closing, BIG plans to officially launch on June 15, 2023.</p>\n<p>Here are some things you should enjoy once Big Eyes hits the big leagues:</p>\n<ul>\n<li>BIG token price at $0.0006;</li>\n<li>Fully-diluted market cap at around $96 million &mdash; since 80% of its 200-billion total supply is in circulation;</li>\n<li>Tier-1 CEX and DEX listing;</li>\n<li>Fee-free buy/tax transactions &mdash; except for gas fees; and</li>\n<li>Groundbreaking collaborations.</li>\n</ul>\n<p>It&rsquo;s Almost Here: Big Eyes Casino!</p>\n<p>On August 29, 2023, just over two months after its debut, BIG will unleash its groundbreaking move: the Big Eyes Casino and P2E Gaming Platform! This will offer 4,000+ cutting-edge games exclusively rewarding the Kitty Cuddlers with BIG tokens.</p>\n<p>This BIG move may seem like a straightforward one. But, it can actually be the catalyst of a more sustainable BIG, fostering a sprightly community, and thereafter strengthening the token's adoption and ecosystem. How?</p>\n<p>BIG&rsquo;s GameFi foray will attract gaming enthusiasts and investors seeking the best P2E projects. As a result, it will drive user demand for BIG, catapulting the token&rsquo;s trading volume and market capitalization to the moon! The best part? It will reduce the token supply available on exchanges.</p>\n<p></p>\n<p>Crypto Community: The Close-Knit Kitty Cuddlers&nbsp;</p>\n<p>Big Eyes Coin, a cat-inspired cryptocurrency on Ethereum, goes beyond wealth generation. It shines with generosity, supporting charitable causes worldwide, and donating $16,000 to different organizations worldwide.&nbsp;</p>\n<p>In the heart of BIG lies its dedicated team, always attentive to the cheers of the crowd. As such, BIG responded to its community's plea for an earlier kickoff before reaching its hard cap &mdash; so its Kitty Cuddlers could experience Big Eyes&rsquo; full grandeur.</p>\n<p>Tick Tock!</p>\n<p>The countdown for the most spectacular series of launches you&rsquo;ve ever seen has started! As the saying goes, &ldquo;Don&rsquo;t be a spectator, be a player.&rdquo; Hence, escape the sidelines and dive into the realm of savvy investors, where thrilling rewards await.</p>\n<p>Be An Early Adopter to Grab BIG Rewards Early On!</p>\n<p>Presale: https://buy.bigeyes.space/</p>\n<p>Website: https://bigeyes.space/&nbsp;</p>\n<p>Telegram: https://t.me/BIGEYESOFFICIAL</p>\n<p>Instagram: https://www.instagram.com/BigEyesCoin/&nbsp;</p>\n<p>Twitter: https://twitter.com/BigEyesCoin&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T01:02:35.000Z",
    "title": "Cerus Markets Announces 400:1 Leverage Update",
    "url": "https://www.crypto-news-flash.com/cerus-markets-announces-4001-leverage-update/?utm_source=rss&utm_medium=rss&utm_campaign=cerus-markets-announces-4001-leverage-update",
    "description": "<p>Labuan, Malaysia, May 26th, 2023, Chainwire Cerus Markets is thrilled to announce an exciting update to its leverage options for non-crypto instruments. Effective immediately, Cerus Markets clients can enjoy leverage of up to 400:1 for Forex, Commodities, Indices, and Single Stocks trading. This increase in leverage options allows traders to make the most of their [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cerus-markets-announces-4001-leverage-update/\">Cerus Markets Announces 400:1 Leverage Update</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]