[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T03:55:23.000Z",
    "title": "AMD Projects Strong Demand for AI Chips, Stock Dips in Response",
    "url": "https://www.cryptopolitan.com/amd-projects-strong-demand-ai-chips-stock/",
    "description": "In a pivotal update for the tech industry, chipmaker Advanced Micro Devices (AMD) unveiled forecasts indicating a surge in demand for its artificial intelligence (AI) processors. While the projections for first-quarter revenue fell short of Wall Street estimates, the outlook for AI chip sales remains promising. As businesses increasingly prioritize the development of generative AI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T03:41:01.000Z",
    "title": "Taiwan’s Mandarin LLM – A Shield Against Chinese AI Onslaught?",
    "url": "https://www.cryptopolitan.com/taiwans-mandarin-llm-shield-chinese-ai/",
    "description": "In response to the emergence of advanced Chinese language AI chatbots like ChatGPT and Baidu&#8217;s ERNIE Bot, Taiwan has launched its own defense mechanism in the form of a Mandarin LLM (Large Language Model). The development of Taiwan&#8217;s first Mandarin LLM, dubbed TAIDE, signals a strategic move to safeguard against potential cultural infiltration and security [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-31T04:00:57.000Z",
    "title": "Bitcoin ETFs Experience Day 12 Reversal, GBTC Selling Slows, Fidelity And Blackrock Garner $400 Million",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-etfs-experience-day-12-reversal-gbtc-selling-slows-fidelity-and-blackrock-garner-400-million/",
    "description": "Bitcoin has witnessed a positive turn of events as it reclaimed the $43,000 mark on Tuesday, thanks to a significant reduction in selling pressure from asset manager Grayscale. The reversal in Bitcoin ETFs during day 12 of trading has seen more inflows than outflows. Fidelity and Blackrock recorded a combined $400 million across their Bitcoin ETFs under the ticker names FBTC and IBIT, respectively.  Bitcoin ETFs Record Third-Largest Money Day According to market expert James Mullarney, Grayscale Bitcoin Trust (GBTC) has experienced a noticeable reduction in selling pressure, as reflected by the slowing down of GBTC selling.  Day 12 of trading showed a substantial inflow compared to outflow, marking the third-largest money day ever in net money flow, bringing in $256 million.  Related Reading: Bitcoin NFT Bubble Bursts: Values Plummet 60% After Holiday Frenzy Mullarney further states that adding new Bitcoin ETFs has contributed to a net positive of $1 billion in ETFs, with an estimated 25,000 Bitcoin added to the market. The new Bitcoin ETFs now hold a total of 150,000 BTC in aggregate. Miners Sell Most Coins Since May 2023 Despite these positive developments with Bitcoin ETFs, there is an ongoing increase in selling pressure from miners. A recent CryptoQuant report reveals that miners have sold the most coins since May 2023.  The flow of coins from miner wallets to spot exchanges reached its highest value since May 16, 2023, with over 4,000 Bitcoin amounting to approximately $173 million in selling pressure. Although miners have increased their selling activity, CryptoQuant asserts that the market has absorbed this pressure “calmly”. It is important to note that the reserves in mining portfolios have remained at the same level since the beginning of January.  CryptoQuant highlights that it is crucial to consider that these actions do not necessarily indicate a &#8220;dump&#8221; by miners. The firm concluded: It is true that there were several interactions with exchanges during this period, some quite significant, but this does not correspond to a &#8220;dump&#8221; on the part of these entities. Furthermore, it is necessary to be careful when reading messages like &#8220;miners are dumping coins&#8221;, this analyzes may not take into account the return of these coins to miners&#8217; wallets.  New All-Time High For Bitcoin After November? Renowned crypto analyst, CryptoCon, cautions against the belief that &#8220;this time is different&#8221; for Bitcoin, highlighting the recurring nature of its market cycles. With three completed cycles and a fourth underway, CryptoCon emphasizes that historical patterns, including the launch of Bitcoin ETFs, have consistently influenced Bitcoin&#8217;s price trajectory. CryptoCon emphasizes that Bitcoin&#8217;s price movements have followed distinct cycles, and he warns against the notion that each cycle will deviate significantly from the preceding ones.  Related Reading: Skybridge Capital CEO Reveals When Bitcoin Price Will Reach $170,000 Despite the anticipation surrounding the launch of ETFs, historical evidence suggests that they have coincided with local price highs rather than instant new all-time highs.  CryptoCon argues that the repeated occurrence of such patterns should serve as a reminder that &#8220;this time is different&#8221; often proves to be an illusory belief. According to CryptoCon&#8217;s analysis, a period of sideways movement is expected to commence soon after the completion of the ongoing correction, which saw BTC retrace to the $38,500 level on Tuesday, January 23.  This phase is predicted to last approximately four months, culminating in a second early price peak in June 2024, according to Crypto Con.  Following this, the analyst foresees the possibility of new all-time highs occurring after November 28th, 2024. However, it is crucial to note that the cycle&#8217;s peak will occur within approximately 21 days from this date, around November 28th, 2025. Featured image from Shutterstock, chart from TradingView.com"
  }
]