[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T20:27:23.000Z",
    "title": "Brazilian Central Bank Adds Crypto Exchange Mercado Bitcoin in CBDC Pilot Including Mastercard",
    "url": "https://www.coindesk.com/policy/2023/06/23/brazilian-central-bank-adds-crypto-exchange-mercado-bitcoin-in-cbdc-pilot-including-mastercard/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The approved consortium includes Mastercard, broker Genial, registrar Cerc and financial software fintech Sinqia as partners."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-23T20:35:21.000Z",
    "title": "Stable Diffusion Gets an Upgrade—Here’s How Its AI Model Stacks Up Against MidJourney",
    "url": "https://decrypt.co/145842/stable-diffusion-upgrade-ai-images-midjourney",
    "description": "Stable Diffusion XL v0.9 is out. And the results are impressive."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T20:20:00.000Z",
    "title": "Etherscan launches AI-powered Code Reader: Finance Redefined",
    "url": "https://cointelegraph.com/news/etherscan-launches-ai-powered-code-reader-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a35d85a4-b735-4a1e-b299-2bbd75c3a4e7.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The top 100 DeFi tokens broke out of a three-week-long bearish momentum amid a marketwide surge led by Bitcoin.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in DeFi was filled with artificial intelligence (AI)-centered developments on Etherscan, Polygon’s latest security update and on-chain sleuth ZachXBT’s ongoing lawsuit supported by multiple crypto personalities.</p><p>Etherscan launched an AI-powered code reader to retrieve and interpret the source code of specific contracts, while the Polygon co-founder proposed a zero-knowledge Ethereum Virtual Machine (zkEVM) upgrade to improve the protocol’s security.</p><p>Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng Zhao</a> rallied behind ZachXBT and donated to his lawsuit fund, which has now grown to over $1 million. The community-funded effort is to help the blockchain investigator fight a defamation case brought against him by Jeffrey Huang, better known on Twitter as MachiBigBrother.</p><p>The top 100 DeFi tokens broke out of a three-week-long bearish phase aided by a significant Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price surge over the past week, with most DeFi tokens trading in green, barring a few.</p><h2>Etherscan launches AI-powered Code Reader</h2><p>On June 19, Ethereum block explorer and analytics platform Etherscan launched a new tool dubbed “Code Reader” that utilizes <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> to retrieve and interpret the source code of a specific contract address. After a user inputs a prompt, Code Reader generates a response via OpenAI’s large language model, providing insight into the contract’s source code files.</p><p>Code Reader’s use cases include gaining deeper insight into contracts’ code via AI-generated explanations, obtaining comprehensive lists of smart contract functions related to Ethereum data, and understanding how the underlying contract interacts with decentralized applications. “Once the contract files are retrieved, you can choose a specific source code file to read through. Additionally, you may modify the source code directly inside the UI before sharing it with the AI.”</p><p><a href=\"https://cointelegraph.com/news/etherscan-launches-ai-powered-code-reader\"><strong>Continue reading</strong></a></p><h2>CZ, Powell and more rally to fund legal fees for on-chain sleuth ZachXBT, surpassing $1 million</h2><p>Blockchain investigator ZachXBT has received over $1 million in donations from the crypto community in just over 24 hours to pay for his legal fees in a defamation lawsuit.</p><p>ZachXBT, known for his investigative work in the blockchain and cryptocurrency industry, has become embroiled in a legal dispute with Jeffrey Huang, better known on Twitter as MachiBigBrother. On June 16, Huang tweeted that he had filed a defamation lawsuit against ZachXBT, accusing him of <a href=\"https://cointelegraph.com/news/zach-xbt-sued-libel-claimed-plaintiff-drained-funds-from-project\">damaging his reputation</a> through false allegations.</p><p><a href=\"https://cointelegraph.com/news/cz-powell-on-chain-sleuth-zach-xbt-legal-fees\"><strong>Continue reading</strong></a></p><h2>Polygon co-founder proposes zkEVM ‘validium’ upgrade to improve security</h2><p>Polygon co-founder Mihailo Bjelic has proposed upgrading the Polygon proof-of-stake network to a “zkEVM validium” version, according to a June 20 forum post. If the upgrade is implemented, the new version will rely on zero-knowledge proofs to increase security.</p><p>Polygon is an Ethereum scaling solution with over $900 million in total value locked in its contracts and over two million daily transactions. It was first launched in 2019. In March, the Polygon team found a second network, Polygon zkEVM, that uses zero-knowledge rollups to scale Ethereum.</p><p><a href=\"https://cointelegraph.com/news/polygon-co-founder-proposes-zkevm-validium-upgrade-to-improve-security\"><strong>Continue reading</strong></a></p><h2>Stablecoin protocol Reserve invests $20 million in Convex, Curve and Stake DAO</h2><p>Stablecoin protocol Reserve is investing $20 million into the governance tokens of yield farming apps Curve, Convex and Stake DAO, according to a June 20 announcement. The investment aims to increase the liquidity of the Reserve’s stablecoins, called RTokens. It will also increase Reserve’s voting power within these apps’ governance systems.</p><p>Reserve is a stablecoin protocol that allows users to create their coins backed by any asset they wish. Electronic USD (eUSD), High-Yield USD (hyUSD), Reserve (RSV), Reserve Dollar (RSD) and ETH+ are a few examples of stablecoins that have been created through Reserve.</p><p><a href=\"https://cointelegraph.com/news/stablecoin-protocol-reserve-invests-convex-curve-stake-dao\"><strong>Continue reading</strong></a></p><p><strong>DeFi market overview</strong></p><p>DeFi’s total market value saw a bullish surge after three weeks. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green. The total value locked in DeFi protocols remained below the $50 billion mark despite a surge of over $5 billion this past week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a4c1746c-d129-4479-b691-6dcaef28644c.png\"  /></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T20:18:56.000Z",
    "title": "Volatility Shares Trust aims for listing of leveraged Bitcoin futures ETF",
    "url": "https://cointelegraph.com/news/volatility-shares-trust-listing-leveraged-bitcoin-futures-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/99e171ee-efb4-4b0c-a34c-50bf7d600fe6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The debut of shares for the Bitcoin investment vehicle is potentially set for June 27, but the U.S. SEC has a pattern of denying many crypto-linked ETF applications.</p>\n                    <p><p>A company behind providing cryptocurrency-linked and other exchange-traded funds (ETFs) has filed with the United States Securities and Exchange Commission (SEC) for listing shares of a leveraged Bitcoin futures ETF.</p><p>Volatility Shares Trust <a href=\"https://www.sec.gov/Archives/edgar/data/1884021/000138713123007750/bitx_8a12b-062323.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> Form 8-A with the SEC on June 23, suggesting that the firm was preparing to launch an investment vehicle the regulator could consider a class of securities under its purview. The registration statement listed the Volatility Shares ‘2x Bitcoin Strategy ETF’, under the ticker symbol BITX, which offered leveraged exposure to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) corresponding to two times the daily performance of the S&amp;P CME Bitcoin Futures Daily Roll Index.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The 2x bitcoin ETF <a href=\"https://twitter.com/search?q=%24BITX&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BITX</a> has become effective, scheduled to launch Tuesday. I was doubtful it would happen but looks like it’s official. Could this be early sign of SEC lightening up? After <a href=\"https://twitter.com/search?q=%24BITO&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BITO</a> launch I believe they made earlier 2x filers withdraw <a href=\"https://t.co/XXxSt9xypu\">pic.twitter.com/XXxSt9xypu</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1672274997187051521?ref_src=twsrc%5Etfw\">June 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the time of publication, the SEC had not explicitly denied the Volatility Shares application for the crypto investment vehicle — a leveraged BTC futures ETF would be the first of its kind in the United States. Volatility Shares Trust’s website stated it planned to start trading on June 27, but added the registration statement “has not yet become effective.”</p><p>A separate SEC Form N-1A filing for listing shares of the leveraged Bitcoin futures ETF on the CBOE BZX Exchange stated that neither the SEC nor the U.S. Commodity Futures Trading Commission had “approved or disapproved these securities or passed upon the accuracy or adequacy of this prospectus.” The SEC has a <a href=\"https://cointelegraph.com/news/why-now-sec-took-eight-years-to-authorize-a-bitcoin-etf-in-the-us\">pattern of denying</a> many crypto-linked ETF applications.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\"><strong><em>BlackRock applies for spot Bitcoin ETF — a US first if approved</em></strong></a></p><p>While the U.S. financial regulator has not approved any spot crypto ETF, it began allowing ETFs linked to BTC futures starting in 2021, including those from Valkyrie and ProShares. In May and June, respectively, Valkyrie <a href=\"https://cointelegraph.com/news/valkyrie-leveraged-bitcoin-futures-etf-application\">applied with the SEC</a> for listing its own leveraged Bitcoin futures ETF as well as a spot BTC ETF.</p><p>The filing came amid the SEC being entrenched in lawsuits against crypto exchanges Binance and Coinbase for alleged unregistered securities offerings. Some U.S. lawmakers have <a href=\"https://cointelegraph.com/news/lawmakers-introduce-bill-to-remove-sec-chair-but-do-they-have-the-authority\">called for the removal</a> of SEC chair Gary Gensler and his perceived “regulation by enforcement” approach to crypto firms and others.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\"><strong><em>Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11-17</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T20:30:50.000Z",
    "title": "Macro Strategist David Hunter Predicts Global Markets’ ‘Melt Up’ Surge in Q4 2023, Followed by Impending ‘Bust’",
    "url": "https://news.bitcoin.com/macro-strategist-david-hunter-predicts-global-markets-melt-up-surge-in-q4-2023-followed-by-impending-bust/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Macro Strategist David Hunter Predicts Global Markets&#039; &#039;Melt Up&#039; Surge in Q4 2023, Followed by Impending ‘Bust’\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/wallstree.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />David Hunter, the chief macro strategist at Contrarian Macro Advisors, predicts an interesting development for global markets in the fourth quarter of 2023. According to him, global markets will experience a remarkable surge, aptly described as a &#8220;melt up.&#8221; However, this surge will be short-lived, as a substantial downturn is expected to follow. Hunter emphasizes [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-23T20:17:05.000Z",
    "title": "TMS Network (TMSN) Maintains Anchor as Aave (AAVE) and Cardano (ADA) Destroyed in Markets",
    "url": "https://nulltx.com/tms-network-tmsn-maintains-anchor-as-aave-aave-and-cardano-ada-destroyed-in-markets/",
    "description": "In the current volatile market, where cryptocurrencies faced significant turbulence, TMS Network (TMSN) stood firm as a beacon of stability. While heavyweights like Aave (AAVE) and Cardano (ADA) suffered substantial losses, TMS Network (TMSN) maintained its anchor, providing investors with a much-needed respite. Explore the unfolding story of these contrasting fortunes and the factors that [&#8230;]"
  }
]