[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T19:55:02.000Z",
    "title": "Crypto Lobbyists Ask SEC for Info on Prometheum, The Mysterious 'Regulated' Crypto Firm",
    "url": "https://www.coindesk.com/business/2023/06/15/crypto-lobbyists-ask-sec-for-info-on-prometheum-the-mysterious-regulated-crypto-firm/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The “regulated crypto exchange” backed Gary Gensler’s viewpoint in front of Congress. But are they for real?"
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-15T19:42:23.000Z",
    "title": "Mick Mulvaney-Linked Astra Protocol Faces Investor Backlash Over ‘Severely Deficient Communication’",
    "url": "https://www.coindesk.com/business/2023/06/15/mick-mulvaney-linked-astra-protocol-faces-investor-backlash-over-severely-deficient-communication/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Astra Protocol, provider of Web3 compliance solutions, previously had a dispute with investor Republic Crypto over an alleged token sale."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T20:04:45.000Z",
    "title": "Do Kwon’s detention extended six months by Montenegrin court",
    "url": "https://cryptoslate.com/do-kwons-detention-extended-six-months-by-montenegrin-court/",
    "description": "<p>A Montenegro court has extended Do Kwon&#8217;s detention by six months as he awaits trial for potential extradition, Agence France Presse reported Thursday. The former Terraform Labs CEO has been in custody in Montenegro since late March following his arrest at Podgorica Airport in the nation&#8217;s capital for allegedly carrying forged travel documents. He faces [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/do-kwons-detention-extended-six-months-by-montenegrin-court/\">Do Kwon&#8217;s detention extended six months by Montenegrin court</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T19:46:07.000Z",
    "title": "Prosecutors withdraw 5 charges against Sam Bankman-Fried to ensure trial proceeds on schedule",
    "url": "https://cryptoslate.com/prosecutors-withdraw-5-charges-against-sam-bankman-fried-to-ensure-trial-proceeds-on-schedule/",
    "description": "<p>Disgraced FTX founder Sam Bankman-Fried&#8217;s attempt to strike some of the accusations from his charge sheet may have backfired after prosecutors requested the court &#8220;sever&#8221; five of the newer charges from the case. New York federal prosecutors made the request in a letter addressed to presiding Judge Lewis Kaplan filed on June 15. The withdrawn [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/prosecutors-withdraw-5-charges-against-sam-bankman-fried-to-ensure-trial-proceeds-on-schedule/\">Prosecutors withdraw 5 charges against Sam Bankman-Fried to ensure trial proceeds on schedule</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-15T19:58:24.000Z",
    "title": "BLK DNM Introduces Intelligence Into Clothing With Blockchain, in First Use of ‘Connected Fashion’",
    "url": "https://www.cryptoglobe.com/latest/2023/06/blk-dnm-introduces-intelligence-into-clothing-with-blockchain-in-first-use-of-connected-fashion/",
    "description": "Stockholm, Sweden, June 15th, 2023, Chainwire BLK DNM bridging the Physical and Virtual Worlds of Fashion through Blockchain Innovation Swedish-American fashion brand BLK DNM today unveiled the first-ever example of connected fashion (garments that exist both physically and virtually, each aspect ‘twinned’ via technology) with the launch of BLK DNM Society and integration of blockchain-powered hardware and software into […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T20:00:24.000Z",
    "title": "Hong Kong Government asks Banks to Embrace Crypto Clients",
    "url": "https://cryptodaily.co.uk/2023/06/hong-kong-government-asks-banks-to-embrace-crypto-clients",
    "description": "<p>The Hong Kong government has proactively advocated for major banks to embrace clients engaged in digital currencies.&nbsp;</p>\n<p>Traditional financial institutions such as HSBC and Standard Chartered are finding themselves confronted with mounting pressure to adapt to Hong Kong&rsquo;s desire to become a hub for crypto.&nbsp;</p>\n<p>According to an article on CoinTelegraph, both UK- based banks as well as the Bank of China, were pressured by the Hong Kong Monetary Authority (HKMA) in a May meeting to start accepting crypto companies such as exchanges, as clients.</p>\nEmbracing the Crypto Community\n<p>The Hong Kong government's initiative to encourage major banks to accommodate cryptocurrency clients marks a noteworthy milestone in the convergence of traditional finance and digital assets.&nbsp;</p>\n<p>Recognising the demand for crypto-related services, the government appears to be looking to allow crypto-related companies to do their thing and continue to come up with innovations that can disrupt the existing financial system.&nbsp;</p>\nNavigating Regulatory Challenges\n<p>While the acceptance of cryptocurrencies presents exciting possibilities, it also poses regulatory challenges for traditional banks. Striking a delicate balance between fostering innovation and ensuring compliance with existing regulations is a key consideration.&nbsp;</p>\n<p>The Hong Kong government's push for banks to embrace crypto clients is accompanied by a call for enhanced risk management and regulatory frameworks. This comprehensive approach aims to establish a secure and transparent environment that protects both banks and their cryptocurrency clients from potential risks.</p>\nEmbracing the Potential of Blockchain\n<p>The Hong Kong government's push for banks to embrace crypto clients says much for China&rsquo;s rethinking of the crypto digital asset economy. It also signifies a deeper recognition of the transformative capabilities that blockchain technology holds.&nbsp;</p>\nCatalysing Global Innovation\n<p>Hong Kong's proactive approach to embracing crypto and its encouragement of banks to accommodate crypto clients sends a resounding message to the global financial industry. By positioning itself as a progressive and innovative hub, Hong Kong aims to attract international businesses and investors who see the potential in crypto and blockchain technology.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T20:03:51.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T19:47:07.000Z",
    "title": "Why is the crypto market down today? June 2023 industry failure",
    "url": "https://www.cryptopolitan.com/why-is-the-crypto-market-down-today-2/",
    "description": "With the SEC breathing fire down on the DeFi industry, the crypto market has hit hard snugs on all fronts. According to data from Kaiko, crypto trading volumes reached an annual low in the second quarter as market makers reduced their activity. Furthermore, major cryptocurrencies were under further pressure Thursday as the industry faced new ... <a title=\"Why is the crypto market down today? June 2023 industry failure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-crypto-market-down-today-2/\" aria-label=\"More on Why is the crypto market down today? June 2023 industry failure\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T19:40:24.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-15T20:00:17.000Z",
    "title": "Token Burning Has Never Been This Innovative, DigiToads Will Burn 2% Of All TOADS Transactions",
    "url": "https://nulltx.com/token-burning-has-never-been-this-innovative-digitoads-will-burn-2-of-all-toads-transactions/",
    "description": "As the crypto market keeps developing, newer projects in the market start shining through the clouds. DigiToads is one of the newest presales in this volatile industry and has taken the market by storm with an innovative offering. Read on to find out what DigiToads is, how it can benefit you, and why investors are [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T20:00:26.000Z",
    "title": "Bitcoin Holders Show No Panic Loss Selling, What Does It Mean?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-holders-show-no-panic-loss-selling-what-does-it-mean/",
    "description": "On-chain data shows that Bitcoin investors aren&#8217;t participating in any significant amounts of loss selling right now. Here&#8217;s what it may mean. Bitcoin Entity-Adjusted Realized Loss Has Remained Low Recently According to data from the on-chain analytics firm Glassnode, coins transacted recently were mostly acquired close to the current spot price. The relevant indicator here is the &#8220;entity-adjusted realized loss,&#8221; which measures the total loss investors realize through their current selling. This metric works by going through the on-chain history of each being sold to see what price it was bought at. If this previous price for any coin was more than the current spot price (that it&#8217;s now being moved at), then the coin&#8217;s sale is leading to the realization of a loss. Naturally, the coin would be moving at a profit in the opposite case. The indicator has &#8220;entity-adjusted&#8221; because it only counts transactions/sales between different entities rather than individual wallets. An entity here refers to a single or a group of addresses controlled by the same investor, as determined by Glassnode&#8217;s analysis. As transfers between the addresses of the same investor wouldn&#8217;t count as selling, it makes sense to filter such transfers out of the data for the realized loss. Related Reading: Bitcoin Sentiment On Social Media Now Most Red Since COVID Crash, Bottom Signal? Now, here is a chart that shows the trend in the Bitcoin entity-adjusted realized loss over the last few years: The value of the metric seems to have been moving sideways in recent days &#124; Source: Glassnode on Twitter As the above graph shows, the Bitcoin entity-adjusted realized loss has been at relatively low values for a few months. The rally in the cryptocurrency&#8217;s price has taken place during this period, so it would make sense that investors wouldn&#8217;t have any need to sell at a loss while the surge has gone on. Related Reading: Here’s Why The Tether FUD Could Be Good For Bitcoin However, recently, things have been different. BTC has been going down during the past few weeks, but there has still not been any change in the indicator&#8217;s value. This is unlike what&#8217;s generally observed during drawdowns in the asset. Even earlier in the current year, when the rally had temporarily taken a hiatus in March and the cryptocurrency&#8217;s value had seen a deep plunge, there was an uplift in the realized loss, although not anything too significant. The recent low values are also despite the FUD that has spread around the sector following the SEC charges against Binance and Coinbase. In the past day, the market has again stumbled as the Fed has revealed its decision to pause interest rate hikes for now but has also communicated that more increases would be coming later in the year. Despite this fresh hit that the Bitcoin price has taken, the realized loss has still not registered any uptick, as its value is still just $91.3 million, significantly less than in past capitulation events. The fact that investors haven&#8217;t started selling at a loss would imply that there is still not enough panic in the market yet; investors holding at a loss are content to ride the current market phaseout. BTC Price At the time of writing, Bitcoin is trading around $25,000, down 5% in the last week. Looks like BTC has observed a sharp drop today &#124; Source: BTCUSD on TradingView Featured image from Thought Catalog on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T20:00:25.000Z",
    "title": "Institutional Giants BlackRock and Fidelity Show Confidence: Record-Breaking Bitcoin Accumulation Amid Market Turmoil",
    "url": "https://www.crypto-news-flash.com/institutional-giants-blackrock-and-fidelity-show-confidence-record-breaking-bitcoin-accumulation-amid-market-turmoil/?utm_source=rss&utm_medium=rss&utm_campaign=institutional-giants-blackrock-and-fidelity-show-confidence-record-breaking-bitcoin-accumulation-amid-market-turmoil",
    "description": "BlackRock and Fidelity, two prominent institutions, are displaying aggressive bullishness towards Bitcoin (BTC) despite the current market downturn. These institutions are increasing their exposure to Bitcoin indirectly by purchasing stocks of MicroStrategy (MSTR), the largest corporate holder of Bitcoin. As market sentiments sour due to mounting fears surrounding regulatory attacks from the U.S. Securities and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T20:00:03.000Z",
    "title": "Ripple CEO Brad Garlinghouse Slams SEC Following Hinman Email Reveal, Says Regulator Acting in Bad Faith",
    "url": "https://dailyhodl.com/2023/06/15/ripple-ceo-brad-garlinghouse-slams-sec-following-hinman-email-reveal-says-regulator-acting-in-bad-faith/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/judge-ripple-grants-amicus.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple chief executive Brad Garlinghouse slammed the U.S. Securities and Exchange Commission (SEC) this week following the public release of long-awaited documents in the company&#8217;s ongoing legal battle with the regulator. The documents involve internal SEC deliberations regarding a speech delivered by former SEC official William Hinman in 2018 when he stated in his official capacity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/ripple-ceo-brad-garlinghouse-slams-sec-following-hinman-email-reveal-says-regulator-acting-in-bad-faith/\">Ripple CEO Brad Garlinghouse Slams SEC Following Hinman Email Reveal, Says Regulator Acting in Bad Faith</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T19:55:35.000Z",
    "title": "Crypto Analyst Claims Bitcoin (BTC) Lows Are ‘Getting Swept’, Warns of Possible Lower Cascade",
    "url": "https://dailyhodl.com/2023/06/15/crypto-analyst-claims-bitcoin-btc-lows-are-getting-swept-warns-of-possible-lower-cascade/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-trading-below-30.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning Bitcoin (BTC) traders that the king crypto may crash further before rebounding. Yesterday, crypto trader Michaël van de Poppe told his 657,400 Twitter followers that BTC&#8217;s lows were &#8220;getting swept&#8221; as they fell toward the $25,000 area. &#8220;There we go on Bitcoin. The lows are getting swept. Heavily interested to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/crypto-analyst-claims-bitcoin-btc-lows-are-getting-swept-warns-of-possible-lower-cascade/\">Crypto Analyst Claims Bitcoin (BTC) Lows Are ‘Getting Swept’, Warns of Possible Lower Cascade</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]