[
  {
    "source": "Decrypt",
    "date": "2023-10-25T16:58:37.000Z",
    "title": "FTX Selling the Pump? Estate Moves $8.6M Ethereum, Chainlink, Aave and Maker to Binance",
    "url": "https://decrypt.co/203262/ftx-moves-8-6-million-ethereum-chainlink-aave-maker-to-binance",
    "description": "The funds are on the move again—this time to the collapsed exchange’s rival "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T17:00:00.000Z",
    "title": "Revolutionizing whitelist marketplace for Web3: WhiteList Zone partners with Cointelegraph Accelerator",
    "url": "http://cointelegraph.com/news/revolutionizing-whitelist-marketplace-for-web3-whitelist-zone-partners-with-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/20db633673b84bd6538513f10ca5cd95.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The whitelist marketplace WhiteList Zone onboarded over 50 projects that collectively submitted more than 8,000 whitelists.</p>\n                    <p><p>In the Web3 space, one of the key challenges for new projects and products is to get a motivated audience and for crypto-enthusiasts and investors — to find the most promising projects and get in earlier than others. This is where whitelists step in, addressing several critical aspects.</p><p>A whitelist is a curated list of addresses or users with authorized access to specific privileges. It grants entry to activities like presales, token sales, <a href=\"https://cointelegraph.com/learn/initial-coin-offering\">initial coin offerings (ICOs)</a>, <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> minting, or access to various events. It works as an exclusive guest list, allowing only approved participants to join the party while keeping others out.</p><h2>Why whitelists are important</h2><p>For crypto-enthusiasts and investors, whitelists represent an <a href=\"https://cointelegraph.com/news/what-is-an-nft-whitelist-and-how-can-you-join-one\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-is-an-nft-whitelist-and-how-can-you-join-one/amp\">early-access opportunity</a> to secure a position ahead of the crowd, enabling them to purchase assets or participate in events before the general public. Being on a whitelist often grants lower entry prices, additional token allocations or lower gas fees, enhancing the investment potential. A prominent example is the <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2022/bayc\">Bored Ape Yacht Club</a> participants who received free NFTs that later had a market value significantly higher than their original price.</p><p>For projects, whitelists serve as a strategic tool to onboard the most motivated users, encouraging them to engage in activities like social media promotion and friend referrals to earn a coveted spot on the whitelist.</p><p>Moreover, whitelists ensure a fair and equitable distribution of tokens or resources, reducing the risk of concentrated ownership. They also serve as a regulatory safeguard by implementing <a href=\"https://cointelegraph.com/learn/what-is-kyc-and-why-do-crypto-exchanges-require-it\">Know Your Customer (KYC)</a> procedures, which verify participants' identities. In essence, whitelists act as a robust security measure, shielding projects from potential scams or malicious actors by thoroughly vetting participants in advance, ensuring that only legitimate individuals or entities can participate in their events or projects.</p><h2>Challenge to get whitelisted</h2><p>However, getting on the whitelist is a complex and risky endeavor. Users often need to register their wallets on the project's website as part of the onboarding process and compete with thousands of other crypto-enthusiasts for a small amount of available spots. Additionally, they must demonstrate their eligibility by completing various laborious tasks, including generating user-generated content, social media support (likes, shares, subscriptions), securing referrals, and undertaking actions that enhance the project's brand awareness.</p><p>For those unable to secure a whitelist spot legitimately, a black and gray market offers an alternative, but it’s often fraught with risks. Transactions in this realm take place in less regulated and secure environments, such as <a href=\"https://cointelegraph.com/magazine/explained-what-really-crypto-otc-desk/\">over-the-counter (OTC)</a> groups on Telegram or Discord, leaving participants vulnerable to fraudulent schemes and malicious actors who can take advantage of their trust and desire for whitelist access.</p><h2>A safe option for getting whitelisted</h2><p>In response to these challenges, a groundbreaking solution has emerged — <a href=\"https://wzone.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">WhiteList Zone</a>. Launched in <a href=\"https://medium.com/@WhiteListZone_Official/whitelist-zone-launches-alpha-program-with-500-000-in-total-prizes-1001c278ee36\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">alpha in June 2023</a>, WhiteList Zone has quickly established itself as a marketplace where crypto enthusiasts can directly purchase whitelists from launchpads, project owners and whitelist winners. These whitelists serve as golden tickets, granting investors the right to participate in <a href=\"https://cointelegraph.com/learn/initial-dex-offering-ido\">initial decentralized offerings (IDOs)</a>, NFT mintings and other events hosted by crypto projects.</p><p>Investors can say goodbye to the gray markets and uncertain terrain of Telegram and Discord channels, as WhiteList Zone now provides safe and easy access to whitelists. To buy whitelist spots, investors simply need to visit the marketplace, browse the list of available projects, select their preferred one and complete the transaction in less than a minute.</p><p><img alt=\"Users can discover new projects based on category, network, or sale type. Source: WhiteList Zone\" src=\"https://s3.cointelegraph.com/storage/uploads/view/617ddf4c68af99748ef4550888b42ad0.png\" title=\"Users can discover new projects based on category, network, or sale type. Source: WhiteList Zone\"></p><p style=\"text-align: center;\"><em>Users can discover new projects based on category, network, or sale type. Source: <a href=\"https://app.wzone.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">WhiteList Zone</a></em></p><p>WhiteList Zone believes in direct collaboration with launchpads and projects to ensure that scams and fraud are a thing of the past. By establishing these partnerships, the platform creates a reliable ecosystem right from the start. This means that when users access whitelist opportunities on WhiteList Zone, they can trust that they are engaging in legitimate transactions.</p><p>What’s more, WhiteList Zone offers an easy-to-use interface and a simple onboarding experience and continues to expand its support, currently accommodating over 140 cryptocurrencies, with plans to introduce convenient credit card payment options soon.</p><h2>Focus on user’s engagement</h2><p>When it comes to projects looking to issue whitelists, WhiteList Zone also emerges as the top choice, as the marketplace boosts engagement among whitelist winners. This proactive and engaged community is a valuable asset for projects seeking active participation and support. Moreover, the platform generates valuable data that empowers projects to make informed decisions. This data-driven approach aids in strategizing and optimizing whitelist distribution, resulting in more effective outcomes.</p><p>WhiteList Zone recently became the latest participant of the <a href=\"https://cointelegraph.com/accelerate/\">Cointelegraph Accelerator</a> program. The Accelerator has picked WhiteList Zone due to the latter’s potential to disrupt the whitelist market. With a team of 15 people, the Ukraine-based project has shown good traction since launching the alpha version in June 2023. The marketplace has successfully attracted users from 71 countries and onboarded over 50 projects that have collectively contributed more than 8,000 whitelists. Furthermore, WhiteList Zone has plans to launch its token generation event in the first quarter of 2024.</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T16:40:20.000Z",
    "title": "Polygon launches POL token contract on Ethereum to eventually replace MATIC",
    "url": "http://cointelegraph.com/news/polygon-launches-pol-token-contract-ethereum-eventually-replace-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/c8d353a5-fb44-4512-a2f9-78d87814b012.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The team migrated the POL token contract to the Ethereum network, paving the way for it to replace MATIC in the future.</p>\n                    <p><p>Polygon Labs has <a href=\"https://polygon.technology/blog/polygon-2-0-milestone-pol-contracts-are-live-on-ethereum-mainnet\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> the Ethereum contract for the new Polygon token, POL, according to an October 25 announcement. The new token is intended to replace the ecosystem’s current token, MATIC. However, the team said users presently don't need to exchange their MATIC for POL.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The POL token upgrade is now live on Ethereum mainnet.<br><br>Polygon 2.0, released this summer, is a roadmap for scaling Ethereum to build the Value Layer of the Internet. POL unlocks that future.<br><br>POL is a next-generation token that can power a vast ecosystem of ZK-based L2 chains.… <a href=\"https://t.co/gmrsu0ZqLz\">pic.twitter.com/gmrsu0ZqLz</a></p>&mdash; Polygon (Labs) (@0xPolygonLabs) <a href=\"https://twitter.com/0xPolygonLabs/status/1717134336104038580?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to blockchain data, the new token was <a href=\"https://etherscan.io/tx/0x2a88c595a815c6aac8bf6734ee12d939c7d0dce8965771330b72f2ebc3d673bd\" target=\"_blank\" rel=\"noopener nofollow\">created</a> on October 25 at 09:06 a.m. UTC. Its full name is the “Polygon Ecosystem Token.” In the announcement, the Polygon team claimed that POL would “power a vast ecosystem of zero knowledge-based Layer 2 chains” by implementing a 're-staking protocol' that allows token holders to stake it on multiple chains, performing multiple functions in the process.</p><p>The token’s launch will now pave the way for other aspects of the Polygon 2.0 roadmap to be implemented, including the launch of a new staking layer for the Polygon ecosystem, upgrading the current Proof of Stake (PoS) network to zkEVM layer-2, and creating a shared liquidity protocol for all Polygon networks, the post stated.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/zk-focused-manta-pacific-opts-out-op-stack-for-polygon-cdk\"><strong>ZK-focused Manta Pacific opts out of OP Stack for Polygon CDK</strong></a></em></p><p>The team emphasized that POL is not currently being used for any systems in the Polygon network. Staking on both Polygon PoS and Polygon zkEVM is still being performed via the old token, MATIC, and gas fees on the PoS network are still being paid for with MATIC. So, users, validators, and app developers do not need to exchange their MATIC for POL at present.</p><p>Polygon Labs first announced it was <a href=\"https://cointelegraph.com/news/polygon-proposes-architecture-for-polygon-2-0-including-aggregator-bridge\">developing a new layer-2 ecosystem</a> on June 29. It called the new ecosystem “Polygon 2.0.” On September 14, the team announced that Polygon 2.0 <a href=\"https://cointelegraph.com/news/polygon-2-matic-conversion-to-pol-proposal\">would use a new token, POL</a>. But at the time, the token was just a proposal and had not been deployed to Ethereum.</p><p>Polygon’s proposed layer-2 ecosystem will use zero-knowledge proofs to validate transactions between networks. It will face competition from the Optimism ecosystem proposed by Optimism Labs, which <a href=\"https://cointelegraph.com/news/optimism-successfully-completes-bedrock-hard-fork-reducing-deposit-times-layer-1-fees\">will use optimistic rollup technology</a> to secure messages between networks.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-25T17:00:33.000Z",
    "title": "Bitcoin is soaring, and short-term holders are here for the ride",
    "url": "https://cryptoslate.com/bitcoin-is-soaring-and-short-term-holders-are-here-for-the-ride/",
    "description": "<p>Bitcoin (BTC) witnessed a notable price surge in the past week, climbing well above the previously coveted $30,000 mark. The sharp increase affected all market participants, especially the short-term holders. These are entities or individuals who&#8217;ve held onto their Bitcoin for less than 155 days. Their behavior, particularly during market rallies, offers valuable insights into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-is-soaring-and-short-term-holders-are-here-for-the-ride/\">Bitcoin is soaring, and short-term holders are here for the ride</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-25T16:44:07.000Z",
    "title": "Top 30 Crypto Projects Shining Bright in 2023",
    "url": "https://cryptodaily.co.uk/2023/10/top-30-crypto-projects-shining-bright-in-2023",
    "description": "Discover the top 30 cryptocurrency projects that have been shining in 2023. Explore the latest trends, innovations, and game-changers in the crypto space."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T17:05:30.000Z",
    "title": "Why Caroline Ellison, FTX’s Gary Wang, and Nishad Singh may avoid jail time – SBF has it rough",
    "url": "https://www.cryptopolitan.com/caroline-ftxs-wang-and-nishad-may-avoid-jail/",
    "description": "Recent proceedings of the Sam Bankman-Fried, FTX’s ex-CEO court case have kept its witnesses under the spotlight as the trial continues. This has included FTX co-founder and Chief Technology Officer Gary Wang, CEO of Alameda Research Caroline Elisson, and FTX head of engineering Nishad Signh.&#160; All these witnesses have pleaded guilty to charges a month ... <a title=\"Why Caroline Ellison, FTX&#8217;s Gary Wang, and Nishad Singh may avoid jail time &#8211; SBF has it rough\" class=\"read-more\" href=\"https://www.cryptopolitan.com/caroline-ftxs-wang-and-nishad-may-avoid-jail/\" aria-label=\"More on Why Caroline Ellison, FTX&#8217;s Gary Wang, and Nishad Singh may avoid jail time &#8211; SBF has it rough\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T17:01:41.000Z",
    "title": "Hashdex engages in dialog with SEC over Bitcoin DeFi ETF filing",
    "url": "https://crypto.news/hashdex-engages-in-dialog-with-sec-over-bitcoin-defi-etf-filing/",
    "description": "According to an Oct. 24 memorandum, digital asset management firm Hashdex has had a discussion with the SEC about their ETF filing that would purchase physical Bitcoin."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T16:40:30.000Z",
    "title": "Vitalik Buterin participates in $6 million funding round for Nocturne ",
    "url": "https://crypto.news/vitalik-buterin-participates-in-6-million-funding-round-for-nocturne/",
    "description": "As per an Oct. 25 post on X, Nocturne, a protocol enabling private, composable accounts on Ethereum, announced Bain Capital Crypto and Polychain would be leading their multi-million seed round. The round will be co-led by Bain Capital Crypto and&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T17:00:05.000Z",
    "title": "Bitcoin ETF Will Send BTC Back To $44,000, Why This Trading Firm Is Betting On This Scenario",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-etf-will-send-btc-back-to-44000-why-this-trading-firm-is-betting-on-this-scenario/",
    "description": "The price of BTC continues to push higher, and the bullish momentum remains intact as news around the Bitcoin ETF (Exchange Traded Fund) improves overall sentiment. In the wake of the recent rally, some trading firms doubled down on their bullish positions. Related Reading: Galaxy Foresees Stellar 74% Bitcoin Price Surge In Post-ETF Debut Year As of this writing, the price of Bitcoin stands at $24,200 with sideways movement in the last 24 hours. The cryptocurrency rose by over 20% the previous week, operating as the top performer in the top 10 by market capitalization. Bitcoin ETF To Trigger Larger Rally: What’s The Target? Via social media platform X, trading desk QCP Capital disclosed their positions coming into the rally. The firm longed Bitcoin volatility with options contracts, taking some profits on their positions as the cryptocurrency rallied. Still, the firm remains optimistic, holding on to their calls due to expiry in December. By then, the firm targets a BTC price above $38,000 to $44,000, based on the momentum generated by a potential Bitcoin ETF approval. In the last week, the news generated by this event has shifted market sentiment, leading investors to a more favorable area. However, the firm remains cautious about the US Securities and Exchange Commission (SEC) approving a spot Bitcoin ETF in the short term. QCP Capital stated: (…) we believe the SEC will avoid playing the role of kingmaker, sticking with its own precedent set during the BTC/ETH futures ETF approval process and will wait to approve multiple managers at the same time. Nonetheless with this bullish break of 32k, we believe the market has started to price in an approval as the base case. The only question now is when the approval will happen. SEC To Avoid Kingmaking In Bitcoin ETF Approval. The trading firm believes the financial instrument will get approved in 2024. The SEC will likely avoid favoring one firm to prevent BlackRock or other asset managers from taking a large portion of the clients and the trading volume, as when the future Bitcoin ETF was approved. The firm believes the financial instrument could get approved “much later than the market expects now.” As mentioned, investors have begun pricing in any price action associated with the ETF, which could lead BTC to another range until 2024. Related Reading: Bitcoin’s Surge Shakes Up ETF World: Who’s Soaring And Who’s Crashing? The firm cautioned players from taking late long positions: (…) we are seeing stretched positive perp funding rates especially on Deribit (BTC over 70% and ETH over 100%) as well as elevated short-end ATM vols (BTC up to 75%!) – typically indicative of an exhausted short-term move. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T17:05:55.000Z",
    "title": "SEC vs Ripple: Showdown Set as Judge Orders Briefing Schedule Deadline",
    "url": "https://www.crypto-news-flash.com/sec-vs-ripple-showdown-set-as-judge-orders-briefing-schedule-deadline/?utm_source=rss&utm_medium=rss&utm_campaign=sec-vs-ripple-showdown-set-as-judge-orders-briefing-schedule-deadline",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-7-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-7-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-7-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-7-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-7-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The legal battle between the SEC and Ripple continues, with Judge Analisa Torres setting a November 9, 2023 deadline for both parties to propose a briefing schedule regarding potential remedies in the case. While the case against Ripple&#8217;s executives has been resolved, the litigation concerning Ripple&#8217;s involvement in the institutional sale of XRP remains active. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T16:54:38.000Z",
    "title": "Chainlink (LINK) Price Surges 10% in Partnership with Billion-Dollar Giant Vodafone",
    "url": "https://www.crypto-news-flash.com/chainlink-link-price-surges-10-in-partnership-with-billion-dollar-giant-vodafone/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-price-surges-10-in-partnership-with-billion-dollar-giant-vodafone",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Vodafone DAB and Chainlink unite to upgrade global trade with secure document transfers and IoT integration. This partnership aims to solve trade document exchange challenges and boost the $32 trillion trade industry. In a significant development for the global trade ecosystem, Vodafone Digital Asset Broker (DAB) has partnered with the Chainlink network, marking a pivotal [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T16:46:05.000Z",
    "title": "Bitget Announces to be One of the First Exchanges to List Tottenham Hotspur Fan Token (SPURS)",
    "url": "https://www.crypto-news-flash.com/bitget-announces-to-be-one-of-the-first-exchanges-to-list-tottenham-hotspur-fan-token-spurs/?utm_source=rss&utm_medium=rss&utm_campaign=bitget-announces-to-be-one-of-the-first-exchanges-to-list-tottenham-hotspur-fan-token-spurs",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/20231025-220943_16982438283xmCPcNPEc.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/20231025-220943_16982438283xmCPcNPEc.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/20231025-220943_16982438283xmCPcNPEc-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/20231025-220943_16982438283xmCPcNPEc-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/20231025-220943_16982438283xmCPcNPEc-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />victoria, Seychelles, October 25th, 2023, Chainwire Bitget, a leading cryptocurrency exchange and copy trading platform, is thrilled to announce the platform is one of the first centralized exchanges to list the Tottenham Hotspur Fan Token (SPURS) in the Innovation Zone and Fan Token Zone. The SPURS token is the official fan token of Tottenham Hotspur football club &#8211; England-based [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-25T16:58:00.000Z",
    "title": "Mastercard to Partner With Self-Custody Wallet Firms",
    "url": "https://coinedition.com/mastercard-to-partner-with-self-custody-wallet-firms/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Payment Platform Island Pay Launches USDC Wallet in Latin America\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Payment-Platform-Island-Pay-Launches-USDC-Wallet-in-Latin-America-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Mastercard, the world’s leading payment processor, plans to collaborate with MetaMask, Ledger, and other custody wallet firms to deliver a robust payment system, reports suggest. The payments giant reportedly revealed this plan in a Web3 strategy workshop report, where it pointed out that having a payment card would benefit wallet providers. According to Mastercard, payment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mastercard-to-partner-with-self-custody-wallet-firms/\">Mastercard to Partner With Self-Custody Wallet Firms</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T16:55:29.000Z",
    "title": "BlackRock Seeding Spot-Based Bitcoin ETF As Financial Giant Gears Up To Launch BTC Trust: Bloomberg Analyst",
    "url": "https://dailyhodl.com/2023/10/25/blackrock-seeding-spot-based-bitcoin-etf-as-financial-giant-gears-up-to-launch-btc-trust-bloomberg-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/seeding-spot-etf-gears.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Bloomberg analyst is reporting that BlackRock is &#8220;seeding&#8221; its spot Bitcoin (BTC) exchange-traded fund (ETF). Bloomberg senior ETF analyst Eric Balchunas notes that BlackRock announced the seeding in a recent amendment to their spot BTC ETF filing with the U.S. Securities and Exchange Commission (SEC). Their application, which is called the iShares Bitcoin Trust, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/blackrock-seeding-spot-based-bitcoin-etf-as-financial-giant-gears-up-to-launch-btc-trust-bloomberg-analyst/\">BlackRock Seeding Spot-Based Bitcoin ETF As Financial Giant Gears Up To Launch BTC Trust: Bloomberg Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T16:44:28.000Z",
    "title": "Aloha Browser Announces Bitcoin Integration for Aloha Crypto Wallet",
    "url": "https://dailyhodl.com/2023/10/25/aloha-browser-announces-bitcoin-integration-for-aloha-crypto-wallet/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-Aloha-Browser-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>October 25, 2023 – Limassol, Cyprus Aloha Browser has announced a key integration update to its Aloha Crypto Wallet, adding in Bitcoin support. This update aligns perfectly with Aloha&#8217;s objective of making cryptocurrency management as straightforward as ABC. It aims to simplify the process of trading, swapping and exchanging popular cryptocurrencies, and the integration of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/aloha-browser-announces-bitcoin-integration-for-aloha-crypto-wallet/\">Aloha Browser Announces Bitcoin Integration for Aloha Crypto Wallet</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]