[
  {
    "source": "Decrypt",
    "date": "2024-01-08T10:01:02.000Z",
    "title": "Transformed, Not Terminated: AI Researchers Weigh In on the Future",
    "url": "https://decrypt.co/211923/transformed-not-terminated-ai-researchers-weigh-in-on-the-future",
    "description": "A large-scale survey of artificial intelligence researchers found few worried about extinction, but many sounding the alarm over employment."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T10:00:00.000Z",
    "title": " Japanese e-commerce giant Mercari to allow Bitcoin payments from June ",
    "url": "https://cointelegraph.com/news/japanese-e-commerce-giant-mercari-allow-bitcoin-payments-june",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjdjNWExZDItMTk3Ni00MDNlLWE4ODctZTY3MzQ5YmM4MjBmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mercari has become a gateway for crypto adoption in Japan after launching several crypto-focused products and services on its platform.</p>\n                    <p><p data-ct-non-breakable=\"true\">Mercari, which is one of the largest Japanese e-commerce platforms, will allow users to purchase its flea market app-listed products using Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) starting in June. </p><p><a href=\"https://www.nikkei.com/article/DGXZQOUC202J50Q3A221C2000000/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a Nikkei report, the e-commerce platform will facilitate Bitcoin transactions via its Tokyo-based crypto exchange subsidiary Melcoin.</p><p>The prices of listed items in the flea market app will be displayed in Japanese yen, with an option to pay in Bitcoin. Vendors and sellers will still receive the paid Bitcoin in local fiat currency, as the marketplace will convert the BTC through its exchange partner in real time.</p><p><a href=\"https://cointelegraph.com/news/japanese-e-commerce-giant-mercari-allow-bitcoin-payments-june\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-08T09:55:18.000Z",
    "title": "Binance’s BUSD loses top five stablecoin spot as supply dips under 1B",
    "url": "https://cryptoslate.com/binances-busd-loses-top-five-stablecoin-spot-as-supply-dips-under-1b/",
    "description": "<p>Binance USD (BUSD) slipped out of the top five stablecoins by market capitalization over the weekend after its circulating supply dipped under 1 billion, its lowest point since Dec. 2020. Data from CryptoSlate shows that BUSD&#8217;s circulating supply sits at 927 million tokens, marking a staggering 96% decrease from its peak supply of 23.45 billion. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binances-busd-loses-top-five-stablecoin-spot-as-supply-dips-under-1b/\">Binance&#8217;s BUSD loses top five stablecoin spot as supply dips under 1B</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T09:43:05.000Z",
    "title": "Upbit Singapore gains MPI license from MAS for crypto expansion",
    "url": "https://www.cryptopolitan.com/upbit-singapore-gains-mpi-license-from-mas/",
    "description": "In a landmark move for Singapore&#8217;s digital asset sector, Upbit Singapore has been granted a Major Payment Institution (MPI) license by the Monetary Authority of Singapore (MAS). This development, a follow-up to the in-principle approval received in October 2023, marks a significant step for the leading cryptocurrency exchange in expanding its operations within the region&#8217;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T09:51:48.000Z",
    "title": "Próspera zone in Honduras adopts BTC as unit of account",
    "url": "https://crypto.news/prospera-zone-in-honduras-adopts-btc-as-unit-of-account/",
    "description": "Próspera, a special economic zone in Honduras&#8217; Roatan Island, has officially adopted Bitcoin (BTC) as a unit of account for valuing goods and services. The latest move follows the zone&#8217;s adoption of Bitcoin as legal tender in April 2022, positioning&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T09:45:14.000Z",
    "title": "XRP ETF Is Trending On X, Here’s Why",
    "url": "https://www.newsbtc.com/xrp-news/xrp-etf-trending-x-heres-why/",
    "description": "As anticipation builds around the potential approval of the first spot Bitcoin ETFs in the US by the Securities and Exchange Commission, the keyword &#8220;XRP ETF&#8221; is currently trending on X (formerly Twitter). Numerous XRP community members have posted supposed proof that an ETF in the US is on its way and could soon become a reality. However, a closer examination reveals a more nuanced reality. Why is $XRP ETF trending? 👀 &#8212; XRPcryptowolf (@XRPcryptowolf) January 7, 2024 XRP ETF Is Trending Good Morning Crypto recently stated, “JUST IN: Fidelity Unveils XRP ETP !?! With Grayscale &#38; Fidelity offering XRP products, 2024 could be the breakout year for XRP as it inches closer to all-time highs.&#8221; Similarly, XRP CAPTAIN announced, &#8220;BREAKING: Spot XRP ETF is for real,” while CryptoGeek claimed, “BREAKING: XRP ETF CITED TO BE RELEASED IN A &#8216;MATTER OF WEEKS&#8217; FOLLOWING BITCOIN ETF APPROVAL BY THE UNITED STATES SECURITIES AND EXCHANGE COMMISSION.&#8221; BREAKING 🚨🚨 SPOT #XRP ETF Is For Real 💥💥🚀🚀🚀 pic.twitter.com/Up2sA9jbDK &#8212; XRP CAPTAIN (@UniverseTwenty) January 7, 2024 The root of these claims lies in an XRP ETP from 21Shares (formerly Amun), which is available on Fidelity Investments’ platform. This development has generated significant excitement within the XRP community. However, the narrative around a US-launched ETF is misleading. Related Reading: New Report Predicts When The XRP Price Will Cross $1.56 The buzz partly stems from Grayscale&#8217;s recent decision to reincorporate XRP into its Grayscale Digital Large Cap (GDLC) fund, following Judge Analisa Torres&#8217; July 2023 ruling that classified XRP as a non-security. This ruling reversed Grayscale&#8217;s previous removal of XRP in January 2020 amid legal controversies over its security status. This move by Grayscale has fueled speculation about an upcoming ETF from the firm. But contrary to circulating claims, Fidelity has not launched an XRP ETP. Fidelity’s platform only showcases the XRP ETP launched by Swiss financial institution Amun AG in April 2019. This product, initially called AXRP and later rebranded to 21Shares, is available on the SIX Swiss Exchange. Moreover, it is not a US-registered ETP. Related Reading: XRP Whale Makes Massive Transfer Amidst Price Volatility Meanwhile, it is backed by physical XRP and managed by Coinbase Custody. Remarkably, the product is 100% backed by physical XRP and records $49,325 million in assets under management (AUM). Why A XRP ETF Won&#8217;t Happen Anytime Soon Regarding the possibility of an XRP ETF in the US, Bloomberg ETF expert James Seyffart offered a sobering perspective a few months back in response to rumors about a fake BlackRock XRP ETF which initiated a 15% pump that was quickly erased. In an interview, he stated: &#8220;I don&#8217;t think that XRP is ever going to get through the SEC&#8217;s doors, essentially not anytime soon, even after that loss [Ripple vs. SEC]. He added, “First of all, CME would have to list XRP futures before a futures ETF would launch, and I can&#8217;t imagine them allowing them a spot XRP ETF anytime soon. But again, like I said, three weeks ago I said I didn&#8217;t think Ethereum futures ETFs would be coming anytime soon unless there&#8217;s a huge change in the SEC, so theoretically it could be. But the SEC has said in that Terra case and multiple other cases that they believe Judge Torres got it wrong.” In summary, while the XRP community&#8217;s excitement is palpable, the reality of an ETF in the US remains distant, with regulatory hurdles and the SEC&#8217;s stance posing significant challenges. At press time, XRP traded at $0.55178. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-08T10:00:19.000Z",
    "title": "Can Shiba Inu Achieve 1 Cent in 2024? Borroe Finance Garners Investor Confidence",
    "url": "https://www.crypto-news-flash.com/can-shiba-inu-achieve-1-cent-in-2024-borroe-finance-garners-investor-confidence/?utm_source=rss&utm_medium=rss&utm_campaign=can-shiba-inu-achieve-1-cent-in-2024-borroe-finance-garners-investor-confidence",
    "description": "<img width=\"512\" height=\"271\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-54.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-54.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-54-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-54-150x79.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-54-450x238.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As we step into 2024, the crypto community is abuzz with one burning question: Can Shiba Inu (SHIB) hit the elusive 1 cent mark? Meanwhile, Borroe Finance is silently carving a niche in the DeFi space, winning investor confidence with its innovative approach. Let’s dive into these two contrasting crypto tales. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-08T10:00:17.000Z",
    "title": "Bonk Price Prediction – Is This The Top Meme Coin?",
    "url": "https://www.crypto-news-flash.com/bonk-price-prediction-is-this-the-top-meme-coin/?utm_source=rss&utm_medium=rss&utm_campaign=bonk-price-prediction-is-this-the-top-meme-coin",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-50.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-50.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-50-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-50-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-50-450x253.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bonk dips in the market as investors seek top meme coins for investments.  NuggetRush is on a path to prominence as its presale prepares to enter the last stage. Investors seeking to benefit from the meme coin frenzy are flocking to the NUGX presale, attracted by its massive growth potential. Crypto investors looking to start [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-08T10:07:20.000Z",
    "title": "Gold vs. Bitcoin Spot ETFs: Price Impact Insights",
    "url": "https://www.altcoinbuzz.io/spotlight/gold-vs-bitcoin-spot-etfs-price-impact-insights/",
    "description": "<p>As the financial markets continue to evolve, attention has shifted towards emerging assets like Bitcoin. This sparked discussions about the potential effects of a Bitcoin Spot ETF on its price when compared to the historical performance of the Gold Spot ETF. Let&#8217;s make a brief comparison between Gold vs. Bitcoin Spot ETFs. Gold Spot ETF: [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/gold-vs-bitcoin-spot-etfs-price-impact-insights/\">Gold vs. Bitcoin Spot ETFs: Price Impact Insights</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-08T10:03:32.000Z",
    "title": "BRCapp Brings Bitcoin Closer to the market. Here’s How",
    "url": "https://www.altcoinbuzz.io/spotlight/brcapp-brings-bitcoin-closer-to-the-market-heres-how/",
    "description": "<p>Imagine for a second that there was a single app that enabled you to engage with all BRC20 products in one place. Well, let’s move beyond imagination to reality, because that’s what the BRCapp does. The BRCapp is a unique mobile application for the Bitcoin ecosystem. It is spread across six different major products that [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/brcapp-brings-bitcoin-closer-to-the-market-heres-how/\">BRCapp Brings Bitcoin Closer to the market. Here&#8217;s How</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]