[
  {
    "source": "Decrypt",
    "date": "2023-10-04T13:35:43.000Z",
    "title": "What You Need to Know About Exchange Tokens After FTX's FTT Meltdown",
    "url": "https://decrypt.co/resources/what-you-need-to-know-about-exchange-tokens-after-ftx-meltdown",
    "description": "Exchange tokens are the backbone of many top exchanges, but how much risk is involved?"
  },
  {
    "source": "Decrypt",
    "date": "2023-10-04T13:34:02.000Z",
    "title": "Not Your Keys, Not Your Crypto: What to Know Before the Next FTX-type Meltdown",
    "url": "https://decrypt.co/resources/coins-keys-wallet",
    "description": "The popular adage, Not your Keys, Not your Coins, is making the rounds in the wake of the latest exchange meltdown. But what does it actually mean?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T13:30:00.000Z",
    "title": "The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report",
    "url": "https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/10/MAgazine-Cuba-story-scaled.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph goes to Cuba to see how some Cubans use Bitcoin to secure a better economic future.</p>\n                    <p><p><strong>In Cubas capital, Havana, a Bitcoin community has emerged from an economically antagonistic environment.<br></strong><br>Satoshi didnt create Bitcoin for Cubans, but it really comes in handy for us, Forte, co-founder of the aptly named local Bitcoin organization Cuba Bitcoin, tells Magazine.</p><p>Cubans are turning to Bitcoin because their money is increasingly worthless. Zimbabwe, Venezuela and Lebanon often compete for media coverage about runaway inflation levels, but the Cuban peso is not far behind.<br><br>The Cuban peso has devalued so much over the last few years that carrying bags of cash is increasingly common among the rich and the poor.<br>In practice, even if someone bought Bitcoin at the top of the 2021 bull run at $69,000, their money is worth much less in Cuban pesos. Whereas Bitcoin dropped 80% to its bear market low, it has since recovered 100%, and the peso has devalued by 90%.</p><p>The realization that someone should swap local currency for the Bitcoin top, knowing that it will crash and theyll still retain more purchasing power, is one of the many financial wake-up calls received while working on Cointelegraphs new documentary, <em>The Truth Behind Cubas Bitcoin Revolution</em>. </p><figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube\"><div class=\"wp-block-embed__wrapper\"><iframe loading=\"lazy\" title=\"The Truth Behind Cuba&#039;s Bitcoin Revolution | What it Really Looks Like\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/UPp0Xbk4bFo?feature=oembed&enablejsapi=1&origin=https://cointelegraph.com\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div></figure><p>In 2021, I came across the article Inside Cubas Bitcoin Revolution by Human Rights Foundation chief strategy officer Alex Gladstein, in which he explains how and why Cubans were utilizing Bitcoins stateless and low-fee properties to save money and escape financial oppression. <br>In line with the Bitcoin mantra of <em>Dont trust, Verify</em>, I went to see with my own eyes what Gladstein described.</p><p>Camera in hand with my trusty travel partner <a href=\"https://cointelegraph.com/news/crypto-stories-youtuber-paco-de-la-india-explains-his-travels-using-bitcoin\" target=\"_blank\" rel=\"nofollow\" >Paco de la India</a> by my side, I network my way into the Cuba Bitcoin community, which now counts thousands of enthusiasts and advocates.</p><h2 class=\"wp-block-heading\" id=\"h-la-cultura-cubana\"><strong>La Cultura Cubana</strong></h2><p>Following one of the largest financial conferences in the world, Bitcoin Miami, in arguably the worlds most capitalist arena, the United States of America, I hop across the Caribbean to Cuba, one of the few extant socialist states. The contrast hits me harder than the Cuban tropical heat. <br><br>From the moment I landed at Havana Jose Marti International Airport, I noticed some funny quirks: doors open manually (forget automatic sensors), check-in and immigration are done on pen and paper, and the taxis are 1950s Chevrolets. </p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image5.jpg\" alt=\"\" class=\"wp-image-24131\" width=\"795\" height=\"596\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image5.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image5-300x225.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image5-770x578.jpg 770w\" sizes=\"(max-width: 795px) 100vw, 795px\" /><figcaption class=\"wp-element-caption\">A retro car in Havanas city center. (Cointelegraph)</figcaption></figure><p>Its common to describe visiting Cuba as a time warp. Its not hyperbole; Cuba cannot access world markets, financial institutions or trade. The United States has subjected Cuba to a trade embargo  the longest in modern history  since the island nation nationalized U.S. oil refineries in 1960.<br><br>As a result, Cuban industry, economic output and commerce lag far behind the modern world.</p><p>The embargo, coupled with more than half a century of communism, has resulted in a highly educated, extraordinarily literate but desperately poor and hungry population, many of whom possess a heartbreaking desire to leave the island, or in Spanish, to find a salida  an exit. <br><br>Why stay in a country where a taxi driver earns more than an atomic engineer  and the emaciated engineer struggles to feed their family? </p><h2 class=\"wp-block-heading\" id=\"h-adopting-bitcoin\"><strong>Adopting Bitcoin</strong></h2><p>In such an environment, its a wonder why Cubas dont flock to Bitcoin as money that exists outside of state control. However, many Cubans are learning about and slowly turning to Bitcoin. </p><p>Catrya, one of the main characters in Cointelegraphs new documentary and one of the founders of Cuba Bitcoin, explains that there could be around 5,000 Bitcoiners in Cuba, and if you include crypto enthusiasts generally, the number is higher still. </p><p>Cubans do not have easy on-ramps into crypto. Firstly, those with internet connections cannot sign up for Binance, Coinbase or Gemini due to their nationality. For Cuban Americans on the island, Cubas government restricts access to American websites. Cubans buy Bitcoin peer-to-peer through Telegram or WhatsApp groups and at in-person meetups. </p><p>What amazes me is the tiny amounts of money Cubans put aside to save money or stack sats. Saving 1,000 satoshis (less than $1 a week) is meaningful to a Cuban on $40 monthly. The Cuban peso may not be here in 10 years, but Bitcoin certainly will be.<br>The peer-to-peer process is straightforward, but its not beginner-friendly, and these hurdles can hamper adoption  although they do have a silver lining, as Catrya explains:</p><blockquote class=\"wp-block-quote\"><p>Since were denied [access to exchanges] by default for being Cuban, we can never do KYC [Know Your Customer], so thats a good thing for us, at least in terms of privacy.</p></blockquote><p>Buying Bitcoin peer-to-peer and storing Bitcoin by taking ownership of the private keys is safer. Customers who trusted custodians such as FTX, BlockFi, Celsius and Vauld with their crypto were wiped out. Cubans dont have that option, and while it takes longer, its more secure. </p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"1000\" height=\"580\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image3-1.png\" alt=\"\" class=\"wp-image-24133\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image3-1.png 1000w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image3-1-300x174.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image3-1-770x447.png 770w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" /></figure><p>Erich Garcia Cruz, the founder of QvaPay and BitRemesas  a currency remitter using Bitcoin that boasts tens of thousands of Cuban users  says that the small but growing number of Bitcoin customers somewhat represents Cubas fledgling internet culture.</p><h2 class=\"wp-block-heading\" id=\"h-connectivity-and-freedom-of-information\"><strong>Connectivity and freedom of information</strong></h2><p>Cubans could get online in earnest from 2013. So, while the rest of the world was enjoying the iPhone 5C and 4G, a few lucky Cubans fortunate to access a computer could get online that year, albeit with an awful internet connection. </p><p>Now, Cubans can access 3G and sometimes 4G connectivity on their phones. The tech-savvy and younger Cubans use VPNs to circumnavigate online restrictions.</p><p>Generally, the lag in internet infrastructure combined with the cost and difficulty of buying a smartphone on a frighteningly low salary means Cuba is way behind in IT. </p><p>In 2021, the World Bank <a href=\"https://data.worldbank.org/indicator/IT.NET.USER.ZS?locations=CU\" target=\"_blank\" rel=\"nofollow\" >reported</a> that three-quarters of Cuba has access to the internet. But while the issue is improving, internet censorship is rife, and Cubans are repeatedly told to trust the government through state-sponsored TV, newspapers and media.<br><br>Independent media publications are classified as enemy propaganda, which is something I was made aware of a few times during my investigation. I wont share those stories here, but its safe to say reciting such stories wouldve landed me in trouble had I stayed in Cuba. </p><p>Two exiled Cuban journalists have since advised me to avoid returning to the island for some time, especially if the Cointelegraph documentary gets a lot of attention. </p><p>A funny caveat to the state-run media is that some Cubans were orange-pilled by Bitcoin proponent Max Keiser. His appearances on the Russia Today news channel were approved for broadcast in Cuba. Some of Catryas peers watched the show where Keiser bashes fiat currencies and promotes Bitcoin. </p><p>And yet, Bitcoin is magic internet money; it lives on the web. If Cubans arent online  or watching Russia Today  how can they know about it? </p><h2 class=\"wp-block-heading\" id=\"h-orange-pill-cuba\"><strong>Orange pill Cuba</strong></h2><p>Bitalion, one of the Cuba Bitcoin founders, works in telecommunications for the government. He explains that as a privileged public sector worker, he benefits from better internet connection speeds and lower online censorship levels. </p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image6-5-775x1024.jpg\" alt=\"\" class=\"wp-image-24141\" width=\"658\" height=\"870\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image6-5-775x1024.jpg 775w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image6-5-227x300.jpg 227w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image6-5-770x1017.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image6-5.jpg 936w\" sizes=\"(max-width: 658px) 100vw, 658px\" /><figcaption class=\"wp-element-caption\">Bitalion speaks to Paco before dinner</figcaption></figure><p>Bitalion stumbled across the Bitcoin white paper in 2014 and became infatuated with the idea of an independent, borderless currency. He rhetorically poses the question: For those fortunate Cubans who are able to travel abroad, what can they bring to the new country? The peso in their pocket, or Bitcoin in a mobile wallet? </p><p>As with the other Bitcoin advocates on the island, Bitalion volunteers his time to educate people and support Bitcoin adoption. Hes also one of the handful of Cubans running a Bitcoin node. At Cubas <a href=\"https://cointelegraph.com/news/cuba-bitcoin-community-hosts-btc-only-meetup\" target=\"_blank\" rel=\"nofollow\" >first-ever Bitcoin-only meetup</a>, he demonstrates to dozens of Cubans how to pay for goods and services directly to his Lightning Network node.<br><br>Cruz, Forte and countless business owners explain that Bitcoin is an easy orange pill to swallow, particularly for the digitally capable Cubans. You merely explain to them that nobody controls it; its stateless money. </p><figure class=\"wp-block-image alignright size-full\"><img decoding=\"async\" width=\"427\" height=\"430\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image8-1.png\" alt=\"\" class=\"wp-image-24142\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image8-1.png 427w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image8-1-298x300.png 298w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image8-1-100x100.png 100w\" sizes=\"(max-width: 427px) 100vw, 427px\" /><figcaption class=\"wp-element-caption\">Interviewing Forte</figcaption></figure><p>At face value, Bitcoin is a useful tool for a country that has been financially and economically handicapped for generations. But for Forte, Catrya and Bitalion, the ideology of Bitcoin resonates strongly.</p><p>Forte jokes, Satoshi didnt create Bitcoin for Cubans, but it really comes in handy for us.</p><p>In the hope of encouraging more Cubans to explore Bitcoin, the trio and the Cuba Bitcoin community host monthly educational meetups in which they explain the principles of Bitcoin and delve into its philosophy.<br><br>They recently <a href=\"https://twitter.com/Cuba_BTC/status/1698468385506398273?s=20\" target=\"_blank\" rel=\"nofollow\" >introduced</a> the popular Mi Primer Bitcoin (My First Bitcoin) program in the country, which is already picking up speed in El Salvador and will soon be <a href=\"https://cointelegraph.com/news/el-salvador-to-introduce-bitcoin-education-in-schools-by-2024\" target=\"_blank\" rel=\"nofollow\" >instructed in schools nationwide</a>. </p><h2 class=\"wp-block-heading\" id=\"h-por-que-aceptas-bitcoin-why-do-you-accept-bitcoin\"><strong>Por qu aceptas Bitcoin? Why do you accept Bitcoin?</strong></h2><p>QvaPays Cruz explains that Bitcoin is the financial tool that allows the small but growing number of Cuban business owners to access foreign products.<br><br>Recent U.S. presidential administrations had fluctuating policies on the Cuban embargo, relaxing and tightening different aspects based on political expediency.</p><p>Cruz orange-pills suppliers in an attempt to open up the Cuban economy to international markets where possible:</p><blockquote class=\"wp-block-quote\"><p>You are accepting Bitcoin because youre dealing with a private [independent] coin. The government doesnt have access to the transactions you and you have the freedom to do whatever you want.</p></blockquote><p>The term freedom, or <em>libertad</em>, popped up frequently as I mingled and met with Cuban Bitcoiners, crypto enthusiasts and entrepreneurs. The fact that citizens can hold money in a wallet, outside of government overreach, appealed to many Cubans whom the government has consistently let down.</p><p>The ability to store wealth on a mobile phone in a Bitcoin Lightning wallet instead of in pesos at a bank is also an efficiency gain. It means no more queues at banks to cash in money that could devalue by a few pesos over a bank holiday weekend. </p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image2-2.png\" alt=\"\" class=\"wp-image-24143\" width=\"640\" height=\"666\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image2-2.png 702w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image2-2-288x300.png 288w\" sizes=\"(max-width: 640px) 100vw, 640px\" /><figcaption class=\"wp-element-caption\">Speaking with Erich Garcia Cruz. Yes, the V from Vendetta poster was intentional.</figcaption></figure><p>Cruz and three other business owners also share that accepting Bitcoin benefits holidaymakers. Adan, a nightclub, bar and restaurant owner, explains that tourists bring a lot of cash to Cuba for vacation  and thats risky. </p><p>Having Bitcoin on a mobile phone in a wallet is a safer way to travel than flashing wads of dollar bills that end up on the black market in Cuba, inadvertently supporting the illicit and sometimes dangerous black market activity of exchanging notes in public. </p><p>Adan accepts Bitcoin because of the international branding the Bitcoin logo brings. It opens up his bars doors to another potential market. Similar to El Salvador, <a href=\"https://cointelegraph.com/news/tourists-flock-to-el-salvador-despite-bitcoin-bear-market\" target=\"_blank\" rel=\"nofollow\" >where Bitcoin tourism has become a trend</a>, bars and restaurants in Cuba could also attract holidaymakers to spend satoshis instead of pesos at the till. </p><p>Finally, there are myriad ways in which adopting Bitcoin can lead to positive and unexpected outcomes. Mister Navis bar and restaurant, run by Mr. Navi and his son Julian, recently began accepting Bitcoin. Following a conversation with Forte, Catrya and Bitalion, the Cuba Bitcoin group now hosts educational Bitcoin meetups at the venue.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image4-4-1024x768.jpg\" alt=\"\" class=\"wp-image-24144\" width=\"803\" height=\"602\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image4-4-1024x768.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image4-4-300x225.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image4-4-770x578.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image4-4-1536x1153.jpg 1536w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/image4-4.jpg 1999w\" sizes=\"(max-width: 803px) 100vw, 803px\" /><figcaption class=\"wp-element-caption\">From right: Mr. Navi, Julian, Paco and me at Mr. Navi’s</figcaption></figure><p>I tipped one of the service staff in Bitcoin at Mr. Navis the first day we visited. Five days later, I saw her again when we went out for dinner with Mr. Navi and Julian. She seems different  I ask her if she is OK. She confesses that she was mugged a few days ago, and the attacker stole her purse, cash and phone. </p><p>To her surprise, when she downloaded the Bitcoin Lightning app where Id tipped her, the funds magically reappeared on her new phone. On seeing her wide-eyed reaction, I tipped her again.<br><br>It’s clear that, for Cubans, Bitcoin could represent a critical instrument for securing their financial future in the face of runaway inflation and government interference, or as a way of opening up to embargoed markets and the international financial world.  </p><p><em>Disclaimer: The views, opinions and perspectives expressed in this article are those of the author and are not necessarily those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T13:26:42.000Z",
    "title": "Crypto VC: Token investing and the next bull run with Digital Wave Finance ",
    "url": "https://cointelegraph.com/news/crypto-vc-token-investing-bull-run-dwf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/31624635-f6b5-4481-ba47-b465f69d8eac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph sits down with Digital Wave Finance to talk about investment strategies and what could catalyze the next bull run. </p>\n                    <p><p>Venture capital has been a key driver for myriad startups in the blockchain space. Founders know how competitive it can be to secure valuable VC funding that can keep the lights on and employees paid during the critical first days of a new project.</p><p>In a new interview series, Cointelegraph <a href=\"https://cointelegraph.com/news/crypto-vc-risk-investment-strategies\">sits down with executives</a> at some of the most active funds investing in the crypto space to understand their perspectives, hear about their successes and failures, and find out what gets them excited about a new project in the Web3 space.</p><p>This week, Cointelegraph spoke with Andrei Grachev, co-founder of crypto trading entity Digital Wave Finance (DWF) and managing partner of market maker and multistage Web3 investment firm DWF Labs. DWF Labs has been highly active since late 2022, having invested in the Telegram Open Network (TON), Orbs, Radix, Crypto GPT (now Layer AI) and others.</p><p><strong>Cointelegraph: It feels like DWF Labs emerged from nowhere and started aggressively taking over the industry. Tell us more about the history of the fund and the background of the partners. </strong></p><p><strong>Andrei Grachev: </strong>DWF Labs started operating in late 2021, founded by experienced partners from DWF, a highly successful high-frequency trading entity that had been operating since 2018. We recognized the potential of blockchain technology and wanted to explore investment opportunities in the industry. After making several small investments and token allocations, we refined our investment strategy and risk tolerance. Since then, we have been actively investing in promising projects and providing long-term financial support on a regular basis.</p><p><strong>CT: DWF Labs invests exclusively in tokens. Many players in the industry consider this approach to be market-making. Can you explain the rationale behind this decision and why you believe investing in tokens is the best approach?</strong></p><p><strong>AG: </strong>First of all, let me clarify that every project we work on has different deal components. While some involve pure venture investment, others may include token purchases. Over the past 12 to 18 months, we have seen an increasing number of market makers entering the investment space. While I cannot speak for the entire industry, it appears to me that market makers offer significant support to projects that is crucial to their growth. </p><p>For example, market makers typically have established relationships with exchanges, and they can help projects with listing introductions. However, it is up to the exchange to accept the recommendations or not. Another advantage of working with market makers is that they can provide liquidity support to tokens when it is needed. In other words, market makers offer value beyond just executing trades, and this is why we believe that investing in tokens is the best approach.</p><p><strong>CT: How do you evaluate the risks associated with investing in tokens, and what steps do you take to mitigate those risks? Are there any particular metrics or criteria you use to assess the potential of a token?</strong></p><p><strong>AG: </strong>As a Web3 investment firm, we have developed various investment theses over time to evaluate the risks and potential of a project. While we cannot fully disclose our current investment strategy, we have identified several verticals that we are interested in supporting. On our website, we categorize our investments into nine macro-categories, allowing us to diversify our risks within each vertical by selecting a few projects with significantly different attributes.</p><p>For example, if we identify a growing vertical where multiple players are developing or building value, we look at the possibility of supporting more than one project. If a project has a clear emphasis on infrastructure, the next project we select might be more focused on the B2B side, and the next one on retail. This approach provides us with a comprehensive coverage of the spectrum of an industry vertical.</p><p>When evaluating the potential of a token, we use various metrics and criteria that are specific to each project and vertical. We analyze the market size, competition, team experience and track record, tokenomics, and community engagement, among other factors. We also conduct due diligence and consult with industry experts to ensure that the project has a solid foundation and strong potential for growth. While investing in tokens does carry inherent risks, we believe that a diversified approach combined with thorough research and analysis can help mitigate those risks and generate positive returns for our investors.</p><h2>Portfolio companies </h2><p><strong>CT: What does the ideal portfolio company for DWF look like? What do you prioritize: The idea, personality of a founder, a team or traction?</strong></p><p><strong>AG: </strong>Our investment portfolio is diverse, but there are a few categories that stand out due to their weight in terms of the number of investments. Decentralized finance and trading, metaverse and GameFi, and infrastructure and enterprise are the categories that seem to have captured our attention the most.</p><p>When it comes to prioritizing investment factors, potential market adoption should be the primary consideration. This is because a great idea or product that doesn’t have a large potential user base will not be successful in the long run. Addressable market size is also an important factor, as it helps to determine the potential revenue and growth prospects of a company.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/etf-bitcoin-ledger-ceo-pascal-gauthier\">ETF filings changed the Bitcoin narrative overnight — Ledger CEO</a></em></strong></p><p>However, even with a large potential market and a great product, the ability of the team to execute is essential for success. A talented and experienced team with a track record of success will increase the likelihood of successful execution and bring the product to market efficiently.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f4325e73-24af-43a3-9dde-83a3ea3f4b0e.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Grachev at the Meta Era Summit 2023. Source: X</em></figcaption></figure><p>Finally, while buzz and hype can be useful indicators of market demand and potential, they can also be misleading and should be taken with a grain of salt. It is important to evaluate the underlying fundamentals and potential for long-term success rather than being swayed solely by hype or trends in the market.</p><p><strong>CT: Among others, you invested in TON and EOS. Both projects have a complicated history and a controversial reputation in the industry. What exactly did you find attractive in these projects? </strong></p><p><strong>AG: </strong>We invested in TON and EOS due to their potential for market adoption and addressable market size. Both projects were highly ambitious and aimed to address fundamental issues within the blockchain industry, such as scalability and usability. We were also impressed with the teams behind each project and their ability to execute on their vision, despite the challenges they faced. While there were certainly controversies and setbacks along the way, we believed that these projects had the potential to make a significant impact in the industry, and we were willing to take the risk. Ultimately, our decision to invest in TON and EOS was based on a thorough analysis of their potential for long-term success, rather than their current buzz or hype status within the industry.</p><p><strong>CT: One of your recent investments is Crypto GPT. What is that? </strong></p><p><strong>AG: </strong>As outlined in our investment thesis, we strive to mitigate risk by diversifying our portfolio within specific industry verticals. This approach allows us to balance potential profits with the possibility of losses. Our investment in Crypto GPT occurred during a period when we were supporting various AI projects. While the initial version of Crypto GPT may not have been impressive, we believed our investment could have facilitated further development and led to something innovative in the market. It is premature to write off the project entirely based on its current implementation. For example, the first iPhone did not have the copy/paste feature, but subsequent iterations improved upon the initial model. The Crypto GPT team is actively developing and launching new products, and we look forward to seeing the results in the long run.</p><p><strong>CT: What is the best way for the startup to catch your interest? </strong></p><p><strong>AG: </strong>Our investment strategy is a combination of various assessment criteria, such as the team, market, traction, competitive landscape and more. As we receive a high volume of funding applications monthly, we prioritize projects that catch our attention with something unique and extraordinary. This is what we would have referred to as the USP, or “unique selling proposition,” in traditional marketing jargon. We value when projects showcase their strengths, whether it be in their community or traction, as it allows us to easily identify potential gems and initiate our due diligence process.</p><p><strong>CT: What is your fastest-growing portfolio company? </strong></p><p><strong>AG: </strong>There are several fast-growing projects in our portfolio, making it challenging to focus on just one when highlighting them. However, some projects have managed to grow their communities tremendously, such as Yield Guild Games, which has accelerated the adoption of GameFi; Conflux, with its signature partnership with China Telecom; and Coin98, which has seen massive adoption in Southeast Asia. Notably, Synthetix is a groundbreaking financial primitive that enables the creation of synthetic assets. Syscoin has been working for years to perfect a solution to the blockchain trilemma, and Fetch.ai offers comprehensive tools for developing, deploying and monetizing applications.</p><p><strong>CT: How do you find the best deals?</strong></p><p><strong>AG: </strong>I have to give credit to my partners and our team, who work tirelessly to stay informed and scout for new projects while evaluating the potential of existing ones. We also attend industry events to connect with the community, which is still very much connected through “decentralized human nodes.” These events provide us with an opportunity to network and expand our connections, which is crucial for discovering promising deals.</p><p><strong>CT: Many big names — including a16z, Shima and others — are investing in Web3 gaming, but all the metaverse and gaming projects seem to be overestimated. Decentraland reportedly had just 38 daily “active users” at one point in a $1.3 billion ecosystem. What do you think about Web3 games and metaverses?</strong></p><p><strong>AG: </strong>We, like other VCs, are keeping a close eye on the Web3 gaming and metaverse spaces. While we see the potential for these projects to revolutionize the gaming and virtual world industries, we also acknowledge the risks and challenges they face. It is true that some projects have been overestimated, but this is a nascent industry, and we are still in the early stages of experimentation. As with any emerging technology, it takes time to develop and gain widespread adoption.</p><h2>About the industry</h2><p><strong>CT: How will the industry change in the near future and in the long run?</strong></p><p><strong>AG: </strong>The industry has grown so big that it is hard to speak about it without diving deep into each of the verticals. For example, it would be impossible to ignore the tremendous impact that AI is bringing to the world. Also, the incredible growth of GameFi has already contributed significantly to growing adoption. And certainly, DeFi is here to stay. </p><p>Decentralized exchanges have been the talk of the day ever since FTX went bankrupt. More recently, there seems to be a renaissance of memecoins. There has been a tremendous amount of building behind the noise of token price. We are always interested in supporting builders. At the moment, we are particularly keen to support infrastructure projects, from layers to IoT and real-world assets. We believe that these projects will play a critical role in shaping the future of the industry.</p><p><strong>CT: Some critics of token investing argue that many tokens are not real investments but speculative assets subject to price manipulation and volatility, which negatively influence the entire industry. How do you respond to this criticism, and what evidence can you provide to support the idea that token investing is a legitimate form of investment?</strong></p><p><strong>AG: </strong>Token investing is often criticized as a form of speculation that lacks legitimacy as an investment vehicle. However, tokens are attractive to both retail and institutional investors because of their liquidity. Tokens can be viewed as the next evolution of shares traded on a stock exchange. In traditional markets, the democratization of access to the stock market through platforms like Robinhood and eToro has given retail investors the ability to organize themselves into communities that can further their investment thesis beyond the market rationale. The growth of memecoins is a prime example of this community approach to crypto investment.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/df429e2a-4516-43ba-8173-a6ec5d711902.png\"  /><figcaption style=\"text-align: center;\"><em>Total memecoin trading volumes. Weekly volume in black. Cumulative volume in green. Source: Dune</em></figcaption></figure><p>While some memecoins have evolved into projects with ambitious ecosystems, such as Floki, others exist solely as speculative tools. Ultimately, investing is about profit, and an investor who doesn’t want to profit is called a philanthropist. Therefore, token investing should be evaluated based on its potential for generating returns, as well as its potential risks and rewards. Some tokens will generate handsome profits based on their technological value, while others will thrive solely due to their growing community of enthusiasts.</p><p><strong>CT: The recent collapses of FTX, 3AC and others didn’t add any trust or optimism to the crypto space, while recent events indicate that traditional financial institutions and the current financial system overall are in crisis. In your opinion, what’s the best way to overcome these challenges?</strong></p><p><strong>AG: </strong>Finance is a highly complex field, at a crossroads between the economy on the one hand and government regulation on the other. Financial institutions are a vital part of the economy in day-to-day terms, and it is unfortunate when such institutions fail to comply with regulations or intentionally implement malpractices.</p><p>As for overcoming challenges, there are a few approaches that could be taken. Firstly, increasing transparency and accountability within the industry is crucial. This can be achieved through regulation and self-policing by the industry itself. Secondly, embracing technological innovation and new business models could lead to more efficient and inclusive financial systems. Lastly, educating the public and promoting financial literacy is essential in building trust and confidence in the industry. Overall, a combination of these approaches could lead to a more resilient, trustworthy financial system.</p><p><strong>CT: This is a fast-growing multibillion-dollar industry, but still, for the general public, it might look like something related to illicit activities such as money laundering. What can change this perception?</strong></p><p><strong>AG: </strong>This concern seems outdated, as over the past few years, there has been significant adoption of blockchain technology and Web3. Many portfolio companies have created a positive impact for communities globally. For example, World Mobile Token disrupts the trillion-dollar telecommunications industry by enabling connectivity for everyone through a sharing economy and distributing network ownership. [...] It’s essential to focus on builders and the real value they bring to the world to dispel negative perceptions about the crypto industry.</p><p><strong>CT: What topics in the industry are the hottest nowadays? Just 1.5 years ago, nonfungible tokens were everywhere. Now, every primary protocol has its own NFT marketplace but very few users. Are NFTs gone, or do you expect them to evolve into something? What’s the next big thing?</strong></p><p><strong>AG: </strong>Undeniably, NFTs took the world by storm, demonstrating that massive crypto adoption is possible. Although their initial use case was closely related to self-expression, NFTs represented a mere speculative tool for some. In other words, the use case was not the most solid to build upon, but it was indeed a good starting point. Now, we see many more innovative use cases in NFTs, and we are sure that many more will come very soon. </p><p>For example, with the advent of advanced AI engines for art creation, the ability to launch a new NFT collection is no longer limited to those with the technical skills to execute; rather, the opportunity has been democratized to empower anyone with an idea to execute rapidly and easily. This simplification and democratization is already spilling over into no-code development, gaming and entertainment more broadly, like music and filmmaking. Trading will also be significantly impacted by AI integration, and we are already seeing some projects emerging in this field.</p><p><strong>CT: In your opinion, what could catalyze the next bull run? </strong></p><p><strong>AG: </strong>GameFi will continue to lead in mass adoption as the lowest-hanging fruit. What is particularly interesting will be to see how AI integrations bring into existence a new breed of extremely interactive gaming experiences. For example, AI-driven nonplayer characters will have emotions and personalities of their own and will interact with players far beyond their scripted scope of existence. Therefore, we should keep a close eye on how AI will impact all industries.</p><p><strong>CT: There are alarmists who think AI will “steal jobs” and positive thinkers who are sure it will make our lives better and easier. What is your point of view? What significant changes can AI bring to the crypto industry?</strong></p><p><strong>AG: </strong>The idea that AI will steal jobs is real, but in more practical terms, people who know how to master AI integration will be replacing other people’s jobs. AI, on its own, is not going to steal anyone’s job unless someone programs it to do so. There might be many ethical repercussions related to the first outcome of AI integrations. It is not too far-fetched to imagine AI being regulated in a similar way to finance, to a certain extent.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/6-questions-for-jw-verret-an-attorney-whos-tracking-the-money-but-advocating-for-crypto/\">6 Questions for JW Verret — the blockchain professor who’s tracking the money</a></em></strong></p><p>As for the positive impact of AI, it has the potential to bring significant change to the crypto industry. AI can be used for advanced data analysis and predictive modeling, helping traders make informed decisions and identify market trends. It can also be used to enhance security measures, detecting and preventing fraud and cyberattacks. Additionally, AI can assist in developing more efficient and effective blockchain protocols, leading to faster and more scalable networks. Overall, I believe AI will play a crucial role in the growth and development of the crypto industry, and its impact will be mostly positive if implemented ethically and responsibly.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T13:15:24.000Z",
    "title": "Bitcoin mining restricted to legal entities in Uzbekistan: Official",
    "url": "https://cointelegraph.com/news/crypto-mining-license-rules-approved-uzbekistan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f41e2be4-c93a-48e4-a5e9-c8465299b671.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cryptocurrency mining in Uzbekistan can only be carried out by legal entities with the use of solar power, the local crypto watchdog has reiterated.</p>\n                    <p><p>Cryptocurrency mining in Uzbekistan is overcoming major changes as the country’s major crypto market supervisor has approved a framework for licensing crypto mining operations.</p><p>Uzbekistan’s National Agency for Perspective Projects (NAPP) <a href=\"https://napp.uz/ru/news/mayning-faoliyatini-to-g-risidagi-nizom-tasdiqlandi\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a decree on licensing cryptocurrency mining operations, limiting such activities exclusively to legal entities.</p><p>Apart from banning individual miners’ operations, the NAPP has also <a href=\"https://lex.uz/ru/pdfs/6623732\" target=\"_blank\" rel=\"noopener nofollow\">required</a> firms to only use solar power to mine cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). However, miners can still use the unified power system of Uzbekistan in certain cases stipulated by the legislation. The document doesn’t mention what cases are meant.</p><p>Among other requirements, Uzbekistan’s cryptocurrency watchdog demanded companies set up a dedicated room for installing mining equipment and only mine crypto by the registered address. The rules also require crypto mining firms to provide timely and full payment or mining fees established by regulators.</p><p>Additionally, the NAPP has banned miners from mining “anonymous” cryptocurrencies, or those referred to as working based on anonymity and hiding transactions. The authority was referring to privacy-focused cryptocurrencies like Monero (<a href=\"https://cointelegraph.com/xmr-price-index\">XMR</a>), which allow users to obfuscate network transactions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kazakh-crypto-miners-ask-president-cut-energy-prices\"><strong><em>Kazakh crypto miners plead with president to cut energy prices</em></strong></a></p><p>“All mining operations and services are only possible after obtaining a permitting document and license in the prescribed manner,” the NAPP wrote, adding:</p><blockquote>“The agency also asks all citizens to act within the framework of the law and refrain from attempting to organize activities in the field of circulation of crypto-assets without obtaining the appropriate license.”</blockquote><p>It's unclear whether the NAPP’s latest crypto-mining document is a final decree establishing a framework for mining in Uzbekistan. The local government has issued multiple similar documents in recent years, repeatedly prohibiting individual miners from operating in Uzbekistan. One such decree was <a href=\"https://lex.uz/ru/pdfs/5985789\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> by Uzbekistan’s President Shavkat Mirziyoyev in April 2022, reiterating that local people are not allowed to pay with crypto or to mine digital currencies.</p><p>The NAPP did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\"><strong><em>Web3 Gamer: Minecraft bans Bitcoin P2E, iPhone 15 &amp; crypto gaming, Formula E</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T13:10:07.000Z",
    "title": "Yield Protocol to permanently 'wind down' operations by December 2023",
    "url": "https://cointelegraph.com/news/yield-protocol-permanently-wind-down-december-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f1e90ef4-57e4-46a0-9b94-13edc757c949.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Unfavorable crypto regulations in the United States, Europe and the United Kingdom was one of the factors for Yield Protocol's untimely shut down.</p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">Decentralized finance (DeFi)</a> lending protocol Yield Protocol announced its decision to shut down by the end of the year due to the lack of business demand and global regulatory pressures.</p><p>Yield Protocol will cease to exist after the end of its December 2023 series, which is slated to mature on December 29, 2023. In its <a href=\"https://yield-protocol.medium.com/winding-down-yield-protocol-0974b38066cc\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> detailing the “wind down” operation, Yield Protocol confirmed that the launch of March 2024 fixed rate series has been canceled. The protocol stated:</p><blockquote>“While we think that the future is bright for DeFi and fixed rate markets in DeFi, we felt this decision was necessary because there is currently not sustainable demand for fixed-rate borrowing on Yield Protocol.”</blockquote><p>Unfavorable crypto regulations in the United States, Europe and the United Kingdom were also some of the challenges that ultimately led Yield Protocol to shut down. Starting today, “liquidity providers for the *MS (March-September) strategies won’t accrue any further fees.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’ve made the tough decision to wind down the Yield Protocol. The March 2024 fixed rate series will not be launched. Only the December 2023 series remains active for borrowing and lending. All borrowing and lending will end by December 31st. <a href=\"https://t.co/oHnCGgeP13\">https://t.co/oHnCGgeP13</a></p>&mdash; Yield Protocol (@yield) <a href=\"https://twitter.com/yield/status/1709232386993496272?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Finally, “all borrowing and lending will end by December 31st,” two days after the existing series will mature, an official tweet confirmed.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-shut-down-busd-stablecoin-lending-october-25\"><strong><em>Binance to shut down BUSD lending by October 25</em></strong></a></p><p>2023 was witness to numerous other protocol-level shutdowns, which included the $29 million <a href=\"https://cointelegraph.com/news/fantom-based-lender-geist-finance-shuts-down-permanently-over-multichain-hack\">TVL lending platform Geist Finance</a> and a <a href=\"https://cointelegraph.com/news/discord-crypto-trading-bot-shuts-down-critical-exploit\">Discord crypto trading bot</a> None Trading valued at $16.5 million.</p><p>In both cases, the primary reason for their shutdown was attributed to an external attack. Geist Finance shut down permanently due to losses from a Multichain exploit. None Trading said it had “lost a significant amount of funding” as well as “team tokens” crucial for its operations.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T13:15:11.000Z",
    "title": "U.S. fiscal health under scrutiny as debt jumps $275 billion in one day",
    "url": "https://cryptoslate.com/insights/u-s-fiscal-health-under-scrutiny-as-debt-jumps-275-billion-in-one-day/",
    "description": "<p>Quick Take In a startling revelation by analyst Joe Consorti, the total U.S. debt witnessed a sharp increase of $275 billion in a single day, matching the total borrowing for the entire previous month. The current outstanding public debt has now escalated to an unprecedented level of $33.442 trillion according to Consorti. This instance of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/u-s-fiscal-health-under-scrutiny-as-debt-jumps-275-billion-in-one-day/\">U.S. fiscal health under scrutiny as debt jumps $275 billion in one day</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-10-04T13:30:00.000Z",
    "title": "The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report",
    "url": "https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/10/MAgazine-Cuba-story-scaled.jpeg\"></p><p>Cointelegraph goes to Cuba to see how some Cubans use Bitcoin to secure a better economic future.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T13:38:10.000Z",
    "title": "BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023",
    "url": "https://cryptodaily.co.uk/2023/10/blk-dnm-releases-the-first-connected-fashion-garments-as-part-of-fw-2023",
    "description": "Swedish-American fashion brand BLK DNM today reveals the first apparel embedded with blockchain-enabled hardware, marking the first instance of ‘connected fashion’: garments that exist both physically and virtually, each aspect ‘twinned’ via technology."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T13:15:35.000Z",
    "title": "UK Finalising Their Crypto Regulation Framework: Where Do We Go From Here",
    "url": "https://cryptodaily.co.uk/2023/10/uk-finalising-their-crypto-regulation-framework-where-do-we-go-from-here",
    "description": "As Rishi Sunak takes over as the British’s new Prime Minister in October 2022, he has made crypto one of his main focuses so that the country stays relevant. Let’s see what we can expect from the U.K.’s regulation landscape."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T13:26:55.000Z",
    "title": "LayerZero and Conflux Partner to Build Blockchain-based SIM Card Ecosystem for APAC Region",
    "url": "https://cryptodaily.co.uk/2023/10/layerzero-and-conflux-partner-to-build-blockchain-based-sim-card-ecosystem-for-apac-region",
    "description": "The partnership between LayerZero and Conflux Network is set to significantly enhance the capabilities of China Telecom's BSIM card ecosystem."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-04T13:30:30.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Rebounds From Key Price Floor on Wednesday",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-rebounds-from-key-price-floor-on-wednesday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Rebounds From Key Price Floor on Wednesday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1968276673.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin marginally rebounded on Wednesday, after the cryptocurrency collided with a key support point in yesterday&#x2019;s session. Markets have consolidated Tuesday&#x2019;s losses, with the global crypto market cap up 0.7% as of writing this. Ethereum remained under the $1,700 level. Bitcoin Bitcoin (BTC) climbed marginally higher on Wednesday after the price bounced off a recent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T13:37:13.000Z",
    "title": "Sam Bankman-Fried’s trial begins with jury selection",
    "url": "https://www.cryptopolitan.com/sam-bankman-frieds-trial-jury-selection/",
    "description": "FTX founder Sam Bankman-Fried’s criminal trial has entered the jury selection phase, and it’s proven to be a challenging process. Jury selection is set to extend into a second day, with the initial pool of prospective jurors narrowed down to 50 candidates. From this group, 12 jurors will be selected to participate in the trial. ... <a title=\"Sam Bankman-Fried’s trial begins with jury selection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sam-bankman-frieds-trial-jury-selection/\" aria-label=\"More on Sam Bankman-Fried’s trial begins with jury selection\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T13:26:34.000Z",
    "title": "Arc Max Browser Revolutionizes Web Browsing with Seamless AI Integration",
    "url": "https://www.cryptopolitan.com/arc-max-browser-revolutionizes-web-browsing/",
    "description": "The digital landscape is undergoing a remarkable transformation as artificial intelligence (AI) finds its way into web browsers. The mere mention of AI in browsers often conjures images of predictive text and auto-suggestions. However, the reality unfolding in the Arc Max Browser by The Browser Company is far more sophisticated and user-centric. This innovative browser ... <a title=\"Arc Max Browser Revolutionizes Web Browsing with Seamless AI Integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arc-max-browser-revolutionizes-web-browsing/\" aria-label=\"More on Arc Max Browser Revolutionizes Web Browsing with Seamless AI Integration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T13:15:52.000Z",
    "title": "BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023",
    "url": "https://www.cryptopolitan.com/blk-dnm-releases-the-first-connected-fashion-garments-as-part-of-fw-2023/",
    "description": "New York, New York, October 4th, 2023, Chainwire BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023  72 leather jackets embedded with blockchain-enabled ‘digital garment IDs’ herald an era of intelligent, responsible fashion. The tech grants each item a unique identity for authentication, membership to BLK DNM Society and a ‘forever ... <a title=\"BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blk-dnm-releases-the-first-connected-fashion-garments-as-part-of-fw-2023/\" aria-label=\"More on BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T13:39:01.000Z",
    "title": "U.S. DOJ indicts eight Chinese firms for using crypto in fentanyl trade",
    "url": "https://crypto.news/u-s-doj-indicts-eight-chinese-firms-for-using-crypto-in-fentanyl-trade/",
    "description": "The DOJ unveiled eight indictments against Chinese firms for fentanyl distribution. They may have used crypto to hide their identities"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T13:21:45.000Z",
    "title": "South Korea to pilot wholesale CBDC with commercial banks",
    "url": "https://crypto.news/south-korea-to-pilot-wholesale-cbdc-with-commercial-banks/",
    "description": "The Bank of Korea (BOK) is partnering with the FSC and FSS to explore CBDC implementation"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T13:17:04.000Z",
    "title": "BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023",
    "url": "https://www.crypto-news-flash.com/blk-dnm-releases-the-first-connected-fashion-garments-as-part-of-fw-2023/?utm_source=rss&utm_medium=rss&utm_campaign=blk-dnm-releases-the-first-connected-fashion-garments-as-part-of-fw-2023",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/thumbnail_logo_pr_1696423391M7jmJK2V3z.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/thumbnail_logo_pr_1696423391M7jmJK2V3z.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/thumbnail_logo_pr_1696423391M7jmJK2V3z-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/thumbnail_logo_pr_1696423391M7jmJK2V3z-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/thumbnail_logo_pr_1696423391M7jmJK2V3z-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />New York, New York, October 4th, 2023, Chainwire BLK DNM releases the first ‘connected fashion’ garments as part of FW 2023  72 leather jackets embedded with blockchain-enabled ‘digital garment IDs’ herald an era of intelligent, responsible fashion. The tech grants each item a unique identity for authentication, membership to BLK DNM Society and a ‘forever [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T13:15:32.000Z",
    "title": "Bullish on Solana: The Altcoin of the Year Registers Remarkable Inflows",
    "url": "https://www.crypto-news-flash.com/bullish-on-solana-the-altcoin-of-the-year-registers-remarkable-inflows/?utm_source=rss&utm_medium=rss&utm_campaign=bullish-on-solana-the-altcoin-of-the-year-registers-remarkable-inflows",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-02T171842.284.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-02T171842.284.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-02T171842.284-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana maintains its stellar growth with $5 million in inflows, marking 27 weeks of positive activity in 2023. Ethereum faces its seventh week of outflows, underlining its diminishing popularity in the altcoin realm. Solana Outshines Peers as Investor Favorite In the constantly shifting tides of the cryptocurrency market, Solana has firmly established itself as a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T13:22:00.000Z",
    "title": "SEC Could Label “Pokemon Cards” as Securities, Coinbase CLO",
    "url": "https://coinedition.com/sec-could-label-pokemon-cards-as-securities-coinbase-clo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Today_Coinbase_received_a_Wells_notice_from_the_SEC_focused_on_staking-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, Coinbase Chief Legal Officer, Paul Grewal posted on X (formerly Twitter) that the US  SEC responded to Coinbase&#8217;s motion to dismiss and restated its stance that certain cryptocurrencies featured on the Coinbase platform qualified as investment contracts under the Howey Test, making them subject to SEC registration. According to Grewal, the SEC repeatedly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-could-label-pokemon-cards-as-securities-coinbase-clo/\">SEC Could Label “Pokemon Cards” as Securities, Coinbase CLO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T13:17:06.000Z",
    "title": "Avalanche (AVAX) Price Prediction 2023-2030: Will AVAX reach $30 Soon?",
    "url": "https://coinedition.com/avalanche-avax-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Avalanche-AVAX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Avalanche (AVAX) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Avalanche-AVAX.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Avalanche-AVAX-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Avalanche-AVAX-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Avalanche-AVAX-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Avalanche-AVAX-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Avalanche Blockchain is a layer one blockchain and is considered one of the most cost-effective and eco-friendly blockchains in the crypto and blockchain industry. AVAX is the native token of the Avalanche blockchain. AVAX can be used as a utility token within the Avalanche ecosystem. As one of the top-rated altcoins, AVAX investors are still [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/avalanche-avax-price-prediction/\">Avalanche (AVAX) Price Prediction 2023-2030: Will AVAX reach $30 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]