[
  {
    "source": "NewsBTC",
    "date": "2024-03-08T04:00:54.000Z",
    "title": "INJ Price Soars 13% As Injective Unveils ‘inEVM,’ Ethereum And Solana Integration Expected",
    "url": "https://www.newsbtc.com/injective/inj-price-soars-13-as-injective-unveils-inevm-ethereum-and-solana-integration-expected/",
    "description": "In a recent announcement, Layer 2 (L2) protocol Injective (INJ) has reached a major milestone with the launch of its inEVM Layer 2 rollup solution on the mainnet. This technology introduces an Ethereum Virtual Machine (EVM) environment to the Injective ecosystem, opening up new prospects for developers and blockchain interoperability. By integrating with Ethereum (ETH), Cosmos (ATOM), and Solana (SOL), inEVM establishes a multi-chain ecosystem that combines the advantages of different virtual machine environments. inEVM For Ethereum, Cosmos, And Solana According to the March 7 announcement, InEVM, which stands for inEVM Layer 2 rollup solution, allows developers to build applications using the Ethereum programming language Solidity within Injective&#8217;s platform. This technology connects different blockchain networks by achieving composability across Cosmos and Solana. InEVM leverages Caldera as the rollup provider, Hyperlane as the messaging layer, LayerZero for data and asset transfer, Celestia as the Data Availability (DA) layer, and Pyth as the Oracle provider. These collaborations were reportedly designed to ensure a “secure and robust” environment for developers to deploy their projects. Related Reading: Total ETH Burned Crosses 1.5 Million Ahead Of Ethereum Dencun Upgrade Furthermore, by incorporating inEVM, Injective will enable Ethereum developers to onboard onto its platform while retaining compatibility with the broader blockchain space.  As announced, developers can now take advantage of Injective&#8217;s benefits, including the protocol’s transaction speeds, near-zero fees, and access to the Inter-Blockchain Communication (IBC) network. The protocol also claims that InEVM will serve as a sandbox for developers to become familiar with the broader Injective ecosystem, providing a bridge between Ethereum&#8217;s EVM world and Injective&#8217;s WebAssembly (WASM) backbone. TimeSwap And Thetanauts Make Waves In Injective Platform Another key feature of Injective&#8217;s inEVM is its stated integration with Caldera, Hyperlane, LayerZero, Celestia, and Pyth, ensuring compatibility with existing smart contract standards, infrastructure, and oracles.  This integration aims to facilitate interoperability and collaboration across virtual machine environments, paving the way for a “unified blockchain ecosystem.”  The release states that developers will also benefit from the ability to create synergies and leverage the strengths of Ethereum, Cosmos, and Solana while maintaining true composability and interoperability. Related Reading: Dogecoin Accumulation: DOGE Millionaires Have Shot Up By 76% Lastly, the protocol has announced that several projects have already adopted inEVM and deployed on the Injective platform. Notable among them is the TimeSwap lending protocol, which has raised significant funding of over $200 million from investors, including Polychain Capital, Delphi Digital, and Bain Capital Crypto. In addition, Thetanauts, an on-chain options protocol, has also chosen to build on the inEVM. Currently, Injective&#8217;s native token INJ has seen a notable uptick in price after stagnating and dropping 3% over the past seven days. Currently, INJ is trading at $43.20, up over 13% on announcing the launch of Injective&#8217;s inEVM.  This marks the continuation of the token&#8217;s upward trend registered over the rest of the time frames. The token recorded a tremendous surge of over 1240% year-to-date, 37% in the past 30 days, and 23% in the past fourteen days, which led the token to reach its current all-time high (ATH) of $46 on March 2nd. Featured image from Shutterstock, chart from TradingView.com"
  }
]