[
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T08:17:47.000Z",
    "title": "Bitcoin 'death cross' sees BTC price dip $1K erasing Uptober gains",
    "url": "https://cointelegraph.com/news/bitcoin-death-cross-btc-price-dip-uptober",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/1ab0b732-1924-462d-9046-c398653248ae.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price erases all its month-to-date gains with Bitcoin traders predicting that $27,000 will not stay around long.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) broke lower on Oct. 11 as $27,000 saw its first real test since the start of the month.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/aede7410-f1ba-422f-b6c8-a4b7d3aa5d90.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>BTC price battles for support after daily \"death cross\"</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked increasing overnight BTC price weakness, including a trip to $26,978 on Bitstamp.</p><p>Bitcoin thus came full circle for October, <a href=\"https://cointelegraph.com/news/war-cpi-28k-btc-price-5-things-bitcoin-week\">erasing all of the gains</a> seen after the September monthly close.</p><p>Analyzing intraday performance, popular trader Skew noted the interplay between two moving averages (MAs), along with a so-called “death cross.”</p><p>In March, he noted the 100-day MA crossed above the 200-day counterpart — a “golden cross” event that traditionally marks upside to come.</p><p>“Here we technically just had the death cross, so if we head lower kinda leaning towards a squeeze eventually to test 200D MA again before trending,” part of X commentary <a href=\"https://twitter.com/52kskew/status/1711974777840439576/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">read</a>.</p><p>The daily chart shows the 200-day MA acting as stiff resistance for BTC/USD despite its early “Uptober” gains. Since the death cross confirmed on Oct. 9, the pair has lost almost $1,000, or 3.4%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ce9871d4-9deb-4a2c-a4af-7c5f4ded9af0.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart with 100, 200 MA. Source: TradingView</em></figcaption></figure><p>On shorter timeframes, Skew highlighted $27,300 and $26,800 as key levels.</p><p>“Bears have price control here with loss of 4H EMA trend, if price recovers above $27.3K I will see that as strength,” he wrote.</p><blockquote>“More importantly any recovery needs to be spot driven from here imo, wont rule out a squeeze. Below $26.8K this will look weak to me.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> 4H<br>Bears have price control here with loss of 4H EMA trend <br><br>if price recovers above $27.3K I will see that as strength<br><br>More importantly any recovery needs to be spot driven from here imo, wont rule out a squeeze. <br><br>Below $26.8K this will look weak to me <a href=\"https://t.co/ymFr8bYtyf\">https://t.co/ymFr8bYtyf</a> <a href=\"https://t.co/HvxZnN4SrI\">pic.twitter.com/HvxZnN4SrI</a></p>&mdash; Skew Δ (@52kskew) <a href=\"https://twitter.com/52kskew/status/1711973271842046357?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fellow trader Crypto Tony revealed that he was already short BTC, having triggered the change as Bitcoin dropped below $27,200.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> / <a href=\"https://twitter.com/search?q=%24USD&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USD</a> - Update <br><br>Lost the support zone overnight, so as per the plan i will be shorting this down while below the $27,200 level <a href=\"https://t.co/dorNjbXObD\">pic.twitter.com/dorNjbXObD</a></p>&mdash; Crypto Tony (@CryptoTony__) <a href=\"https://twitter.com/CryptoTony__/status/1711996552665833510?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Popular trader Jelle meanwhile agreed that either a recovery or breakdown would result from current levels at $27,000, noting that “the untapped liquidity has been taken out.”</p><p>“Would have expected a more immediate buyback — this suggests the market wants to traverse lower,” part of his latest commentary <a href=\"https://twitter.com/CryptoJelleNL/status/1711989522794172708\" target=\"_blank\" rel=\"noopener nofollow\">added</a>.</p><h2>Will Bitcoin print pre-halving \"macro low?\"</h2><p>Current BTC price behavior further fueled conservative views of how Bitcoin might develop in the months to come.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-46k-2024-halving-interview-filbfilb\">Bitcoin price can hit $46K by 2024 halving — Interview with Filbfilb</a></em></strong></p><p>Among those maintaining significantly lower levels — including <a href=\"https://cointelegraph.com/news/bitcoin-analysts-predicting-btc-price-crash-20k\">a return to $20,000</a> — as a possibility was popular trader and analyst Rekt Capital.</p><p>After eyeing a potential long-term breakdown from the July highs, Rekt Capital reiterated that the BTC/USD weekly chart so far lacked a macro higher low versus late-2022.</p><p>An <a href=\"https://twitter.com/rektcapital/status/1704810644980031604/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">accompanying chart</a> gave a target for this at around $20,000 as part of the build-up to Bitcoin’s next <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">block subsidy halving</a> event in April 2024.</p><p>Should a macro low hit, Bitcoin would be copying behavior from last cycle’s pre-halving year, 2019, it showed.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/82417a82-9335-47bf-a4b7-a5d84e94be22.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T08:11:25.000Z",
    "title": "Central Bank of Nigeria: eNaira no threat to financial stability ",
    "url": "https://cointelegraph.com/news/cbdc-central-bank-nigeria-e-naira-no-threat-financial-stability",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ff7e04d5-5b3b-4aaf-897f-f6b5bf131195.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Nigeria's central bank issued a press release in response to “news items on some media platforms,” suggesting that the eNaira threatens Nigeria’s financial stability.</p>\n                    <p><p>The Central Bank of Nigeria (CBN) had to publicly insist that their project, one of the world’s first operating central bank digital currencies (CBDC), doesn’t threaten the country's financial stability. </p><p>The press release from the CBN <a href=\"https://www.cbn.gov.ng/Out/2023/CCD/CBN%20Press%20Release%20%20eNaira%20(091023).pdf\" target=\"_blank\" rel=\"noopener nofollow\">came</a> out on Oct. 9 in response to “news items on some media platforms,” suggesting that the eNaira threatens Nigeria’s financial stability. Some news pieces — for example, the one <a href=\"https://punchng.com/enaira-threat-to-financial-stability-cbn-report/\" target=\"_blank\" rel=\"noopener nofollow\">published</a> in a daily Nigerian newspaper, Punch, point to the CBN’s recently released report called “Economics of Digital Currencies: A Book of Readings.” </p><p>In this report, CBN experts highlight the gradual rise of eNaira adoption, marked by 0.2% share if compared to Nigerian banks’ liquidity. They also admit the simple fact that the funds held by citizens in the eNaira wallets can’t be used by commercial banks. The very hypothetical threat that could arise from this observation is the lack of liquidity suffered by the banks in the case of total adoption of eNaira. However, such fear is one of the <a href=\"https://cointelegraph.com/news/existential-threat-why-some-banks-are-anxious-about-cbdcs\">fundamental theoretical aspects</a> of the discussion about any CBDC. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/india-tops-chainalysis-2023-global-crypto-adoption-index\"><strong><em>India, Nigeria, Thailand top Chainalysis’ 2023 Global Crypto Adoption Index</em></strong></a></p><p>In its release, CBN doesn’t do much explaining, limiting itself to a plain rejection of the claims in the media and referring to the “in-depth understanding of CBDCs” ingrained in its report:</p><blockquote>“The eNaira structure continues to evolve and undergo modifications targeted at improving the user experience across all interfaces. We encourage Nigerians to embrace the technology for, amongst other things, greater financial inclusion.”</blockquote><p>A recent global survey featuring respondents from 15 countries indicates that <a href=\"https://cointelegraph.com/news/99-of-nigerians-are-crypto-aware-consensys-report\">Nigeria has the most cryptocurrency-aware population</a> in the world. According to a joint study by ConsenSys and YouGov, 99% of Nigerians are more knowledgeable about Web3 than people in major economies like the United Kingdom, the United States, Japan and Germany.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-11T08:12:27.000Z",
    "title": "FTX fallen founder Sam Bankman-Fried wanted to shutdown Alameda before bankruptcy",
    "url": "https://cryptoslate.com/ftx-fallen-founder-sam-bankman-fried-reportedly-wanted-to-shutdown-alameda-before-bankruptcy/",
    "description": "<p>Embattled FTX founder Sam Bankman-Fried (SBF) wanted to close down his other company, Alameda Research, according to an unpublished post revealed at his ongoing fraud trial. In the extensive post shared on X by a former Alameda employee, SBF described Alameda as one of his &#8220;largest successes–and then, briefly, largest failures–and then again successes.&#8221; However, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-fallen-founder-sam-bankman-fried-reportedly-wanted-to-shutdown-alameda-before-bankruptcy/\">FTX fallen founder Sam Bankman-Fried wanted to shutdown Alameda before bankruptcy</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T08:30:07.000Z",
    "title": "Binance CEO Changpeng Zhao Shares Thoughts on Bitcoin Halving",
    "url": "https://news.bitcoin.com/binance-ceo-changpeng-zhao-shares-thoughts-on-bitcoin-halving/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance CEO Changpeng Zhao Shares Thoughts on Bitcoin Halving\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1498789409.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Changpeng &#8220;CZ&#8221; Zhao, founder and CEO of Binance, has shared his thoughts on the upcoming Bitcoin halving. Using Binance Feed, the X-like social feed of the exchange, Zhao explained that Bitcoin prices won&#8217;t double immediately after the halving and that new all-time high (ATH) prices will only happen a year after this event. Binance CEO [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T08:36:42.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T08:13:23.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How much is ADA ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T08:30:31.000Z",
    "title": "No Love For FTX: Ex-Girlfriend Delivers Scathing Testimony Against Sam Bankman-Fried",
    "url": "https://www.newsbtc.com/ftx/ftx-sam-bankman-fried/",
    "description": "The trial of the former CEO of the defunct crypto exchange FTX, Sam Bankman-Fried (SBF), resumed on October 10. As expected, the prosecution called Alameda Research’s ex-CEO and SBF’s ex-girlfriend, Caroline Ellison, to testify against the defendant.    Ellison Does More Damage To Sam Bankman-Fried Defense According to a thread on the X (formerly Twitter) platform by Inner City Press, which was present at the trial, Ellison confirmed what was already known as she stated that she and the defendant dated for a couple of years with their on-and-off relationship, beginning in the summer of 2020.  Related Reading: Crypto Analyst Identifies 6 Overlooked Altcoins That Could Be Due For A Price Surge However, any affection or feelings that she may have had for the defendant didn’t seem to hinder her as she lived up to the hype as the prosecution’s star witness, providing key insights into how Sam Bankman-Fried allegedly misappropriated FTX’s customers&#8217; funds through Alameda which she headed before its collapse.  During her testimony, she admitted that she had committed fraud alongside the defendant. Specifically, she stated that Sam Bankman-Fried directed her to commit these crimes. As to her involvement, she collaborated Wang’s testimony while stating Alameda (and her, by extension) took “several billions of dollars” from FTX customers and used these monies for investments.  Meanwhile, Ellison confirmed that Sam Bankman-Fried was the one who set up the systems and directed the trading firm to take the money. Besides using FTX’s customers’ funds for investments, Alameda also took around $14 million to repay its lenders. She also manipulated Alameda’s balance sheets, making the firm look risky to potential lenders.  FTT Token continues downtrend following Ellison's testimony &#124; Source: FTTUSDT on Tradingview.com Prosecution Uses Ellison To Drive Home Major Allegations In its opening statement, the Prosecution alleged that Sam Bankman-Fried diverted customers’ fiat deposits to a bank account linked to Alameda, which Ellison confirmed on the stand. She stated that FTX received money into Alameda’s bank accounts between 2021 and 2022. The total sum deposited was between 10-20 billion dollars.  Alameda used some of these deposits to repay loans, investments, and stablecoin conversions like USDC. According to her, this summed up to about $2 billion. It didn’t stop there, though, as the trading firm used the other money for other Alameda-related purposes. Sam Bankman-Fried and his lawyers have, at different times, tried to lay a foundation that SBF wasn’t in charge of Alameda and didn’t know what was going on at the trading firm after he stepped down as the CEO. Related Reading: XRP Price Gearing Up For Rebound As Whales Make Their Move However, Ellison rebutted this on the stand as she stated that things didn&#8217;t change much, even when she became the co-CEO alongside Sam Trabucco, as she checked everything with Sam Bankman-Fried and directly reported to him. He also had the power to fire her.  Wire fraud on lenders to Alameda Research and conspiracy to commit wire fraud on lenders to Alameda Research is part of the seven charges brought against SBF. As such, Ellison’s testimony is deemed critical (as someone with first-hand knowledge) in the prosecution’s bid to prove these crimes beyond reasonable doubt.  Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T08:36:10.000Z",
    "title": "BRICS Unveils Ambitious Plan to Abandon US Dollar Within 3 Years and Switch to Bitcoin (BTC)",
    "url": "https://www.crypto-news-flash.com/brics-unveils-ambitious-plan-to-abandon-us-dollar-within-3-years-and-switch-to-bitcoin-btc/?utm_source=rss&utm_medium=rss&utm_campaign=brics-unveils-ambitious-plan-to-abandon-us-dollar-within-3-years-and-switch-to-bitcoin-btc",
    "description": "<img width=\"940\" height=\"530\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BRICS\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png 940w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-768x433.png 768w\" sizes=\"(max-width: 940px) 100vw, 940px\" />BRICS Bank, also called New Development Bank (NDB) has launched a 3 years plan to completely move away from the US dollar. Many crypto enthusiasts are campaigning for the adoption of Bitcoin as a BRICS currency.  CNF has on multiple occasions covered the decision of the BRICS to switch from the US Dollar to a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T08:30:16.000Z",
    "title": "Unlocking Bitcoin’s Hidden Treasure: 44% of Returns After Halving Events",
    "url": "https://www.crypto-news-flash.com/unlocking-bitcoins-hidden-treasure-44-of-returns-after-halving-events/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-bitcoins-hidden-treasure-44-of-returns-after-halving-events",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JpMorgan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Based on a four-year Bitcoin cycle that is marked by the halving event, crypto experts believe the top coin will rally beyond its ATH within twelve months after April 25 next year. On-chain data compiled by market intelligence platform Santiment shows mid to large-sized wallets have gained steam in accumulation by adding about 71,155 BTCs [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-11T08:14:30.000Z",
    "title": "WHY Crypto Whales Are Buying These 3 Altcoins!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-crypto-whales-are-buying-these-3-altcoins/",
    "description": "<p>Hey there! I’m going to start by sending out love to all our followers in Israel. It’s been a tough couple of days, and we’re here for you guys. Now back to crypto. A lot of important macroeconomic events took place in September, including the Fed rate pause. And the approval of the Ethereum Futures [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-crypto-whales-are-buying-these-3-altcoins/\">WHY Crypto Whales Are Buying These 3 Altcoins!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-11T08:22:00.000Z",
    "title": "Binance CEO Reacts to UAE’s New Metaverse Initiative",
    "url": "https://coinedition.com/binance-ceo-reacts-to-uaes-new-metaverse-initiative/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BINANCE-CEO-8 (1)\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-8-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The United Arab Emirates has introduced a new governance framework aimed at ensuring the ethical growth of the metaverse. The UAE Minister of State for Digital Economy, A.I., and Remote Work Applications, Omar Sultan Al Olama, announced the launch of the “Responsible Metaverse Self-Governance Framework” white paper. Developed together with Dubai&#8217;s Department of Economics, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-ceo-reacts-to-uaes-new-metaverse-initiative/\">Binance CEO Reacts to UAE’s New Metaverse Initiative</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]