[
  {
    "source": "Decrypt",
    "date": "2023-12-29T18:44:01.000Z",
    "title": "Bitcoin Token ORDI Surges to New High, Nearing Top 50 Coins",
    "url": "https://decrypt.co/211185/bitcoin-token-ordi-surges-new-high-nearing-top-50-coins",
    "description": "The price of ORDI, the biggest token minted on the Bitcoin network, is surging again today—and is one of this week's best-performers."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T19:03:19.000Z",
    "title": " Compound Finance&#039;s X account hacked and has posted a scam link ",
    "url": "https://cointelegraph.com/news/compound-finance-x-twitter-account-hacked-posted-scam-link",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNTcxNWQ4MjAtMWYyNC00ZThmLWJhMjktYTc2MzNlZGEwOGI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Security experts have declared that the Compound Finance X page has been hacked after it started promoting what appears to be a phishing site.</p>\n                    <p><p>The X (formerly Twitter) account for DeFi protocol Compound Finance has been hacked and is now promoting a fake phishing site, according to security-related X accounts Scam Sniffer and Officer's Notes. </p><p>At 4:57 p.m. UTC, the account posted an advertisement for \"free $COMP tokens,\" urging readers to click a link provided. The link leads to compound-labs.xyz, a website that looks identical to the protocol's official website at compound.finance, but has been identified as a scam site.</p><p>Cybersecurity blogger Officer's Notes posted an alert from their account at 5:14 UTC, urging readers to not click on any links in the post.</p><p><a href=\"https://cointelegraph.com/news/compound-finance-x-twitter-account-hacked-posted-scam-link\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-29T18:55:11.000Z",
    "title": "Bitfinex predicts crypto market cap will double to over $3T as it continues global expansion efforts",
    "url": "https://cryptoslate.com/bitfinex-predicts-bitcoin-and-crypto-market-cap-will-double-to-over-3t-as-it-continues-global-expansion-efforts/",
    "description": "<p>Bitfinex predicts the total market capitalization of the cryptocurrency market, currently at approximately $1.6 trillion, is poised to double — potentially reaching a staggering $3.2 trillion, according to its year-end Alpha report. Despite the challenges faced in 2023, including regulatory hurdles and reputation concerns, the company remains optimistic about the resilience and potential growth of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitfinex-predicts-bitcoin-and-crypto-market-cap-will-double-to-over-3t-as-it-continues-global-expansion-efforts/\">Bitfinex predicts crypto market cap will double to over $3T as it continues global expansion efforts</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T19:02:03.000Z",
    "title": "Coinbase appoints new head of custody amid Bitcoin ETF preparations",
    "url": "https://crypto.news/coinbase-appoints-new-head-of-custody-amid-bitcoin-etf-preparations/",
    "description": "Coinbase has changed its head of custody, potentially as a strategic decision for handling services related to spot Bitcoin ETFs."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T19:00:48.000Z",
    "title": "Want To Predict Bitcoin Tops And Bottoms? ‘The Rainbow Chart’ Is For You",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-the-rainbow-chart/",
    "description": "The Bitcoin Rainbow Chart has emerged as a universally used analytics tool that helps crypto investors and traders predict BTC&#8217;s ever-changing market trends and cycles.  Bitcoin Rainbow Chart BTC Analysis Throughout the year, the price of Bitcoin has experienced several uptrends and downsides. Starting from the last three months of 2023, BTC&#8217;S price has experienced a major surge, hitting above $35,000 in October and surging past $44,000 in December.  Related Reading: Here’s The Reason The Solana Price Fell 8% To $98 With the market moving up rapidly, many crypto investors and market watchers look for various crypto analytics tools to enhance their understanding of the Bitcoin market trends.  The Bitcoin Rainbow Chart is one of the many analytics tools available for predicting the potential prices of BTC. This color-coded chart is a long-term valuation tool for BTC that uses a logarithmic growth curve to forecast the potential price of BTC.  Source: Blockchain Center Currently, according to the rainbow chart, Bitcoin is positioned around the “Accumulate” and “Still cheap” zones. This implies that the chart is showing the best timeline to purchase BTC before the selling phase begins.  The Bitcoin Rainbow Chart simplifies BTC price predictions, helping investors identify potential BTC buying and selling opportunities. However, it’s important to note that the Bitcoin Rainbow Chart is not investment advice and does not predict the exact price of Bitcoin.  BTC price readies to retest $43,000 &#124; Source: BTCUSD On Tradingview.com History Of The BTC Rainbow Chart The Bitcoin Rainbow Chart first started as a fun project created by a Reddit user, Azop to visually represent Bitcoin’s price history. However, the chart became more mainstream after a second version was developed by trader Trololo and transformed into a crypto technical analysis tool.  The chart is designed using a color coding scheme and highlights each Bitcoin halving cycle and diverse BTC price ranges. With its seven color bands, the rainbow chart identifies strategic points to buy, sell, or hold BTC.  Related Reading: XRP Price Surge: ‘Dumb Money’ Will Miss Out, Analyst Cautions The dark red band signals a maximum bubble territory, the red band indicates a robust selling phase, while orange and yellow signify FOMO intensification and HODL periods respectively. The Green band indicates a favorable buying and accumulation window and lastly, the blue color band represents a fire sale opportunity.  While the Bitcoin Rainbow Chart does not provide financial advice, it is a widely recognized tool used by crypto traders and investors to gain a simpler understanding of BTC market movements. Ultimately, the accuracy of the chart’s predictions depends on how it is applied and in what context.  Featured image from Crypto.com, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-29T19:05:52.000Z",
    "title": "Bitcoin Ordinals Token That’s Skyrocketed Over 22x in Three Months ‘Gearing for Another Leg’ Up, Says Trader",
    "url": "https://dailyhodl.com/2023/12/29/bitcoin-ordinals-token-thats-skyrocketed-over-22x-in-three-months-gearing-for-another-leg-up-says-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Investor-Who-Called-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes that one red-hot altcoin in the Bitcoin (BTC) ecosystem is primed for another big move up. Pseudonymous analyst Altcoin Sherpa tells his 202,400 followers on the social media platform X that he remains bullish on Ordinals (ORDI), a project that aims to add value to each Satoshi, the smallest [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/29/bitcoin-ordinals-token-thats-skyrocketed-over-22x-in-three-months-gearing-for-another-leg-up-says-trader/\">Bitcoin Ordinals Token That’s Skyrocketed Over 22x in Three Months ‘Gearing for Another Leg’ Up, Says Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]