[
  {
    "source": "CoinDesk",
    "date": "2024-04-03T19:29:43.000Z",
    "title": "The Protocol: Using the Money Printer",
    "url": "https://www.coindesk.com/tech/2024/04/03/the-protocol-using-the-money-printer/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If you have the money printer – as is the case for many of the blockchain projects with the power to create their own digital tokens – why wouldn't you use it? PLUS: Vitalik Buterin riffs on meme coin and Ethereum's new \"blob market.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T19:32:16.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Meta, formerly Facebook, has lost $40 billion on its metaverse division since 2021. The founder of a security firm warns that phishing attacks are becoming increasingly sophisticated despite fewer incidents. Meanwhile, a faulty smart contract has locked up $24 million worth of Lido-staked Solana. </p><p>Since rebranding from Facebook to Meta in 2021, the Mark Zuckerberg-led company has <a href=\"https://cointelegraph.com/news/meta-metaverse-lab-lost-40-b-since-facebook-changed-its-name-in-2021\">booked $40 billion in losses</a> tied to its metaverse division.</p><p>Although Meta posted impressive revenues of $134.9 billion in 2023, a closer look at its financials reveals troubling signs for Reality Labs — the division responsible for products such as the Quest VR headset. The financials show successive year-over-year declines since 2021.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T19:18:26.000Z",
    "title": " Bitcoin miner Sphere 3D refutes Gryphon’s claims of financial doubts: &#039;Disingenuous&#039; ",
    "url": "https://cointelegraph.com/news/bitcoin-miner-sphere-3d-refutes-gryphon-claims-financial-doubts-disingenuous",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYjkxYTEwNmYtZDlhOS00YTUwLTkzNTMtMDY1ZGE5NjU1MWJlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Sphere 3D has denied reports of financial troubles by its former partner Gryphon Digital Mining, following the escalation of litigation between the Bitcoin miners.</p>\n                    <p><p>Bitcoin miner Sphere 3D has denied reports of financial troubles, claiming that accusations from its former partner Gryphon Digital Mining are “at best disingenuous.”</p><p>In a court document shared with Cointelegraph, Sphere 3D refuted accusations made a few days earlier by Gryphon to the United States District Court for the Southern District of New York, requesting a block on millions of dollars on grounds that Sphere was on the “verge of economic collapse.”</p><p>On March 25, Gryphon <a href=\"https://cointelegraph.com/news/sphere3d-legal-escalate-gryphon-seeks-block-10m\">requested court permission to file a motion seeking to secure $10 million</a> in equity proceeds that Sphere recently received from a settlement related to Core Scientific’s bankruptcy exit. According to Gryphon, the move was necessary since Sphere could not pay roughly $30 million in future breach of contract judgments.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-miner-sphere-3d-refutes-gryphon-claims-financial-doubts-disingenuous\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-03T19:12:47.000Z",
    "title": "Meme coins skyrocket with record-breaking Q1 returns: CoinGecko",
    "url": "https://cryptobriefing.com/memecoin-returns-q1-surge/",
    "description": "Discover how memecoins led the crypto market with unprecedented Q1 returns, significantly outperforming RWA, AI, and Layer 2 narratives."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-03T19:20:21.000Z",
    "title": "LBank Labs Invests in Interop Ventures to Champion the Interchain Economy",
    "url": "https://cryptodaily.co.uk/2024/04/lbank-labs-invests-in-interop-ventures-to-champion-the-interchain-economy",
    "description": "LBank Labs Invests in Interop Ventures to Champion the Interchain Economy"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-03T19:19:00.000Z",
    "title": "C3 is Live on Solana, Rewards Users With 1M $PYTH",
    "url": "https://cryptodaily.co.uk/2024/04/c3-is-live-on-solana-rewards-users-with-1m-pyth",
    "description": "C3 is Live on Solana, Rewards Users With 1M $PYTH"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-04-03T19:36:32.000Z",
    "title": "W Token’s Rollercoaster Day: From $1.25 Low to $1.66 All-Time High",
    "url": "https://news.bitcoin.com/w-tokens-rollercoaster-day-from-1-25-low-to-1-66-all-time-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"W Token&#039;s Rollercoaster Day: From $1.25 Low to $1.66 All-Time High\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/ddssa.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following Ethena’s ENA airdrop, the community has shifted its focus on Wormhole’s airdrop W, which has been listed on various centralized exchange platforms and coin market cap aggregators. The new token known as W has seen an extremely volatile day with the price tapping an all-time high at $1.66 per coin. Wormhole&#8217;s New Airdrop W [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T19:29:54.000Z",
    "title": "Federal Reserve doubles down on bullish outlook for U.S. economy",
    "url": "https://www.cryptopolitan.com/fed-doubles-down-bullishness-for-us-economy/",
    "description": "The Federal Reserve isn&#8217;t playing games when it talks about the U.S. economy. With perhaps way too much confidence, it&#8217;s talking about an enduring strength in economic activity. The message is loud and clear. Don&#8217;t expect the cost of borrowing money to get cheaper anytime soon. Loretta Mester of the Cleveland Federal Reserve and someone [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T19:29:30.000Z",
    "title": "Arbitrum Price Prediction 2024 – 2033: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2024 – 2033 Arbitrum launched with great hype in the crypto market as it promised and delivered low transaction fees and faster settlement times on the Ethereum network. ARB is its native token used for governance. However, transaction fees are settled in Ether. So, what are the predictions for Arbitrum? How much [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T19:13:44.000Z",
    "title": "US and EU Utilize AI in Search for Alternatives to “Forever Chemicals” in Semiconductor Manufacturing",
    "url": "https://www.cryptopolitan.com/us-and-eu-utilize-ai-in-search/",
    "description": "In a significant move toward addressing environmental concerns and enhancing supply chain security, the United States and the European Union are set to leverage artificial intelligence (AI) in the quest for substitutes for persistent per- and polyfluorinated substances (PFAS) in semiconductor production. The decision was revealed in a draft statement seen by Bloomberg, emanating from [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T19:30:17.000Z",
    "title": "Bitcoin Traders No Longer Extremely Greedy: Rebound Signal?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-traders-no-extremely-greedy-rebound-signal/",
    "description": "Data shows that Bitcoin investor sentiment has cooled to the lowest level since February, something that could facilitate a rebound in the price. Bitcoin Fear &#38; Greed Index Now Points At Just &#8216;Greed&#8217; The &#8220;Fear &#38; Greed Index&#8221; is an indicator created by Alternative that tells us about the general sentiment among investors in the Bitcoin and broader cryptocurrency sector. This metric uses a numeric scale from zero to hundred to represent the sentiment. To calculate the score, the index considers the data of five factors: volatility, trading volume, social media sentiment, market cap dominance, and Google Trends. Related Reading: Bitcoin Supply In Loss Hits 10% After Crash: What Happened Last Time All values of the indicator above the 53 mark suggest the presence of greed among the investors, while below the 47 level implies a fearful market. The region between these two corresponds to the neutral sentiment. Here is how the latest value of the Bitcoin Fear &#38; Greed Index looks: The value of the index appears to be 71 at the moment &#124; Source: Alternative As is visible above, the Bitcoin Fear &#38; Greed Index currently has a value of 71, implying that the investors share a majority sentiment of greed. Just yesterday, the index&#8217;s value had been notably higher than this, implying that there has been a bit of a cooldown of sentiment in the past 24 hours. Below is a chart that shows the trend in the index over the past year. The value of the indicator seems to have registered a plunge recently &#124; Source: Alternative Besides the three core sentiments, there are also two &#8220;extreme&#8221; sentiments: extreme greed and extreme fear. The former occurs at values above 75, while the latter occurs under 25. The Bitcoin Fear &#38; Greed Index was 79 yesterday, implying that the market had been extremely greedy. The indicator has been regularly inside this zone for the past month, so the current normal greed values go against the trend. The sentiment among investors has naturally been so high recently because the BTC price has gone through a sharp rally in this period and has explored fresh all-time highs (ATHs). The Bitcoin price has historically tended to go against the majority&#8217;s expectations. And the stronger this expectation has been, the more likely such a contrary move will occur. Due to this reason, the extreme sentiments have been where reversals in the asset have been the most probable to take place in the past. For instance, the current ATH of the asset formed when the index was at a value of 88. Related Reading: Bitcoin Traders Spread “Buy The Dip” As BTC Plunges Below $66,000 With the recent price drawdown, sentiment has also taken a hit. The fact that it has fallen out of the extreme greed zone, though, may be conducive to a bottom forming. The earlier bottom, around 20 March, also formed when the index exited the zone. The current level of the Bitcoin Fear &#38; Greed Index is not only lower than it was then but also the lowest since 11 February, when the asset was still trading around $48,000. BTC Price Bitcoin is now down to the $65,800 level after facing a drawdown of more than 7% over the last few days. Looks like the price of the asset has plunged to lows recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, Alternative.me, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-03T19:20:12.000Z",
    "title": "LBank Labs Invests in Interop Ventures to Champion the Interchain Economy",
    "url": "https://www.crypto-news-flash.com/lbank-labs-invests-in-interop-ventures-to-champion-the-interchain-economy/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-invests-in-interop-ventures-to-champion-the-interchain-economy",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/20240404-010010_1712163627wI0ScBxzQl.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/20240404-010010_1712163627wI0ScBxzQl.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/20240404-010010_1712163627wI0ScBxzQl-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/20240404-010010_1712163627wI0ScBxzQl-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/20240404-010010_1712163627wI0ScBxzQl-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/20240404-010010_1712163627wI0ScBxzQl-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Hong Kong, Hong Kong, April 3rd, 2024, Chainwire LBank Labs, a visionary blockchain venture fund with a successful track record in the crypto space, has announced a significant investment in Interop Ventures, an early stage venture fund supporting protocols and primitives embracing the vision of sovereign, interoperable, proof-of-stake blockchains. This strategic investment positions LBank Labs [...]"
  }
]