[
  {
    "source": "CoinDesk",
    "date": "2023-09-14T13:02:11.000Z",
    "title": "First Mover Americas: BTC Holds $26K; Hedera’s HBAR Jumps ",
    "url": "https://www.coindesk.com/markets/2023/09/14/first-mover-americas-btc-holds-26k-hederas-hbar-jumps/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Sept. 14, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-14T13:00:00.000Z",
    "title": "Lido’s Staked Ether Tokens Can Soon Be Used on Cosmos, IBC Blockchains",
    "url": "https://www.coindesk.com/tech/2023/09/14/lidos-staked-ether-tokens-can-soon-be-used-on-cosmos-ibc-blockchains/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lido is the leading provider of liquid-staking solutions and its staking token, stETH, has a $13.8 billion market capitalization."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T12:45:00.000Z",
    "title": "Wyoming stablecoin: Are state digital currencies even possible?",
    "url": "https://cointelegraph.com/news/wyoming-stablecoin-digital-currencies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9111d39b-f717-4a71-acb0-a38e721f5da5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Stable Token Commission continues researching the potential implementation of stable tokens in Wyoming. </p>\n                    <p><p>In July, the American state of Wyoming <a href=\"https://cointelegraph.com/news/stablecoin-wyoming-seeks-stable-token-commission-head-in-first-step-to-state-stablecoin\">shared an open job position</a> for the head of its Stable Token Commission. </p><p>The executive will work alongside Wyoming’s governor, state auditor, state treasurer and four expert appointees to bring the state’s very own stablecoin to life.</p><p>While Wyoming was the first to pass a law on a state stablecoin, it isn’t the only state considering launching its own digital currency. </p><p>In April, a similar initiative <a href=\"https://cointelegraph.com/news/texas-lawmakers-propose-a-gold-backed-state-digital-currency\">was proposed in Texas</a>, where lawmakers introduced bills for creating a state-based digital currency backed by gold.</p><p>However, the idea of state stablecoins raises many questions: How would they affect the monetary stability of fiat money and the power of the Federal Reserve? Could they be compatible with a central bank digital currency? Do people really want to return to a system with state banks printing their own monetary notes?</p><h2>The Wyoming experiment</h2><p>The Wyoming Stable Token Act was <a href=\"https://cointelegraph.com/news/wyoming-lawmakers-introduce-legislation-for-state-issued-stablecoin\">originally introduced in February 2022</a>, in the midst of the crypto market crisis. The bill defines the Wyoming stable token as a virtual currency representative of and redeemable for one U.S. dollar held in trust by the state of Wyoming. Basically, the state would tokenize the federal currency on a 1:1 ratio with deposits. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEWS--bipartisan group of top <a href=\"https://twitter.com/hashtag/Wyoming?src=hash&amp;ref_src=twsrc%5Etfw\">#Wyoming</a> legislators proposed a bill for State of Wyoming to issue a <a href=\"https://twitter.com/hashtag/stablecoin?src=hash&amp;ref_src=twsrc%5Etfw\">#stablecoin</a>, 100% backed by USTreasuries, where the State keeps the float. I see pros &amp; cons (didn&#39;t know it was coming) but❤️that Wyoming continues to explore cool <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> ideas! <a href=\"https://t.co/BXbELukUQE\">https://t.co/BXbELukUQE</a></p>&mdash; Caitlin Long ⚡️ (@CaitlinLong_) <a href=\"https://twitter.com/CaitlinLong_/status/1494427624453685248?ref_src=twsrc%5Etfw\">February 17, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Explaining why state lawmakers took such an interest in the digital token project, Chris Rothfuss, the minority leader in the Wyoming State Senate, told Cointelegraph:</p><blockquote>“Wyoming needs to be able to transact in a digital currency — to accept payments, to make payments, and to do so without risk. The Wyoming stable token is the solution to that challenge.”</blockquote><p>A notable reservation in Section 2 of the Stable Token Act makes the state’s attorney general responsible for monitoring the startup phase of the token’s issuance. Should the attorney general believe it contradicts federal or state law, the project would be frozen. </p><p>The bill also sets a deadline for the project: The commission’s director shall provide their report on the doability of the stable token no later than Nov. 1, 2023. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/privacy-cypherpunks-bitcoin-honeybadger\">Privacy prevails and cypherpunks write code at Baltic Honeybadger</a></em></strong></p><p>Other than that, the document doesn’t specify much; instead, it establishes the Stable Token Commission with the authority to craft further details.</p><p>The legislation’s path wasn’t easy. In March 2022, Governor Mark Gordon <a href=\"https://wyoleg.gov/2022/Veto/SF0106.pdf\" target=\"_blank\" rel=\"noopener nofollow\">vetoed</a> the bill, saying he was “unconvinced” that the state’s Treasury was ready to implement the project safely.</p><p>Gordon criticized the lack of information and the cost of accounting services, blockchain development and other necessary expenses, and he was skeptical of the project’s purported benefits. </p><p>A year later, the governor applauded the effort made by legislators to enhance the document, but voiced new reservations:</p><blockquote>“First and foremost, there was no overall plan (a ‘business plan’ for lack of a better term) or, if a plan exists, it did not appear to have been used to guide the legislators in crafting the legislation.” </blockquote><p>On March 22, 2023, the Stable Token Act was <a href=\"https://www.wyomingnews.com/wyomingbusinessreport/industry_news/banking_and_finance/wyoming-stable-token-act-passes-without-governor-s-signature/article_0375c1e0-c8fa-11ed-b6d0-f76fd905f185.html\" target=\"_blank\" rel=\"noopener nofollow\">passed</a> into law without Governor Gordon’s signature. Gordon recognized the state stable token’s potential to “nurture Wyoming’s reputation as a leader in the digital asset world” and deemed the improvements made by the bill’s authors enough to allow it to become law.</p><h2>The era of multiple stablecoins?</h2><p>Neither the U.S. Federal Reserve nor any crypto-focused legislators have reacted publicly to the Wyoming project, but it is hard to imagine any kind of affirmative response, given that the American dollar was established precisely to provide a countrywide monetary standard and bring the currency under the purview of the federal government.</p><p>So, in principle, any state token project could contradict the logic of central bank currency to a similar degree as private cryptocurrencies.</p><p>At the same time, the potential value of Wyoming’s stable token is rigorously tied to the same old American dollar, which makes it less of a separate currency and more of a state-issued financial asset, similar to the state-issued notes for specie of the 19th century. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/da336dc7-d297-40f1-b850-f486eedcf0ec.jpeg\"  /><figcaption style=\"text-align: center;\">A $40 note issued by the State Bank of Georgia in 1855. Source: Southern Style Currency</figcaption></figure><p>Rothfuss clarified, “We are not issuing a new currency. The Wyoming stable token is a digital representation of a U.S. dollar held in trust by the state of Wyoming on behalf of the tokenholder. We are not competing with the Federal Reserve — we are enabling a technology.”</p><p>Some observers still see a potential conflict between the states and the Fed. “Certainly, there will be a tussle between states and the federal government over the former attempting to issue their own stablecoins,” Brent Xu, CEO of Web3 bond-market platform Umee, told Cointelegraph. </p><p>But there could be a compromise in which the Federal Reserve allows states to issue stablecoins under a particular framework, he believes, noting the discussions concerning a <a href=\"https://cointelegraph.com/news/payment-stablecoins-keep-your-coins-act-pass-house-committee\">national framework for stablecoins</a>.</p><p>Zachary Townsend, CEO of Bitcoin-based life insurance provider Meanwhile, doesn’t see any potential problems with state stablecoins, as he believes that the very concept of a stablecoin is open to almost any entity, political or corporate, as the recent example with <a href=\"https://cointelegraph.com/news/paypal-new-stablecoin\">PayPal’s initiative has shown</a>. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\">Big Questions: What’s with all the crypto deaths? </a></em></strong></p><p>He told Cointelegraph, “There are going to be tons of private stablecoins. If I just looked at my life and all the companies I have ‘accounts’ or ‘wallets’ or ‘balances’ with, those are going to transform to become stablecoins within a few years.”</p><p>This is something Peter Herzog, state policy lead at the Crypto Council for Innovation, can agree with. “There are a variety of models for stablecoins that involve different decisions around underlying collateral, governance and more,” he explained to Cointelegraph. For Herzog, it comes as no surprise that individual states with an active interest in crypto are continuing their experiments with new initiatives:</p><blockquote>“Until we see a federal regulatory framework, it is likely that states continue to step in to create rules of the road to promote innovation and protect consumers.”</blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T13:04:17.000Z",
    "title": "Coinbase CEO Brian Armstrong questions CFTC jurisdiction over DeFi protocols",
    "url": "https://cryptoslate.com/coinbase-ceo-brian-armstrong-questions-cftc-jurisdiction-over-defi-protocols/",
    "description": "<p>Coinbase CEO Brian Armstrong urged the U.S. Commodity Futures Trading Commission (CFTC) against &#8220;creating enforcement actions against decentralized (DeFi) protocols&#8221; because &#8220;it&#8217;s highly unlikely the Commodity Exchange Act&#8221; applies to them, according to a Sept. 14 post on X (formerly Twitter). According to Armstrong, these protocols are not &#8220;financial service businesses&#8221; and should take these [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-ceo-brian-armstrong-questions-cftc-jurisdiction-over-defi-protocols/\">Coinbase CEO Brian Armstrong questions CFTC jurisdiction over DeFi protocols</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T12:56:01.000Z",
    "title": "OKX Switch McLaren MCL60 Race Car To Stealth Mode For The Singapore Grand Prix",
    "url": "https://cryptodaily.co.uk/2023/09/okx-switch-mclaren-mcl60-race-car-to-stealth-mode-for-the-singapore-grand-prix",
    "description": "OKX Switch McLaren MCL60 Race Car To Stealth Mode For The Singapore Grand Prix"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T12:52:27.000Z",
    "title": "Lazarus Strikes Again: North Korean Group Behind $55M CoinEx Hack",
    "url": "https://cryptodaily.co.uk/2023/09/lazarus-strikes-again-north-korean-group-behind-55m-coinex-hack",
    "description": "North Korea's Lazarus Group, a notorious state-backed hacking organization, is suspected to be the mastermind behind the recent $55 million hack of cryptocurrency exchange CoinEx."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T13:06:39.000Z",
    "title": "Artificial Intelligence Revolutionizes Student Assessment in Education",
    "url": "https://www.cryptopolitan.com/ai-student-assessment-in-education/",
    "description": "Artificial Intelligence (AI) is making significant inroads in education, particularly in evaluating student performance. Educators increasingly leverage AI-driven tools to streamline and enhance the grading process, ushering in a new era of efficiency and objectivity. In this article, we explore the impact of AI on student assessment, exploring its benefits, practical applications, and the critical ... <a title=\"Artificial Intelligence Revolutionizes Student Assessment in Education\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-student-assessment-in-education/\" aria-label=\"More on Artificial Intelligence Revolutionizes Student Assessment in Education\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T13:04:51.000Z",
    "title": "Terminator-Inspired Memeinator Has One Goal: Dominate the Meme Coin Market",
    "url": "https://www.cryptopolitan.com/terminator-inspired-memeinator-has-one-goal-dominate-the-meme-coin-market/",
    "description": "Prepare for a seismic shift in the cryptocurrency landscape! Announcing Memeinator, the meme coin with one goal in sight: $1 billion market cap to rival industry giants like PEPE.&#160; The meme coin market is massive, with a combined market cap of over $10 billion.&#160; But most of these are wannabe’s and also-rans; no-hopers cluttering up ... <a title=\"Terminator-Inspired Memeinator Has One Goal: Dominate the Meme Coin Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terminator-inspired-memeinator-has-one-goal-dominate-the-meme-coin-market/\" aria-label=\"More on Terminator-Inspired Memeinator Has One Goal: Dominate the Meme Coin Market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T12:59:26.000Z",
    "title": "Innovative KYC Solutions Enhanced by AI: B2Core Collaborates with IDWise",
    "url": "https://www.cryptopolitan.com/innovative-kyc-solutions-enhanced-by-ai-b2core-collaborates-with-idwise/",
    "description": "B2Core, a leading provider of comprehensive back-office solutions in the financial industry, is excited to announce an exciting new partnership with IDWise, an innovative artificial intelligence-based platform for Know Your Customer (KYC) verification. This collaboration aims to set new benchmarks in user onboarding by offering a seamless, secure, and exceptionally efficient verification process. Integration B2Core&#8217;s ... <a title=\"Innovative KYC Solutions Enhanced by AI: B2Core Collaborates with IDWise\" class=\"read-more\" href=\"https://www.cryptopolitan.com/innovative-kyc-solutions-enhanced-by-ai-b2core-collaborates-with-idwise/\" aria-label=\"More on Innovative KYC Solutions Enhanced by AI: B2Core Collaborates with IDWise\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T12:52:26.000Z",
    "title": "Amazon vs. Microsoft: Which Tech Giant is the Better Buy?",
    "url": "https://www.cryptopolitan.com/amazon-microsoft-which-tech-giant-is-better/",
    "description": "The year 2022 saw tech stocks fall out of favor, with the Nasdaq-100 technology sector index plummeting 40%. However, renewed optimism has swept through Wall Street, driven by easing inflation and the promise of emerging technologies like artificial intelligence (AI). Among the tech titans, Amazon and Microsoft stand tall, leading the charge in cloud computing ... <a title=\"Amazon vs. Microsoft: Which Tech Giant is the Better Buy?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazon-microsoft-which-tech-giant-is-better/\" aria-label=\"More on Amazon vs. Microsoft: Which Tech Giant is the Better Buy?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T12:43:05.000Z",
    "title": "OKX Switch McLaren MCL60 Race Car To Stealth Mode For The Singapore Grand Prix",
    "url": "https://www.cryptopolitan.com/okx-switch-mclaren-mcl60-race-car-to-stealth-mode-for-the-singapore-grand-prix/",
    "description": "SINGAPORE, SINGAPORE, September 14th, 2023, Chainwire McLaren Racing and OKX, a leading Web3 technology company and Official Primary Partner of the McLaren Formula 1 Team, today revealed a limited-edition Stealth Mode livery design to be carried on the McLaren MCL60 F1 cars at the 2023 Singapore Grand Prix (15-17 September) and the 2023 Japanese Grand ... <a title=\"OKX Switch McLaren MCL60 Race Car To Stealth Mode For The Singapore Grand Prix\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-switch-mclaren-mcl60-race-car-to-stealth-mode-for-the-singapore-grand-prix/\" aria-label=\"More on OKX Switch McLaren MCL60 Race Car To Stealth Mode For The Singapore Grand Prix\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T13:02:32.000Z",
    "title": "Circle trials web3 wallet in Singapore with super-app Grab",
    "url": "https://crypto.news/circle-trials-web3-wallet-in-singapore-with-super-app-grab/",
    "description": "Southeast Asia&#8217;s premier tech startup, Grab is teaming up with USDC stablecoin issuer Circle to pilot a web3 wallet within its super-app. The announcement came on Sept. 14, with Circle revealing that these new services would be accessible to Grab&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T12:56:45.000Z",
    "title": "Hedera unveils open-source toolkit for stablecoin developers",
    "url": "https://crypto.news/hedera-unveils-open-source-toolkit-for-stablecoin-developers/",
    "description": "With the SDK, Hedera wants to bring more stablecoin applications, sparing developers from blockchain hurdles. Hedera, an open-source, leaderless proof-of-stake network, is set to compete with blockchain giants like Ethereum (ETH) in deploying stablecoins with a new toolkit. In a&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T12:50:09.000Z",
    "title": "Ethereum sees second-highest on-chain activity in history",
    "url": "https://crypto.news/ethereum-sees-second-highest-on-chain-activity-in-history/",
    "description": "The network saw over 1 million unique active wallets accepting or sending ETH, the second-highest amount in the asset&#8217;s history. The Ethereum (ETH) network registered a spark of activity on Sept. 13, as the number of unique active wallets (UAW)&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T13:00:20.000Z",
    "title": "Polygon 2.0 Roll Out Officially Begins, Is MATIC Set For A Major Surge?",
    "url": "https://www.newsbtc.com/matic/polygon-2-0-roll-out-begins-matic-set-major-surge/",
    "description": "Polygon Labs announced today the roll out of their ambitious Polygon 2.0 implementation. The announcement, made via a tweet, marks the release of three pivotal Polygon Improvement Proposals (PIPs) and a detailed roadmap for phase 0. &#8220;The wait is over. Polygon 2.0 implementation kicks off now,&#8221; the tweet reads, signaling the beginning of a new era for the platform. Earlier this summer, Polygon Labs had unveiled their vision for Polygon 2.0, a roadmap that aims to scale Ethereum blockspace to create what they term as the &#8220;Value Layer of the Internet.&#8221; This transformative vision promises unlimited scalability and unified liquidity. To bring this vision to fruition, a series of upgrades to the Polygon protocol architecture are imperative. Phase 0, announced today, is the first step in this direction. Phase 0 focuses on four main upgrades to the protocol: The transition from MATIC to POL. Establishing POL as the native (gas) token for PoS. Designating POL as the staking token for PoS. The introduction of the Staking Layer, a feature that will empower validators to secure a diverse range of chains within the evolving Polygon 2.0 ecosystem. What Phase 0 Of Polygon 2.0 Brings Polygon Labs has indicated that if the community endorses these proposals, the implementation could begin as early as the fourth quarter of this year. It&#8217;s noteworthy that the changes detailed in the first three PIPs are designed to be seamless, ensuring no disruptions for end-users at this stage. Related Reading: Polygon (MATIC) Drops Below Crucial Level – Will Sellers Exit? An official blog post, also released today, provides deeper insights into the transformative journey of Polygon 2.0, which was first introduced to the public in June. This set of proposed enhancements seeks to revolutionize nearly every facet of the Polygon ecosystem. The three PIPs released today offer a comprehensive blueprint for phase 0. Their goal is to construct a network of interconnected zero-knowledge-powered L2 chains, effectively scaling Ethereum to the vast expanse of the Internet. Central to these PIPs is the transition process, the specifications for the revamped token of the Polygon 2.0 architecture, and crucial updates to the Polygon PoS native token. PIP-18, titled &#8220;Polygon 2.0 Phase 0,&#8221; offers a comprehensive overview of the initial phase, detailing the upgrades that will be further elaborated upon in subsequent PIPs. The milestones of phase 0 are crafted with the user in mind, ensuring minimal disruptions for those already operating on Polygon PoS and Polygon zkEVM chains. Related Reading: Polygon Foundation Refutes Claims Of Dumping MATIC On Binance – Here’s What Happened Meanwhile, PIP-17 delves into the intricacies of the POL token, outlining the associated contracts that will oversee its emission and migration. The POL token is not just a new name; it represents a next-generation token designed to accommodate an ecosystem of ZK-based Layer 2 chains, enabling staking, community ownership, and governance. Lastly, PIP-19 focuses on the transition of the native gas token on Polygon POS from MATIC to POL. This transition is designed to ensure maximum compatibility with existing systems, with the native token’s properties remaining unchanged. MATIC Price Analysis The MATIC price currently remains in a downtrend channel that saw its beginning in mid-February this year. MATIC hit its yearly high of $1.56 on February 13 and has fallen 68% since then. However, a look at the 1-week chart shows that there is hope for MATIC bulls. At the time of writing, MATIC was trading at 0.5184. All it would take to breathe new life into the MATIC price is a move above $0.5855. This price level marks the 78.6% Fibonacci retracement level, in addition, a move above this price would signify a breakout from the downtrend channel. The bulls could regain the upper hand and target the 20-week EMA at $0.7007. Another key resistance level is at $0.7698, where the 200-day EMA is located. A rise to this price level would already represent a 45% rally. As then, the 50% Fibonacci retracement level at $0.9435 could be targeted by the bulls. Major selling pressure can also be expected at $1.27 (23.6% Fibonacci retracement level) before the yearly high would be within reach. Polygon 2.0 clearly has the potential to awaken the bulls from their slumber. However, the $0.5855 price level is the critical key. If MATIC fails at this price level, a sweep of 65-week low at $0.3177 could loom. Featured image from Admiral Markets, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T13:00:10.000Z",
    "title": "The Great Altcoin Migration: Why Millionaires are Swapping Synthetix (SNX) and GMX (GMX) for Tradecurve Markets",
    "url": "https://www.crypto-news-flash.com/the-great-altcoin-migration-why-millionaires-are-swapping-synthetix-snx-and-gmx-gmx-for-tradecurve-markets/?utm_source=rss&utm_medium=rss&utm_campaign=the-great-altcoin-migration-why-millionaires-are-swapping-synthetix-snx-and-gmx-gmx-for-tradecurve-markets",
    "description": "<img width=\"512\" height=\"242\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T104728.357.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T104728.357.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T104728.357-300x142.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Astoundingly, stalwart altcoins such as Synthetix (SNX) and GMX (GMX) are being extensively traded for a new player in the field &#8211; Tradecurve Markets. What&#8217;s more interesting is that this shift is happening even as Tradecurve Markets is yet in its presale phase. Let&#8217;s explore why and how these high-net-worth individuals are betting on this [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T12:58:46.000Z",
    "title": "EU Parliament Overwhelmingly Approves DAC8 Crypto Tax Rule: Implications for Bitcoin, Ethereum, and LTC Investors",
    "url": "https://www.crypto-news-flash.com/eu-parliament-overwhelmingly-approves-dac8-crypto-tax-rule-implications-for-bitcoin-ethereum-and-ltc-investors/?utm_source=rss&utm_medium=rss&utm_campaign=eu-parliament-overwhelmingly-approves-dac8-crypto-tax-rule-implications-for-bitcoin-ethereum-and-ltc-investors",
    "description": "<img width=\"1350\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC ETH\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH.jpg 1350w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH-104x69.jpg 104w\" sizes=\"(max-width: 1350px) 100vw, 1350px\" />Held in Strasbourg, France, DAC8 received overwhelming support from 535 members with just 57 against the bill. The EU member states have until December 31, 2025, to implement the new crypto tax rules as it goes into effect on January 01, 2026. The European Union has moved a step closer to taming the cryptocurrency market [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T12:55:44.000Z",
    "title": "Ripple’s CTO Predicts XRP Surge with Upcoming XRPL AMM",
    "url": "https://www.crypto-news-flash.com/ripples-cto-predicts-xrp-surge-with-upcoming-xrpl-amm/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-cto-predicts-xrp-surge-with-upcoming-xrpl-amm",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple CTO predicts the upcoming XRPL AMM might drive XRP buying interest. David Schwartz illuminates the strategic use of &#8216;harvesting volatility&#8217; by AMMs. The Blockchain Perspective: Navigating XRP&#8217;s Market Dynamics In the ever-evolving cryptoverse, Ripple&#8217;s Chief Technology Officer, David Schwartz, has recently sparked significant attention, hinting at the potential market repercussions of the soon-to-debut XRP [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T12:48:29.000Z",
    "title": "OKX Switch McLaren MCL60 Race Car To Stealth Mode For The Singapore Grand Prix",
    "url": "https://www.crypto-news-flash.com/okx-switch-mclaren-mcl60-race-car-to-stealth-mode-for-the-singapore-grand-prix/?utm_source=rss&utm_medium=rss&utm_campaign=okx-switch-mclaren-mcl60-race-car-to-stealth-mode-for-the-singapore-grand-prix",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/OKX_AI_1694691366GcmIblgULS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/OKX_AI_1694691366GcmIblgULS.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/OKX_AI_1694691366GcmIblgULS-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/OKX_AI_1694691366GcmIblgULS-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/OKX_AI_1694691366GcmIblgULS-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />SINGAPORE, SINGAPORE, September 14th, 2023, Chainwire McLaren Racing and OKX, a leading Web3 technology company and Official Primary Partner of the McLaren Formula 1 Team, today revealed a limited-edition Stealth Mode livery design to be carried on the McLaren MCL60 F1 cars at the 2023 Singapore Grand Prix (15-17 September) and the 2023 Japanese Grand [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-14T13:08:58.000Z",
    "title": "How to Buy Bitcoin Online For $5  ",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-buy-bitcoin-online-from-5-dollars/",
    "description": "<p>How about buying and redeeming Bitcoin with only vouchers? For as little as $5 in over 190 countries? They are easy to use, like a gift card or a top-up voucher for your phone. Does this sound like an interesting option to you? Well, let&#8217;s find out how Azteco is offering Bitcoin vouchers since 2014. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-buy-bitcoin-online-from-5-dollars/\">How to Buy Bitcoin Online For $5  </a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-14T12:52:42.000Z",
    "title": "How many STELLAR (XLM) to Become a Crypto Millionaire?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-many-stellar-xlm-to-become-a-crypto-millionaire/",
    "description": "<p>You make your money in the bear markets. You see much you made in the bull markets. In the last 6 months of basically no activity, one of the top 25 coins is up 50%. Can you believe it? Even Bitcoin, which has had a good 2023 so far and is doing much better than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-many-stellar-xlm-to-become-a-crypto-millionaire/\">How many STELLAR (XLM) to Become a Crypto Millionaire?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T13:05:17.000Z",
    "title": "Shiba Inu Price Prediction 2023-2030: Will SHIB Price Hit $0.00001 Soon?",
    "url": "https://coinedition.com/shiba-inu-shib-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Shiba-Inu-SHIB-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu (SHIB) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Shiba-Inu-SHIB-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Shiba-Inu-SHIB-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Shiba-Inu-SHIB-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Shiba-Inu-SHIB-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Shiba-Inu-SHIB-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shiba Inu (SHIB) is a meme token that took the cryptocurrency space by storm. It is called “DOGECOIN KILLER” by its community and other crypto users. It was launched on the Ethereum blockchain as an ERC-20 token. Shiba Inu investors are bullish on the token since it has had a return on investment (ROI) of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-shib-price-prediction/\">Shiba Inu Price Prediction 2023-2030: Will SHIB Price Hit $0.00001 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T13:00:00.000Z",
    "title": "Elon Musk Tells US Senators ‘AI Poses Civilizational Risk’",
    "url": "https://coinedition.com/elon-musk-tells-us-senators-ai-poses-civilizational-risk/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/ELON-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/ELON-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/ELON-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Tech billionaire Elon Musk has articulated profound concerns surrounding the risks associated with Artificial Intelligence (AI). Musk expressed the concern while addressing reporters following a recent U.S. Senate hearing on AI. Musk remarked: There&#8217;s some chance – above zero – that AI will kill us all. I think it&#8217;s low, but there&#8217;s some chance. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/elon-musk-tells-us-senators-ai-poses-civilizational-risk/\">Elon Musk Tells US Senators ‘AI Poses Civilizational Risk’</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]