[
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T23:10:17.000Z",
    "title": "We need to fundamentally change how smart contracts operate",
    "url": "https://cointelegraph.com/news/fundamentally-smart-contracts-operate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3f64b075-88f5-47fe-8b3f-b78641e2312a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Smart contracts should be viewed as “proof-of-concept” rather than as critical for universal adoption. That may mean exploring alternatives.</p>\n                    <p><p>Smart contracts have reshaped the possibilities of what blockchain and crypto can achieve, and we can all acknowledge that. That doesn’t mean they’re the be-all-end-all solution to widespread adoption.</p><p>Being overzealous about any kind of innovation can also contribute to its stalling, or even failure if other factors don’t align. The mentality of assuming new technology is perfect and wondering why everyone hasn’t caught up to its genius is outdated. Not only does it create an adversarial relationship when inevitabilities, such as regulation, arise, but it also diminishes the motivation to improve on new applications to maximize their value.</p><p>Smart contracts and companies building their products around their implementation are now nearing this impasse. So, what can be done to close these gaps and potentially set the stage for an alternative?</p><h2>The gaps</h2><p>Mainstream smart contract adoption is already kneecapped by a lack of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) support. Sure, the Ethereum network has become an industry heavyweight that hosts many of the world’s blockchain applications, but Bitcoin is still seen as being in a league of its own by practically every metric. And as BlackRock, the top dog of traditional institutions, looks to break the Securities and Exchange Commission’s Bitcoin exchange-traded fund (ETF) glass ceiling, that glaring gap will only become more apparent as others follow suit.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-etf-isnt-bullish-for-bitcoin\"><strong><em>Don’t be naive — BlackRock’s ETF won’t be bullish for Bitcoin</em></strong></a></p><p>We can’t ignore ETF filings or <a href=\"https://cointelegraph.com/explained/what-are-bitcoin-ordinals\">recent developments</a> in Bitcoin-driven finance, so saying smart contract aversion stalls Bitcoin’s interoperable potential or <a href=\"https://cointelegraph.com/defi-101/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized app</a> integration is short-sighted.</p><p>The other elephant in the room is fiat. Hundreds of projects are working to make cross-ecosystem compatibility a reality, but there is no streamlined way to connect crypto and fiat through a smart contract framework.</p><p>Yes, you can introduce centralized intermediaries to foster fiat-to-crypto exchanges, but that opaque, trust-maximized, expensive solution defeats crypto’s intended purpose altogether. And that’s before touching on the security issues that inherently follow their implementation.</p><p>Smart contracts may be (and usually are) controlled by the team that develops them. The inspiring, deceptively logical mottos of “verify, don’t trust” and “code is the law” are great in theory, but no one really reads the code before executing a smart contract.</p><p>Creating an implicit trust assumption is where hackers commonly emerge and exploit loopholes, code vulnerabilities and improper key management to crack smart contracts and steal funds.</p><p>Regulators are already well aware of smart contract vulnerabilities. Part of the reason why the European Union’s Data Act garnered <a href=\"https://cointelegraph.com/news/eu-approves-smart-contract-kill-switch-rules-under-data-act\">such divisive reactions</a> stemmed from its <a href=\"https://cointelegraph.com/news/eu-finalizes-data-act-with-a-kill-switch-for-smart-contracts-law-decoded-june-27-july-3\">“kill switch” mandate</a> for any company using smart contracts. While the mandate may seem harsh, it illustrates an inherent technological risk that regulators aren’t likely to ignore as more international blockchain regulation moves forward.</p><h2>Necessary changes</h2><p>If companies and institutions actually <em>want </em>an alternative to smart contracts, making that a reality requires a few major steps. Or, if an alternative seems out of reach at this point, smart contracts need severe alterations to seal up attack vectors when it comes to holding funds.</p><p>Again, smart contracts are great to enrich an application layer and amplify generic functionality, but they’re not necessarily needed or well-suited to hold funds indefinitely. This is why beloved comparisons <a href=\"https://ethereum.org/se/developers/docs/smart-contracts/\" target=\"_blank\" rel=\"noopener nofollow\">likening</a> smart contracts to vending machines fall a bit flat.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-could-help-audit-smart-contracts-but-not-yet\"><strong><em>Experiments show AI could help audit smart contracts, but not yet</em></strong></a></p><p>To the average person, using a smart contract could make it seem like the equivalent of a stranger watching over you every time you access an ATM. And just because you might trust a smart contract doesn’t mean you can necessarily trust the team that made it. In this case, it’s imperative to code smart contracts correctly to maximize security, with some developers even proposing new smart contract languages or <a href=\"https://www.rareskills.io/post/smart-contract-security\" target=\"_blank\" rel=\"noopener nofollow\">implementing</a> a “fact check” software into the code.</p><p>“Right to be forgotten” data privacy regulations, such as those in the European Union’s General Data Protection Regulation, also complicate things. In countries where citizens have the legal right to demand their personal data be erased, that can’t exactly happen if they’re bound to a digital legal agreement.</p><p>Getting smart contracts to cooperate with traditional financial institutions and fiat requires fundamentally altering how they operate. But since that kind of seismic change is impractical and completely unnecessary to consider at this stage, institutional onboarding requires urgently mitigating the security and privacy risks.</p><p>Smart contracts have many practical uses, but they may need to be viewed as a “proof-of-concept” rather than the key to universal adoption. Crypto’s future requires a consistent dialogue with traditional finance in terms of fiat interoperability and ease of access. This can only happen by prioritizing that kind of development and addressing the obstacles preventing it from happening. If that involves steering away from complete reliance on smart contracts and exploring other options or primitives, so be it.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Eitan Katz</strong> is the CEO and co-founder of Kima. Prior to Kima, he served in leadership roles with the Israel Defense Forces (Intelligence/8200) and at Hewlett Packard and BMC. He helped to build HP’s Global Innovation and Incubation program, leading HPE’s Enterprise Mobile platform. He was also a founding member of the MPC-based Bitcoin wallet Aegis.</div></div><p class=\"post-content__disclaimer\"><em>The opinions expressed are the author’s alone and do not necessarily reflect the views of Cointelegraph. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice.</em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-31T23:30:34.000Z",
    "title": "Shark Tank Star Kevin O’Leary Warns More US Banks Will Fail",
    "url": "https://news.bitcoin.com/shark-tank-star-kevin-oleary-warns-more-us-banks-will-fail/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Shark Tank Star Kevin O’Leary Warns More US Banks Will Fail\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/kevin-oleary-banks.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shark Tank star Kevin O&#8217;Leary, aka Mr. Wonderful, has warned that more banks in the U.S. will fail as the Federal Reserve continues to hike interest rates. He stressed: &#8220;It will break down in the regional banks, which support 60% of the economy &#8230; We’ve started to see the cracks.&#8221; Kevin O&#8217;Leary Foresees More Bank [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T23:29:29.000Z",
    "title": "Will the Convergence of Technologies in Web3 Improve the Current Economy?",
    "url": "https://www.cryptopolitan.com/convergence-of-technologies-in-web3/",
    "description": "The digital landscape has undergone a significant transformation through the rise of concepts such as the metaverse, Artificial Intelligence (AI), cryptocurrency, and blockchain technologies. Web3, the future of digital experiences and economies, combines these innovative technologies to create an immersive and decentralized virtual world. With the convergence of these technologies within Web3, along with real-life ... <a title=\"Will the Convergence of Technologies in Web3 Improve the Current Economy?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/convergence-of-technologies-in-web3/\" aria-label=\"More on Will the Convergence of Technologies in Web3 Improve the Current Economy?\">Read more</a>"
  }
]