[
  {
    "source": "Decrypt",
    "date": "2023-09-05T17:00:02.000Z",
    "title": "'Pixel Pioneer': Christie's to Auction Keith Haring Digital Art as NFTs",
    "url": "https://decrypt.co/155006/pixel-pioneer-christies-auction-keith-haring-digital-art-nfts",
    "description": "Keith Haring's 1987 artwork created on a Commodore Amiga has been minted on Ethereum and will be auctioned by Christie's."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T17:00:22.000Z",
    "title": "Bitcoin bull run traced to ‘smart money’ as 40% of total supply held for over three years",
    "url": "https://cryptoslate.com/insights/bitcoin-bull-run-traced-to-smart-money-as-40-of-total-supply-held-for-over-three-years/",
    "description": "<p>Quick Take The onset of the massive Bitcoin bull run can be traced back to September 2020, a period marked by significant price accumulation followed by a monumental ascent from $10k to $60k. The data uncovers notable trends within the Bitcoin supply dynamics. Particularly, the supply that has been held for over three years has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-bull-run-traced-to-smart-money-as-40-of-total-supply-held-for-over-three-years/\">Bitcoin bull run traced to &#8216;smart money&#8217; as 40% of total supply held for over three years</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-05T17:00:32.000Z",
    "title": "SmarDex (SDEX): Pioneering New Pathways in DeFi, Strides Towards a Deflationary Token Model, Forging Ahead on ARB, Matic, and BNB Chains",
    "url": "https://news.bitcoin.com/smardex-sdex-pioneering-new-pathways-in-defi-strides-towards-a-deflationary-token-model-forging-ahead-on-arb-matic-and-bnb-chains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/5e74v85os6t7.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Introduction: Should one venture into the expansive realm of decentralized finance, they may undoubtedly discern a conspicuous and dynamic force creating substantial ripples: SmarDex ($SDEX). This entity does not merely constitute an additional entrant within the DeFi milieu; instead, it emerges as an innovator meticulously redefining the operational paradigms. SmarDex is not just sitting on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T17:05:49.000Z",
    "title": "Shytoshi Kusama confirms Shibarium burn portal in development",
    "url": "https://www.cryptopolitan.com/shibarium-burn-portal-in-development/",
    "description": "Shiba Inu&#8217;s lead developer, Shytoshi Kusama, has confirmed the ongoing work on a Burn Portal for Shibarium. This Ethereum-based layer-2 protocol is part of the Shiba Inu ecosystem. The news comes as Shibarium continues to make strides following its relaunch after an initial failed attempt in August. Lucie, the Marketing Strategist for the Shiba Inu ... <a title=\"Shytoshi Kusama confirms Shibarium burn portal in development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shibarium-burn-portal-in-development/\" aria-label=\"More on Shytoshi Kusama confirms Shibarium burn portal in development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T16:56:55.000Z",
    "title": "Toncoin (TON), Polygon (MATIC) and VC Spectra (SPCT): Three Cryptocurrencies Shaping 2023’s Bull Market",
    "url": "https://www.cryptopolitan.com/toncoin-ton-polygon-matic-and-vc-spectra-spct-three-cryptocurrencies-shaping-2023s-bull-market/",
    "description": "As the crypto market prepares for an imminent bull run, three assets have poised as the key to ushering in this long-anticipated rally. In a recent surge, Toncoin (TON) enjoyed a brief ride upward compared to Ethereum&#8217;s layer-2 native coin, Polygon (MATIC). The Polygon MATIC price fell as a bearish trend formed on the charts, ... <a title=\"Toncoin (TON), Polygon (MATIC) and VC Spectra (SPCT): Three Cryptocurrencies Shaping 2023&#8217;s Bull Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/toncoin-ton-polygon-matic-and-vc-spectra-spct-three-cryptocurrencies-shaping-2023s-bull-market/\" aria-label=\"More on Toncoin (TON), Polygon (MATIC) and VC Spectra (SPCT): Three Cryptocurrencies Shaping 2023&#8217;s Bull Market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T16:53:28.000Z",
    "title": "OpenAI infuses Canva plugin into ChatGPT",
    "url": "https://www.cryptopolitan.com/openai-infuses-canva-plugin-into-chatgpt/",
    "description": "In a strategic move aimed at simplifying the process of creating visuals for businesses and entrepreneurs, OpenAI has introduced a Canva plugin for its renowned chatbot, ChatGPT, tapping into the ever-evolving social marketing space. This integration promises to transform how users generate visuals, offering a streamlined and user-friendly approach to digital design. Before this development, ... <a title=\"OpenAI infuses Canva plugin into ChatGPT\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-infuses-canva-plugin-into-chatgpt/\" aria-label=\"More on OpenAI infuses Canva plugin into ChatGPT\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T16:58:06.000Z",
    "title": "Circle rolls out USDC stablecoin on Base and OP Mainnet",
    "url": "https://crypto.news/circle-rolls-out-usdc-stablecoin-on-base-and-op-mainnet/",
    "description": "The Boston-based stablecoin issuer previously unveiled a plan to roll out USDC on six blockchain networks, including Polygon PoS. Users of Base, a Coinbase-incubated decentralized network, can now access native USDC and USDC liquidity on the layer-2 blockchain. This means&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T16:54:33.000Z",
    "title": "Swing trading in crypto: what it is, how it works, tips, and strategies",
    "url": "https://crypto.news/swing-trading-in-crypto-what-it-is-how-it-works-tips-and-strategies/",
    "description": "This article looks at swing trading in crypto. It discusses tips, strategies, and how traders can use this technique "
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T16:49:32.000Z",
    "title": "Crypto-focused Haun Ventures hires private-equity top manager",
    "url": "https://crypto.news/crypto-focused-haun-ventures-hires-private-equity-top-manager/",
    "description": "In a Wall Street Journal exclusive article, Haun Ventures reveals their hire of a private-equity veteran, Suzanne Kim, to handle investor relations. According to the report, this action shows how firms try to communicate with their investors about the changing&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T17:02:21.000Z",
    "title": "Solana (SOL) Price Prediction: 2023, 2024, 2025 and Beyond",
    "url": "https://www.newsbtc.com/news/solana/solana-price-prediction-2023-2024-2025-sol-beyond/",
    "description": "Solana is one of the fastest growing cryptocurrency platforms thanks to its high speed and low costs. Launched in 2020, its native SOL token has seen massive appreciation. Here we analyze Solana&#8217;s price outlook for the future using technical analysis to provide an evidence-based Solana price prediction guide. What is Solana (SOL)? Solana is a highly scalable decentralized blockchain created by Anatoly Yakovenko in 2017. It uses a unique proof-of-history consensus mechanism to achieve high transaction speeds and low fees while maintaining security. The native cryptocurrency of the Solana network is SOL. It is used to pay for executing transactions, interacting with smart contracts, and staking on the blockchain. Some key aspects of Solana include: Speed Solana can process over 50,000 transactions per second, significantly faster than Bitcoin or Ethereum. Low fees With high speed, Solana offers transaction costs as low as $0.00025 making it ideal for DeFi. Proof-of-History This novel consensus mechanism coordinates timeline between nodes without slowing things down. Programming Solana supports programming languages like Rust and C++ to develop dApps. Staking SOL holders can stake tokens to help validate transactions while earning staking rewards. Solana&#8217;s powerful performance makes it a leading choice for developing fast, scalable DeFi applications and services. Factors Influencing Solana Price Several core factors determine the price movement and growth potential of SOL: Cryptocurrency Market Conditions Like most altcoins, Solana&#8217;s price depends significantly on Bitcoin and overall crypto market trends. A rising market lifts SOL. Adoption by Developers As more projects build DEXs, NFT marketplaces, Web3 applications etc on Solana, demand for SOL increases. Competition From Rival Networks Alternative scalability solutions like Avalanche, Polkadot or Cardano could fragment developer interest and diminish Solana&#8217;s growth potential if they gain traction. Network Upgrades and Innovation Upgrades to further boost Solana&#8217;s speed and capabilities can augment developer demand, boosting SOL&#8217;s value. Staking Trends Higher staking activity reduces available SOL supply which may lead to appreciation in token price. Security and Reliability Network outages or vulnerabilities could damage confidence in Solana and depress SOL price. Smooth performance boosts its reputation. Major Historical Price Developments SOL&#8217;s price has seen huge growth since launching, but also periods of instability. Let&#8217;s look at key highlights: 2020 &#8211; Minimal Trading After Launch Solana launched the mainnet in March 2020 with SOL starting off around $0.50 initially with minimal exchange availability and trading. By December 2020, it reached $1.52 as trading volumes gradually picked up. 2021 &#8211; Massive Breakout The 2021 crypto bull run catapulted Solana into the limelight with SOL surging exponentially from $3 in January 2021 to a peak of $260 by November 2021 &#8211; an unbelievable 8700% return within 10 months! Driving this were: Explosive growth of DeFi and NFT activity on Solana, riding the hot trends. Attracting developers due to faster speeds and lower costs than Ethereum. Major protocol improvements and ecosystem funding. Listing on Coinbase and Binance centralized exchanges. This established Solana as a leading Ethereum competitor. But lack of maturity showed&#8230; 2022 &#8211; Crash and Outages In 2022, the crypto downturn brought SOL back down below $40 from its highs. More damaging were network outages in 2022 that dented confidence in Solana&#8217;s stability. The final days surrounding the FTX collapse, Solana also suffered, taking the cryptocurrency to a 2022 low of $8. While still early days for such a nascent project, Solana needs to improve reliability to gain institutional trust. But its developer momentum continues unabated, with over 4000 projects built on Solana so far. Recent SOL Price Analysis Solana has been recovering throughout 2023, but the US SEC hasn&#8217;t made it easy, attacking altcoins around every turn. Each time altcoins like SOL attempt to gain momentum, the SEC files another case against a crypto exchange. Past filings include naming Solana as a possible unregistered security. However, it continues to be the choice for big institutions such as VISA, which is launching a stable coin payment system on Solana. Short-Term Solana Price Prediction for 2023 The latest bullish news that VISA is using Solana for its stable coin payments could propel SOL higher and reach the target of this inverse head and shoulders pattern, with a target of $75 per token. Medium-Term Solana Price Prediction for 2024-2025 Solana very closely mimics the price action of 2016 through 2020 Ethereum. If another similar rally follows in Solana like it did in Ethereum, SOL could approach upwards of $1,000 per token. Related Reading: Read our Ethereum Price Prediction  Long-Term Solana Price Prediction for 2030 In the longest term outlook, it becomes much more challenging to properly predict what SOL might do. It very much depends on adoption of the SOL token, the Solana blockchain, and crypto itself. If SOL can maintain its current mean trajectory, then it is possible Solana could be priced around $3,000 to $4,000 by the year 2030 or beyond. Conclusion: Solana Price Outlook Solana has demonstrated immense potential with its blazing fast speeds at low costs. But it still has much to prove regarding stability and institutional-grade security. If Solana can build on its developer momentum and rapidly evolving ecosystem while improving reliability, its long-term growth upside is immense. But execution risks remain for this ambitious project aiming to reshape decentralized finance. Solana Price Prediction FAQs Let&#8217;s look at some common questions crypto investors have about SOL price analysis: What was Solana&#8217;s lowest ever price? SOL sank to as low as $0.50 in the early days after its mainnet launch in 2020. Its 2022 low was around $8 amidst broader crypto market weakness. What was the highest price for Solana? Solana&#8217;s all-time high price stands at $260 reached in November 2021 during strong bullish momentum carrying crypto markets higher. Is $500 realistic for Solana? SOL reaching $500 is achievable this decade if Solana fulfills its technological promise and sees high adoption as the leading DeFi blockchain. Can Solana crash to zero? A complete collapse is unlikely given Solana&#8217;s strong fundamentals unless critical flaws emerge in its core protocol. But extended weakness could sink SOL below $10 until a recovery. Why is SOL price volatile? As a relatively new asset with limited liquidity, Solana experiences high volatility from speculative trading and sentiment shifts. As adoption increases, volatility should stabilize. When will Solana&#8217;s price stabilize? Solana price swings may start normalizing once it builds a large user base and matures technically. But as a crypto asset, some volatility will always remain. Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involves substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell any securities or cryptocurrencies. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T17:00:04.000Z",
    "title": "Here’s What Will Happen If Bitcoin Can Break $33,700",
    "url": "https://www.newsbtc.com/bitcoin-news/heres-what-will-happen-if-bitcoin-can-break-33700/",
    "description": "On-chain data suggests the $33,700 level could be a very significant level to break for Bitcoin if the historical pattern is anything to go by. Bitcoin 6 Months To 3 Years Old Investors Have $33,700 As Cost Basis In a new post on X, Ali, an analyst, has shared a chart that could shed light on the path that BTC may end up taking. The relevant indicator here is the &#8220;realized price,&#8221; which tells us about the price at which the average investor in the Bitcoin market acquired their coins. Related Reading: Bitcoin Exchanges See Three Straight Months Of Withdrawals For First Time Ever When the spot price of the asset exceeds this line, it means that the holders as a whole are currently carrying a net amount of profit on their coins. On the other hand, BTC being below the level suggests the average investor is underwater right now. In the context of the current discussion, the cost basis of the entire market isn&#8217;t of relevance, but of only a specific segment: the holders who acquired their coins at least six months and at most three years ago. Here is a chart that shows how the cost basis of these Bitcoin investors has changed over the years: Looks like the price is below this line at the moment &#124; Source: @ali_charts on X The six months to three years old investors are actually a part of the larger &#8220;long-term holder&#8221; (LTH) group. And the LTHs are simply the investors who bought their coins at least six months ago. In the chart, the analyst has also attached the data for the cost basis of the entire LTH group and it&#8217;s visible that this metric currently has a value of about $20,300, meaning that the spot price is currently a decent distance above this line. The realized price of the six months to three years old holders, however, is above the spot price right now, as it&#8217;s valued at about $33,755. Naturally, this means that this segment of the LTHs is currently firmly in the red. From the graph, it&#8217;s also apparent that the Bitcoin price has not touched this level since early 2022, when the bear market first kicked off. If the cryptocurrency can surge towards the level and finally make a retest of it, then its fate might change for the better. This is because, as Ali has pointed out, BTC has observed a significant rally whenever the asset has crossed this mark and these HODLers have gotten back into profits. Related Reading: This Could Be The Metric To Watch For A Bitcoin Bounce: Santiment Three instances of this pattern are clearly visible in the chart. The 2017 bull run, the April 2019 rally, and the 2021 bull run all emerged from successful breaks of the cost basis of the six months to three years old LTHs. If this historical pattern holds any weight at all, then a Bitcoin break above the $33,700 level in the near future could become the starting point of the next major bull run. BTC Price At present, Bitcoin is quite a bit below the cost basis of these LTHs, as its price is trading just under the $25,800 level. BTC continues to show boring price action &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T17:00:48.000Z",
    "title": "PEPE Whale Exits And Bags Big Profits, Will They Buy This Rising Crypto Star?",
    "url": "https://www.crypto-news-flash.com/pepe-whale-exits-and-bags-big-profits-will-they-buy-this-rising-crypto-star/",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T164315.943.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T164315.943.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T164315.943-300x225.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is no stranger to high-stakes moves by whales and significant profits. The recent exit of a Pepe whale and the significant profits made have stirred excitement within the crypto community and sparked discussions regarding their next move. Particularly, there have been speculations about whether the whale will invest in the AI-inspired token [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T16:57:44.000Z",
    "title": "Crypto Gambling Platform Sees Big Investment: Is RLB the Next Big Thing?",
    "url": "https://www.crypto-news-flash.com/crypto-gambling-platform-sees-big-investment-is-rlb-the-next-big-thing/",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/investment-3247252_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />After making over $358k with RLB before, a renowned crypto smartmoney spent 1.25M $USDC to purchase 7.1M $RLB in the past 24 hours. The Rollbit Coin (RLB) has been in a bullish trend YTD with gains of about 1,000 percent. Having registered notable gains since the calendar flipped in January, Rollbit Coin (RLB) has again [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T17:00:00.000Z",
    "title": "FTX Bankruptcy, Rising Costs, and Lawsuits Alters Crypto Market: Reports",
    "url": "https://coinedition.com/ftx-bankruptcy-rising-costs-and-lawsuits-alters-crypto-market-reports/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/FTX_opposes_new_bankruptcy_investigation_as_it_probes_Bankman_Fried-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto market&#8216;s profit margins sank 30% in comparison to last year, according to Bloomberg. The market used to be profitable for traders, but after the bankruptcy of the FTX exchange, investors started to avoid the sector. The article shed light on traders&#8217; concerns about rising costs and lawsuits against crypto exchanges. The crash that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-bankruptcy-rising-costs-and-lawsuits-alters-crypto-market-reports/\">FTX Bankruptcy, Rising Costs, and Lawsuits Alters Crypto Market: Reports</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T16:55:07.000Z",
    "title": "Shibarium Hits 1,000,000 Wallet Milestone As Layer-2 Solution Prepares To Promote Projects, Says Developer",
    "url": "https://dailyhodl.com/2023/09/05/shibarium-hits-1000000-wallet-milestone-as-layer-2-solution-prepares-to-promote-projects-says-developer/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/hits-milestone-layer-says.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Shiba Inu&#8217;s (SHIB) layer-2 blockchain Shibarium has surpassed one million wallets for the first time since the mainnet launch in August, according to a project developer. In a new blog post, Shibarium developer Kaal Dhairya celebrates the wallet milestone and says that the project team is dedicated to making Shibarium one of the top layer-2 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/shibarium-hits-1000000-wallet-milestone-as-layer-2-solution-prepares-to-promote-projects-says-developer/\">Shibarium Hits 1,000,000 Wallet Milestone As Layer-2 Solution Prepares To Promote Projects, Says Developer</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T16:52:18.000Z",
    "title": "WEMIX Introduces ‘Unagi’ – A New Omnichain Initiative That Transcends Blockchain Boundaries",
    "url": "https://dailyhodl.com/2023/09/05/wemix-introduces-unagi-a-new-omnichain-initiative-that-transcends-blockchain-boundaries/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/WeMix-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/WeMix-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/03/WeMix-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/03/WeMix-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/03/WeMix-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/03/WeMix-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>September 5, 2023 – Seoul, South Korea Unagi aims to create a vast ecosystem to drive common growth of global blockchains. A complete user-customized omnichain network to easily and conveniently utilize services across multiple blockchains. All platforms and DApps are connected as one with blockchains bringing complementary strengths to the ecosystem. WEMIX has unveiled unagi [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/wemix-introduces-unagi-a-new-omnichain-initiative-that-transcends-blockchain-boundaries/\">WEMIX Introduces ‘Unagi’ – A New Omnichain Initiative That Transcends Blockchain Boundaries</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]