[
  {
    "source": "Crypto Briefing",
    "date": "2024-03-15T21:50:47.000Z",
    "title": "Over 53m SOL were transferred to a wallet marking a new chapter in the ‘meme coin frenzy’",
    "url": "https://cryptobriefing.com/over-53-sol-transferred-wallet-memecoin/",
    "description": "After BOME's impressive success, see why users are eagerly placing their SOL in a subsequent pre-sale, involving wallet transfers."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T21:41:01.000Z",
    "title": "Worldcoin Price Prediction 2024 – 2033: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin Price Prediction 2024-2033 Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-15T22:00:41.000Z",
    "title": "Crypto Analysts Foresee Another FLOKI Expansion Despite Market Drop",
    "url": "https://www.newsbtc.com/news/crypto-analysts-foresee-another-floki-expansion-despite-market-drop/",
    "description": "FLOKI and the dog-themed cryptocurrencies have been the talk of the town recently. BONK and dogwifhat (WIF) reached new all-time highs (ATH) this month, while the Viking dog-based token climbed to levels not seen since the previous bull run. During this rally, memecoins have soared alongside the rest of the cryptocurrencies. However, in the past 24 hours, the market went from flying to crashing as the prices of most cryptocurrencies followed the recent Bitcoin dip. Related Reading: Solana’s Biggest Memecoin Gains Over $680,000 In 3 Days As Investors Bet On Its Popularity Is FLOKI Ready To Continue Its Expansion? Last week, FLOKI, the fifth largest memecoin by market cap, soared by over 60% after announcing its listing in two major crypto exchanges in Asia and the Middle East. The news propelled the token’s price to $0.0002043. Crypto Analyst Byzantine General shared on X (formerly Twitter) his view on the token’s recent performance. According to the post, FLOKI was one of the few tokens that “held up nicely.” Based on that, Byzantine General observed that the price was consolidating before another expansion. One of the coins that held up nicely today is $FLOKI. Looks like it&#39;s just consolidating before another expansion. And lately it&#39;s basically been a higher beta $DOGE. pic.twitter.com/9MsrfInjvA &#8212; Byzantine General (@ByzGeneral) March 14, 2024 FLOKI has shown a rising trajectory this month, increasing 337% since March 1st. The chart in the post highlights the past four days, displaying that the Solana-based memecoin has consolidated between the $0.00026-$0.0003 price range. A broader look at the token’s price exhibits that it hovered between $0.000028-$0.000039 in the first two months of 2024 before breaking above the $0.000040 resistance level at the end of February. In the past 30 days, FLOKI has registered a stellar $649.4% growth. Similarly, the renowned trader and market analyst MacroCRG shared on X that “$FLOKI holding up like a mf chad” amid the market dip. According to the trader, the token will continue as one of the leaders “as long as the memecoin supercycle bid remains.” Market shits itself? It&#39;s oke, $FLOKI holding up like a mf chad New revamped roadmap coming soon + many product launches lined up for the rest of the year&#8230; As long as the memecoin supercycle bid remains&#8230; IMO @RealFlokiInu gonna continue being one of the leaders pic.twitter.com/2gsIE04Dkv &#8212; CRG (@MacroCRG) March 15, 2024 The analyst highlighted the project’s newly revamped roadmap as part of its “strengths.” Additionally, he pointed out that the web3 project has product launches lined up for the rest of the year. FLOKI’s Price Action The launch in the mainnet of the Valhalla Game, powered by FLOKI, is highly expected by the “Floki Vikings.” Undoubtedly, the community has shown massive support and confidence in the web3 project, as many expect it to skyrocket soon to a new ATH. The token’s price has closely followed the jumps and dips of BTC during the past seven days, as seen in the chart below. It registered a drop of 13.5% in the last 24 hours. BTC and FLOKI’s performance in the 7-day chart. Source: CoinGecko.com Coupled with the price drop, the daily trading volume decreased 21.3% to $837.2 million. Moreover, WIF recently flipped it, which took fourth place as the largest memecoin by market cap. By this metric, FLOKI’s $2.47 billion takes 52nd place in the global crypto market ranking after a 6.6% decrease in the last day. At writing time, FLOKI is trading at $0.000248. Despite the price decrease, the token still shows a remarkable 28.3% growth in the 7-day timeframe. Related Reading: Why Is Bitcoin Price Down Today? 3 Key Reasons FLOKI is trading at $0.000248 in the 1-day chart. Source: FLOKIUSDT on TradingView.com Featured image from Unsplash.com, Chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-15T22:04:12.000Z",
    "title": "$4,165,000,000 in Deposit Flight Hits New York Bank As Federal Reserve Chair Jerome Powell Warns More Lenders Will Collapse",
    "url": "https://dailyhodl.com/2024/03/15/4165000000-in-deposit-flight-hits-new-york-bank-as-federal-reserve-chair-jerome-powell-warns-more-lenders-will-collapse/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/bank-ny-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A New York-based bank is witnessing the exodus of billions of dollars in deposits amid an industry-wide warning from Fed Chair Jerome Powell. New York Community Bank&#8217;s (NYCB) new earnings report shows total deposits fell from $81.365 billion at the end of start of the year to $77.2 billion on March 6th – a drop [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/15/4165000000-in-deposit-flight-hits-new-york-bank-as-federal-reserve-chair-jerome-powell-warns-more-lenders-will-collapse/\">$4,165,000,000 in Deposit Flight Hits New York Bank As Federal Reserve Chair Jerome Powell Warns More Lenders Will Collapse</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-15T22:01:28.000Z",
    "title": "World’s Leading Crypto Exchange Binance Distances Itself From Its Investment Arm, Binance Labs: Report",
    "url": "https://dailyhodl.com/2024/03/15/worlds-leading-crypto-exchange-binance-distances-itself-from-its-investment-arm-binance-labs-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/binance-forms-metaverse.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world’s largest crypto exchange by volume is reportedly severing ties with its multi-billion-dollar investment branch. According to a new report by Bloomberg, since taking the helm from former Binance co-founder Changpeng Zhao, Binance CEO Richard Teng has pushed Binance Labs – the crypto exchange’s investment arm – into a separate company. Disclaimer text found [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/15/worlds-leading-crypto-exchange-binance-distances-itself-from-its-investment-arm-binance-labs-report/\">World’s Leading Crypto Exchange Binance Distances Itself From Its Investment Arm, Binance Labs: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]