[
  {
    "source": "Cointelegraph",
    "date": "2023-11-26T20:45:03.000Z",
    "title": "Blast’s marketing approach “cheapens the work of a serious team” — Paradigm",
    "url": "http://cointelegraph.com/news/blast-marketing-cheapens-work-serious-team-paradigm",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6009f80a-30a6-44fe-b3de-224a71b95412.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Paradigm, one of Blast’s seed investors, criticized the protocol’s decision to launch a bridge before its L-2 and withdraw capability. </p>\n                    <p><p>Crypto venture capital firm Paradigm criticized Blast’s protocol marketing strategy, claiming the startup “crossed lines in both messaging and execution.\" The VC firm is a seed investor in Blast.</p><p>The head of research at Paradigm, Dan Robinson, <a href=\"https://twitter.com/danrobinson/status/1728817674543862023?s=20\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> a statement on X (formerly Twitter) expressing disagreement about Blast’s decision to launch a bridge before its layer-2 network and to not allow withdrawals for three months. “We think it sets a bad precedent for other projects,” Robinson wrote, adding that “much of the marketing cheapens the work of a serious team.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There are a lot of components of Blast that I’m excited about and would be interested in engaging with people on. That said, we at Paradigm think the announcement this week crossed lines in both messaging and execution. For example, we don’t agree with the decision to launch the…</p>&mdash; Dan Robinson (@danrobinson) <a href=\"https://twitter.com/danrobinson/status/1728817674543862023?ref_src=twsrc%5Etfw\">November 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Paradigm has been in touch with Blast about its concerns, Robinson noted, emphasizing that “there are still many points of disagreement” between the companies. </p><p>Despite the criticism, the head of research also acknowledged that Blast’s team is formed by “world-class builders,” with demonstrated “ability to build great products.” Blast's governance structure is unclear, as is Paradigm's role in the startup's decision-making process. According to Robinson:</p><blockquote>\"We invest in strong, independent founders who we don’t always agree with. But we understand that people may look to us to set an example on best practices in crypto. We don’t endorse these kinds of tactics and take our responsibility in the ecosystem seriously.\"</blockquote><p>Paradigm isn’t the first company to address Blast’s recent launch. Jarrod Watts, developer relations engineer at Polygon Labs, <a href=\"https://cointelegraph.com/news/blast-network-hits-400-million-tvl-rebuts-centralization-claims\">said the network's centralization poses a significant security risk</a>.</p><p>In addition, Watts noted that Blast \"is just a 3/5 multisig”, meaning that if an attacker gains access to three out of five team members' keys, they can steal all cryptocurrency deposited into Blast's contracts. </p><p>Watts also claimed that Blast “is not a layer 2,” but simply “accepts funds from users” and “stakes users’ funds into protocols like LIDO” without using any bridges or testnet. Additionally, he criticized the lack of withdrawal functionality. To withdraw in the future, users must trust that developers will add withdrawal functionality in the future.</p><p>In spite of the controversy surrounding its launch, Blast has <a href=\"https://debank.com/profile/0x5f6ae08b8aeb7078cf2f96afb089d7c9f51da47d\" target=\"_blank\" rel=\"noopener nofollow\">amassed</a> over $555 million in total value locked (TVL) since its launch a few days ago. The protocol claims to be “the only Ethereum L2 with native yield for ETH and stablecoins.” An airdrop is scheduled for January.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\"><strong><em>Are DAOs overhyped and unworkable? Lessons from the front lines</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-26T21:00:48.000Z",
    "title": "Crypto Whale Profits Over $24,000,000 in Masterful Wrapped Bitcoin (WBTC) Trading: On-Chain Data",
    "url": "https://dailyhodl.com/2023/11/26/crypto-whale-profits-over-24000000-in-masterful-wrapped-bitcoin-wbtc-trading-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulate-35000.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An unknown crypto trader has been spotted on-chain clocking massive profits trading Wrapped Bitcoin (WBTC). According to blockchain tracking service Lookonchain, three wallets belonging to one &#8220;smart whale&#8221; deposited 1,957 WBTC worth $74.6 million into Binance on Friday. WBTC is an ERC-20 token pegged to the price of BTC, allowing traders to speculate on Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/26/crypto-whale-profits-over-24000000-in-masterful-wrapped-bitcoin-wbtc-trading-on-chain-data/\">Crypto Whale Profits Over $24,000,000 in Masterful Wrapped Bitcoin (WBTC) Trading: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]