[
  {
    "source": "Cointelegraph",
    "date": "2024-03-06T01:29:55.000Z",
    "title": " Bitcoin analysts say BTC price correction is just ‘healthy consolidation’ ",
    "url": "https://cointelegraph.com/news/bitcoin-analysts-say-btc-price-correction-is-just-healthy-consolidation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMjUxN2IzNTUtZjZhMy00ZGJkLWI0MDctOTIzZDM0YTBkYzA0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Traders say Bitcoin’s sell-off was needed, and dips are likely to be viewed as buying opportunities.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) set a new all-time high at $69,324 shortly after the opening bell on Wall Street on March 5, before sharply correcting 9.75% to $59,323, which analysts have described as a welcome move before “healthy consolidation” occurs. </p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed Bitcoin trading 9% below <a href=\"https://cointelegraph.com/news/bitcoin-price-sets-new-record-high-69k\">its new all-time high of $69,170</a>.</p><p>While BTC is still up 12% over the last seven days, the pioneer cryptocurrency’s flash crash left market participants wondering where the price will go moving forward. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-analysts-say-btc-price-correction-is-just-healthy-consolidation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-06T01:22:13.000Z",
    "title": " SEC claims Binance.US ‘unwilling’ to give info, requests court intervenes ",
    "url": "https://cointelegraph.com/news/sec-binance-us-unwilling-to-cooperate-lawsuit-investigation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvN2E1MmMwMjktM2JkMy00OTU4LWFhYjgtM2ZhZmM2NDM1MDQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Binance.US isn’t answering important questions, the SEC claims, but the crypto exchange says further requests exceeded the regulator’s bounds.</p>\n                    <p><p>Binance’s United States arm, Binance.US, hasn’t been providing answers to key questions relating to customer assets and other core elements of an ongoing investigation, the U.S. Securities and Exchange Commission claims.</p><p>BAM Trading Services — doing business as Binance.US — has been “unable or unwilling” to answer requests for information concerning the custody of customer assets, the SEC alleged in a March 5 joint status <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.222.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> to a Washington, D.C. District Court.</p><p>It asked the court to intervene to speed up the discovery process. </p><p><a href=\"https://cointelegraph.com/news/sec-binance-us-unwilling-to-cooperate-lawsuit-investigation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-06T01:23:00.000Z",
    "title": "Crypto Strategist Predicts ‘Craziest’ Rally for Altcoins, Surpassing Current Cycle Highs",
    "url": "https://www.cryptoglobe.com/latest/2024/03/crypto-strategist-predicts-craziest-rally-for-altcoins-surpassing-current-cycle-highs/",
    "description": "A prominent crypto strategist has forecasted a potential surge in the value of alternative cryptocurrencies, often referred to as altcoins, surpassing anything witnessed in the current market cycle. The pseudonymous cryptocurrency analyst, Altcoin Psycho, shared a post on the microblogging platform X (formerly Twitter) with their nearly 500,000 followers, noting there have been significant upward […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T01:30:16.000Z",
    "title": "Bitcoin Sets New All-Time High Above $69,000 As Institutionals Show FOMO",
    "url": "https://www.newsbtc.com/bitcoin-news/institutionals-bitcoin-fomo-coinbase-premium/",
    "description": "Bitcoin has set a new all-time high (ATH) above the $69,000 level as institutional investors have aggressively bought on Coinbase. Bitcoin Has Set A New ATH Above $69,000 The moment that every Bitcoin investor had been looking forward to has finally arrived today. The cryptocurrency just smashed past the record set in November 2021 to create a brand new ATH beyond the $69,000 level. BTC sets a new ATH &#124; Source: BTCUSD on TradingView This historical moment has come for the asset as institutional investors have been showing some strong buying pressure recently. Bitcoin Coinbase Premium Index Spikes To Highest Levels For 2024 As an analyst in a CryptoQuant Quicktake post explained, US institutional investors appear to be scrambling to buy Bitcoin as they are starting to feel FOMO with the sharp bullish momentum the cryptocurrency has enjoyed. The metric of interest here is the &#8220;Coinbase Premium Index,&#8221; which keeps track of the percentage difference between the Bitcoin prices listed on cryptocurrency exchanges Coinbase (USD pair) and Binance (USDT pair). Related Reading: Bitcoin Extreme Greed At Levels Higher Than Nov. 2021 Peak, Top Signal? The former exchange is the preferred platform for institutional traders based in the US, while the latter serves more global traffic. As such, the Coinbase Premium Index can provide hints about the differences in the buying and selling behaviors of the two groups. When the indicator has a positive value, the price listed on Coinbase is higher than on Binance. Such a trend implies that the buying pressure is higher (or selling pressure is lower) from the US-based investors compared to Binance users. On the other hand, the negative metric suggests that American institutional traders may be applying relatively high selling pressure on the market. Now, here is a chart that shows the trend in the Bitcoin Coinbase Premium Index over the past few months: The value of the metric appears to have been notably positive in recent days &#124; Source: CryptoQuant As displayed in the graph, the Bitcoin Coinbase Premium Index has registered a large positive spike recently, implying the difference between the prices on Coinbase and Binance has widened. The indicator had been floating inside the green territory for a while before this spike, and in this period of high buying pressure on Coinbase, the coin observed a sharp rally. This recent buying pressure would probably include sources like the spot exchange-traded funds (ETFs) approved this year. From the chart, it&#8217;s visible that the buying pressure has been even higher in the last couple of weeks, culminating in the latest spike. Interest around the asset among these institutional entities had only been growing recently, but the latest spike suggests FOMO has gone up a level for these investors. Related Reading: Shiba Inu &#38; Other Memecoins See 3,000% Spike In Volume: Good Sign For Rally? Given that institutional buying has been one of the main forces behind the latest rally in the cryptocurrency, it&#8217;s no wonder that its price has hit a fresh high off the back of the latest spike. Featured image from Jievani Weerasinghe on Unsplash.com, CryptoQuant.com, chart from TradingView.com"
  }
]