[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T23:30:16.000Z",
    "title": "Economist Peter Schiff Warns All Banks Will Fail, People Will Suffer Massive Losses as Banking Crisis Unfolds",
    "url": "https://news.bitcoin.com/economist-peter-schiff-warns-all-banks-will-fail-people-will-suffer-massive-losses-as-banking-crisis-unfolds/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Economist Peter Schiff Expects All Banks to Fail — Warns People Will Lose &#039;Tremendous Amount&#039; as Banking Crisis Unfolds\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/peter-schiff-banking-crisis1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Economist Peter Schiff has warned that all banks will fail and anyone having a bank account will end up losing money. “No matter what happens, people are going to lose a tremendous amount as this banking crisis unfolds,” Schiff stressed. Peter Schiff Warns About All Banks Failing Economist and gold bug Peter Schiff reiterated his [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T23:38:13.000Z",
    "title": "Multichain loses another $103 million in a potential rugpull",
    "url": "https://www.cryptopolitan.com/multichain-103-million-potential-rugpull/",
    "description": "In what is being considered one of the largest cryptocurrency hacks to date, cross-chain bridge Multichain fell victim to a devastating breach resulting in the loss of $125 million. Recent reports from blockchain data firm Chainalysis suggest that the exploit may have been an inside job, leaving the cryptocurrency community stunned and searching for answers. ... <a title=\"Multichain loses another $103 million in a potential rugpull\" class=\"read-more\" href=\"https://www.cryptopolitan.com/multichain-103-million-potential-rugpull/\" aria-label=\"More on Multichain loses another $103 million in a potential rugpull\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T23:29:39.000Z",
    "title": "Pre-100X Litecoin Signal Returns After Six-Year Slump",
    "url": "https://www.newsbtc.com/news/litecoin/pre-100x-litecoin-signal-returns-six-year-slump/",
    "description": "Litecoin price is now back under $100, locked within an ever tightening trading range. The lack of notorious cryptocurrency market volatility in LTCUSD in recent weeks is reminiscent of late 2016 and early 2017 — right before an epic 100x rally. With the signal back, does this mean that another sizable surge is ahead? A Pre-100x Litecoin Signal Is Back Past performance is never a guarantee of future results, but technical analysis seeks out various signals and historical patterns in hopes of increasing the probability of success. What can be guaranteed, however, is that after a long period of low volatility, it ends with a bang and a breakout back into a highly volatile state. Combine this behavior with the more volatile crypto asset class, and you’ve got a recipe for some serious moves. So large in fact, that the lowest volatility that Litecoin ever reached, concluded with a breakout into a 100x rally. In less than a year’s time, LTCUSD grew from $3 to over $300. Now that signal is back again, and it could once again lead to a huge move in Litecoin. But it doesn’t necessarily mean up. It’s been a long time since bulls had a turn &#124; LTCUSD on TradingView.com Why Low Volatility Ends With A Bang The pre-100x signal in LTCUSD we are talking about is the 9-day Bollinger Bands, and Bollinger Band Width. The Bollinger Bands are the second-tightest in Litecoin history. The Bollinger Bands are a volatility-measuring tool using a simple moving average and two bands set at two standard deviations. They expand with high volatility and contract with low volatility. A low volatility state, called a squeeze, always ends with a significant move and turn to shocking volatility. But volatility is only the measure of price dispersion over a time period. This means a that the large move, when it finally arrives, could be down. However, several other technicals support price appreciation in the future so up is also an option. What isn’t an option, is remaining in this low volatility state for much longer, so buckle up, it’s about to get interesting soon enough. Furthermore, Bollinger Band Width has been contracting with lower highs for six full years. If the downtrend pattern breaks, the largest movement in half a decade might arrive. #Litecoin volatility is compressing for six years now Lowest volatility since $LTC went from $3 to $300 (100x) in 2017 Patience will be rewarded. The longer it takes, the larger the move. When it begins, it will be a sight to behold pic.twitter.com/YTtbB0TrJz — Tony &#8220;The Bull&#8221; (@tonythebullBTC) July 9, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]