[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T22:54:34.000Z",
    "title": "Bitcoin Drifts Near $29.2K, Unstirred by Macro Events; ADA, SOL, MATIC Steady in the Red",
    "url": "https://www.coindesk.com/markets/2023/08/03/crypto-markets-today-btc-eth-ada-sol-matic-price-analysis/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The largest cryptocurrency by market cap is likely to remain stubbornly rangebound a little above $29,000, market analysts believe."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-03T23:00:38.000Z",
    "title": "SEC chair Gary Gensler pivots agency’s attention to AI: “We can get to crypto later”",
    "url": "https://cryptoslate.com/sec-chair-gary-gensler-pivots-agencys-attention-to-ai-we-can-get-to-crypto-later/",
    "description": "<p>According to reporting from Bloomberg, U.S. Securities and Exchange Commission (SEC) chair Gary Gensler is downplaying its focus on cryptocurrency to direct its attention toward artificial intelligence, a technology that he says &#8220;warrants the hype.&#8221; Gensler, who has been confronting an industry he claims is replete with scams and fraud in cryptocurrency, is now training [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-chair-gary-gensler-pivots-agencys-attention-to-ai-we-can-get-to-crypto-later/\">SEC chair Gary Gensler pivots agency&#8217;s attention to AI: “We can get to crypto later”</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T23:00:00.000Z",
    "title": "Ethereum Price Could Break Above $2,000 If This Happens",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-could-break-above-2000/",
    "description": "Ethereum price is currently still below $2,000 but this could quickly change if some things were to come to pass. Some of the most notable things that have been going on for the cryptocurrency include the multiple exchange-traded funds (ETFs) filings that have been made to the United States Securities and Exchange Commission (SEC). When Will An Ethereum ETF Be Approved? The topic of Ethereum futures ETFs has become hotter especially after Bitcoin futures ETFs received multiple approvals from the SEC since 2021. However, even two years after the first Bitcoin futures ETF was approved, the regulator is still yet to approve an Ethereum futures ETF. Related Reading: Litecoin Sharks Buy More Than 200,000 LTC Ahead Of Wednesday’s Halving Despite this, investment firms have remained undeterred as they have continued to file for Ethereum futures ETFs. As reported by NewsBTC, there are now a total of six ETH futures ETF filings with the SEC after Grayscale refiled its application with the regulator. In addition to Grayscale, VanEck, ProShares, Volatility Shares, Bitwise, and Roundhill all have pending applications with the commission. With so many interested applications, there is now mounting pressure on the SEC to approve the first Ethereum futures ETF to trade in the country. And according to people familiar with the matter, it may not be much longer until the first ETF is approved for trading. The reason behind this is the fact that the regulator had previously asked interested parties to halt activities regarding applying for ETH ETFs. However, with the re-filings and new filings, it signals that the SEC may finally be ready to review the applications and consider them. ETH price still holding above $1,800 &#124; Source: ETHUSD on Tradingview.com What Happens When An ETF Gets Approved? The anticipation around a possible approval for an Ethereum futures ETF is mostly the implications of such an occurrence. Like in 2021 when the first Bitcoin futures ETF was approved in October, the price of BTC surged drastically, reaching a new all-time high price just a month later. Related Reading: Bitcoin Investor Sentiment Flips Toward Greed Despite Fall Below $29,000 ETFs are an instrument that helps to bring more volume to an asset and if an ETH ETF gets approved, the price of ETH is expected to rally. This would be the result of a combination of the new volume and interest, as well as the euphoria that comes with it. An ETF approval would likely push the price of ETH above $2,000 and could trigger another bull rally for the coin. Currently, all eyes are on October 16, 2023, when one new filing and four re-filings for Ethereum futures ETFs become active. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]