[
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T02:02:34.000Z",
    "title": "‘Let's just diversify and see' — Binance CEO on its stablecoin strategy",
    "url": "https://cointelegraph.com/news/changpeng-zhao-cz-binance-stablecoin-strategy-tether-busd",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2fb1f7c5-8978-44ae-9001-0f0e358ca84d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Due to regulatory and transparency risks, CZ says that spreading risk across different stablecoins is the key to longevity.</p>\n                    <p><p>Binance CEO Changpeng ‘CZ’ Zhao is looking to bring smaller algorithmic stablecoins to the market, in a bid to offer investors options other than the current global stablecoin giants.</p><p>Speaking in a July 31, ask me anything (AMA) session on Twitter, CZ cited risks associated with large stablecoins such as Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>), saying that while Tether is by far the largest stablecoin by market cap, he remains cautious of the asset due to its lack of transparency:</p><blockquote>“I personally have not seen any audit reports of USDT. I don't think most people I spoke to have not seen that either. So it's kind of a black box because we just don't know.” </blockquote><p>Even supposedly well-regulated and fully audited stablecoins such as Binance USD come with their own set of unforeseeable risks, he added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And we&#39;re live!  <br><br>Tune in to our Twitter Space with <a href=\"https://twitter.com/cz_binance?ref_src=twsrc%5Etfw\">@cz_binance</a> below <a href=\"https://t.co/KzU2bmdgxG\">https://t.co/KzU2bmdgxG</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1685976178006351873?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Feb. 13, blockchain infrastructure platform Paxos Trust Company <a href=\"https://cointelegraph.com/news/paxos-to-stop-minting-busd-stablecoins-for-binance\">ended its partnership with Binance</a> and ceased minting new BUSD stablecoins, following an order from the New York Department of Financial Services (NYDFS).</p><p>“We should just work with as many stablecoins as possible. We shouldn't have a single bet,” he said, highlighting that the regulator moved to shut down BUSD despite it being fully audited.</p><p>As a result of the regulatory and transparency risks, CZ revealed that Binance is working on algorithmic stablecoins as well as diversifying its stablecoin partnerships to spread out potential risk. </p><p>\"We actually have a small team working on algo stablecoins in different places that are not high scale, but they are very relevant locally in those places,\" he said, adding: </p><blockquote>\"So our approach is, you know, given everything has some risk, let's just diversify and see which one grows bigger.\"</blockquote><p>Cointelegraph reached out to Binance for further comment but did receive a response by the time of publication. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-wins-operational-crypto-license-in-dubai\"><strong><em>Binance to offer crypto broker-dealer services in Dubai with new license</em></strong></a></p><p>Notably, the CEO also announced Binance’s plans to launch the First Digital USD (FDUSD) in Hong Kong as well as setting its sights on new stablecoin options in Europe.</p><p>First Digital USD is a programmable U.S. dollar-pegged stablecoin managed by First Digital Group and licensed in Hong Kong. The company <a href=\"https://research.binance.com/en/projects/first-digital-usd\" target=\"_blank\" rel=\"noopener nofollow\">listed</a> the FDUSD stablecoin on Binance onJuly 26. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We at First Digital are both excited and delighted at the support we&#39;ve recieved so far with this initiative. Thanks <a href=\"https://twitter.com/cz_binance?ref_src=twsrc%5Etfw\">@cz_binance</a> for the nod!! <a href=\"https://twitter.com/hashtag/stablecoin?src=hash&amp;ref_src=twsrc%5Etfw\">#stablecoin</a> <a href=\"https://twitter.com/hashtag/innovation?src=hash&amp;ref_src=twsrc%5Etfw\">#innovation</a> <a href=\"https://t.co/o61PXj0mad\">https://t.co/o61PXj0mad</a></p>&mdash; First Digital (@FirstDigitalHQ) <a href=\"https://twitter.com/FirstDigitalHQ/status/1664141314944905218?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance continues to be the subject of regulatory uncertainty. On July 28, <a href=\"https://cointelegraph.com/news/binance-cz-challenge-cftc-seek-lawsuit-dismissal\">CZ sought the dismissal</a> of a <a href=\"https://cointelegraph.com/news/cftc-allegations-and-1-billion-lawsuit-for-binance-law-decoded-march-27-april-3\">$1 billion lawsuit brought against him and Binance</a> by the Commodities Futures Trading Commission (CFTC), accusing the regulator of “overreaching” its jurisdiction. </p><p>On June 5, the U.S. Securities and Exchange Commission (SEC) filed a <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">lawsuit against Binance, CZ and other affiliated entities</a>, alleging that they were involved in the sale of unregistered securities, fraud and conflicts of interest. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]