[
  {
    "source": "CoinDesk",
    "date": "2023-08-01T20:16:15.000Z",
    "title": "MicroStrategy Books Impairment Charge of $24.1M on Massive Bitcoin Holdings in Q2 ",
    "url": "https://www.coindesk.com/business/2023/08/01/microstrategy-books-impairment-charge-of-241m-on-massive-bitcoin-holdings-in-q2/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The software firm reported its second-quarter earnings after the close on Tuesday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T20:29:32.000Z",
    "title": "Voyager customers targeted by scammers during 30-day withdrawal period: Report",
    "url": "https://cointelegraph.com/news/voyager-customers-targeted-by-scammers-during-30-day-withdrawal-period-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/20f21db1-90fd-4342-a085-70989c82fa5e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Phony websites offered customers a premium for claiming through them. In reality, they drained customers’ wallets.</p>\n                    <p><p>Scammers set their sights on Voyager Digital customers during the month-long window when they were able to withdraw some portion of their funds from the bankrupt crypto brokerage, Bloomberg <a href=\"https://www.bnnbloomberg.ca/voyager-may-have-been-hacked-in-bankruptcy-process-as-customers-recovered-money-1.1953543\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>, citing Darren Azman, a lawyer for the firm. Law enforcement has been notified of the situation, he added.</p><p>Voyager customers <a href=\"https://cointelegraph.com/news/voyager-app-open-customer-withdrawals-june-20\">withdrew $490 million</a> between June 23 and July 22. That sum was almost 80% of the amount available, Azman said at a hearing of the Southern District of New York Bankruptcy Court held by telephone.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/s8V5L7xPUuU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>According to Bloomberg, scammers used various approaches, with a typical method being to offer Voyager customers higher returns through fake websites that drained customers’ wallets after being linked to them. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">gm fam, I&#39;m very excited to finally share my latest work with you. Quick explainer thread bellow for context  <a href=\"https://t.co/HzDPetNGF3\">pic.twitter.com/HzDPetNGF3</a></p>&mdash; ɅLFIE (@Degen_Alfie) <a href=\"https://twitter.com/Degen_Alfie/status/1560646102575362048?ref_src=twsrc%5Etfw\">August 19, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The problem did not go completely unnoticed at the time. The California Department of Financial Protection and Innovation (DFPI) <a href=\"https://dfpi.ca.gov/2023/07/19/investor-alert-false-crypto-bankruptcy-website/\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a warning that Voyager customers were receiving letters, calls and emails using Voyager CEO Stephen Ehrlich’s name and falsely offering higher returns for users of a sham website. That warning was dated July 19. The DFPI said:</p><blockquote>“The communications may include consumer information that is correct, including the total initial return amount customers were expecting to receive in the Voyager bankruptcy.”</blockquote><p>Very few customers were fooled by the scams, Azman said.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/creditors-for-bankrupt-voyager-digital-billed-5-1m-in-legal-fees\">Creditors for bankrupt Voyager Digital billed $5.1M in legal fees</a></em></strong></p><p>Voyager once had 3.5 million customers and $6 billion worth of crypto assets. It <a href=\"https://cointelegraph.com/news/voyager-digital-files-for-chapter-11-bankruptcy-proposes-recovery-plan\">filed for bankruptcy</a> on July 5, 2022 in the wake of the Three Arrows Capital collapse. It is the first of the failed crypto firms to return any money to its customers. </p><p>FTX US bought Voyager’s assets in September, but the FTX collapse prevented that deal  from going through. Binance.US was set to buy $1 billion of Voyager assets in April but backed out at the last minute. A <a href=\"https://cointelegraph.com/news/voyager-bankruptcy-plan-approved-customers-may-recover-35-7-of-claims-initially\">bankruptcy plan was approved</a> by Judge Michael Wiles in May that provided customers with about 36 cents for every dollar of their claims. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\">Get your money back: The weird world of crypto litigation</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-01T20:15:50.000Z",
    "title": "Video of Richard Heart publicly disparaging SEC resurfaces as securities fraud case moves forward",
    "url": "https://cryptoslate.com/richard-heart-addresses-sec/",
    "description": "<p>An old video clip of HEX founder Richard Heart directly addressing the SEC has resurfaced on social media after the regulator filed suit against him on July 31, alleging fraud and unregistered sales of crypto asset securities. In the video, taken from January&#8217;s HexConference, Heart directly addresses the SEC to say that he has saved [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/richard-heart-addresses-sec/\">Video of Richard Heart publicly disparaging SEC resurfaces as securities fraud case moves forward</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T20:23:03.000Z",
    "title": "Are the AI Godbots Coming? Surrendering Autonomy and Empowering Bad Actors",
    "url": "https://www.cryptopolitan.com/are-the-ai-godbots-coming/",
    "description": "The rise of AI godbots, such as ChatGPT and Delphi, has introduced a novel concerning artificial intelligence development. These bots, named after religious figures like Jesus and Krishna, claim to provide divine-like answers and solutions to users&#8217; questions and ethical dilemmas. However, the emergence of such godlike AI raises two serious concerns: the potential for ... <a title=\"Are the AI Godbots Coming? Surrendering Autonomy and Empowering Bad Actors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/are-the-ai-godbots-coming/\" aria-label=\"More on Are the AI Godbots Coming? Surrendering Autonomy and Empowering Bad Actors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T20:15:00.000Z",
    "title": "GameStop withdraws support for crypto wallets amid regulatory uncertainty",
    "url": "https://www.cryptopolitan.com/gamestop-withdraws-support-crypto-wallets-regulatory-uncertainty/",
    "description": "Leading video game retailer GameStop (GME) announced that it would discontinue support for its crypto wallets, a move that comes in the wake of heightened regulatory scrutiny in the United States. The wallets, which enabled users to manage both cryptocurrencies and non-fungible tokens (NFTs), will be removed from the market on November 1, 2023. The ... <a title=\"GameStop withdraws support for crypto wallets amid regulatory uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gamestop-withdraws-support-crypto-wallets-regulatory-uncertainty/\" aria-label=\"More on GameStop withdraws support for crypto wallets amid regulatory uncertainty\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-01T20:30:53.000Z",
    "title": "Bitcoin Drops Under $29,000, Here’s Where BTC Could Find Support Next",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-drops-under-29000-btc-find-support-next/",
    "description": "Bitcoin has plunged below the $29,000 level during the past day. According to on-chain data, here&#8217;s the next level that could act as major support. Bitcoin Short-Term Holder Realized Price May Be The Next Support Level As pointed out by an analyst in a CryptoQuant post, the realized price of the short-term holders at $28,000 could be an essential level for the asset. The “realized price” here refers to the cost basis (that is, the buying price) of the average investor in the Bitcoin market. Whenever the price of the asset dips below this level, it means that more than 50% of the investors are now underwater. Similarly, a break above the point implies that the overall market has entered into a state of profits. In the context of the current discussion, the realized price of the entire market isn’t of relevance, but rather of a specific segment of it: the “short-term holders” (STHs). This investor group typically only includes holders who bought their BTC within the last six months. Here is a chart that shows the trend in the average cost basis for this Bitcoin cohort over the history of the cryptocurrency: How the realized price of the STHs has shifted throughout history &#124; Source: CryptoQuant Historically, the Bitcoin STH realized price has had some interesting interactions with the spot price of the asset. First is the interactions during bullish periods, which the quant has highlighted in the above graph. It would appear that during these rallies, the price has usually remained above the level. But not just that, the STH realized price has actually actively provided support to it in such periods. In the rally during the past year, too, a similar trend has been seen, as both during the March and June price drawdowns, the cryptocurrency rebounded when it made a retest of this line. Related Reading: Is Another Bitcoin Rally Coming Soon? This Pattern May Say So Psychologically, investors view their cost basis as a profitable buying opportunity during bullish periods, as they believe that the price will only go up from here. So, whenever the asset returns to its cost basis in such periods, they are likely to accumulate again. This extraordinary buying pressure at the level of the STHs could perhaps explain why Bitcoin finds support here. In a similar way, the level acts as resistance during bearish periods, as investors start looking at their acquisition price as the ideal exit opportunity. From the chart, it’s visible that the Bitcoin spot price is approaching the STH realized price once again right now. This level, which is valued at $28,000 currently, could possibly be where Bitcoin can turn around its recent trend of decline. Related Reading: US Presidential Candidate Defends Bitcoin, Calls Out Environmental Critics The analyst warns, however, “if the realized price of short-term holders fails to hold, the bull market may be over.” BTC Price At the time of writing, Bitcoin is trading around $28,900, down 1% in the last week. BTC has been going down recently &#124; Source: BTCUSD on Tradingview Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]