[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T09:00:29.000Z",
    "title": "U.S. Has Room for a Compliant Crypto ETF to Grow Market Share as a Bitcoin On-Ramp: Bernstein",
    "url": "https://www.coindesk.com/business/2023/06/26/us-has-room-for-a-compliant-crypto-etf-to-grow-market-share-as-a-bitcoin-on-ramp-bernstein/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Grayscale earns around $380 million in annualized fees despite its GBTC product being inefficient, illiquid and trading at a discount, the report said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T08:50:00.000Z",
    "title": "The best blockchain “does not exist” — Cardano Foundation exec",
    "url": "https://cointelegraph.com/news/the-best-blockchain-does-not-exist-cardano-foundation-exec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/13f77756-a7f1-4f95-84a0-0d5bb47690d3.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Mel McCann, vice president of engineering at the Cardano Foundation, argued that there are different use cases for various blockchains. </p>\n                    <p><p>While many community members enjoy arguing about what the ultimate blockchain is, an executive from the Cardano Foundation believes that these arguments should stop, as use cases dictate which blockchain is most appropriate for specific projects. </p><p>At the World Token Summit in Dubai, Cointelegraph spoke with Mel McCann, vice president of engineering at the Cardano Foundation. The executive spoke about various topics, including enterprise adoption and the need to stop arguing about what blockchain is the best. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1585142a-6327-47a3-8ec9-9ec84f1a6d6b.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Cardano Foundation's Mel McCann (left) with Cointelegraph reporter Ezra Reguerra at the World Token Summit in Dubai. Source: Cointelegraph</em></figcaption></figure><p>According to McCann, blockchain offers many potential benefits in terms of tracking the history of basically anything. “There’s lots of different ways that you can use the blockchain for proof of origin, for provenance, for all of these things,” he said. There are many ways for companies to leverage the blockchain for different purposes. </p><p>However, McCann said that this doesn’t mean enterprises need to entirely change their business models to adapt. The executive explained that one of the things that interests him is identifying areas that might help enterprises “augment” what they already do. He said: </p><blockquote>“We’re not looking to change people’s business models. What we’re looking to do is: How can they better improve their business models by leveraging Web3 capabilities?”</blockquote><p>The executive also told Cointelegraph how education plays a role in onboarding enterprises into Cardano and Web3. “We do spend a lot of time on education, like direct education with enterprises, not just on the mass education platform that we’re building,” McCann noted. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rising-institutional-interest-is-a-bullish-sign-for-crypto-seba-bank-exec\"><strong><em>Rising institutional interest is a ‘bullish’ sign for crypto: SEBA Bank exec</em></strong></a></p><p>When asked to compare the advantages and disadvantages of various blockchain platforms, McCann said there are different use cases for each. The executive also said there’s no such thing as the ultimate blockchain. He said: </p><blockquote>“One of the things that I think people need to stop doing is going, ‘What’s the ultimate blockchain?’ You know, ‘What’s the best blockchain for this?’ And, it doesn’t exist in my mind because it really depends.”</blockquote><p>McCann argued that only the person creating a business could assess which blockchain would be the most appropriate for their business. The executive argued that there are different benefits to using different blockchains. “I’m never going to turn around and say, yeah, it’s a one-stop shop. It’s not the way it works,” he explained. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\"><strong><em>Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T09:07:02.000Z",
    "title": "Paul Tudor Jones cautious about buying more Bitcoin as macro narrative turns",
    "url": "https://cryptoslate.com/paul-tudor-jones-cautious-about-buying-more-bitcoin-as-macro-narrative-turns/",
    "description": "<p>American billionaire hedge fund manager Paul Tudor Jones said he&#8217;s sticking with Bitcoin (BTC) but wonders whether regulatory hostilities, falling inflation, and AI developments will hamper future price growth. CNBC&#8217;s Andrew Sorkin pointed out that Tudor Jones bought Bitcoin during the health crisis when it was priced at around $8,000, continuing to ride it through [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/paul-tudor-jones-cautious-about-buying-more-bitcoin-as-macro-narrative-turns/\">Paul Tudor Jones cautious about buying more Bitcoin as macro narrative turns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T09:00:33.000Z",
    "title": "DWF Labs and Algorand Foundation Reach Strategic Partnership",
    "url": "https://cryptodaily.co.uk/2023/06/dwf-labs-and-algorand-foundation-reach-strategic-partnership",
    "description": "<p>Dubai, Dubai, June 26th, 2023, Chainwire</p><p>DWF Labs, the global multi-stage Web3 investment firm, has announced a partnership with Algorand Foundation to support the health and growth of the ecosystem built on the Algorand blockchain.</p><p>The first component of the partnership involves a $50 million ALGO token purchase agreement to, in part, provide liquidity into the Algorand ecosystem.</p><p>An additional MOU has been signed with the aim of allocating funds to support projects that are building on the Algorand blockchain in the spaces of DeFi, Art and Music, Gaming, Oracles and Bridges, and Infrastructure. Projects interested in submitting their pitch can get in contact with DWF Ventures by visiting: http://www.dwf-labs.com/algorand.</p><p>Andrei Grachev, Managing Partner of DWF Labs, shared his enthusiasm for this partnership and its potential for revolutionising blockchain innovation, as well as DWF Labs&rsquo; commitment to actively participate in the building of the Algorand ecosystem.</p>&ldquo;We selected Algorand because of its unparalleled level of technology and security among permissionless DLTs, as well as its leadership in environmental sustainability and social impact. Algorand's blockchain infrastructure provides the speed and instant finality required for creators, financial institutions and governments to smoothly transition to the new digital economy at scale, in an environmentally responsible manner. This partnership with the Algorand Foundation is another important step&nbsp; in the maturation and growth of innovation in this space,&rdquo; said Grachev.<p></p><p>About the Algorand Foundation</p><p>The Algorand Foundation empowers a dynamic, inclusive, and borderless global ecosystem - at scale - based on the Algorand blockchain technology.&nbsp; Designed by MIT professor and Turing Award winning cryptographer Silvio Micali, Algorand is uniquely capable of delivering on the promise of a borderless global economy. It achieves transaction throughputs at the speed of traditional finance, but with immediate finality, near zero transaction costs, and on a 24/7 basis. Its carbon-neutral platform and unique pure proof-of-stake consensus mechanism achieves both security and scalability on a decentralized protocol, and without a second of downtime since it went live in 2019.</p><p>About DWF Labs</p><p>DWF Labs is a global digital asset market maker and multi-stage web3 investment firm, providing support from token listing to market making to OTC trading solutions. DWF Labs seeks to invest and support bold founders who want to build the future of Web3.</p><p></p>ContactManaging Partner DWF LabsAndrei Grachevag@dwf-labs.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T09:00:47.000Z",
    "title": "Why Investors Are Choosing Caged Beasts Over Established Cryptos Shiba Inu and Cardano",
    "url": "https://www.crypto-news-flash.com/why-investors-are-choosing-caged-beasts-over-established-cryptos-shiba-inu-and-cardano/?utm_source=rss&utm_medium=rss&utm_campaign=why-investors-are-choosing-caged-beasts-over-established-cryptos-shiba-inu-and-cardano",
    "description": "Community engagement plays a pivotal role in the success of any crypto project. Caged Beasts (BEASTS), a meme coin presale, has introduced a unique referral scheme that not only generates passive income but also strengthens its community. In this article, we will delve into the fascinating world of Caged Beasts and compare it to two [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T08:40:37.000Z",
    "title": "Bitcoin Retailers Brace for Wave of Bomb Threats: Kroger, Walmart, and Whole Foods Among Targets",
    "url": "https://www.crypto-news-flash.com/bitcoin-retailers-brace-for-wave-of-bomb-threats-kroger-walmart-and-whole-foods-among-targets/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-retailers-brace-for-wave-of-bomb-threats-kroger-walmart-and-whole-foods-among-targets",
    "description": "Major Bitcoin retailers, including Kroger, Walmart, and Whole Foods, are facing a wave of bomb threats, creating significant concerns within the industry. Law enforcement agencies, including the FBI, are actively investigating these threats and working closely with affected retailers to ensure the safety and security of employees and customers. Bitcoin retailers are currently grappling with [...]"
  }
]