[
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T09:01:02.000Z",
    "title": "Binance Australia blames AUD liquidity drop for Bitcoin discount",
    "url": "https://cryptoslate.com/binance-australia-blames-aud-liquidity-drop-for-bitcoin-discount/",
    "description": "<p>Binance has cited reduced liquidity in Australian Dollar (AUD) pairs as the cause for trading discounts of Bitcoin (BTC) and other digital assets on its Australian platform, according to an emailed statement to CryptoSlate. A spokesperson for the crypto exchange explained that some users &#8220;have been withdrawing their AUD holdings from the platform in anticipation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-australia-blames-aud-liquidity-drop-for-bitcoin-discount/\">Binance Australia blames AUD liquidity drop for Bitcoin discount</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T08:50:00.000Z",
    "title": "Bank Of Japan Completes Second Stage Of CBDC Program",
    "url": "https://cryptodaily.co.uk/2023/05/bank-of-japan-completes-second-stage-of-cbdc-program",
    "description": "<p>The Bank of Japan (BOJ) has announced the completion of the second stage of its CBDC (central bank digital currency) program and is now moving ahead with its pilot project.</p>\n<p>Japan launched its pilot program on CBDCs in April.&nbsp;</p>\nCBDC Program To Go Ahead&nbsp;\n<p>The bank released a report upon the completion of the second phase of its study on the possibility of the creation of a central bank digital currency. The bank began its first phase for the proof of concept in April 2021, with the second phase beginning a year later. The second phase enhanced and built on the foundational ledger functions explored in the initial phase. The bank stated in its report,&nbsp;</p>\n\n<p>&ldquo;We have launched in April 2023 and are proceeding with the pilot program. In the pilot program, the end-to-end process flow will be tested, the measures and potential challenges for connection with external systems will be explored, and considerations and solutions indicated as necessary in the PoCs will also be explored.&rdquo;</p>\n\n<p>It also talked about establishing a CBDC forum to facilitate inputs from the private sector.</p>\n\n<p>&ldquo;Further, a CBDC Forum will be established with a view to proceeding with institutional arrangements for CBDC in an appropriate manner, and ideas and insights set out by private businesses related to retail payments will be drawn upon to deepen the study.&rdquo;</p>\n\nThe Orchestration System&nbsp;\n<p>According to the report, the second phase focused on technologies that would help establish limits on CBDC holdings. The Bank of Japan views this as critical in ensuring long-term financial stability. The limits are in anticipation of abrupt transitions from traditional banking services to CBDCs and also cover situations where one user maintains multiple accounts through different intermediaries. The second phase also studied user-friendly procedures to initiate and schedule payments and technological advantages in ledger designs and database languages. To accommodate multiple transactions more efficiently, the report also studied the introduction of an orchestration system.&nbsp;</p>\n<p>In the experiment, a model consisting of 100,000 users and five intermediaries was utilized, testing transactions ranging from 500 to 3000 transactions per second. According to the Bank of Japan, the Proof of Concept achieved its objective, clearing the way for the launch of the CBDC pilot project.</p>\nMany Countries Exploring CBDCs&nbsp;\n<p>Countries around the world are exploring the possibility of creating a central bank digital currency, according to data from the Atlantic Council. The Atlantic Council tracks CBDCs in over 120 countries. 18 countries are in the pilot stage of launching a CBDC. These include India, China, and Japan. Another 11 countries have launched a CBDC, according to the council.&nbsp;</p>\n\n<p>&ldquo;In 2023, over 20 countries will take significant steps towards piloting a CBDC. Australia, Thailand, Brazil, India, South Korea, and Russia intend to continue or begin pilot testing in 2023. The ECB [European Central Bank] is also likely to start a pilot next year.&rdquo;</p>\n\nMixed Reactions In The United States&nbsp;\n<p>However, lawmakers in the United States of America have mixed feelings about a CBDC. Supporters of CBDCs have argued that they can provide better financial services to citizens, while critics have raised concerns that a CBDC could pose significant privacy concerns. Democratic Rep. Jake Auchincloss of Massachusetts and Republican Rep. French Hill of Arkansas have introduced a bill called the &ldquo;Power of the Mint&rdquo; to block the Federal Reserve from issuing a CBDC.</p>\n<p>Meanwhile, Republican Senator Ted Cruz and Rep. Tom Emmer have also introduced bills to block the Federal Reserve from issuing CBDCs directly to individuals. The Fed has gone on record stating that it has yet to make a decision on issuing a CBDC and would require congressional approval to do so.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T08:45:00.000Z",
    "title": "Tulipart.com Launches A Collection of Tulip NFTs Minted Daily over 7 Years",
    "url": "https://cryptodaily.co.uk/2023/05/tulipartcom-launches-a-collection-of-tulip-nfts-minted-daily-over-7-years",
    "description": "<p>Zug, Switzerland, May 24th, 2023, Chainwire</p><p>Tulipart.com is a collection of 10,000 unique tulip NFTs. Over a period of 7 years, 4 Tulip NFTs will be minted every day until the goal of 10,000 is reached. Each Tulip NFT consists of six different components, which range from common to exclusive, making them more or less rare.</p><p>New Tulip NFTs aren't available for direct purchase; they are solely distributed to $LAND token holders via a lottery system. Participation involves holding and staking $LAND tokens. Staking a higher amount of $LAND tokens elevates the chances of acquiring a Tulip NFT each day.</p><p>$LAND tokens may be procured at no cost via the ongoing airdrop at Tulipart.com. Any Ethereum address holder can verify their participation eligibility. Ineligibility for the airdrop doesn't impede the opportunity to procure $LAND on Uniswap, effectively enhancing the probability of winning a Tulip NFT.</p><p></p><p>About Tulipart</p><p>Tulipart.com is a cutting-edge platform fostering the innovation and creativity within the cryptocurrency and NFT landscapes. Based in Zug, Switzerland, a global hub for blockchain technology, Tulipart.com is the epicenter of a unique collection of 10,000 one-of-a-kind tulip NFTs, set to be minted over a period of seven years.</p><p>Those interested can visit Tulipart.com to claim their $LAND tokens, stake them, and win a Tulip NFT.</p><p>Tulipart website: www.tulipart.com</p><p>Airdrop page: https://www.airdrop.com/tulip</p><p>Opensea: https://opensea.io/collection/tulipart-1</p><p>Discord: https://discord.gg/h3xzdcHReN</p><p>Telegram: https://t.me/tulipart</p><p>Tulipart logo: https://bit.ly/3GnTiif&nbsp;</p>ContactMarketingGiorgio MinguzziTulip Art AGgiorgio.m@airdrop.com+393472620489"
  },
  {
    "source": "NullTX",
    "date": "2023-05-30T09:08:33.000Z",
    "title": "While TMS Network (TMSN) rises in presale, Shiba Inu (SHIB) and Uniswap (UNI) price forecasts trending positive",
    "url": "https://nulltx.com/while-tms-network-tmsn-rises-in-presale-shiba-inu-shib-and-uniswap-uni-price-forecasts-trending-positive/",
    "description": "The Internet is a remarkable realm brimming with unique culture, traditions, and its own peculiar language. In the &#8220;offline world,&#8221; financial institutions are known for their serious demeanor and respectability. TMS Network (TMSN) emerges as an innovative decentralized exchange. However, online enterprises like Uniswap (UNI) and Shiba Inu (SHIB) are shattering the notion that seriousness [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-05-30T09:00:56.000Z",
    "title": "Sam Altman’s Crypto Project Worldcoin Got More Coin in Latest $115M Raise, While HedgeUp Raises $2.7M in Stage 3 Presale",
    "url": "https://nulltx.com/sam-altmans-crypto-project-worldcoin-got-more-coin-in-latest-115m-raise-while-hedgeup-raises-2-7m-in-stage-3-presale/",
    "description": "The crypto project Worldcoin is keeping up with its impressive trend of attracting funding. In its latest funding round, the project has raised $115 million.  The investment project HedgeUp (HDUP) is also impressive on the DeFi side of things. Currently, in stage 3, the project’s presale has raised $1.8 million and counting. Sam Altman’s Worldcoin [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T08:50:03.000Z",
    "title": "Best performing crypto in May 2023",
    "url": "https://crypto.news/best-performing-crypto-in-may-2023/",
    "description": "The global crypto industry witnessed an immense rise in April for around ten days, but it has been consolidating since the beginning of May. The total crypto market cap has moved between $1.11 trillion and $1.13 trillion. Here are the&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-30T09:03:17.000Z",
    "title": "Beginners Guide About WINR Protocol – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/beginners-guide-about-winr-protocol-part-2/",
    "description": "<p>This is Part 2 of our beginner&#8217;s guide to WINR Protocol. You can find a link to PART 1 here. In this second part, we will answer a few more popular questions about the WINR Protocol. Since it’s DeFi, there’s no KYC for the games. So, let&#8217;s dig into WINR Protocol and see what&#8217;s cooking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/beginners-guide-about-winr-protocol-part-2/\">Beginners Guide About WINR Protocol – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-30T08:43:59.000Z",
    "title": "3 BIG Crypto Airdrops if You Missed Arbitrum or Aptos",
    "url": "https://www.altcoinbuzz.io/product-release/3-big-crypto-airdrops-if-you-missed-arbitrum-or-aptos/",
    "description": "<p>What do Optimism (OP), Aptos (APT), and Arbitrum (ARB) have in common? Right, all three had recent airdrops. Together, closing in on anywhere between $5,000 and $10,000. So, airdrops can bring you &#8216;free&#8217; money. However, it&#8217;s not completely free, though. For most airdrops, you have to complete tasks. New blockchains have testnets that need testing. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/3-big-crypto-airdrops-if-you-missed-arbitrum-or-aptos/\">3 BIG Crypto Airdrops if You Missed Arbitrum or Aptos</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T08:50:00.000Z",
    "title": "Binance Australia Sees Bitcoin Prices Tumble Amidst Regulatory Issues",
    "url": "https://coinedition.com/binance-australia-sees-bitcoin-prices-tumble-amidst-regulatory-issues/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance_Australia\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Binance_Australia_customers_seen_selling_bitcoin_at_discount_to.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Australia-based customers of Binance, the world&#8217;s largest cryptocurrency exchange, have been liquidating their Bitcoin holdings at a substantial discount, with prices on the platform falling to almost A$9,000 below those on rival exchanges. This occurred in the wake of the exchange losing its banking partners and facing regulatory scrutiny, prompting a rush to exit among [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-australia-sees-bitcoin-prices-tumble-amidst-regulatory-issues/\">Binance Australia Sees Bitcoin Prices Tumble Amidst Regulatory Issues</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]