[
  {
    "source": "Decrypt",
    "date": "2023-10-27T22:59:13.000Z",
    "title": "Google Doubles Down with $2 Billion Investment in Claude AI Developer Anthropic",
    "url": "https://decrypt.co/203563/google-follows-400-million-dollar-investment-in-anthropic-with-2-billion",
    "description": "Amid a high-stakes rivalry with Microsoft, Google is beating big on the OpenAI rival."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-27T22:47:00.000Z",
    "title": "$XRP Price Could Surpass $100 and Has ‘No Ceiling’, Says Early Ethereum Advisor",
    "url": "https://www.cryptoglobe.com/latest/2023/10/xrp-price-could-surpass-100-and-has-no-ceiling-says-early-ethereum-advisor/",
    "description": "Early Ethereum ($ETH) advisor Steven Nerayoff, who is also a popular member of the $XRP community has recently said that he believes the price of XRP has “no ceiling” and agreed it could surpass the $100 mark. In a post shared on the microblogging platform X (formerly known as Twitter), Nerayoff responded to a user […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T23:00:44.000Z",
    "title": "The End Is Near For Trellor (TRB): Crypto Analyst Says Prepare For 50% Drop",
    "url": "https://www.newsbtc.com/altcoin/trellor-trb-50-drop/",
    "description": "Trellor (TRB) has been one of the winners of the recent crypto market rally after going from a monthly low of $43 to over $115 in less than two weeks. This impressive rally has triggered heightened interest in the cryptocurrency leading to more momentum for the digital asset. However, not everyone is buying into this bullish fantasy as one crypto analyst has predicted a rapid decline in price for the digital asset. Why The Price Of Trellor Will Crash A TradingView crypto analyst has given reasons for why they see the Trellor (TRB) price crashing in the coming days. The post which included a chart of TRB depicted the price falling back down below the $60 mark once more. Related Reading: Crypto Analyst Who Called Bitcoin’s Parabolic Rally Picks Altcoin Set To Pop According to the analyst, the first indicator of the coming crash is the fact that there has been a decline in the trading volume of TRB. They showed this in the chart, which showed that the volume drop is happening amid the price rally that the coin still seems to be undergoing. Also, the crypto analyst believes that this coin has now entered the “extremely overvalued and overbought” level. Now, usually when a coin is overvalued and overbought, it often precedes a crash in price as investors rush to secure profits. This could be what happens in this case, especially given the fact that the majority of holders are in heavy profits. Source: Tradingview.com The analyst points out that the TRB profitability is incredibly high, with 95% of holders in profit at the time that the analysis was posted. This is corroborated by data from IntoTheBlock, which showed a small drop in the number of profitable holders at 93% but with 0 holders in a loss. The remaining 7% are shown to be sitting at neutral which means they purchased their coins at the same prices as the current market price. This lends credence to the analyst’s expectation of a price decline, especially when these investors who are in profit begin to sell their coins. TRB still holding $110 &#124; Source: TRBUSDT on Tradingview.com How Far Will The TRB Crash Go? When it comes to how far the crash can go, the crypto analyst sees an incredible drop in price coming. They believe that there is no way for the bulls to sustain the current momentum which has gone on for days “without heavy CORRECTION.” The analyst believes that the price of Trellor (TRB) will see at least 50% crash from the current level. However, the expectations are not given only for a crash. They explain that there is the possibility that the price will continue to go up, in which case it reaches as high as $135 to $155. But still maintain the expectation of a crash. Related Reading: Bitcoin Resumes Rally After Brief Hiatus, Here’s What Happened In a follow-up comment, the analyst revealed that they had decided to start shorting the TRB coin. Their price entry is shown to be $110 with three take profit targets set for $70, $52, and $41, and a stop loss placed at $161. The Trellor (TRB) coin, despite falling around $9 in the last day, is still up a significant amount. It is currently sitting at $111 at the time of writing, but its daily trading volume is down over 35% in the same time period. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Shutterstock, chart from TradingView.com"
  }
]