[
  {
    "source": "Decrypt",
    "date": "2023-08-09T01:14:48.000Z",
    "title": "You’re Not Imagining It: Top AI Chatbots Have Political Biases, Researchers Say",
    "url": "https://decrypt.co/151796/ai-political-bias-left-right-research",
    "description": "The peer-reviewed, award-winning paper says OpenAI’s ChatGPT leans left as Meta's LLaMA leans right."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-09T01:30:30.000Z",
    "title": "Robert Kennedy Jr. Warns How Nuclear War Between US and Russia Would Affect You",
    "url": "https://news.bitcoin.com/robert-kennedy-jr-warns-how-nuclear-war-between-us-and-russia-would-affect-you/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Robert Kennedy Jr. Warns How Nuclear War Between US and Russia Would Affect You\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rfk-jr-nuclear-war.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. presidential candidate Robert F. Kennedy Jr. (RFK Jr.) has warned of severe consequences of a nuclear war between the U.S. and Russia. In one estimate, more than five billion people could die from a war between the two nations, including around 99% of those in the U.S., Europe, Russia, and China. RFK Jr on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T01:10:05.000Z",
    "title": "Beware Of Crypto Firms Falsely  Claiming To Have Submitted License Applications",
    "url": "https://www.newsbtc.com/crypto/crypto-firms-false-license-applications/",
    "description": "In recent developments, Hong Kong regulators have issued cautionary warnings to crypto investors, asking them to be careful of potential investment risks. According to the city’s chief regulatory agency, some cryptocurrency trading platforms have been making erroneous claims about meeting the regulatory requirements for digital assets.  Investors Beware Of False Claims From Crypto Firms The Securities and Futures Commission (SFC), the chief regulatory body of Hong Kong, released the alert on August 7. In the statement, the commission noted that some unlicensed exchanges in the city were engaging in “improper practices.”  Related Reading: Valkyrie Unveils Double-Barreled Approach To Launch An Ethereum ETF Alongside A Bitcoin ETF According to the body, unlicensed Virtual Assets Trading Platforms (VATPs) are falsely claiming to have submitted license applications to the body, which would enable them to conduct transactions legally in the special administrative region of China.  Such fraudulent claims were designed to “give the public a false sense of assurance” and were targeted at “inducing another person to trade in virtual assets.” Making such claims amounts to a punishable offense under the city’s Anti-Money Laundering and Counter-Terrorist Finance Ordinance, the regulatory body said.  Furthermore, the SFC will consider any likely misrepresentation made by an unlicensed Virtual Asset Trading Platform when deciding whether or not to grant them a license. The SFC may view as unfavorable any non-compliant actions that would need the reversion of client withdrawal or transactions that could have been reasonably avoided.  The Securities and Futures Commission said it will evaluate a Virtual Asset Trading Platform’s application based on its ability to show genuine intention to correct previous non-compliant actions, including the gradual unwinding of impermissible transactions.  Virtual Assets Trading Platforms that do not meet the agency’s requirements must make efforts to meet the regulatory and legal obligations of licensed VAPTs, the SFC clarified. Total market cap recovers to $1.133 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Hong Kong’s Regulatory Framework Hong Kong’s Securities and Futures Commission (SFC)  recently released guidelines for Virtual Asset Trading Platform operators in the country to provide more regulatory certainty for the crypto industry in the country and help protect investors’ interests.  The SFC laid down rules that would enable centralized exchanges to provide services to retail clients, provided they are authorized by a license obtained from the Securities and Futures Commission.  Under Hong Kong’s VASP regime, which kickstarted on June 1, 2023, a one-year grace period commencing from June 1, 2023, allowed exchanges with an existing large presence in the city to continue operations while making changes to their businesses to ensure compliance with the new SFCs rules.  Related Reading: PayPal’s PYUSD Launch Triggers Calls For Stablecoin Bill Platform operators that had not commenced operations before June 1, 2023, had to be SFC-licensed before they could operate. However, it seems that certain exchanges are already violating the rules provided under the new regime.  According to SFC, investors participating in trading on unregulated virtual asset exchanges are likely to face “losing their entire investment” on the exchange if it “ceases operation, collapses, is hacked,” or “suffers from any misappropriation of assets.”  Following this, many exchanges have publicly pledged to submit licensing applications with the SFC, including Huobi and OKX, two popular exchanges in Asia.  Featured image from PayBito, chart from Tradingview.com"
  }
]