[
  {
    "source": "CoinDesk",
    "date": "2024-03-15T08:41:54.000Z",
    "title": "Bitcoin Layer-2 Project BVM Gains Traction With Promise of 'Juicy' Airdrops",
    "url": "https://www.coindesk.com/markets/2024/03/15/bitcoin-layer-2-project-bvm-gains-traction-with-promise-of-juicy-airdrops/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The platform lets users start their own networks on Bitcoin and is offering developers millions of dollars as grant rewards."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T08:47:37.000Z",
    "title": " SuperRare Expands into Bitcoin Ordinals, Unveils ‘No Brainers’ NFT Collection ",
    "url": "https://cointelegraph.com/news/superrare-enters-bitcoin-ordinals-partnership",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNjAzYzhmYmMtZThkZC00NWE5LWJjNzgtYjY3ZDk2Y2FjNGZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>SuperRare Labs’ Zack Yanger said being able to help artists connect with a new class of collectors is “a massive win.”</p>\n                    <p><p data-ct-non-breakable=\"true\">Nonfungible token (NFT) marketplace SuperRare has jumped into the Bitcoin Ordinals ecosystem through its partnership with Bitcoin-based art platform Gamma.</p><p>SuperRare’s move into the ecosystem marks a transition to becoming more multichain in its operations. Initially, the NFT marketplace only supported transactions on the Ethereum blockchain. </p><p data-ct-non-breakable=\"true\">Zack Yanger, senior vice president of SuperRare Labs, told Cointelegraph that the decision to move into Bitcoin NFTs follows a significant show of interest from their artist community. </p><p><a href=\"https://cointelegraph.com/news/superrare-enters-bitcoin-ordinals-partnership\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T08:41:04.000Z",
    "title": "Lazarus Group Uses Tornado Cash To Launder $12M From Heco Hack",
    "url": "https://cryptodaily.co.uk/2024/03/lazarus-group-uses-tornado-cash-to-launder-12m-from-heco-hack",
    "description": "Infamous North Korean Hacking Group Lazarus has resumed using Tornado Cash, using the mixing service to launder $12 million worth of ETH."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T09:05:20.000Z",
    "title": "AI-Powered Mobile Phone Revolutionizes Access to Information for Visually-Impaired Nigerians",
    "url": "https://www.cryptopolitan.com/ai-powered-mobile-phone-revolutionizes/",
    "description": "In a groundbreaking development, visually impaired individuals in Nigeria are experiencing newfound access to information thanks to an innovative AI-powered mobile phone service. Spearheaded by Canada-based organization Viamo, this service harnesses artificial intelligence to provide offline accessibility, catering to communities even in the most remote areas without internet connectivity. Empowering accessibility through AI technology The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T08:56:38.000Z",
    "title": "Is Bitcoin’s bull run over? ETF inflows drop, prices slide",
    "url": "https://www.cryptopolitan.com/bitcoins-etf-inflows-drop-prices-slide/",
    "description": "Bitcoin Exchange-Traded Fund (ETF) inflows witnessed a staggering decline of 80.6% within 24 hours, marking a substantial shift in investor sentiment towards the cryptocurrency. The drop was reported by a cryptocurrency analytics platform, highlighting a net inflow of $133 million into Bitcoin ETFs. This sharp decrease comes after a record-breaking inflow of $1.05 billion just [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T08:53:18.000Z",
    "title": "This Shiba Inu (SHIB) And Dogecoin (DOGE) Rival Is ‘One Of The Most Bullish Tokens In 2024,’ Top Analyst Says",
    "url": "https://www.cryptopolitan.com/this-shiba-inu-shib-and-dogecoin-doge-rival-is-one-of-the-most-bullish-tokens-in-2024-top-analyst-says/",
    "description": "A new player has entered the quickly changing cryptocurrency market, competing for the interest of both fans and investors. Retik Finance is causing a stir with its novel approach to decentralized finance (DeFi). It is frequently referred to as the challenger of Dogecoin (DOGE) and Shiba Inu (SHIB). Retik Finance is expected to be among [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T08:52:10.000Z",
    "title": "How Will the EU’s AI Legislation Influence the Fashion Industry?",
    "url": "https://www.cryptopolitan.com/eu-ai-legislation-influence-fashion-industry/",
    "description": "Europe&#8217;s strides in AI legislation have reached a historic milestone as the European Parliament greenlights the AI Act, setting a global precedent for comprehensive regulation in artificial intelligence development and use. This landmark legislation not only shapes the future of technology within the European Union but also holds significant implications for various sectors, including the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T08:43:25.000Z",
    "title": "Profitability Of The Graph (GRT) Soars As Near Protocol (NEAR) Expands; Algotech (ALGT) Presale Sees Buying Frenzy",
    "url": "https://www.cryptopolitan.com/profitability-of-the-graph-grt-soars-as-near-protocol-near-expands-algotech-algt-presale-sees-buying-frenzy/",
    "description": "Rejuvenating all the market bulls, Algotech’s (ALGT) presale has set several success records. The new project has entered the market with an irresistible uniqueness and attraction. Therefore, its presale has sold over 53 million ALGT tokens in just a matter of days. This article will focus on The Graph (GRT), Near Protocol (NEAR), and Algotech [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-15T08:57:58.000Z",
    "title": "ARPA’s “dear.game” Launch Triggers Price Spike, Followed By Volatility",
    "url": "https://nulltx.com/arpas-dear-game-launch-triggers-price-spike-followed-by-volatility/",
    "description": "The recent announcement of dear.game&#8217;s launch by ARPA officials marks a significant milestone in the cryptocurrency gaming space. As the first fully onchain game enabled by Randcast and incubated by ARPA on the redstonexyz chain built by latticexyz, dear.game has garnered attention for its innovative approach to blockchain-based gaming. 👀Dive [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-15T08:54:13.000Z",
    "title": "Binance Coin (BNB) Surges 86% In One Month, Nears All-Time High",
    "url": "https://nulltx.com/binance-coin-bnb-surges-86-in-one-month-nears-all-time-high/",
    "description": "In the realm of cryptocurrency, Binance Coin (BNB) has been making waves, experiencing a remarkable surge of over 86% in the past month. With its recent climb to $631, BNB is inching closer to reclaiming its previous all-time high of $690, demonstrating its resilience and bullish momentum in the market. [&#8230;]"
  }
]