[
  {
    "source": "Cointelegraph",
    "date": "2023-12-24T23:30:00.000Z",
    "title": " AI-powered NPCs could live forever and exist in multiple games — Yat Siu  ",
    "url": "https://cointelegraph.com/news/ai-talking-npcs-are-coming-to-a-game-near-you",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvN2JlOWU1NzEtNWEzYS00YmQzLWEyZTQtYzg4OTI5YTI3Y2U4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>With toolkits already available for game devs to meld AI into NPCs, Animoca Brands’ co-founder thinks more intelligent nonplayer characters will start to show up in 2024.</p>\n                    <p><p>Nonplayer characters in games, known as “NPCs,” could one day be completely powered by artificial intelligence and even be made to “live forever” on the blockchain and in multiple games.</p><p>The prediction was made by Animoca Brands co-founder Yat Siu, who also admitted such a feat would likely be years away. That being said, Siu believes that players will see “inklings” of this technology in 2024.</p><p>“Games will start building experiences specifically around interacting with NPCs,” Siu told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/ai-talking-npcs-are-coming-to-a-game-near-you\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-24T23:21:56.000Z",
    "title": "WSJ releases FUD article on Binance’s Yi He",
    "url": "https://www.cryptopolitan.com/wsj-releases-fud-article-on-binances-yi-he/",
    "description": "Binance, the cryptocurrency titan, has recently been the subject of fervent media scrutiny. Amidst a sea of allegations and regulatory tussles, the Wall Street Journal&#8217;s latest piece on Yi He, Binance&#8217;s co-founder and a pivotal figure in the crypto world, has stirred the pot further. However, a closer examination suggests that this coverage might be [&#8230;]"
  }
]