[
  {
    "source": "Decrypt",
    "date": "2023-06-17T14:01:02.000Z",
    "title": "How to Uncensor Any AI Large Language Model Like ChatGPT",
    "url": "https://decrypt.co/145017/how-uncensor-large-language-model-llm-chatgpt",
    "description": "All it takes to turn your conservative ChatGPT bot into an unapologetic, full-on NSFW machine is a simple phrase in the prompt."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-17T14:00:40.000Z",
    "title": "Decoding the Fear and Greed Index: Insights from BTSE’s CEO and COO",
    "url": "https://cryptoslate.com/decoding-the-fear-and-greed-index-insights-from-btses-ceo-and-coo/",
    "description": "<p>DOGE. PEPE. AI altcoins. Every now and then a memecoin explodes into the stratosphere, and we’re all left wondering how exactly it all happens. We sat down with the top execs at crypto exchange BTSE to get to the bottom of it. CEO Henry Liu and COO Jeff Mei gave us their honest perspectives on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/decoding-the-fear-and-greed-index-insights-from-btses-ceo-and-coo/\">Decoding the Fear and Greed Index: Insights from BTSE’s CEO and COO</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-17T14:00:00.000Z",
    "title": "Tether Responds to Account Deactivation Controversy",
    "url": "https://cryptodaily.co.uk/2023/06/tether-responds-to-account-deactivation-controversy",
    "description": "<p class=\"md-end-block md-p\">According to information released by the New York Attorney General (NYAG), Tether, the issuer of leading stablecoin USDT, reportedly deactivated around 29 accounts tied to significant players in the cryptocurrency sphere in 2021.</p>\n<p class=\"md-end-block md-p md-focus\">While reasons for the individual account terminations remain undisclosed, the named entities included MoonPay, BlockFi, CMS Holdings, and Galois Capital.</p>\n<p class=\"md-end-block md-p\">Responding to the unfolding situation, Tether indicated its reluctance to comment on specific customer relationships, noting that each party had undergone stringent compliance checks both during onboarding and throughout their relationship, in line with Tether's compliance policies.</p>\nNYAG Investigation and Tether's Commitment to Transparency\n<p class=\"md-end-block md-p\">While the NYAG investigation wrapped up in early 2021, some of the documents in question extend until June of that year. These documents were collected during the NYAG's probe into Tether and sister company Bitfinex over the alleged misappropriation of $850 million. During this investigation, iFinex, the parent company of both entities, requested an extension to produce the required financial documents.</p>\n<p class=\"md-end-block md-p\">Following a settlement that included an $18.5 million penalty and the cessation of trading in New York, media outlets and Coinbase sought the public disclosure of Tether&rsquo;s initial quarterly report under the Freedom of Information Act. However, Tether opposed this motion, citing the need to protect its customers' confidential data.</p>\n<p class=\"md-end-block md-p\">Despite Tether's objections, the NYAG granted media outlets access to the documents, leading to the revelation about the deacttivation of numerous company accounts. </p>\nTether's Stance on Transparency and Risk Management\n<p class=\"md-end-block md-p\">Tether remains adamant about its commitment to transparency while prioritizing its customers' privacy and security. Following the settlement with the NYAG, Tether has diligently completed its quarterly reporting obligations, affirming its commitment to openness and transparency.</p>\n<p class=\"md-end-block md-p\">Notably, Tether claims that it takes pride in its meticulous development of risk metrics and processes, enabling its investment and financial teams to thoroughly assess the risk tied to the company's financial interactions. Tether has continually demonstrated its commitment to sustaining its business objectives while adhering to a robust risk management culture.</p>\nTether's Reserves and Commercial Papers\n<p class=\"md-end-block md-p\">Tether's dedication to maintaining the highest standards is evident in its transparent dealings regarding its lending program and reserves. Tether's reserves have proven to be extremely liquid, high-quality, and readily available to support any size of redemption, demonstrated by the repayment of US$7 billion in 48 hours in 2022.</p>\n<p class=\"md-end-block md-p\">According to the released documents, Tether has consistently maintained an A2 or better rating for the majority of its commercial papers, and none of its past statements have undergone any changes. This commitment to upholding the highest standards has been echoed in the company's dedication to accountability and its unwavering risk management culture. The firm, however, has been severely criticized over past decisions, especially in the case of blocking an MEV Validator as a security response.</p>\n<p class=\"md-end-block md-p\">Tether says that while media outlets have rushed to present this information to readers, Tether remains committed to its users, as well as for the benefit of the the broader crypto community. The company is keen to provide a factual point of reference about the disclosed materials, and it continues to cooperate with law enforcement, having assisted in over 150 investigations across four continents in the past 18 months. </p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-17T14:00:49.000Z",
    "title": "As Cardano holders shed wealth, Avorak Trade beta users generate profits",
    "url": "https://nulltx.com/as-cardano-holders-shed-wealth-avorak-trade-beta-users-generate-profits/",
    "description": "The volatility in the crypto market creates opportunities for both profits or losses. That said, as Cardano holders shed wealth, Avorak Trade beta users are generating profits. Cardano price The Cardano (ADA) price has experienced a significant decline in June, largely influenced by the mention of ADA among cryptocurrencies considered securities, in a lawsuit filed [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-17T13:50:01.000Z",
    "title": "Polygon (MATIC) Witnesses High Volatility Amid Positive Developments",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/polygon-matic-witnesses-high-volatility-amid-positive-developments/",
    "description": "Polygon (MATIC), one of the prominent Web3 networks, has recently experienced a period of volatility in its price. Currently trading at $0.625112 USD, with a 24-hour trading volume of $547,815,952 USD, MATIC has shown a 9.63% increase in the last 24 hours. Polygon has rebounded from the bearish sentiments earlier in the week. This comes on the back of recent developments within the Polygon ecosystem towards increasing utility and partnerships with key financial institutions.  Polygon Launches &#8216;The Value Prop&#8217; Polygon has made an important announcement, launching &#8220;The Value Prop,&#8221; an open database of blockchain use cases. This comprehensive catalog contains over 300 applications and diverse use cases across multiple business sectors, blockchain networks, and geographical locations. The initiative aims to showcase positive applications for blockchain technology, presenting it as a versatile tool beyond asset trading. Related Reading: Percentage Of ETH Addresses In Profit Reaches 5-Month Low Amid the negative sentiment surrounding blockchain technology due to regulatory pressures on major market participants like Binance and Coinbase, Polygon&#8217;s move to highlight real-world applications is significant. It aligns with the belief among Web3 experts and industry players that blockchain should be viewed as a general-purpose technology addressing real-world challenges. Web3 Development And Positive Trends Polygon&#8217;s efforts to boost Web3 development and unlock new use cases align with the industry&#8217;s overall trajectory. Ripple (XRP) recently partnered with Banco de la República, Colombia&#8217;s central bank, to explore blockchain use cases. This indicates a growing recognition of the potential of blockchain technology beyond cryptocurrencies. Polygon&#8217;s co-founder, Sandeep Nailwal, also launched the Nailwal Fellowship, a grant program providing financial support and resources to early-stage Web3 developers. This initiative offers funding, mentorship, and access to top founders and investors, nurturing the growth of the Web3 ecosystem. Related Reading: Shiba Inu (SHIB) Positive Social Sentiment Sparks Bullish Speculation Despite the U.S. banking crisis contagion, Web3 development has shown resilience. According to Alchemy, a blockchain developer platform, Q1 2023 witnessed rapid growth in Web3 development. The number of developer teams working on the Alchemy platform reached a record high, with increased activity compared to the previous year. Future Prospect For Polygon MATIC, the native token of Polygon, is trading in the positive zone and is up 9% in the last 24 hours. At the time of writing, the price is $0.6228, according to TradingView chart. However, amid the price volatility, the launch of &#8220;The Value Prop&#8221; and the focus on Web3 development suggest potential positive catalysts for Polygon&#8217;s future performance. As the blockchain industry continues to evolve, market participants will closely monitor the progress of Web3 development, the expansion of real-world use cases, and the regulatory landscape. These factors will significantly impact the prospects of Polygon and its native token, MATIC. Featured image from iStock, charts from Tradingview and Coingecko"
  }
]