[
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T13:35:00.000Z",
    "title": "Bitcoin adoption in Mexico boosted by Lightning partnership with retail giant",
    "url": "https://cointelegraph.com/news/bitcoin-adoption-in-mexico-boosted-by-lightning-partnership-with-retail-giant",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cd2b227a-b776-438b-b4f6-9eaed12bf510.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“Imagine if Best Buy, Bank of America, Fox News and an NFL team were all owned by the same individual. All of them will have lightning capabilities in the future,” Jose Lemus, CEO of Ibex Mercado, told Cointelegraph.</p>\n                    <p><p>The world’s largest Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) conference, Bitcoin 2023, in Miami, Florida, passed without major fanfare this year. <a href=\"https://cointelegraph.com/news/el-salvador-president-announces-infrastructure-already-being-built-ahead-of-country-s-bitcoin-adoption\">Past conferences announced</a> nation-state adoption, massive <a href=\"https://cointelegraph.com/news/lightning-to-strike-shopify-merchants-with-addition-of-btc-payments\">crypto integrations in the United States,</a> and islands and territories <a href=\"https://cointelegraph.com/news/madeira-embraces-bitcoin-and-how-the-president-met-michael-saylor\">worldwide embracing Bitcoin</a>. </p><p>Nonetheless, at Bitcoin 2023, one partnership with a potentially significant impact on the world’s 15th-largest economy flew under the radar.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;re thrilled to announce our partnership with Grupo Salinas. Looking forward to seeing the positive impact this collaboration will have.⚡️ <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://twitter.com/hashtag/bitcoiconference2023?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoiconference2023</a> <a href=\"https://t.co/rkAjWnmKsK\">https://t.co/rkAjWnmKsK</a> <a href=\"https://t.co/yWIWc6751B\">pic.twitter.com/yWIWc6751B</a></p>&mdash; IBEX ⚡️ (@PoweredbyIBEX) <a href=\"https://twitter.com/PoweredbyIBEX/status/1659334045761773569?ref_src=twsrc%5Etfw\">May 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>José Lemus, the CEO of Ibex Mercado, closed out the Bitcoin 2023 Industry Day. He announced a partnership with Grupo Salinas, one of Mexico’s largest corporate conglomerates. In brief, the collaboration would allow millions of Mexicans to pay their internet bills at popular telecoms company Total Play using the Bitcoin Lightning Network.</p><p>Crucially, the Salinas Group owns tens of businesses across Mexico. Its billionaire founder, Ricardo Salinas Pliego, is the third-richest person in the country and a <a href=\"https://cointelegraph.com/news/making-bitcoin-legal-tender-is-mexico-will-be-an-uphill-battle-says-ricardo-salinas\">well-known Bitcoin maximalist</a>.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/L5GgOc8ZPDE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Not only does the Bitcoin Lightning payments integration already deliver Bitcoin adoption to millions of Mexicans, but as Lemus explained to Cointelegraph, Total Play is one small retailer that’s part of the vast Salinas conglomerate:</p><blockquote>“Imagine if Best Buy, Bank of America, Fox News and an NFL team were all owned by the same individual. All of them will have Lightning capabilities in the future.”</blockquote><p>Lemus explained it’s just the “tip of the iceberg of what will go on in Mexico,” as more Bitcoin and Lightning integrations, and on and off-ramps attract more Bitcoin business. Speaking via video link, Lemus explained that fiat and Bitcoin can interact more freely in Mexico:</p><blockquote>“Let’s say you have a wallet and you want to make Mexican pesos available in Mexico, or you have an exchange and you want to make the balances for your customers in Mexico. You can do that through CoinPro or through Grupo Salinas.”</blockquote><p>The partnership is the beginning of Lightning functionality across Grupo Salinas. There will be a Lightning app “for employees, a super app for soccer teams to do something similar to what we have with the Perth Heat where we drive fan engagement with innovative ways.”</p><p>The Australian baseball team, Perth Heat, adopted a Bitcoin standard in 2021, with <a href=\"https://cointelegraph.com/news/australian-baseball-club-perth-heat-to-pay-athletes-in-bitcoin\">players earning salaries in Bitcoin</a> and “Sats4Stats”, where players receive Bitcoin for hitting home runs. Plus, fan engagement activities use the Lightning Network. For example, during baseball games, “When a player steals a base, a QR flashes on screen and the first people that scan it get satoshis,” Lemus explained.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1e39d4e2-f63f-4d96-965e-574827fa0de8.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Players can send satoshis to players directly during Perth Heat baseball games. Source: PerthHeat.com.au</em></figcaption></figure><p>In the first year of operation, the Perth Heat players earned an extra 1% through Bitcoin, Lemus said on stage at Bitcoin 2023. “It’s still early” for such a technology, but an extra 1% is already encouraging. </p><p>Grupo Salinas owns the Mexican football clubs, Mazatlán and Club Puebla. Fans could soon get their hands on free money — in the form of Bitcoin or satoshis — for simply scanning the QR code on the stadium screen when a player scores, just like with Perth Heat.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/31be2af5-929b-430c-b027-c170a59113e8.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A snapshot of some of the Grupo Salinas brands spanning retail, banking, sports and advertising. Source: GrupoSalinas.com</em></figcaption></figure><p>Ibex Mercado understands the massive opportunity for financial inclusion offered by the Lightning Network. Lemus founded Ibex in neighboring Guatemala, and the company delivered the Lightning Network integration for El Salvador’s Chivo Wallet — <a href=\"https://cointelegraph.com/news/el-salvador-s-bitcoin-wallet-onboards-4m-users-with-netki-partnership\">which effectively banked millions of Salvadorans</a> — two years prior.</p><p>Lemus explained that more Bitcoin adoption could improve the lives of unbanked and underserved populations. Moreover, financial inclusion goes beyond banking the unbanked:</p><blockquote>“It’s the ability to raise funds for your company. It’s the ability to open yourself to a broader market. And that is what, for me, true financial inclusion is.”</blockquote><p>Finally, Lemus highlighted the potential of Mexico as a Bitcoin destination: “I think that Mexico is going to be the place where this is going to take off.“ More broadly, 2022 was a promising year for Bitcoin and crypto adoption in the country, from <a href=\"https://cointelegraph.com/news/why-crypto-remittance-companies-are-flocking-to-mexico\">crypto remittance companies establishing</a> in Mexico to <a href=\"https://cointelegraph.com/news/mercado-bitcoin-plans-to-expand-to-mexico\">crypto exchange expansion</a>.  </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-adoption-of-guatemalan-merchants-grows-one-btc-tattoo-at-a-time\"><strong><em>Bitcoin adoption of Guatemalan merchants grows one BTC tattoo at a time</em></strong></a></p><p>Does this mean that crypto enthusiasts may soon be able to live on Bitcoin like <a href=\"https://cointelegraph.com/news/paying-the-way-for-bitcoin-adoption-in-el-salvador-video\">they can in El Salvador</a>? Lemus replied:</p><blockquote>“Let’s say you conduct most of your life in Bitcoin, I think 18 months is a reasonable target where you can do most of your life. But obviously, things like taxes and maybe rent will not run on Bitcoin yet.”</blockquote><p>Similarly, the partnership with Grupo Salinas took 18 months of work and preparation, Lemus said. More partnerships and projects are on the horizon in Mexico, although it’s too early to share details, Lemus concluded. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\">Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T13:30:00.000Z",
    "title": "Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’",
    "url": "https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-bitcoin-2023-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Shitcoins and NFTs invaded Bitcoin 2023, but most attendees didn’t seem to mind. Can Ordinals usher in a new era of Magic Internet Money?</p>\n                    <p><p><strong>Among the more memorable displays at Bitcoin 2023 is a real-life toilet with the logos of various non-Bitcoin cryptocurrencies. Its an ad for a booth selling buttwipes that are moistened with the tears of no-coiners. The marketing message is clear: Bitcoin is the real thing  everything else is a shitcoin that belongs in the toilet. </strong></p><p>But only a few steps away is another booth selling trading solutions for BRC-20 tokens, which some have labeled shitcoins for Bitcoin. Across the walkway are more booths slinging NFT minting software  also on Bitcoin. The conference even hosts a Bitcoin NFT art gallery. </p><p>As <a href=\"https://cointelegraph.com/magazine/crypto-city-ultimate-guide-to-miami/\" target=\"_blank\" rel=\"nofollow\" >Miami</a> hosts the largest Bitcoin conference for the third year in a row in May, the air feels markedly different. Though there are only 15,000 attendees compared to last years 35,000, the atmosphere has an energy and freshness thats a world away from the gloom and bear-market blues that one might expect after the massive drops from the 2021 highs.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Shitcoins.png\" alt=\"Shitcoins\" class=\"wp-image-21176\" width=\"322\" height=\"322\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Shitcoins.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Shitcoins-100x100.png 100w\" sizes=\"(max-width: 322px) 100vw, 322px\" /><figcaption class=\"wp-element-caption\"><em>Bitcoin is the real thing  everything else belongs in the toilet (Elias Ahonen)</em></figcaption></figure><p>Whats changed this year is the ordinal renaissance, brought on by the recent reality of not only NFTs but tokens being issued on the Bitcoin blockchain. There are certainly haters  with <a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\" target=\"_blank\" rel=\"nofollow\" >some calling for a fork to undo the Taproot updates that made spam possible</a> on the chain. </p><p>But despite the Bitcoin communitys traditional hatred for NFTs, tokens and DeFi, however, things are surprisingly quiet. Despite the blowback online, almost no one Magazine encounters at Bitcoin 2023 has anything particularly bad to say about Ordinals  and some did not even realize they are related to Bitcoin. </p><p>Among old-school Bitcoiners  in circles where the cryptocurrency that starts with E can barely be mentioned without drawing comments of derision regarding monkey pictures and scam coins  the Ordinal NFT phenomenon is decisively met with a quiet acceptance or shrug. Most old-timers arent interested but appear to accept that this is what the young people want today  that Bitcoin needs to change with the times. </p><p>Are Bitcoiners quietly accepting a new era where the network takes on a radically new role in the Web3 ecosystem, or is this the calm before the Bitcoin purist storm? </p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><h2 id=\"h-bitcoin-ordinals-a-new-era\">Bitcoin <strong>Ordinals: A new era</strong></h2><p>With the exception of the Lightning Network, which made fast and cheap Bitcoin payments possible so as to make mass payment feasible, the Bitcoin ecosystem has been relatively unchanging over the years from an outside perspective. </p><p>Mining, halvings every four years, the 21 million supply, hardware storage  beyond these core concepts, Bitcoin has lacked a certain dynamism that has placed it largely outside of the more colorful Web3 space of competing protocols, smart contracts, ICOs, NFTs, DAOs, stablecoins and myriad different tokens.</p><p>Indeed, the Bitcoin community has so ardently held on to its core tenets  rejecting new iterations, interpretations and innovations  that it is <a href=\"https://cointelegraph.com/magazine/is-bitcoin-a-religion-if-not-it-soon-will-be/\" target=\"_blank\" rel=\"nofollow\" >unironically considered by some as a religion</a>, and semi-ironically as such by multitudes more. </p><p>But is a reformation  or even renaissance  in the works? </p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-at-Bitcoin-2023..jpg\" alt=\"Bitcoin 2023\" class=\"wp-image-20975\" width=\"459\" height=\"465\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-at-Bitcoin-2023..jpg 721w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-at-Bitcoin-2023.-296x300.jpg 296w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-at-Bitcoin-2023.-100x100.jpg 100w\" sizes=\"(max-width: 459px) 100vw, 459px\" /><figcaption class=\"wp-element-caption\"><em>Author Elias Ahonen at Bitcoin 2023 (Elias Ahonen)</em></figcaption></figure><p>A stroll through Bitcoin 2023  the worlds largest Bitcoin conference held in May in Miami  suggests so. This is because in addition to the yearly fare of booths related to mining, physical art, exchanges, wallet solutions and various hardware, a new entrant is out in force: NFTs.</p><p>Well, no  not NFTs. Bitcoiners call them Ordinals.</p><p>The word ordinal simply means a number used to put things in order: 5th, 6th, 7th, etc. Due to the November 2021 Taproot Bitcoin upgrade, individual satoshis, the smallest unit of Bitcoin, can now be individually numbered and thus made permanently identifiable. </p><p>Uniquely numbered satoshis  Ordinals  are nonfungible, meaning that they can no longer be substituted for another. Being (1) nonfungible and (2) tokens, they are NFTs by definition.</p><p>In Miami, perhaps the most visible landmark to this new phenomenon is <a href=\"https://blog.gamma.io/2023/05/05/gamma-x-xverse-at-ordinals-alley-foreword/\" target=\"_blank\" rel=\"nofollow\" >Ordinal Alley</a>, the very first art gallery dedicated to Ordinal inscriptions where various Bitcoin NFTs can be viewed.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"512\" height=\"575\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-1.jpg\" alt=\"\" class=\"wp-image-21233\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-1.jpg 512w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-1-267x300.jpg 267w\" sizes=\"(max-width: 512px) 100vw, 512px\" /></figure><p>Subhan Syed, co-founder of YourFund Coin, tells Magazine that Ordinal art  whether a JPEG or MP3  may seem irrelevant today, but as time goes on, collectors will look towards unique pieces that have truly been immortalized on the blockchain. </p><p>The system is new and experimental, with Syed explaining that the way inscription works today might be completely different a few years from now, adding that its feasible that one day, there might not be enough satoshis to fill everyones inscribing needs.</p><p>We might need a more robust solution in the long term that does not carry a load on the blockchain timestamp.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/yat-siu-metaverse-here-now/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>The Metaverse is awful today… but we can make it great: Yat Siu, Big Ideas</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/bitcoin-payday-crypto-to-revolutionize-job-wages-or-not/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Bitcoin payday? Crypto to revolutionize job wages… or not</p>                        </a>                    </div></div></div><h2>NFTs and s<strong>hitcoins  Now on BTC</strong></h2><p>In March 2023, an anonymous developer named domo introduced the BRC-20 system, which uses Ordinals to enable users to mint and transfer tokens on Bitcoin, in a simplistic take on Ethereums ERC-20 standard.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/There-were-plenty-of-merchants-at-Bitcoin-2023..jpg\" alt=\"Merchants\" class=\"wp-image-20973\" width=\"449\" height=\"340\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/There-were-plenty-of-merchants-at-Bitcoin-2023..jpg 947w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/There-were-plenty-of-merchants-at-Bitcoin-2023.-300x227.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/There-were-plenty-of-merchants-at-Bitcoin-2023.-770x583.jpg 770w\" sizes=\"(max-width: 449px) 100vw, 449px\" /><figcaption class=\"wp-element-caption\"><em>There were plenty of merchants at Bitcoin 2023 (Elias Ahonen)</em></figcaption></figure><p>According to BRC-20.io, at one point, the market cap exceeded $1 billion, although after the initial hype died down, the 187 tracked tokens fell to half a billion, and in the midst of the SEC-derived bear market, theyre worth around $132 million with a daily volume around $47 million (although the site is offline at the time of writing).</p><p>While the conference has several booths related to Ordinals  mainly services for minting or inscribing them  few openly promote BRC-20 tokens beyond offering functionality to hold or trade them. While Ordinal NFT images appear to have become accepted by the mainstream Bitcoin community, it appears that BRC-20 tokens  viewed by many as shitcoins on Bitcoin  have not yet received quite the same level of acceptance.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"511\" height=\"776\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-2.jpg\" alt=\"\" class=\"wp-image-21232\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-2.jpg 511w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-2-198x300.jpg 198w\" sizes=\"(max-width: 511px) 100vw, 511px\" /></figure><p>It will be interesting to see how this changes next year when the conference moves to Nashville.</p><h2><strong>Wizards vs. laser-eyes</strong></h2><p>At a talk titled The Great Ordinal Debate, Bitcoin experts Udi Wertheimer and Eric Wall appeared in Taproot Wizard costumes as they made a dancing entrance. The Ordinals project celebrates the Magic Internet Money meme from the early Bitcoin days and welcomes the return of innovations being built on top of the protocol.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Magic-Internet-Money.png\" alt=\"Magic Internet Money\" class=\"wp-image-21174\" width=\"374\" height=\"312\" /><figcaption class=\"wp-element-caption\"><em>The Magic Internet Money meme</em></figcaption></figure><p>Certain Bitcoin maximalists hate them and the spam of Ordinals, believing it undermines the true purpose of Bitcoin.</p><p>Wertheimer <a href=\"https://twitter.com/udiWertheimer/status/1660326153972842496\" target=\"_blank\" rel=\"nofollow\" >reported</a> that friends reached out and implored me to reconsider going to Bitcoin Miami, due to many public violent threats from laser eye podcasters who believe NFTs have no place in the Bitcoin community.</p><p>The rift that Ordinals has caused in the Bitcoin community may well be summed as a conflict between the wizards and the laser-eyes  the former representing the experimental and fun-loving early ethos of Bitcoin, while the latter conveys intensity, seriousness and an unyielding focus on their vision for the greatest form of money known to man.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Eric-wizard.jpg\" alt=\"Eric wizard\" class=\"wp-image-21198\" width=\"534\" height=\"489\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Eric-wizard.jpg 834w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Eric-wizard-300x275.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Eric-wizard-770x705.jpg 770w\" sizes=\"(max-width: 534px) 100vw, 534px\" /><figcaption class=\"wp-element-caption\"><em>Eric Wall is a professional crypto investor (Twitter)</em></figcaption></figure><p>After the conference, I connect with Logan Golema, who is firmly on the wizard side and has deployed a BRC-20 token for his project Galaxer, which is building a space-based AR capture-the-flag game to work on Apples Vision Pro artificial reality goggles. </p><p>Believing that Bitcoin and its Ordinals will exist for eons into humanitys future, he argues that Ordinals  whether art or money  will be important much further into the future than the deployer today may intend.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/If-you-could-take-the-DeLorean-back-in-time-to-buy-cheap-Bitcoin-or-prevent-the-Taproot-upgrade-would-you.jpg\" alt=\"DeLorean\" class=\"wp-image-20977\" width=\"603\" height=\"395\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/If-you-could-take-the-DeLorean-back-in-time-to-buy-cheap-Bitcoin-or-prevent-the-Taproot-upgrade-would-you.jpg 958w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/If-you-could-take-the-DeLorean-back-in-time-to-buy-cheap-Bitcoin-or-prevent-the-Taproot-upgrade-would-you-300x196.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/If-you-could-take-the-DeLorean-back-in-time-to-buy-cheap-Bitcoin-or-prevent-the-Taproot-upgrade-would-you-770x504.jpg 770w\" sizes=\"(max-width: 603px) 100vw, 603px\" /><figcaption class=\"wp-element-caption\"><em>If you could take the DeLorean back in time to buy cheap Bitcoin  or prevent the Taproot upgrade  would you? (Elias Ahonen)</em></figcaption></figure><p>While some in the laser-eyes camp have raised the possibility of a fork to roll back the Taproot upgrade that enables Ordinals, Golema thinks its unlikely. Recalling the block-size wars that were a key driver in the Bitcoin Cash fork led by <a href=\"https://cointelegraph.com/magazine/roger-vers-next-life-cryonics-meets-crypto/\" target=\"_blank\" rel=\"nofollow\" >Bitcoin Jesus Roger Ver</a>, Golema explains that while disagreement certainly exists, it would take a lot for a chain fork to happen again. </p><p>Although various ways to remove what some core developers consider spam <a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\" target=\"_blank\" rel=\"nofollow\" >have been discussed</a>, Golema believes the innovations will be broadly accepted and integrated  even if only begrudgingly because doing away with them may bring even more trouble. </p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"507\" height=\"680\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-3.jpg\" alt=\"\" class=\"wp-image-21236\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-3.jpg 507w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/BTC-3-224x300.jpg 224w\" sizes=\"(max-width: 507px) 100vw, 507px\" /></figure><p>But Ordinals come with benefits, too, says Golema, helping to ensure Bitcoins transaction fees can sustain the network after the block reward halves away to nothing in the future.</p><p>Weve seen for one of the first times that the fee reward was bigger than the block reward  thats very important for the future of Bitcoins security.</p><p>For Bitcoin miners, the new age means more BTC coming into their collective coffers because the minting, deploying and transfer of Ordinals and Bitcoin-based tokens all require paying miners fees. This could help solve the issue of what happens when theres no more BTC left to mine. Direct mining rewards will end in the year 2140, so fees will be all thats left to incentivize miners, Golema notes. </p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"512\" height=\"685\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/btc-4.jpg\" alt=\"\" class=\"wp-image-21234\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/btc-4.jpg 512w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/btc-4-224x300.jpg 224w\" sizes=\"(max-width: 512px) 100vw, 512px\" /></figure><p>Similar benefits may exist for BTC hodlers  the long-term Bitcoin faithful. It is easy to imagine that as Bitcoin gains Ethereum-like capabilities, it will gain market share in NFTs and tokens, which will translate to demand not only in absolute terms but relative to competitors. </p><p>Perhaps by bringing NFTs and tokens to Bitcoin, the wizards can even <a href=\"https://cointelegraph.com/news/the-great-crypto-flippening-can-ethereum-overtake-bitcoin\" target=\"_blank\" rel=\"nofollow\" >prevent the flippening</a>, the potential ascent of Etereum to the top market cap position, which until now has been theorized to happen one day as a result of Bitcoin falling behind technologically while Ethereum innovates.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Major-cryptoassets-by-percentage-of-total-market-cap.png\" alt=\"Major cryptoassets by percentage of total market cap\" class=\"wp-image-21175\" width=\"609\" height=\"343\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Major-cryptoassets-by-percentage-of-total-market-cap.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Major-cryptoassets-by-percentage-of-total-market-cap-300x169.png 300w\" sizes=\"(max-width: 609px) 100vw, 609px\" /><figcaption class=\"wp-element-caption\"><em>Major crypto assets by percentage of total market cap. (CMC)</em></figcaption></figure><p>Bitcoin dominance is a metric that shows the relative values of various cryptocurrencies and is followed by many Bitcoiners. Starting the year at 40%, BTC has climbed to 48.1% of the market as of writing. Can JPEGs push Bitcoin back into the 60% range and herald a new bull market?</p><h2><strong>The Ordinals wizards</strong></h2><p>Some Bitcoiners are starting to rationalize Ordinals into their worldviews. </p><p>According to Aravind Sathyanandham, chief strategy officer at Bitcoin DeFi platform Velar, the Ordinals community is markedly different from the primarily Ethereum ape community, which has a bad reputation among the Bitcoin crowd. </p><p>These are Bitcoin guys  these are people who had to figure out how to run an entire node to inscribe stuff on Bitcoin, the mother chain.</p><p>He is referring to a kind of do-it-yourself hardiness  a rugged individualism emblematic of the money and tech conservatism of older stereotypical Bitcoiners as opposed to the also -stereotypical imagining of a more communal, liberal and younger Ethereum community. <br><br>From this Bitcoiner perspective, Ethereum is viewed as little more than a sandbox for children, while Bitcoin is eternal. Ethereum, Sathyanandham says, is a great experiment for NFTs and DeFi to take their first form, and now its Bitcoins turn.<br><br>These Bitcoin wizards understood early on that the block space on Bitcoin is prime real estate  its forever immutable and censorship-resistant data, he adds, not forgetting to add that Ethereum is semi-centralized. </p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-was-invited-to-sign-the-Bitcoin-Car-first-auctioned-for-1000-BTC-in-2013..jpg\" alt=\"Bitcoin car\" class=\"wp-image-20976\" width=\"625\" height=\"416\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-was-invited-to-sign-the-Bitcoin-Car-first-auctioned-for-1000-BTC-in-2013..jpg 950w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-was-invited-to-sign-the-Bitcoin-Car-first-auctioned-for-1000-BTC-in-2013.-300x200.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Elias-was-invited-to-sign-the-Bitcoin-Car-first-auctioned-for-1000-BTC-in-2013.-770x512.jpg 770w\" sizes=\"(max-width: 625px) 100vw, 625px\" /><figcaption class=\"wp-element-caption\"><em>Elias was invited to sign the Bitcoin Car, first auctioned for 1,000 BTC in 2013 (Elias Ahonen)</em></figcaption></figure><p>The phenomenon also appears to be growing the Bitcoin user base.</p><p>Ordinals have on-boarded so many individuals onto Bitcoin  new Bitcoin wallets like Hiro and Xverse that are akin to MetaMask have made it simple, Sathyanandham explains, referring to the wider ecosystem being built entirely for Ordinals that mirrors Ethereums in many ways. He notes that the Ethereum NFT communitys bleeding into the Bitcoin community is very evident on Crypto Twitter.</p><p>While Syed agrees with Ordinalist exceptionalism, he sees them more as technologists than strict Bitcoiners. Ive seen that BRC-20 and Ordinals early adopters are individuals who are slightly more tech-savvy digital collectible fans  its not like some virtual flood gates opened up to bring in loads of Bitcoin maxis, he observes.</p><p>Syed notes that currently its the same people who collect ETH, Solana or BNB digital collectibles jumping in early. Early adopters always win and the bottom line is: We are all early.</p><p>When the next bull run comes, perhaps correlated with the BTC halving, we might see everyone rush over the BRC-20 and Ordinal narrative.</p><p>It certainly feels like magic internet money once again.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T13:22:35.000Z",
    "title": "Binance launches regulated platform in Kazakhstan amid troubles in the West` ",
    "url": "https://cointelegraph.com/news/binance-launches-regulated-platform-in-kazakhstan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0449a980-2120-4636-91f2-fca4ae797cf6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Amid growing regulatory uncertainty in the West several crypto platforms have shifted their focus toward the Asia Pacific region.</p>\n                    <p><p>Global cryptocurrency exchange Binance <a href=\"https://www.binance.com/en/blog/ecosystem/binance-launches-a-regulated-digital-asset-platform-in-kazakhstan-7318383218004275432\" target=\"_blank\" rel=\"noopener nofollow\">announced </a>the launch of a regulated digital asset platform in Kazakhstan amid growing regulatory troubles in the West. The launch of the new platform was announced at a press event on June 20, 2023, in the presence of representatives of Kazakhstan’s banking industry, and Binance Kazakhstan's leadership. </p><p>The cryptocurrency exchange obtained an <a href=\"https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny\">in-principle approval to operate in Kazakhstan</a> in August and a permanent license to offer a digital asset platform and provide custodial services at the Astana International Financial Center (AIFC) in the country from the AIFC Financial Services Authority in October last year. </p><p>The new platform will offer a slew of crypto and fiat-focused services for Kazakhstani users including exchange and conversion services, deposit and withdrawal of fiat, and custody of crypto assets. </p><p>The banking services will be offered by Kazakhstan’s Freedom Finance Bank bank which would allow the new digital asset exchange users to transfer fiat funds to their accounts on the platform. There are two fiat channels available to deposit and withdrawals at present namely bank cards and bank transfers via Freedom Finance Bank.</p><p>The latest move for the leading crypto exchange by trading volume comes amid growing regulatory troubles in the United States and several European countries. Binance is currently embroiled in a <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">U.S. Securities and Exchange Commission (SEC) lawsuit</a>, as well as, a <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">lawsuit from the Commodity Futures Trading Commission (CFTC)</a>.</p><p>Apart from its troubles in the U.S., the crypto exchange is also facing regulatory pushback from several European countries. One report indicated that the exchange was under <a href=\"https://cointelegraph.com/news/binance-france-investigation-report\">investigation in France since early 2022</a> on “aggravated money laundering” charges. The exchange had to exit the Dutch market after failing to secure a virtual asset service provider license from regulators in the Netherlands. The crypto exchange also applied to <a href=\"https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny\">wind down its services in the United Kingdom</a> and <a href=\"https://cointelegraph.com/news/binance-applies-to-deregister-in-cyprus\">Cyprus. </a></p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-sec-lawsuit-could-dent-crypto-exchange-s-global-plans\">Binance SEC lawsuit could dent crypto exchange’s global plans</a></em></strong></p><p>Binance maintained its exit from several European countries over the past few weeks was to focus on becoming compliant with the European Union-approved <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">Markets in Crypto Assets (MiCA) regulations</a>. However, reports suggest that European regulators are working with SEC on the Binance investigation.</p><p>Binance is not the only global crypto exchange eyeing the Asian market amid growing regulatory uncertainty in the United States and Europe. Gemini announced its <a href=\"https://cointelegraph.com/news/gemini-plans-asia-pacific-expansion-as-part-of-next-wave-of-growth-for-crypto\">plans to focus on the Asia Pacific region</a> with an increase of staff at the crypto exchange’s Singapore division and establish an engineering division in India. With the rise of Hong Kong as a growing crypto hub, many crypto platforms are also assessing their plans to enter the country with legislators in the nation already <a href=\"https://cointelegraph.com/news/hong-kong-legislator-invites-coinbase-to-the-region-amid-sec-scrutiny\">inviting the likes of Coinbase to set up their office</a>.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T13:31:14.000Z",
    "title": "Miners are moving Bitcoin to exchanges en masse",
    "url": "https://cryptoslate.com/insights/miners-are-moving-bitcoin-to-exchanges-en-masse/",
    "description": "<p>Quick Take In recent months, miners have been reaping considerable benefits from the surge in popularity of Inscriptions and BRC-20 tokens, particularly in the form of increased mining fees. An important trend has started to emerge, however: significant portions of miners&#8217; balances are being transferred to exchanges. Although this does not definitively mean that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/miners-are-moving-bitcoin-to-exchanges-en-masse/\">Miners are moving Bitcoin to exchanges en masse</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-06-21T13:30:00.000Z",
    "title": "Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’",
    "url": "https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-bitcoin-2023-scaled.jpg\"></p><p>Shitcoins and NFTs invaded Bitcoin 2023, but most attendees didn’t seem to mind. Can Ordinals usher in a new era of Magic Internet Money?</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T13:15:00.000Z",
    "title": "Oracle Daemon Develops New Tools for Flare Network Data Providers",
    "url": "https://cryptodaily.co.uk/2023/06/oracle-daemon-develops-new-tools-for-flare-network-data-providers",
    "description": "<p>&nbsp;</p>\n<ul>\n<li aria-level=\"1\">Flare Network announces strategic partnership with Oracle Daemon.&nbsp;</li>\n</ul>\n<ul>\n<li aria-level=\"1\">Oracle Daemon developers will build and develop several user tools.&nbsp;</li>\n<li aria-level=\"1\">The collaboration aims to enhance the user experience and data quality on the network.</li>\n</ul>\n<p>Flare Network, a highly scalable Layer 1 blockchain providing high-integrity data to developers, has announced a strategic collaboration with Oracle Daemon, a group of talented developers working on blockchain and Web 3 solutions. The Oracle Daemon developers have previously been original data providers for the Flare Time Series Oracle on both the Flare and Songbird networks.</p>\n<p>Announced Monday, the collaboration aims at developing a new suite of user tools that enhance the user experience, provide better quality data, and introduce new features on Flare&rsquo;s network. Speaking on the latest collaboration with Oracle Daemon, David Pangerl, CEO &amp; Founder of Oracle Daemon, said:</p>\n\n<p>&ldquo;We have been building on Flare from the start, and with this collaboration, we will develop a number of important new tools to benefit the growing network.&rdquo;</p>\n\n<p>The developer group will build out three main user tools, namely the multi-wallet management tool, advanced data provider analytics tools and the auto-claiming executors. The multi-wallet management tool aims to streamline users' accounts and provide a detailed overview of all their balances in multiple wallets. The tool will allow users to manage funds in multiple wallets and accounts, offering simplified access to monitor and control their wallets.&nbsp;</p>\n<p>The advanced data provider analytics tool is the crop of the three features set to be added to the Flare network. Oracle Daemon will develop a detailed analytics tool specifically tailored to data providers. By leveraging the tool, data providers can gain valuable insights into their performance metrics, including data quality, reliability, and usage. As a data oracle, Flare aims to provide the highest quality of trustless data, and this tool will help data providers achieve this.&nbsp;</p>\n\n<p>&ldquo;I&rsquo;m most excited about the advanced data provider analytics,&rdquo; Pangerl said on developing the advanced data providers analytics tool. &ldquo;Flare is the only blockchain focused on giving developers access to quality data at scale. So, whatever we can do to support and optimise the data provision process will benefit the whole network.&rdquo;</p>\n\n<p>Finally, the collaboration will see the addition of auto-claiming executors, which will automate all existing token-claiming processes. These executors help users collect rewards and later on disburse the rewards to the user. With multiple rewards up for grabs, manual token claiming can be some work for the user. The auto-claiming executor will encompass several rewards, including data provider rewards, validator rewards, FlareDrops, FTSO delegation rewards, and escrowed fund unlocks.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T13:37:23.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T13:34:46.000Z",
    "title": "Ripple CTO applauds Coinbase’s milestone in the legal clash with SEC",
    "url": "https://www.cryptopolitan.com/ripple-cto-applauds-coinbases-milestone-in-the-legal-clash-with-sec/",
    "description": "In a recent tweet, Paul Grewal, the chief legal officer of Coinbase, provided an update on the ongoing legal dispute between the cryptocurrency exchange and the Securities and Exchange Commission (SEC). Grewal revealed that the Third Circuit Court of Appeals had decided to retain jurisdiction over Coinbase&#8217;s petition seeking basic rules in the crypto space. ... <a title=\"Ripple CTO applauds Coinbase&#8217;s milestone in the legal clash with SEC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-cto-applauds-coinbases-milestone-in-the-legal-clash-with-sec/\" aria-label=\"More on Ripple CTO applauds Coinbase&#8217;s milestone in the legal clash with SEC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T13:20:00.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T13:16:09.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:33:21.000Z",
    "title": "Your Ultimate Guide to Big Eyes Coin",
    "url": "https://www.crypto-news-flash.com/your-ultimate-guide-to-big-eyes-coin/?utm_source=rss&utm_medium=rss&utm_campaign=your-ultimate-guide-to-big-eyes-coin",
    "description": "What is Big Eyes Coin? Big Eyes Coin (BIG) is a newly launched cryptocurrency that has built up a lot of hype in the crypto space. Based on the Ethereum blockchain, this meme coin endeavours to take investors to the moon, and with its growing community and upcoming casino with play-to-earn games it is sure [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:30:55.000Z",
    "title": "Nike Launches NFT Sneaker Hunt in Fortnite, Driving Web3 Adoption: A Game-Changer for the Crypto-Driven Fashion Industry",
    "url": "https://www.crypto-news-flash.com/nike-launches-nft-sneaker-hunt-in-fortnite-driving-web3-adoption-a-game-changer-for-the-crypto-driven-fashion-industry/?utm_source=rss&utm_medium=rss&utm_campaign=nike-launches-nft-sneaker-hunt-in-fortnite-driving-web3-adoption-a-game-changer-for-the-crypto-driven-fashion-industry",
    "description": "Nike revealed the launch of an exciting event called the &#8220;ultimate Sneakerhunt,&#8221; on June 20th.   The inclusion of Nike&#8217;s SWOOSH platform strongly suggests the possibility of integrating NFTs into Airphoria. Nike, the well-known global brand for footwear and apparel, has hinted at an upcoming launch of a series of non-fungible tokens (NFTs) representing sneakers. Anticipation [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:30:30.000Z",
    "title": "Love Hate Inu ($LHINU) vs Hollywood X PEPE ($HXPE) A Comparative Review",
    "url": "https://www.crypto-news-flash.com/love-hate-inu-lhinu-vs-hollywood-x-pepe-hxpe-a-comparative-review/?utm_source=rss&utm_medium=rss&utm_campaign=love-hate-inu-lhinu-vs-hollywood-x-pepe-hxpe-a-comparative-review",
    "description": "Cryptocurrencies have been making a significant splash in the world of finance over the last decade. Their decentralized nature, paired with the immense potential for growth, has created an arena where a plethora of tokens jockey for position. Today, we will focus on two emerging crypto coins that have been garnering attention: Love Hate Inu [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:22:50.000Z",
    "title": "Cardano Overtakes Ethereum: Can Caged Beasts Achieve The Same Feat?",
    "url": "https://www.crypto-news-flash.com/cardano-overtakes-ethereum-can-caged-beasts-achieve-the-same-feat/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-overtakes-ethereum-can-caged-beasts-achieve-the-same-feat",
    "description": "In the fast-paced world of cryptocurrencies, innovation and competition are constant drivers of progress. Since the inception of Bitcoin, the decentralised finance (DeFi) ecosystem has witnessed the rise of numerous digital currencies, each vying to challenge traditional markets and establish their dominance. Among these contenders, two notable players have captured the attention of crypto enthusiasts: [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:20:58.000Z",
    "title": "VeChain Blends the Physical and Digital Worlds through NFTs and Web3 Innovations in Exciting New Partnership",
    "url": "https://www.crypto-news-flash.com/vechain-blends-the-physical-and-digital-worlds-through-nfts-and-web3-innovations-in-exciting-new-partnership/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-blends-the-physical-and-digital-worlds-through-nfts-and-web3-innovations-in-exciting-new-partnership",
    "description": "VeChain seals another partnership to provide a Phygital trophy for the winner of the Street Skateboarding Rome this year. Regardless of its innovative technologies, the VET price has reacted marginally in the last seven days with a 1.6 percent fall.  VeChain (VET) has announced that it is now the tech provider for Street Skateboarding Rome [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-21T13:33:39.000Z",
    "title": "A Beginner’s Guide to Orderly Network",
    "url": "https://www.altcoinbuzz.io/defi/a-beginners-guide-to-orderly-network/",
    "description": "<p>The crypto market is getting saturated. On the surface, this shows an increased level of adoption, but it also presents a challenge. Identifying a worthy project has become more difficult. In addition, not all projects have good fundamentals. Some crypto projects are outright scams.  Now that the bull market is around the corner, now’s the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/defi/a-beginners-guide-to-orderly-network/\">A Beginner&#8217;s Guide to Orderly Network</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T13:25:00.000Z",
    "title": "Crypto Entrepreneur Questions MakerDAO’s New Savings DAI Token",
    "url": "https://coinedition.com/crypto-entrepreneur-questions-makerdaos-new-savings-dai-token/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Community Disagrees as MakerDAO Will Allow MKR to Borrow DAI\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/13_Maker_MKR_Prices_Have_Risen_13_64_as_Bulls_Outpace_Bears-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Adam Cochran, the crypto entrepreneur behind Synthetix, has questioned and expressed concerns about MakerDAO’s recently unveiled Savings DAI token (sDAI). sDAI was introduced by the DeFi lending platform earlier this week. It is an ERC-4626 token powered by the Dai Savings Rate (DSR) and is the tokenized version of DSR-enabled DAI. Cochran, who also happens [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-entrepreneur-questions-makerdaos-new-savings-dai-token/\">Crypto Entrepreneur Questions MakerDAO’s New Savings DAI Token</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]