[
  {
    "source": "Bitcoin.com",
    "date": "2024-02-07T15:30:21.000Z",
    "title": "Quantum Cats NFT Collection Jumps in Value, Dominates Secondary Market Trade Volume",
    "url": "https://news.bitcoin.com/quantum-cats-nft-collection-jumps-in-value-dominates-secondary-market-trade-volume/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Quantum Cats NFT Collection Jumps in Value, Dominates Secondary Market Trade Volume\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/qcats.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the launch of Taproot Wizards&#x2019; Quantum Cats non-fungible token (NFT) series, secondary market activity reveals significant trading volume and a significant increase in the collection&#x2019;s minimum value. Initially offered at 0.1 bitcoin each, Quantum Cats&#x2019; lowest value now fluctuates around 0.303 bitcoin or $13,062 for each NFT. Quantum Cats Floor Values Leap to New [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:35:36.000Z",
    "title": "UAE Financial Center ADGM forges new partnership with Solana Blockchain Foundation",
    "url": "https://www.cryptopolitan.com/uae-financial-center-adgm-forges-new-partnership-with-solana-blockchain-foundation/",
    "description": "Once again the UAE financial center in Abu Dhabi, the Abu Dhabi Global Market (ADGM) has forged a new partnership with a leading blockchain platform, the Solana Foundation to enhance Distributed Ledger technology and blockchain innovation. The Solana Foundation is a non-profit organization dedicated to decentralization, adoption, and security on Solana network. The initiative aligns [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:34:06.000Z",
    "title": "Nintendo President Responds to Palworld Controversy",
    "url": "https://www.cryptopolitan.com/nintendo-president-responds-to-palworld/",
    "description": "Nintendo President, Shuntaro Furukawa, addressed the ongoing debate surrounding Palworld during a recent earnings Q&#38;A session. The popular survival game, which has garnered significant attention since its early access release on PC and Xbox, has faced allegations of bearing striking similarities to the Pokémon series. Furukawa&#8217;s statement on intellectual property In response to questions regarding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:20:15.000Z",
    "title": "Ethereum custody by Prometheum to test SEC’s crypto securities stance—Here’s why",
    "url": "https://www.cryptopolitan.com/ethereum-custody-by-prometheum-to-test-secs/",
    "description": "Prometheum Inc., a pioneering firm in the cryptocurrency sector, has announced its plans to launch a custody operation for Ethereum (ETH), marking a significant move as the only U.S.-registered crypto securities platform. This decision by Prometheum is set to test the Securities and Exchange Commission&#8217;s (SEC) perspective on whether ETH should be classified as a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T15:14:48.000Z",
    "title": "TIME100 AI Impact Awards Honors Visionaries Shaping the Future in Dubai",
    "url": "https://www.cryptopolitan.com/time100-ai-impact-awards-honors-visionaries-shaping-the-future-in-dubai/",
    "description": "TIME magazine unveils the recipients of its highly anticipated TIME100 AI Impact Awards, showcasing individuals at the forefront of artificial intelligence (AI) innovation. The prestigious gala event, held on Sunday, February 11th, at the renowned Museum of the Future in Dubai, marks the third consecutive year of TIME&#8217;s presence in the city. This year&#8217;s focus [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T15:30:53.000Z",
    "title": "Ex-Ripple Director Heralds ‘Big News’ For XRP, Can Price Respond?",
    "url": "https://www.newsbtc.com/xrp-news/ex-ripple-director-big-xrp-news/",
    "description": "Sean McBride, the former Director of Global Talent Acquisition at Ripple, has hinted at significant upcoming news for Ripple and XRP. McBride&#8217;s announcement, made via a post on X (formerly known as Twitter), has sparked a mix of excitement and skepticism among followers and investors alike. His post stated: “Big news coming from #Ripple and #XRP in the next couple days,” setting the stage for speculation on what the news could entail and its potential impact on XRP&#8217;s market performance. However, the reaction to McBride&#8217;s announcement has been varied within the XRP community. Big news coming from #Ripple and #XRP in the next couple days &#8212; Sean McBride (@seanmcbride16) February 6, 2024 Wietse Wind, the founder of XRPL Labs—a company known for developing XRP Ledger-based projects such as XAMAN (formerly XUMM), a digital wallet, and Codius, a smart contract platform—responded with a hint of skepticism, implying concerns about insider trading: Must be quite the news if it is worth entering insider trading territory. Another community member, identified as Faisal, expressed a more cynical view, suggesting a pattern of temporary engagement with Ripple&#8217;s technology: “Another company using Ripple&#8217;s products as a ‘pilot program’ and then never actually using it after?” This sentiment reflects a broader skepticism that has occasionally surrounded Ripple&#8217;s partnerships and the actual adoption of its technology. Related Reading: XRP Buy Signal Goes Off, Analyst Says This Is How Long Uptrend Will Last In response to the negative feedback, McBride&#8217;s retort was blunt: “Yeah, all you non Ripple shareholders can STFU because, yes, big news IS coming, already has come, and XRP is going to explode so piss off if you don’t have anything positive to say.” This statement indicates a strong belief in the significance of the upcoming news and its potential to positively impact the XRP price. XRP Price Shows No Reaction (Yet) As of press time, the XRP price has not shown any significant reaction to McBride&#8217;s announcement. This lack of immediate market movement may suggest that investors are adopting a wait-and-see approach. In a technical analysis of XRP against the US dollar (1-day chart), the price shows a continuation within a descending channel pattern, indicating a bearish market sentiment. As of press time, the XRP price hovered around the $0.50 mark. The chart analysis reveals that the price of XRP is currently struggling below several critical Exponential Moving Averages (EMAs) – the 20-day EMA at $0.52319, the 50-day EMA at $0.55345, and the 100-day EMA at $0.56877. This EMA positioning suggests a strong resistance level for any upward price movement. Furthermore, the 200-day EMA at $0.56220, although below the 100-day EMA, still acts as a potential resistance zone. Related Reading: Crypto Analyst Highlights Why XRP Price Is Ready For Takeoff Volume indicators show a relatively stable volume with a slight increase in selling pressure, as denoted by the red volume bars. The Relative Strength Index (RSI) is at 36.08, which is close to the oversold territory, but not yet indicative of a strong reversal signal. Notably, the price is trading near the 0.786 Fibonacci retracement level at $0.49894, a critical support level in the short term. This Fibonacci retracement is drawn from the major swing high at $0.74902 to the swing low at $0.43085. The price has already breached the 0.5 ($0.58993) and 0.618 ($0.55239) Fibonacci levels, which were previously acting as support levels, and is now testing the 0.786 level for potential support. The descending channel pattern is defined by two parallel lines, with the price making lower highs and lower lows, which is typically seen as a bearish signal. For traders looking for a bullish reversal, a break above the upper boundary of the channel and the nearest EMA would be essential. Conversely, a drop below the 0.786 Fibonacci level could see the price test the $0.43085 level, which is the recent swing low. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T15:23:12.000Z",
    "title": "WEMIX expands global reach with its first Europe listing on Bit2Me, Spain’s largest virtual asset exchange",
    "url": "https://www.crypto-news-flash.com/wemix-expands-global-reach-with-its-first-europe-listing-on-bit2me-spains-largest-virtual-asset-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=wemix-expands-global-reach-with-its-first-europe-listing-on-bit2me-spains-largest-virtual-asset-exchange",
    "description": "<img width=\"1200\" height=\"656\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T182006.528.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T182006.528.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T182006.528-300x164.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T182006.528-768x420.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T182006.528-150x82.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T182006.528-450x246.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />WEMIX Foundation plans to increase accessibility and convenience to WEMIX for over 450 million Spanish speakers worldwide  Bit2Get incorporates over 20 solutions for buying, selling, and managing virtual currencies and euros with clients in more than 100 countries Recognised for excellence in security and regulatory compliance including ISO/IEC 27001 and ISO 22301 certifications Positioned as [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-07T15:31:35.000Z",
    "title": "$JUP Holders Gain Exclusive Skin in Star Atlas Celebration",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/jup-holders-gain-exclusive-skin-in-star-atlas-celebration/",
    "description": "<p>This unique opportunity comes as a celebration of Jupiter Exchange&#8217;s recent airdrop, offering a rare and exclusive skin to those quick enough to seize it. This limited-time offer not only rewards current $JUP holders but also adds an intriguing layer of engagement within the expansive Star Atlas metaverse. Claim Your Rare $JUP Holder Skin: Limited [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/jup-holders-gain-exclusive-skin-in-star-atlas-celebration/\">$JUP Holders Gain Exclusive Skin in Star Atlas Celebration</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-07T15:30:12.000Z",
    "title": "Mysterious Institution Accumulating Massive Amounts of Chainlink (LINK), According to Lookonchain",
    "url": "https://dailyhodl.com/2024/02/07/mysterious-institution-accumulating-massive-amounts-of-chainlink-link-according-to-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Mysterious-Institution-Accumulating.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A mysterious crypto whale or institution appears to have been gobbling up massive amounts of the native asset for the decentralized oracle network Chainlink (LINK), according to the blockchain tracker Lookonchain. Lookonchain notes that a total of 47 fresh wallets withdrew 2,237,504 LINK worth $42.38 million from top crypto exchange Binance over a two-day period. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/07/mysterious-institution-accumulating-massive-amounts-of-chainlink-link-according-to-lookonchain/\">Mysterious Institution Accumulating Massive Amounts of Chainlink (LINK), According to Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]