[
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T14:00:59.000Z",
    "title": "Market rebounds after SEC lawsuits spur brief panic",
    "url": "https://cryptoslate.com/market-rebounds-after-sec-lawsuits-spur-brief-panic/",
    "description": "<p>This week&#8217;s market turmoil, induced by the announcement of the U.S. Securities and Exchange Commission (SEC) lawsuits against Binance and Coinbase, appears to have been a momentary blip rather than a sustained downturn. While initial reactions saw panic selling, the market&#8217;s swift recovery reflects its robustness. The SEC&#8217;s lawsuits come from its increasingly stringent scrutiny [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/market-rebounds-after-sec-lawsuits-spur-brief-panic/\">Market rebounds after SEC lawsuits spur brief panic</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T13:59:25.000Z",
    "title": "Terra co-founder’s handwritten letter sparks political firestorm in Montenegro",
    "url": "https://www.cryptopolitan.com/terra-co-founders-handwritten-letter-sparks-political-firestorm-in-montenegro/",
    "description": "In a shocking turn of events, a handwritten letter penned by Do Kwon, co-founder of the blockchain platform Terra, has emerged, stirring a political firestorm in Montenegro. The message, addressed to outgoing Prime Minister Dritan Abazović and outgoing Justice Minister Marko Kovac, alleges a previously undisclosed connection between Kwon and former Finance Minister Milojko Spajić, ... <a title=\"Terra co-founder&#8217;s handwritten letter sparks political firestorm in Montenegro\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terra-co-founders-handwritten-letter-sparks-political-firestorm-in-montenegro/\" aria-label=\"More on Terra co-founder&#8217;s handwritten letter sparks political firestorm in Montenegro\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T14:09:07.000Z",
    "title": "Money 20/20 looks at the frontiers of crypto policy and evolution of CBDCs",
    "url": "https://crypto.news/money-20-20-looks-at-the-frontiers-of-crypto-policy-and-evolution-of-cbdcs/",
    "description": "At Money20/20 in Amsterdam, a panel titled \"CBDC’s: The Next Steps\" discussed the potential of central bank digital currencies, decentralized finance, and decentralized autonomous organizations."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T14:00:21.000Z",
    "title": "LDO Leads Top Coins, Registers 6% Gains In One Day",
    "url": "https://www.newsbtc.com/news/ldo-leads-top-coins-registers-6-gains-in-one-day/",
    "description": "Lido DAO (LDO) price gains today suggest the bulls are determined to push it to the $2.5 mark as the broader crypto market cap increased in the last day.  LDO has joined the top-gaining coins today, June 7, with an over 6% price increase over the past 24 hours. The token closely follows PEPE, which has gained over 12% in the last 24 hours. LDO Price Surge Amid Improved Market Sentiments While LDO ranked 6th among top daily gainers, it scored second among top weekly gainers with a 13.48% price increase over the past seven days. Having a high of $2.45 and a low of $2.22, LDO is eyeing the $2.5 price level and might conquer it if the bulls continue to dominate the market. Related Reading: Chainlink Bulls Must Uphold This Critical Support Line For Potential 8% Rally According to CoinMarketCap data, Lido DAO has witnessed impressive price performances over the past 30 days. The token price has increased by over 36% in the last 30 days, 20.2% in 14 days, and 13.48% over the past seven days. The crypto market seems bullish as investors anticipate the May CPI data, which the US Bureau of Labor Statistics will release on June 13. The inflation rate reduced to 4.95% in April from the 5.0% recorded in March against the 5.0% forecasted by economists. This shows that the Fed&#8217;s hawkish inflation-curbing strategy is taking effect. Moreover, given the increasing recession and severe macroeconomic conditions, the Federal Reserve said it would pause the interest rates hike. And that has been reflected in crypto prices as Bitcoin prices pushed higher above $28,000. The sentiments appear higher still, even as investors anticipate the upcoming CPI data release. At press time, the crypto market cap is up by 2.86%, while the total market volume has increased by 12.13%, rubbing off on most coins. Increased Network Activities Propel LDO Price  The effect of the crypto market volume increase on assets is evident on LDO&#8217;s trading volume, which has increased by over 37% in the last 24 hours. That&#8217;s not all. According to Stelareum data, LDO total value locked (TVL) is up by 4.59%, against the 5.09% decline recorded on June 6. Lido Analytics also shows that LIDO TVL spiked 7.24% from May 29 to June 5, ending the week at $13.54 billion. As of June 5, LDO staking led on Ethereum with a net deposit of 264.99K ETH, followed by an unknown contract with 215.68K ETH deposits. That suggested increased trading activities on the protocol, which could also push the LDO price. Related Reading: Bitcoin Casino Canada: The Best Sites for Crypto Gambling 2023 Meanwhile, LDO technical analysis on TradingView flags a strong buy signal. LDO’s price has climbed above all the Exponential and Simple Moving Averages but remains below the Hull Moving Average at 2.360. Chances are high that the token would push above the $2.5 mark if it can conquer the Hull Moving Average. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T14:00:32.000Z",
    "title": "Uniswap (UNI) And InQubeta (QUBE) Hit Milestones In Their Project Developments",
    "url": "https://www.crypto-news-flash.com/uniswap-uni-and-inqubeta-qube-hit-milestones-in-their-project-developments/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-uni-and-inqubeta-qube-hit-milestones-in-their-project-developments",
    "description": "<p>With the emergence of Bitcoin (BTC) in 2009, many cryptocurrencies with more exciting features have been introduced in the crypto space. While they aim to make an impact and attract investors, they also seek to reach milestones and stay above the market odds. It is interesting to know that two such coins, Uniswap (UNI) and [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/uniswap-uni-and-inqubeta-qube-hit-milestones-in-their-project-developments/\">Uniswap (UNI) And InQubeta (QUBE) Hit Milestones In Their Project Developments</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T13:49:00.000Z",
    "title": "‘All-Out Attack on Crypto,’ Crypto Leaders Condemn SEC’s Actions",
    "url": "https://coinedition.com/all-out-attack-on-crypto-crypto-leaders-condemn-secs-actions/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/👮‍♂️-The-SEC-Endgame-👮‍♂️-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/👮‍♂️-The-SEC-Endgame-👮‍♂️-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/👮‍♂️-The-SEC-Endgame-👮‍♂️-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/👮‍♂️-The-SEC-Endgame-👮‍♂️.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Media company Bankless took to Twitter earlier today to address the SEC’s persistent attacks on crypto and blockchain projects. “The SEC is showing its cards and Gary Gensler doesn&#8217;t believe crypto in America should exist at all,” the platform wrote in its latest statement. Bankless alleged that a day after targeting Binance, the SEC went [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/all-out-attack-on-crypto-crypto-leaders-condemn-secs-actions/\">‘All-Out Attack on Crypto,’ Crypto Leaders Condemn SEC’s Actions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]