[
  {
    "source": "CoinDesk",
    "date": "2023-09-13T09:29:00.000Z",
    "title": "Crypto Market Shows Signs of Stability Ahead of U.S. CPI",
    "url": "https://www.coindesk.com/markets/2023/09/13/crypto-market-shows-signs-of-stability-ahead-of-us-cpi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "While some economists predict a jump in U.S. CPI compared to July, Factset research shows inflation is becoming less of a concern for large companies."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-13T09:15:15.000Z",
    "title": "Telegram integrates self-custodial crypto wallet for 800 million users, TON ralllies 14%",
    "url": "https://cryptoslate.com/telegram-integrates-self-custodial-crypto-wallet-for-800-million-users-ton-ralllies-14/",
    "description": "<p>Telegram has incorporated a self-custodial crypto wallet based on The Open Network (TON) for its over 800 million active monthly users, according to a Sept. 13 statement shared with CryptoSlate. The wallet, known as TON Space, brings digital ownership on the blockchain to the messaging application. The feature will be accessible to all Telegram Wallet [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/telegram-integrates-self-custodial-crypto-wallet-for-800-million-users-ton-ralllies-14/\">Telegram integrates self-custodial crypto wallet for 800 million users, TON ralllies 14%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-13T09:23:26.000Z",
    "title": "$ADA: EMURGO CEO Says His Firm Plans to Fill the 21 ‘Gaps’ in Cardano’s Ecosystem",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ada-emurgo-ceo-says-his-firm-plans-to-fill-the-21-gaps-in-cardanos-ecosystem/",
    "description": "In a recent interview with Cointelegraph Magazine’s editor, Andrew Fenton, Ken Kodama, CEO and founder of Singapore-based EMURGO Group Pte. Ltd., shared the organization’s new strategy to address 21 specific areas where Cardano’s ecosystem could be improved. EMURGO, a founding entity of the Cardano blockchain that provides products and services to drive the adoption of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T09:26:50.000Z",
    "title": "Roblox Revolutionizes User Experience with Groundbreaking AI Innovations",
    "url": "https://www.cryptopolitan.com/roblox-revolutionizes-ai-innovation/",
    "description": "Roblox introduces groundbreaking AI innovation for online gaming. Explore an enhanced virtual world crafting, avatar personalization, and real-time voice controls for an enriched user journey."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T09:21:16.000Z",
    "title": "Astar Network and Polygon collaborate to launch zkEVM Ethereum Layer 2",
    "url": "https://www.cryptopolitan.com/astar-network-and-polygon-collaborate/",
    "description": "In a significant development for the blockchain community, Astar Network, a prominent Layer 1 smart contract platform, has announced its collaboration with Ethereum scaling developer Polygon Labs. The partnership aims to introduce Astar zkEVM, a Layer 2 solution that promises to revolutionize the Ethereum, Polkadot, and Cosmos ecosystems. A new era for Ethereum scaling Astar ... <a title=\"Astar Network and Polygon collaborate to launch zkEVM Ethereum Layer 2\" class=\"read-more\" href=\"https://www.cryptopolitan.com/astar-network-and-polygon-collaborate/\" aria-label=\"More on Astar Network and Polygon collaborate to launch zkEVM Ethereum Layer 2\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T09:34:57.000Z",
    "title": "Everlodge presale drawing Uniswap and Polkadot supporters",
    "url": "https://crypto.news/everlodge-presale-drawing-uniswap-and-polkadot-supporters/",
    "description": "The Everlodge (ELDG) presale has found support from Uniswap (UNI) and Polkadot investors"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T09:19:24.000Z",
    "title": "Ripple CEO calls US one of the worst regions for crypto startups",
    "url": "https://crypto.news/ripple-ceo-calls-us-one-of-the-worst-regions-for-crypto-startups/",
    "description": "Ripple CEO Brad Garlinghouse says that the United States is one of the worst regions for crypto companies as his company has been struggling with the country’s SEC. Garlinghouse discouraged crypto startups and investors from launching in the US at&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T09:20:30.000Z",
    "title": "Why The NASDAQ’s Latest Move Is Important For Fund Managers Filing Ethereum ETFs",
    "url": "https://www.newsbtc.com/news/ethereum/nasdaq-ethereum-etfs/",
    "description": "Traditional financial institutions that have filed crypto ETF applications have focused on a particular market (spot or futures). However, a recent NASDAQ application suggests that the asset manager Hashdex is taking a different approach, which could be a game changer in the Ethereum ETF race.  NASDAQ Proposes To List Ethereum ETF According to the application filed with the US Securities and Exchange Commission (SEC), the stock exchange plans to list and trade shares of the Hashdex Nasdaq Ethereum ETF, which will be managed and controlled by Toroso Investments LLC. Interestingly, the fund will hold both Ether futures contracts and Spot Ether. This move from asset manager Hashdex is novel, considering that other asset managers have either applied to offer a Spot Ether ETF or Ether futures ETF or filed applications to offer both separately. However, Hashdex wants to offer a fund holding both Ether futures contracts and a Spot Ethereum ETF. Related Reading: Tron’s Justin Sun Mulls Over Making A Move On FTX’s Crypto Stash, Here’s Why The fund&#8217;s sponsors believe that combining Ether Futures Contracts and Spot Ether will help mitigate the risk of market manipulation (a major concern of the SEC) and provide the market with a “regulated product” that tracks Ethereum’s price. This fund will help US investors gain exposure to Spot Ether without relying on “unregulated products, offshore regulated products, or indirect strategies such as investing in publicly traded companies that hold Ether.” In fulfillment of the requirement of having a surveillance-sharing agreement (SSA) for the proposed ETF, Nasdaq stated in the application that the Chicago Mercantile Exchange (CME) will be used to track the price of Ethereum as the CME represents a “regulated market of significant size.” Furthermore, the fund is expected to hold physical Ether. However, the sponsors do not intend to purchase these tokens from “unregulated ether spot exchanges” but from the CME Market’s Exchange for Physical (EFP) transactions. This move is similar to Hashdex’s application to combine a spot Bitcoin ETF with its existing Bitcoin futures ETF. Hashdex, in its application, stated that the CME will be used to track Spot Bitcoin’s price and that all Bitcoin purchases will be from the CME’s EFP. ETH kicks off Wednesday on a volatile note &#124; Source: ETHUSD on Tradingview.com Hashdex Throwing Other Asset Managers Under The Bus? Nasdaq’s application mentions the phrase “unregulated spot exchanges” multiple times in what seems to be a direct attack on Coinbase and the applications of other asset managers. It is worth mentioning some of the other asset managers, including Ark Invest, who have filed to offer an Ethereum-related ETF, have chosen Coinbase as their custodian. As such, Hashdex labeling Coinbase as an “unregulated spot exchange” doesn’t seem right, as this could undoubtedly influence the SEC’s decision when dealing with these applications. Related Reading: Analyst Points Out Why End Of 2023 Will Not Be Great For XRP Price Furthermore, asset managers like BlackRock picking Coinbase for their SSA and custodian had already sparked controversy as many had stated that the SEC would not be so inclined to approve an application in which Coinbase is directly or indirectly involved since it has an ongoing lawsuit against the crypto exchange. While many may commend Hashdex’s “innovative approach,” there is a need to be wary of how this approach could hinder the application of others and the eventual effect on the crypto industry in general.    Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-13T09:15:17.000Z",
    "title": "Dogecoin (DOGE), Tron (TRX) and Polygon (MATIC) Could Get Rocked if FTX Liquidates Holdings: Analytics Firm",
    "url": "https://dailyhodl.com/2023/09/13/dogecoin-doge-tron-trx-and-polygon-matic-could-get-rocked-if-ftx-liquidates-holdings-analytics-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/doge-trx-matic.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Three altcoins could suffer price dips due to upcoming FTX liquidations, according to the crypto analytics firm Messari. Messari notes that FTX and Alameda hold $37 million worth of top meme asset Dogecoin (DOGE), $33 million worth of blockchain-based operating system Tron (TRX) and $22 million worth of the scaling solution Polygon (MATIC). &#8220;The relevant [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/13/dogecoin-doge-tron-trx-and-polygon-matic-could-get-rocked-if-ftx-liquidates-holdings-analytics-firm/\">Dogecoin (DOGE), Tron (TRX) and Polygon (MATIC) Could Get Rocked if FTX Liquidates Holdings: Analytics Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]