[
  {
    "source": "Decrypt",
    "date": "2024-01-24T01:40:22.000Z",
    "title": "Are Mt. Gox Creditor Gears Turning? Rumors Rattle Bitcoin Market",
    "url": "https://decrypt.co/213987/mt-gox-repayment-reports-bitcoin-crash",
    "description": "Bitcoin fell after reports emerged saying Mt. Gox has started to repay its creditors—dragging the rest of the cryptocurrency market with it."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-24T01:54:02.000Z",
    "title": " Guessing game on when GBTC bleeding stops helps push Bitcoin below $39K  ",
    "url": "https://cointelegraph.com/news/bitcoin-price-down-39k-grayscale-gbtc-bleeding-outflow",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzZlMDA1ZTgtMDgzNi00MmNlLWJhZjAtMjc3OGM0ZDRlODNjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The GBTC “mass exodus” may be showing signs of slowing, but that hasn’t stopped Bitcoin from falling to two-month lows on Jan. 23.</p>\n                    <p><p>A multibillion-dollar guessing game over an investor exodus from Grayscale’s Bitcoin Trust (GBTC) has pushed the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) below $39,000 for the first time in nearly two months. </p><p>Since its successful conversion to a spot Bitcoin exchange-traded fund (ETF) on Jan. 11, GBTC has posted over $3.4 billion in outflows, with Grayscale <a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-etf-transfers-another-376-million-worth-btc-price-stabilizes\">subsequently depositing billions in Bitcoin</a> to crypto exchange Coinbase Prime — likely for sale. </p><p>However, there are fears that the <a href=\"https://cointelegraph.com/news/estimated-1b-leaves-gbtc-in-3-days-ark-buys-own-bitcoin-etf\">GBTC exodus</a> still has a longer road to travel. According to Bloomberg ETF analyst Eric Balchunas, GBTC <a href=\"https://twitter.com/EricBalchunas/status/1749951185056907771\" target=\"_blank\" rel=\"noopener nofollow\">recorded</a> an outflow of $515 million on Jan. 23 and has now bled 13% of its shares outstanding. He noted, however, that the latest figures suggest the outflow could be slowing. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-down-39k-grayscale-gbtc-bleeding-outflow\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-24T01:51:31.000Z",
    "title": "Bitcoin set for supply shock as ETF buys surge and halving nears",
    "url": "https://cryptobriefing.com/bitcoin-supply-shock-etf-buys-surge-halving-nears/?utm_source=feed&utm_medium=rss",
    "description": "The upcoming halving and a surge in demand fueled by recently approved spot Bitcoin ETFs could trigger a Bitcoin supply shock."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-24T01:49:20.000Z",
    "title": "Avalanche Foundation outlines meme coin buying policy",
    "url": "https://cryptobriefing.com/avalanche-foundation-outlines-meme-coin-buying-policy/?utm_source=feed&utm_medium=rss",
    "description": "The Avalanche Foundation defines meme coin eligibility through criteria like fair launches, anti-sniping measures, and security practices."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-24T02:00:17.000Z",
    "title": "Peter Schiff Says All Spot Bitcoin ETFs Are Now in Bear Markets — Warns of Deeper Losses",
    "url": "https://news.bitcoin.com/peter-schiff-says-all-spot-bitcoin-etfs-are-now-in-bear-markets-warns-of-deeper-losses/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Peter Schiff Says All the Spot Bitcoin ETFs Are Now in Bear Markets — Warns of Deeper Losses\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/peter-schiff-etfs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Gold bug and economist Peter Schiff has warned of deeper losses for spot bitcoin exchange-traded funds (ETFs), emphasizing that they are &#x201C;now in bear markets.&#x201D; Referencing the Proshares Bitcoin Strategy ETF which is down more than 50% in over two years, Schiff predicted that those who bought the newly approved spot bitcoin ETFs &#x201C;will experience [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T02:00:46.000Z",
    "title": "Exploit On Polygon Contracts Extract $15M, Here Are The Details",
    "url": "https://www.newsbtc.com/news/exploit-on-polygon-contracts-extract-15m-here-are-the-details/",
    "description": "The play-and-own mobile gaming platform GAMEE suffered an exploit of its GMEE token contracts on Polygon that led to the theft of 600 million GMEE tokens and left the crypto community pondering questions. Related Reading: Solana-Based Aurory Suffers Devastating Exploit: 80% Of Liquidity Gone GAMEE Confirms $15M Exploit On Polygon On January 22, GAMEE Token’s official X (formerly Twitter) account advised its users to refrain from engaging with the digital asset while their team investigated the GMEE token-related security comprise it had just suffered. The GMEE token is an ERC-20 utility token “designed to be the currency of access, action, and governance within the GAMEE ecosystem,” as their website states. 🚨 $GMEE &#124; URGENT There has been a security incident involving the GMEE token. As a precautionary measure, we advise all users to refrain from engaging with $GMEE until further notice. Our team is actively investigating the situation, and updates will be provided soon. &#8212; GMEE Token (@GAMEEToken) January 22, 2024 Before the official announcement, crypto users quickly noticed the token’s sudden price crash and the transactions behind it. This left GAMEE users and the general crypto community wondering if an exploit had occurred. In the early hours of January 23, GAMEE’s team returned to the X platform to explain what happened and the steps to come. The thread explains that their preliminary investigation indicated that the GMEE token contracts on Polygon had been compromised via unauthorized GitLab access. This compromise resulted in the theft of 600 million GMEE tokens worth approximately $15.28 million at the time of the exploit. The compromised tokens were immediately converted to ETH and MATIC and exchanged via various decentralized exchanges (DEXs) in the following hours, drastically impacting the GMEE token price. The team behind GAMEE explained that after noticing the Polygon GMEE deployer address was compromised, they secured the token contract ownership and all associated contracts by transferring ownership to a “new secure address.” The team also clarified that only proprietary team token reserves were affected, and the exploit did not affect assets owned by the community, as “GAMEE does not custody or manage any community-owned assets.” GAMEE expressed its understanding of how the impact of the unauthorized transactions could have affected the GAMEE community, as it led to price volatility and limited use of the GMEE token while investigations were taking place. The next steps for GAMEE will consist of an impacted user identification process to evaluate the best way to support the affected part of the community. Additionally, they plan to provide a real-time update on the details that further investigations will provide as an effort to keep trust and transparency. Lastly, the user was advised to exercise caution “given the volatile market conditions and potential liquidity impacts driven by CEX measures.” GMEE&#8217;s Violent Price Drop Around the time of the exploit, the GMEE token had been trading at $0.02554112, according to CoinGecko’s data, and it had been previously sitting at the $0.027-$0.026 range throughout the weekend. Shortly after the exploit, the prince crashed to $0.01155577, reaching its lowest point of $0.00897251 in the early hours of today. It&#8217;s worth noting that many saw the price crash as a possibly once-in-a-lifetime opportunity to profit. Various users shared that they had bought the dip and even advised others to do it. One X user said, “One man’s trash is another man’s treasure.” At writing time, the GMEE token trades at $0.016999, a 31.5% decline in the last 24 hours. Related Reading: Avalanche-Based Stars Arena Falls Victim To A $3 Million Exploit, TVL Tanks By 100% GAMEE is currently trading at $0.016999 in the hourly chat. Source: GMEEUSDT on TradingView.com Featured Image from Unsplash.com, Chart from TradingView.com"
  }
]