[
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T04:42:17.000Z",
    "title": " Weekend Bitcoin trading drops due to TradFi institutions and spot ETFs ",
    "url": "https://cointelegraph.com/news/weekend-bitcoin-trading-falls-from-tradfi-and-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTI5NjhiM2ItMDYyOC00OGFkLTgyNWItOTg2ZGYyMTVkZTJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The share of weekend Bitcoin trading volume has been in decline since 2018 but has dropped considerably since the U.S. launch of spot Bitcoin ETFs in early January.</p>\n                    <p><p>Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> trading volume on Saturdays and Sundays has continued to fall this year as institutional participation in Bitcoin increased, leading to poor weekend market liquidity, says crypto research firm Kaiko.</p><p>Between 2018 and 2021, around a quarter of Bitcoin trading volume took place on the weekend, which has since seen a steady decline and so far in 2024 has fallen to 13% , Kaiko <a href=\"https://research.kaiko.com/insights/where-did-weekend-crypto-traders-go\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> on Feb. 26. </p><p>“The decline suggests worsening liquidity conditions during weekends and could be explained by both increased institutional participation and worsening market infrastructure,” it wrote.</p><p><a href=\"https://cointelegraph.com/news/weekend-bitcoin-trading-falls-from-tradfi-and-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T05:00:20.000Z",
    "title": "PEPE Explodes 140% Today – What’s Up With This Frog-Themed Meme Coin?",
    "url": "https://www.newsbtc.com/news/pepe-explodes-140-today-whats-up-with-this-frog-themed-meme-coin/",
    "description": "Pepe Coin, the meme-inspired cryptocurrency, just doesn&#8217;t run out of surprises, skyrocketing by nearly 140% in the weekly timescale. This remarkable comeback has not only caught the attention of cryptocurrency enthusiasts but has also ignited renewed interest in meme coins as a whole. Pepe Coin, once languishing in the shadows, has now emerged as a frontrunner in the meme coin space. Its market capitalization has soared to an impressive $1.1 billion, and analysts predict that it could potentially reach its all-time high market cap of $1.8 billion, necessitating a tenfold price appreciation from its current levels. Pepe Coin: Speculation And Social Media Frenzy Fuel Resurgence The crypto&#8217;s resurgence is not solely a result of market dynamics but is also driven by key factors within the meme coin ecosystem. Speculation and trading activity have played a significant role, fueled by the growing interest in Ethereum-based meme coins. Pepe Coin, with its distinctive frog-themed branding, has captured the imagination of investors and meme enthusiasts alike. Related Reading: Bull Run Returns? Bitcoin Breaks Through $57,000 Barrier Social media platforms, particularly Twitter, have become a breeding ground for discussions surrounding Pepe Coin. The cryptocurrency has trended with over 53,000 posts dedicated to its vibrant community and its potential as a promising investment opportunity. The widespread traction on social media has further boosted Pepe Coin&#8217;s popularity and contributed to its surging value. Total crypto market cap slightly above $2 trillion today. Chart: TradingView.com PEPE Whales, High-Volume Transactions Boost Profits Notable events within the PEPE ecosystem have also contributed to its recent success. Six influential wallets executed trades, resulting in the offloading of nearly 2 trillion PEPE tokens. This high-volume transaction amounted to approximately $4.37 million in sales, generating substantial profits of around $2 million. Such significant market activity underscores the growing momentum surrounding the meme coin during this surge. As Pepe Coin&#8217;s value continues to climb, it finds itself in the midst of a broader bullish sentiment in the cryptocurrency market. Bitcoin has reached an impressive price point of $57,000, while Ethereum trades above $3,200. This positive market sentiment provides a favorable backdrop for Pepe Coin and other digital assets, signaling a potentially lucrative period for investors. PEPE seven-day price ascent. Source: CoinMarketCap Pepe Coin, a green-colored frog-themed meme coin, was launched in May 2023 and quickly gained popularity among cryptocurrency enthusiasts. With its total supply of 420.69 trillion PEPE tokens, all of which are already in circulation, Pepe Coin stands out as a unique and intriguing player in the meme coin market. Related Reading: Who’s Behind The Latest $41 Million Ethereum Buying Spree? Justin Sun Again? PEPE&#8217;s recent surge of over 140% and its ascent to a market cap of over $1 billion showcases the growing influence of meme coins in the cryptocurrency landscape. Featured image Pexels, chart from TradingView"
  }
]