[
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T04:24:41.000Z",
    "title": " Bitcoin’s huge rally has nuked $6B in shorts this year: S3 Partners ",
    "url": "https://cointelegraph.com/news/bitcoin-rally-burn-six-billion-short-sellers-s3-partners",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzMzMTg0MTQtMjhkMC00ODZkLWJlNGYtMTBlMTc3NTExM2Q5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Short sellers have lost more than $6 billion trying to bet against crypto stocks in 2023.</p>\n                    <p><p>Crypto industry short sellers have lost at least $6 billion trying to bet against publicly-traded crypto firms this year, due largely to Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) outsized rally since Jan. 1.</p><p>According to a Dec. 5 <a href=\"https://www.s3partners.com/articles/crypto-stock-short-recap\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from research firm S3 partners, traders who bet against publicly traded crypto firms such as Coinbase, MicroStrategy, and Marathon Digital are now nursing $6.05 billion in on-paper losses. </p><p>The bulk of the losses for short sellers have been concentrated in the last three months. After Bitcoin fell to a quarterly low of $25,133 on Sept. 11, short sellers increased their exposure to what they thought was an overbought sector. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-rally-burn-six-billion-short-sellers-s3-partners\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-07T04:30:26.000Z",
    "title": "US Lawmaker Blasts SEC for Deliberately Obfuscating Crypto Regulations — Questions Chair Gensler’s Personal Agenda",
    "url": "https://news.bitcoin.com/us-lawmaker-blasts-sec-for-deliberately-obfuscating-crypto-regulations-questions-chair-genslers-personal-agenda/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Lawmaker Blasts SEC for Deliberately Obfuscating Crypto Regulations — Questions Chair Gensler&#039;s Personal Agenda\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sec-gensler-agenda.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A U.S. lawmaker has slammed the Securities and Exchange Commission (SEC) for having a deliberate policy preference to provide less clarity to the crypto market. “The SEC is not adhering to the law. That&#8217;s why it keeps losing in court,&#8221; said Congressman Tom Emmer as he questioned SEC Chair Gary Gensler&#8217;s personal agenda. &#8216;SEC Has [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T04:12:12.000Z",
    "title": "LEGO Fortnite Just Got a New Cinematic Trailer",
    "url": "https://www.cryptopolitan.com/lego-fortnite-gets-a-new-cinematic-trailer/",
    "description": "The first ever Lego Fortnite cinematic trailer is here. This collaboration marks a significant milestone in the digital gaming world, blending the creative spirit of LEGO with the dynamic universe of Fortnite. A Glimpse into the LEGO Fortnite World The newly released trailer offers fans a vivid preview of what to expect in LEGO Fortnite. ... <a title=\"LEGO Fortnite Just Got a New Cinematic Trailer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lego-fortnite-gets-a-new-cinematic-trailer/\" aria-label=\"More on LEGO Fortnite Just Got a New Cinematic Trailer\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T04:30:54.000Z",
    "title": "Banking Giant CEO Trashes Crypto – Again – And Warns Of Ban: Here’s Why",
    "url": "https://www.newsbtc.com/news/banking-giant-ceo-trashes-crypto-again-and-warns-of-ban-heres-why/",
    "description": "In a fiery declaration that reverberated through the financial landscape, JPMorgan Chase&#8217;s formidable CEO, Jamie Dimon, once again launched a verbal assault on crypto. Dimon, well-known for speaking his mind, straightforwardly called for a complete ban on digital currencies, linking them to criminal activities without holding back. The CEO didn&#8217;t mince words at a Senate hearing alongside seven other big bank bosses: &#8220;If I was the government, I&#8217;d close it down.&#8221; In response to a question from Senator Elizabeth Warren, he stated that he was adamantly against all forms of crypto, including bitcoin. Dimon expressed worries that terrorists, drug dealers, and rogue states would use them as a means of finance and declared he would shut it down if he were in charge. Even though Dimon&#8217;s bank is deeply engaged in blockchain—the technology that powers the $1.6 trillion cryptocurrency industry—his comments are the most recent assault against the industry. Related Reading: XRP Greed Index Soars, Backed By Robust $1.3 Billion Volume – Good For Price? Dimon Bashes Crypto In earlier remarks, Dimon referred to bitcoin as &#8220;a hyped-up scam,&#8221; a term he subsequently withdrew. In addition, he had compared it to a &#8220;pet rock.&#8221; In spite of his subsequent admissions of remorse, he continued to use the term &#8220;decentralized Ponzi scheme&#8221; to describe bitcoin and other digital currencies following his previous tirades. Dimon and other banking leaders, including Brian Moynihan of Bank of America Corp., have asserted that their institutions have measures to stop terrorists and other criminals from utilizing them. In contrast, Warren advocated for the extension of anti-money-laundering regulations that banks presently enforce to digital assets, specifically the cryptocurrency market. Every single CEO expressed agreement. As of today, the market cap of cryptocurrencies stood at $1.55 trillion. Chart: TradingView.com According to sources, JPMorgan completed its first blockchain-based collateral resolution as recently as October in a deal with BlackRock and Barclays. With its JPM Coin, a proprietary stablecoin that enables users to execute blockchain-based payments, JPMorgan was a pioneer in this space. JPMorgan said in the next two years, the token may handle up to $10 billion in daily transactions, up from its current level of about $1 billion. The price of bitcoin, the biggest cryptocurrency in the world in terms of market valuation, has increased by more than 150% this year to about $44,000-plus, according to market tracker CoinMarketCap, despite calls for a government clampdown. Related Reading: Bitcoin Bulldozes Past $44,000 – Is $45K Next This Week? Cryptocurrency Critique Unites Senator With Bankers Warren took advantage of the session to criticize the cryptocurrency sector by collaborating with Republicans and prominent bankers. Naturally, Dimon does not have the power of a government and cannot independently initiate the ban of cryptocurrencies. Being the leader of a private financial company, he may only make suggestions and voice opinions; he cannot implement significant policy changes. Nevertheless, it demonstrated an unusual convergence of interests between the crypto industry and the senator from Massachusetts, a long-time enemy of banks, who claimed that cryptocurrency was supporting illegal transactions. The price of bitcoin, the biggest and most popular cryptocurrency in the world, has increased by more than 150% this year and crossed the $44,000 barrier on Wednesday, according to the most recent market data, despite calls for a government shut down. Featured image from Ting Shen/Bloomberg via Getty Images"
  }
]