[
  {
    "source": "CoinDesk",
    "date": "2023-11-17T10:20:34.000Z",
    "title": "Recent Altcoin Rally Powered by South Korean Traders, CryptoQuant Says",
    "url": "https://www.coindesk.com/markets/2023/11/17/recent-altcoin-rally-powered-by-south-korean-traders-cryptoquant-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Notable booms include Loom Network’s LOOM, whose price surged approximately ten times over two months, and HIFI, whose prices spiked by 6,600% in September alone."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T10:11:41.000Z",
    "title": "Ripple lawyer urges fact-check of Gary Gensler’s speech, says SEC actions seen as 'shady'",
    "url": "http://cointelegraph.com/news/ripple-gary-gensler-speech-sec-community",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/f584bdaa-a5c1-4c11-818d-2bab1823f0ca.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SEC chair Gary Gensler shared a speech on X (formerly Twitter), triggering heated reactions across the crypto community. </p>\n                    <p><p>As Gary Gensler reiterates the United States Securities and Exchange Commission’s (SEC) mandate through a speech, Ripple’s lawyer and various crypto community members responded, criticizing the SEC chair and arguing that the commissioner’s words contradict his actions. </p><p>On Nov. 16, SEC chairperson Gary Gensler shared a video of him conducting a speech at the 2023 Securities Enforcement Forum. In the speech, the incumbent SEC chair highlighted the words of the first SEC chairperson, Joseph P. Kennedy, saying that the government agency should be “partners of honest business and prosecutors of dishonesty.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As Joseph P. Kennedy, the first <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a> Chair, once said: &quot;We are not prosecutors of honest business, nor defenders of crookedness. We are partners of honest business &amp; prosecutors of dishonesty. We shall not prejudge, but we shall investigate.” <br><br>Check out my recent remarks: <a href=\"https://t.co/QM2zqj8PQs\">pic.twitter.com/QM2zqj8PQs</a></p>&mdash; Gary Gensler (@GaryGensler) <a href=\"https://twitter.com/GaryGensler/status/1725222935529480586?ref_src=twsrc%5Etfw\">November 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The post on X (formerly Twitter) triggered responses from various crypto community members, including Ripple’s chief legal officer, Stuart Alderoty, who is currently engaged in a legal battle against the SEC. According to Alderoty, the SEC chair’s recent remarks should be fact-checked, and <a href=\"https://twitter.com/s_alderoty\" target=\"_blank\" rel=\"noopener nofollow\">Gensler</a> has \"prejudged crypto and has filed suit against others without investigation.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC is losing in court; being criticized by Judges for shady behavior; being rebuked by the Gov’t’s internal auditor; hiding info about meetings with a felon; becoming irrelevant on the international stage. Gensler - admitting no fault - has become the insulate Col. Jessep. <a href=\"https://t.co/vqjPPcifr8\">pic.twitter.com/vqjPPcifr8</a></p>&mdash; Stuart Alderoty (@s_alderoty) <a href=\"https://twitter.com/s_alderoty/status/1725000170029699350?ref_src=twsrc%5Etfw\">November 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Alderoty also highlighted that Ripple was sued but was “never charged with dishonesty.” The Ripple executive also threw some accusations towards the SEC and said that they are being criticized for \"shady behavior\" and are becoming \"irrelevant\" internationally. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-links-crypto-with-cash-in-viral-2018-video-crypto-twitter-reacts\"><strong><em>Gary Gensler links crypto with cash in viral 2018 video — Crypto Twitter reacts</em></strong></a></p><p>Apart from Alderoty, various crypto community members also responded to the video that Gensler shared. Erik Voorhees, the founder and CEO of trading platform ShapeShift, responded to the tweet, saying that Gensler has <a href=\"https://twitter.com/ErikVoorhees/status/1725315286021111912\" target=\"_blank\" rel=\"noopener nofollow\">prosecuted</a> his “honest business” twice. </p><p>Meanwhile, a community member also responded to Gensler's remarks, saying that what he quoted \"was the vision.\" However, the Twitter user argued that it <a href=\"https://twitter.com/userofintellect/status/1725268067905933353\" target=\"_blank\" rel=\"noopener nofollow\">evolved</a> for the worse, accusing the SEC of facilitating the “legitimization of a corrupt system.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sam-bankman-fried-convicted-paypal-faces-sec-subpoena-and-other-news-hodlers-digest-oct-19-nov-4/\"><strong><em>Sam Bankman-Fried convicted, PayPal faces SEC subpoena, and other news: Hodler’s Digest</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-17T10:30:41.000Z",
    "title": "Bitcoin miners revenue increasingly fueled by transaction fees amid token inscription surge",
    "url": "https://cryptoslate.com/insights/bitcoin-miners-revenue-increasingly-fueled-by-transaction-fees-amid-token-inscription-surge/",
    "description": "<p>Quick Take Bitcoin&#8217;s financial ecosystem is witnessing a transformative phase, particularly for miners whose revenue streams are evolving. Traditionally reliant on block rewards, miners now see a substantial portion of their income—over 25%—coming from transaction fees. This shift is intricately linked to the burgeoning use of Inscriptions and BRC-20 tokens within the network, which are [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-miners-revenue-increasingly-fueled-by-transaction-fees-amid-token-inscription-surge/\">Bitcoin miners revenue increasingly fueled by transaction fees amid token inscription surge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-17T10:21:53.000Z",
    "title": "Ethereum (ETH) move back above $2,000 needed to unleash the altcoins",
    "url": "https://cryptodaily.co.uk/2023/11/ethereum-eth-move-back-above-2000-needed-to-unleash-the-altcoins",
    "description": "The $ETH price has somewhat been in the doldrums when compared to $BTC. For altcoins to run, $ETH must make its move, and soon."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T10:37:45.000Z",
    "title": "Binance Futures Expands Offerings with BEAMX Perpetual Contract",
    "url": "https://www.cryptopolitan.com/binance-futures-offering-beamx-perpetual/",
    "description": "In a significant development for cryptocurrency traders, Binance Futures has announced the introduction of a new trading instrument in its portfolio. Starting November 17, 2023, at 13:30 UTC, traders will have access to the USDⓈ-M BEAMX Perpetual Contract. This move marks a notable expansion in the range of trading options available on the platform, particularly ... <a title=\"Binance Futures Expands Offerings with BEAMX Perpetual Contract\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-futures-offering-beamx-perpetual/\" aria-label=\"More on Binance Futures Expands Offerings with BEAMX Perpetual Contract\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T10:24:37.000Z",
    "title": "Singapore launches live CBDC trial for interbank settlements",
    "url": "https://www.cryptopolitan.com/singapore-launches-live-cbdc-trial/",
    "description": "Singapore is making strides in digital currency with its recent announcement to initiate a live trial of a central bank digital currency (CBDC) for wholesale interbank settlements. This marks a significant evolution from previous trials that employed simulated CBDCs. The Monetary Authority of Singapore (MAS), under the leadership of Managing Director Ravi Menon, has been ... <a title=\"Singapore launches live CBDC trial for interbank settlements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapore-launches-live-cbdc-trial/\" aria-label=\"More on Singapore launches live CBDC trial for interbank settlements\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T10:16:06.000Z",
    "title": "CFTC Commissioners advocate for urgent crypto regulation",
    "url": "https://www.cryptopolitan.com/cftc-commissioners-advocate-for-urgent-crypto-regulation/",
    "description": "In recent statements, CFTC Commissioners Christy Goldsmith Romero and Kristin Johnson emphasized the urgent need for regulations in the cryptocurrency sector. This call to action follows the high-profile collapses of major crypto entities like FTX, Binance, Celsius, and Voyager. Speaking at the Federal Reserve Bank of Atlanta, Johnson highlighted the necessity of segregating and preserving ... <a title=\"CFTC Commissioners advocate for urgent crypto regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cftc-commissioners-advocate-for-urgent-crypto-regulation/\" aria-label=\"More on CFTC Commissioners advocate for urgent crypto regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T10:15:44.000Z",
    "title": "OpTic’s Halo Team Makes Huge Change to Roster Following Worlds Loss",
    "url": "https://www.cryptopolitan.com/optics-halo-team-makes-huge-change/",
    "description": "In a surprising move, OpTic Gaming has announced a significant change to its Halo roster following a disappointing 2023 season. Brad &#8216;aPG&#8217; Laws, a longtime member of the team and a renowned Halo player, has been released from the squad. This decision marks the end of an era for OpTic Gaming, and fans are left ... <a title=\"OpTic&#8217;s Halo Team Makes Huge Change to Roster Following Worlds Loss\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optics-halo-team-makes-huge-change/\" aria-label=\"More on OpTic&#8217;s Halo Team Makes Huge Change to Roster Following Worlds Loss\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T10:13:11.000Z",
    "title": "Rise of AI Hosts: Transforming Livestreaming and Beyond",
    "url": "https://www.cryptopolitan.com/rise-of-ai-hosts-transforming-livestreaming-and-beyond/",
    "description": "In Hangzhou&#8217;s bustling Binjiang district, a new cadre of digital anchors is taking center stage. These virtual hosts, operating 24/7, have harnessed the power of artificial intelligence (AI) to create interactive experiences that closely mimic human interactions. While human hosts still hold an edge, these virtual counterparts are making waves in China&#8217;s e-commerce livestreaming sector. ... <a title=\"Rise of AI Hosts: Transforming Livestreaming and Beyond\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rise-of-ai-hosts-transforming-livestreaming-and-beyond/\" aria-label=\"More on Rise of AI Hosts: Transforming Livestreaming and Beyond\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T10:20:25.000Z",
    "title": "Over 100 Million MATIC Incinerated In POLS Mint, But The Gold Rush Is Far From Over",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-pols-mint-gold-rush/",
    "description": "The POLS mint was arguably the most anticipated event on the Polygon (MATIC) blockchain this year and the stats have corroborated this. On Thursday, the Bitcoin BRC-20-inspired mint took place and the burn figures have been nothing short of impressive. Over 100 million MATIC tokens were incinerated as a result of this event. But data suggests that this rush is far from over. POLS Mint Triggers Massive MATIC Burns The POLS token mint saw a massive turnout from the Polygon community as thousands of investors clamored to mint their tokens. As a result, the fees on the network skyrocketed and the ensuing token burn crossed 100 million MATIC. Related Reading: Dogecoin Is Literally Going To The Moon: 100% DOGE Price Blast Expected According to reports, the fees on the Polygon network skyrocketed by over 13,000% sending fees as high as 4,005 gwei at the peak. Polygon founder Sandeep Nailwal acknowledged this increase in network activity, posting a chart that showed that the network had processed over 6 million transactions in a 24-hour period, amounting to a 170 transactions per second (TPS) rate. What is going on on @0xPolygon POS chain? 6m transactions in last 24 hrs. 170 TPS on average. 1mn+ MATIC burnt by the protocol. The chain worked smoothly, gas fees went crazy though but no reorgs or 0 blocks etc. I hear there is some game Baby Shark Launching, could that be the… — Sandeep Nailwal &#124; sandeep. polygon 💜 (@sandeepnailwal) November 16, 2023 EVM data shows that the POLS mint saw over 100 million MATIC burned which translated to over $80 million in fees alone. The NFT collection is rising in popularity and by Friday, a total of 10.32% of the collection has been minted. Why Polygon Is Just Starting One of the major drivers of the POLS popularity is its similarity to the BRC-20 standard that allowed for minting NFTs on the Bitcoin network which has been incredibly successful so far. Given the success of the BRC-20 tokens, this bullishness has translated to the PRC-20 tokens. With only 18,480 owners of the POLS tokens and over 400,000 daily users on the Polygon network, there is still a lot of room for the new Polygon standard to catch on. When this happens, the expectation is that more investors will get into the tokens. Related Reading: Ripple Introduces AMMs To XRPL, But Is This Good Or Bad For XRP Price Polygon users are also actively awaiting the rebranding of the MATIC tokens into the new POL token. This rebranding is expected to give the token a sort of ‘fresh start’ that could propel the price upward. Users will have to convert their MATIC tokens to POL. However, the team has said that holders will have up to four years to do this. The MATIC price initially benefitted from this surge in user activity by rising above the $0.94 level on Thursday. However, the altcoin has managed to lose some of those gains after falling 6.61% on Friday, according to data from Coinmarketcap. It is currently trading at $0.8626, albeit with a 2.67% gain on the weekly chart. Price retraces after pump &#124; Source: MATICUSD on Tradingview.com Featured image from Navi, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-17T10:19:44.000Z",
    "title": "XRP To Three Figures? Difficult to Imagine, Says One Advocate",
    "url": "https://coinedition.com/xrp-to-three-figures-difficult-to-imagine-says-one-advocate/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Digital asset enthusiast Bill Morgan took to X today to share his ambivalence about sky-high price predictions for XRP. Reacting to a prediction that the token will reach three-figures, Morgan acknowledged the three major outcomes of the ruling in Ripple’s lawsuit with the U.S. Securities and Exchange Commission (SEC). He argued that since 23 July [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-to-three-figures-difficult-to-imagine-says-one-advocate/\">XRP To Three Figures? Difficult to Imagine, Says One Advocate</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-17T10:15:07.000Z",
    "title": "Analyst Says AI Altcoin Has 130% Surge ‘Written All Over It’ Once Major Resistance Level Is Overcome",
    "url": "https://dailyhodl.com/2023/11/17/analyst-says-ai-altcoin-has-130-surge-written-all-over-it-once-major-resistance-level-is-overcome/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed analyst and trader is expressing bullish sentiment on a multi-million dollar altcoin as the total crypto market cap edges toward $1.5 trillion. The analyst pseudonymously known as The Flow Horse tells his 185,800 followers on the X social media platform that blockchain-based artificial intelligence (AI) and machine learning platform Fetch.ai (FET) could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/17/analyst-says-ai-altcoin-has-130-surge-written-all-over-it-once-major-resistance-level-is-overcome/\">Analyst Says AI Altcoin Has 130% Surge ‘Written All Over It’ Once Major Resistance Level Is Overcome</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]