[
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T08:33:13.000Z",
    "title": "Pro-Ripple lawyer predicts prolonged legal battle, hints at settlement factors",
    "url": "http://cointelegraph.com/news/pro-ripple-lawyer-predicts-prolonged-legal-battle",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f3ff9dff-9138-4c3d-b1c2-ddd17de2ed84.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>John Deaton says there has not been \"a single serious conversation\" about a potential settlement between Ripple, Brad Garlinghouse, Chris Larsen and the SEC.</p>\n                    <p><p>Pro-Ripple lawyer John Deaton has said he expects a lengthy legal process for the<a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\"> Securities Exchange Commission (SEC) v Ripple case</a>, possibly lasting a year. Deaton suggests that a settlement may only be considered if <a href=\"https://cointelegraph.com/news/coinbase-sec-seeks-dismissal-of-sec-suit-claims-extraordinary-abuse-of-process\">Coinbase's motion to dismiss</a> (MTD) the SEC's case against it is successful. </p><p>In a detailed <a href=\"https://twitter.com/JohnEDeaton1/status/1717326730438807971\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on X (formerly known as Twitter), Deaton discussed the lack of serious settlement talks between Ripple, its executives and the SEC. He mentioned the SEC's desire for a $770 million penalty and explained the complexities of the penalty phase involving various legal processes. </p><p>In his words,</p><blockquote>“I do not believe there has been a single serious conversation regarding a settlement between Ripple, Brad Garlinghouse, Chris Larsen and the SEC. The SEC is pissed and embarrassed and wants $770M worth of flesh,”.</blockquote><p>He explained that the penalty phase is a detailed process, akin to a second legal case, involving depositions, document requests, emails, financial records, contracts and on-demand liquidity (ODL) transactions. Deaton suggests that Ripple might aim to reduce the $770 million penalty by excluding ODL transactions and cutting down on additional expenses. He points to the LBRY case where the SEC initially pursued $23 million, but after eight months of litigation, it led to a $130,000 fine.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As I said on <a href=\"https://twitter.com/CryptoLawUS?ref_src=twsrc%5Etfw\">@CryptoLawUS</a> TV yesterday with <a href=\"https://twitter.com/attorneyjeremy1?ref_src=twsrc%5Etfw\">@attorneyjeremy1</a> and Thien-Vu, I do not believe there has been a single serious conversation regarding settlement between <a href=\"https://twitter.com/Ripple?ref_src=twsrc%5Etfw\">@Ripple</a> <a href=\"https://twitter.com/bgarlinghouse?ref_src=twsrc%5Etfw\">@bgarlinghouse</a> <a href=\"https://twitter.com/chrislarsensf?ref_src=twsrc%5Etfw\">@chrislarsensf</a> and the <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a>. <br><br>The SEC is pissed and embarrassed and wants $770M worth… <a href=\"https://t.co/kcXvsrPgaa\">https://t.co/kcXvsrPgaa</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1717326730438807971?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Creating a timeframe, he commented,</p><blockquote> \"I don’t expect a final judgment, issued by Judge Torres, until late summer, at the earliest. It literally could take a full year before an appeal is filed in this case.\"</blockquote><p>Deaton connected Ripple's case outcome with another significant lawsuit, stating that if Coinbase succeeds in its motion to dismiss, the SEC may shift its stance on cryptocurrencies and consider a settlement with Ripple. However, if Coinbase's MTD fails, he foresees no settlement.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-disputes-sec-authority-last-suit-dismissal-bid\"><strong><em>Coinbase disputes SEC’s crypto authority in final bid to toss regulator’s suit</em></strong></a></p><p>The oral argument for Coinbase's motion is scheduled for Jan. 17, 2024, with a decision likely to follow within 60-120 days. Ripple is expected to face considerable legal costs during this period as it strives to reduce the $770 million penalty. It's possible that the Coinbase case could become a factor in the SEC's efforts to postpone the final ruling on Ripple, aligning with Deaton's late summer timeline.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T08:16:18.000Z",
    "title": "Mastercard partners with crypto payment firm MoonPay for Web3 services",
    "url": "http://cointelegraph.com/news/mastercard-crypto-moonpay-web3",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/c6fa6126-78fb-49fa-9111-ad49e5a5f757.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>MoonPay has announced a partnership with Mastercard, targeting Web3-based experiential marketing or new ways to connect with Mastercard’s consumers.</p>\n                    <p><p>Global payment giant Mastercard continues exploring cryptocurrency benefits through a new collaboration with crypto payment platform MoonPay.</p><p>MoonPay officially <a href=\"https://www.moonpay.com/newsroom/mastercard\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Oct. 25 a partnership with Mastercard aiming to jointly explore how Web3 tools can improve experiential marketing or find new ways to connect with Mastercard’s consumers.</p><p>The firm also took to X (formerly Twitter) to report that MoonPay’s enterprise president, Keith Grossman, and Mastercard’s chief marketing and communications officer, Raja Rajamannar, announced the collaboration at Money20/20 in Las Vegas.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7ff70dc4-a107-4ca7-8e7d-0ecf18d07f85.png\"  /><figcaption style=\"text-align: center;\"><em>MoonPay’s partnership announcement with Mastercard. Source: X (formerly Twitter)</em></figcaption></figure><p>“Mastercard will take advantage of MoonPay’s entire Web3 portfolio, including auth to minting to ETHPass and more as well as work closely with our agency, Otherlife, for strategy, creative and front-end dev work for their experiential initiatives,” Grossman <a href=\"https://www.linkedin.com/posts/keith-a-grossman-80838a1_money2020-activity-7123083459492810752-VCRG?utm_source=share&amp;utm_medium=member_desktop\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in a post on LinkedIn.</p><p>Apart from new Web3 consumer experiences, MoonPay will also work to integrate Mastercard products and solutions to increase compliance and trust across the Web3 industry. MoonPay will specifically be incorporating Mastercard’s tools like “Click to Pay,” Mastercard Send and Mastercard Crypto Credentials into its payment solutions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/mastercard-announces-successful-wrapped-cbdc-blockchain-trial-results\"><strong><em>Mastercard announces successful wrapped CBDC trial results</em></strong></a></p><p>“We’re so grateful for the partnership and even more excited about what’s ahead. Congrats to the full team,” Mastercard’s Web3 marketing Adam Polansky commented on Grossman’s post.</p><p>“We are excited about this partnership and what’s to come,” Mastercard’s partnership executive Elizabeth Taylor also wrote.</p><p>Mastercard had not yet officially announced the news at the time of writing. The firm did not immediately respond to Cointelegraph’s request for comment.</p><p>Mastercard has been actively exploring the blockchain and crypto industry, adding multiple industry products to its platform in recent years. In 2022, Mastercard launched a new program to <a href=\"https://cointelegraph.com/news/mastercard-taps-paxos-to-launch-crypto-trading-for-banks\">allow banks to offer crypto trading capabilities</a> to their customers in collaboration with Paxos. Mastercard also <a href=\"https://www.mastercard.com/news/perspectives/2022/simple-nft-purchasing-on-nft-marketplaces/\" target=\"_blank\" rel=\"noopener nofollow\">collaborated</a> with Coinbase and MoonPay to bring its payments to Web3 and nonfungible tokens.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\"><strong><em>Web3 Gamer: Minecraft bans Bitcoin P2E, iPhone 15 &amp; crypto gaming, Formula E</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T08:12:46.000Z",
    "title": "Bitcoin dominance hits 54% — Highest in 2.5 years as BTC halving approaches ",
    "url": "http://cointelegraph.com/news/bitcoin-dominance-hits-54-ahead-btc-halving",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/934a0f23-d414-45d8-bff4-3463df934d82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC market dominance hovered around 80% during the 2017 bull market but slumped to the 50%–60% range during the 2021 bull market, at times even dipping below 50%.</p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) market dominance has reached 54%, its highest in the last 30 months, indicating the top cryptocurrency is strengthening just before the halving event scheduled for April 2024.</p><p>The Bitcoin halving is an event in which the mining reward per block is halved, thus cutting the supply of the asset amid growing demand and leading to bullish price momentum. The Bitcoin halving occurs every four years, and the next halving in 2024 will reduce the BTC mining reward from the current 6.25 BTC to 3.125 BTC. As the total supply of Bitcoin is fixed at 21 million, the halving of BTC mining rewards creates a supply-demand gap that lowers the influx of new BTC into the market.</p><p>Bitcoin market dominance is a measure of the crypto asset’s market capitalization relative to the overall digital asset market and highlights the asset’s strength. The market dominance of over 50% is considered highly bullish and marks its highest point since the last bull run in April.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2dbb4b01-1f8b-41d6-8da3-455a62bacf5e.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin market dominance chart. Source: TradingView</em></figcaption></figure><p>Bitcoin’s market dominance began reviving at the start of October, when it rose from below 49% to reach this new two-and-a-half-year high. October has been historically considered a bullish crypto month, leading to the nickname “Uptober.” This was evident from <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">Bitcoin’s double-digit percentage surge</a> over the past few weeks, helping BTC rise from just below $27,000 at the start of October to post a new yearly high of $35,000.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Uptober has been great, but the party may not be over just yet. <br><br>November is historically <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>&#39;s best performing month. <a href=\"https://t.co/kaMMt7pgZz\">pic.twitter.com/kaMMt7pgZz</a></p>&mdash; Miles Deutscher (@milesdeutscher) <a href=\"https://twitter.com/milesdeutscher/status/1717232680956465570?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In 2017, Bitcoin maintained a market dominance of over 80%, followed by Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) with nearly 10%–17% in market dominance. Over the years, Bitcoin has seen a steep decline in its market dominance owing to the rise in the number of cryptocurrencies and the growth of several new tokens during the last bull run in 2021.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/why-is-bitcoin-price-up-today&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T08:30:26.000Z",
    "title": "XRP Shines Bright: 14% Weekly Gains And New Highs After August Dip",
    "url": "https://www.newsbtc.com/news/xrp-shines-bright-14-weekly-gains/",
    "description": "XRP has demonstrated its resilience in the volatile world of digital assets. This week, XRP investors and enthusiasts have ample reasons to celebrate as the coin saw an impressive surge of 14.2% in its price over the past seven days, bringing it to a notable high after its last dip in August.  This remarkable surge highlights the cryptocurrency&#8217;s ability to experience significant price movements within a relatively short timeframe. The upward trajectory of XRP&#8217;s price over the past week suggests an increase in investor interest or positive market sentiment, which has driven its value to levels higher than what was observed just seven days ago. At the time of writing, XRP is trading at $0.559841, with a modest 0.2% loss over the past 24 hours. One of the most significant indicators of XRP&#8217;s current performance is the overwhelming interest from buyers rather than sellers. The Volume Delta metric cited in a price analysis in highlights this trend vividly. Volume Delta essentially measures the difference between buying and selling pressure in the market, serving as a valuable gauge for traders seeking to make informed decisions. In the case of XRP, this metric is painting a positive picture as buying sentiment dominates, giving traders the confidence to enter long positions. This surge in buying interest suggests that investors have renewed faith in the coin&#8217;s potential, as the coin has rebounded from the lows witnessed in the past. With growing adoption and an increasing number of use cases for XRP, it&#8217;s no surprise that the cryptocurrency is attracting a substantial inflow of funds. Related Reading: Bitcoin Price Sprint To $40,000 – Is It Happening Now? Large XRP Transfer To Bitstamp Sparks Intrigue Meanwhile, in the world of cryptocurrency transactions, a noteworthy event has piqued the interest of the XRP community. In the last 24 hours, an anonymous wallet executed a substantial transfer of 26,800,000 XRP to the major EU-based exchange, Bitstamp. This sizeable movement of XRP tokens has raised questions and fueled speculation within the crypto community. Data provided by the XRP explorer, Bithomp, has shed some light on the sender&#8217;s identity, revealing a connection to Ripple Labs, a blockchain decacorn known for its involvement in the development and promotion of the token&#8217;s ecosystem. This significant transfer underscores the confidence in its future, as well as the growing influence of Ripple Labs within the cryptocurrency space. Related Reading: Solana Epic Bounceback To Pre-FTX Heights: Brace Yourself For What’s Next XRP market cap currently at $29.798 billion. Chart: TradingView.com XRP&#8217;s Resurgence Indicates Positive Market Sentiment The crypto&#8217;s recent performance showcases its ability to rebound from challenging times and regain investor confidence. With a notable surge in price over the past week, XRP has demonstrated its potential to shine in the competitive world of cryptocurrencies. The dominance of buying sentiment, as indicated by the Volume Delta metric, hints at a positive market outlook for XRP. Furthermore, the substantial transfer to Bitstamp, likely orchestrated by Ripple Labs, adds an intriguing layer to the narrative, emphasizing the ongoing commitment of key players to the success of XRP and the broader blockchain ecosystem. As XRP continues to carve its path in the digital asset landscape, investors and enthusiasts eagerly await further developments, making this cryptocurrency a compelling one to watch in the coming weeks and months. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from  FX Empire"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-26T08:23:39.000Z",
    "title": "JPMorgan’s Coin Handles $1B Worth of Daily Transactions",
    "url": "https://coinedition.com/jpmorgans-coin-handles-1b-worth-of-daily-transactions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JPMorgan Takes the Lead in Live Blockchain Collateral Settlement\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/JPMorgan-Takes-the-Lead-in-Live-Blockchain-Collateral-Settlement-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to a recent Bloomberg report, the financial services company JPMorgan Chase &#38; Co.’s digital token, JPM Coin, has seen $1 billion worth of transactions on a daily basis. The financial institution asserted that the team is further probing into the coin’s wider exploration, planning to create a “retail version” of the JPM coin. As [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/jpmorgans-coin-handles-1b-worth-of-daily-transactions/\">JPMorgan’s Coin Handles $1B Worth of Daily Transactions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]