[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T01:47:03.000Z",
    "title": "First Mover Asia: Bitcoin Awaits Its Spot ETF in Absence of a Macro Catalyst: Crypto CEO",
    "url": "https://www.coindesk.com/markets/2023/07/26/first-mover-asia-bitcoin-awaits-its-spot-etf-in-absence-of-a-macro-catalyst-crypto-custodian-ceo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "PLUS: At least one bitcoin price indicator suggests that BTC may be turning slightly upward soon, writes a CoinDesk analyst, while Tribe Capital's managing partner sees a DeFi \"resurgence.\""
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T01:51:59.000Z",
    "title": "The Rich Are Splurging on Biohacking Clubs to Cheat Death",
    "url": "https://decrypt.co/150047/biohacking-trend-longevity-life-extension-gyms-clubs",
    "description": "The ultra rich want to live forever and are shelling out big bucks to do so. But biohacking is starting to seep into the mainstream."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T01:48:37.000Z",
    "title": "Deloitte, Chainalysis alliance to give law enforcement a crypto edge",
    "url": "https://cointelegraph.com/news/deloitte-chainalysis-partnership-boost-compliance-law-enforcement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/57e01642-ea80-40dc-a25b-d06d44576384.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Big Four accounting firm Deloitte said the partnership could help authorities identify and take down bad actors hiding \"behind the keyboard.\"</p>\n                    <p><p>Professional services giant Deloitte is set to boost its clients’ blockchain-tracking capabilities following a strategic alliance with crypto analytics firm Chainalysis.</p><p>Announced during a Chainalysis conference in Washington DC on July 25, the tie-up will <a href=\"https://blog.chainalysis.com/reports/deloitte-and-chainalysis-alliance/\" target=\"_blank\" rel=\"noopener nofollow\">see</a> Chainalysis’ blockchain datasets, analytics software and training programs assist Deloitte’s clients with their crypto forensic, investigative and compliance needs.</p><p>A Chainalysis spokesperson told Cointelegraph that the alliance had been in the works for years, with the aim of helping more organizations to adopt blockchain technology.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our alliance with <a href=\"https://twitter.com/Deloitte?ref_src=twsrc%5Etfw\">@Deloitte</a>, announced today at <a href=\"https://twitter.com/hashtag/TraceDC?src=hash&amp;ref_src=twsrc%5Etfw\">#TraceDC</a>, will provide public and private organizations with bespoke solutions and specialized services related to risk, compliance, and investigations. Read more:<a href=\"https://t.co/NqbPPA6HYb\">https://t.co/NqbPPA6HYb</a> <a href=\"https://t.co/I48lKhhInb\">pic.twitter.com/I48lKhhInb</a></p>&mdash; Chainalysis (@chainalysis) <a href=\"https://twitter.com/chainalysis/status/1683908668486451218?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Thomas Stanley, president and chief revenue officer of Chainalysis said the collaboration is aimed at their mutual clients, including law enforcement agencies, regulators and financial institutions. </p><p>\"We’re starting with a focus on regulators, law enforcement, and financial institutions given where they are at in their adoption of this technology and the unique overlap of our customer base,\" the spokesperson added, noting that it will be introduced United States first. </p><blockquote>\"We're initially rolling this out in the United States, but it is something that other markets can readily adopt. It’s our belief that other global markets will follow suit.\"</blockquote><p>In a document <a href=\"https://www2.deloitte.com/content/dam/Deloitte/us/Documents/Advisory/us-rfa-chainalysis-overview-gps.pdf\" target=\"_blank\" rel=\"noopener nofollow\">outlining</a> the alliance, Deloitte said some of the challenges faced by government agencies include when cryptocurrencies are <a href=\"https://cointelegraph.com/news/chainalysis-breaks-down-how-scammers-adapt-during-the-bear-market\">used to obfuscate transactions</a> and launder the proceeds of crime, while the international regulatory landscape creates difficulty obtaining information from foreign exchanges.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/944918a7-cfd2-40d4-9671-80975a0df40b.PNG\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Some of the challenges government agencies face when it comes to crypto. Source: Deloitte</figcaption></figure><p>Deloitte said the partnership with Chainalysis could help “identify the actors behind the keyboard and effectively prosecute them,” including tracing the flow of funds to high-risk or sanctioned entities. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-the-irs-seized-10b-worth-of-crypto-using-blockchain-analytics\"><strong><em>How the IRS seized $10B worth of crypto using blockchain analytics</em></strong></a></p><p>“Chainalysis will work with Deloitte’s blockchain and digital assets practice across cryptocurrency and digital asset risk, analytics, investigation, anti-money laundering/know your customer (AML/KYC), and regulatory compliance,” added Chainalysis.</p><p>Deloitte, known as one of the world’s Big Four accounting firms, recently posted over 300 job listings for cryptocurrency-related roles, 97 of which were based in the United States. </p><p>In late February, <a href=\"https://cointelegraph.com/news/deloitte-dives-into-immersive-experiences-as-more-industries-turn-to-web3\">Deloitte announced a partnership</a> with Web3 platform Vatom to provide immersive experiences to different industries, from using virtual reality for events, meetings and employee training to brands focused on building community engagement with metaverse experiences. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0 — The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-26T02:00:00.000Z",
    "title": "Bitcoin Investment Products See Outflows as $ETH and $XRP Funds Attract Capital",
    "url": "https://www.cryptoglobe.com/latest/2023/07/bitcoin-investment-products-see-outflows-as-eth-and-xrp-funds-attract-capital/",
    "description": "In a surprising shift, Bitcoin (BTC) investment products saw $13 million of outflows over the past week, while investment products offering investors exposure to Ethereum ($ETH) and $XRP have both seen significant inflows. According to CoinShares’ Digital Asset Fund Flows report,  cryptocurrency investment products saw a net outflow of $6.5 million in a week, an […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-26T02:00:23.000Z",
    "title": "BRICS Invites 69 Leaders to August Summit — Western Countries Omitted",
    "url": "https://news.bitcoin.com/brics-invites-69-leaders-to-august-summit-western-countries-omitted/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRICS Invites 70 Countries to Summit as Countries Focus on De-Dollarization\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-70-natios.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The BRICS economic bloc has invited 69 leaders to its upcoming summit, including all African heads of state and the political heads of major Global South bodies. More than 40 countries have expressed interest to join the BRICS group, with 22 nations already having submitted official applications. “We&#8217;ve never had such a large outreach,&#8221; said [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T02:00:39.000Z",
    "title": "Binance Pool’s Litecoin Hash Rate Falls 50%: What’s Next?",
    "url": "https://www.newsbtc.com/news/litecoin/binance-pool-litecoin-hash-rate-falls-50/",
    "description": "As of July 25, on-chain data indicates that the hash rate dedicated to the Litecoin network for mining from Binance Pool, a platform focused on improving miners&#8217; income, is down by over 50% in the past seven months. In crypto mining, hash rate is the cumulative computing power funneled to a proof-of-work network like Bitcoin, Litecoin, or Monero.  These public networks rely on miners distributed across the globe for security, decentralization, and transaction confirmation. Binance Pool Hash Rate To Litecoin Drops By 50% Presently, Binance Pool is allocating approximately 28 TH/s of hash rate to the Litecoin network, a decrease from the average of around 69 TH/s recorded in January 2023. Consequently, Binance Pool has lost its standing as one of the dominant Litecoin mining pools as of July 2023.  As of July 25, Binance Pool is ranked 7th in the Litecoin mining pool scene, accounting for approximately 3.6% of the total hash rate share. In comparison, competitors like Poolin, F2Pool, and viaBTC occupy higher positions, indicating that despite Binance Pool being backed by Binance, the world&#8217;s largest crypto exchange, miners are opting for other pools, some of whom were among the first mining pools in the globe. Related Reading: Ducati Partners With Ripple, Prepares To Launch NFT Collection On XRP Ledger At the moment, it cannot be immediately ascertained as to what the cause can be. However, Binance faces legal challenges in multiple countries, especially in the United States. Two of the country&#8217;s top regulators, the Commodity Futures Trading Commission (CFTC) and Securities and Exchange Commission (SEC), have sued the exchange, accusing them of violating securities laws. Based on the hash rate, viaBTC currently controls the lion&#8217;s share in Litecoin mining, carving out 33% of the total Litecoin network hash rate. F2Pool follows with around 17.2% share, while antpool ranks third with a market share of 13%. Litecoin Pool and Poolin also channel more computing power than Binance Pool. Given the increasingly competitive mining landscape, individual miners must pool their resources and dedicate hash rate through a mining pool. Despite the drop in rankings and hash rate over the last seven months, Binance Pool still plays a critical role in proof-of-work mining networks, including Bitcoin. Halving Incoming, Will LTC Rally? Litecoin currently offers miners 12.5 LTC and transaction fees for each block mined. However, this reward will be halved in the upcoming weeks. The halving even will impact block mining revenue. Nonetheless, a price increase could encourage miners to upgrade their equipment and deploy miners with higher hash rates. Related Reading: Fundstrat Predicts Bitcoin Will Reach $180,000 In 2024, But What’s The Catalyst? Presently, Litecoin has a total hash rate of approximately 780 TH/s, with the network releasing 7,200 LTC to miners daily. However, with the expected supply shock, how Litecoin prices react is yet to be seen. If past cycles guide, Litecoin may rally. According to Litecoin daily price charts, LTC has a resistance at around $115 but is trading below $100. At this level, it is down 23% from July 2023 peaks. Feature image from Canva, chart from TradingView"
  }
]