[
  {
    "source": "Decrypt",
    "date": "2023-06-06T20:47:23.000Z",
    "title": "Coinbase Plans to Fight SEC Lawsuit, Carry On With 'Business as Usual'",
    "url": "https://decrypt.co/143612/coinbase-plans-to-fight-sec-lawsuit-carry-on-with-business-as-usual",
    "description": "Coinbase legal chief Paul Grewal was in DC to speak at a hearing on the Digital Asset Market Structure Discussion Draft."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T20:49:22.000Z",
    "title": "SEC files motion for restraining order against Binance",
    "url": "https://cointelegraph.com/news/sec-files-motion-for-restraining-order-against-binance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/26d7b404-b96c-458d-b9e3-ce1060a8367f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC has accused Binance of mishandling funds and operating an unregistered securities exchange.</p>\n                    <p><p>The United States Securities and Exchange Commission <a href=\"https://ecf.dcd.uscourts.gov/cgi-bin/show_temp.pl?file=merged_75929_-1-1686083457.pdf&type=application/pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> an emergency motion in the District of Columbia U.S. District Court for a temporary restraining order against Binance, Binance.US and CEO Changpeng Zhao (CZ) on June 6 requesting eight actions. </p><p>The first requested actions are the freezing of the assets of Binance.US and repatriation of fiat and cryptocurrency held by U.S. customers or for the benefit of U.S. customers. In addition, it prohibits the defendants from destroying, altering or concealing records and other sets conditions on discovery. </p><p>According to the filing:</p><blockquote>“This relief is necessary on an expedited basis to ensure the safety of customer assets and prevent the dissipation of available assets for any judgment, given the Defendants’ years of violative conduct, disregard of the laws of the United States, evasion of regulatory oversight, and open questions about various financial transfers and the custody and control of Customer Assets.” </blockquote><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T20:52:01.000Z",
    "title": "Coinbase, Robinhood testify before House committee on Republican crypto bill",
    "url": "https://cryptoslate.com/coinbase-robinhood-testify-before-house-committee-on-republican-crypto-bill/",
    "description": "<p>The U.S. House Committee on Agriculture heard testimony on June 6 regarding a draft discussion bill on cryptocurrency recently advanced by Republican lawmakers. Coinbase, Robinhood declare support Rep. Glenn Thompson, one lawmaker who initially advanced the draft discussion bill, said that the meeting is intended to discuss the bill with Democratic members. He expressed a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-robinhood-testify-before-house-committee-on-republican-crypto-bill/\">Coinbase, Robinhood testify before House committee on Republican crypto bill</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-06T20:58:00.000Z",
    "title": "Coinbase CEO Brian Armstrong Fires Back at SEC, Vows to Fight for Crypto Rules",
    "url": "https://www.cryptoglobe.com/latest/2023/06/coinbase-ceo-brian-armstrong-fires-back-at-sec-vows-to-fight-for-crypto-rules/",
    "description": "As CryptoGlobe reported earlier today (June 6, 2023), the U.S. Securities and Exchange Commission (SEC) has charged Coinbase, Inc., a leading crypto asset trading platform, with operating as an unregistered national securities exchange, broker, and clearing agency. The SEC also accused Coinbase of failing to register the offer and sale of its crypto asset staking-as-a-service […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T20:58:37.000Z",
    "title": "Perella Weinberg explores sale of FTX’s Anthropic stake: Could venture capitalists cash in on AI boom?",
    "url": "https://www.cryptopolitan.com/perella-weinberg-explores-sale-ftx-anthropic-stake/",
    "description": "Perella Weinberg, the investment bank handling the bankruptcy of crypto exchange FTX, is reportedly seeking to sell shares in Anthropic, an AI startup that has gained significant value in the AI industry, according to a report by Semafor. The stake in Anthropic, worth around $500 million at the time of FTX&#8217;s bankruptcy, is now expected ... <a title=\"Perella Weinberg explores sale of FTX&#8217;s Anthropic stake: Could venture capitalists cash in on AI boom?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/perella-weinberg-explores-sale-ftx-anthropic-stake/\" aria-label=\"More on Perella Weinberg explores sale of FTX&#8217;s Anthropic stake: Could venture capitalists cash in on AI boom?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T20:51:37.000Z",
    "title": "Coinbase responds to SEC lawsuit – Here is what they said",
    "url": "https://www.cryptopolitan.com/coinbase-responds-to-sec-lawsuit/",
    "description": "Drawing upon an atmosphere thick with tension and marked by regulatory uncertainty, the cryptocurrency powerhouse, Coinbase, now finds itself in the spotlight following charges levied against it by the U.S. Securities and Exchange Commission (SEC). The CEO of Coinbase, Brian Armstrong, responded swiftly and assertively to these allegations, voicing his confidence in the company&#8217;s standing ... <a title=\"Coinbase responds to SEC lawsuit &#8211; Here is what they said\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-responds-to-sec-lawsuit/\" aria-label=\"More on Coinbase responds to SEC lawsuit &#8211; Here is what they said\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T20:46:26.000Z",
    "title": "Coinbase and Robinhood take center stage in Congress to champion regulatory clarity for crypto",
    "url": "https://www.cryptopolitan.com/coinbase-and-robinhood-take-center-stage-in-congress-to-champion-regulatory-clarity-for-crypto/",
    "description": "In a groundbreaking move, top executives from Coinbase and Robinhood and representatives from the United States commodities regulator will convene before Congress today to discuss a visionary crypto bill that promises to reshape the digital asset landscape. The proposed legislation seeks to classify specific crypto tokens as digital commodities while addressing regulatory gaps and providing ... <a title=\"Coinbase and Robinhood take center stage in Congress to champion regulatory clarity for crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-and-robinhood-take-center-stage-in-congress-to-champion-regulatory-clarity-for-crypto/\" aria-label=\"More on Coinbase and Robinhood take center stage in Congress to champion regulatory clarity for crypto\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T21:00:07.000Z",
    "title": "While Bitcoin (BTC) Shows Bearish Signals, Digitoads (TOADS) Bursts Strong Onto The Memecoin Scene",
    "url": "https://nulltx.com/while-bitcoin-btc-shows-bearish-signals-digitoads-toads-bursts-strong-onto-the-memecoin-scene/",
    "description": "DigiToads is making investors and crypto fans more interested in meme coins than ever. Bitcoin (BTC), the first digital currency, is presently displaying negative indications in the constantly changing world of cryptocurrencies, which has investors and enthusiasts on edge. However, a new player has surfaced in this unpredictability, grabbing the interest of the crypto world. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T20:43:42.000Z",
    "title": "Louis Vuitton introduces NFT collection featuring $42k ‘VIA Treasure Trunk’",
    "url": "https://crypto.news/louis-vuitton-introduces-nft-collection-featuring-42k-via-treasure-trunk/",
    "description": "Luxury fashion house Louis Vuitton ventures further into the web3 realm with the introduction of an NFT release featuring their iconic Trunk, known as the \"VIA Treasure Trunk.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T21:00:32.000Z",
    "title": "Bitcoin Crash To $25,800 Sends 6.5% Of Supply Into Loss",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-crash-to-25700-sends-6-5-supply-loss/",
    "description": "On-chain data shows yesterday&#8217;s Bitcoin crash from $27,300 to $25,800 alone sent 6.5% of the supply into a state of loss. Bitcoin Supply In Profit Shrunk Down To 62.5% Following The Price Plunge According to data from the on-chain analytics firm Glassnode, a further 1.26 million coins were lost after the latest price plummet. The relevant indicator is the &#8220;percent supply in profit,&#8221; which measures the percentage of the total circulating Bitcoin supply currently being held at a profit. The metric calculates this value by going through the on-chain history of all the coins on the network to see what price they were last moved at. If the previous selling price for any coin was less than the current spot value of the asset, then that specific coin is counted inside the profit supply. The counterpart indicator for the percent supply in profit is the &#8220;percent supply in loss,&#8221; which naturally tracks the loss of supply. This metric&#8217;s value can be found by subtracting the percent supply in profit from 100. Now, here is a chart that shows the trend in the Bitcoin percent supply in profit over the last couple of days: The value of the metric seems to have observed some decline recently &#124; Source: Glassnode on Twitter As displayed in the above graph, the Bitcoin percent supply in profit saw a massive plunge as the crash in the cryptocurrency from the $27,300 mark to the $25,800 level took place. The impetus behind this price plunge was the US Securities and Exchange Commission (SEC) suing the cryptocurrency exchange Binance and its CEO, Changpeng Zhao, over alleged fraud. Though even though the price saw a 5.8% plunge during this crash, the percentage of the total circulating Bitcoin supply that was sent into a state of loss measured to around 6.5%. Related Reading: Dogecoin Plunges 7% As Whales Make Large Moves The analytics firm also explained the reason behind this discrepancy; the price range that the asset had previously been trading in was host to many investors&#8217; cost basis (that is, the acquisition/buying price). Looks like the prices that BTC had been trading at before were the center of the largest demand profile &#124; Source: Glassnode on Twitter Since a relatively high percentage of the supply had been bought at those levels, it makes sense that a sharp price move below it would send a significant number of coins into a loss. When Bitcoin had been trading around the $25,800 level, the percent supply in profit had dropped to just 62.5%, while preceding the crash, the indicator had a value of about 69%. This would imply that 37.5% of the supply had been lost after the plunge. Related Reading: Bitcoin Slips Below $26,000, Triggers Over $300 Million In Liquidations Since Glassnode posted the chart, however, the cryptocurrency has recovered, pushing back above the $26,000 level. Naturally, this means that some coins would have returned to a profit state. BTC Price At the time of writing, Bitcoin is trading around $26,100, down 4% in the last week. BTC has sharply risen during the last few hours &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  }
]