[
  {
    "source": "Cointelegraph",
    "date": "2023-12-02T19:02:15.000Z",
    "title": " North Korean hackers have pilfered $3B of crypto over past six years: Report ",
    "url": "https://cointelegraph.com/news/north-korean-hackers-stolen-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZjRjYjY2MGEtNDllZC00MTA3LWI5YWUtNzg3NjQ1YzNjYjkyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In 2022, North Korean hackers swiped crypto worth ten times more than the country earned from exports in 2021, according to US cybersecurity firm Recorded Future.</p>\n                    <p><p >According to United States cybersecurity firm Recorded Future, North Korean hackers have stolen around $3 billion in cryptocurrency since 2017, with more than half of that amount stolen in the past year alone.</p><p >Recorded Future indicated in a recent <a href=\"https://go.recordedfuture.com/hubfs/reports/cta-2023-1130.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> that the amount of stolen crypto equates to approximately half of North Korea’s entire military expenses for the year:</p><blockquote >\"North Korean threat actors were accused of stealing an estimated $1.7 billion worth of cryptocurrency in 2022 alone, a sum equivalent to approximately 5% of North Korea’s economy or 45% of its military budget.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Since 2017, North Korea has significantly increased its focus on the cryptocurrency industry, stealing an estimated $3 billion worth of cryptocurrency. <a href=\"https://t.co/cES9gq2AK3\">pic.twitter.com/cES9gq2AK3</a></p>&mdash; Recorded Future (@RecordedFuture) <a href=\"https://twitter.com/RecordedFuture/status/1730217724091982058?ref_src=twsrc%5Etfw\">November 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >Furthermore, the stolen amount surpasses the total annual income from exports for the nation by a considerable margin.</p><p >“This amount is also almost 10 times more than the value of North Korea's exports in 2021, which sat at $182 million,” the report stated.</p><p >Meanwhile, it explained that North Korean hackers initially targeted <a href=\"https://cointelegraph.com/news/crypto-makes-70-percent-south-korean-overseas-assets\">South Korea for its crypto</a>, before expanding their focus to the rest of the world: </p><blockquote >“North Korean cyber operators shifted their targeting from traditional finance to this new digital financial technology by first targeting the South Korean cryptocurrency market before significantly expanding their reach globally.”</blockquote><p >It was noted that the techniques used by North Korean hackers in their illicit activities resemble those of other cybercriminal groups. </p><p><a href=\"https://cointelegraph.com/news/north-korean-hackers-stolen-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-02T19:04:26.000Z",
    "title": "OKX Wallet integrates DeSyn defi protocol",
    "url": "https://crypto.news/okx-wallet-integrates-desyn-defi-protocol/",
    "description": "This integration enhances OKX Wallet capabilities, expanding opportunities for users to participate in defi activities. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-02T18:45:49.000Z",
    "title": "Do Kwon: What Happened To The Terra Luna Founder?",
    "url": "https://www.newsbtc.com/news/do-kwon-what-happened-to-the-terra-luna-founder/",
    "description": "Few names have sparked as much intrigue and controversy as Do Kwon (sometimes called Kwon Do). From the meteoric rise of Terra Luna to its sudden and tumultuous downfall, Do Kwon has become a figure of significant interest and speculation. In this comprehensive exploration, we delve into the journey of Terra Luna’s Do Kwon, the mastermind behind one of the most talked-about projects in the crypto world. We&#8217;ll uncover the latest Do Kwon news that has kept the crypto community on its toes, analyze the Do Kwon net worth, and shed light into the future of Terra Luna without its founder. Who is Do Kwon? Do Kwon, whose full name is Kwon Do-hyung, is a South Korean crypto entrepreneur renowned as the co-founder and CEO of Terraform Labs. Born on September 6, 1991, in Seoul, South Korea, he has become a prominent figure in the cryptocurrency industry. Kwon Do-hyung’s early education took place at Daewon Foreign Language High School in Seoul, one of South Korea&#8217;s most prestigious private schools. Furthermore, his academic journey led him to Stanford University in the United States, where he pursued a degree in computer science, laying the groundwork for his future endeavors in the tech and crypto industries. Tracing The Origins: The Path To Crypto Fame After graduating from Stanford in 2015, Kwon Do-hyung returned to South Korea in 2016 and founded Anyfi, a connectivity solutions startup. Anyfi, which focused on a peer-to-peer Wi-Fi mesh network, was Do.Kwon&#8217;s initial foray into the tech startup world. However, his interest soon pivoted to the then-nascent crypto market. After identifying a lack of robust crypto payment networks, he co-authored a white paper with Nicholas Platias, advocating for a decentralized payment system powered by a stablecoin to facilitate cryptocurrency payments and provide a medium of exchange with reduced volatility. The Beginnings Of Terra Luna This white paper caught the attention of Daniel Shin (whose full name is Shin Hyun-seung), a seasoned South Korean tech entrepreneur experienced in online payment systems. Afterwards, in 2018, Kwon Do-hyung and Hyun-seung co-founded Terraform Labs, leading to the development of the Terra (LUNA) cryptocurrency. Terraform Labs introduced TerraUSD (UST), an algorithmic stablecoin pegged to the US dollar, in September 2020. The stability mechanism of UST, backed by the LUNA token, was a novel approach in the crypto world but ultimately led to the collapse of both cryptocurrencies in May 2022. But more on that later. The Rise And Fall Of Terra Luna And Do Kwon The story of Terra Luna and its co-founder Kwon Do-hyung is a tale of rapid ascension and dramatic downfall in the volatile world of cryptocurrency. It&#8217;s a narrative that encapsulates the inherent risks and potential of innovative financial technologies, and the fine line between genius and overreach. Do Kwon Crypto Achievements Do Kwon, as the co-founder of Terraform Labs, significantly impacted the cryptocurrency sector with the introduction of Terra Luna. Terraform Labs, under Kwon Do-hyung&#8217;s leadership, innovated in the realm of stablecoins, aiming to solve the problem of volatility in the crypto market. Terra Luna&#8217;s unique selling point was its dual-token system: the native LUNA token and the TerraUSD (UST) stablecoin. UST was designed as an algorithmic stablecoin, an ambitious attempt to maintain a stable value relative to the US dollar without the need for traditional fiat collateral. Do Kwon Luna: Triumphs And Trials Terra Luna&#8217;s ecosystem experienced rapid growth and success, particularly with the popularity of its Anchor Protocol, which promised high yields on UST deposits. This contributed to a significant increase in LUNA&#8217;s value, as the protocol’s design required LUNA to be burned to mint UST, thereby reducing LUNA’s supply and increasing its price. However, the success of Terra Luna and its algorithmic stablecoin also brought increased scrutiny and challenges, especially concerning the sustainability and resilience of its stabilization mechanism. Do Kwon Terra&#8217;s Downfall The downfall of Terra Luna began with the destabilization of UST. Unlike traditional stablecoins backed by fiat or physical assets, UST&#8217;s stability was algorithmically linked to LUNA. To bolster confidence and add an additional layer of stability to UST, Terraform Labs amassed a significant reserve of Bitcoin. The idea was that these Bitcoin reserves could be liquidated to defend the UST peg in times of stress. At its peak, the Luna Foundation Guard (LFG), established to manage these reserves, held over $3 billion in Bitcoin. However, when UST began to lose its peg due to massive sell-offs in May 2022, this triggered a series of events that led to the liquidation of these Bitcoin reserves. The sale of such a large amount of Bitcoin in a short period contributed to a crash in the crypto market. This strategy of using Bitcoin as a reserve asset for an algorithmic stablecoin was unprecedented and, in this instance, ultimately proved ineffective. The rapid devaluation of UST and LUNA, coupled with the liquidation of Bitcoin reserves, not only led to the collapse of Terra Luna&#8217;s ecosystem but also sent shockwaves through the entire cryptocurrency market, eroding billions in market capitalization and investor confidence. The Terra Luna crisis highlighted the risks of algorithmic stablecoins and the complexities of using volatile assets like Bitcoin as a backing mechanism in times of market stress. Do Kwon Net Worth The financial trajectory of Kwon Do-hyung, marked by both remarkable successes and significant setbacks, paints a complex picture of his net worth. The Wealth Rollercoaster: Do Kwon Net Worth The Do Kwon net worth has been a subject of intense interest, especially in the wake of the Terra Luna collapse. At the peak of Terra Luna&#8217;s success, Do Kwon&#8217;s net worth was speculated to be in the billions, given the high valuation of the LUNA token and the Terra ecosystem. In April 2022, LUNA&#8217;s value soared, and the Terra ecosystem reached a staggering $60 billion valuation, significantly boosting the Do Kwon net worth. However, this fortune was short-lived. Following the dramatic collapse of Terra Luna in May 2022, the Do Kwon net worth plummeted alongside the value of LUNA and UST. By July 2023, estimates placed his net worth at around $135 million, a substantial decrease from his peak wealth. Accordingly, this decline was primarily due to the obliteration of the Terra ecosystem, which significantly eroded the value of his holdings in LUNA and related crypto assets. However, it&#8217;s important to note that the exact extent of Kwon&#8217;s current wealth, especially in liquid assets, remains somewhat opaque. His involvement in other blockchain projects and potential holdings in various cryptocurrencies may contribute to his overall financial portfolio. Do Kwon News: The Latest Developments Do Kwon&#8217;s situation has evolved rapidly, with significant developments unfolding after the Terra Luna collapse. As of the latest updates, Kwon Do-hyung faced legal challenges from multiple jurisdictions, including the United States and South Korea. In September 2022, a South Korean court issued an arrest warrant for Do Kwon, along with other individuals associated with Terra, on charges related to the collapse of the cryptocurrency. Following the issuance of an Interpol Red Notice, Kwon Do-hyung was reported to have moved from Singapore and was believed to be in Serbia, before fleeing to Balkan state Montenegro. South Korean and US authorities continued their pursuit, seeking his extradition to face various charges, including securities fraud. Do Kwon News In 2023 In February 2023, the US Securities and Exchange Commission (SEC) charged Kwon and Terraform Labs with securities fraud, alleging the creation of a fraudulent scheme that led to substantial investor losses. Afterwards, Do Kwon&#8217;s legal representatives contested these charges, challenging the SEC&#8217;s claims and its characterization of LUNA and other tokens as securities. Authorities arrested Kwon in Montenegro on March 23, 2023, as he prepared to board a private jet to Dubai with falsified documents. Subsequently, a Montenegrin court sentenced him to four months in jail for document forgery, involving multiple passports and identity cards. This Do Kwon news followed an international search initiated by South Korean authorities, with both South Korea and the US seeking extradition related to Terra Luna&#8217;s collapse. In June 2023, the High Court in Podgorica confirmed that the Terra Luna founder would be held in &#8220;extradition custody&#8221; for a six-month period pending the review of South Korea&#8217;s extradition request. The Future Outlook For Do Kwon And Terra Luna Uncertainty and complexity shroud the future outlook for Do Kwon and the Terra Luna project. For Kwon, the immediate focus is on the legal challenges he faces. Furthermore, his extradition and the outcomes of the trials will significantly influence his personal and professional future. As for Terra Luna, its future hinges on restoring investor confidence and demonstrating the viability of its revamped ecosystem, Terra 2.0. Furthermore, the effectiveness of Terra 2.0 and its ability to attract new users and developers will be critical in determining the project&#8217;s long-term viability. However, as of November 7, the Terra Luna Classic (LUNC) price was on the verge of a breakout from a multi-month downtrend channel. FAQ What Is The Current Do Kwon Net Worth? As of July 2023, estimates place the Do Kwon net worth at around $135 million, marking a significant decrease from its peak during the height of Terra Luna&#8217;s success. Who Is Do Kwon? Do Kwon (whose full name is Kwon Do-hyung) is a South Korean entrepreneur, the co-founder, and CEO of Terraform Labs, known for creating the Terra Luna cryptocurrency ecosystem. How Has Do Kwon News Affected Terra Luna&#8217;s Stability? The Do Kwon news, especially regarding legal challenges and his arrest, has negatively impacted Terra Luna&#8217;s stability, eroding investor confidence and raising concerns about the project&#8217;s future. What Was Do Kwon Luna&#8217;s Strategy For Crypto? Kwon&#8217;s strategy involved creating a stablecoin ecosystem with an algorithmic approach, aiming to reduce crypto market volatility and promote wider adoption of digital currencies. What Are the Implications Of Do Kwon Stanford Education On His Career? Kwon&#8217;s Stanford education provided a strong foundation in computer science and a network of peers and mentors, instrumental in his foray into the tech and crypto industries. What&#8217;s The Latest Do Kwon News And Terra Luna? The latest Do Kwon news include his arrest in Montenegro in March 2023 for document forgery and ongoing legal proceedings involving his extradition to face charges related to the Terra Luna collapse. What Was Do Kwon&#8217;s Vision For Terra Luna? Kwon envisioned Terra Luna as a blockchain platform that would revolutionize digital finance by offering a stable and scalable cryptocurrency, thereby addressing the limitations of traditional cryptocurrencies. Featured image from Blog Tiền Ảo"
  }
]