[
  {
    "source": "Decrypt",
    "date": "2023-10-16T22:54:01.000Z",
    "title": "BlackRock Boss Says Bitcoin Pump on Fake ETF News Shows ‘Pent Up Interest in Crypto’",
    "url": "https://decrypt.co/201898/blackrock-boss-says-bitcoin-pump-on-fake-etf-news-shows-pent-up-interest-in-crypto",
    "description": "While the CEO claimed his company’s Bitcoin spot ETF application was only in a better place after Monday’s events, others were skeptical. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T22:50:01.000Z",
    "title": "Cathie Wood says ‘hopes are rising’ for spot Bitcoin ETF; Larry Fink addresses role of crypto in restless markets",
    "url": "https://cryptoslate.com/cathie-wood-says-hopes-are-rising-for-spot-bitcoin-etf-while-larry-fink-addresses-role-of-crypto-in-restless-markets/",
    "description": "<p>Cathie Wood, the CEO and CIO of ARK Invest, commented on pending spot Bitcoin ETF applications during a CNBC interview on Oct. 16. As ARK Invest is one of several asset managers pursuing a spot Bitcoin ETF, Wood began by describing the current state of her company&#8217;s application, stating: &#8220;It was publicized and disclosed last [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cathie-wood-says-hopes-are-rising-for-spot-bitcoin-etf-while-larry-fink-addresses-role-of-crypto-in-restless-markets/\">Cathie Wood says &#8216;hopes are rising&#8217; for spot Bitcoin ETF; Larry Fink addresses role of crypto in restless markets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T22:42:58.000Z",
    "title": "Expert Insights on Monero (XMR), Ripple (XRP), Stellar (XLM), Litecoin (LTC), Chainlink (LINK): Should You Hold or Sell Now?",
    "url": "https://cryptodaily.co.uk/2023/10/expert-insights-on-monero-xmr-ripple-xrp-stellar-xlm-litecoin-ltc-chainlink-link-should-you-hold-or-sell-now",
    "description": "Explore expert insights on the performance and future outlook of Monero (XMR), Ripple (XRP), Stellar (XLM), Litecoin (LTC), and Chainlink (LINK) amidst a dynamic crypto landscape. Dive into the core features, price analysis, and broader market implications for these digital currencies."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T23:00:10.000Z",
    "title": "Cardano Whale Addresses Continue To Fall, What Does This Mean For ADA Price?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-whale-addresses-ada-price/",
    "description": "The ADA price has moved in tandem with the rest of the crypto market after a small rally but Cardano whales continue to threaten this positive price action. According to recent data, the balances of large ADA whales have continued to decline, suggesting that they may be selling off their substantial holdings. Cardano Whale Balances See Large Drop Over the last month, the balances of Cardano’s largest holders have been on a decline. This has occurred as the price of ADA has fallen but with each small recovery, these whales seem to be taking advantage of the market to sell at a profit. Related Reading: Standard Chartered Says Ethereum Price Can Reach $35,000, Here’s When The significant drop in balances over time has been noticed in the wallets holding between 1 million and 10 million ADA have fallen. This assertion is backed up by data from IntoTheBlock which shows a large decline in the holdings of these large holders. 1 million to 10 million token holders dump &#124; Source: IntoTheBlock Toward the end of September, addresses holding between 1 million and 10 million ADA held a total of 5.63 billion tokens. However, going into October, their balances began to drop by the millions. By October 15, their total balance was sitting at 5.41 billion, representing a drop of 220 million tokens. At the same time that this was happening, larger whales holding between 10 million and 100 million ADA have been increasing their balances. Their holdings increased from 11.81 billion ADA to 12.26 billion ADA toward the end of September. It then saw a small reversal but in August, their holdings settled at 12.16 billion tokens, representing a 300 million increase. This would suggest that while the 1 million to 10 million cohort had been selling, the 10 million and 100 million cohort had seized the opportunity to buy. This ended in a transfer of over 300 million ADA to these already massive whales, increasing their dominance in the market. XRP recovers above $0.25 &#124; Source: ADAUSD on Tradingview.com ADA Holders Plunge Further Into Losses Amid the sell-offs from the 1 million to 10 million ADA cohort, Cardano holders continue to feel the impact of the bear market. Unlike the rest of the top 10 largest cryptocurrencies which have maintained a good profitability ratio, ADA has performed horribly. Only 6% in addresses in profit &#124; Source: IntoTheBlock According to data from IntoTheBlock, only 6% of the almost 4.5 million ADA holders are seeing profit. A whopping 4.09 million addresses are sitting in losses, accounting for 91.76% of the total holder base. In contrast, 2.06% (91,990) addresses are breaking even. Related Reading: Will Ethereum Drop Back To $900? Here’s What This Analyst Thinks ADA is currently trading at $0.25, a 91.84% drop from its all-time high price of $3.10, according to Messari. However, it remains the 8th-largest cryptocurrency with a market cap of $8.88 billion. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from The Currency Analytics, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T23:00:00.000Z",
    "title": "LUNA Price Rebounds: Will Bulls Bounce Back to $1 in 2023?",
    "url": "https://coinedition.com/luna-price-rebounds-will-bulls-bounce-back-to-1-in-2023/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Terras-LUNA-2.0-price-crashes-by-20.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LUNA Price Rebounds: Will Bulls Bounce Back to $1 in 2023?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Terras-LUNA-2.0-price-crashes-by-20.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Terras-LUNA-2.0-price-crashes-by-20-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Terras-LUNA-2.0-price-crashes-by-20-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Terras-LUNA-2.0-price-crashes-by-20-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Terras-LUNA-2.0-price-crashes-by-20-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>LUNA&#8217;s recent bounce from support at $0.4079 hints at a potential bullish reversal. Increased trading volume and market capitalization point to growing interest in LUNA. The Keltner Channel tightening suggests price consolidation before a potential breakout. During the course of the past seven days, bearish momentum has dominated the Terra (LUNA) market, with prices oscillating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/luna-price-rebounds-will-bulls-bounce-back-to-1-in-2023/\">LUNA Price Rebounds: Will Bulls Bounce Back to $1 in 2023?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]