[
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T19:30:00.000Z",
    "title": "Parliamentary report recommends Canada recognize, strategize blockchain industry",
    "url": "https://cointelegraph.com/news/parliamentary-report-recommends-canada-recognize-strategize-blockchain-industry",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/f36e94ca-fdd6-4cf0-96dd-3e36a2590e0b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“Canada punches above its weight” in blockchain innovation, parliamentarians conclude, but lots more should be done to encourage the industry.</p>\n                    <p><p>A Canadian House of Commons committee report has recommended that the country “recognize blockchain as an emerging industry,” and take all the steps that entails. There are a lot of steps needed, it said.</p><p>The report was <a href=\"https://www.ourcommons.ca/Content/Committee/441/INDU/Reports/RP12522346/indurp15/indurp15-e.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> by the Canadian House of Commons Standing Committee on Industry and Technology after a study that involved five meetings and numerous witnesses and briefs. The report outlined uses of blockchain that included cryptocurrency, supply chain and public sector uses and non-crypto financial innovations. </p><p>“Canada punches above its weight,” in blockchain innovation and entrepreneurial capacity, one witness for the committee said. In 2021, 2.5% of large enterprises in Canada used blockchain, while less than 1% of small and medium-sized enterprises did so. Witness estimates of the number of Canadians employed in the blockchain industry in 2020 was put at 16,000, and another witness estimated that cryptocurrency firms employed 13,000 Canadians in 2022. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-ether-best-support-canadian-regulator-explains-stance-on-crypto-staking-lending-for-investment-funds\">Canadian regulator explains stance on crypto staking, lending for investment funds</a></em></strong></p><p>Citing witnesses, the report stated that “cryptocurrency trading platforms are sufficiently regulated to protect consumers from risks seen from foreign platforms.” It credited the collapse of the Canadian QuadrigaCX trading platform in 2019 for spurring regulators into action. Their efforts continue:</p><blockquote>“This increased interest by Canadian regulators is broadly is [in] line with developments in other jurisdictions.” </blockquote><p>The report also noted that, while large-scale problems have received most media attention, consumers seeking entry into the crypto market on a small scale are also frequently targeted by bad actors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A House of Commons committee says blockchain could create &#39;significant long-term economic and job creation opportunities in Canada,&#39; but experts say Ottawa has a lot of work to do if it wants to seize the technology&#39;s potential and avoid drawbacks. <a href=\"https://t.co/D04vrjVDaC\">https://t.co/D04vrjVDaC</a></p>&mdash; CBC News (@CBCNews) <a href=\"https://twitter.com/CBCNews/status/1677769522068045826?ref_src=twsrc%5Etfw\">July 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The report recommended to “recognize” the role of blockchain in Canada, which in turn leads to 15 more recommendations that follow from there. More regulatory clarity is needed, the report said, and the government should formulate a national strategy in conjunction with industry participants. The report mentioned stablecoin regulation in particular, noting that even committee witnesses could not agree on whether or not stablecoins are securities.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-city-ultimate-guide-toronto/\">Your guide to crypto in Toronto: Crypto City</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T19:11:25.000Z",
    "title": "A no-fail trade? Bitcoin traders who dollar cost average are profitable",
    "url": "https://cointelegraph.com/news/a-no-fail-trade-bitcoin-traders-who-dollar-cost-average-are-profitable",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/174ae4ba-b3ec-48a3-a5eb-afcf01636a44.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Investors who have dollar-cost-averaged into Bitcoin over time are profitable regardless of when they began implementing the strategy. </p>\n                    <p><p>The weighted average cost of purchased Bitcoin recently reached a level signifying that all investors who have consistently dollar-cost averaged into Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) are now in the black, regardless of how long they have been holding.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Just a reminder that every single pleb who has been dollar cost averaging <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> is now in profit no matter when they first started DCA&#39;ing. Every single one of them! <a href=\"https://t.co/pnuIqdQznM\">pic.twitter.com/pnuIqdQznM</a></p>&mdash; Wicked (@w_s_bitcoin) <a href=\"https://twitter.com/w_s_bitcoin/status/1675943844519575552?ref_src=twsrc%5Etfw\">July 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This news comes despite the <a href=\"https://cointelegraph.com/news/bitcoin-supply-shock-btc-price-120k-standard-chartered\">price of Bitcoin</a> as measured in US dollars still being down by over 50% from its all-time high of around $69,000.</p><p>And yet, many financial pundits in the space still cling to the notion of Bitcoin’s entire existence and market cap of nearly $600 billion being based on a Ponzi Scheme of some sort. Others continue to deny that saving in the hardest form of money ever known has, so far, been an excellent investment thesis – one that has outperformed all others.</p><p>Yes, there may be risks. And yes, volatility definitely comes with the territory. But looking at such factors in a vacuum does not make for adequate analysis of any investment. The alternative strategies available must be taken into consideration, along with other variables such as:</p><ul><li>What is the current macro environment, and how might it change going forward? What impact might this have on different asset classes and their performance?</li><li>What risk/reward ratio does one strategy offer in comparison to others?</li><li>Can diversification lead to an optimized risk and return profile, or does YOLO’ing all-in provide better returns?</li></ul><p>These are just a few potential questions that could be worth investigating when it comes to allegations against dollar-cost averaging into BTC for the long-term.</p><p>Let’s dig into some data that can help shed light on all of this.</p><h2>Bitcoin outperforms traditional investments</h2><p>Some investors, like those at Adamant Research, have been pointing out the reality of Bitcoin’s most favorable risk/reward ratio for many years:</p><blockquote>“We assert that the long term risk reward ratio for Bitcoin is currently the most favorable of any liquid investment in the world. We expect for it to trade in a range of $3,000 to $6,500 after which we foresee the emergence of a new bull market.”</blockquote><p>The group made similar statements during the bear markets of 2015 and 2011 as well.</p><p>How has a standard 60/40 portfolio fared over the last 5 years? What about gold? Real estate?</p><p>The following chart illustrates the relative performance of several currencies and asset classes against BTC quite well:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> - for the money you can&#39;t afford to lose.<a href=\"https://t.co/j9iQ7iJVc7\">pic.twitter.com/j9iQ7iJVc7</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1677379832991346689?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Needless to say, when it comes to comparing the performance of DCA strategy into Bitcoin versus literally any other asset, there is little comparison to be made.</p><h2>To diversify or not?</h2><p>Traditional asset managers tend to abide by certain rules, with one of them being the idea of re-balancing. When a particular asset outperforms, profits should be taken and distributed elsewhere, according to this line of thinking.</p><p>It can be considered a form of “diversification on-the-go,” if you will. But whether discussing diversifying from the onset of constructing a portfolio or as time goes on, how would such a strategy compare to going all-in on what has so far been considered one of the riskiest, most speculative assets of all time?</p><p>The answer is simple: doing so would be “selling the winner to buy the losers,” as Michael Saylor has said.</p><p>On a 5-year basis, BTC/USD is up 376%. Compare this to about 55% for the S&amp;P 500 or gold.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6f1e4342-9829-40d9-a5a7-4016469ff4b0.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>5-year chart of BTC, SPY, and gold. Source: TradingView</em></figcaption></figure><p>Taking <a href=\"https://cointelegraph.com/news/bitcoin-price-gathers-strength-as-sol-avax-fil-and-eos-prep-for-a-breakout\">profits from Bitcoin</a> at any point in time and putting them into other assets would have decimated a portfolio’s potential. Income from dividends doesn’t compensate, except for those working with multi-million-dollar portfolios. And even then, the potential income would be dwarfed by capital gains of holding a large Bitcoin position.</p><p>While the concept of “risk” often implies volatility and potential downside, what about the risk associated with “playing it safe?” Should investors not be concerned about the potential of their portfolios to barely keep pace with the rate of inflation?</p><p><strong><em>Related</em></strong>: <a href=\"https://cointelegraph.com/news/cpi-btc-supply-5-things-bitcoin-this-week\"><strong><em>CPI meets low BTC supply — 5 things to know in Bitcoin this week</em></strong></a></p><h2>Macro trends to consider</h2><p>Proponents of Bitcoin and the DCA strategy have long since contended that BTC serves as the ultimate hedge against monetary inflation and overall financial market uncertainty.</p><p>Despite critics’ best efforts aimed at destroying this narrative, it has prevailed.</p><p>Look no further than the banking collapses of 2023 and Bitcoin’s resulting rally for proof. Furthermore, while the saying “so much for an inflation hedge” became popular in 2022 as BTC fell sharply from its all-time-high, that idea has strangely seemed to go by the wayside in 2023.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e3e09715-0c66-47a4-be5b-14c6b087887b.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>YTD chart of BTC/USD. Vertical line indicates the day of the collapse of Silvergate. Source: TradingView</em></figcaption></figure><p>When it comes to money printing, there is perhaps no crypto meme more famous than “money printer go brrr.”</p><p>A big reason that meme was so successful was the truth behind it: the growth of M2 money supply has been highly correlated to the price of BTC/USD since inception.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ok, two more charts and some thoughts...this time on crypto....<br><br>Is the accepted narrative of the BTC Halving cycle what drives the BTC cycle (and all crypto) or is it the macro? <br><br>Im starting to think it&#39;s all about the macro <br><br>This is global M2 YoY vs Crypto market cap <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/sSB7CaVFdE\">pic.twitter.com/sSB7CaVFdE</a></p>&mdash; Raoul Pal (@RaoulGMI) <a href=\"https://twitter.com/RaoulGMI/status/1550239761486561281?ref_src=twsrc%5Etfw\">July 21, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While money supply and velocity have been trending downward as of late, there’s little reason to believe the magic money printer has gone away. More likely, it simply lies dormant for a time.</p><h2>Slow and steady wins the race</h2><p>For many Bitcoin and crypto cynics, no amount of evidence will alter their convictions. Once a Ponzi Scheme, always a ponzi scheme in their view. But hodlers have taken the orange pill and partaken of the truth while reaping the just rewards.</p><p>While they can invite others to the cause, no one can force a worldview on another. Even if that view has long since become self-evident.</p><p>BTC is up 87% year-to-date. Still, the price remains 44% beneath the all-time high of $69,000. The next halving is less than one year away, projected for May 2024. </p><p>Following this event along with the prospect of increased institutional adoption in the immediate future, it’s widely anticipated that the Bitcoin price could reach six-figure territory and beyond during this cycle. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T19:30:14.000Z",
    "title": "Celsius’s bankruptcy-induced liquidation plans could pressure overall crypto market: Kaiko",
    "url": "https://cryptoslate.com/celsiuss-bankruptcy-plan-to-liquidate-altcoins-could-pressure-crypto-market-kaiko/",
    "description": "<p>Bankrupt lender Celsius&#8217;s plan to liquidate its altcoins for Bitcoin (BTC) and Ethereum (ETH) could exert more pressure on the crypto market, according to a July 10 report from blockchain analytical firm Kaiko. Kaiko noted that most altcoins held by Celsius had recorded significant drops, ranging from 6% to as high as 84%, in their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/celsiuss-bankruptcy-plan-to-liquidate-altcoins-could-pressure-crypto-market-kaiko/\">Celsius&#8217;s bankruptcy-induced liquidation plans could pressure overall crypto market: Kaiko</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T19:28:38.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T19:20:19.000Z",
    "title": "Scammers target Meta’s new app Threads with imposter accounts",
    "url": "https://www.cryptopolitan.com/scammers-on-threads-with-imposter-accounts/",
    "description": "Since the launch of Meta&#8217;s new microblogging app, Threads, scammers have wasted no time in attempting to deceive users. Despite the app&#8217;s growing popularity, with over 98 million sign-ups since its release on July 5, several high-profile Crypto Twitter users have already encountered imposter accounts and warned others about them. One of the notable incidents ... <a title=\"Scammers target Meta&#8217;s new app Threads with imposter accounts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/scammers-on-threads-with-imposter-accounts/\" aria-label=\"More on Scammers target Meta&#8217;s new app Threads with imposter accounts\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T19:22:39.000Z",
    "title": "XRP Bulls Stampede Through Q2 as XRPL Defies SEC Lawsuit: Explosive Growth Report",
    "url": "https://www.crypto-news-flash.com/xrp-bulls-stampede-through-q2-as-xrpl-defies-sec-lawsuit-explosive-growth-report/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-bulls-stampede-through-q2-as-xrpl-defies-sec-lawsuit-explosive-growth-report",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Data discloses that the XRP market cap declined by 10 percent in the second quarter of 2023 but recorded growth in other areas. CryptoLaw&#8217;s John Deaton speaks on what happens when Ripple loses the lawsuit against SEC.  A report from crypto analytics firm Messari has disclosed that the XRP Ledger (XRPL) recorded incredible growth in [...]"
  }
]