[
  {
    "source": "Cointelegraph",
    "date": "2023-06-18T02:51:54.000Z",
    "title": "The fight for clarity 'has to continue' – Brad Garlinghouse ",
    "url": "https://cointelegraph.com/news/ripple-ceo-brad-garlinghouse-fight-for-clarity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/309e7335-02a5-4828-b0d7-e3f40e1f02ef.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a video posted to Twitter, Ripple CEO Brad Garlinghouse opined that the U.S. financial watchdog acted in \"bad faith, plain and simple.\" He warned that it is only the beginning of the battle for \"so many other\" crypto firms.</p>\n                    <p><p>Ripple CEO Brad Garlinghouse has warned that as Ripple's case against the United States financial watchdog comes “to a close,” it is only the beginning of the battle for many others in the crypto industry, emphasizing that the fight for clarity “has to continue.’</p><p>Following a lengthy back and forth between Ripple and the United States Securities and Exchange Commission (SEC), the Hinman documents were finally unsealed on June 13.</p><p>Garlinghouse has long argued for the unsealing of these documents,which pertain to the 2018 speech delivered by Hinman stating that Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is not a security. Garlinghouse believed could bolster his argument that Ripple’s token, XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP)</a>, is not a security too.</p><p>In a recent video published to Twitter on June 17, Garlinghouse stated the unsealing of the Hinman documents show that the SEC “knowingly created confusion about the rules, and they used that confusion through enforcement.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Trying something new – some thoughts from me on the events (specifically the release of the Hinman documents) of this week. For me, this has all had a personal bent to it - and felt like it warranted some personal comments. <a href=\"https://t.co/k4dYeQGhsN\">pic.twitter.com/k4dYeQGhsN</a></p>&mdash; Brad Garlinghouse (@bgarlinghouse) <a href=\"https://twitter.com/bgarlinghouse/status/1669805367688331267?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He argued that this is the “definition of putting politics over people […] and the pursuit of power over sound policy.”</p><p>Garlinghouse stated that the SEC acted in \"bad faith, plain and simple,\" and reiterated that the timing of the lawsuit being initially filed <a href=\"https://cointelegraph.com/news/ripple-xrp-lawyer-outright-sec-victory-three-percent\">in December 2020</a>, just days before Christmas, as a “very grinch-like touch.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-welcomes-europe-mica-regulation\"><strong><em>Ripple welcomes MiCA regulation as US lawsuit highlights lack of clarity</em></strong></a></p><p>He declared that during all his meetings with the SEC he answered, “every question [the SEC] had, and not once did they suggest to me that XRP was a security.”</p><p>Garlinghouse argued that the Hinman speech itself isn’t about “any one token or any one blockchain,” but more so the “relentless” enforcement action by the SEC.</p><blockquote>“This is about showing the extent to which the SEC has relentlessly enforced action against crypto players, while professing fake open arms and calls to come in and register, all the while lying about their so-called guidance.”</blockquote><p>Garlinghouse further explained that “at best” the documents show that senior officials at the SEC “couldn't agree” on the law and told Bill Hinman directly that “he would confuse the public even more about the rules for crypto.”</p><p>Cointelegraph reported on June 13 that notes in the revealed documents suggested that the editors were <a href=\"https://cointelegraph.com/news/hinman-docs-unsealed-sec-concerned-over-ether-not-security-statement\">concerned that Hinman</a> stating Ether is not a security, may make it “difficult for the agency to take a different position on Ether in the future.”</p><p>However, Garlinghouse noted that “at worst” the documents showed that Hinman “deliberately ignored the law” and tried to “create new laws,” emphasizing that only Congress has power to do that.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\"><strong><em>Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11-17</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]