[
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T08:53:15.000Z",
    "title": "Binance to offer crypto broker-dealer services in Dubai with new license",
    "url": "https://cointelegraph.com/news/binance-wins-operational-crypto-license-in-dubai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a5a349c2-a520-4e48-972a-ad52626c7f91.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance is now officially allowed to offer crypto services to institutional and qualified retail investors in Dubai.</p>\n                    <p><p>Major cryptocurrency exchange Binance has reached another milestone in relationships with regulators in the United Arab Emirates by winning a new license in Dubai.</p><p>Binance’s Dubai-based subsidiary, Binance FZE, has obtained the Operational Minimum Viable Product (MVP) license from Dubai's Virtual Asset Regulatory Authority (VARA), the firm <a href=\"https://www.binance.com/en/blog/ecosystem/binance-is-the-first-virtual-asset-exchange-to-receive-an-operational-mvp-license-in-dubai-7342057061995039467?ref=AZTKZ9XS&amp;utm_source=BinanceTwitter&amp;utm_medium=GlobalSocial&amp;utm_campaign=GlobalSocial\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on July 31.</p><p>The new license officially allows Binance to operate two activities, including cryptocurrency exchange services and virtual asset broker-dealer services.</p><p>The services enabled by the license are currently limited to institutional and qualified retail investors in Dubai, Binance noted. Eligible investors in Dubai will now be able to access authorized services like crypto-to-fiat exchange compliant with the intergovernmental Financial Action Task Force (FATF).</p><p>“Institutions and residents that qualify to use the services provided by the Operational MVP License in Dubai can do so knowing they’re under investor protection and market assurance standards tailored specifically for the virtual asset sector,” Binance said in the announcement.</p><p>Operating within Dubai’s regulated ecosystem, Binance is committed to ensuring secure and seamless customer migration in compliance with Know-Your-Customer requirements, Binance’s head of regional markets Richard Teng said. He added: </p><blockquote>“Our priority is to be able to operate this first fully regulated exchange in, and from Dubai, in a FATF-compliant ecosystem, setting the stage for global scalability with uncompromised user assurance.”</blockquote><p>Binance’s latest regulatory milestone builds upon the progression from the provisional MVP license, <a href=\"https://www.bloomberg.com/news/articles/2022-03-14/binance-wins-exchange-s-first-gulf-crypto-license-from-bahrain\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> by VARA in March 2022. Binance also <a href=\"https://cointelegraph.com/news/binance-receives-green-light-for-crypto-services-in-dubai\">obtained a preparatory MVP license</a> in September 2022.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uae-emerges-as-a-pro-bitcoin-mining-destination-in-the-middle-east\"><strong><em>UAE emerges as a pro-Bitcoin mining destination in the Middle East</em></strong></a></p><p>Some crypto exchanges previously reported that the preparatory <a href=\"https://cointelegraph.com/news/bybit-mvp-license-in-dubai-very-restricted-ceo-says\">MVP license offers limited capabilities</a>. The license only allows exchanges to service a “very restricted set of accredited investors,” Bybit CEO Ben Zhou told Cointelegraph in June.</p><p>Binance did not immediately respond to Cointelegraph’s request for comment.</p><p>The news comes soon after VARA in mid-July <a href=\"https://cointelegraph.com/news/dubai-vara-suspends-bitoasis-exchange-license\">suspended the operational license of crypto exchanger BitOasis</a> for not meeting mandated conditions within the timeframes set out by the authority. The firm subsequently said it was working with VARA on “fulfilling the remaining conditions.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-31T08:58:04.000Z",
    "title": "$BTC: Galaxy Digital CEO Says CEO of World’s Largest Asset Manager Got ‘Orange-Pilled’",
    "url": "https://www.cryptoglobe.com/latest/2023/07/btc-galaxy-digital-ceo-says-ceo-of-worlds-largest-asset-manager-got-orange-pilled/",
    "description": "In the world of cryptocurrency, being “orange-pilled” means transforming from a crypto skeptic into a believer, particularly in Bitcoin. This term is now being used to describe Larry Fink, the CEO of BlackRock Inc., the world’s largest asset manager, by none other than Mike Novogratz, a prominent figure in the crypto world. Bitcoin’s resurgence in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T08:57:00.000Z",
    "title": "Arkham Bounty Discovers $160 Million In Alleged Terra Wallets",
    "url": "https://cryptodaily.co.uk/2023/07/arkham-bounty-discovers-160-million-in-alleged-terra-wallets",
    "description": "<p>Controversial Arkham Intel Exchange&rsquo;s first bounty has unearthed evidence of undisclosed wallets containing $160 million worth of digital assets tied to Do Kwon and Terraform Labs.&nbsp;</p>\n<p>Terra had previously claimed that it had exhausted all of its reserves in an attempt to defend the UST stablecoin peg.&nbsp;</p>\nUndisclosed Terra Wallets?&nbsp;\n<p>Two anonymous on-chain investigators have earned Arkham Intel&rsquo;s inaugural bounty after providing considerable evidence of undisclosed wallets holding more than $160 million worth of digital assets tied to Terraform Labs and its founder, Do Kwon. This effort allowed the investigators, including one who describes himself as a &ldquo;glorified accountant,&rdquo; to win the bounty of ARKM tokens worth around $5000.&nbsp;</p>\n<p>The wallets in question contain over 5200 BTC. This figure contradicts Luna Foundation Guard&rsquo;s previous claims of being in possession of only 313 BTC. The foundation had, back in May 2022, stated on Twitter,&nbsp;</p>\n\n<p>&ldquo;As of now, the Foundation&rsquo;s remaining reserves consist of the following assets: &middot; 313 $BTC &middot; 39,914 $BNB &middot; 1,973,554 $AVAX &middot; 1,847,079,725 $UST &middot; 222,713,007 $LUNA (of which 221,021,746 is currently staked with validators).&rdquo;</p>\n\n<p>The revelations made by Arkham&rsquo;s bounty hunters could have significant repercussions for Do Kwon. The Luna Foundation Guard&rsquo;s primary mission was to maintain the dollar peg of its algorithmic stablecoin, TerraUSD (UST). The foundation relied on its reserves of Bitcoin to maintain this peg by purchasing UST from the markets as a final line of defense against UST de-pegging. However, despite its efforts, both UST and LUNA collapsed in May 2022, wiping around $40 billion in value from the markets.&nbsp;</p>\nMore Insights Expected&nbsp;\n<p>Arkham Intel expects more insights related to the wallets in question to emerge over the next few months. However, the issuer of the bounty, in this case, Arkham, maintains exclusive rights to the information unearthed for a period of 90 days. The Terra collapse is often described as one of the most crippling events in the crypto space, triggering chaos in the markets and wiping billions in investor wealth.&nbsp;</p>\n<p>Terra founder Do Kwon had been on the run since the collapse but was recently apprehended in Montenegro on charges of traveling using forged documents. The arrest came after the United States Securities and Exchange Commission had accused Do Kwon and Terraform Labs of orchestrating a multi-billion dollar fraud.&nbsp;</p>\nArkham Intel Exchange And Privacy Concerns&nbsp;\n<p>The Arkham Intel Exchange is hugely controversial, acting as a marketplace facilitating the trading of on-chain data. Despite the bounty, the platform has sparked considerable debate in crypto circles. Critics have flagged concerns about the potential misuse of private information by bad actors and have suggested that the platform could also facilitate the inadvertent creation of a surveillance marketplace.&nbsp;</p>\n<p>However, platform supporters have countered this argument, arguing that such a platform is necessary for unmasking bad actors in the crypto space and giving whistleblowers a secure avenue to disclose crucial information. Arkham Intel CEO Miguel Morel has called for a nuanced approach to the subject, stating,&nbsp;</p>\n\n<p>&ldquo;You need to think [...] very carefully about what sort of information should be allowed on versus not.&rdquo;&nbsp;</p>\n\n<p>The platform, launched on the 10th of July, has been described by critics as a glorified snitching service, with concerns that it could dox innocent users. Platform users can place bounties for information related to specific blockchain transactions, which would then be made available after a period of 90 days.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T09:04:33.000Z",
    "title": "Binance secures Dubai’s MVP operational license",
    "url": "https://crypto.news/binance-secures-dubais-mvp-operational-license/",
    "description": "Binance has received an MVP operational license from Dubai regulators, enabling it to serve institutional and qualified retail investors.  Binance FZE, a subsidiary of Binance, has obtained an operational Minimum Viable Product (MVP) license from Dubai&#8217;s crypto regulator, the Virtual&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T08:46:20.000Z",
    "title": "Elon Musk Reveals 22-Year Plan to Transform X into World’s Most Valuable Financial Institution – Is Integration of Bitcoin, Dogecoin, XRP, and Ethereum Part of The Plan?",
    "url": "https://www.crypto-news-flash.com/elon-musk-reveals-22-year-plan-to-transform-x-into-worlds-most-valuable-financial-institution-is-integration-of-bitcoin-dogecoin-xrp-and-ethereum-part-of-the-plan/?utm_source=rss&utm_medium=rss&utm_campaign=elon-musk-reveals-22-year-plan-to-transform-x-into-worlds-most-valuable-financial-institution-is-integration-of-bitcoin-dogecoin-xrp-and-ethereum-part-of-the-plan",
    "description": "<img width=\"2560\" height=\"1463\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-300x171.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-1024x585.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-768x439.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-1536x878.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-6363104-2048x1170.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Elon Musk is set to transform Twitter into a comprehensive platform for payments and financial services. Cryptocurrencies like Bitcoin, Dogecoin, XRP, and Ethereum may be integrated into this ambitious plan. Similar to the report, Elon Musk&#8217;s audacious plan to reshape Twitter into the comprehensive platform &#8220;X&#8221; seems set to revolutionize the world of financial services [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T08:40:43.000Z",
    "title": "Fubon Bank and Ripple Join Forces to Pilot Real Estate Tokenization in Hong Kong, Leveraging Ripple’s CBDC Platform for Digital Hong Kong Dollar Loans",
    "url": "https://www.crypto-news-flash.com/fubon-bank-and-ripple-join-forces-to-pilot-real-estate-tokenization-in-hong-kong-leveraging-ripples-cbdc-platform-for-digital-hong-kong-dollar-loans/?utm_source=rss&utm_medium=rss&utm_campaign=fubon-bank-and-ripple-join-forces-to-pilot-real-estate-tokenization-in-hong-kong-leveraging-ripples-cbdc-platform-for-digital-hong-kong-dollar-loans",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Fubon Bank collaborates with Ripple for real estate tokenization initiative.  Blockchain could save $10B in cross-border payments by 2030. Fubon Bank, a Hong Kong-based financial institution, has announced its collaboration with Ripple, a US fintech company, to launch a real estate tokenization initiative. Scheduled for the third quarter, this project aims to harness blockchain technology&#8217;s [...]"
  }
]