[
  {
    "source": "CoinDesk",
    "date": "2023-12-18T07:31:07.000Z",
    "title": "BONK's Surge Send Prices of Solana Saga Phone Flying to $2K",
    "url": "https://www.coindesk.com/business/2023/12/18/bonks-surge-send-prices-of-solana-saga-phone-flying-to-2k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The sealed and unopened phone boxes contain an airdrop of 30 million bonk (BONK) tokens, which has seemingly revived dismal Saga sales."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-18T07:30:30.000Z",
    "title": "US Ambassador to Argentina Hails Bitcoin Miner’s ‘Genius’ Flared Gas Power Generation Plans",
    "url": "https://news.bitcoin.com/us-ambassador-to-argentina-hails-bitcoin-miners-genius-flared-gas-power-generation-plans/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Ambassador to Argentina Hails Bitcoin Miner&#039;s &#039;Genius&#039; Flared Gas Power Generation Plans\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/artsldll.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Ambassador to Argentina, Marc R. Stanley, has lauded Unblock Computing&#8217;s bitcoin mining initiative for its innovative use of flared gas in generating electricity. Ambassador Stanley commended the plan for its dual benefits: aiding Argentina in achieving its climate objectives and promoting energy conservation. Argentina&#8217;s Climate Goals The United States Ambassador to Argentina, Embajador [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T07:35:33.000Z",
    "title": "Blockchain-powered private loans jump by over 55% to $581m in 2023",
    "url": "https://crypto.news/blockchain-powered-private-loans-jump-by-over-55-to-581m-in-2023/",
    "description": "Blockchain-based private credit is gaining traction in 2023 as companies seek financing in a high-interest-rate environment. According to data from RWA.xyz, blockchain-powered private loans have surged by 55%, reaching approximately $581.6 million as of Dec. 18. While this figure is&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T07:32:31.000Z",
    "title": "HNT surges 19%, price cooldown expected",
    "url": "https://crypto.news/hnt-surges-19-price-cooldown-expected/",
    "description": "Helium (HNT) has emerged as the top gainer among the top 100 cryptocurrencies while a key indicator suggests a price cooldown. HNT is up by 19% in the past 24 hours and is trading at $8.14 at the time of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T07:38:48.000Z",
    "title": "Internet Computer Loses Grip On $10, But Still Inks 82% Rally – Details",
    "url": "https://www.newsbtc.com/news/internet-computer-loses-grip-on-10-but-still-inks-82-rally-details/",
    "description": "Internet Computer (ICP) is seeing bullish activity despite the current bearish atmosphere. As of press time, ICP, its native token, has lost its hold on the crucial $10 handle, and currently trading at $9.93, following a weekly rise of more than 80%. ICP surged by 30% over the weekend and peaked at $11.50 earlier. It has now broken into the top 20 cryptocurrencies by market capitalization. In the same time frame, the token&#8217;s trade volume increased by 73% to $730 million. ICP up over 80% in the last week. Source: Coingeko Internet Computer, The Weekly Top Performer  With six straight green candles in the daily time frame, Internet Computer distinguished itself as the biggest gainer of the week, defying the current market volatility. Its price increased by around 120% from the low of $5.20 on December 12th to a new yearly high of $11.30. The price of the coin has broken through some significant resistances during this rise, giving buyers a chance to extend the rebound. Related Reading: Shiba Inu Just Spiked 12% Overnight – What’s The Next Move? When it comes to blockchain technology, Internet Computer is among the largest and most distinctive networks. The network, which debuted in 2021, has all the functionality developers require to create decentralized apps (dApps). Its abundance of functionality sets it apart from other layer 1 and layer 2 networks such as Ethereum, Polygon, and Cardano. Users can use its infrastructure to create and host their applications. ICP market cap currently at $4.3 billion. Chart: TradingView.com ICP&#8217;s price has increased as a result of its support for Bitcoin, the largest cryptocurrency globally. Because of this connection, its canister smart contracts are able to send, receive, and retain Bitcoin on the network. Stated differently, these canisters are functionally equivalent to other Bitcoin holders on the BTC network. Related Reading: Osmosis Rally Intensifies With 77% Increase – Will OSMO Hit $2 This Month? This means that Bitcoin smart contract functions such as decentralized swaps and trading can be handled by Internet computers. Additionally, it has ckBTC, which has a 1:1 Bitcoin backing. ICP seven-day price action. Source: Coingecko Bollinger bands on the Internet Compter are shifting, indicating high levels of price volatility. In the overbought area, the Relative Strength Index (RSI) is above the average line, indicating bull dominance in the price of Internet computers. Key Partnerships Meanwhile, the team&#8217;s announcement of a collaboration between Internet Computer, Gaudi Knowledge, and Moon Labs is among the most notable developments in light of the recent spike in the company&#8217;s valuation. Thrilled to announce the Strategic Partnership with Gaudi Knowledge Association (@gaudiknowledge) and The Moon Labs (@LeisureMeta_LM). @ICPhubkorea will be the main partner for the Web3 project between Gaudi Knowledge Association and The Moon Labs. We are revealing the… pic.twitter.com/iTuzb4oGgb — ICP.Hub Korea (@ICPhubkorea) December 13, 2023 By teaming up with the Internet Computer Project&#8217;s South Korean affiliate, the two organizations would &#8220;Recreate Gaudi’s architecture, arts, and incomplete architectural blueprints in the Metaverse on ICP.&#8221; There is no evidence of weakening in the price behavior and a strong likelihood of a rally with the notable increase in volume. In the event that the ICP price sustains itself above the $9.5 barrier, purchasers may pursue the next possible goals, which are $11.50 to $14.50. The 50-day and 100-day moving averages are supporting ICP. According to some observers, the coin is about to form a bullish flag and then pick up speed again. It has already shaped this flag pattern&#8217;s pole. Internet Computer is probably going to test the weekend high of $11.90 if this occurs. Featured image from Uropong/Getty Images"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T07:25:44.000Z",
    "title": "Terra Luna Classic: A 310% Surge, a Bearish Pullback – What Lies Ahead?",
    "url": "https://www.crypto-news-flash.com/terra-luna-classic-a-310-surge-a-bearish-pullback-what-lies-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-classic-a-310-surge-a-bearish-pullback-what-lies-ahead",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra Luna\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />In less than two weeks, Terra Classic (LUNC) surged by over 300% as one of the best performers in the top-cap market, but it has since lost its momentum and started retracing. Despite the dip, LUNC trades 110% higher than it did a month ago, but technical indicators like the Moving Average Convergence Divergence have [...]"
  }
]