[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T09:40:48.000Z",
    "title": "Japan’s Crypto Exchanges Push for 10 Times Leverage on Margin Trading: Bloomberg",
    "url": "https://www.coindesk.com/markets/2023/06/20/japans-crypto-exchanges-push-for-10-times-leverage-on-margin-trading-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The push for revised margin trading caps aims to attract diverse traders, including institutional investors, while enhancing market liquidity."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T09:57:25.000Z",
    "title": "Bitcoin price ‘sideways boredom’ may last 18 months — New research",
    "url": "https://cointelegraph.com/news/bitcoin-price-boredom-18-months-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f81e2179-f9c3-4dfb-a3b8-449855b8254e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price cycles suggest that an “arduous road” lies ahead for patient Bitcoin hodlers.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) faces up to one-and-a-half years of “boredom” as the bull market gathers steam, a new prediction says.</p><p>In the latest edition of its weekly newsletter, “<a href=\"https://insights.glassnode.com/the-week-onchain-week-25-2023/\" target=\"_blank\" rel=\"noopener nofollow\">The Week On-Chain</a>,” analytics firm Glassnode predicted an “arduous” period for BTC hodlers next.</p><h2>Glassnode: Bitcoin hodlers set for 12 months' \"gradual accumulation\"</h2><p>Thanks to gaining 70% in Q1 this year but then struggling to hold its ground, Bitcoin is dividing opinion when it comes to future price action.</p><p>With the 2024 <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">block subsidy halving</a> in sight, some believe that a dramatic uptick will characterize the coming year, while others believe that it will take longer — perhaps until 2025 — for a new all-time high to hit.</p><p>For Glassnode, there are signs that a classic pre-bull market phase is playing out, but long-term holders will still need considerable patience.</p><p>Investigating the “liveliness” of the BTC supply, which it describes as “the propensity of Bitcoin holders to spend or hold their coins,” researchers revealed mass accumulation.</p><p>“Currently, Liveliness is in a multi-year macro downtrend, having peaked in May 2021 when bear market first set in. We can see a similar structure has formed to the 2018-20 cycle, as coins slowly but surely migrate into cold storage and are removed from the market by the HODLer cohort,” they explained.</p><blockquote>“These HODLers are currently accumulating coins at a rate of around 42.2K BTC/month, suggesting that the price insensitive class are absorbing a non-trivial portion of the currently available supply. If we compare this behavior to prior cycles, we can see that this regime of steady and gradual accumulation commenced just over 2-years ago, and suggests that another 6 to 12-months may be ahead of us.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6f9f2769-4f6c-4380-b32d-21a6bb8e7584.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Hodler Net Position Change annotated chart (screenshot). Source: Glassnode</em></figcaption></figure><p>They added that decreasing exchange balances likewise points to the supply becoming increasingly illiquid — out of reach in private cold storage and not for sale.</p><h2>Bitcoin wealth transfer \"uninterrupted\"</h2><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/btc-price-may-need-a-24-4k-dip-as-bitcoin-speculators-stay-in-profit\">reported</a>, the more speculative end of the hodler base — so-called short-term holders — is also in focus currently.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Most ‘fear’ in 3 months as $26.4K becomes key — 5 things to know in Bitcoin this week</a></em></strong></p><p>These investors have hodled coins for a maximum of 155 days, and their aggregate cost basis — around $26,400 — is on the radar as a short-timeframe support zone. </p><p>Continuing, Glassnode noted that based on wallet entity size, not everyone is in accumulation mode, with whales — the largest-volume cohorts — currently “net distributors.”</p><p>“Overall, the market appears to be in a period of quiet accumulation, which suggests an undercurrent of demand, despite the regulatory headwinds of late,” it stated, referring to recent United States <a href=\"https://cointelegraph.com/news/lawmakers-vs-the-sec-vs-binance-law-decoded-june-12-19\">regulatory pressures</a> impacting major exchanges.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b0519ff4-2b8b-4146-a8f3-b7820922a47d.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin supply absorption rates chart (screenshot). Source: Glassnode</em></figcaption></figure><p>For a seismic trend shift to occur, however, researchers believe that it will take another halving to come and go.</p><p>“Across most measures of market energy, digital asset markets are displaying excitement in few of them. Volatility, volumes, and realized value are all at multi-year lows, as liquidity and excitement give way to investor apathy,” they concluded. </p><blockquote>“However beneath the surface, the classic pattern of wealth transfer towards the price insensitive HODLer cohort remains uninterrupted. If past cycles are any guide, it it suggests that a period of apathetic sideways boredom may well define the road ahead, potentially lasting between 8 to 18-months in duration.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3e932d4b-6ef0-4236-8867-d3cf84b398e7.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin pre-halving price performance comparison (screenshot). Source: Glassnode</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\">Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T09:45:43.000Z",
    "title": "Binance confirms Bitcoin Lightning Network integration in the works",
    "url": "https://cryptoslate.com/binance-confirms-bitcoin-lightning-network-integration-in-the-works/",
    "description": "<p>Cryptocurrency exchange Binance confirmed it was working to integrate the Bitcoin (BTC) Lightning Network (LN) for deposits and withdrawals activities on its platform, according to a June 20 tweet. Binance will join Bitfinex, Kraken, and OKX as one of the largest trading exchanges to integrate Lightning, according to a GitHub repository by LN advocate David [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-confirms-bitcoin-lightning-network-integration-in-the-works/\">Binance confirms Bitcoin Lightning Network integration in the works</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T09:56:00.000Z",
    "title": "Bitcoin Reclaims 50% Market Dominance Following BlackRock ETF",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-reclaims-50-market-dominance-following-blackrock-etf",
    "description": "<p>Bitcoin&rsquo;s market dominance has again breached the 50% mark after two years following the filing of the BlackRock ETF.&nbsp;</p>\n<p>This marks the first time since 2021 when China announced a complete ban on crypto mining and Tesla distanced itself from the asset that the dominance metric has risen above 50%.&nbsp;</p>\nRecapturing Its Throne&nbsp;\n<p>Bitcoin dominance is the measure used to determine how much Bitcoin makes up the total crypto market capitalization. The dominance crossed the 50% mark on the 6th of June, 2023, and then settled slightly lower at $49.9%, according to data sourced from TradingView. At present, Bitcoin dominance is back above the 50% mark, hovering at around 50.5%. This means that Bitcoin now accounts for half of the total $1.1 trillion market capitalization of the cryptocurrency market. Out of this, Bitcoin&rsquo;s currency market capitalization is around $520 billion, according to data from Coingecko.&nbsp;</p>\n<p>Bitcoin&rsquo;s market dominance has surged by over 10% since the 27th of November 2022. This increase has primarily been driven by investors looking at Bitcoin as a safe haven for their investments following the dramatic collapse of the Sam Bankman-Fried-led FTX exchange and growing regulatory scrutiny of altcoins in the United States of America. Bitcoin was last near the 50% mark in June 2022, after which the crypto markets saw a significant drop thanks to dogged and persistently high inflation in the US. This high inflation led the Federal Reserve to take aggressive steps to contain it.&nbsp;</p>\n<p>However, Bitcoin&rsquo;s dominance metric has come under some criticism for under-representing Bitcoin&rsquo;s actual market share by also including stablecoins in its calculations. But, this year has also seen the stablecoin markets struggle, with the Securities and Exchange Commission ordering Paxos to shutter its BUSD in February. This move erased billions from circulation.&nbsp;</p>\nEthereum Holds Steady&nbsp;\n<p>While Bitcoin had dropped significantly in 2022, Ethereum had seen an even more significant drop, with the ETH/BTC pair dropping to a ratio of only 0.05%. However, with Bitcoin&rsquo;s market dominance on the upswing, Ethereum (ETH) has held its position quite steady and has been around the 20% mark for the better part of a year. At present, the combined value of Bitcoin (BTC) and Ethereum (ETH) make up around 70% of the entire crypto market.</p>\nBitcoin Dominance To Grow?&nbsp;\n<p>Some, such as MicroStrategy co-founder Michael Saylor, believe that Bitcoin&rsquo;s market dominance will continue to grow, eventually reaching 80% of the total market in the next few years. According to Saylor, increasing regulatory scrutiny and pressure from the United States Securities and Exchange Commission would eventually cause a majority of other market assets to &ldquo;go away.&rdquo;&nbsp;</p>\n\n<p>&ldquo;Regulatory clarity is going to drive #Bitcoin adoption by eliminating the confusion &amp; anxiety that has been holding back institutional investors. Bitcoin dominance will continue to grow as the #Crypto industry rationalizes around $BTC and goes mainstream. The entire industry is destined to be rationalized down to a Bitcoin-focused industry, with maybe half a dozen to a dozen other Proof of Work tokens.&rdquo;&nbsp;</p>\n\n<p>Saylor also blamed the lack of any institutional money making its way to the crypto markets on the confusion and anxiety created by the thousands of other cryptocurrencies that have positioned themselves as an alternative to the world&rsquo;s largest cryptocurrency. He also pointed out that Bitcoin is the only cryptocurrency that Securities and Exchange Commission Chair Gary Gensler has called a commodity.&nbsp;</p>\n\n<p>&ldquo;Bitcoin is the universally, globally-acknowledged digital commodity in this industry.&rdquo;</p>\n\n<p>Despite the fear and uncertainty prevailing in the markets, Bitcoin&rsquo;s value has grown over 3% over the past week. Currently, Bitcoin is trading at $26,768, according to data from Coingecko.&nbsp;</p>\nThe BlackRock Exchange Traded Fund (ETF)\n<p>One of the major drivers of Bitcoin&rsquo;s price and dominance in recent days is BlackRock announcing that it is filing for a Bitcoin Spot Exchange Traded Fund (ETF), according to crypto research firm Santiment. Investors are quietly confident that the ETF may receive approval from the Securities and Exchange Commission. According to a filing by the Nasdaq stock exchange with the SEC, Coinbase Custody Trust Company would be the custodian of the fund&rsquo;s Bitcoin holdings, while the Bank of New York Mellon would custody the fund&rsquo;s fiat currency.&nbsp;</p>\n<p>However, some have also raised concerns about the Bitcoin Spot Exchange Traded Fund after details hidden in the filing shed light on what BlackRock could potentially do in the event of a Bitcoin hard fork. According to the ETF filing, in the event of a hard fork, BlackRock would get to decide which fork to go with, effectively deciding on the future of Bitcoin.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T10:00:44.000Z",
    "title": "Argentina Settled Almost 20% of Its Imports in April and May Using the Chinese Yuan",
    "url": "https://news.bitcoin.com/argentina-settled-almost-20-of-its-imports-in-april-and-may-using-the-chinese-yuan/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Argentina Financed Almost 20% of its imports in April and May In Chinese yuan\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1716781834.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The government of Argentina has noted that 19% of all imports authorized in the national system were settled using the Chinese yuan in April and May. $2.72 billion in Chinese yuan were approved to complete these payments, taking advantage of the Chinese swap line to preserve the dollar reserves of the country, according to Commerce [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T10:04:04.000Z",
    "title": "Survey: banks’ users share crypto investment goals and fears",
    "url": "https://crypto.news/survey-banks-users-share-crypto-investment-goals-and-fears/",
    "description": "Banking system users share their experience and expectations around crypto investments in a survey taken by Choise.com among its one million users. According to the Hackernoon report, roughly 26% of banking users are ready to invest $100 per month into&#8230;"
  }
]