[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T19:42:37.000Z",
    "title": "Evertas expands crypto insurance offerings to include mining and raises limits",
    "url": "https://cointelegraph.com/news/evertas-expands-crypto-insurance-offerings-to-include-mining-and-raises-limits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b7a3b01f-c0f4-486b-b62a-4e5d9f8ba2de.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto insurance underwriter Evertas will increase coverage limits to $420 million per policy while adding additional mining coverage. </p>\n                    <p><p>Evertas, an insurance company focused on digital assets, recently announced an increase in coverage limits and the addition of mining operations to its coverage portfolio.</p><p>The insurer’s per-policy coverage limits on custodial cryptoassets will increase to $420 million, “nearly tripling the amount of risk transfer previously available to blockchain focused projects,\" <a href=\"https://www.globenewswire.com/news-release/2023/06/02/2681338/0/en/Leading-Crypto-Insurance-Company-Evertas-Expands-Per-Policy-Limit-to-420-Million.html\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an announcement. </p><p>It’s also adding coverage for mining operations in the amount of up to $200 million per policy. According to Evertas, these are the highest coverage limits available. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-insurance-difficult-users-platforms\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-insurance-difficult-users-platforms/amp\"><strong><em>Turns out, it’s pretty difficult to insure crypto users and platforms</em></strong></a></p><p>The policy expansions come just six months after the company raised $14 million in a series A funding round led by Polychain Capital. Reportedly, this brings the firm’s total outside funding to $19.8 million when accounting for its initial seed funding of $5.8 million. </p><p>Evertas, a Chicago-based company, is one of only a handful of insurers focused on cryptocurrency and digital assets and, <a href=\"https://www.royalgazette.com/re-insurance/business/article/20220203/evertas-gets-lloyds-coverholder-status/\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a>, the only given official coverholder status by Lloyd’s of London. </p><p>While most cryptocurrency exchanges cover losses to some degree, there are numerous situations where an account holder could lose access to their assets that can’t be tracked through account or on-chain activity.</p><p>Per an <a href=\"https://www.investopedia.com/crypto-insurance-5441920#citation-8\" target=\"_blank\" rel=\"noopener nofollow\">article</a> on Investopedia:</p><blockquote>“Exchanges such as Binance and Coinbase claim to insure the digital funds of investors who are victims of theft. But that won't help you if you're forced to give up your passwords and credentials in an extortion scheme.”</blockquote><p>The same article mentions that many insurers don’t provide comprehensive coverage, thus forcing customers to mix and match policies. </p><p>According to Evertas, their new policy limits are meant to ease this consumer pain point. The firm’s announcement says its policies now provide greater scalability and speed making it “now possible to get a full, high-limit underwriting from a single source.”</p><p>The cryptocurrency insurance space is relatively new when compared to more traditional sectors such as home and life insurance. According to experts, less than one percent of all cryptocurrency assets are insured through traditionally-underwritten policies. This represents a significant amount of exposure, especially when considering the global cryptocurrency market is <a href=\"https://cointelegraph.com/news/crypto-insurance-market-expands-with-decentralized-and-centralized-options\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-insurance-market-expands-with-decentralized-and-centralized-options/amp\">expected to grow significantly by 2030</a>. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T19:42:00.000Z",
    "title": "Russia’s Rosbank starts offering cross-border crypto payments despite nationwide ban",
    "url": "https://cryptoslate.com/russias-rosbank-starts-offering-cross-border-crypto-payments-despite-nationwide-ban/",
    "description": "<p>Rosbank, one of the Russian Federation&#8217;s most important financial institutions, is set to become the first major bank to offer cross-border transactions in cryptocurrency, according to reporting from the Russian business journal Vedomosti. The bank emphasized that these transactions are in strict compliance with existing legislative requirements, the Central Bank&#8217;s guidelines, and the bank&#8217;s own [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/russias-rosbank-starts-offering-cross-border-crypto-payments-despite-nationwide-ban/\">Russia&#8217;s Rosbank starts offering cross-border crypto payments despite nationwide ban</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T19:52:53.000Z",
    "title": "OvalPixel Launches Groundbreaking Play-to-Earn OPAIG AI Game Token",
    "url": "https://cryptodaily.co.uk/2023/06/ovalpixel-launches-groundbreaking-play-to-earn-opaig-ai-game-token",
    "description": "<p>Los Angeles, USA, June 2nd, 2023, Chainwire</p><p>OvalPixel announced the launch of its groundbreaking blockchain-powered artificial intelligence (AI) trivia game that pays players in crypto tokens.&nbsp;</p><p>The OvalPixel AI game token with symbol $OPAIG allows players of all ages and experience levels, from gamers to grandmas, to earn OPAIG utility tokens by correctly answering trivia/quiz questions generated in real time by OvalPixel&rsquo;s innovative AI system.</p><p>We live in an age of constant connectivity and information at our fingertips. But one thing has been missing&mdash;until now. OPAIG is the first play-to-earn game that harnesses the power of AI, blockchain technology and crypto to revolutionize how people play and interact.&nbsp;</p><p>Players can then exchange their OPAIG tokens for real money through the Banana Crystal Payments platform or use them in-game to buy exciting 3D NFT trophies from the FlatPyramid 3D Model Marketplace.</p><p>To enable mainstream audience access, OvalPixel has partnered with Banana Crystal Payments. This allows anyone to play OPAIG and earn tokens which they can simply convert to USDT digital dollars. No complex crypto knowledge is needed.</p><p>OvalPixel will institute a continuous buyback and burn mechanism to increase the value of OPAIG tokens over time. In addition to buying back and burning OPAIG tokens, OvalPixel will also buy back redeemed tokens and reintroduce them into the rewards pool. Thus, preventing the need to mint additional tokens and inflating the supply, and helping with the preservation of OPAIG&rsquo;s value.</p><p>This means that early adopters stand to gain the most as supply decreases and demand rises.&nbsp;The company will also airdrop free OPAIG tokens to early adopters and players.&nbsp;</p><p>&ldquo;We believe OPAIG represents the future of gaming, AI and blockchain technology,&rdquo; said OvalPixel CEO George Egbuonu. &ldquo;For the first time, we have created a seamless experience that fuses these revolutionary technologies in an accessible way for the masses. Players of all backgrounds can now enjoy the benefits of crypto and be rewarded for expanding their knowledge.&rdquo;&nbsp;</p><p>The OPAIG game is available now for play on the OvalPixel website. OvalPixel aims to onboard&nbsp;millions of active players in the first year and demonstrate how blockchain and AI can go mainstream. The revolution starts today at OvalPixel with the fusion of AI, blockchain technology and crypto. Users can play to earn and get paid in crypto.</p><p>OPAIG token is now trading on the Uniswap Polygon chain (Trading Pair: $OPAIG - $MATIC). Users can take part in the revolution and play to earn real crypto rewards.</p><p></p><p>About OvalPixel&nbsp;</p><p>OvalPixel provides a Play to Earn Blockchain-Powered AI Trivia &amp; Quiz Game. The AI game generates new trivia multiple choice questions and answers on any topic on-demand so players are always challenged and expanding their knowledge. Players can play with ease and win OPAIG utility tokens and redeem them for digital dollars through the Banana Crystal payment platform.</p><p>Visit: https://ovalpixel.com/</p><p></p><p>About Banana Crystal Payments</p><p>Banana Crystal is the leading peer-to-peer payment provider enabling user-friendly web3 payment technology. It provides onramp and offramp crypto-fiat and vice versa solutions as the official payment network for AI and Gaming Applications. It is the only payment network that works anywhere and everywhere in the world and its users are able to send and receive payments for FREE.&nbsp;</p><p>Visit: https://www.bananacrystal.com/</p>ContactOvalPixel AI Trivia Game | Play2Earn $OPAIG TokensOvalPixelinfo@ovalpixel.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T19:54:24.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T19:48:28.000Z",
    "title": "Arthur Hayes thinks a crypto bull market is coming",
    "url": "https://crypto.news/arthur-hayes-thinks-a-crypto-bull-market-is-coming/",
    "description": "Arthur Hayes, the Co-Founder &#038; CIO of the cryptocurrency and derivative trading platform BitMEX, suggests \"Patience is Beautiful\" in an essay dated June 1, 2023."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T20:00:59.000Z",
    "title": "Bitcoin Is Becoming Greener At An Unexpected Pace, Good For BTC Price?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-greener-unexpected-pace-good-btc-price/",
    "description": "Bitcoin, the world’s most valuable cryptocurrency, is going green, and the pace at which the network has reduced its carbon emissions in the past three years has been noted by climate activists. Nonetheless, how this could impact BTC prices and attract technology firms like Tesla, the electric automobile manufacturer, is yet to be seen. Carbon Emission Associated With Bitcoin Miners Rapidly Falling As of late May, on-chain data from Woonomic shared by Daniel Batten, a climate technology investor, and activist, noted that the amount of Carbon emission associated with Bitcoin mining has fallen by nearly 50% from 601g/kWh to 299g/kWh in three short years. It should be observed that the Bitcoin hash rate and prices have been rising steadily during this time. In the last quarter of 2021, the Bitcoin price soared to as high as $69,000 before collapsing to below $16,000 in November 2022. Although prices have since recovered, soaring to as high as $31,000 in April 2023, the hash rate has been steadily rising over the years.  In proof-of-work networks like Bitcoin and Litecoin, the hash rate relays the computing power dedicated to the network in real time. It is a variable that makes the network secure and robust against third-party attacks, and can also be used to gauge the pace at which the Bitcoin platform consumes energy. Related Reading: Ripple CTO Schwartz Reveals Insights Into AMM Trading Strategy Miners channel computing power as “hash rate” to secure the Bitcoin network. They need this to verify transactions in exchange for network rewards. The more the hash rate, the higher the chance of earning a block and, thus, the 6.25 BTC every 10 minutes.  However, the tough competition for the block rewards has been partly blamed for environmental degradation and carbon emissions from miners. To stay competitive, Bitcoin miners have to operate gear that is energy-intensive. Critics have always maintained that electricity powering them is from coal and other non-renewable sources. As of June 2, the Bitcoin Energy Consumption Index shows that 105.23 TWh powers Bitcoin. It is the same amount of electricity consumed by Kazakhstan. The resulting Carbon emission, they add, stands at 58.69 Mt CO2, comparable to that emitted by Libya. However, data from the Bitcoin Mining Counsel, a group comprised of some of the largest BTC miners in the world, provides more insight into the cryptocurrency&#8217;s energy consumption after conducting a study on its members: (&#8230;) the members of the BMC (Bitcoin Mining Council) and participants in the survey are currently utilizing electricity with a 63.8% sustainable power mix. Based on this data, the global bitcoin mining industry’s sustainable electricity mix has improved marginally to 58.9% and remains one of the most sustainable industries globally. Will Green Mining Support BTC Prices? In that sense, Woonomic data coincides that emissions have fallen drastically over the last three years. It has nearly halved to 299g/kWh, suggesting miners switched to greener energy sources to power their rigs. Related Reading: Bloomberg’s Senior Macro Strategist Predicts More Pain Ahead For Bitcoin Technology companies would likely consider adopting BTC as payment as carbon emissions fall. Earlier, Tesla reneged on their decision to accept BTC for payment, citing the impact of Bitcoin mining on the environment. With Carbon emissions decreasing, this could positively impact BTC as major entities worldwide will embrace the coin and network. Feature Image From Canva, Chart From TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-02T20:00:14.000Z",
    "title": "Ethereum Challenger Avalanche (AVAX) Exceeds 1,000,000 Monthly Active Addresses Amid Rollout of Web3 Launchpad",
    "url": "https://dailyhodl.com/2023/06/02/ethereum-challenger-avalanche-avax-exceeds-1000000-monthly-active-addresses-amid-rollout-of-web3-launchpad/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) competitor Avalanche (AVAX) achieved a new milestone by surpassing one million monthly active addresses in May, the first time the proof of stake blockchain has hit the number. Citing crypto data analytics platform Artemis, The Avalanche Snow Report says that the network broke its previous all-time high record of 840,000 monthly active addresses [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/02/ethereum-challenger-avalanche-avax-exceeds-1000000-monthly-active-addresses-amid-rollout-of-web3-launchpad/\">Ethereum Challenger Avalanche (AVAX) Exceeds 1,000,000 Monthly Active Addresses Amid Rollout of Web3 Launchpad</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-02T19:55:31.000Z",
    "title": "Top Crypto Analyst Gives Altcoin Update, Says Litecoin (LTC) Looks ‘Bueno’",
    "url": "https://dailyhodl.com/2023/06/02/top-crypto-analyst-gives-altcoin-update-says-litecoin-ltc-looks-bueno/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/major-litecoin-rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is updating his followers on the state of altcoins, looking at Litecoin (LTC) and Chainlink (LINK) specifically. Crypto trader Michaël van de Poppe tells his 657,300 Twitter followers that the total market cap for altcoins has &#8220;heavy&#8221; support on the 200-week moving average (MA) and the exponential moving average (EMA). &#8220;Total market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/02/top-crypto-analyst-gives-altcoin-update-says-litecoin-ltc-looks-bueno/\">Top Crypto Analyst Gives Altcoin Update, Says Litecoin (LTC) Looks ‘Bueno’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]