[
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T02:07:23.000Z",
    "title": " ‘BlobScriptions’ lift off and it’s taking Blob gas prices with it  ",
    "url": "https://cointelegraph.com/news/ethereum-blobscriptions-taking-blob-fees-gas-price-new-highs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTgzMTFlYjktNDcyZS00OTZjLWFmZmEtMjk3MDkwM2VlNWQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A new method for inscribing data on Ethereum blobs is wreaking havoc on fees for the data-saving feature. </p>\n                    <p><p>A viral new method for minting data to the Ethereum blockchain dubbed “BlobScriptions” is pushing up the price of Blob fees — the amount required for a blob to be included in an Ethereum block. </p><p>BlobScriptions were <a href=\"https://docs.ethscriptions.com/esips/esip-8-ethscription-attachments-aka-blobscriptions\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> on March 27 by a protocol called Ethscriptions, allowing users to inscribe data — from JPEGs to text — directly onto “blobs,” which were introduced to the Ethereum network as part of the network’s <a href=\"https://cointelegraph.com/explained/what-is-the-ethereum-dencun-upgrade-and-why-is-it-important\">Dencun upgrade</a> on March 13. </p><p>Less than five hours after the introduction of BlobScriptions, the gas fees for Blobs soared as high as 585 gwei — equivalent to roughly $18, according to <a href=\"https://ultrasound.money/%5C\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from Ultrasound.money.</p><p><a href=\"https://cointelegraph.com/news/ethereum-blobscriptions-taking-blob-fees-gas-price-new-highs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-28T02:00:55.000Z",
    "title": "Sell-side risk ratio hit 3-year high as Bitcoin broke above $73k",
    "url": "https://cryptoslate.com/sell-side-risk-ratio-hit-3-year-high-as-bitcoin-broke-above-73k/",
    "description": "<p>The Bitcoin sell-side risk ratio is calculated by dividing the sum of all profits and losses realized on-chain by the realized capitalization, offering a comparative view of daily investor activity against the total market capitalization adjusted for real-time inflows and outflows. A rise in this metric indicates a higher likelihood of sell-side pressure, potentially leading [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sell-side-risk-ratio-hit-3-year-high-as-bitcoin-broke-above-73k/\">Sell-side risk ratio hit 3-year high as Bitcoin broke above $73k</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-28T02:00:46.000Z",
    "title": "Ondo Finance Joins BlackRock Tokenized Fund As Inflows Surpass $160M",
    "url": "https://www.newsbtc.com/news/ondo-finance-joins-blackrock-tokenized-fund-as-inflows-surpass-160m/",
    "description": "BlackRock, one of the largest asset managers globally, has witnessed notable success with its newly launched tokenized money-market fund, BUIDL. The fund, which records shared ownership on the Ethereum (ETH) blockchain, has attracted over $160 million in just one week since its debut.  BlackRock&#8217;s BUIDL Fund According to a Bloomberg report, the BlackRock USD Institutional Digital Liquidity Fund (BUIDL) primarily invests in cash, US Treasury bills, and repurchase agreements. The fund rewards its holders with a cryptocurrency, BUIDL, valued at $1 per token.  Shareholders can transfer these tokens to other validated addresses using digital wallets approved by Securitize, BlackRock&#8217;s partner for the investment vehicle. The tokenized fund serves several key use cases, including treasury management for crypto companies, support for derivatives of Treasury bills, and acting as collateral for borrowing and trading, thus providing an alternative to stablecoins. Related Reading: Bitcoin “Liquid Inventory Ratio” Hits All-Time Low, What It Means It is worth noting that Securitize Markets, an SEC-registered alternative trading system, plays a critical role in facilitating the transfer of tokens between market participants.  While the SEC has recently increased its scrutiny of Ethereum&#8217;s native token, ETH, Securitize CEO Carlos Domingo emphasizes that the investigations should be separate from the underlying blockchain infrastructure. Domingo also highlights the battle-tested nature of the public Ethereum blockchain, which provides a &#8220;robust foundation&#8221; for tokenization activities. As previously reported by our sister website, Bitcoinist, BlackRock has emerged as an advocate for cryptocurrencies and tokenization within mainstream financial institutions. Chairman and CEO Larry Fink believes every financial asset will eventually be tokenized.  The company&#8217;s iShares Bitcoin Trust (IBIT) has already attracted more than $13 billion in inflows since its launch as an exchange-traded fund (ETF) in January. With the BUIDL fund&#8217;s launch, BlackRock continues to demonstrate its willingness to explore new digital asset solutions. Ondo Finance To Transfer $95 Million In Assets To BlackRock Ondo Finance, a platform specializing in tokenized real-world assets (RWA), has moved $95 million worth of assets to BlackRock&#8217;s BUIDL fund. This strategic move enables Ondo Finance to facilitate instant settlements for its US Treasury-backed token, OUSG.  This makes Ondo Finance a major participant in the BUIDL ecosystem. According to on-chain researcher Tom Wan, it currently holds $15 million worth of BUIDL tokens, which, in addition to those above $95 million, will result in a substantial $110 million worth of BUIDL tokens.   Related Reading: Here’s Why The Cardano Price Is Struggling Below $0.7 The researcher noted that this collaboration further strengthens the tokenized US Treasury market, with the potential to reach $1 billion in value. In its announcement, the team behind the Ondo Finance platform summarized: We’re excited to see BlackRock embracing securities tokenization with the launch of BUIDL, especially its broad cooperation with ecosystem participants. Not only does this further validate our original concept of a tokenized US Treasury fund, but it also bolsters our thesis that tokenization of traditional securities on public blockchains represents the next major step in the evolution of financial markets. At the time of writing, the native token of Ondo Finance, ONDO, is trading at $0.909, exhibiting a surge of over 4% within the past 24 hours. This positive momentum adds to its impressive price uptrend of 115% recorded over the past 30 days.  Featured image from Shutterstock, chart from TradingView.com"
  }
]