[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T19:02:06.000Z",
    "title": "Bankrupt Hedge Fund 3AC's Return as a VC Stirring Up Crypto Community",
    "url": "https://www.coindesk.com/business/2023/06/21/bankrupt-hedge-fund-3acs-return-as-a-vc-stirring-up-crypto-community/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "3AC co-founder Kyle Davies told CoinDesk that the new entity aims to provide support for projects that are building for a decentralized future, but skeptics have recalled the original firm’s tainted past."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T19:02:55.000Z",
    "title": "Polygon Launches Its Own Copilot, a ChatGPT AI Assistant Chatbot",
    "url": "https://decrypt.co/145668/polygon-launches-chatgpt-ai-assistant-chatbot",
    "description": "The Ethereum scaling solution developer integrates OpenAI's ChatGPT to launch Polygon Copilot."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T19:05:52.000Z",
    "title": "Mega bitcoin pump defies SEC actions",
    "url": "https://cryptodaily.co.uk/2023/06/mega-bitcoin-pump-defies-sec-actions",
    "description": "<p>Bitcoin breaches $30,000 in the face of the SEC&rsquo;s harsh treatment of the crypto sector. Could this be the start of a rally to $45,000?</p>\nBitcoin defies the odds\n<p>Bitcoin is unstoppable. It&rsquo;s a rocket ship; a turbo-charged dynamo; an asset that can save anyone who has the nouse to climb onboard. The SEC and the US government can do what they may but bitcoin is sound money, something all fiat currencies completely lack.</p>\n<p>The king of the cryptocurrencies is saying no to censorship, no to being taken down, and no to the madness of central banks and their attempt to gain full control over the citizenry with the eventual imposition of central bank digital currencies (CBDCs).&nbsp;</p>\n<p>Over the last couple of days bitcoin has proved the doubters wrong, and not only that, it has given the powers that be plenty to think about. SEC chairman Gary Gensler must have thought that he had put the stopper back into the bottle when he unleashed his attacks on the top crypto exchanges, but bitcoin has other ideas. Blackrock, Fidelity, and others' entry into the crypto space might also have something to do with it.</p>\nWhat next?\n<p>Of course, this particular pump may now be rejected from the $30,000 resistance. It will need some power behind it indeed if it is to somehow blast its way through. However, bitcoin has a history of doing the unexpected, and now the calvary, in the form of the big institutions, looks as though it is arriving and who knows now what might happen.</p>\n<p>The next step for bitcoin, if it can maintain the momentum, is to make a new local high of around $31,000, which will surpass the one made in mid-April. From there it will be a case of also making a higher low than $24,800, although it might be hoped that $27,000 or even $30,000 can be the new support.</p>\nSo far infallible signal indicates upside\n<p>One little known indicator in bitcoin&rsquo;s favour is the NVT &amp; HV Combo. This indicator flashed today as the signal line crossed the 40 level and maintained its green colour on the 5-day and the weekly time frames. Green means that price should continue to the upside, while red would signal the opposite. This particular indicator has flashed only 7 times previously since 2017 without any false signals. Today&rsquo;s signal is the eighth time, and many will hope that this signal is a particularly fruitful one. $45,000 beckons.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T18:52:45.000Z",
    "title": "U.S. Lawmakers push for a new bill to hold bank executives accountable for collapses",
    "url": "https://www.cryptopolitan.com/us-new-bill-to-hold-bank-exe-accountable/",
    "description": "In an effort to address failures at major banks, Democrats from the United States House Financial Services Committee have introduced a series of bills, which they described as the &#8220;first wave&#8221; of legislation. The proposed measures are a response to the collapses of Silicon Valley Bank, Signature Bank, and First Republic Bank in the United ... <a title=\"U.S. Lawmakers push for a new bill to hold bank executives accountable for collapses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-new-bill-to-hold-bank-exe-accountable/\" aria-label=\"More on U.S. Lawmakers push for a new bill to hold bank executives accountable for collapses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T18:40:36.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T19:00:28.000Z",
    "title": "Bitcoin Rally Appears To Be Fueled By Derivatives, Will It Last?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-appears-to-be-fueled-by-derivatives-will-it-last/",
    "description": "On-chain data shows that derivative exchanges have observed elevated activity as Bitcoin has rallied towards the $29,000 level. Bitcoin Spot Vs Derivative Trading Volume Ratio Has Been Quite Low Recently As pointed out by an analyst in a CryptoQuant post, the latest price increase is mainly driven by the derivatives. The indicator of interest here is the &#8220;trading volume ratio,&#8221; which measures the ratio between the Bitcoin trading volume on the spot exchanges and that on the derivative exchanges. The &#8220;trading volume&#8221; here naturally refers to the total amount of the cryptocurrency that investors are transacting/moving around on a platform or a group of platforms. When the value of the trading volume ratio is high, it means that the spot exchanges are observing a high amount of activity when compared to the derivative platforms. On the other hand, low values of the indicator imply the derivative exchanges are the ones seeing a relatively high volume at the moment. Now, here is a chart that shows the trend in the Bitcoin trading volume ratio over the past year: The value of the metric seems to have been quite low in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin trading volume ratio had taken a plunge back in March and has since moved mostly sideways around pretty low levels. This would suggest that there has been little spot activity in the market during this time, at least when compared to the volumes that the derivative exchanges have been observing. Interestingly, despite the price of the asset registering a sharp jump towards the $29,000 level during the past day, the ratio has failed to show any uptick, implying that the spot volumes continue to remain low relative to the derivatives activity. This fact would suggest that the latest rally may have in fact received its fuel from the derivatives, rather then the spot market. Historically, rallies that have started along with rising spot trading volumes have been the ones more likely to sustain for longer durations. Related Reading: Bitcoin Miners Deposit To Exchanges, What Does This Mean? From the chart, it&#8217;s visible that the Bitcoin price surge back in January of this year had kicked off when the trading volume ratio had been at relatively high levels. Similarly, the recovery rally back in March had also started when the indicator had seen an uplift (although a much smaller one). As mentioned earlier, the metric had plummeted shortly after this rally had occurred and has been at low levels since then. In this time, BTC has been unable to record any sustainable move. In the past day, however, things have obviously looked different, as the rapid price surge has been unlike anything the asset has displayed recently. Still, the fact that the spot volumes are still low means that the rally &#8220;appears weaker when compared to the solid rallies led by spot market at $16,000 and $19,000,&#8221; according to the quant. Related Reading: Bitcoin Whales Continue To Accumulate As BTC Makes Recovery Push It now remains to be seen if the ratio will continue to be low in the coming days, or if an uptick in spot activity would appear after all. BTC Price At the time of writing, Bitcoin is trading around $29,100, up 12% in the last week. Looks like BTC has seen a sharp uplift in the last 24 hours &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T19:00:40.000Z",
    "title": "Hollywood X PEPE Dominating the Charts While Shaping the Future of Meme Coins",
    "url": "https://www.crypto-news-flash.com/hollywood-x-pepe-dominating-the-charts-while-shaping-the-future-of-meme-coins/?utm_source=rss&utm_medium=rss&utm_campaign=hollywood-x-pepe-dominating-the-charts-while-shaping-the-future-of-meme-coins",
    "description": "In the ever-evolving world of cryptocurrencies, new entrants often struggle to make their mark. Not Hollywood X Pepe $HXPE, though. This sensational meme coin has not just arrived, it has exploded onto the scene, topping the charts on esteemed exchange platforms such as Kraken, OKX, Bybit, and more. The digital currency market, specifically meme coins, [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-21T18:45:50.000Z",
    "title": "Blockchain Security Firm Collects $500,000 Bug Bounty for Finding Threat That Could Have Crippled Sui Network",
    "url": "https://dailyhodl.com/2023/06/21/blockchain-security-firm-collects-500000-bug-bounty-for-finding-threat-that-could-have-crippled-sui-network/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/blockchain-security-firm-threat.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain security firm CertiK is receiving a big reward for discovering a major security threat to the layer-1 blockchain project Sui Network (SUI). According to a new press release, Sui is giving CertiK a $500,000 reward for identifying the threat codenamed “HamsterWheel,” which could have crippled the entire blockchain network. “Differing from traditional attacks that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/blockchain-security-firm-collects-500000-bug-bounty-for-finding-threat-that-could-have-crippled-sui-network/\">Blockchain Security Firm Collects $500,000 Bug Bounty for Finding Threat That Could Have Crippled Sui Network</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-21T18:41:25.000Z",
    "title": "Amazon Collaborating in Pilot Program for New CBDC Proposed by IMF and Central Banks",
    "url": "https://dailyhodl.com/2023/06/21/amazon-collaborating-in-pilot-program-for-new-cbdc-proposed-by-imf-and-central-banks/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/When-CBDC-Is-Created.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Monetary Authority of Singapore (MAS) has published a whitepaper that proposes conditions for the use of central bank digital currencies (CBDCs), tokenized bank deposits and stablecoins. The whitepaper was produced in collaboration with the International Monetary Fund (IMF), Banca d’Italia, and the Bank of Korea, and is currently paired with a pilot program that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/amazon-collaborating-in-pilot-program-for-new-cbdc-proposed-by-imf-and-central-banks/\">Amazon Collaborating in Pilot Program for New CBDC Proposed by IMF and Central Banks</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]