[
  {
    "source": "CryptoGlobe",
    "date": "2023-12-22T15:01:00.000Z",
    "title": "Solana (SOL) Briefly Surpasses BNB to Become Fourth-Largest Crypto By Market Cap",
    "url": "https://www.cryptoglobe.com/latest/2023/12/solana-sol-briefly-surpasses-bnb-to-become-fourth-largest-crypto-by-market-cap/",
    "description": "Solana’s impressive price rise has seen it briefly overtake Binance’s BNB after its market capitalization neared $42 billion amid a sharp price rise of over 80% over the e past 30 days and over 840% so far this year. Solana’s price is currently at $94 after moving more than 23% over the last week, while […]\n"
  },
  {
    "source": "NullTX",
    "date": "2023-12-22T15:05:10.000Z",
    "title": "Ethereum’s Exchange Holdings Decline, Anticipation Grows For $5,000 Price Surge",
    "url": "https://nulltx.com/ethereums-exchange-holdings-decline-anticipation-grows-for-5000-price-surge/",
    "description": "Currently, Ethereum&#8217;s value exhibits moderate growth, marking a 4.57% uptick to reach $2,316, coupled with a noteworthy increase in its 24-hour trading volume. In recent developments, Arthur Hayes, the founder of BitMEX, has chosen to divest from Solana, despite its recent accomplishments and nearly reaching the $100 mark. Instead, Hayes [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T15:00:19.000Z",
    "title": "Here Are The Hottest Altcoins To Buy As The Bull Market Returns – Santiment",
    "url": "https://www.newsbtc.com/altcoin/hottest-altcoins-bull-market/",
    "description": "As the bull market returns, market intelligence platform Santiment has provided some insights into altcoins that one should keep an eye on. This comes as other altcoins like Solana (SOL) and Cardano (ADA) are already leading the way on the back of a significant rally from both tokens. Four Altcoins To Keep An Eye On In a post on their X (formerly Twitter) platform, Santiment highlighted ETH, SHIB, FET, and DENT as four altcoins to keep an eye on. These four crypto tokens are said to be seeing their top 10 respective exchange wallets move coins away from exchanges. This usually connotes a long-term bullish signal as it suggests that these wallets are moving the tokens to cold storage.  Related Reading: Renewed Hope For Crypto: 2023 Sets The Stage For A Monumental 2024 The timing is also important. Many anticipate that the next bull run is around the corner, while some even say that it has already begun. Whatever the case might be, it is obvious that crypto investors are looking to position themselves ahead of the market boom that lies ahead. As such, the decline of these coins on exchanges could mean that some people are betting big on them. According to further data provided by Santiment, Ether has seen a 4.3% drop in the holdings of these top 10 exchange wallets in the last 3 months. In the same period, Shiba Inu (SHIB) and DENT have seen 2.7% and 1.5% drop respectively. Fetch.ai’s FET happens to have been the most significant drop among the four at 26.1%. ETH will undoubtedly be among the altcoins that crypto investors will be keeping an eye on in the next bull run. If certain price predictions are anything to go by, the second-largest crypto token by market cap could be one of the best performers in the next cycle. For one, the Blockchain analytics platform Token Terminal predicts that it will rise to as high as $13,000.  Total market cap recovers above$1.62 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Shiba Inu Could Be A Dark Horse  From Santiment’s report, it is obvious that crypto investors believe that Shiba Inu (SHIB) could be one of the best-performing tokens in the next bull run. The reason is not farfetched, as the team and community continue to show they are committed to the meme coin’s growth. This is evident in how Shibarium’s utility has increased significantly, which could potentially affect SHIB.  Related Reading: Solana Headed To $100? Here’s What’s Driving The Growth Another milestone that can be credited to the team and community is the spike in SHIB burns. Recently, Bitcoinist reported how the SHIB burn rate has spiked by 420%. The majority of these tokens burnt are from transaction fees made on the Shibarium network. The Shiba Inu team had committed to converting some of these fees to SHIB and burning them.  The SHIB burn rate will continue to spike, considering that Shibarium’s utility will more likely than not see new highs when the bull market returns. As the meme coin continues to see its circulating supply decline, one can expect its value to rise. Therefore, there is no doubt that SHIB should be one altcoin that many should keep an eye on.  Featured image from Binance, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-22T14:58:57.000Z",
    "title": "SEC vs. Terraform Labs: Judge Greenlights Confidentiality Pact Before Trial",
    "url": "https://www.crypto-news-flash.com/sec-vs-terraform-labs-judge-greenlights-confidentiality-pact-before-trial/?utm_source=rss&utm_medium=rss&utm_campaign=sec-vs-terraform-labs-judge-greenlights-confidentiality-pact-before-trial",
    "description": "Terraform Labs and the SEC agreed to keep most case documents confidential, but the exact reasons remain undisclosed. The ongoing legal battle between Terraform Labs and the SEC could shape cryptocurrency regulations, with potential consequences for the industry. Terraform Labs and the United States Securities and Exchange Commission (SEC) have reached an agreement on a [...]"
  }
]