[
  {
    "source": "CoinDesk",
    "date": "2023-09-12T20:58:35.000Z",
    "title": "U.S. Judge Denies Sam Bankman-Fried's Bid for Release From Jail Ahead of Trial",
    "url": "https://www.coindesk.com/policy/2023/09/12/us-judge-denies-sam-bankman-frieds-bid-for-release-from-jail-ahead-of-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A federal judge refused Sam Bankman-Fried's bid to be released from jail ahead of trial on Tuesday."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-12T20:44:11.000Z",
    "title": "'Bitboy' Ben Armstrong Files Suit Against Former Hit Network Colleagues",
    "url": "https://decrypt.co/156083/bitboy-ben-armstrong-sues-hit-network-employees",
    "description": "The crypto influencer has sued those who ousted him from his media brand and its parent company."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-12T20:23:35.000Z",
    "title": "House Republicans Reintroduce Bill to Outlaw Digital Dollar CBDC",
    "url": "https://decrypt.co/156088/house-republicans-reintroduce-bill-outlaw-digital-dollar-cbdc",
    "description": "Introduced by House Majority Whip Tom Emmer, the updated anti-CBDC bill includes new provisions not in the original version from February."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T20:47:59.000Z",
    "title": "Bitcoin derivatives data suggests BTC price holds the current range",
    "url": "https://cointelegraph.com/news/bitcoin-derivatives-data-suggests-btc-holds-current-range",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ddf76d46-4f2d-409d-a265-4f1be97fa9e5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC investor sentiment turns increasingly bullish after this week’s quick rebound from a sharp price correction.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) experienced a 5% increase after testing the $25,000 support level on Sept. 11. However, this breakout rally doesn't necessarily indicate a victory for bulls. To put today’s price action in perspective, BTC has witnessed a 15% decline since July. In contrast, the S&amp;P 500 index and gold have maintained relatively stable positions during this period. </p><p>This underperformance demonstrates that Bitcoin has struggled to gain momentum, despite significant catalysts such as Microstrategy's plan to acquire an <a href=\"https://cointelegraph.com/news/microstrategy-bitcoin-purchase-plans-750m-stock-sale\">additional $750 million worth of BTC</a> and the multiple <a href=\"https://cointelegraph.com/news/franklin-templeton-files-bitcoin-spot-etf\">requests for Bitcoin spot ETFs</a> from trillion-dollar asset management firms. Still, according to Bitcoin derivatives, bulls are confident that $25,000 marked a bottom and opened room for further price gains.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/29428ceb-89a1-4718-8e8a-5d06f2ce31ed.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin/USD vs. gold and S&amp;P 500 futures, 12-hour. Source: TradingView</em></figcaption></figure><p>Some argue that Bitcoin's primary <a href=\"https://cointelegraph.com/news/bitcoin-to-hit-100k-in-2024-canaan-vp\">drivers for 2024 are still in play</a>, specifically the prospects of a spot ETF and the reduction in supply following the April 2024 halving. Additionally, some of the cryptocurrency markets’ immediate risks have diminished following the U.S. Securities and Exchange Commission (SEC) experiencing partial losses in three <a href=\"https://cointelegraph.com/news/gary-gensler-sec-holds-line-crypto-enforcement-senate-hearing\">separate cases involving Grayscale, Ripple</a> and the decentralized exchange <a href=\"https://cointelegraph.com/news/uniswap-class-action-suit-judge-says-ether-is-commodity\">Uniswap</a>.</p><p>On the other hand, bears have their own set of advantages, including the <a href=\"https://cointelegraph.com/news/attorney-outlines-ripple-sec-settlement-path-amid-coinbase-case-impact\">ongoing legal cases against leading exchanges</a> like Binance and Coinbase. Moreover, there is the troubled financial situation of the Digital Currency Group (DCG) after one of its subsidiaries <a href=\"https://cointelegraph.com/news/genesis-sues-parent-company-dcg-other-affiliate-600-m-overdue-loans\">declared bankruptcy in January 2023</a>. The group is burdened with debts exceeding $3.5 billion, potentially leading to the sale of funds managed by Grayscale, including the Grayscale Bitcoin Trust (GBTC).</p><p>Let's look at derivatives metrics to understand better how professional traders are positioned in the current market conditions.</p><h2>Bitcoin futures and options metrics held steady despite the correction</h2><p>Bitcoin monthly futures typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement. As a result, BTC futures contracts should typically trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/569bcc41-37b9-4187-994e-1a7fd83e9339.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 1-month futures annualized premium. Source: Laevitas.ch</em></figcaption></figure><p>It's worth noting that the demand for leveraged BTC long and short positions through futures contracts did not have a significant impact on the drop below the $25,000 mark on Sept. 11. However, the BTC futures premium continues to hover below the 5% neutral threshold. This metric remains in the neutral-to-bearish range, indicating a lack of demand for leverage long positions.</p><p>To gauge market sentiment further, it’s also helpful to look at the options markets, as the 25% delta skew can assess whether the retest of the $25,000 has made investors more optimistic. In short, if traders expect a drop in Bitcoin’s price, the skew metric will rise above 7%, while periods of excitement typically have a negative 7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ff8f980f-38e3-45ce-b107-59372332dd0b.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>The situation underwent a notable shift on Sept. 11, as the 25% delta skew metric, which previously indicated a 9% premium on protective put options, suggesting investors were expecting a correction, has now leveled off at 0. This indicates a balanced pricing between call and put options, implying equal odds for both bullish and bearish price movements.</p><h2>Macroeconomic uncertainty favors bears, but BTC bulls remain confident</h2><p>Given the uncertainty on the macroeconomic front, particularly with the upcoming release of the inflation CPI report on Sept. 13 and retail sales data on Sept. 14, it's likely that crypto traders will be cautious and prefer a \"return to the mean.\" In this context, the mean represents the predominant trading range of $25,500 to $26,200 observed over the past couple of weeks.</p><p>However, from a bullish perspective, the fact that derivatives markets held up during the dip below $25,000 is a promising sign. In other words, if bears had significant conviction, one would expect a stronger appetite for put options and a negative BTC futures premium, known as \"backwardation.\"</p><p>Ultimately, both bulls and bears have significant triggers that could influence the price of Bitcoin, but predicting the timing of events such as court decisions and ETF rulings is challenging. This dual uncertainty likely explains why derivatives metrics have remained resilient, as both sides exercise caution to avoid excessive exposure.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T20:00:00.000Z",
    "title": "Gary Gensler confirms SEC’s use of AI for financial surveillance",
    "url": "https://cointelegraph.com/news/gary-gensler-confirms-sec-ai-financial-surveillance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/317ea407-1aac-4a30-98e6-ecb103a1f09a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The chair’s comments came in response to a query from Sen. Catherine Cortez Masto during a Senate oversight hearing.</p>\n                    <p><p>United States Securities and Exchange Commission (SEC) Chair Gary Gensler testified on Sept. 12 in a Senate oversight hearing that his agency was currently using artificial intelligence (AI) technologies to monitor the financial sector for signs of fraud and manipulation. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/YjfQ6c9N6-M\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Gensler gave a public speech before the National Press Club on July 17 wherein he laid out <a href=\"https://cointelegraph.com/news/sec-gary-gensler-ripple-ai-strengthen-enforcement-regime\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-gary-gensler-ripple-ai-strengthen-enforcement-regime/amp\">the case for integrating AI technologies into the SEC’s surveillance scheme</a>, but until now, the agency’s explicit use of the tech hadn’t been made public knowledge.</p><p>When asked by Sen. Catherine Cortez Masto how he envisioned the SEC using AI, Gensler responded:</p><blockquote>“So, we already do. In some market surveillance and enforcement actions. To look for patterns in the market. … It’s one of the reasons why we’ve asked Congress for greater funding this year, in 2024, to help build up our technology budget for the emerging technologies.”</blockquote><p>While it shouldn’t come as a surprise to note that the SEC is utilizing AI technologies during the normal course of its operations, it is somewhat surprising that the agency hasn’t issued a formal, public declaration detailing its use. </p><p>However, it is worth noting that aside from the requirement to report cybersecurity incidents <a href=\"https://www.natlawreview.com/article/president-biden-signs-law-federal-reporting-requirements-cyber-incidents-and\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> into law by President Biden in March of 2022, there don’t appear to be any legal requirements in the U.S. for agencies to publicly report the internal use of new technologies. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/explained/how-artificial-intelligence-can-impact-supply-chains-and-logistics\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/how-artificial-intelligence-can-impact-supply-chains-and-logistics/amp\"><strong><em>How artificial intelligence can impact supply chains and logistics</em></strong></a></p><p>Based on the description given by Gensler, it’s unclear exactly what form of AI the agency is using. However, the SEC has <a href=\"https://www.sec.gov/files/marketstructure/research/algo_trading_report_2020.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> numerous analysis reports on the use of AI and algorithmic trading by actors within financial markets. </p><p>It would make sense for the agency to similarly employ machine learning algorithms capable of parsing large amounts of information for anomalous data.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T19:34:25.000Z",
    "title": "OneCoin co-founder Greenwood gets 20 years in US jail for fraud, money laundering",
    "url": "https://cointelegraph.com/news/onecoin-co-founder-greenwood-gets-20-years-us-jail-fraud-money-laundering",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3cd19c92-5eb9-4221-91d0-3d7f1e2b5812.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Karl Greenwood will also have to pay back the $300 million he made in commissions in the OneCoin pyramid scheme.</p>\n                    <p><p>Karl Greenwood, co-founder of OneCoin with Ruja Ignatova, was sentenced in the United States to 20 years in prison and ordered to pay $300 million on Sept. 20. Ignatova remains at large.</p><p>Greenwood, who is a citizen of the United Kingdom and Sweden, was sentenced in the U.S. District Court for the Southern District of New York. In a statement by the Justice Department, U.S. Attorney Damian Williams <a href=\"https://www.justice.gov/usao-sdny/pr/co-founder-multibillion-dollar-cryptocurrency-scheme-onecoin-sentenced-20-years-prison\" target=\"_blank\" rel=\"noopener nofollow\">called</a> OneCoin “one of the largest fraud schemes ever perpetrated.” The multilevel marketing and Ponzi scheme <a href=\"https://cointelegraph.com/news/onecoin-a-deep-dive-into-crypto-s-most-notorious-ponzi-scheme\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/onecoin-a-deep-dive-into-crypto-s-most-notorious-ponzi-scheme/amp\">reaped $4 billion from 3.5 million victims</a>, the statement said, adding:</p><blockquote>“In reality, unlike legitimate cryptocurrencies, OneCoin had no actual value.”</blockquote><p>The OneCoin team compared its product to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in sales pitches but did not have, in the words of the Justice Department, “a true blockchain — that is, a public and verifiable blockchain,” any mining operations or even as many coins on its private blockchain as it sold.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/onecoin-movie-starring-kate-winslet-coming-soon\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/onecoin-movie-starring-kate-winslet-coming-soon/amp\">OneCoin movie starring Kate Winslet coming soon</a></em></strong></p><p>Greenwood has been in custody since 2018, when he was extradited from Thailand. He <a href=\"https://cointelegraph.com/news/onecoin-a-deep-dive-into-crypto-s-most-notorious-ponzi-scheme\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/onecoin-a-deep-dive-into-crypto-s-most-notorious-ponzi-scheme/amp\">pleaded guilty to charges</a> of fraud and money laundering in December and could have received a sentence of up to 60 years. He is said to have made over $300 million through a 5% commission on all OneCoin sales and to have spent lavishly on luxury goods and the corresponding lifestyle. </p><p>Ignatova has not been seen since October 2017 and <a href=\"https://cointelegraph.com/news/cryptoqueen-ruja-ignatova-makes-fbi-s-ten-most-wanted-list\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cryptoqueen-ruja-ignatova-makes-fbi-s-ten-most-wanted-list/amp\">is on the Federal Bureau of Investigation’s</a> Ten Most Wanted List. A number of other OneCoin executives are facing justice, however. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In 2014, a woman named Ruja Ignatova launched a fake cryptocurrency named \"OneCoin\". Despite the currency never existing, Ruja convinced people all over the world to invest. In 2017, after raking in $4 billion profit, she boarded a plane to Greece and hasn't been seen since. <a href=\"https://t.co/DoJCfmy0Uj\">pic.twitter.com/DoJCfmy0Uj</a></p>— Informative & Interesting (@geniusbrain_in) <a href=\"https://twitter.com/geniusbrain_in/status/1636072389007282176?ref_src=twsrc%5Etfw\">March 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>OneCoin former head of legal and compliance Irina Dilkinska <a href=\"https://cointelegraph.com/news/onecoin-head-of-compliance-facing-40-year-sentence-after-us-extradition\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/onecoin-head-of-compliance-facing-40-year-sentence-after-us-extradition/amp\">was charged in the U.S.</a> with one count of wire fraud and one count of conspiracy to commit money laundering in March. Ignatova associate Christopher Hamilton was <a href=\"https://cointelegraph.com/news/accomplice-of-cryptoqueen-ruja-ignatova-faces-extradition-to-us-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/accomplice-of-cryptoqueen-ruja-ignatova-faces-extradition-to-us-report/amp\">reportedly set to be extradited</a> to the U.S. on fraud and money laundering charges in August 2022. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-crimes-twitter-hackers-keyser-soze/\">Crypto Crimes Rated: From the Twitter Hackers to Not Your Keyser, Not Your Coins</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T19:22:36.000Z",
    "title": "Why is Bitcoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/2975699c-abdd-4f7b-bd35-74267a570117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s price rebounds as investors’ excitement over Franklin Templeton filing for a spot BTC ETF fuels dreams of a new bull market. </p>\n                    <p><p>Bitcoin is up today, rising over 5% with a sharp upward candle that sent the price to a September high of over $26,500 after <a href=\"https://cointelegraph.com/news/bitcoin-faces-resistance-btc-price-gains-pass-5\">hitting a three-month low</a>. Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) reaching over $26,000 was seen as a key level for <a href=\"https://cointelegraph.com/news/bitcoin-price-must-take-26k-says-trader-after-textbook-short-squeeze\">traders and analysts</a>. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7c3d2440-2ed0-4ec8-baba-647c2e635555.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price chart. Source: </em><em>TradingView</em></figcaption></figure><p>Let’s look into the reasons why Bitcoin's price is up today. </p><h2>Institutional interest in Bitcoin boosts market sentiment </h2><p>After Judge Neomi Rao <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">sided with the Grayscale Bitcoin Trust</a> in its case against the United States Securities and Exchange Commission (SEC) on Aug. 29, many large institutions filed for exchange-traded funds (ETFs). </p><p><a href=\"https://cointelegraph.com/news/rising-institutional-interest-is-a-bullish-sign-for-crypto-seba-bank-exec\">Institutional interest in Bitcoin</a> from companies like BlackRock and Fidelity Investments is growing. While both institutions had BTC spot ETF approvals delayed on Sept. 2, the $1.5 trillion asset manager Franklin Templeton <a href=\"https://www.sec.gov/Archives/edgar/data/1992870/000113743923001074/ftdhts1092023.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> with the SEC <a href=\"https://cointelegraph.com/news/franklin-templeton-files-bitcoin-spot-etf\">for a spot Bitcoin ETF</a> on Sept. 12. </p><p>To date, the SEC has refused to approve a spot Bitcoin ETF, despite numerous applicants, including <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock</a>, Fidelity, <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">Cathie Wood’s ARK Invest</a> and 21Shares, which has filed for approval three times. </p><p>BlackRock is the world’s <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc\">largest asset manager</a>, with over $8.5 trillion in assets under management. The firm will also utilize Coinbase to <a href=\"https://www.sec.gov/Archives/edgar/data/1980994/000143774923017574/bit20230608_s1.htm\" target=\"_blank\" rel=\"noopener nofollow\">custody</a> the BTC in the trust, according to the filing with the SEC. </p><p>The SEC’s next deadline for deciding on the application is Oct. 16.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><h2>Bitcoin on exchanges continues to drop </h2><p>Coinciding with Bitcoin's price gains, the BTC <a href=\"https://cointelegraph.com/news/bitcoin-exchanges-same-btc-supply-late-2017\">supply on exchanges </a>continues to remain below the 2023 peak, which occurred May 1. Exchanges have shed over 200,000 Bitcoin since then.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/3b40bbf0-9911-4290-b743-e36a2ccacc56.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BTC balance on exchanges. Source: CoinGlass</em></figcaption></figure><p>The market perceives coins leaving crypto exchanges as a bullish signal, given traders typically withdraw their BTC when they want to hold it in self-custody long term. </p><p>Interestingly, on-chain data shows that despite the elongated bear market, large swaths of Bitcoin investors are positioning for a BTC price rally, as the number of wallets holding 0.1 BTC reached an <a href=\"https://cointelegraph.com/news/bitcoin-data-highlights-3-key-reasons-why-investors-don-t-care-about-btc-price\">all-time high</a> of 12 million on Sept. 12. </p><h2>Liquidations could be sending the Bitcoin price higher</h2><p>With Bitcoin continuing to leave exchanges, liquidations tend to have a strong impact on price. In the past 24 hours, over $38.1 million in BTC shorts have been liquidated, with over $26.4 million in shorts being liquidated in a 12-hour timeframe. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/089a1b66-aab4-462a-a27b-5fa6cff3ba82.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin liquidation data. Source: CoinGlass</em></figcaption></figure><p>Despite the short-seller losing streak, 53% of the futures market remains short on Bitcoin. With such a high ratio remaining skewed short, a potential opportunity for a short squeeze could happen, leading to greater Bitcoin price upside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a4f75017-e27a-4999-ab71-bfb1d07f95f3.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin short vs. long ratio. Source: CoinGlass</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-to-hit-100k-in-2024-canaan-vp\"><strong><em>Bitcoin to hit $100K in 2024? Canaan VP weighs up 2024 halving opportunities</em></strong></a></p><p>While Bitcoin is showing some bullish momentum in the short term after the Franklin Templeton ETF application and short liquidations, the Bitcoin Fear and Greed Index <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">shows the market is still fearful</a>, down over 24 points compared to the previous month. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6042778f-bf51-4ba7-95bb-bd1fc59ca898.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Fear and Greed Index. Source: Alternative</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/why-is-bitcoin-price-up-today&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T19:20:36.000Z",
    "title": "CoinEx suffers security breach with more than $27M thought to be compromised",
    "url": "https://cryptoslate.com/coinex-suffers-security-breach-with-more-than-27m-thought-to-be-compromised/",
    "description": "<p>CoinEx has suffered a security breach, according to official reports from Sept. 12. In a tweet, CoinEx said that it detected a security incident that involved unusual withdrawals from the hot wallets in which it stores exchange funds. The firm identified unauthorized transactions involving Ethereum (ETH), TRON (TRX), and Polygon (MATIC). Later statements from CoinEx&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinex-suffers-security-breach-with-more-than-27m-thought-to-be-compromised/\">CoinEx suffers security breach with more than $27M thought to be compromised</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-12T20:45:10.000Z",
    "title": "MetaMask Users Can Now Buy ETH Using PayPal in the US",
    "url": "https://cryptobriefing.com/metamask-users-buy-eth-paypal-us/?utm_source=feed&utm_medium=rss",
    "description": "MetaMask and PayPal collaboration simplifies crypto purchases, mirroring mainstream online checkout experiences."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-12T20:30:26.000Z",
    "title": "21co Unwraps New Suite of Wrapped Cryptocurrencies ",
    "url": "https://news.bitcoin.com/21co-unwraps-new-suite-of-wrapped-cryptocurrencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"21co Unwraps New Suite of Wrapped Cryptocurrencies \" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/21-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/21.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />21.co, the parent company of crypto exchange-traded products provider 21shares, has introduced a suite of wrapped tokens pegged to top crypto assets across multiple blockchains. The wrapped tokens are designed to increase liquidity and interoperability between different crypto networks. 21co Launches Wrapped Tokens for Cross-Blockchain Liquidity and Security A wrapped cryptocurrency is a digital asset [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T20:54:02.000Z",
    "title": "Sony and Startale Labs join forces for blockchain innovation",
    "url": "https://www.cryptopolitan.com/sony-and-startale-labs-join-forces/",
    "description": "Sony Network Communications and Startale Labs have forged a strategic alliance. This collaboration aims to develop a blockchain for the global Web3 ecosystem. Both entities bring a wealth of knowledge, skills, and a vast network of partners. This partnership promises to accelerate the adoption of blockchain technology and Web3. Sony Corporation, a global giant based ... <a title=\"Sony and Startale Labs join forces for blockchain innovation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sony-and-startale-labs-join-forces/\" aria-label=\"More on Sony and Startale Labs join forces for blockchain innovation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T20:21:29.000Z",
    "title": "CoinEx faces a major security breach with $27 million estimated loss",
    "url": "https://www.cryptopolitan.com/coinex-faces-a-major-security-breach/",
    "description": "CoinEx, a renowned cryptocurrency exchange, recently faced an alarming security breach. On September 12, the exchange witnessed massive outflows to a previously inactive address. Experts in the field quickly raised red flags, suspecting a potential hack. Cyvers Alerts, a trusted blockchain security platform, estimated the damage at a staggering $27 million. Around 1:21 p.m. UTC, ... <a title=\"CoinEx faces a major security breach with $27 million estimated loss\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinex-faces-a-major-security-breach/\" aria-label=\"More on CoinEx faces a major security breach with $27 million estimated loss\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T19:26:13.000Z",
    "title": "BITO Price Prediction 2023-2032: Is BITO a Good Buy?",
    "url": "https://www.cryptopolitan.com/bito-price-prediction/",
    "description": "BITO ETF Price Predictions 2023-2032 The end of August 2023 marked a critical juncture for Bitcoin, with its value increasing by nearly 8% following a decisive legal victory by Grayscale Investments over the U.S. Securities and Exchange Commission (SEC). Originating in June 2022, Grayscale&#8217;s lawsuit contested the SEC&#8217;s decision not to permit the transformation of ... <a title=\"BITO Price Prediction 2023-2032: Is BITO a Good Buy?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bito-price-prediction/\" aria-label=\"More on BITO Price Prediction 2023-2032: Is BITO a Good Buy?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-12T21:04:08.000Z",
    "title": "Franklin Templeton Files For Spot Bitcoin ETF, Boosting Crowd Optimism",
    "url": "https://nulltx.com/franklin-templeton-files-for-spot-bitcoin-etf-boosting-crowd-optimism/",
    "description": "Franklin Templeton, one of the world&#8217;s largest asset managers, has filed for a spot Bitcoin ETF, which would allow investors to directly invest in Bitcoin through a traditional brokerage account. This news has sparked a wave of optimism in the crypto community, with Bitcoin and Bitcoin Cash emerging as the top two trending assets. Spot [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T21:00:23.000Z",
    "title": "Tron’s Justin Sun Mulls Over Making A Move On FTX’s Crypto Stash, Here’s Why",
    "url": "https://www.newsbtc.com/crypto/tron-justin-sun-ftx/",
    "description": "In a completely unexpected move, Justin Sun, Founder of Tron and Advisor to Huobi Global has expressed his interest in acquiring FTX’s considerable crypto assets worth billions of dollars.  Justin Sun Considers Making A Bid For FTX Crypto Assets Justin Sun, Creator of Tron, one of the world’s largest blockchain ecosystems, has hinted at the possibility of acquiring the assets of insolvent crypto exchange FTX. This statement comes a year after the crypto billionaire was contemplating a majority takeover of Huobi Global.  Related Reading: Report Reveals The Stablecoins That Have Suffered The Most De-Peg Events According to data from Messari, a provider of market intelligence products, FTX liquidations hold a total of $1.3 billion in liquid crypto assets excluding stablecoins. The report revealed some of the largest holdings for FTX liquidators which include cryptocurrencies like Solana (SOL), Ethereum (ETH), Aptos (APT), Dogecoin (DOGE), Tron (TRX), and Polygon (MATIC). Given the considerable holdings, there have been fears that the market could witness a crash if the exchange were to start dumping its crypto assets. In response to this, Sun revealed in a post on X (formerly known as Twitter) that he was considering the possibility of purchasing FTX holdings. The Tron Founder explained that the reason behind it was to reduce their selling influence on the crypto market.  “Contemplating an offer for FTX&#8217;s holding tokens and assets to reduce their selling impact on the crypto community. Let&#8217;s unite to bolster our crypto ecosystem,” Sun stated.  However, data from Messari revealed that FTX and Alameda’s BTC holdings, which are approximately $353 million, account for only 1% of BTC’s weekly trading volume, meaning the crypto market can easily handle selling impacts.  Whereas, FTX’s crypto holdings such as DOGE, TRX, and MATIC which range from $20 million to $30 million account for 6-12% of weekly trading volumes, and liquidations could significantly impact the crypto market.  Most of FTX’s SOL are also locked up in Alameda and FTX ventures, and they have a unique liquidation pattern, which allows only $9.2 million SOL to be unlocked every month. This monthly liquidation system allows selling impacts of FTX’s Solana holdings to be easily managed.  FTT price steadies above $1 &#124; Source: FTTBUSD on Tradingview.com FTX Insolvency Court Case Still Ongoing On November 11, 2022, FTX and a number of its affiliates filed for bankruptcy in Delaware, United States. At the time, the exchange owed a staggering $8 billion after it collapsed due to a liquidity crisis.  The crypto exchange is currently under investigation by the United States Securities and Exchange Commission (SEC) while its Founder and CEO, Sam Bankman Fried was charged on 13 accounts for alleged illegal proceedings he performed in FTX, five of which were later withdrawn in June.  Related Reading: Crypto CEO Bags Record Breaking Prison Sentence For $2 Billion Theft FTX liquidators are currently scheduled for a hearing on Wednesday, September 13. The result of the hearing may see the liquidators given clearance to begin liquidations immediately.  A recent court filing has also revealed that the bankrupt crypto exchange still holds assets worth $7 billion. Some of these assets include digital assets, venture investments, and reclaimed properties. Featured image from Watcher Guru, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T20:00:51.000Z",
    "title": "Arbitrum Price Sinks To A New All-Time Low – What Is Behind This Decline?",
    "url": "https://www.newsbtc.com/news/arbitrum-price-sinks-to-a-new-all-time-low-what-is-behind-this-decline/",
    "description": "Arbitrum has managed to maintain its place amongst the top names in decentralized finance (DeFi) despite the unfavorable conditions gripping the space in 2023. However, the price of ARB (the network’s native token), met with a euphoric welcome in March, has been struggling. The Arbitrum token&#8217;s price tumbled to a new historical low of $0.747217 on Monday, the 11th of September, with its honeymoon phase seemingly over. The token’s value dipped by more than 12% in the past week, leaving investors wondering what could be behind this bearish movement. Whales Part With Millions Of ARB Token In Selling Spree ARB’s latest price downturn has been associated with the increased market activity of Arbitrum whales in the past few days. On Monday, crypto journalist Colin Wu reported that three whales transferred 10.23 million ARB (worth about $8 million) to Binance. The first whale reportedly sold 3.8 million ARB at $0.77 per token, while the second whale &#8211; with the pseudonym vladilena2.eth &#8211; sold 3.63 million ARB at $0.83 per token. Meanwhile, the third whale moved 2.8 million ARB for $0.79 per token. Related Reading: Shiba Inu Hits Make-Or-Break Price: 250% Rally Or New All-Time Low? This seeming loss of interest from whales may have precipitated the downward pressure that pushed Arbitrum to a new all-time low. Unfortunately, there appears to be no end, as whales have continued to dump their ARB tokens in the last few hours. According to a Lookonchain report, seven whales have dumped 20.41 million ARB tokens (valued at about $16.05 million) in the last 30 hours. The blockchain analytics platform revealed that these whales generated a total loss of $8.15 million. It is worth noting that general market sentiment may have also contributed to ARB&#8217;s price performance. As of this writing, the Arbitrum native token is valued at $0.781039, according to CoinGecko data.  Other Possible Reasons For Arbitrum Price Decline Another plausible reason for ARB’s recent price downturn is the dwindling activity on the Arbitrum network. While the chain continues to hold its own as a prominent L2 network, it has been experiencing a steady decline in total value locked (TVL). According to DefiLlama data, Arbitrum has a total value of $1.65 billion in assets locked on its network, reflecting a more than 35% decline in the past four months. This current figure also represents the network’s lowest TVL since March. The sustained decrease in total value locked suggests a loss of investor confidence, which could discourage participants from onboarding the network.  Related Reading: Analysts Are Bullish On ADA But Price Keeps Tanking, What’s Going On? Recent governance proposals are another factor that may have contributed to the latest fall in Arbitrum price. Notably, PlutusDAO introduced a proposal on September 9 seeking to return tokens from the DAO treasury to ARB holders. If approved, the governance proposal would involve activating a staking mechanism and the creation of native yield for participants, which could see the annual release of up to 2% of the total token supply. Some investors view this proposal as inflationary, as it would likely exert downward pressure on the price of Arbitrum.  Ultimately, ARB’s latest market performance appears to result from a combination of loss of investor interest, dwindling network activity, and unsatisfactory governance mechanisms.  ARB Price continues a downward trend on daily timeframe &#124; Source: ARBUSDTS chart on TradingView Featured image from SoFi, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T19:27:58.000Z",
    "title": "Shiba Inu Millionaire Dream: How Much SHIB to Invest for a $1 Million Haul?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-millionaire-dream-how-much-shib-to-invest-for-a-1-million-haul/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-millionaire-dream-how-much-shib-to-invest-for-a-1-million-haul",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu&#8217;s current price at $0.00000722 faces a bearish trend with a death cross pattern.  Aspiring SHIB millionaires aim to reach a million dollars by acquiring approximately 11,608,793,610 SHIB tokens, given its historical peak price. In recent times, there has been a decline in cryptocurrency values, primarily due to a lack of significant market investment, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-12T20:01:00.000Z",
    "title": "Court Rules in Favor of Tether, Bitfinex; CTO Celebrates Victory",
    "url": "https://coinedition.com/court-rules-in-favor-of-tether-bitfinex-cto-celebrates-victory/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Court Rules in Favor of Tether, Bitfinex; CTO Celebrates Victory\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Biggest-Buyer-of-US-Treasuries-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Paolo Ardoino, the CTO of Tether, took to Twitter (X) today to celebrate the recent court judgment that worked in Tether’s favor. “Chief Judge Laura Taylor Swain of the U.S. District Court for the Southern District Of New York issued another incisive decision denying Shawn Dolifka’s request for leave to amend his meritless class action [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/court-rules-in-favor-of-tether-bitfinex-cto-celebrates-victory/\">Court Rules in Favor of Tether, Bitfinex; CTO Celebrates Victory</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-12T20:00:26.000Z",
    "title": "Bitcoin (BTC) Bull Market Well Intact Despite Correction, According to Analyst Who Called May 2021 Crypto Crash",
    "url": "https://dailyhodl.com/2023/09/12/bitcoin-btc-bull-market-well-intact-despite-correction-according-to-analyst-who-called-may-2021-crypto-crash/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-bull-well-called.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst says that Bitcoin’s (BTC) path toward a massive bull cycle remains intact despite the market correction. Pseudonymous analyst Dave the Wave tells his 140,100 followers on the social media platform X that BTC appears to be in the midst of a consolidation period after rallying by about 100% from its November [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/12/bitcoin-btc-bull-market-well-intact-despite-correction-according-to-analyst-who-called-may-2021-crypto-crash/\">Bitcoin (BTC) Bull Market Well Intact Despite Correction, According to Analyst Who Called May 2021 Crypto Crash</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-12T19:55:07.000Z",
    "title": "Circle’s Jeremy Allaire Says US on the Cusp of ‘Powerful’ Stablecoin Regulation That Will Boost Crypto Industry",
    "url": "https://dailyhodl.com/2023/09/12/circles-jeremy-allaire-says-us-on-the-cusp-of-powerful-stablecoin-regulation-that-will-boost-crypto-industry/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Issuer-Circle-Calls-Off-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Circle CEO Jeremy Allaire says that the United States will eventually pass legislation to regulate stablecoins and bring regulatory clarity to the crypto industry. In a new interview on the Unchained Podcast with Laura Shin, Allaire says that the ongoing debate on how to regulate stablecoins will likely result in a win for the digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/12/circles-jeremy-allaire-says-us-on-the-cusp-of-powerful-stablecoin-regulation-that-will-boost-crypto-industry/\">Circle’s Jeremy Allaire Says US on the Cusp of ‘Powerful’ Stablecoin Regulation That Will Boost Crypto Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]