[
  {
    "source": "NewsBTC",
    "date": "2023-07-12T04:10:08.000Z",
    "title": "Ethereum Price Lacks Momentum But ETH Holders Are Safe: Here’s Why",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-lacks-momentum-1900/",
    "description": "Ethereum price is consolidating below the $1,900 resistance against the US Dollar. ETH could attempt another increase unless there is a close below $1,825. Ethereum is trading in a range above the $1,850 level. The price is trading above $1,870 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,890 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a decent increase if it clears $1,890 and $1,900. Ethereum Price Holds Support Ethereum’s price made another attempt to gain strength above $1,900. However, ETH failed to settle above the $1,900 resistance and remained in a range, similar to Bitcoin. There was a bearish reaction below $1,880. A low is formed near $1,862 and the price is now moving higher. There was a break above the $1,880 level. The price climbed above the 50% Fib retracement level of the recent drop from the $1,905 swing high to the $1,862 low. Ether is now trading above $1,870 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,890 level. There is also a key bearish trend line forming with resistance near $1,890 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com The trend line is close to the 61.8% Fib retracement level of the recent drop from the $1,905 swing high to the $1,862 low. The first major resistance is near the $1,900 zone. A close above the $1,900 resistance could start a decent increase toward $1,955. The next major resistance is near the $1,975 level. Any more gains could send Ether toward the $2,050 resistance. Another Decline in ETH? If Ethereum fails to clear the $1,900 resistance, it could start another decline. Initial support on the downside is near the $1,870 level or the 100-hourly Simple Moving Average. There is also a connecting bullish trend line at $1,870. The first major support is near the $1,845 level, below which the price might revisit the key support at $1,825. The next major support is near the $1,770 level. Any more losses could send Ether toward the $1,720 support level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,845 Major Resistance Level – $1,900"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-12T03:40:18.000Z",
    "title": "Crypto Chargebacks – Bridging the Dispute Gap With the Blockchain",
    "url": "https://dailyhodl.com/2023/07/11/crypto-chargebacks-bridging-the-dispute-gap-with-the-blockchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Embrace-Blockchain-and-Digital-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>There’s a lot of misinformation online about blockchain technology – particularly in the wake of the FTX debacle from last year. However, there’s also a lot more to the blockchain than you might expect. Thanks to blockchain technology, fintech might be on the verge of fantastic new innovations that could revolutionize the payments industry. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/11/crypto-chargebacks-bridging-the-dispute-gap-with-the-blockchain/\">Crypto Chargebacks – Bridging the Dispute Gap With the Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]