[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T07:03:09.000Z",
    "title": "LM Funding America Announces Sale of Symbiont’s Blockchain Technology to Platonic Holdings Inc.",
    "url": "https://www.cryptopolitan.com/lm-funding-sale-symbionts-platonic-holdings/",
    "description": "LM Funding America, Inc. (NASDAQ: LMFA), a cryptocurrency mining and technology-based specialty finance company, has made a significant move in the blockchain industry by selling Symbiont’s blockchain technology to Platonic Holdings Inc. for $2 million.&#160; The strategic sale is set to strengthen LM Funding&#8217;s balance sheet and provide additional resources for the company&#8217;s expansion, particularly [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T07:00:53.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.175, accompanied by a 24-hour trading volume of $1.1 million. The market capitalization stands at $50.9 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 1.27% decrease. Currently, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T06:55:26.000Z",
    "title": "MATIC Blasts Off: 20% Surge As Polygon Trading Volume Hits Records",
    "url": "https://www.newsbtc.com/news/matic-blasts-off-20-surge-as-polygon-trading-volume-hits-records/",
    "description": "The global cryptocurrency market value has retraced to over $1.72 trillion, suggesting that the cryptocurrency industry has lost some of its momentum in the last day. Furthermore, MATIC has not seen any tiny losses, in contrast to the majority of prominent digital assets, such as Bitcoin. As the Polygon protocol&#8217;s supporters push for new yearly highs, MATIC is experiencing a seismic change within its ecosystem, which has caused its price to soar by more than 20% in early trading on Thursday. Related Reading: Axie Infinity Springs Back To Life With Surprise 35% Rally – Details MATIC Breaches $1 Barrier Based on the several milestones in its ecosystem, Polygon has been indicating that it is prepared to overcome the critical $0.9 pricing threshold. Following an initial upward trend, MATIC made an unsuccessful attempt to break out in February 2023. Before the price broke out this week, there were two more failed breakout efforts in November and December. The $1.07 peak on Wednesday is the highest since April. It is noteworthy that MATIC has failed to close each week above the resistance trend line. Furthermore, some analysts say that MATIC may soon reach new peaks as it tries to keep a solid footing within &#8211; or even past &#8211; the $1 territory. Doctor Profit, a user on Twitter, is among those who endorse such theory. $MATIC is one of the most undervalued projects out there. If I wouldnt have bought tons of it at $0.50 I would heavily enter now as anything below $1 is a gift Sooner or later its an easy double digit coin in the incoming bull. One of my favorite coins — Doctor Profit 🇨🇭 (@DrProfitCrypto) December 26, 2023 The expert called Polygon&#8217;s coin &#8220;one of the most undervalued projects&#8221; in the market and asserted that traders and investors should view its price below $1 as a &#8220;gift.&#8221; Polygon currently trading at $0.995805 territory. Chart: TradingView.com Another expert, renowned cryptocurrency researcher Ali Martinez, shows that, based on his evaluation, MATIC is emerging from a symmetrical triangular formation. Martinez thinks that a strong upward advance that might push MATIC towards the $1.73 price level could occur if Polygon is able to maintain a weekly candlestick close above the $0.96 threshold. #Polygon is on the verge of a breakout from a symmetrical triangle. A sustained weekly candlestick close above $0.96 could propel $MATIC towards $1.73! pic.twitter.com/IZQHpSuqO6 — Ali (@ali_charts) December 26, 2023 Optimistic Outlook: MATIC&#8217;s Promising Trajectory According to this analysis, Polygon has a bright future ahead of it, especially if some important thresholds are broken. The X cryptocurrency community is optimistic about the future of the MATIC price trend. After bouncing off a long-term support region, Pentosh1 predicts the price will keep moving upwards. $MATIC You can&#8217;t not like this setup. Have no idea how long it it will take to play out, just that it likely will probabilistically speaking Historical support confluence, bull flagging for more. Yet to run but starting to find it&#8217;s flippers https://t.co/AMI5e9wxZA pic.twitter.com/RESMqmHGeI — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) December 26, 2023 Related Reading: $2 In Sight? Mina Protocol’s 47% Growth Raises Price Target Hopes Meanwhile, Polygon&#8217;s trading volume has recently increased dramatically. According to DefiLlama, it crossed the $150 million milestone since the middle of the month and reached around $400 million on December 26. With its impressive performance, Polygon&#8217;s native token MATIC has drawn attention as the protocol&#8217;s trading volume reaches a new milestone. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-29T07:00:39.000Z",
    "title": "Solana Set to Overtake ETH as SOL Price Rises 95% in 30 Days – Is a Further Uptrend to $200 or a Strong Correction to $50 Possible?",
    "url": "https://www.crypto-news-flash.com/solana-set-to-overtake-eth-as-sol-price-rises-95-in-30-days-is-a-further-uptrend-to-200-or-a-strong-correction-to-50-possible/?utm_source=rss&utm_medium=rss&utm_campaign=solana-set-to-overtake-eth-as-sol-price-rises-95-in-30-days-is-a-further-uptrend-to-200-or-a-strong-correction-to-50-possible",
    "description": "<img width=\"1043\" height=\"575\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-1024x565.jpg 1024w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />Solana&#8217;s SOL cryptocurrency surged above $100, showing a remarkable comeback in 2023 after a tough 2022, driven by frenzied trading and speculative activity. While Solana competes with Ethereum, the network maintains its lead in DeFi with higher total value locked (TVL). Solana (SOL), a blockchain platform that made waves in 2021 with promises of solving [...]"
  }
]