[
  {
    "source": "CoinDesk",
    "date": "2024-02-27T23:12:51.000Z",
    "title": "Man Who Laundered Billions in Bitcoins Says Bitcoin Fog Was a Help: Bloomberg",
    "url": "https://www.coindesk.com/policy/2024/02/27/man-who-laundered-billions-in-bitcoins-says-bitcoin-fog-was-a-help-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ilya Lichtenstein, one of the crypto industry's most high-stakes criminals, is now helping federal prosecutors in their case against Bitcoin Fog, one of the mixing services he said he'd used to conceal assets."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-27T23:30:24.000Z",
    "title": "Bitcoin’s surge to $57K did not result in liquidation storm, defying expected trend",
    "url": "https://cryptoslate.com/balanced-market-didnt-suffer-from-mass-liquidations-as-bitcoin-crossed-57k/",
    "description": "<p>Bitcoin crossed the $57,000 mark on Feb. 27, reaching its highest level since November 2022. This surge, driving the price from $54,000 to $57,300 within 24 hours, led many to see it as the beginning of a bull rally, especially significant in a Bitcoin halving year. Despite the blistering gains, the expected wave of liquidations [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/balanced-market-didnt-suffer-from-mass-liquidations-as-bitcoin-crossed-57k/\">Bitcoin&#8217;s surge to $57K did not result in liquidation storm, defying expected trend</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T23:20:43.000Z",
    "title": "White House Highlights Bitcoin Mining’s Strain on Power Grid",
    "url": "https://www.cryptopolitan.com/bitcoin-mining-power-grid-strain-white-house/",
    "description": "White House has sounded the alarm about the rising strain Bitcoin mining puts on the national power grid, citing environmental worries amid the cryptocurrency&#8217;s surging demand. As more people mine Bitcoin to increase its value, the significant energy consumption required for the process has drawn intense scrutiny.&#160; This concern stems from the environmental impact of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T23:14:39.000Z",
    "title": "IMF identifies digital currencies as key to financial inclusion in Pacific Island countries",
    "url": "https://www.cryptopolitan.com/imf-identifies-digital-currencies-as-key-to-financial-inclusion-in-pacific-island-countries/",
    "description": "The International Monetary Fund (IMF) has recently shed light on digital currencies&#8217; potential benefits and risks in Pacific Island countries (PICs). These nations face unique monetary challenges due to geographical isolation, small and diverse markets, and specific economic vulnerabilities. In a comprehensive paper, the IMF revealed how, with careful design, digital currencies could meet these [&#8230;]"
  }
]