[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T21:40:12.000Z",
    "title": "XRP, LINK, DOGE Lead Altcoin Gains as Bitcoin Sits at $35K",
    "url": "https://www.coindesk.com/markets/2023/11/06/xrp-link-doge-lead-altcoin-gains-as-bitcoin-sits-at-35k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Altcoins posted gains of 5%-10% on Monday while bitcoin (BTC) treaded water near $35,000 as investors ventured into riskier tokens as calls for an altcoin season emerge."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T21:48:28.000Z",
    "title": "SEC Inspector General says prohibition on crypto ownership hinders agency hiring",
    "url": "http://cointelegraph.com/news/sec-inspector-general-says-prohibition-crypto-ownership-hinders-agency-hiring",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/0958794c-4b41-4545-ad21-4ebbe8d57409.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Besides being short on crypto specialists, the SEC OIG noted a litany of problems that are already familiar – lack of legislative clarity, lack of interagency coordination, etc.</p>\n                    <p><p>The Office of the Inspector General (OIG) of the United States Securities and Exchange Commission (SEC) has <a href=\"https://www.sec.gov/files/inspector-generals-statement-sec-mgmt-and-perf-challenges-october-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> its annual examination of the most serious management and performance challenges facing the agency. Crypto was on its list, as no surprise to anyone in the crypto community.</p><p>The OIG’s “Statement on the SEC’s Management and Performance Challenges” noted the agency’s previous statements about the lack of disclosure and “widespread noncompliance with existing securities laws by crypto asset market participants.” </p><p>The existing law leaves gaps in oversight related to crypto assets that are not securities and certain stablecoins. There have been calls for comprehensive legislation and interagency coordination. In addition, the report said:</p><blockquote>“Caselaw concerning the application of the securities laws to crypto assets is limited and still developing.”</blockquote><p>Those facts are well known. Employment issues in the SEC are less publicized. The report said the agency has been trying to add crypto specialist positions in its examinations, trading and markets, and enforcement divisions. The Office of the General Counsel and the Office of International Affairs are also seeking new to fill new crypto-related positions.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/coinbase-political-initiative-features-lawmaker-admited-ethics-violations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-political-initiative-features-lawmaker-admited-ethics-violations/amp\">Coinbase political initiative features US lawmaker who admitted to ethics violations</a></em></strong></p><p>The SEC’s hiring efforts have been frustrated by a small candidate pool and high competition with the private sector for crypto specialists. Many potential candidates hold crypto assets, the report continued:</p><blockquote>“Candidates are often unwilling to divest their crypto assets to work for the SEC.”</blockquote><p>This <a href=\"https://cointelegraph.com/news/us-ethics-advisory-on-federal-employee-s-crypto-has-basis-in-legislation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-ethics-advisory-on-federal-employee-s-crypto-has-basis-in-legislation/amp\">disqualifies them from working</a> for the agency under a determination by the Office of Ethics Counsel. The OIG is planning to give SEC recruitment practices more scrutiny in FY 2024, it said.</p><p>The OIG reacts to outside requests for investigation as well as implementing internal examinations, although it is characteristically slow to react. The OIG was called on to investigate a potential conflict of interest on the part of former corporate finance director William Hinman, whose speech identifying Ether as not a security has been widely cited. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC’s Office of Inspector General's (OIG) report is worth a read. Besides the embarrassingly bad performance review, the OIG concludes “there is uncertainty” whether the SEC has jurisdiction over crypto. This is the SEC’s own cop on the beat talking. <a href=\"https://t.co/aOjOyzhQZX\">https://t.co/aOjOyzhQZX</a></p>— Stuart Alderoty (@s_alderoty) <a href=\"https://twitter.com/s_alderoty/status/1585670239215312899?ref_src=twsrc%5Etfw\">October 27, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Hinman had a financial interest in the law firm Simpson Thacher & Bartlett, which is a member of the Enterprise Ethereum Alliance (EEA), a good-government group called Empower Oversight <a href=\"https://cointelegraph.com/news/could-the-sec-case-against-ripple-falter-over-a-conflict-of-interest\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/could-the-sec-case-against-ripple-falter-over-a-conflict-of-interest/amp\">claimed in a letter to the OIG</a> in 2022. That claim has apparently not been examined by June 2023, when lawyer John Deaton <a href=\"https://cointelegraph.com/news/hinman-documents-suggest-sec-is-the-wrong-agency-to-govern-digital-assets-crypto-lawyer-says\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hinman-documents-suggest-sec-is-the-wrong-agency-to-govern-digital-assets-crypto-lawyer-says/amp\">called for the OIG to examine</a> the Hinman speech again in an interview with Cointelegraph.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/6-questions-for-jw-verret-an-attorney-whos-tracking-the-money-but-advocating-for-crypto/\">6 Questions for JW Verret — the blockchain professor who’s tracking the money</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T21:53:10.000Z",
    "title": "Solana trading volume surges amidst market rally",
    "url": "https://crypto.news/solana-trading-volume-surges-amidst-market-rally/",
    "description": "Solana (SOL) becomes the most traded altcoin in US exchanges this year."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T22:00:42.000Z",
    "title": "Four Reasons Why Investors Are Bullish On Chainlink",
    "url": "https://www.newsbtc.com/chainlink-news/four-reasons-why-investors-are-bullish-on-chainlink/",
    "description": "Chainlink’s recent price surge of 63% has turned heads in the cryptocurrency community. This uptrend begs the question: what&#8217;s driving investor confidence in Chainlink? Let&#8217;s dive into four key reasons that might be contributing to this bullish trend. #1 Chainlink Dominance In The Oracle Space Oracles act as a bridge between blockchain networks and the external world, fetching data that decentralized applications (dApps) rely on to function. This data can vary widely, from cryptocurrency price feeds essential for decentralized financial (DeFi) platforms to weather information or the results of real-world events for betting platforms. Related Reading: November Outlook For Bitcoin Price: Another Pump Or Retrace? Chainlink has emerged as the leader in this pivotal market, capturing a 47% share with its extensive network of over 1,000 oracles and support for 14+ blockchain platforms. By positioning itself as the primary provider of external data integration, Chainlink has become an essential component of the blockchain infrastructure. #2 Other Products By Chainlink Expanding beyond its initial focus on data feeds, Chainlink now offers a broad spectrum of blockchain services that have significantly strengthened its market presence: Verifiable Random Function (VRF) &#8211; a verifiable method of producing complete randomness at a low cost, particularly useful to create random outcomes within gaming and gambling applications, as well as for any application requiring unpredictability in its protocol. Automation &#8211; allows smart contract developers to utilize Chainlink’s infrastructure to automate their smart contracts cost-effectively and securely, which is crucial for the scalability and efficiency of decentralized applications (dApps). Cross-Chain Interoperability Protocol (CCIP) &#8211; enabling seamless interaction and transfer of data and value across blockchain networks. This interconnectivity is pivotal for a more integrated and accessible blockchain ecosystem. The introduction of CCIP, especially, underscores Chainlink&#8217;s commitment to driving the industry forward. It simplifies the user experience and broadens the potential use cases for blockchain technology, aspects that are highly attractive to institutional investors looking to enter the space. #3 Institutional Interest Chainlink’s CCIP and other products have allowed it to collaborate with big institutions, such as: SWIFT &#8211; a global financial network that 11,000+ financial institutions use to securely transmit information and value, up to trillions of dollars. DTCC &#8211; a global financial entity that processes and settles security transactions totaling quadrillions of dollars. ANZ &#8211; one of the big four banks in the Asia-Pacific region, handling billions of dollars annually. Other notable institutions working with Chainlink are BNP Paribas, Citi, and PwC Germany. These partnerships highlight that institutions see the potential opportunity for blockchains and real-world systems to interact effectively. Chainlink’s co-founder Sergey Nazarov says: It’s now clear that both top global banks and leading market infrastructures believe there will be greater adoption of digital assets across the entire banking industry, and that this adoption will happen using multiple different blockchain technologies at the same time. #4 Bullish Price Action Chainlink had traded between $5 and $9 between June 2022 and September 2023. In October, its price finally managed to break out of this range after an increase of 63%, reaching $12. This price increase was one of the largest within the cryptocurrency market, highlighting the faith investors have in this token. Related Reading: Bitcoin Season: Leading The Charge In The Crypto Market The price currently sits in a previous trading range between $11 and $17. For the price to reach the top of this range, it would have to climb another 50%. Chainlink's Price Action on the monthly chart. Source: LINKUSD from TradingView With its previous all-time highs of $53, it suggests there is still much room for Chainlink&#8217;s price to grow. Specifically, a 340% increase would have to occur for it to reach its previous highs. Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involve substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell securities or cryptocurrencies. Featured image from Shutterstock, Charts from TradingView.com Predycto is the author of a cryptocurrency newsletter. Sign up for free. Follow @Predycto on Twitter."
  }
]