[
  {
    "source": "CoinDesk",
    "date": "2023-05-29T06:25:40.000Z",
    "title": "Shiba Inu-Themed Floki Sees Trading Volume Surge Amid China Plans",
    "url": "https://www.coindesk.com/markets/2023/05/29/shiba-inu-themed-floki-sees-trading-volume-surge-amid-china-plans/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Floki prices rallied on Sunday amid a bitcoin-led market push and bets on the token's “China narrative.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-29T06:22:00.000Z",
    "title": "‘Dealt with firmly’ — Bali governor issues warning to tourists using crypto",
    "url": "https://cointelegraph.com/news/bali-governor-warns-on-crypto-payments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/8844c64a-6a85-4a0b-a146-74dad2740c13.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cryptocurrency trading is legal in Indonesia, but the use of crypto in payments carries hefty penalties including jail time.</p>\n                    <p><p>Bali’s government is cracking down on tourists paying for goods and services using cryptocurrency, with the island’s governor sending a reminder that Indonesia’s fiat currency is the only legal tender.</p><p>On May 28, the government-owned news agency Antara <a href=\"https://en.antaranews.com/news/283182/bali-to-crack-down-on-foreign-tourists-using-crypto-as-payment\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> Bali’s governor Wayan Koster hosted a press conference the same day and said tourists who “use crypto as a means of payment [...] Will be dealt with firmly.”</p><p>\"Strict actions range from deportation, administrative sanctions, criminal penalties, closure of business premises and other tough sanctions,\" he added.</p><p>The meeting was attended by Bali’s chief police inspector and Trisno Nugroho, the head of the Bali Representative Office for Bank Indonesia — the country’s central bank.</p><p>Nugroho reaffirmed that trading crypto is allowed but the <a href=\"https://cointelegraph.com/learn/an-overview-of-the-cryptocurrency-regulations-in-asia\">use of crypto for payments</a> is banned.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I dont understand why Koster keep saying stuff to scare away tourists from not allowing tourist to rent bikes, to only allow certain number of tourist, but so far zero implementation<br><br>I feel he tries his best to make sensational policues just because his term end this year</p>&mdash; Dea Rezkitha ( Bitcoin Conference 23 Bali ️) (@dearezkitha) <a href=\"https://twitter.com/dearezkitha/status/1663013094220783616?ref_src=twsrc%5Etfw\">May 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Koster noted that Indonesia’s currency — the rupiah — is the only one that can be legally used for payments in the country. The use of other currencies carries a maximum potential sentence of one year in prison and an over $13,000 fine or 200 million rupiah.</p><p>The Bali governor's announcement comes days after a May 26 investigative <a href=\"https://www.kompas.id/baca/investigasi/2023/05/25/kripto-dijadikan-alat-pembayaran-di-bali\" target=\"_blank\" rel=\"noopener nofollow\">report</a> in Kompas, considered the country’s newspaper of record.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/indonesian-government-looks-to-nfts-to-preserve-cultural-heritage\"><strong><em>Indonesian government looks to NFTs to preserve cultural heritage</em></strong></a></p><p>Kompas reportedly found multiple Bali-based businesses that accepted cryptocurrency payments including a meditation retreat, a motorbike rental business and a crypto-themed cafe.</p><p>According to <a href=\"https://coinmap.org/view/#/map/-8.38475171/115.20675659/10/attraction,cafe,food,grocery,lodging,nightlife,shopping,sports,transport,default\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from Coinmap, a community-driven project that aims to map crypto-accepting businesses, there are 36 businesses that accept crypto, mostly concentrated in Ubud — a tourist hotspot town.</p><p>Despite the hardline stance from Bali’s governor and Indonesia, the country is on the path to <a href=\"https://cointelegraph.com/news/indonesia-targets-launch-of-its-national-crypto-exchange-by-june\">rolling out a national crypto exchange</a> by next month.</p><p>Indonesia’s Ministry of Trade would reportedly act as a custodian and clearing house for the local cryptocurrency markets. The platform was originally meant <a href=\"https://cointelegraph.com/news/indonesia-plans-to-set-up-its-crypto-bourse-by-the-end-of-2022\">operational by the end of 2022</a>, but suffered delays.</p><p><strong><em><u><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\">Magazine: Cryptocurrency trading addiction — What to look out for and how it is treated</a></u></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-29T06:10:00.000Z",
    "title": "Debt ceiling, bank crisis set for ‘powder keg’ explosion: BitMEX co-founder",
    "url": "https://cointelegraph.com/news/bank-crisis-debt-ceiling-powder-keg-bitmex-arthur-hayes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/e2a35392-2efd-4fa0-836c-3ad2531df2cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former BitMEX CEO Arthur Hayes believes it will cause significant volatility in Bitcoin as well, suggesting it won't likely reach a new all-time high this year.</p>\n                    <p><p>Former Bitmex CEO Arthur Hayes is expecting to see significant Bitcoin volatility in the latter half of the year, caused by a “powder keg” explosion from the United States banking crisis and soaring national debt. </p><p>Hayes, who currently runs a crypto-focused investment fund Maelstrom, spoke on the <em>What Bitcoin Did</em> <a href=\"https://www.youtube.com/watch?v=yV-zwcFnR3Q\" target=\"_blank\" rel=\"noopener nofollow\">podcast</a> on May 26, making a number of predictions about the current economic outlook and the price of Bitcoin. Notably, Hayes said that he expected Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) not to reach the $70,000 mark until 2024. </p><blockquote>“I don’t think we get up to $70,000 this year, I think next year is when we cross that barrier, then we get the blow off top [2025], [2026] and then it’s Armageddon.”</blockquote><p>He pointed to the practice of quantitative easing — increasing money supply — and broader social disquiet as the two primary drivers of such an event, which could cause a drastic decline in the price of equities and cryptocurrency. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/yV-zwcFnR3Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>“With the banking crisis, and you have the federal government issuing trillions of dollars of debt because they need to fund themselves, you’re basically putting this powder keg together of a situation that’s going to be exploding in Q3 or Q4 of this year,” he said, adding he doesn’t think that Bitcoin will reach a new all-time-high anytime this year:</p><blockquote>“While I think ultimately it will be good for Bitcoin, it could be quite volatile on the up and the downside.”</blockquote><p>Other analysts have also made positive comments on the price of Bitcoin in the short term. Speaking to Bloomberg, Tommy Honan, the head of market analysis at crypto exchange Swyftx said that it's possible the relief of a debt deal “will bring traders back to the table and trigger the next big leg-up in the price of Bitcoin.”</p><p>Last week, JPMorgan strategists reportedly said that the current price of gold could imply a Bitcoin price of $45,000, <a href=\"https://www.barrons.com/articles/gold-prices-bitcoin-45-000-3b3c2a94\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a May 24 report from Barron's. The analysts saw Bitcoin's halving event next year to support this potential price forecast. They however also saw the U.S. regulatory crackdown on crypto and reverberations from the FTX collapse to \"constrain any potential upside.\"</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitmex-ceo-interview-crypto-industry-2022-overview\"><strong><em>Crypto industry leveled in 2022 — BitMEX CEO</em></strong></a></p><p>Interestingly, Hayes also mentioned some of his own personal investment strategies, noting that he was looking at staking Ether (ETH) and was closely watching the development of Bitcoin Ordinals. He also mentioned that he invested in Pepe (<a href=\"https://cointelegraph.com/learn/what-is-pepecoin-pepe-memecoin\">PEPE</a>), a <a href=\"https://cointelegraph.com/news/what-is-pepe-coin-flip-memecoin-dogecoin-shiba-inu\">frog-themed memecoin</a> that launched on April 14 and proceeded to rally more than 5,000%. </p><p>Hayes is well-known for making outsized price predictions. In April 2020, he warned that the price of Bitcoin <a href=\"https://cointelegraph.com/news/hayes-scary-warning-bitcoin-price-could-absolutely-retest-3k\">could potentially plummet</a> 57% from $7,000 to $3,000. Bitcoin however held steady and rallied 28% to $9,000 in the following three months. </p><p>More recently, Hayes predicted that the price of ETH would reach $5,000 following <a href=\"https://cointelegraph.com/news/the-ethereum-merge-is-completed-here-s-what-s-next\">The Ethereum Merge</a> upgrade. Immediately following a successful implementation of The Merge, the price of Ether slumped for months before recovering along with <a href=\"https://cointelegraph.com/news/another-strong-crypto-bull-run-may-lie-ahead-thinks-market-analyst-filbfilb\">the rest of the crypto market</a> at the beginning of this year. </p><p><a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\"><strong><em>Magazine: Ordinals turned Bitcoin into a worse version of Ethereum — Can we fix it?</em></strong></a> </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T06:19:14.000Z",
    "title": "Bitcoin Core 25.0 Hits The Market: A Sneak Peek Into The Future",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-core-25-0-hits-the-market-a-sneak-peek-into-the-future/",
    "description": "Bitcoin Core has now rolled out Version 25.0. The most recent update includes numerous new features, bug fixes, performance enhancements, and translation updates. Bitcoin Core, the reference implementation of the Bitcoin (BTC) protocol, is indispensable to the operation and security of the Bitcoin network. BTC responded positively to the news of the upgrade. At the time of writing, BTC is exchanging hands at $28,009, up 3.2% in the last 24 hours, according to data from cryptocurrency market tracker Coingecko. The crypto has been on the uptrend by nearly 5% in the last seven days. Source: Coingecko Related Reading: Shiba Inu All Green Today – What’s The Energy Behind The Glow? This update introduces significant enhancements to transaction policies and expands the use cases for transactions with reduced sizes. The most recent version of the full node client enables users to verify transactions, store a copy of the blockchain, and partake in the consensus procedure. Peer-to-Peer (P2P) and network modifications, new Remote Procedure Calls (RPCs) that will ensure quick wallet rescans, and updated RPCs are notable modifications. Mempool and relay policies now enable transactions with non-witness sizes of 65 bytes or more. Bitcoin Core: At A Glance Bitcoin Core is a software application that facilitates the utilization and interaction with Bitcoin. As the canonical reference implementation of the Bitcoin protocol, it is the version of the software that is most widely recognized and trusted. Consider Bitcoin Core to be the &#8220;brain&#8221; of Bitcoin. It facilitates the creation and administration of digital wallets, which are similar to virtual bank accounts for storing and transmitting Bitcoins. In addition, it links users to the Bitcoin network, a decentralized network of computers that combine to confirm and record Bitcoin transactions. Bitcoin Core is built to be secure and trustworthy. It employs cryptography to safeguard your transactions and Bitcoins. It also includes a built-in wallet and an intuitive interface, making it simpler for users to manage their Bitcoins. BTCUSD climbs back to the $28k region. Chart: TradingView.com Related Reading: Aptos Hackathon, Partnerships Set APT Bulls Up For A Strong Run Optimistic On Future Of Bitcoin The update appears to be timely, coming at a time when the Bitcoin network was required to tackle scalability and transaction performance difficulties created by the emergence of Ordinals. Bitcoin Core, which is now available on GitHub, is extensively evaluated and supported on Linux, macOS 10.15 and Windows 7 and newer versions. Although it should also function on other Unix-like systems, it is not tested as frequently and is therefore not recommended for unsupported platforms. As a result of ongoing developments and enhancements, the Bitcoin community remains positive on the future of the leading cryptocurrency and expects an increase in its price. -Featured image from Bitnovo Blog"
  }
]