[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T12:27:24.000Z",
    "title": "Bitcoin Price 'Throwback' Suggests Potential For Rally to $37K: Valkyrie Investments",
    "url": "https://www.coindesk.com/markets/2023/06/14/bitcoins-price-throwback-suggests-potential-for-rally-to-37k-valkyrie-investments/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A throwback is a countertrend move where prices reverse direction and move back towards a breakout point, paving the way for a strong rally."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-14T12:20:41.000Z",
    "title": "First Mover Americas: Bitcoin Traders Await Fed Decision",
    "url": "https://www.coindesk.com/markets/2023/06/14/first-mover-americas-bitcoin-traders-await-fed-decision/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 14, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T12:30:05.000Z",
    "title": "Snoop Dogg NFT passport lets fans tour with the rapper in digital form",
    "url": "https://cointelegraph.com/news/snoop-dogg-nft-passport-digital-tours",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8d4af37e-15e5-42a2-a21f-bcac3e0a738f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The NFT will provide holders with access to behind-the-scenes content uploaded by Snoop Dogg while on tour. </p>\n                    <p><p>Rap-icon and entrepreneur Calvin Cordozar Broadus Jr., more commonly known as Snoop Dogg, dives into Web3 once more with a <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">nonfungible token (NFT)</a> project that will allow his fans to follow his life on tour. </p><p>In an announcement, the rapper unveiled the Snoop Dogg Passport Series, an NFT collection that provides access to various content such as behind-the-scenes videos and photos uploaded by Snoop Dogg while on tour. Holders of the NFT passport will also be eligible for future releases like artwork and merchandise. </p><p>According to the rapper, he's long been \"pushing things forward\" and believes that digital merch is a part of the future. He also encouraged other artists to follow his steps. \"I’m hoping other artists can see what I’m doing and continue to innovate on their own,” Snoop Dogg said in a statement. </p><p>The project was carried ou in collaboration with the Web3 platform Transient Labs. Chris Ostoich, the platform’s chief operating officer, said that they're always looking for ways to leverage blockchain and \"offer unique experiences,\" and the partnership with Snoop Dogg enabled them to do this. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/441f8d1a-1fcb-4802-bf05-d0288a24e352.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Snoop Dogg's NFT passport project. Source: Snooppassport</em></figcaption></figure><p>Snoop Dogg has been actively participating in various Web3 endeavors. In 2021, the rapper proclaimed himself to be the anonymous NFT collector “Cozomo de’ Medici,” whose wallet was <a href=\"https://cointelegraph.com/news/nifty-news-snoop-s-17m-nft-collection-movie-sold-as-nft-qanon-espouser-sells-tweets\">worth around $17.6 million</a> at the time. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/music-nfts-are-helping-independent-creators-monetize-and-build-a-fanbase\"><strong><em>Music NFTs are helping independent creators monetize and build a fanbase</em></strong></a></p><p>Apart from collecting NFTs, the rapper also showcased the Bored Ape Yacht Club (BAYC) NFT collection through a collaboration with another rap icon Eminem. The duo released a song and <a href=\"https://cointelegraph.com/news/eminem-and-snoop-dogg-to-perform-bored-apes-track-at-mtv-music-awards\">performed it at the MTV Music Awards</a>. </p><p>On March 6, Snoop Dogg was also <a href=\"https://cointelegraph.com/news/snoop-dogg-revealed-as-co-founder-of-web3-powered-livestream-platform\">revealed as the co-founder</a> of a Web3-powered live-streaming platform called Shiller. The app aims to combine Web3 technology with real-time streaming content. The rapper was named a co-founder of the project along with tech entrepreneur Sam Jones.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\"><strong><em>Here’s how Ethereum’s ZK-rollups can become interoperable</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T12:36:51.000Z",
    "title": "Hong Kong lawmaker courts Coinbase amid US legal troubles",
    "url": "https://cryptoslate.com/hong-kong-lawmaker-courts-coinbase-amid-us-legal-troubles/",
    "description": "<p>Hong Kong Legislative Council member Johnny Ng has contacted Coinbase in his bid to help the exchange register in the region, according to a June 14 tweet. Ng wrote: &#8220;I have already got in touch with Coinbase, and we will learn more about the development opportunities in Hong Kong together.&#8221; On June 10, Ng invited [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hong-kong-lawmaker-courts-coinbase-amid-us-legal-troubles/\">Hong Kong lawmaker courts Coinbase amid US legal troubles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-14T12:30:18.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Remain Oversold Ahead of Today’s Fed Rate Decision",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-remain-oversold-ahead-of-todays-fed-rate-decision/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC, ETH Remain Oversold Ahead of Today’s Fed Rate Decision\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2296088883.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin fell below a key resistance level on Wednesday, as markets prepare for the upcoming U.S. Federal Reserve interest rate decision. It is expected that the Fed will keep interest rates unchanged at 5.25%. Ethereum remained below $1,800 in today&#x2019;s session. Bitcoin Bitcoin traded below a key price ceiling in today&#x2019;s session, as traders began [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T12:26:51.000Z",
    "title": "Binance under fire: accused of using Ethereum account to comingle client funds",
    "url": "https://www.cryptopolitan.com/binance-under-fire-accused-of-using-ethereum-account-to-comingle-client-funds/",
    "description": "Binance, the prominent cryptocurrency exchange, continues to employ the Ethereum (ETH) account it was accused of using to commingle clients&#8217; funds as the Securities and Exchange Commission (SEC) indictment against them lingers. The allegations against Binance involve the mingling of funds into accounts controlled by Changpeng Zhao (CZ), the CEO of Binance, namely Sigma Chain ... <a title=\"Binance under fire: accused of using Ethereum account to comingle client funds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-under-fire-accused-of-using-ethereum-account-to-comingle-client-funds/\" aria-label=\"More on Binance under fire: accused of using Ethereum account to comingle client funds\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T12:30:20.000Z",
    "title": "XRP And Ethereum Seeing Increased Social Media Talk As Bitcoin Loses Interest",
    "url": "https://www.newsbtc.com/altcoin/xrp-ethereum-increased-social-talk-bitcoin-loses-interest/",
    "description": "Data shows XRP and Ethereum are picking up social volume as investors have seemingly started to lose interest in Bitcoin. Bitcoin Social Volume Shows Drop, Traders Shift Focus Towards XRP &#38; Ethereum According to data from the on-chain analytics firm Santiment, BTC&#8217;s social volume has decreased since its surge in March. The &#8220;social volume&#8221; here refers to a metric that tells us about the degree of discussion around a given cryptocurrency that social media users are participating in currently. The indicator measures this in terms of the total number of text documents (that, is the posts on various social media platforms like Reddit, Telegram, and Twitter) that are making mentions of the asset in question. Something to keep in mind is that the social volume doesn&#8217;t put any weight on the actual amount of discussion taking place inside any post; what this means is that even if a text document mentions the term several times, its contribution towards the metric&#8217;s value would still remain just one unit. The benefit of this restriction is that it provides a better picture of the amount of talk that the coin is receiving from the general user. If the limitation didn&#8217;t exist, then a long, isolated post with a large number of references to the cryptocurrency could possibly skew the indicator on its own. Related Reading: Bitcoin Market At Decision Point: Will This On-Chain Retest Be Successful? Now, here is a chart that shows the trend in the social volumes of Bitcoin, Ethereum, Binance Coin, XRP, Cardano, and Dogecoin over the past year: How the social volume of the various assets in the sector has changed in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the Bitcoin social volume observed a huge surge in March as the asset&#8217;s value first observed a hard plunge and then recovered with a spectacular rally. Related Reading: XRP Smothered In Red Despite Massive Whale Accumulation, Hinman Docs Release Sharp price action like this always brings attention to any cryptocurrency, so it makes sense that social media users started participating in huge amounts of discussion around the coin. Since topping out in April, however, the asset&#8217;s price has been in an overall downtrend. The social volume has also been going in a downward trajectory alongside it, although the indicator has observed a small rise during the recent volatile event. The high volatility had come as the US SEC had sued Binance and Coinbase, back to back, leading to widespread panic in the market. As mentioned before, it&#8217;s not particularly uncommon to see the social volume jump during such rapid swings in price. Ethereum, XRP, and Binance Coin also saw a spike in discussions related to them during this event, surpassing the levels they have seen during the last few months. While the volatility obviously has a part to play in this rise, it&#8217;s also possible that the slowdown in discussions related to Bitcoin has also contributed to it. It would appear that investors have been gradually losing interest in BTC, and are now shifting their focus towards altcoins such as XRP. XRP Price At the time of writing, XRP is trading around $0.5, down 4% in the last week. Looks like the asset has been moving sideways &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T12:30:43.000Z",
    "title": "Exploring the Benefits of Playing at Crypto Casinos in New Zealand",
    "url": "https://www.crypto-news-flash.com/exploring-the-benefits-of-playing-at-crypto-casinos-in-new-zealand/?utm_source=rss&utm_medium=rss&utm_campaign=exploring-the-benefits-of-playing-at-crypto-casinos-in-new-zealand",
    "description": "Playing at crypto casinos in New Zealand has become increasingly popular over the past few years and for a good reason. They offer many benefits that traditional online casinos simply can’t match. You can learn more about crypto casinos at Casinocrawlers.com, especially if you want to engage in crypto games. For starters, crypto casinos offer anonymity [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T12:22:59.000Z",
    "title": "Bitcoin Seesaws Below $26,000 After CPI, Investors Await Fed Rate Hike Decision – Will BTC Fall to $20,000 or Rise to $30,000? Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-seesaws-below-26000-after-cpi-investors-await-fed-rate-hike-decision-will-btc-fall-to-20000-or-rise-to-30000-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-seesaws-below-26000-after-cpi-investors-await-fed-rate-hike-decision-will-btc-fall-to-20000-or-rise-to-30000-report",
    "description": "Despite the US equity markets experiencing a positive trend after the release of low Consumer Price Index (CPI) numbers, Bitcoin and the broader crypto market remained stagnant. The total supply for Bitcoin at exchanges has dropped to the low of 2018 as investors prefer self-custody after the recent SEC action on Coinbase and Binance. After [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T12:25:00.000Z",
    "title": "US Politician Shannon Bray Reiterates Total Support for SHIB",
    "url": "https://coinedition.com/us-politician-shannon-bray-reiterates-total-support-for-shib/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/shiba9-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/shiba9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/shiba9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/shiba9.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Popular US politician and gubernatorial candidate in the upcoming general elections Shannon Bray has reiterated his support for Shiba Inu. Bray has supported SHIB, one of the leading meme coins, on multiple occasions. According to the politician, he is still buying SHIB, and the ShibArmy is a movement. Among other expertise, Bray describes himself as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/us-politician-shannon-bray-reiterates-total-support-for-shib/\">US Politician Shannon Bray Reiterates Total Support for SHIB</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]