[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-05T00:00:00.000Z",
    "title": "Crypto Trader Turns $900 Into $176,000 Using $PEPE2 In Less Than 24 Hours",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-trader-turns-900-into-176000-using-pepe2-in-less-than-24-hours/",
    "description": "A cryptocurrency trader has managed to turn a $900 investment into $176,000 in a meme-inspired cryptocurrency dubbed Pepe 2.0 ($PEPE2), which appears to be a spin-off of the popular meme-inspired cryptocurrency $PEPE. $PEPE itself is a coin inspired by the infamous meme and cartoon character Pepe the Frog, and was introduced to the market on April […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T00:00:23.000Z",
    "title": "SSV Network Unveils Plan For Decentralized ETH Staking Infrastructure",
    "url": "https://www.newsbtc.com/news/ethereum/ssv-network-unveils-plan-for-decentralized-eth-staking-infrastructure/",
    "description": "The ssv.network has finally announced the launch of its mainnet, bringing a decentralized Ethereum (ETH) staking infrastructure to the Ethereum network. The launch follows more than two years of testing and refining, and the network is poised to revolutionize the staking industry. SSV Network&#8217;s Decentralized Infrastructure The ssv.network&#8217;s mainnet rollout plan includes four phases, each with its goals and provisions. The first phase, beginning in early Q2 2023, ensures that all mainnet parameters are correctly configured.  The second phase will introduce a complete set of verified operators, while the third phase will introduce builders utilizing the ssv.network infrastructure. Finally, the fourth phase will be the permissionless launch, inviting anyone to use the open protocol to build or stake. Related Reading: TRX Bulls Charge Ahead As Tron Network Prepares For Major Upgrade According to the announcement, the phased approach to the rollout is necessary to ensure that all the various actors and stakeholders in the network are aligned. But what are the benefits of this for the future of ETH staking? Decentralization: The ssv.network is a decentralized and permissionless network that aligns with the core principles of Ethereum. By embracing this vision, the network aims to bolster Ethereum&#8217;s resilience and empower the community to shape the future of staking. Fault tolerance: The ssv.network has been built to tackle fundamental Ethereum validator challenges, including fault tolerance. The network is designed to be resilient and able to handle failures in a decentralized manner. Security: The ssv.network has been designed to be secure, with multiple layers of security protocols to ensure the network is safe from attacks. Zero-coordination: The ssv.network has been designed to be a zero-coordination network, meaning that validators do not need to coordinate to validate blocks. Instead, the network uses a mesh-like structure that allows validators to validate blocks independently. Using the ssv.network for staking ETH provides a secure, resilient, and decentralized way to participate in the Ethereum network. The network&#8217;s focus on fault tolerance, security, zero-coordination, diversity, and its self-sustaining ecosystem, makes it an attractive option for anyone looking to stake ETH in the future. Shanghai Hardfork Sparks Surge In ETH Staking Deposits The recent implementation of the Shanghai hard fork has resulted in a surge in Ethereum staking deposits, according to analytics firm Glassnode.  The hard fork, activated on June 2nd, introduced several changes to the Ethereum network, including updates to the gas fee structure and EIP-1559. This new transaction fee mechanism aims to improve the user experience by reducing transaction fees and improving predictability. Glassnode&#8217;s data shows that deposit activity for staking ETH peaked on June 2nd, with over 13,595 new deposits worth over 408,000 ETH.  This surge in staking deposits suggests that investors and users are gaining confidence in Ethereum&#8217;s flexibility following the implementation of the hard fork. Staking allows users to earn rewards by holding and validating transactions on the network, and the recent surge in deposits indicates that more users are becoming interested in this process to participate in the network and earn passive income. Related Reading: 75% Of Bitcoin Supply Now In Profit, Will A Drop Happen Here? In contrast to staking deposits, ETH exchange deposit transactions remained flat at around 30,000 during the same period. This suggests that investors and users choose to hold and stake their ETH rather than trade or sell it on exchanges.  This is a positive sign for the Ethereum network, as staking provides a more stable and secure way to participate, compared to trading on exchanges, which can be subject to market volatility. As of the time of writing, ETH is trading at $1,948, struggling to break through the upper resistance level of $1,990. Over the last 24 hours, the cryptocurrency market has experienced a pullback, and ETH has declined by 0.8%. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T00:04:03.000Z",
    "title": "$1,760,000,000,000 in Americans’ Savings Burned Since 2020 As Credit Card Debt Hits All-Time High",
    "url": "https://dailyhodl.com/2023/07/04/1760000000000-in-americans-savings-burned-since-2020-as-credit-card-debt-hits-all-time-high/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/americans-spend-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Americans have burned through a staggering $1.76 trillion in savings since 2020, according to new consumer data. Stats from the Federal Reserve show Americans reached a peak of $2.3 trillion in savings between 2020 and 2021. Today, that number is down to $533 billion, according to new numbers from the U.S. Department of Commerce and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/1760000000000-in-americans-savings-burned-since-2020-as-credit-card-debt-hits-all-time-high/\">$1,760,000,000,000 in Americans&#8217; Savings Burned Since 2020 As Credit Card Debt Hits All-Time High</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T00:00:38.000Z",
    "title": "Crypto Trader Predicts Massive Surges for Litecoin and Chainlink – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/07/04/crypto-trader-predicts-massive-surges-for-litecoin-and-chainlink-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/trader-massive-surges-here.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist believes that both Litecoin (LTC) and Chainlink (LINK) are set to print gains of over 100%. Analyst Michaël van de Poppe tells his 659,700 Twitter followers that the peer-to-peer payments network Litecoin looks bullish after taking out several technical resistances following its steep ascent last week. According to the trader, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/crypto-trader-predicts-massive-surges-for-litecoin-and-chainlink-here-are-his-targets/\">Crypto Trader Predicts Massive Surges for Litecoin and Chainlink – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]