[
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T15:23:47.000Z",
    "title": "OPNX explains why Celsius was prioritized over FTX, others for bankruptcy tokenization",
    "url": "https://cryptoslate.com/opnx-explains-why-celsius-was-prioritized-over-ftx-others-for-bankruptcy-tokenization/",
    "description": "<p>Celsius was selected first for OPNX&#8217;s bankruptcy tokenization due to the company&#8217;s &#8220;completely unredacted database,&#8221; according to Heimdall CEO Vishal Shah. Heimdall, a provider of business tokenization solutions, and OPNX partnered to roll out their bankruptcy tokenization product, enabling users with funds frozen on defunct platforms to access liquidity. The product provides an alternative to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/opnx-explains-why-celsius-was-prioritized-over-ftx-others-for-bankruptcy-tokenization/\">OPNX explains why Celsius was prioritized over FTX, others for bankruptcy tokenization</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-26T15:30:13.000Z",
    "title": "Biggest Movers: MATIC Surged 5% on Friday, Hitting 18-Day High ",
    "url": "https://news.bitcoin.com/biggest-movers-matic-surged-5-on-friday-hitting-18-day-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2102628472-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Polygon climbed to a multi-week high on Friday, as bearish sentiment in cryptocurrency markets began to fade. The global crypto market marginally rose during today&#x2019;s session, following yesterday&#x2019;s downturn. XRP was another notable gainer. Polygon (MATIC) Polygon (MATIC) was one of Friday&#x2019;s big movers, as the token rose to a multi-week high during the day. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T15:33:20.000Z",
    "title": "Binance inks deal to launch an exchange in Thailand",
    "url": "https://www.cryptopolitan.com/binance-ink-deal-launch-exchange-in-thailand/",
    "description": "Cryptocurrency exchange Binance continues its global expansion by obtaining regulatory approvals in Thailand. Gulf Binance, a joint venture between the crypto exchange and Gulf Innova, the innovation arm of Gulf Energy, has been granted digital asset operator licenses by Thailand’s Ministry of Finance. These licenses authorize the firm to operate a regulated crypto exchange under ... <a title=\"Binance inks deal to launch an exchange in Thailand\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ink-deal-launch-exchange-in-thailand/\" aria-label=\"More on Binance inks deal to launch an exchange in Thailand\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T15:34:53.000Z",
    "title": "ESMA warns of unregulated crypto before MiCA launch",
    "url": "https://crypto.news/esma-warns-of-unregulated-crypto-before-mica-launch/",
    "description": "The European Securities and Markets Authority (ESMA) has recently urged cryptocurrency companies to explicitly label cryptocurrencies as unregulated when offered to investors."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T15:25:25.000Z",
    "title": "Charles Hoskinson gives Cardano’s progress update",
    "url": "https://crypto.news/charles-hoskinson-gives-cardanos-progress-update/",
    "description": "In a recent Youtube video, Cardano founder Charles Hoskinson has spoken about Cardano's innovations notably the current work on the CIP 1694. Hoskinson additionally pointed out coming innovations."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T15:15:58.000Z",
    "title": "Shiba Inu Whale Accumulates 261 Billion Shib Tokens In Just Three Days",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-whale-accumulates-261-billion-shib-tokens-in-just-three-days/",
    "description": "A top SHIB whale added $1.18 million worth of Shiba Inu within 24 hours. Data from Etherscan.io reveals that this whale ranked as the nineteenth largest SHIB holder accumulating 140 Billion SHIB. The whale acquired the SHIB tokens in two separate transactions marking its second massive accumulation within 72 hours. SHIB Token Burns And Shibarium Launch Likely Behind Accumulation Shiba Inu network and users engaged in massive SHIB burn events in 2023. The burning mechanism aims to reduce excess tokens and boost SHIB&#8217;s price. However, no notable price increase has occurred since the token burn events.  Nevertheless, the top SHIB whales are accumulating the tokens ahead of the Shibarium launch and a possible price increase for the asset. Related Reading: Bitcoin Hangs At $26,200: Why This Is A Crucial Support Level BLAZE token has been identified as the largest SHIB burner in recent times on the ecosystem. Shiba Inu Team Member Projects Timeline For Shibarium Launch A member of Shiba Inu&#8217;s marketing team, LUCIE, shared her thoughts on the proposed mainnet launch of Shibarium in a Tweet.  Shibarium is a Layer-2 (L2) scaling solution created for the Shiba Inu ecosystem. Its launch date is highly speculative, with several dates proposed in the past. However, LUCIE stated that she guessed the launch date would be in Q3 of 2023, while Shiba Inu founder Shytoshi Kusama projects in July. The exact launch date remains a mystery and LUCIE believes the Shibarium Mainnet Launch will happen between the second and third quarters of 2023.  Related Reading: Bitcoin Bearish Signal: NUPL Finds Rejection At Long-Term Resistance Additionally, she believes that Shiba’s team remains confident about the launch, with multiple teams working on it and exploring Artificial Intelligence (AI) integration. LUCIE emphasized that the testing process is crucial and security audits are necessary before its launch. She explained further, that if tests go wrong, the Shibarium mainnet release will delay. Shiba Inu Price Outlook Despite the recent announcements concerning Shibarium’s launch, SHIB did not record much price fluctuation. It traded at $0.000009967 on May 1, 2023, before moving to $0.00001002 on May 2. However, by May 4, its price dropped to $0.000009896, losing some of its earlier gains. SHIB dropped to $0.000008695 on May 11, showing price volatility. The bulls attempted to rally on May 23, pushing its price to $0.000008899. However, SHIB met resistance returning to $0.000008519 on May 24 and is trading at $0.000008479 at press time today, depicting a 0.16% increase in 24 hours.  Despite the price gain, SHIB’s trading volume is down by 8%, a possible signal of traders&#8217; hesitation in the market. But the launch of the Shibarium mainnet in the ecosystem may be the price catalyst SHIB needs to reclaim its gains as it may boost SHIB usage. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T15:38:23.000Z",
    "title": "Cardano Emerges as the Greenest Blockchain Powering the Billion-Dollar Market, Poised to Shape a Carbon-Zero Future and Foster Global Sustainability",
    "url": "https://www.crypto-news-flash.com/cardano-emerges-as-the-greenest-blockchain-powering-the-billion-dollar-market-poised-to-shape-a-carbon-zero-future-and-foster-global-sustainability/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-emerges-as-the-greenest-blockchain-powering-the-billion-dollar-market-poised-to-shape-a-carbon-zero-future-and-foster-global-sustainability",
    "description": "<p>The Cardano network is considered the greenest blockchain by many industry players for a handful of reasons.  Cardano maintains that the network’s selling point can be narrowed down to two factors; its staking mechanism and energy consumption levels.  Cardano has been dubbed by many key players and leading publications as the greenest blockchain for multiple [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cardano-emerges-as-the-greenest-blockchain-powering-the-billion-dollar-market-poised-to-shape-a-carbon-zero-future-and-foster-global-sustainability/\">Cardano Emerges as the Greenest Blockchain Powering the Billion-Dollar Market, Poised to Shape a Carbon-Zero Future and Foster Global Sustainability</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T15:20:16.000Z",
    "title": "IOTA’s Dominik Schiener and the UAE Minister of State for Foreign Trade to Discuss Billion-Dollar Project to Drive IoT and DeFi in the United Arab Emirates",
    "url": "https://www.crypto-news-flash.com/iotas-dominik-schiener-and-the-uae-minister-of-state-for-foreign-trade-to-discuss-billion-dollar-project-to-drive-iot-and-defi-in-the-united-arab-emirates/?utm_source=rss&utm_medium=rss&utm_campaign=iotas-dominik-schiener-and-the-uae-minister-of-state-for-foreign-trade-to-discuss-billion-dollar-project-to-drive-iot-and-defi-in-the-united-arab-emirates",
    "description": "<p>IOTA collaborates with the UAE government, using its blockchain solution and Tangle technology to address infrastructure challenges and empower digital ecosystems. IOTA&#8217;s Tangle technology with DAG-based architecture addresses scalability and cost-related concerns, ultimately making the IOTA Tangle network highly energy-efficient with reduced energy consumption. The IOTA Foundation has always been at the forefront of undertaking [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/iotas-dominik-schiener-and-the-uae-minister-of-state-for-foreign-trade-to-discuss-billion-dollar-project-to-drive-iot-and-defi-in-the-united-arab-emirates/\">IOTA&#8217;s Dominik Schiener and the UAE Minister of State for Foreign Trade to Discuss Billion-Dollar Project to Drive IoT and DeFi in the United Arab Emirates</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T15:30:00.000Z",
    "title": "Recent On-Chain Data Indicates an Increase in ETH Whales",
    "url": "https://coinedition.com/recent-on-chain-data-indicates-an-increase-in-eth-whales/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-whales-are-on-the-rise.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The market intelligence platform, IntoTheBlock, took to Twitter earlier this morning to announce that the amount of Ethereum (ETH) whales is on the rise. According to the post, the collective holdings of ETH whales have surged to 30.07 million ETH, marking a significant increase from 26.56 million ETH recorded earlier this year. This rise indicates [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/recent-on-chain-data-indicates-an-increase-in-eth-whales/\">Recent On-Chain Data Indicates an Increase in ETH Whales</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]