[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T15:59:42.000Z",
    "title": "Avalanche Blockchain Usage Grew in Second Quarter: Nansen",
    "url": "https://www.coindesk.com/tech/2023/08/04/avalanche-blockchain-usage-grew-in-second-quarter-nansen/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Avalanche C Chain saw daily active address and transaction volume – two important metrics to gauge a blockchain’s health level – increase significantly in the period."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-04T15:46:54.000Z",
    "title": "Twitter Bot Activity Increased After FTX Listed Tokens, Report Finds",
    "url": "https://decrypt.co/151307/twitter-bot-activity-increased-after-ftx-listed-tokens-report-finds",
    "description": "A report by the Network Contagion Research Institute found that \"inauthentic chatter\" increased to 50% after being listed by FTX."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T15:59:18.000Z",
    "title": "Curve hacker behind $61M heist begins returning funds ",
    "url": "https://cointelegraph.com/news/curve-hack-mev-bot-behind-61m-heist-begins-returning-funds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d1e2ee7d-d433-43e7-9d4d-b72ecff5184f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A frontrunning miner extractable value (MEV) bot that had drained approximately $11 million worth Ether from the Curve protocol returned nearly all of it.</p>\n                    <p><p>A miner extractable value (MEV) bot that drained 6,106 Ether from the Curve Finance pETH-ETH pool has <a href=\"https://etherscan.io/tx/0x0986994c7829965973acde3df774f198a497c7e185007597f61e32735cb521e5\" target=\"_blank\" rel=\"noopener nofollow\">returned</a> most of the funds to the JPEG'd deployer, which represents nearly all of the drained funds. This event occurred after the bot's address <a href=\"https://etherscan.io/tx/0x6a76df5931008a93af5f63378587e12d59ca1cb15a272cb6b5a18b69a262a138\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> a message on the Ethereum blockchain seeking to prove that their email address was associated with the frontrunning bot.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a5eae38a-4c3b-4c5d-9a77-4de0b79dc69a.png\"  /><figcaption style=\"text-align: center;\"><em>The Ethereum IDM negotiations that led to the partial return of funds</em>. <em>Source: Etherscan</em>. </figcaption></figure><p>The returned funds come only from the pETH-ETH Curve pool associated with the JPEG'd protocol, which was frontrun by the bot. All other exploited funds are still under the control of the attacker who initiated the exploit. The Curve team has also <a href=\"https://etherscan.io/tx/0xc45e47f6e7d3e74763032e2fb991fa9a003d8ed55c13c93c6a5368ff322d7742\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> a message to the original attacker in an attempt to get the rest of the funds returned.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T15:40:36.000Z",
    "title": "'The SEC has violated due process' — Coinbase CLO on motion to dismiss lawsuit",
    "url": "https://cointelegraph.com/news/sec-violated-due-process-coinbase-chief-legal-officer-motion-dismiss-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/39d59691-6c64-46a7-bba6-bdf5a16c260d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawyers for Coinbase cited precedent from the SEC v. Ripple case, in which a judge ruled that the XRP token largely did not qualify as a security by the commission’s standards.</p>\n                    <p><p>United States-based cryptocurrency exchange Coinbase has filed a motion to dismiss a lawsuit brought by the Securities and Exchange Commission (SEC) in June.</p><p>In an Aug. 4 filing with U.S. District Court for the Southern District of New York, lawyers for Coinbase <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.599908/gov.uscourts.nysd.599908.36.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a motion for judgment, claiming the SEC had “violated due process, abused its discretion, and abandoned its own earlier interpretations of the securities laws” in asserting certain regulatory authority over the crypto exchange. The legal team cited precedent from the SEC v. Ripple case, in which a judge <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">ruled that the XRP token</a> largely did not qualify as a security by the commission’s existing standards.</p><p>Specifically, Coinbase’s filing disputed that transactions of the 12 tokens at issue in the SEC case met the definition of “investment contracts” under the Howey test and the exchange was operating as an unregistered broker, and argued the commission’s challenges to its staking program “fail as a matter of law”. The crypto firm has requested the court dismiss the case, arguing the SEC’s enforcement action was “punitive” and represented an overreach in its authority granted by Congress. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">By ignoring that precedent, the SEC has violated due process, abused its discretion, and abandoned its own earlier interpretations of the securities laws.  By ignoring that precedent, the SEC has trampled the strict boundaries on its basic authority set by Congress. 2/3</p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1687435195862175744?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-was-aware-of-securities-law-violations-the-sec-claims\"><strong><em>Coinbase was aware of securities law violations, SEC claims in letter</em></strong></a></p><p>The SEC <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">filed the lawsuit </a>against Coinbase on June 6, roughly three months after the exchanged received a Wells notice from the federal regulator. The firm has consistently denied the SEC’s allegations on its activities potentially violating securities laws, and announced on Aug. 3 during an earnings call it would be <a href=\"https://cointelegraph.com/news/coinbase-to-file-order-seeking-dismissal-of-sec-lawsuit\">filing a motion</a> to dismiss.</p><p>In addition to Coinbase, the SEC is pursuing <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">enforcement actions against Binance</a> and Hex founder Richard Heart. U.S. lawmakers recently <a href=\"https://cointelegraph.com/news/crypto-regulatory-framework-bill-pass-house-congressional-committee\">passed legislation through committees</a> that could restructure the commission’s authority over digital assets if signed into law.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binance-coinbase-head-to-court-and-the-sec-labels-67-crypto-securities-hodlers-digest-june-4-10/\"><strong><em>Binance, Coinbase head to court, and the SEC labels 67 crypto-securities: Hodler’s Digest, June 4-10</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-04T16:00:36.000Z",
    "title": "Bitcoin at $29,200 as unemployment rate drops to 3.5%",
    "url": "https://cryptoslate.com/insights/bitcoin-at-29200-as-unemployment-rate-drops/",
    "description": "<p>The jobs and unemployment report for July indicates that the labor market has begun to cool down, in line with the Federal Reserve&#8217;s efforts to suppress inflation. Earlier Dow Jones estimates predicted nonfarm payrolls to increase by 200,000, following a rise of 209,000 in June. They fell short of expectations, coming in at 187,000. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-at-29200-as-unemployment-rate-drops/\">Bitcoin at $29,200 as unemployment rate drops to 3.5%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-04T16:00:02.000Z",
    "title": "Certik Uncovers Security Vulnerability in Worldcoin’s Verification Process",
    "url": "https://news.bitcoin.com/certik-uncovers-security-vulnerability-in-worldcoins-verification-process/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Certik Uncovers Security Vulnerability in Worldcoin&#039;s Verification Process\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On May 29, 2023, Certik, a blockchain and smart contract auditing firm, reported a critical security vulnerability within Worldcoin&#8217;s verification process. This flaw could have allowed attackers to bypass strict identification measures and operate an Orb, a device used to collect users&#8217; iris information. The revelation comes amidst existing complaints regarding Worldcoin&#8217;s data collection practices [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T16:05:11.000Z",
    "title": "Bank of Russia unveils digital ruble details, logo, and fee structure",
    "url": "https://www.cryptopolitan.com/bank-of-russia-unveils-digital-ruble-details-logo-and-fee-structure/",
    "description": "On August 3, the Bank of Russia (BoR) unveiled the logo and details surrounding the country&#8217;s central bank digital currency (CBDC), the digital ruble. The logo consists of an international ruble symbol in a circle and comes in four basic color combinations. The BoR has also laid out its fee structure for various operations related ... <a title=\"Bank of Russia unveils digital ruble details, logo, and fee structure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-russia-unveils-digital-ruble-details-logo-and-fee-structure/\" aria-label=\"More on Bank of Russia unveils digital ruble details, logo, and fee structure\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T15:45:22.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T16:00:43.000Z",
    "title": "Will Bitcoin Rebound Anytime Soon? Here’s What On-Chain Data Says",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-rebound-anytime-soon-on-chain-data-says/",
    "description": "Bitcoin has continued to struggle recently as its price is still in the low $29,000 level. Here&#8217;s what on-chain data says about if a rebound is likely or not. What Does Bitcoin On-Chain Data Say About The Asset&#8217;s Near-Term Outlook? Bitcoin has stagnated recently as the cryptocurrency&#8217;s price has failed to keep any significant moves going. Even the latest decline in the asset has been indecisive, as the price didn&#8217;t take long to fall back to a sideways movement. Under these conditions, it&#8217;s natural that investors may be wondering when the asset might break out of this consolidation. Related Reading: Quant Explains How These Indicators Affect Ethereum Price Recent on-chain data from Santiment sheds light on the underlying metrics related to the asset, which may contain hints about where the cryptocurrency&#8217;s price could be heading next. First, here is a chart that shows the data for two of the Bitcoin indicators that are of interest here: The trend in the active addresses and ratio of volume in profit to loss &#124; Source: Santiment on X As you can see in the above graph, there are two indicators of relevance here: the &#8220;daily active addresses&#8221; and the &#8220;ratio of on-chain transaction volume in profit to loss.&#8221; The former of these naturally keeps track of the total number of unique addresses on the Bitcoin blockchain that are taking part in some kind of transaction activity on the network. From the chart, it&#8217;s visible that this metric has observed a large spike recently, suggesting that a high number of addresses have become active. Generally, a large number of addresses making transfers on the chain implies that a high amount of users are making use of the chain right now. The current value of the metric suggests that more than a million addresses have been active recently, which is the highest that the indicator has been since the middle of April. Such an increase in utility suggests that there is a large amount of interest in the coin at the moment. Now, the other metric here measures the difference between the profit-taking and loss-taking volumes on the Bitcoin network. As is visible in the graph, this indicator has a negative value currently, which means that the majority of the selling in the market is happening at some loss. These negative levels of the metric are similar in scale to those observed back during the March plunge. Historically, bottoms in the price have become more probable to form when investors are capitulating like this, as the coins of the weak hands are picked up by the strong hands in such periods. Related Reading: Bitcoin And Crypto Alert: The Implications Of Bill Ackman’s 30-Year T-Bills Short If a rebound move does arise from this capitulation, then its timing may be ideal, as a high amount of active addresses can mean the presence of a large number of traders who can help fuel the move. Additionally, the Bitcoin millionaire and billionaire addresses have also been behind the asset recently, as they have added 27,755 BTC to their holdings since May. The value of the metric has been trending up recently &#124; Source: Santiment on X Based on these factors, it&#8217;s not hard to believe that a rebound in the cryptocurrency&#8217;s price might take place in the near future, although it may only be a short-term move. BTC Price At the time of writing, Bitcoin is trading around $29,100, down 1% in the last week. BTC has continued to move sideways &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T16:00:08.000Z",
    "title": "DeFi Tokens Crash As LDO Drops; QUBE Soars 25% As Bulls Extend Gains In Unstoppable Rise.",
    "url": "https://www.crypto-news-flash.com/defi-tokens-crash-as-ldo-drops-qube-soars-25-as-bulls-extend-gains-in-unstoppable-rise/?utm_source=rss&utm_medium=rss&utm_campaign=defi-tokens-crash-as-ldo-drops-qube-soars-25-as-bulls-extend-gains-in-unstoppable-rise",
    "description": "<img width=\"512\" height=\"326\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134346.776.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134346.776.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134346.776-300x191.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134346.776-312x198.jpg 312w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The decentralized finance (DeFi) world is a captivating arena where fortunes are made and lost in the blink of an eye. Recently, the DeFi market witnessed a tumultuous event that sent shockwaves through the crypto community &#8211; the crash of various DeFi tokens, including the staggering drop of Lido DAO (LDO). As uncertainty loomed, investors [...]"
  }
]