[
  {
    "source": "Cointelegraph",
    "date": "2023-10-01T01:53:14.000Z",
    "title": "SEC initiates legal action against FTX's auditor",
    "url": "https://cointelegraph.com/news/sec-lawsuit-prager-metis-audit-ftx",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4314aa5d-b9a1-464d-ba01-0cb564b574ad.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC alleges that Prager Metis, an accounting firm engaged by bankrupt crypto exchange FTX in 2021, committed hundreds of violations related to auditor independence.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) have taken legal action against an accounting firm that has previously provided services to the now-defunct cryptocurrency exchange FTX.</p><p>According to a September 29 <a href=\"https://www.sec.gov/news/press-release/2023-214\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the SEC alleged that Prager Metis provided auditing services to FTX without maintaining the necessary independence, as they purportedly continued to offer accounting services, a practice that is prohibited in the industry.</p><p>The SEC claims that these activities spanned approximately three years:</p><blockquote>“As alleged in our complaint, over a period of nearly three years, Prager’s audits, reviews, and exams fell short of these fundamental principles. Our complaint is an important reminder that auditor independence is crucial to investor protection.”</blockquote><p>While FTX itself wasn't explicitly mentioned, the report highlights \"hundreds\" of auditor independence violations.</p><p>Furthermore, a previous court <a href=\"https://www.courthousenews.com/wp-content/uploads/2022/11/FTX-class-action.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> pointed out that the FTX Group seemed to have engaged Metis to audit FTX US and FTX at some point in 2021. FTX declared bankruptcy in November 2022. </p><p>The filing claimed that given Bankman-Fried's public announcement of previous FTX audit results, Metis should have been cognizant that its work would be utilized by FTX to enhance public trust.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-should-stay-jail-prosecution\">FTX founder’s plea for temporary release should be denied, prosecution says</a></em></strong></p><p>It was previously reported over concerns over the information presented in the financial statements.</p><p>On Jan. 25, current FTX CEO John Ray told a bankruptcy court that he had “substantial concerns as to the information presented in these audited financial statements.”</p><p>Furthermore, Senators Elizabeth Warren and Ron Wyden raised concerns about the firm's impartiality, contending that they functioned as advocates for the crypto industry.</p><p>Meanwhile, a law firm that provided services to FTX has come under scrutiny in recent times.</p><p>In a Sept. 21 court filing, plaintiffs allege that Fenwick &amp; West <a href=\"https://cointelegraph.com/news/ftx-former-law-firm-fraud-allegations\">can be held liable</a> because it reportedly exceeded the norm when it came to its service offerings to FTX.</p><p>However, Fenwick &amp; West denies that it can be held responsible as it falls outside the scope of the representation of the client. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-01T02:00:13.000Z",
    "title": "Former US President Donald Trump May Change Crypto Stance Dramatically, Says Ex-SEC Official",
    "url": "https://news.bitcoin.com/former-us-president-donald-trump-may-change-crypto-stance-dramatically-says-ex-sec-official/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Former US President Donald Trump May Change Crypto Stance Dramatically, Says Former SEC Official\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/trump-sec.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission&#x2019;s former head of internet enforcement says former U.S. President Donald Trump&#x2019;s anti-crypto stance may change dramatically. He further predicted that if a Republican is elected U.S. president, a Republican-appointed SEC chair would, at a minimum, approve a bitcoin exchange-traded fund (ETF) and &#x201C;may even slow down considerably SEC crypto-related [&#8230;]"
  }
]