[
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T09:00:00.000Z",
    "title": "MultiversX launches on-chain two-factor authentication standard",
    "url": "https://cointelegraph.com/news/multiversx-launches-onchain-two-factor-authentication-standard",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1d7e6cee-8b33-43b3-a3a8-d7e48a8c4ae5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain protocol MultiversX has implemented a novel two-factor authentication mechanism to add additional security to its network. </p>\n                    <p><p>Two-factor authentication (2FA) is a tried and tested online security measure, and the technology is now being used as an additional transaction signing measure on MultiversX’s blockchain protocol.</p><p>MultiversX CEO Beniamin Mincu unpacked the protocol’s new guardian service in conversation with Cointelegraph. The feature makes use of Google Authenticator, Authy, Duo, Microsoft Authenticator or biometrics to provide a second signature for transactions before they are processed on-chain.</p><p>Mincu outlines the novelty of the approach, which allows users to make use of guarded transactions and accounts to act as a secondary security mechanism:</p><blockquote>“What the chain sees is a guarded account, if it has the feature activated, and for that account, it requires that any outgoing transaction carry two signatures, one from the account owner and the second one from the guardian, through a guarded transaction.”</blockquote><p>The guardian service requires users to create a guardian address to provide 2FA-controlled signatures. Part of the sign-up process sees the wallet prompt the user to finalize the registration by issuing a transaction to the MultiversX network, which will set the service-generated address as a guardian for their account.</p><p>After an account becomes guarded on-chain, transactions issued by the user require both the user’s and the guardian’s signatures. A valid guardian signature for the user transaction will be provided by the guardian service whenever a user that has a guarded account sends a transaction from their wallet and provides a valid 2FA code. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/the-danger-with-google-s-new-cloud-backup-for-2fa-authenticator\">The danger with Google’s new cloud backup for 2FA authenticator</a></em></strong></p><p>While 2FA does not strictly take place on-chain, transactions require authentication codes to be executed. Mincu added that the approach to 2FA protection embedded in the protocol is yet to be carried out by other protocols.</p><blockquote>“As opposed to existing solutions that provide extra protection for wallet accounts, Guardians don’t require storing more private keys and don’t add additional fragility to the backup scheme, which are important tradeoffs and barriers for users.”</blockquote><p>Many cryptocurrency wallets and exchange services tap into 2FA as an added measure to confirm logins and user transactions at an application level. However, Mincu believes the fundamental principles behind the MultiversX guardian approach are possible on other blockchain protocols:</p><blockquote>“The concept of using a device-based authenticator to enable 2FA protection could certainly cause a paradigm shift within our industry.”</blockquote><p>Mincu added that additional security should not come at a cost to user experience and should be aimed at adding minimal friction to transaction signing. </p><p>Two-factor authentication has been part and parcel of the cryptocurrency space for years, with exchanges like Kraken making the added security measure <a href=\"https://cointelegraph.com/news/crypto-exchange-kraken-makes-2fa-mandatory-and-forms-new-security-lab\">mandatory for its users in 2019</a><a href=\"https://cointelegraph.com/news/crypto-exchange-kraken-makes-2fa-mandatory-and-forms-new-security-lab\"></a> to secure logins attempts.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\">Experts want to give AI human ‘souls’ so they don’t kill us all</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T08:47:26.000Z",
    "title": "Celsius 'pleased' with resolutions amid $4.7B FTC fine",
    "url": "https://cointelegraph.com/news/celsius-pleased-with-resolutions-amid-4-7b-ftc-fine",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e0baf3d4-27ac-4473-9b1c-a3bee4a3349b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A community member responded that they were also “pleased” to see former Celsius CEO Alex Mashinsky charged with multiple crimes. </p>\n                    <p><p>Bankrupt crypto lender Celsius Network has posted that the company is pleased with the resolutions that it was able to reach with various United States government agencies. The announcement came after the news that the FTC has imposed a $4.7 billion fine on the company.</p><p>On July 13, the United States Federal Trade Commission (FTC) <a href=\"https://cointelegraph.com/news/celsius-network-fined-billions-by-ftc\">reached a settlement with Celsius</a>. The FTC’s decision comes with a $4.7 billion fine — which is suspended to allow the company to return its remaining funds to users as it goes through bankruptcy proceedings. </p><p>In its statement, Celsius <a href=\"https://twitter.com/CelsiusNetwork/status/1679620565596864513\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that these resolutions will not impact the firm’s chapter 11 plan or its ability to return value to its customers. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are pleased to have reached resolutions with the Department of Justice, the Securities and Exchange Commission, the Commodity Futures Trading Commission, and the Federal Trade Commission as we continue to pursue a successful Chapter 11 Plan.</p>&mdash; Celsius (@CelsiusNetwork) <a href=\"https://twitter.com/CelsiusNetwork/status/1679620564581855233?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Moreover, Celsius <a href=\"https://twitter.com/CelsiusNetwork/status/1679620566532124673\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> that they are committed to cooperating with regulators and government agencies. </p><p>While Celsius was pleased with the results, members of the crypto community were not. Many were  incensed by Celsius’ remarks and blasted the company on Twitter. </p><p>In a tweet, Joey Hendrickson <a href=\"https://twitter.com/JoeyHendrickson/status/1679671482446761985\" target=\"_blank\" rel=\"noopener nofollow\">described</a> Celsius Network’s announcement as “weird.” According to the community member, if the company \"had any level of human conscience,\" they would not be pleased. Hendrickson said that he would rather hear an apology for how the company \"mistreated\" customers.</p><p>Twitter user Amit Palaliya <a href=\"https://twitter.com/AmitPalaliya/status/1679706444982267906\" target=\"_blank\" rel=\"noopener nofollow\">agreed</a> with Hendrickson’s sentiments. The community member expressed dissatisfaction over the use of corporate and legal jargon wording as the company addressed its users. Palaliya urged the firm to just distribute the funds that are left and tell the users to move on instead of continuing to throw money into “legal pits.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/celsius-files-lawsuit-to-recover-150m-from-staking-platform-stakehound\"><strong><em>Celsius files lawsuit to recover $150M from staking platform StakeHound</em></strong></a></p><p>Meanwhile, another community member blasted the company as they tweeted that they were also “pleased” that the former Celsius CEO Alex Mashinsky was charged with multiple crimes. They tweeted: </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And We the Users, who spent their hard earned money on your extreme risk taking lies, are pleased to see Alex Mashinsky charged with multiple crimes <a href=\"https://t.co/QCnjAGPFzK\">https://t.co/QCnjAGPFzK</a></p>&mdash; Digital Asset Updates (@DigitalAssetUpd) <a href=\"https://twitter.com/DigitalAssetUpd/status/1679621625832939520?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On July 13, the United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/celsius-alex-mashinsky-us-sec-files-lawsuit-against-celsius-and-alex-mashinsky-report\">filed a lawsuit against the crypto lender</a> and Mashinsky. The SEC argued that the former Celsius CEO falsely promised a safe investment to users with the company's \"Earn Interest Program.\" </p><p>Apart from this, the United States Attorney for the Southern District of New York and Federal Bureau of Investigation also <a href=\"https://cointelegraph.com/news/us-attorney-announces-charges-against-former-celsius-ceo-alex-mashinsky\">announced fraud charges against Mashinsky</a>. Mashinsky <a href=\"https://cointelegraph.com/news/us-attorney-announces-charges-against-former-celsius-ceo-alex-mashinsky\">was reportedly arrested</a> on the same day as part of the indictment process. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/celsius-pleased-with-resolutions-amid-4-7b-ftc-fine&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tiffany-fong-flames-celsius-ftx-and-ny-post-hall-of-flame/\"><strong><em>Tiffany Fong flames Celsius, FTX and NY Post: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T09:00:00.000Z",
    "title": "Europe’s First Spot Bitcoin ETF To Debut As Interest In US Soars",
    "url": "https://cryptodaily.co.uk/2023/07/europes-first-spot-bitcoin-etf-to-debut-as-interest-in-us-soars",
    "description": "<p>Europe&rsquo;s highly anticipated and long-delayed spot Bitcoin exchange-traded fund (ETF) is finally set to debut later this year amidst huge anticipation surrounding its imminent arrival.</p>\n<p>The launch comes at a time when anticipation in the United States for a spot Bitcoin ETF is building following BlackRock&rsquo;s filing.</p>\nA Long Delay\n<p>The Bitcoin ETF, filed by the London-based multi-asset investment platform Jacobi Asset Management, was originally set to debut on the Euronext Amsterdam Exchange in July 2022. However, the launch was delayed due to unprecedented market conditions triggered by the spectacular collapse of the Terra ecosystem in May and the collapse of FTX in November. Both events created turmoil in the markets, forcing Jacobi Asset Management to delay the listing. The ETF had received approval from the Guernsey Financial Services Commission (GFSC) to launch as far back as October 2021.</p>\n<p>The delay in launch has only served to heighten market expectations as investors eagerly await an avenue to tap into the Bitcoin market with the security of an ETF structure. Many believe the launch of a European ETF could usher in a new era for Bitcoin in European markets. The spot Bitcoin ETF will allow investors to gain exposure to Bitcoin without owning the underlying asset.</p>\nA Shift In Demand\n<p>The multi-asset investment platform explained that it had decided to launch the spot Bitcoin ETF now because of a gradual shift in demand compared to 2022. Additionally, it added that it is still assessing its launch strategy and would be announcing a launch date soon. The Jacobi spot Bitcoin ETF is a centrally cleared, crypto-backed financial instrument, the custody of which is supported by Fidelity Digital Assets.</p>\n<p>The ETF marks a significant shift away from exchange-traded notes (ETNs). Europe has typically structured all crypto-backed financial instruments as exchange-traded notes rather than funds. The key difference between exchange-traded notes and exchange-traded funds is that ETN investors own debt security, while ETF shareholders own a part of the fund&rsquo;s underlying assets.</p>\nGensler And SEC Look To Play Spoilsport\n<p>While European markets are readying themselves for the region&rsquo;s first spot Bitcoin ETF, the United States is lagging far behind. The United States Securities and Exchange Commission (SEC) has so far rejected all spot Bitcoin ETFs. However, US markets have registered a surge of interest in spot Bitcoin ETFs following BlackRock&rsquo;s recent filing. BlackRock is arguably one of the biggest asset management firms in the world, and its filing could indicate a shift in sentiment and perception of Bitcoin.</p>\n<p>In fact, 2023 has seen some of the biggest institutional giants, including Fidelity, file fresh spot Bitcoin ETF applications as the race to become the first US-approved spot Bitcoin ETF gathers steam. The Securities and Exchange Commission had already approved Bitcoin futures ETFs in 2021.</p>\n<p>US markets were optimistic following the BlackRock filing, the Securities and Exchange Commission under Gary Gensler has decided to toe an all too familiar line by rejecting all ETF filings. According to the SEC, the spot Bitcoin filings were inadequate, hence the rejection. However, BlackRock has refiled its application for its iShares Bitcoin Trust exchange-traded fund. According to the new submission, Nasdaq has entered into a surveillance-share agreement with Coinbase, which addresses one of the main objections raised by the SEC.</p>\n<p>Following BlackRock&rsquo;s amendments, other firms such as Fidelity, WisdomTree, and Invesco will also be updating their ETF filings.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T08:59:55.000Z",
    "title": "“The People’s Coin” Spacemesh Launches Following Five Years of Research",
    "url": "https://cryptodaily.co.uk/2023/07/the-peoples-coin-spacemesh-launches-following-five-years-of-research",
    "description": "<p>Tel Aviv, israel, July 14th, 2023, Chainwire</p><p>Spacemesh is proud to announce today, that after five years of work, they will at long last be performing network genesis on July the 14th at 08.00 UTC.</p><p>Spacemesh chose the date of July 14th, which commemorates the storming of the Bastille, as the day to launch the People's Coin. The goal is to establish a cryptocurrency that can achieve widespread distribution, particularly among younger generations and underprivileged demographics who are currently unable to participate in the cryptocurrency revolution due to insurmountable barriers to entry</p><p></p>Spacemesh, The People&rsquo;s Coin, is born today.<p>Spacemesh&rsquo;s team of cryptographers, led by Prof. Tal Moran, spent over 5 years building a radically novel way to achieve consensus in the permissionless setting from scratch.</p><ul><li>Instead of the commonly-used PoW or PoStake, Spacemesh uses PoST (Proof of Space-Time)</li><li>Rather than a Chain topology (i.e., a blockchain), Spacemesh uses a DAG (Directed Acyclic Graph), a.k.a. a &ldquo;mesh&rdquo;</li><li>Additionally, rather than the winner-takes-all paradigm via Lottery (&ldquo;Competitive Mining&rdquo;) used by all Nakamoto-based consensus protocols, Spacemesh uses lottery-free, non-competitive &ldquo;leaderless&rdquo; voting (&ldquo;Collaborative Mining&rdquo;)</li><li>Lastly, instead of generating a new proof for every challenge, which is energy intensive, Spacemesh miners reuse the original proof continually&mdash;resulting in extremely low energy use and near-zero ongoing costs for operating a miner</li></ul><p>The Spacemesh protocol ensures fairness for smaller home miners by rewarding them based on their storage commitment size during each epoch, which occurs approximately every two weeks. This prevents powerful miners, including adversarial ones, from receiving a disproportionate share of rewards. Spacemesh also has significantly lower barriers to entry compared to other permissionless cryptocurrencies. To become a miner (smesher), all that is required is a PC with available storage space, any GPU with OpenCL support, and a reliable internet connection. Specialized mining equipment is unnecessary, and ongoing power usage is low, resulting in minimal electricity bills. Additionally, there is no need for deposits, bank accounts, or credit cards.</p><p>The combination of low entry barriers, low operational costs, and incentive compatibility, establishes a novel guarantee of fair distribution.</p><p>Once a miner joins the network by committing the minimum required storage, they become an active participant and receive a fair share of rewards during each epoch. This share is likely sufficient to cover any electricity expenses or hardware replacement costs. The low marginal costs for home users, coupled with the absence of competition-based rewards, encourage small miners to join the network. This leads to a diverse ecosystem where even smaller participants can actively contribute without being priced out.</p><p>Regardless of how many other participants join the network, every miner is guaranteed to receive their fair share of rewards consistently and predictably. There are no more races for big payouts or reliance on luck through lotteries.&nbsp;</p><p></p><p>&ldquo;To reach its full revolutionary potential, crypto cannot be introduced as stocks, e.g. gamble money you don&rsquo;t have, nor as an elites-only hobby. We must by necessity offer these users a better deal: Come as you are, with whatever PC you already own, and the know-how already have &mdash; no other out-of-pocket expenses are needed at any time. It&rsquo;s the only conceivable way to have a widespread currency that impacts the people who need it most.&rdquo; explains Tomer Afek, the co-founder and CEO of SpaceMesh.</p><p>&ldquo;As the People&rsquo;s Coin, everything we do, everything we write&mdash;the code and apps we ship&mdash;should be understandable, accessible, legible, and usable by regular people. This has profound implications for our design, UX, engineering, and economics.&rdquo; he adds.</p><p>Spacemesh&rsquo;s Team is dedicated to breaking down barriers that prevent the benefits of cryptocurrency from reaching more people. We are committed to continuously lowering entry barriers, ensuring that more diverse demographics can participate in the crypto revolution. Our goal is to create a more equitable world, fostering improved cooperation on local, national, and global scales. By making crypto accessible to all, we believe we can contribute to a future that is fairer and more inclusive for everyone.</p><p>About SpaceMesh:</p><p>Spacemesh raised $23m from leading cryptocurrency investors including Polychain, Paradigm, Dragonfly, Electric Capital, Greenfield, Arrington XRP Capital, and 1KX.</p><ul><li>Here are the minimum HW requirements</li><li>Here is the download page</li><li>Here hangs our awesome community, see you there</li><li>The rest, you shall find out, by following the &ldquo;white rabbit&rdquo; &#128048;</li></ul>ContactCEOTomer AfekSpacemeshtomer@spacemesh.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T09:04:59.000Z",
    "title": "Stability AI Co-founder Alleges Deception in Sale of Equity for Measly $100",
    "url": "https://www.cryptopolitan.com/stability-ai-co-founder-sale-of-equity-100/",
    "description": "Cyrus Hodes, a co-founder of generative AI startup Stability AI, has filed a lawsuit against Stability AI and its CEO, Emad Mostaque, alleging fraud and embezzlement. The AI entrepreneur lodged the lawsuit in the U.S. District Court for the Northern District of California, asserting that Mostaque misled him regarding the value of his stake in ... <a title=\"Stability AI Co-founder Alleges Deception in Sale of Equity for Measly $100\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stability-ai-co-founder-sale-of-equity-100/\" aria-label=\"More on Stability AI Co-founder Alleges Deception in Sale of Equity for Measly $100\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T08:56:15.000Z",
    "title": "“The People’s Coin” Spacemesh Launches Following Five Years of Research",
    "url": "https://www.cryptopolitan.com/the-peoples-coin-spacemesh-launches-following-five-years-of-research/",
    "description": "Tel Aviv, israel, July 14th, 2023, Chainwire Spacemesh is proud to announce today, that after five years of work, they will at long last be performing network genesis on July the 14th at 08.00 UTC. Spacemesh chose the date of July 14th, which commemorates the storming of the Bastille, as the day to launch the ... <a title=\"“The People’s Coin” Spacemesh Launches Following Five Years of Research\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-peoples-coin-spacemesh-launches-following-five-years-of-research/\" aria-label=\"More on “The People’s Coin” Spacemesh Launches Following Five Years of Research\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T08:47:03.000Z",
    "title": "Bankrupt lender Celsius founder faces $40M bail and traveling restrictions",
    "url": "https://www.cryptopolitan.com/celsius-founder-faces-40m-bail/",
    "description": "Alexander Mashinsky, the founder and former chief executive of bankrupt crypto lender Celsius, has recently been granted bail by a U.S. District Judge. The bail amount has been set at a staggering $40 million following his arrest on Thursday on charges of fraud. According to court documents, Mashinsky has pleaded not guilty to seven counts, ... <a title=\"Bankrupt lender Celsius founder faces $40M bail and traveling restrictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/celsius-founder-faces-40m-bail/\" aria-label=\"More on Bankrupt lender Celsius founder faces $40M bail and traveling restrictions\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T08:56:06.000Z",
    "title": "Ripple warns on fake XRP airdrops amid US ruling",
    "url": "https://crypto.news/ripple-warns-on-fake-xrp-airdrops-amid-us-ruling/",
    "description": "Scammers have exploited the news of Ripple's victory with fake XRP airdrop scams as Ripple CTO issued a warning on the fraudulent activities."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T08:44:41.000Z",
    "title": "HIVE Blockchain rebrands to reflect its AI and web3 push",
    "url": "https://crypto.news/hive-blockchain-rebrands-to-reflect-its-ai-and-web3-push/",
    "description": "HIVE Blockchain, a publicly traded bitcoin mining firm, switched to AI and cloud computing. HIVE is also launching its GPU rental and cloud computing service. AI boom continues to gain momentum. Many sectors of the global economy and even governments&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T08:49:36.000Z",
    "title": "Optimism (OP) Rides The Wave Of Today’s Crypto Surge With 15% Rally",
    "url": "https://www.newsbtc.com/news/optimism-rides-wave-of-crypto-surge/",
    "description": "Optimism (OP), alongside major cryptocurrencies, has witnessed a remarkable surge in value amidst a wave of positive momentum sweeping through the broader crypto market.  The recent victory of Ripple against the US Securities and Exchange Commission has sparked a sea of green, with investors expressing renewed confidence in the industry. Related Reading: Cardano Development Activity Dropping – What Does It Mean For ADA Price? In this flourishing environment, Optimism Network&#8217;s OP coin stands tall, exhibiting an impressive surge of nearly 15% in the past seven days.  But can the Optimism Network sustain its upward trajectory in the face of regulatory challenges? OP Bulls Target $1.3 Resistance Level In the ever-changing landscape of the cryptocurrency market, the current price of OP coin on CoinGecko hits $1.38, reflecting a noteworthy rally of 14.2% over the past 24 hours. Additionally, within the last seven days, the coin has experienced an impressive surge of 14.7%. Source: Coingecko Since the first week of July, OP has been trading below the $1.3 mark. However, an OP price report notes that bullish investors are eyeing this crucial threshold to flip the H2 structure (see chart below) into a bullish trend.  The $1.3 resistance level has posed a challenge for the OP coin&#8217;s value, preventing it from surpassing this critical point. Bulls in the market are striving to overcome this hurdle, which would signal a potentially bullish trend for the coin.  Breaking through a resistance level requires bulls to employ various strategies and leverage market dynamics to their advantage. One approach is to increase buying pressure by generating higher demand for the asset. This can be achieved through positive news, improved market sentiment, or attracting new investors. By accumulating buying orders, bulls can potentially overpower selling pressure and propel the price beyond the resistance level. Related Reading: PEPE Price Drops More Than 60% From ATH – What Lies Ahead? Technical analysis plays a crucial role as well. Bulls carefully analyze price charts and employ technical indicators to identify patterns, trends, and potential entry points. They look for signals that indicate a breakout or reversal in price movement. OP market cap currently at $912 million. Chart: TradingView.com Altcoins Rally As the news of Ripple&#8217;s triumph against the SEC spreads, the crypto market witnessed a major surge. XRP, Ripple&#8217;s native cryptocurrency, has skyrocketed by more than 60% at the time of writing. CONGRATS #XRPArmy!!! ITS OUR TIME TO SHINE!!! WE DESERVE IT!!! https://t.co/z8cvChvIfC — wEeZiE {X}💭FireGaryGensler (@NerdNationUnbox) July 13, 2023 This remarkable climb has sparked fervent excitement within the &#8220;XRP army&#8221; community on Twitter. CoinGecko data indicates that XRP is currently trading above $0.76. In addition to XRP&#8217;s extraordinary rally, several other altcoins have also enjoyed significant gains. Altcoins such as Solana, Polygon, and Cardano, which were previously subject to scrutiny and classified as potential securities by the SEC, have reaped the benefits of this rising tide in the crypto market. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T09:07:13.000Z",
    "title": "Ethereum’s Amazon Server Dependence Raises Concerns for Investors – Is ETH at Risk?",
    "url": "https://www.crypto-news-flash.com/ethereums-amazon-server-dependence-raises-concerns-for-investors-is-eth-at-risk/?utm_source=rss&utm_medium=rss&utm_campaign=ethereums-amazon-server-dependence-raises-concerns-for-investors-is-eth-at-risk",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T112952.554.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T112952.554.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T112952.554-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T112952.554-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum&#8217;s decentralization is said to be at risk for its over-dependence on computing servers like Amazon. Those who stake Ethereum could be largely affected in incidents of outages as they may lose millions.  Latest reports have disclosed that the decentralized nature of Ethereum (ETH) which is its main selling point could be under threat for [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T09:00:39.000Z",
    "title": "Unique Staking Rewards Draw Attention to DigiToads (TOADS) as Ripple’s (XRP) Ethereum Sidechain Prepares for Main Net Launch",
    "url": "https://www.crypto-news-flash.com/unique-staking-rewards-draw-attention-to-digitoads-toads-as-ripples-xrp-ethereum-sidechain-prepares-for-main-net-launch/?utm_source=rss&utm_medium=rss&utm_campaign=unique-staking-rewards-draw-attention-to-digitoads-toads-as-ripples-xrp-ethereum-sidechain-prepares-for-main-net-launch",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The world of blockchain and cryptocurrency is abuzz with anticipation as Ripple’s Ethereum sidechain gears up for its highly anticipated main net launch. At the same time, DigiToads (TOADS) has been generating significant interest among investors and enthusiasts alike, thanks to its unique staking rewards. DigiToad&#8217;s innovative approach to staking has captivated the attention of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T08:53:58.000Z",
    "title": "“The People’s Coin” Spacemesh Launches Following Five Years of Research",
    "url": "https://www.crypto-news-flash.com/the-peoples-coin-spacemesh-launches-following-five-years-of-research/?utm_source=rss&utm_medium=rss&utm_campaign=the-peoples-coin-spacemesh-launches-following-five-years-of-research",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Spacemesh_PR_Header_1689238825YJz3R65ZNp.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Spacemesh_PR_Header_1689238825YJz3R65ZNp.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Spacemesh_PR_Header_1689238825YJz3R65ZNp-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Spacemesh_PR_Header_1689238825YJz3R65ZNp-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Spacemesh_PR_Header_1689238825YJz3R65ZNp-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Tel Aviv, israel, July 14th, 2023, Chainwire Spacemesh is proud to announce today, that after five years of work, they will at long last be performing network genesis on July the 14th at 08.00 UTC. Spacemesh chose the date of July 14th, which commemorates the storming of the Bastille, as the day to launch the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T08:46:21.000Z",
    "title": "Unlocking the Digital Revolution: Google Embraces NFTs and Tokenized Assets with Groundbreaking Policy Shift",
    "url": "https://www.crypto-news-flash.com/unlocking-the-digital-revolution-google-embraces-nfts-and-tokenized-assets-with-groundbreaking-policy-shift/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-digital-revolution-google-embraces-nfts-and-tokenized-assets-with-groundbreaking-policy-shift",
    "description": "<img width=\"1028\" height=\"689\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/NFT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/NFT.jpg 1028w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/NFT-300x201.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/NFT-1024x686.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/NFT-768x515.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/NFT-104x69.jpg 104w\" sizes=\"(max-width: 1028px) 100vw, 1028px\" />Google has updated its application store policies to help Web3 developers provide blockchain-based digital assets to users without advertising them. The move will significantly help in pushing the cryptocurrency and blockchain agenda mainstream in the coming years. The meteoric growth of blockchain technology has brought forth a new class of Web3 economy fueled by the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T08:43:04.000Z",
    "title": "Polygon Unleashed: MATIC undergoes Remarkable Rebranding, Introducing POL Token and Pioneering Community Treasury Fees",
    "url": "https://www.crypto-news-flash.com/polygon-unleashed-matic-undergoes-remarkable-rebranding-introducing-pol-token-and-pioneering-community-treasury-fees/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-unleashed-matic-undergoes-remarkable-rebranding-introducing-pol-token-and-pioneering-community-treasury-fees",
    "description": "<img width=\"512\" height=\"249\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-300x146.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-24x12.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-36x18.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-48x23.jpg 48w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Polygon plans to upgrade MATIC to a multifaceted POL token, pending community approval, expanding its utility across all Polygon protocols. The POL token is designed to secure, align, and grow the Polygon ecosystem, offering multiple reward streams and roles to its validators. Polygon&#8217;s Big Reveal: The POL Token In an exciting turn of events, Polygon&#8217;s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-14T09:06:29.000Z",
    "title": "Top 3 Cryptos That Grew the Most with Ripple’s Victory",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-cryptos-that-grew-the-most-with-ripples-victory/",
    "description": "<p>On July 13th, a US Judge decided that XRP, the native token of Ripple&#8217;s blockchain, is not a security. So, XRP boosted its price almost to $1, and the rest of the coins also grew.  In this article, you will discover the 3 cryptos that are having the best performance in the last 24 hours. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-cryptos-that-grew-the-most-with-ripples-victory/\">Top 3 Cryptos That Grew the Most with Ripple’s Victory</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]