[
  {
    "source": "Cointelegraph",
    "date": "2024-03-22T01:06:55.000Z",
    "title": " Sleeper ICO-era project becomes 3rd most actively developed crypto app ",
    "url": "https://cointelegraph.com/news/sleeper-project-now-third-most-actively-developed-crypto-app-santiment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWZkMGU0OTItOTVlZi00NGIwLTlkMWQtNGMxMzRmZWRhN2QzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A decentralized messaging app has soared into the top three most actively-developed crypto projects of the last month.</p>\n                    <p><p>An almost-forgotten crypto “communication” app born during the initial coin offering (ICO) boom has n surged to become one of the most actively developed projects in the crypto ecosystem. </p><p>According to a March 21 <a href=\"https://twitter.com/santimentfeed/status/1770889841578012944?s=20\" target=\"_blank\" rel=\"noopener nofollow\">post</a> from crypto intelligence platform Santiment, a dormant Ethereum-based project called Status — an open-source crypto messaging app — now stands as the third-most actively developed project over the last thirty days.</p><p>Santiment shared that Status had seen over 434 GitHub commits in the past month, ten less than Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) and 17 less than the most actively developed project, Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>). </p><p><a href=\"https://cointelegraph.com/news/sleeper-project-now-third-most-actively-developed-crypto-app-santiment\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-22T00:45:00.000Z",
    "title": "UN adopts global AI resolution to ensure ‘safe, secure and trustworthy’ AI advancement",
    "url": "https://cryptoslate.com/un-adopts-global-ai-resolution-to-ensure-safe-secure-and-trustworthy-ai-advancement/",
    "description": "<p>The United Nations General Assembly adopted a global artificial intelligence (AI) resolution on March 21. The new resolution aims to promote &#8220;safe, secure, and trustworthy&#8221; AI development. The Assembly said it is paramount that AI is developed in a sustainable manner that does not threaten human rights. The AI Resolution The UNGA has requested member [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/un-adopts-global-ai-resolution-to-ensure-safe-secure-and-trustworthy-ai-advancement/\">UN adopts global AI resolution to ensure &#8216;safe, secure and trustworthy&#8217; AI advancement</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T01:00:50.000Z",
    "title": "MakerDAO Stakeholder-Focused Updates Drive MKR Price Up By 10%",
    "url": "https://www.newsbtc.com/maker-mkr/makerdao-stakeholder-focused-updates-drive-mkr-price-up-by-10/",
    "description": "Blockchain protocol MakerDAO (MKR) continues to see significant gains, maintaining a strong upward trend throughout the year. MKR has seen significant growth of over 358%, accompanied by positive metrics reflecting increased adoption and usage of the protocol. In addition, upcoming voting initiatives aim to further increase the platform&#8217;s benefits for its stakeholders. MakerDAO Announces Plans For Rate System Changes In a recent announcement, MakerDAO stated that it closely monitors developments in the cryptocurrency market and has gained a better understanding of the impact of recent proposals.  As a result, the protocol is recommending the next set of changes to its rate system. MakerDAO emphasized that further adjustments will likely be introduced shortly, contingent upon market dynamics, such as prices, leverage demand, and the external rate environment encompassing centralized finance (CeFi) funding rates and decentralized (DeFi) effective borrowing rates.  Related Reading: US Spot Bitcoin ETFs Experience Record Outflows, Losing $740 Million In Three Days The protocol further noted that the Maker rate system will be adjusted accordingly if the external rate environment continues to exhibit signs of decline. Efforts are underway to update the rate system language within the Stability Scope, including developing a new iteration of the Exposure model. These updates aim to ensure that the system can adjust rates more gradually and effectively in the future. Based on recommendations from BA Labs, a blockchain infrastructure provider, the Stability Facilitator proposes various parameter changes to the Maker Rate system, which will be subject to an upcoming Executive vote.  As shown in the table above, the proposed changes include reducing the Stability Fee by 2 percentage points for various collateral types such as ETH-A, ETH-B, ETH-C, WSTETH-A, WSTETH-B, WBTC-A, WBTC-B, WBTC-C. In addition, the Dai Savings Rate (DSR) and the Effective DAI Borrowing Rate for Spark will also be reduced by 2 percentage points. However, one active protocol user offered an alternative viewpoint, suggesting using the demand shock opportunity to expand the net interest margin. While agreeing with the proposed 2% interest rate reduction for borrowers, the user advocates for a larger 4% reduction in the DSR, which he believes will further benefit MakerDAO&#8217;s net interest margin. Ultimately, the outcome of the voting process will determine whether these proposed changes are implemented and benefit the stakeholders of MakerDAO. Further decisions regarding rates and fees will be made based on the results.  Market Cap Skyrockets According to data from Token Terminal, MakerDAO has demonstrated significant growth and positive performance across various key metrics over the past 30 days.  In terms of market capitalization, MakerDAO&#8217;s fully diluted market cap has reached approximately $3.07 billion, reflecting a notable increase of 40.9% over the past 30 days. The circulating market cap is around $2.82 billion, showing a similar growth rate of 41.1%. On another note, the total value locked (TVL) in MakerDAO has increased by 10.1% over the past 30 days to approximately $7.05 billion.  The token trading volume for MakerDAO has surged 126.6% over the past month, reaching approximately $4.35 billion. This increase in trading volume suggests heightened market activity and interest in the protocol. In terms of user activity, MakerDAO has seen an increase in daily active users, with an increase of 32.2% to 193 users. On the other hand, weekly active users decreased by 22.6% to 783 users. However, monthly active users have shown a positive growth rate of 10.0%, reaching 2.88k users. Short-Term Outlook For MKR Regarding price action, MKR is currently trading at $3,158, reflecting a 4.8% growth in the past 24 hours, 10% in the past seven days, and an impressive 49% increase in the past fourteen and thirty-day time frames. The token has encountered a support wall for the short term at $3,048. This support level is significant for the token&#8217;s growth prospects. Another key support level is at $2,884, which further contributes to the token&#8217;s short-term stability and potential growth. Related Reading: Crypto Expert Reveals The Possibility Of Bitcoin Reaching $500,000 On the other hand, the nearest resistance level is observed at its 28-month high of $3,321. This level represents the highest point reached by the token since November 2021.  Featured image from Shutterstock, chart from TradingView.com"
  }
]