[
  {
    "source": "CoinDesk",
    "date": "2023-06-29T04:50:48.000Z",
    "title": "SEC Has No Jurisdiction Over Cryptos on Coinbase's Platform, Exchange Claims in Response to Regulator's Lawsuit",
    "url": "https://www.coindesk.com/policy/2023/06/29/sec-has-no-jurisdiction-over-cryptos-on-coinbases-platform-exchange-claims-in-response-to-regulators-lawsuit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. crypto exchange Coinbase claimed that digital assets listed on its platform fall outside the U.S. Securities and Exchange Commission's (SEC) purview in its first legal response to the regulator's lawsuit. The SEC sued Coinbase at the beginning of June, alleging that a dozen of the cryptocurrencies offered through its wallet or trading platforms were unregistered securities. In its answer, filed early Thursday, Coinbase claimed that these cryptos are not investment contracts and therefore are not securities."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-29T04:40:22.000Z",
    "title": "Humans Are More Likely to Believe Disinformation Generated By AI",
    "url": "https://decrypt.co/146662/humans-more-likely-to-believe-disinformation-generated-by-ai",
    "description": "Even before GPT-4's launch, a new study finds disinformation created with GPT-3 was harder to detect than human-made falsehoods."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T04:51:52.000Z",
    "title": "BlackRock lauds AI as ‘mega force’ to drive returns",
    "url": "https://cointelegraph.com/news/blackrock-ai-mega-force-returns-mid-year-outlook",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/535644fb-3883-47cb-8eea-3b4ee8f0b93a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>AI could prove to be a boon for investors looking for gains in today's “unusual” market.</p>\n                    <p><p>Global investment titan BlackRock, which manages some $10 trillion in assets, has declared artificial intelligence a “mega force” that could create significant returns for investors in today’s “unusual” market.</p><p>In its mid-year outlook <a href=\"https://www.blackrock.com/corporate/literature/whitepaper/bii-midyear-outlook-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, the BlackRock Investment Institute detailed their thesis for increased investment in AI — pointing to multiple “disruptive” themes that could see the sector grow rapidly over the coming years. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b0046152-5ed8-408f-9fd1-f57d554faf1d.png\"  /><figcaption style=\"text-align: center;\"><em>S&amp;P market cap vs relative performance from 1990. Source: BlackRock.</em></figcaption></figure><p>The report drew special attention to the fact that gains in the S&amp;P 500 — the index that tracks the 500 largest companies in the United States — have become increasingly concentrated in a handful of tech stocks. The firm says investment in AI is a good way to capitalize on this concentration.</p><blockquote>\"We think this unusual equity market shows a mega force like AI can be a big driver of returns even when the macro environment is not your friend.\"</blockquote><p>To BlackRock’s investment team, the most obvious “benefit” of AI lies in automation. While they admitted white-collar jobs are at an “increased risk” of being automated away, it said the resulting cost savings could significantly boost profit margins, especially for companies with high staff costs and an abundance of easily-automated tasks.</p><p>The team added that the nascent tech could prove to be a boon for companies that are currently sitting on a “gold mine” of proprietary data — with AI-powered tools allowing firms to leverage dormant information into “innovative” new models. </p><p>The report also listed the global push towards low-carbon economies, aging populations, and a rapidly-evolving financial system as key drivers of growth in the coming decade. </p><p>BlackRock isn’t alone in giving more airtime to AI. In a June 28 tweet, Matt Huang, the CEO of crypto investment firm Paradigm, said the rapid and varying developments in field of AI are simply “too interesting to ignore.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Paradigm has never been more dedicated to crypto.<br><br>When Fred and I started Paradigm five years ago, there was no master plan. What we had was a shared curiosity for the future, deep conviction in crypto, and a desire to advance the frontier of what’s possible.<br><br>Our best decision…</p>&mdash; Matt Huang (@matthuang) <a href=\"https://twitter.com/matthuang/status/1673786399252955137?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Still, not all commentators are convinced by a bullish AI investment thesis.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/googles-gemini-ai-will-be-more-powerful-than-chat-gpt\"><strong><em>Google says its next AI ‘Gemini’ will be more powerful than ChatGPT</em></strong></a></p><p>Macro-finance commentator @Financelot told his 90,000 followers on Twitter that the AI boom — which has seen shares in GPU-manufacturer Nvidia <a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap\">skyrocket by more than 180%</a> in six months — is actually being fueled largely by demand for specific <a href=\"https://cointelegraph.com/news/nvidia-introduces-ai-supercomputer\">AI-focused computing chips</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The AI narrative was used to mask the true source of chip demand coming from China front-running U.S. export restrictions. That&#39;s why chips were hot but memory (DRAM &amp; NAND) remained in decline.<br><br>Once the U.S. passes the restrictions this whole &quot;AI&quot; narrative implodes overnight. <a href=\"https://t.co/cSvHVTinRC\">https://t.co/cSvHVTinRC</a></p>&mdash; Financelot (@FinanceLancelot) <a href=\"https://twitter.com/FinanceLancelot/status/1674232914404409346?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In his view, once the U.S. implements export restrictions on these chips, the share prices of AI-related companies will falter. </p><p>While there’s bullishness for AI, recent weeks has seen the investment giant has turn its gaze to Bitcoin. On June 15 the <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco#:~:text=At%20least%20two%20investment%20firms,Bitcoin%20ETF%20on%20June%2015.\">firm submitted an application</a> to the Securities and Exchange Commission (SEC) for a spot Bitcoin Exchange Traded Fund (ETF).</p><p>If the application is successful, it will be the first spot Bitcoin trust product to be approved by the regulator. Senior investment analysts from bloomberg <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-grayscale-sec\">have pinned Blackrock’s chance</a> of an approval at 50%.</p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-29T04:52:00.000Z",
    "title": "Bitcoin ETF Race Boosts Crypto Investment Products to $33.4 Billion AUM in June",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-etf-race-boosts-crypto-investment-products-to-33-4-billion-aum-in-june/",
    "description": "Digital asset investment products have seen their total assets under management surge 9.05% over June to reach $33.4 billion, after rising around 69.5% year-to-date. Products offering exposure to Bitcoin saw a notable 12.4% rise in assets under management to $24.4 billion. The month of June proved to be one filled with notable developments in the […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T04:58:17.000Z",
    "title": "XRP Price Topside Bias Vulnerable Unless It Climbs Above $0.50",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-vulnerable-0-50/",
    "description": "Ripple’s token price started a fresh decline from $0.5265 against the US Dollar. XRP price could extend its decline unless it climbs back above $0.50. Ripple’s token price is moving lower below the $0.488 support against the US dollar. The price is now trading below $0.48 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $0.475 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might continue to decline below the $0.444 support in the near term. Ripple’s Token Price Starts Downside Correction In the past few days, Ripple’s XRP saw a downside correction from the $0.5265 resistance against the US Dollar. It dipped below the $0.505 support zone, similar to Bitcoin and Ethereum. The price gained bearish momentum below the $0.480 support zone. A low was formed near $0.446 and the price is now recovering losses. There was a move above the $0.450 and $0.455 resistance levels. XRP surpassed the 23.6% Fib retracement level of the downward move from the $0.5263 swing high to the $0.4460 low. XRP price is now trading below $0.500 and the 100 simple moving average (4 hours). There is also a key bearish trend line forming with resistance near $0.475 on the 4-hour chart of the XRP/USD pair. Initial resistance on the upside is near the $0.475 zone. The first major resistance is near the $0.448 level and the 100 simple moving average (4 hours). It is close to the 50% Fib retracement level of the downward move from the $0.5263 swing high to the $0.4460 low. Source: XRPUSD on TradingView.com A successful break above the $0.48 resistance level might send the price toward the $0.505 resistance. Any more gains might call for a test of the $0.525 resistance. Fresh Decline in XRP? If ripple fails to clear the $0.48 resistance zone, it could start another decline. Initial support on the downside is near the $0.455 zone. The next major support is near $0.445. If there is a downside break and a close below the $0.445 level, XRP’s price could extend losses. In the stated case, the price could retest the $0.425 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $0.455, $0.445, and $0.425. Major Resistance Levels – $0.475, $0.480, and $0.500."
  }
]