[
  {
    "source": "Cointelegraph",
    "date": "2023-12-23T11:03:32.000Z",
    "title": " Ripple’s legal chief unveils SEC’s XRP settlement offer pre-2020 lawsuit ",
    "url": "https://cointelegraph.com/news/ripple-legal-chief-unveils-sec-xrp-settlement-offer-pre-2020-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOWU0YWZiNzAtYmUzMy00OTMwLTlhZDEtNTBmNzk1MzhkOGZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to Ripple’s legal chief, Stuart Alderoty’s post, in 2020, the SEC requested Ripple to acknowledge publicly that XRP was a security asset and allowed a brief window for crypto compliance. </p>\n                    <p><p>Ripple’s legal chief, Stuart Alderoty, had disclosed the content of the Securities Exchange Commission’s (SEC) settlement proposal before the agency filed the lawsuit in December 2020.</p><p>Looking back on the third anniversary of the lawsuit, Alderoty <a href=\"https://twitter.com/s_alderoty/status/1738337842948919804\" target=\"_blank\" rel=\"noopener nofollow\">mentioned</a> the settlement terms proposed by the Commission before initiating the case. He explained that before suing Ripple, Chris, and Brad three years ago today, the SEC suggested a settlement: publicly declaring XRP as a security and allowing the market a brief period to “come into compliance.”</p><p>On Dec. 22, 2020, the <a href=\"https://cointelegraph.com/news/sec-unveils-1-3b-suit-against-ripple-over-xrp#:~:text=SEC%20unveils%20suit%20against%20Ripple%2C%20calling%20XRP%20a%20'%241.3,offering%22%20to%20investors%20since%202013.\">SEC accused Ripple</a>’s co-founder, Christian Larsen, and CEO, Bradley Garlinghouse, of conducting an unregistered digital asset securities offering, raising over $1.3 billion. </p><p><a href=\"https://cointelegraph.com/news/ripple-legal-chief-unveils-sec-xrp-settlement-offer-pre-2020-lawsuit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-23T11:03:45.000Z",
    "title": "Nigeria’s Central Bank Relaxes Crypto Rules, Allows Banks to Open Accounts for Crypto Firms",
    "url": "https://cryptodaily.co.uk/2023/12/nigerias-central-bank-relaxes-crypto-rules-allows-banks-to-open-accounts-for-crypto-firms",
    "description": "The Central Bank of Nigeria (CBN) revised restrictions on banks facilitating crypto transactions. The news comes after the country’s apex bank introduced a comprehensive ban on banks engaging with crypto."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T10:51:49.000Z",
    "title": "JPMorgan ex-banker shakes up Hong Kong",
    "url": "https://www.cryptopolitan.com/jpmorgan-practically-kicked-out-of-hong-kong/",
    "description": "The story of how Nicolas Aguzin, a former JPMorgan star banker, faced challenges at Hong Kong Exchanges and Clearing (HKEX) unravels like a gripping novel. Aguzin&#8217;s tenure as CEO of HKEX, beginning in May 2021, was marked by ambitious initiatives and unconventional ideas, but it also highlighted the complexities and political sensitivities of running one [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-23T11:00:59.000Z",
    "title": "Rumbling Ahead: Avalanche (AVAX) Set To Surge 20% Before Cooling Off – Details",
    "url": "https://www.newsbtc.com/news/rumbling-ahead-avalanche-avax-set-to-surge-20-before-cooling-off-details/",
    "description": "The price of Avalanche (AVAX) has been steadily rising leading up to the holiday season. Consequently, in just over two months, the altcoin has more than quintupled in value. In any case, the price of AVAX still has more potential than most other cryptocurrencies, which have seen rises of about 300% over the same time frame. Investors and aficionados are keeping a careful eye on whether AVAX may reach this milestone before the end of the current year as the cryptocurrency makes steady progress toward the coveted $50 mark, a level it has not hit since May 2022. AVAX Surges: From Resistance Break To $50 Anticipation At the time of writing, AVAX was trading at $45.59, down 2.1% in the last seven days, but sustained a 6.7% rally in the last week, data from Coingecko shows. With a market valuation of more than $17 billion, the altcoin has become one of the largest in the business thanks to its continuous rise. Related Reading: Social Frenzy: Stacks (STX) Hits 8-Month High, But It Unveiled An Intriguing Twist The value of the cryptocurrency has increased dramatically since October, when it was trading at a low of $8.50. With only two months to go, AVAX surged by more than 400%, setting a new annual high of $46.50 and sparking anticipation that it would hit $50 in the remaining days of the year. AVAX achieved a major breakthrough by breaking away from a falling resistance trend line that had held for 750 days since its all-time high, which propelled this incredible ascension. This break free from the established trend line represented a significant technical advancement and was also a major factor in quickening the pace of AVAX&#8217;s price rise. AVAX market cap currently at $16.563 billion. Chart: TradingView.com AVAX&#8217;s solid run so far is attributable to a number of favorable factors driving the broader cryptocurrency market. Macroeconomically, the recent drop in inflation rates and signs of probable interest rate reductions by the Federal Reserve and other central banks in 2024 present a good climate for alternative assets like AVAX. AVAX&#8217;s Potential Amid ETF Hope, Market Optimism Moreover, there is hope that the US Securities and Exchange Commission (SEC) would approve a spot Bitcoin exchange-traded fund (ETF). If this happens, it may pave the way for the introduction of other cryptocurrency ETFs, such as those associated with Avalanche. Related Reading: BONK Crashes 31% After A Solid Month – Is the Success Story Ending? The crypto fear and greed index has risen to 75, signifying a favorable feeling, demonstrating the industry&#8217;s momentum. Historical data indicates that tokens like as AVAX have a tendency to perform well and remain resilient during times of market optimism, which may indicate additional upward movement in the present market environment. Even with AVAX&#8217;s remarkable price surge, changes in Bitcoin&#8217;s price still have an impact. If Bitcoin falls for any reason, the price of Avalanche is probably going to follow. #Avalanche $Avax 1w On track! 👌 pic.twitter.com/pDM4hWzE7S — FLASH (@THEFLASHTRADING) December 21, 2023 Meanwhile, crypto analysts on X believe that the trend is likely to go upward. With a target price of $65, Flash has a bullish projection. His bullish view stems from a breakaway from a long-term trend and a move over a horizontal resistance zone. Additionally, Bluntz Capital tweeted a bullish wave count that suggests the price of AVAX will finish the fifth and final wave close to $55. Meanwhile, the price of AVAX stays above the weekly support level at $40 and advances into the resistance zone, which is located between $51 and $55. When compared to the current price of $45.49, this move would represent a gain of around 20%. With momentum growing and significant changes expected in the cryptocurrency scene, Avalanche (AVAX) could experience a substantial % surge before a cooldown. The interplay of economic factors, regulations, and market sentiment creates an engaging story for both AVAX enthusiasts and investors. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-23T10:49:32.000Z",
    "title": "Shiba Inu’s Supply Drop; Render & Borroe Finance Predicted to Soar 70%",
    "url": "https://www.crypto-news-flash.com/shiba-inus-supply-drop-render-borroe-finance-predicted-to-soar-70/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-supply-drop-render-borroe-finance-predicted-to-soar-70",
    "description": "<img width=\"512\" height=\"271\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-8-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-8-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-8-1-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-8-1-150x79.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-8-1-450x238.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic world of cryptocurrencies, Shiba Inu (SHIB) has recently made headlines with its significant supply drop. This event comes at a time when other altcoins like Render (RNDR) and Borroe Finance ($ROE) are also gearing up for a potential surge, with predictions of a 70% increase in value. Let&#8217;s dive into these developments [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-23T10:45:00.000Z",
    "title": "Arbitrum (ARB) and Optimism (OP) Are Ready to Run: Analyst",
    "url": "https://coinedition.com/arbitrum-arb-and-optimism-op-are-ready-to-run-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Arbitrum OP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in.png 730w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-313x175.png 313w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-129x73.png 129w, https://coinedition.com/wp-content/uploads/2023/12/Arbitrum_ARB_vs_Optimism_OP_Which_Layer_2_Solution_Will_Surge_in-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>ARB and OP may be ready for an upward run, an analyst opined. ARB was overbought but an entry around $1.10 could be perfect before another increase. OP may eye $4 as upward momentum continues to rise. According to Altcoin Sherpa, an analyst on X, the duo of Arbitrum (ARB) and Optimism (OP) are in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/arbitrum-arb-and-optimism-op-are-ready-to-run-analyst/\">Arbitrum (ARB) and Optimism (OP) Are Ready to Run: Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]