[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T12:00:48.000Z",
    "title": "US reportedly plans to restrict China’s access to cloud computing services ",
    "url": "https://cointelegraph.com/news/us-reportedly-plans-to-restrict-china-s-access-to-cloud-computing-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3e229422-01e7-45a3-88a5-25010dca5de2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Report says sources close to the situation have said U.S. officials plan to restrict Chinese companies’ access to cloud computing services as a security measure.   </p>\n                    <p><p>Officials in the United States are considering restricting China’s access to cloud computing services in an effort to safeguard the country’s advanced technology, according to a report in the Wall Street Journal. </p><p>According to the <a href=\"https://www.wsj.com/articles/u-s-looks-to-restrict-chinas-access-to-cloud-computing-to-protect-advanced-technology-f771613?mod=hp_lead_pos1\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, the Biden Administration proposed adding controls to the amount of access China companies will have to U.S.-based cloud computing services such as Amazon Web Services (AWS) and Microsoft. </p><p>Providers, including those mentioned above, would need government approval prior to providing services that use powerful artificial intelligence (AI) chips to Chinese clients, the WSJ said, citing sources close to the matter. </p><p>This would close a major loophole in its already existing sanctions on chip exports, through which national security analysts have suspected Chinese companies have been able to bypass restrictions via cloud services, the report said. </p><p>Analysts speculated that Chinese customers could access advanced computing capabilities through cloud services without the need to purchase the sanctioned chips like Nvidia’s A100 chips popularly used in AI development. </p><p>According to the sources, the Commerce Department should unveil the new measures in the following weeks, the WSJ reported. </p><p>Cointelegraph has reached out to both Google Cloud and AWS for comment, but has not yet received a response.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/crypto-friendly-dbs-bank-launches-digital-yuan-payment-tool\"><strong><em>Crypto-friendly DBS Bank launches digital yuan payment tool</em></strong></a></p><p>In October 2022, the U.S. imposed its initial sanctions on Chinese access to semiconductor chips in an effort to slow down industry advancement abroad. Those regulations cut Chinese developers off from more advanced chips on the market.</p><p>On June 28, the administration said it was <a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\">considering tightening the above measures</a> to include clamping down the computing power in chips that are still able to be exported. </p><p>The Chinese government then announced on July 3 that it plans to implement <a href=\"https://cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials\">controls on exports of gallium and germanium</a> products, both of which are heavily used to produce semiconductors of the caliber needed for AI development. </p><p>China is one of the world’s top producers of gallium and germanium. Limited access to these metals could have a potentially negative impact on the chip manufacturing industry.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI Eye: AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T12:00:00.000Z",
    "title": "Crypto hacks and exploits snatch over $300M in Q2 2023: Report",
    "url": "https://cointelegraph.com/news/crypto-hacks-and-exploits-snatch-over-300m-in-q2-2023-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/48d778c8-87c0-4ea2-b815-634f41635341.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While total year-over-year losses to hackers dropped 58%, BNB Chain saw 119 security incidents leading to losses of around $70 million, followed by Ethereum, with 55 incidents netting hackers over $65 million. </p>\n                    <p><p>More than $300 million in digital assets were lost to crypto hacks and exploits in the second quarter of 2023, according to on-chain data compiled in the quarterly report by the blockchain security company CertiK. </p><p>In the report, CertiK showed that there were a total of 212 security incidents in the quarter. The firm noted that across the incidents, malicious actors drained a total of $313,566,528 from Web3 protocols. Compared to the second quarter of 2022, when hacks and exploits took $745 million, the security firm pointed out that there was a 58% decline in the amount lost. </p><p>Despite the lower total amount recorded compared to 2022, the quarter saw an increase in the value lost to exit scams, which amounted to around $70 million in the second quarter of 2023. This is almost double the losses from similar scams in the first quarter, which was around $31 million. </p><p>Meanwhile, losses from flash loans and oracle manipulation exploits saw a drastic decrease in the second quarter compared to the first quarter of 2023. In the first quarter, there were a total of 52 oracle manipulation attacks leading to losses of around $222 million, with the infamous Euler Finance hack <a href=\"https://cointelegraph.com/news/euler-labs-hacker-returns-all-of-the-recoverable-funds-timeline\">contributing 85% to the losses</a>. </p><p>In the second quarter, there were a total of 54 flash loan and oracle manipulation attacks, which led to losses of around $23 million, an 89% decline compared to the first quarter. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/poly-network-users-withdraw-bridge-exploit-affects-57-crypto\"><strong><em>Poly Network urges users to withdraw after exploit affects 57 crypto assets</em></strong></a></p><p>Apart from this, CertiK also highlighted that out of all the blockchains the firm analyzed, BNB Chain recorded the most incidents, with 119 incidents leading to $70,711,385 in losses. Ethereum came in second place, with 55 incidents netting hackers $65,999,953.</p><p>Meanwhile, a report from PeckShield showed that half of stolen nonfungible tokens (NFTs) are being <a href=\"https://cointelegraph.com/news/peckshield-half-of-stolen-nf-ts-are-sold-within-3-hours-peck-shield\">sold within three hours</a> of being stolen by malicious actors — indicating that hackers are quick to offload their ill-gotten gains after performing NFT theft. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T12:00:00.000Z",
    "title": "UAE free zone teams up with HBAR Foundation to support Web3 startups ",
    "url": "https://cointelegraph.com/news/uae-free-zone-teams-up-with-hbar-foundation-to-support-web3-startups",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/eff8d41d-ad17-4b93-9156-e5970eb6b314.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The collaboration will give startups access to a grant program and support in areas such as technology, marketing and business development.  </p>\n                    <p><p>RAK Digital Assets Oasis (RAK DAO), a free zone in the United Arab Emirates (UAE) dedicated to crypto companies, has signed a memorandum of understanding (MOU) with the HBAR Foundation to support its ecosystem members through a grant program and by providing assistance in leveraging the Hedera blockchain. </p><p>In an announcement sent to Cointelegraph, His Highness Sheikh Mohammed bin Humaid bin Abdullah Al Qasimi, the chairman of RAK DAO, said that the collaboration with HBAR Foundation will drive sustainable growth for the ecosystem and will shape a future where the UAE emirate of Ras Al Khaimah will emerge as a \"global leader in the digital economy.\" He said: </p><blockquote>“By creating and enabling the world’s first licensed Web3 ecosystem, we are facilitating the seamless exchange of information, connecting businesses across sectors, and paving the way for synergistic relationships to flourish.” </blockquote><p>According to the announcement, the collaboration will give startups access to a comprehensive grant program and specialized support in the areas of technology, marketing and business development. This also aims to scale adoption for new ideas in the Web3 space. The two organizations will also create other initiatives including startup pitching sessions, and launch joint projects such as venture studios or accelerators. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-tower-dubai-first-look-at-design-images\"><strong><em>First look at the Bitcoin Tower in Dubai: Dev shares initial design</em></strong></a></p><p>RAK DAO is a part of the UAE's efforts to support crypto businesses by offering a free-trade zone in the country that’s dedicated to Web3. Free zones within the UAE allow entrepreneurs to have 100% ownership of their business within the country. These trade zones also often have their own tax schemes and regulatory frameworks. </p><p>On Feb. 28, the emirates of Ras Al Khaimah announced that it will <a href=\"https://cointelegraph.com/news/uae-emirate-to-launch-free-zone-for-digital-and-virtual-asset-firms\">support emerging technologies</a> such as the metaverse, blockchain, <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">nonfungible tokens (NFTs)</a>, <a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organizations (DAOs)</a>, <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized applications (DApps)</a> and other crypto-related businesses through RAK DAO. </p><p>The UAE has been one of the jurisdictions to show support for the crypto space. The country’s regulatory approach to crypto has attracted the attention of global crypto businesses like <a href=\"https://cointelegraph.com/news/binance-eyes-uae-as-possible-base-for-future-operations\">Binance</a>, <a href=\"https://cointelegraph.com/news/coinbase-execs-visit-uae-to-test-potential-of-strategic-hub-for-international-operations\">Coinbase</a> and <a href=\"https://cointelegraph.com/news/crypto-exchange-gemini-uae-crypto-license\">Gemini</a> amid regulatory uncertainty in the United States. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-dubai/\"><strong><em>Crypto City: Guide to Dubai</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T11:41:00.000Z",
    "title": "Binance halts support for deposits and withdrawals of some Multichain-bridged tokens ",
    "url": "https://cointelegraph.com/news/binance-ceases-support-for-deposits-and-withdrawals-of-suspended-multichain-bridged-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6cce8833-e372-46a6-a45e-6d040681c9ea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This decision has implications for users who utilize bridged tokens on networks such as BNB Smart Chain, Fantom, Ethereum and Avalanche blockchains.</p>\n                    <p><p>Binance cryptocurrency exchange has announced it is ceasing its support of deposit and withdrawal services for a range of Multichain-bridged tokens, effective from July 7, 2023. </p><p>Binance has officially <a href=\"https://www.binance.com/en/support/announcement/updates-on-the-suspension-of-deposits-withdrawals-for-multichain-bridged-tokens-3c7d279dd37043bd8290ac718b5c08a4\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> in its blog that the tokens impacted by the decision are Polkastarter (POLS) via BNB Smart Chain, Alchemy Pay (ACH) via BNB Smart Chain, Beefy.Finance (BIFI) via Fantom Network, SuperVerse (SUPER) via BNB Smart Chain, Travala (AVA) via Ethereum Network, Spell Token (SPELL) via Avalanche C-Chain, Alpaca Finance (ALPACA) via Fantom Network and Harvest Finance (FARM) via BNB Smart Chain.</p><p>This news comes after deposits for various Multichain-bridged tokens were <a href=\"https://cointelegraph.com/news/binance-suspends-deposits-for-bridged-tokens-seeks-clarity-from-multichain-team\">earlier suspended on May 25, 2023,</a> following days of stalled transactions that sparked uncertainty surrounding the Multichain protocol.</p><p>This decision to now cease support has implications for users who utilize bridged tokens on networks such as BNB Smart Chain, Fantom, Ethereum and Avalanche blockchains.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> will suspend deposits and withdrawals for a number of Multichain-bridged tokens from July 7, 00:00 UTC until further notice.<br><br>More details here <a href=\"https://t.co/CL7V8UeT9l\">https://t.co/CL7V8UeT9l</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1676493768856305664?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the blog announcement, Binance recognized the inconvenience caused and highlighted that the cease in support is a direct consequence of the <a href=\"https://cointelegraph.com/news/multichain-team-cannot-locate-ceo-halts-service-for-affected-chains\">ongoing challenges faced by the Multichain protocol</a>. </p><p>While deposits and withdrawals are halted on Binance, the wallets holding these assets on other networks remain accessible. Amidst the turbulence around Multichain, certain bridges have been reported as inaccessible, while there are allegations of the protocol's co-founder and CEO, Zhao Jun, <a href=\"https://cointelegraph.com/news/multichain-team-cannot-locate-ceo-halts-service-for-affected-chains\">going missing and speculation of a potential police investigation.</a></p><p>According to Coinmarketcap, the market price of Multichain (MULTI) currently <a href=\"https://coinmarketcap.com/currencies/multichain/\" target=\"_blank\" rel=\"noopener nofollow\">stands</a> at $3.22, reflecting a 3.95% decrease. Based on estimates, Multichain would need to experience a 24-fold increase in value to reach $100. Assuming a consistent annual growth rate of 25%, it would take approximately 8.5 years for Multichain to reach the $100 mark.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-australia-offices-reportedly-searched-by-local-regulator\"><strong><em>Binance Australia offices reportedly searched by local regulator</em></strong></a></p><p>Cointelegraph has reached out to Binance for more information on this development but hasn't yet received a response at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hk-crypto-etfs-binance-maverick-poly-network-hacked-asia-express/\"><strong><em>Binance warns on Maverick FOMO</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T11:49:57.000Z",
    "title": "U.S. national debt experiences an $851 billion surge following debt ceiling suspension",
    "url": "https://cryptoslate.com/insights/u-s-national-debt-experiences-an-851-billion-surge-following-debt-ceiling-suspension/",
    "description": "<p>Quick Take CryptoSlate reported on June 14 that the U.S. debt was approaching $32 trillion. Since then, the debt has continued to grow rapidly. According to WolfStreet, last Friday, June 30, the Treasury Department reported that the U.S. national debt had seen a dramatic increase of $851 billion within just a month following the suspension [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/u-s-national-debt-experiences-an-851-billion-surge-following-debt-ceiling-suspension/\">U.S. national debt experiences an $851 billion surge following debt ceiling suspension</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-05T12:01:00.000Z",
    "title": "Primex Finance Unveils Mainnet Plans, Set to Launch in September 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/07/primex-finance-unveils-mainnet-plans-set-to-launch-in-september-2023/",
    "description": "Non-custodial prime brokerage protocol Primex Finance is thrilled to announce the upcoming launch of its highly anticipated mainnet. With the code frozen and the auditing process underway, the Primex core team is making significant strides towards the release. With independent auditors expected to complete the auditing process in the next 12 weeks, Primex Finance is […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T11:57:00.000Z",
    "title": "BAYC Hits 20-Month Low",
    "url": "https://cryptodaily.co.uk/2023/07/bayc-hits-20-month-low",
    "description": "<p>The floor price of the Bored Ape Yacht Club NFT collection has dropped to the lowest in the last 20 months.&nbsp;</p>\nBAYC Drops Below 30 ETH\n<p>The forecast does not look good for NFTs, as the most popular collection ever, the Bored Ape Yacht Club (BAYC), has sunk to a 20-month low. According to a report from the data analytics platform, CoinGecko, the floor price of the NFT collection from the iconic Yuga Labs drastically fell to 27.4 ETH, which is around $53,000 on Sunday evening.&nbsp;</p>\n<p>NFT marketplace OpenSea claimed that the collection&rsquo;s trading volume has dropped by a significant 38% in just 24 hours. It did recover from the bottom, however, slightly, settling around 29.5 ETH at the time of writing.&nbsp;</p>\n50% Decrease Since April&nbsp;\n<p>The floor price is the lowest value a seller is willing to accept for an NFT and is a crucial indicator of the NFT&rsquo;s demand and popularity. For the BAYC collection, the floor price has experienced a 50% decrease since April of this year.&nbsp;</p>\n<p>At the beginning of the month, it was being traded at 64 ETH, equivalent to approximately $126,000. However, across the month, pseudonymous collector Franklin sold 27 NFTs from his BAYC collection, which must have compounded the lack of interest further, dropping the floor price to a five-month low of 55.6 ETH, or about $110,000.</p>\nCollectors Questioning BAYC Investment\n<p>This is tough news for the collection, which has almost always seen high demand. In fact, the last time its floor price was below 30 ETH was back in October 2021. However, soon after, the NFT boom hit, and BAYC&rsquo;s floor price skyrocketed to new all-time highs.&nbsp;</p>\n<p>The Bored Ape Yacht Club, a popular and highly sought-after NFT collection known for its unique pixelated ape characters, had garnered significant attention and fetched substantial prices in the past, its highest being 153.7 ETH (approximately $430,000) in April 2022.&nbsp; However, the recent drop in floor prices has caught many collectors off guard, leaving them questioning the future of the collection and the broader NFT market.&nbsp;</p>\nMany Challenges For NFT Market\n<p>Other than the overall bearish market, experts also believe that the initial frenzy and hype surrounding NFTs have subsided, leading to a decline in demand and, subsequently, lower prices. According to OpenSea, this could be a result of the long crypto winter that pulled down the price of Ethereum. As a result, this has affected the price of the NFT collections like BAYC, which are powered by Ethereum. Other collections affected by the crypto winter are&nbsp; MoonBirds, Azuki, Doodles, and others.&nbsp;</p>\n<p>Moreover, the BAYC collection itself has seen a surge in supply that has put additional pressure on the prices, leading to the significant drop witnessed recently.</p>\n<p>Additionally, the increased regulatory scrutiny toward NFTs and the broader cryptocurrency industry has introduced an element of uncertainty, causing some investors to pull back and leading to a decline in prices.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T12:02:59.000Z",
    "title": "Crypto markets soar as Bitcoin outshines stocks in H1 2023: Insights and forecasts for H2",
    "url": "https://www.cryptopolitan.com/bitcoin-outshines-stocks-in-h1-forecasts-h2/",
    "description": "Between the beginning of January and the end of June, Bitcoin increased by 84%, rising beyond $30,000 to record its best first-half year since 2019, when it debuted below $3,500.Despite the highest first-half performance in four decades for the tech-heavy Nasdaq, the index most correlated with tokens, the largest digital asset, still beat stocks. It&#8217;s ... <a title=\"Crypto markets soar as Bitcoin outshines stocks in H1 2023: Insights and forecasts for H2\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-outshines-stocks-in-h1-forecasts-h2/\" aria-label=\"More on Crypto markets soar as Bitcoin outshines stocks in H1 2023: Insights and forecasts for H2\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T11:55:40.000Z",
    "title": "Which Coin Will Hit $1 First and Why: Stellar (XLM), Tron (TRX), or VC Spectra (SPCT)",
    "url": "https://www.cryptopolitan.com/which-coin-will-hit-1-first-and-why-stellar-xlm-tron-trx-or-vc-spectra-spct/",
    "description": "The crypto world is a battlefield; only one token reaches the top spot. So, which one will navigate the murky waters of the market to emerge the victor, carrying the trophy of honor home?&#160; Is it Stellar (XLM), which has been making promising moves lately, or Tron, which received a low-risk rating recently? Perhaps it&#8217;ll ... <a title=\"Which Coin Will Hit $1 First and Why: Stellar (XLM), Tron (TRX), or VC Spectra (SPCT)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/which-coin-will-hit-1-first-and-why-stellar-xlm-tron-trx-or-vc-spectra-spct/\" aria-label=\"More on Which Coin Will Hit $1 First and Why: Stellar (XLM), Tron (TRX), or VC Spectra (SPCT)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T11:47:21.000Z",
    "title": "Stanford U AI Enrollment Soars as Generative AI Takes Center Stage",
    "url": "https://www.cryptopolitan.com/stanford-university-enrollment-doubles-as-generative-ai-takes-center-stage/",
    "description": "Stanford University, renowned for its close association with the tech industry, is experiencing significant changes driven by the generative AI craze sweeping through Silicon Valley. As interest in generative AI surpasses the hype surrounding cryptocurrencies, enrollment in existing artificial intelligence classes at Stanford has soared. The university has witnessed a doubling of AI-related classes over ... <a title=\"Stanford U AI Enrollment Soars as Generative AI Takes Center Stage\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stanford-university-enrollment-doubles-as-generative-ai-takes-center-stage/\" aria-label=\"More on Stanford U AI Enrollment Soars as Generative AI Takes Center Stage\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T12:04:32.000Z",
    "title": "Taiwanese Government to tackle crypto-powered election bribery",
    "url": "https://crypto.news/taiwanese-government-to-tackle-crypto-powered-election-bribery/",
    "description": "The government of Taiwan has signaled plans to bar crypto from its 2024 presidential elections. The move aims to curb bribery and corrupt practices. The nation’s Supreme Court has prosecuted over 1,3000 cases of election bribery in the past year. &#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T12:00:32.000Z",
    "title": "Bitcoin Humpback Wallets Reach ATH, Is BlackRock Behind The Surge?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-humpback-wallets-ath-blackrock-behind-surge/",
    "description": "A recent development has caught the attention of on-chain analysts and Bitcoin enthusiasts alike. On-chain expert Axel Adler Jr, citing data from CryptoQuant, has revealed that wallets belonging to the &#8216;Humpback&#8217; cohort, have reached a new all-time high (ATH). This surge has raised speculation about the involvement of institutional giants such as BlackRock or Fidelity. Remarkably, not only humpback but also shrimps are currently displaying a historical high conviction. The Phenomenon Of Bitcoin Humpback Wallets The term &#8216;Humpback&#8217; refers to a specific cohort of wallets within the cryptocurrency ecosystem that hold an impressive amount of Bitcoin, surpassing the 5,000 BTC mark. The recent surge in these wallets reaching an ATH indicates a significant level of accumulation and activity within the crypto market. Related Reading: What’s Next For Bitcoin Price? Bulls Aren’t Running Out Of Steam Yet According to Axel Adler Jr, &#8220;The number of wallets in the &#8216;Humpback&#8217; cohort with a balance of over 5,000 BTC has shown a new ATH. Is this BlackRock, Fidelity, or other giants?&#8221; The mystery surrounding the identity of these major players has piqued curiosity and speculation about their motivations and impact on the market. From the on-chain data alone, it is not possible to determine which entity commenced the accumulation of BTC. However, the temporal connection with the ETF applications is striking. Regardless of the actual entity, a whale accumulation can be interpreted as a positive sign for the price. In this vein, expert Will Clemente recently stated: Even if Blackrock/Fidelity refile and the ETFs still get rejected by Gary, the cat is out of the bag &#8212; institutions want your Bitcoin and are looking to get a piece of this market. It is worth noting that Bitcoin&#8217;s whale &#38; shark addresses (different cohorts combined, wallets with 10 to 10,000 BTC) have continued to accumulate, with a big chunk of BTC buying coming in the last 2 weeks of June as news of ETF launches came out. On-chain-data provider Santiment tweeted on July 1 that the aforementioned cohorts have accumulated 154,500 BTC in the last week of June alone. &#8216;Shrimps&#8217; Show Crazy Conviction While the activity by Humpback wallets is astonishing another intriguing cohort known as the &#8216;Shrimps&#8217; has also come into focus. Lead analyst of Glassnode, Checkmate highlighted today the enthusiasm displayed by the Shrimp cohort in stacking sats (satoshi, the smallest unit of Bitcoin) at an astonishing rate. Related Reading: Bitcoin Price Could See Fresh “Liftoff” if It’s Able to Hold One Key Level He states, &#8220;Bitcoin Shrimp (&#60; 1 $BTC) are stacking sats at a rate of 33.8k $BTC per month. Issuance is ~27.0k $BTC/month. For every 1 new coin, Shrimp are taking 1.25 off the market. Crazy conviction on display.&#8221; The Shrimp cohort, consisting of smaller Bitcoin holders, showcases an incredible conviction and sustained buying behavior despite market fluctuations. As Checkmate points out, &#8220;The last time the little guy stacked this hard was 2017 ATH, buying the top. Five years later, they are stacking harder, faster, and in a more sustained manner, despite all the bullshit. Bullish.&#8221; The simultaneous rise of both the Humpback and Shrimp cohorts signifies a captivating dichotomy within the ecosystem. On one hand, the Humpback wallets, with their massive holdings, hint at the potential involvement of institutional giants like BlackRock or Fidelity. Their accumulation of Bitcoin could serve as a catalyst for increased adoption and market confidence. On the other hand, the resilience and conviction displayed by the Shrimp cohort highlight the broader appeal and democratization of BTC. Despite previous market downturns, the Shrimp class remains undeterred, stacking sats at an unprecedented pace and demonstrating unwavering belief in the long-term potential of Bitcoin. At press time, the BTC price continued to hover below the $31,000 mark, trading at $30,728. Featured image from Thomas Kelley / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T12:00:07.000Z",
    "title": "Monero Price Prediction: Tradecurve Making It’s Mark In The DeFi Trading Arena",
    "url": "https://www.crypto-news-flash.com/monero-price-prediction-tradecurve-making-its-mark-in-the-defi-trading-arena/?utm_source=rss&utm_medium=rss&utm_campaign=monero-price-prediction-tradecurve-making-its-mark-in-the-defi-trading-arena",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T122243.702.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T122243.702.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T122243.702-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T122243.702-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency sector has gathered a high level of reputation due to its turbulence, where traders and investors can experience rapid swings in the value of altcoins. However, even during periods of a market correction, some cryptocurrencies stand out more than others, and today, we will be taking a look at Tradecurve and how it [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T11:55:00.000Z",
    "title": "XRP’s Path Is Rough and Tough, Not For the Weak: Experts Notes",
    "url": "https://coinedition.com/xrps-path-is-rough-and-tough-not-for-the-weak-experts-notes/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/029.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/029.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/029-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/029-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/029-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/029-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/029-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/029-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/029-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/029-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/029-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/029-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/029-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/029-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/029-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/029-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/029-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Brett Hill, the U.K. admin of xSTICK, an XRPL NFT, holding XRP is not for the faint-hearted. Hill expressed this sentiment in a recent tweet, noting that the journey with XRP would test investors&#8217; resolve, making the majority crumble under pressure. Hill advised staying persistent, continuing to save, and clinging to the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrps-path-is-rough-and-tough-not-for-the-weak-experts-notes/\">XRP’s Path Is Rough and Tough, Not For the Weak: Experts Notes</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T11:45:39.000Z",
    "title": "Top Trader Outlines ‘Max Pain’ Scenario for Bitcoin (BTC), Updates Outlook on Ethereum (ETH) and Solana (SOL)",
    "url": "https://dailyhodl.com/2023/07/05/top-trader-outlines-max-pain-scenario-for-bitcoin-btc-updates-outlook-on-ethereum-eth-and-solana-sol/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/more-pain-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who nailed Bitcoin&#8217;s (BTC) 2018 bear market bottom is unveiling a scenario that would liquidate both bulls and bears before the crypto king&#8217;s next leg up begins. Pseudonymous analyst Bluntz tells his 223,400 Twitter followers that Bitcoin could set a bull trap by briefly surging above its yearly high of around $31,500 only [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/top-trader-outlines-max-pain-scenario-for-bitcoin-btc-updates-outlook-on-ethereum-eth-and-solana-sol/\">Top Trader Outlines ‘Max Pain’ Scenario for Bitcoin (BTC), Updates Outlook on Ethereum (ETH) and Solana (SOL)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]