[
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T09:30:07.000Z",
    "title": "Coinbase Chief Legal Officer predicts imminent approval of U.S. Bitcoin ETF",
    "url": "https://cryptoslate.com/coinbase-chief-legal-officer-predicts-imminent-approval-of-u-s-bitcoin-etf/",
    "description": "<p>In an interview with CNBC, Coinbase expressed confidence in the imminent approval of a U.S. spot Bitcoin ETF following the U.S. Securities and Exchange Commission&#8217;s (SEC) legal setback. Paul Grewal, Coinbase&#8217;s Chief Legal Officer, shared insights, highlighting this development&#8217;s potential impact on cryptocurrency markets and investment trends. As he told CNBC, Grewal voiced optimism about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-chief-legal-officer-predicts-imminent-approval-of-u-s-bitcoin-etf/\">Coinbase Chief Legal Officer predicts imminent approval of U.S. Bitcoin ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T09:28:33.000Z",
    "title": "Assessing the synergy of NuggetRush, Polkadot, and Ethereum",
    "url": "https://crypto.news/assessing-the-synergy-of-nuggetrush-polkadot-and-ethereum/",
    "description": "Investors are exploring NuggetRush in the ongoing NUGX presale. Meanwhile, Polkadot developers aim to decentralize ecosystem as whales dump Ethereum"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T09:26:19.000Z",
    "title": "ConsenSys employees sue Joseph Lubin as shares are now ‘worthless’",
    "url": "https://crypto.news/consensys-employees-sue-joseph-lubin-as-shares-are-now-worthless/",
    "description": "A group of two dozen ConsenSys AG&#8217;s early employees filed a lawsuit against crypto entrepreneur Joseph Lubin. Ethereum co-founder and boss of blockchain company ConsenSys, Joseph Lubin, is facing a class action lawsuit filed against him by a group of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T09:14:58.000Z",
    "title": "LBRY announced closure due to debts to SEC",
    "url": "https://crypto.news/lbry-announced-closure-due-to-debts-to-sec/",
    "description": "The LBRY blockchain project announced its closure by publishing a farewell message on its social networks. The project team cited &#8220;several million dollars&#8221; of debts, making the firm&#8217;s continued existence impossible. The project team said multimillion-dollar debt to the U.S.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T09:10:28.000Z",
    "title": "Shiba Inu set for recovery as investors eye Neo and InQubeta",
    "url": "https://crypto.news/shiba-inu-set-for-recovery-as-investors-eye-neo-and-inqubeta/",
    "description": "Crypto remains volatile but Shiba Inu and InQubeta are resilient. The QUBE presale is ongoing"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T09:31:23.000Z",
    "title": "xDay 2023 Day 2: Google And MultiversX Join Hands, How The Big Tech Giant Will Support The Community",
    "url": "https://www.newsbtc.com/breaking-news-ticker/xday-2023-day-2-google-and-multiversx-join-hands-how-the-big-tech-giant-will-support-the-community/",
    "description": "In the next three days, our team at NewsBTC will cover xDay 2023, an event organized by MultiversX in the Palace of Parliament, Romania. Formerly known as Elrond, the project rebranded in 2022 and focused on the Metaverse, one of the hottest trends in crypto. Related Reading: xDay 2023 Day 1: How MultiversX Is Bridging The Metaverse, AI, And Blockchain Under Ecosystem On day two of the event, the MultiversX team, spearheaded by Beniamin Mincu, announced a partnership with big tech giant Google. The partners will work on driving adoption and “accelerating” the expansion of Web3 and the MultiversX ecosystem. Google Cloud Pledges Financial Support For MultiversX Ecosystem In conversation with Daniel Rood, Head of Web3 EMEA for Google Cloud, the partners spoke about the similarities in the obstacles faced by Google to reach billions of users. Mincu stated that this partnership with the big tech giant will help the network increase its adoption. The partnership will be supported by “4 pillars,” as stated by Rood. In that sense, the big tech giant announced that the data running on the MultiversX will be embedded directly into the Google Cloud infrastructure, adding an extra layer of security for the blockchain. In the past two years, MultiversX, formerly Elrond, implemented a sharding architecture capable of handling over 100,000 transactions per second. The project has focused heavily on providing its users and builders with a secure and scalable infrastructure; this partnership is another step in that direction. The MultiversX CEO stated the following about the partnership: We are excited to unveil this collaboration as part of a strategic plan meant to expand our ecosystem and bring significant opportunities for users and developers. MultiversX is in a unique position, with great potential for accelerated growth, and the additional products and services brought by Google Cloud are a key contribution to that. On the stage, Mincu expressed excitement about what the partnership represents for the MultiversX ecosystem and the nascent industry. The announcement was received with applause by the community. The MultiversX CEO emphasized their role as the “engine” driving the ecosystem. Thus, Google Cloud will also offer financial aid and pledge to create spaces like hackathons where builders can benefit from the partnership. Related Reading: Elrond Becomes MultiversX, Unveils 3 New Metaverse Products During the xDay 2023 event, a hackathon will reward the community with $1 million in prizes and further funding. Daniel Rood, Head of Web3 EMEA for Google Cloud, added the following: There are exciting opportunities to enable Web3 developers to build and scale faster and as we explore new verticals within the space, our partnership with MultiversX will allow us to expand our strategy and reach further and solidify our position as one of the main innovation drivers in the blockchain world. Cover image from MultiversX, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T09:32:03.000Z",
    "title": "The Talk of the Town: Will This Coin Eclipse Both Bitcoin and Ethereum?",
    "url": "https://www.crypto-news-flash.com/the-talk-of-the-town-will-this-coin-eclipse-both-bitcoin-and-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=the-talk-of-the-town-will-this-coin-eclipse-both-bitcoin-and-ethereum",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T123119.073.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T123119.073.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T123119.073-300x157.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T123119.073-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With Bitcoin&#8217;s (BTC) increasing hash rate and Ethereum&#8217;s (ETH) growing demand, investors are now wondering if VC Spectra (SPCT) has the potential to outshine both giants and become the talk of the town. Is SPCT poised to surpass these top crypto coins? Let&#8217;s delve into the details! &#62;&#62;BUY SPCT TOKENS NOW&#60;&#60; BTC Price Prediction: Increasing [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-20T09:39:25.000Z",
    "title": "VC Millionaires Investing in THESE Altcoins For BIG PROFITS",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/vc-millionaires-investing-in-these-altcoins-for-big-profits/",
    "description": "<p>Do you want to get rich in crypto? That&#8217;s good, we all do, right? One way of getting there is to follow the money with some altcoins! Or, in other words, look at what VCs are investing in. So, today, I will show you what the three biggest altcoins that VCs are investing in. Remember [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/vc-millionaires-investing-in-these-altcoins-for-big-profits/\">VC Millionaires Investing in THESE Altcoins For BIG PROFITS</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-20T09:15:46.000Z",
    "title": "Trader Updates Outlook on Altcoin That’s Exploded 7,500%+ Year-to-Date, Says Bitcoin Could Soar by Double Digits",
    "url": "https://dailyhodl.com/2023/10/20/trader-updates-outlook-on-altcoin-thats-exploded-7500-year-to-date-says-bitcoin-could-soar-by-double-digits/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg 1748w, https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?resize=1536,900 1536w, https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Trader-Updates-Outlook-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is expressing bullish sentiment on Bitcoin (BTC) as well as a top-100 altcoin by market cap. Pseudonymous crypto trader Altcoin Sherpa tells his 196,800 followers on the X social media platform that the crypto gambling platform Rollbit (RLB) is likely to perform “pretty well” over the short term. According to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/20/trader-updates-outlook-on-altcoin-thats-exploded-7500-year-to-date-says-bitcoin-could-soar-by-double-digits/\">Trader Updates Outlook on Altcoin That’s Exploded 7,500%+ Year-to-Date, Says Bitcoin Could Soar by Double Digits</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]