[
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T19:28:00.000Z",
    "title": "What is Metcalfe’s Law, and why does it matter?",
    "url": "https://cointelegraph.com/explained/what-is-metcalfes-law-and-why-does-it-matter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/edc7677bab68020e7c936d0dd9216483.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Metcalfe’s Law suggests that the more people who use a cryptocurrency, the more valuable and useful it becomes.</p>\n                    <p><h2>Does Metcalfe’s law help explain Bitcoin’s price formation?</h2><p></p><p><em>Yes, Metcalfe’s Law can help explain Bitcoin’s price formation — to some extent. It is relevant to Bitcoin since it implies that the value and utility of the Bitcoin network rise exponentially with its number of users and participants (holders, investors and traders).</em></p><p>The adoption of Bitcoin has been accompanied by a positive feedback cycle in which increased users have resulted in a rise in BTC’s value, drawing even more players. Bitcoin had a small user base in the early days, and its value was relatively low.</p><p>However, when more individuals became aware of and began using the digital currency, its usefulness increased, and the network effect started to take hold. The number of Bitcoin users (wallet addresses) crossed 400 million globally in December 2018 — almost a decade after its inception — illustrating the <a href=\"https://cointelegraph.com/news/report-out-of-460-million-bitcoin-addresses-only-37-economically-relevant\">extent of its acceptance</a>.</p><p><img alt=\"Total number of Bitcoin wallet addresses by December 2018\" src=\"https://s3.cointelegraph.com/storage/uploads/view/a5e047845d3a818c8a19d060e4068ba6.png\" title=\"Total number of Bitcoin wallet addresses by December 2018\"></p><p>The rise in the price of Bitcoin during the 2017 bull run is one of the ideal instances of Metcalfe’s Law in action. More people entered the market as public and media interest in cryptocurrencies grew, which helped to drive up the number of people using BTC. A rise in demand resulting from this increased adoption drove the price of Bitcoin to all-time highs.</p><p>The security network effect also significantly impacted how Bitcoin’s price developed. The security of the blockchain improved with more network participation from miners, which raised user and investor confidence. This, in turn, increased trust in the digital asset, encouraging further adoption and price growth.</p><p>Despite its applicability, Metcalfe’s Law falls short of fully describing the intricate dynamics of Bitcoin’s pricing. Numerous elements, such as market sentiment, governmental changes, macroeconomic trends and technology improvements, impact the cryptocurrency market. Additionally, because of Bitcoin’s volatility, speculation can greatly impact short-term price changes.</p><p>Therefore, potential drawbacks of Metcalfe’s Law for cryptocurrencies, including oversimplifying network value, ignoring connection quality and neglecting external factors, may influence a digital asset’s price. It might not take into consideration ventures with cutting-edge technology but low acceptance. On the other hand, temporary bubbles with inflated valuations may lead to price speculation, implying that one must exercise caution while applying Metcalfe’s law to cryptocurrencies.</p><h2>Why does Metcalfe’s Law matter in crypto?</h2><p></p><p><em>Metcalfe’s Law is an essential concept in the crypto space, as it highlights the significance of network adoption, decentralization, the network effect, market valuation, scalability, security and utility. </em></p><h3>Network adoption and value</h3><p>Metcalfe’s Law, which highlights the significance of network adoption, is particularly relevant in the crypto realm. A cryptocurrency network’s value increases nonlinearly as more people join it. This increase in value has the potential to draw more users, creating a beneficial feedback cycle.</p><h3>Decentralization</h3><p>Metcalfe’s Law supports the idea that a larger, more widely dispersed network is more secure and <a href=\"https://cointelegraph.com/explained/how-to-mitigate-the-security-risks-associated-with-crypto-payments\">resistant to attacks</a>. This is true for decentralized cryptocurrencies like Bitcoin. The risk of single points of failure or control decreases as the network gets more decentralized due to the growth of nodes.</p><h3>Network effects</h3><p>Metcalfe’s Law illustrates the importance of network effects. It motivates initiatives and groups to put their efforts into attracting sizable, engaged user populations. A cryptocurrency’s utility increases with the number of users, increasing its appeal to new users and investors.</p><h3>Market valuation</h3><p>Investors and analysts can assess cryptocurrency projects more effectively by being aware of Metcalfe’s Law. A network with more members is likely to have a higher intrinsic value, which might affect stock market sentiment and investment choices.</p><h3>Scalability and competition</h3><p>As networks get bigger, scalability becomes more important. The capacity of a blockchain may be strained by high transaction volumes and rising user activity. The performance and user experience of the network must be maintained; hence projects must take effective scaling solutions into account.</p><h3>Tokens and utility</h3>Metcalfe’s Law highlights that the services, goods or advantages that <a href=\"https://cointelegraph.com/explained/utility-tokens-vs-equity-tokens-key-differences-explained\">utility tokens </a>offer to their user base determine the value of those tokens. The token increases in value as more users decide that utilizing it is worthwhile.<h2>Types of network effects in crypto</h2><p></p><p><em>Several types of network effects are observed in the crypto space, each contributing to the growth and value of a cryptocurrency network.</em></p><p>Various types of network effects in crypto are explained below:</p><p>The user adoption network effect, which occurs as more users join a cryptocurrency network, increases the network’s value and utility, draws in more users, and is one of the main network effects. An example is Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), with its status cemented by its broad acceptance as the industry’s preeminent cryptocurrency.</p><p>The developer network effect, based on a vibrant development community, is another crucial aspect. A cryptocurrency project can benefit from ongoing technology developments, security upgrades and creative uses when it attracts many developers, increasing its appeal to consumers and investors. With a sizable developer community behind its extensive ecosystem of decentralized apps and <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a>, Ethereum stands out in this regard.</p><p>The security <a href=\"https://cointelegraph.com/news/what-is-the-network-effect\">network effect</a> emphasizes the significance of a large number of miners or validators participating in a network since security is of the utmost importance in the crypto realm. As more miners are added, <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\">PoW-based cryptocurrencies like BTC</a> become more secure, preserving the integrity of the blockchain and the transactions that take place there.</p><p>Interoperability and alliances also help create network effects. Partnerships with other initiatives, businesses, or organizations can increase cryptocurrency’s utility, adoption and visibility. This has been a reality for Ripple’s XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) thanks to partnerships with financial institutions that have allowed it to be incorporated into <a href=\"https://cointelegraph.com/explained/what-are-cross-border-payments-and-how-do-they-work\">cross-border payment solutions</a>. </p><p>Similarly, <a href=\"https://cointelegraph.com/learn/what-is-blockchain-interoperability-a-beginners-guide-to-cross-chain-technology\">interoperability between blockchains</a> helps cryptocurrencies gain additional users and ecosystem projects. An example is Polkadot, boasting over 150 projects built on its platform, providing a seamless communication bridge between diverse blockchains.</p><h2>Metcalfe’s Law in crypto</h2><p></p><p><em>Metcalfe’s Law is a fundamental principle used to comprehend the network effect of communication systems such as cryptocurrencies and blockchain networks.</em></p><p>Metcalfe’s Law was first used in the telecommunications industry, and has subsequently been applied to several social and technological networks. Metcalfe’s Law was created by Robert Metcalfe, the co-inventor of Ethernet, and is used to assess the importance and influence of networks based on the number of connections between its users. </p><p>According to the law, a network’s value is directly inversely proportional to the square of its users or nodes:</p><p><img alt=\"Formula to quantify the network effect\" src=\"https://s3.cointelegraph.com/storage/uploads/view/c35b76a4c6720642cdaf31fa43339e0e.png\" title=\"Formula to quantify the network effect\"></p><p>In the context of <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrencies</a>, Metcalfe’s Law indicates that as a network’s users or players expand in number, so do the <a href=\"https://cointelegraph.com/news/crypto-teaching-next-generation-web3-users-report\">network’s value and utility</a>. This is because, in a decentralized network, more users mean more potential for transactions, interactions, and network effects, which in turn can lead to greater adoption and value appreciation of the cryptocurrency. According to this law, the value of a cryptocurrency network increases not linearly with the number of users but quadratically.</p><p>Moreover, the adoption and practical applications of a cryptocurrency network determine its worth. The more users who find value in using the cryptocurrency for various purposes, the more robust the network's growth potential is. Metcalfe's Law also suggests that the size of the network affects the native token's value. As more users utilize the token for transactions, investments, or other purposes, the demand for the token may increase, potentially leading to price appreciation.</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T19:15:00.000Z",
    "title": "MIT Digital Currency Initiative introduces at-scale, programmable CBDC platform",
    "url": "https://cointelegraph.com/news/mit-digital-currency-initiative-introduces-at-scale-programmable-cbdc-platform",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/123ab84d-fb13-4d31-9550-5d9bcc564a55.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>PARSEC (Parallelized Architecture for Scalably Executing Smart Contracts) runs on the ERC-20 standard, so it could have other applications too. </p>\n                    <p><p>The Massachusetts Institute of Technology (MIT) Digital Currency Initiative (DCI) has introduced the experimental Parallelized Architecture for Scalably Executing Smart Contracts (PARSEC) platform. The platform is open-source and developed with central bank digital currency (CBDC) in mind. </p><p>The developers highlighted the platform’s speed. It performed 118,000 ERC-20 transactions per second on 128 hosts – exceeding public permissionless blockchains, they said. The platform was thus capable of handling cross-border contracting, and could be used to innovate supply chains and compliance checks as well. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ac26c14e-a04f-42c7-9faf-240f96a37cc6.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>PARSEC logo. Source: MIT DCI</em></figcaption></figure><p>PARSEC supports ERC-20 tokens, so an automated market maker launched on the platform could transact with such assets as bonds, tokenized securities and repurchase agreements in addition to <a href=\"https://cointelegraph.com/learn/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">CBDC</a>. Because it supports virtual machines, it would simplify interactions between central and commercial banks.</p><p>The platform required “significant” amounts of continuing research, the developers said. They pointed to security, key management, and data migration tooling as areas that required refinement. Privacy was also left as an open question.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/standard-chartered-pwc-make-case-for-programmable-cbdc-in-china-greater-bay-area\">Standard Chartered, PwC make case for programmable CBDC in China Greater Bay Area</a></em></strong></p><p>Privacy of CBDCs is a particularly painful point for the crypto community, which is largely opposed to any form of CBDC. Programmability is no less controversial. The PARSEC summary stated:</p><blockquote>“We focused on smart contracts because they provide the highest degree of expressivity and functionality to users.”</blockquote><p>That functionality is exactly what many in the crypto community objects to. Crypto researcher Nikhil Raghuveera <a href=\"https://cointelegraph.com/news/stablecoins-must-be-programmable-to-counter-cbdcs\">stated in Cointelegraph in April</a>:</p><blockquote>“Programmability allows for asset backing and decentralization that is not possible under current CBDC designs. Developers should be taking advantage of the programmable opportunities that stable[coin] assets offer rather than trying to compete with CBDCs.”</blockquote><p>Programmability allows restrictions to be placed on the uses of a digital currency, which can be useful in a decentralized finance environment, but it could enable governmental overreach in a CBDC by preventing certain purchases or imposing conditions such as negative interest, opponents argue.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">MIT just released PARSEC, our distributed VM runner! We’ve shown PARSEC running the EVM over 100k transactions per second.<br><br>Web: <a href=\"https://t.co/gUkYvDDeGG\">https://t.co/gUkYvDDeGG</a><br>Code: <a href=\"https://t.co/nvcHc3OKEc\">https://t.co/nvcHc3OKEc</a></p>&mdash; Anders Brownworth (@anders94) <a href=\"https://twitter.com/anders94/status/1686408499067056128?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>PARSEC is the result of research conducted in 2022. It is another product of Project Hamilton, a joint undertaking by the DCI and the Federal Reserve Bank of Boston. Project Hamilton was declared completed in late 2022, shortly after a group of Republicans in the United States House of Representatives wrote to the head of the Boston Fed expressing their reservations about the project. </p><p>The Fed has stated repeatedly that it would not introduce a CBDC without a Congressional mandate, but CBDC <a href=\"https://cointelegraph.com/news/federal-reserve-san-francisco-hiring-crypto-architect-cbdc-project\">research by the Fed is continuing</a>. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/mit-digital-currency-initiative-introduces-at-scale-programmable-cbdc-platform&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cbdcs-kryptonite-for-crypto/\">Are CBDCs kryptonite for crypto?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T19:30:18.000Z",
    "title": "Gamestop to Sunset Crypto Wallet Amid Regulatory Uncertainty; Advises Users to Secure Passphrase",
    "url": "https://news.bitcoin.com/gamestop-to-sunset-crypto-wallet-amid-regulatory-uncertainty-advises-users-to-secure-passphrase/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/gs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Gamestop, the American retailer known for specializing in video game sales, has announced its intention to eliminate its iOS and Chrome Extension crypto wallets on November 1, 2023. The company cited the decision as a response to the existing “regulatory uncertainty of the crypto space.” Gamestop to Discontinue iOS and Chrome Extension Wallets: Regulatory Challenges [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T19:30:32.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T19:28:17.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T19:21:59.000Z",
    "title": "OKX exchange unveils new feature for its Web3 wallets",
    "url": "https://www.cryptopolitan.com/okx-exchange-unveils-new-feature-for-its-web3-wallets/",
    "description": "The Seychelles-based cryptocurrency exchange OKX is set to introduce a new feature, the &#8220;Smart Account,&#8221; to its decentralized wallet, the OKX Wallet. This strategic addition is expected to deliver a new shift in the user experience and transaction convenience.&#160; The unveiling of the Smart Account is an attempt to address the long-standing challenge in the ... <a title=\"OKX exchange unveils new feature for its Web3 wallets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-exchange-unveils-new-feature-for-its-web3-wallets/\" aria-label=\"More on OKX exchange unveils new feature for its Web3 wallets\">Read more</a>"
  }
]