[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T09:42:01.000Z",
    "title": "India trained 3,000 police officials on crypto investigations in 2022–2023",
    "url": "http://cointelegraph.com/news/india-trained-3000-police-crypto-investigators-2022-23",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9e6e6801-9362-40b7-ad8b-3b3b24623393.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Narcotics Control Bureau and the Indian Cyber Crime Coordination Centre trained 141 officials and over 2,800 officers in the financial year 2022–2023.</p>\n                    <p><p>The annual report from India’s Ministry of Home Affairs (MHA) revealed that officials from various cybercrime and police departments were trained in cryptocurrency forensics and investigation during the financial year 2022–2023.</p><p>The MHA highlighted that, under the Narcotics Control Bureau — India’s central law enforcement and intelligence agency — 141 officers were trained on the investigations of darknet and cryptocurrencies and other workshops related to digital footprints and gathering intelligence and evidence from open source and social media, to name a few.</p><p>Additionally, the Indian Cyber Crime Coordination Centre trained more than 2,800 cyber police officials in crypto forensics and investigations and other emerging technologies like anonymization networks and investigating misuse of mobile applications in cyberspace.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-india-working-on-5-point-crypto-legislation\"><strong><em>India working on 5-point crypto legislation as ban is ruled out</em></strong></a></p><p>While India prepares to tackle possible crypto-related crimes amid greater adoption, the nation continues to explore mainstream use cases in blockchain. India’s state-run oil and gas company, Hindustan Petroleum (HPCL), recently launched a blockchain system to enable automated verification of purchase orders (POs).</p><p>HPCL partnered with the blockchain software firm Zupple Labs to integrate its blockchain-based digital credentialing technology into the purchase order system.</p><p>“The implementation helps to automate the verification of HPCL POs to external parties,” a spokesperson for HPCL told Cointelegraph. “This works by integrating the blockchain system with HPCL’s internal e-PO and generates tamper-evident verifiable POs,” the representative noted.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T10:00:40.000Z",
    "title": "Bitcoin hits new year-to-date high of $36.8k amid $160 million market liquidations",
    "url": "https://cryptoslate.com/insights/bitcoin-hits-new-year-to-date-high-of-36-8k-amid-160-million-market-liquidations/",
    "description": "<p>Quick Take Bitcoin surged over 4% in the past five days and hit a new year-to-date high at $36,800 on Nov. 9. This climb towards $37,000 shows a steady increase in investor confidence in Bitcoin, even as the broader market faces volatility. Nevertheless, the crypto industry isn&#8217;t without its share of turbulence. Over the past [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-hits-new-year-to-date-high-of-36-8k-amid-160-million-market-liquidations/\">Bitcoin hits new year-to-date high of $36.8k amid $160 million market liquidations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-11-09T09:42:01.000Z",
    "title": "India trained 3,000 police officials on crypto investigations in 2022–2023",
    "url": "https://cointelegraph.com/news/india-trained-3000-police-crypto-investigators-2022-23",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9e6e6801-9362-40b7-ad8b-3b3b24623393.jpg\"></p><p>The Narcotics Control Bureau and the Indian Cyber Crime Coordination Centre trained 141 officials and over 2,800 officers in the financial year 2022–2023.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T09:50:39.000Z",
    "title": "Ripple’s Blockchain Technology Adopted by Global Payments Processing Company RocketFuel",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ripples-blockchain-technology-adopted-by-global-payments-processing-company-rocketfuel/",
    "description": "Global payments processing company RocketFuel, Inc. has entered into a strategic partnership with blockchain solutions provider Ripple. This move is aimed at incorporating Ripple’s payment technology to modernize RocketFuel’s transactional infrastructure, particularly for fiat currency transfers to global merchants and partners. The platform provided by RocketFuel delivers a one-click checkout system that caters to a […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T09:57:47.000Z",
    "title": "Near (NEAR) Price Analysis: NEAR Goes Up As NEAR Foundation And Polygon Team Up To Build Zk Solution",
    "url": "https://cryptodaily.co.uk/2023/11/near-near-price-analysis-near-goes-up-as-near-foundation-and-polygon-team-up-to-build-zk-solution",
    "description": "NEAR Foundation, the non-profit entity behind the NEAR Protocol, has announced a collaboration with Ethereum scaling solution Polygon Labs to improve interoperability across chains."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T09:57:12.000Z",
    "title": "Spain’s CNMV Initiates Sanction Proceedings Against Crypto Promoter",
    "url": "https://www.cryptopolitan.com/spains-cnmv-initiates-sanction-proceedings/",
    "description": "The National Securities Market Commission (CNMV) of Spain has taken action against Miolos S.L, a cryptocurrency promoter, for alleged violations of crypto promotion rules in the country. This marks the first such case in Spain, emphasizing the regulator&#8217;s commitment to enforcing cryptocurrency regulations. Spain&#8217;s principal financial regulator, the National Securities Market Commission (CNMV), has taken ... <a title=\"Spain&#8217;s CNMV Initiates Sanction Proceedings Against Crypto Promoter\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spains-cnmv-initiates-sanction-proceedings/\" aria-label=\"More on Spain&#8217;s CNMV Initiates Sanction Proceedings Against Crypto Promoter\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T09:51:52.000Z",
    "title": "Bitcoin mining giant marathon achieves record-breaking quarter",
    "url": "https://www.cryptopolitan.com/bitcoin-mining-giant-marathon-achieves-recor/",
    "description": "Bitcoin mining giant, Marathon Digital Holdings, announced staggering Q3 results showcasing a 670% year-on-year revenue gain, largely attributed to a significant increase in Bitcoin production and hashrate. The surge in production has not only bolstered financials but has also propelled the company to swing into a quarterly profit. In a recent earnings report filed on ... <a title=\"Bitcoin mining giant marathon achieves record-breaking quarter\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-mining-giant-marathon-achieves-recor/\" aria-label=\"More on Bitcoin mining giant marathon achieves record-breaking quarter\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T09:41:31.000Z",
    "title": "Andrew Griffith Advocates London’s Crypto AI Growth",
    "url": "https://www.cryptopolitan.com/andrew-griffith-advocates-crypto-ai-growth/",
    "description": "Amidst a dynamic global tech landscape, London is poised to become a leading hub for cryptocurrency and artificial intelligence, according to the UK&#8217;s Economic Secretary to the Treasury, Andrew Griffith. Addressing investors in New York, Griffith emphasized London’s unique position in the evolving tech and financial services sectors, highlighting its potential to foster growth for ... <a title=\"Andrew Griffith Advocates London’s Crypto AI Growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/andrew-griffith-advocates-crypto-ai-growth/\" aria-label=\"More on Andrew Griffith Advocates London’s Crypto AI Growth\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T10:00:31.000Z",
    "title": "Mina and Neo lead price gains in crypto top 100",
    "url": "https://crypto.news/mina-and-neo-lead-price-gains-in-crypto-top-100/",
    "description": "Mina (MINA) and Neo (NEO) witnessed notable hikes over the past day, making them the top gainers among the top 100 crypto assets. Mina price surge MINA is up by 22% in the past 24 hours and is trading at&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T09:43:55.000Z",
    "title": "Australian exchange CoinSpot reportedly hacked for $2m",
    "url": "https://crypto.news/australian-exchange-coinspot-reportedly-hacked-for-2m/",
    "description": "A blockchain analyst under the pseudonym ZachXBT reported suspicious transactions from the wallets of the Australian exchange CoinSpot totaling $2 million. In his Telegram channel, blockchain detective ZachXBT pointed out two transactions. First, the attackers withdrew 1,262 Ethereum (ETH) and&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T09:45:50.000Z",
    "title": "Bitcoin Eyes $37,000: Bloomberg Analysts Give Timeline To Spot ETF Approval",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-37000-spot-etf/",
    "description": "Bitcoin has risen above $36,000 and is currently targeting $37,000 as Bloomberg analysts Eric Balchunas and James Seyffart have revived hopes that a Spot Bitcoin ETF could be approved this year. The analysts maintain their belief of a 90% chance that any of these funds get approved by January 2024.  An Approval Order “Could” Occur This November In a post shared on his X (formerly Twitter) platform, Seyffart highlighted a new research note that he and Balchunas had just worked on. From their research, they noted that there is a “brief window” that allows the US Securities and Exchange Commission (SEC) to approve all 12 Spot Bitcoin ETF applications at once.  Related Reading: Ethereum Failed Transactions: You Won’t Believe How Much Users Have Lost This brief window (which opens up on November 9) will last for at least eight days, before which it is almost possible for the SEC to approve all applications at once until next year. The reason for their assertion is that the SEC cannot approve an application that is in the comment stage. It so happens that the comment stage of the last applications that the SEC delayed ends on November 8, which is why they highlighted the window that starts from November 9.  As to why the window is only going to last for about eight days, the SEC is expected to decide on Hashdex and Franklin’s application on November 17, which could put both applicants in the comment stage. This is because it is expected that the SEC will opt to delay its decisions on those funds and ask the general public for comments on them.  Meanwhile, the analysts noted that this window only applies to the SEC approving all 12 applications at once. They explain that “theoretically,” the Commission could decide on the other applications from now until January 10, 2024, even if it chooses to delay its decision on Hashdex and Franklin’s application on November 17. Whatever happens, they still believe that there is a 90% chance that any of these funds get approved by January 10 next year. A Spot Bitcoin ETF Launch Isn’t So Straightforward When quizzed about how long it will take for these funds to launch after approval, Balchunas mentioned in an X post that he guessed that the “19b-4s” applications would be approved in the “not so distant future.” Then it will further take a while for the SEC to approve the “S-1s” after which it “would likely be days till launch.” Related Reading: XRP News: Ripple CEO Teases Major Announcements At Swell Event Seyffart also echoed similar sentiments as he stated that there are “two paths” that need to be completed before an ETF launches. One is the 19b-4 approval, after which the division of Corporation Finance at the SEC will still need to sign off on the S-1s. However, there is no sign that any of that has been done yet. As such, it could take “weeks or even months” between approval and launch.  Irrespective of that, Bitcoin has picked up on the possibility that Spot Bitcoin ETFs could be approved this month and has ridden on that wave to above $36,000. At the time of writing, the foremost cryptocurrency is trading at around $36,700, up over 4% in the last 24 hours, according to data from CoinMarketCap. BTC price above $36,600 &#124; Source: BTCUSD on Tradingview.com Featured image from The Economic Times, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-09T09:46:20.000Z",
    "title": "RepubliK, an Introduction to this New WEB3 Social Media Platform",
    "url": "https://www.altcoinbuzz.io/product-release/republik-an-introduction-to-this-new-web3-social-media-platform/",
    "description": "<p>Currently, there&#8217;s a whole string of Web2 social media giants out there. For example, Facebook, TikTok, or Instagram. However, ways of monetizing your content on their platforms are almost non-existent. RepubliK is the new social media platform that&#8217;s about to change this.  RepubliK rewards you for your contributions to their platform. You receive XP, and [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/republik-an-introduction-to-this-new-web3-social-media-platform/\">RepubliK, an Introduction to this New WEB3 Social Media Platform</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]