[
  {
    "source": "CoinDesk",
    "date": "2023-12-28T08:52:37.000Z",
    "title": "PancakeSwap Proposes to Reduce CAKE Token Supply by 300 Million",
    "url": "https://www.coindesk.com/markets/2023/12/28/pancakeswap-proposes-to-reduce-cake-token-supply-by-300-million/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "More than 99.95% of the community, representing 70,000 votes from CAKE holders, favored the proposal shortly after it went live."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-28T09:05:55.000Z",
    "title": " Crypto landscape: ten years of growth, change, advances and retreats ",
    "url": "https://cointelegraph.com/news/crypto-market-10-years-ago-bitcoin-ripple-litecoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZjIzN2M2ODgtOGU3Zi00YjZkLTk3NWMtNWM4YTVhNzk0NzY2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Many top coin projects a decade ago have fallen off, while Bitcoin remains resilient and has made the most gains in ten years. </p>\n                    <p><p>While some digital assets have stood the test of time, others have tumbled below the thousands of new digital currencies that exist today. </p><p>On Dec. 28, the total market capitalization for the crypto space stood at around $1.77 trillion, with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) still leading the charge at $842 million. It’s followed by market leaders like Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), as well as stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>). </p><p>Projects like XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) and Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) are also in the top ten digital assets by market cap and have proved their resilience over the years. In addition, Lido Staked Ether (stETH), which represents staked ETH in the liquid staking protocol Lido and combines the value of the initial deposit and staking rewards, is also in the top ten.</p><p><a href=\"https://cointelegraph.com/news/crypto-market-10-years-ago-bitcoin-ripple-litecoin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T09:00:48.000Z",
    "title": "AI’s Global Impact on Climate Disaster Mitigation and Pakistan’s Challenges",
    "url": "https://www.cryptopolitan.com/ais-climate-disaster-mitigation-pakistan/",
    "description": "In the wake of a tumultuous year marked by an alarming surge in climate change-induced disasters, the synergy between artificial intelligence (AI) and climate action takes center stage as a beacon of hope. The pressing concerns of climate change, driven by human activities, have catapulted the world into a precarious era where innovative solutions are [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T08:58:47.000Z",
    "title": "XRPL’s scalability challenged amid inscription saga",
    "url": "https://www.cryptopolitan.com/xrpls-scalability-challenged/",
    "description": "In recent discussions within the cryptocurrency community, the XRP Ledger (XRPL) has been scrutinized for its perceived limitations in supporting ordinals and their inscriptions.&#160; The debate centers around the XRPL&#8217;s capacity to handle certain data inscriptions, sparking a dialogue on its scalability and overall reliability. Inscriptions surge creates XRPL stress test The controversy began when [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T08:48:58.000Z",
    "title": "What’s fueling the sudden surge in geopolitical tensions?",
    "url": "https://www.cryptopolitan.com/sudden-surge-in-geopolitical-tensions/",
    "description": "In a world increasingly defined by volatility and uncertainty, the sharp rise in geopolitical tensions has become the focal point of global attention. This surge, marked by conflicts such as the ongoing crisis in Ukraine, has triggered a ripple effect, significantly impacting the defense sector. With a notable increase in defense spending and expanding order [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T08:48:55.000Z",
    "title": "Dell Demonstrates Potential Use of Copilot AI in Future Windows PCs",
    "url": "https://www.cryptopolitan.com/dell-use-of-copilot-ai-in-windows-pcs-2/",
    "description": "Dell, a leading computer manufacturer, has showcased its vision for integrating Microsoft&#8217;s Copilot AI into future Windows PCs. Copilot, formerly known as Bing Chat, has garnered attention as a generative AI chatbot poised to redefine the user experience on Windows 11 and Windows 10. Dell&#8217;s recent demonstration highlights how Copilot-like features could simplify various tasks, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T08:47:53.000Z",
    "title": "Refunds Initiated by ZK Fair and a Remarkable Achievement in Ethereum’s History",
    "url": "https://www.cryptopolitan.com/refunds-initiated-zk-fair-ethereum-history/",
    "description": "Zk Fair, a prominent player in the Layer 2 (L2) ecosystem has announced the initiation of refunds in USDC. The development comes as a culmination of an extraordinary period of activity that saw the community come together to achieve remarkable feats. The initiative not only reflects the platform&#8217;s commitment to its users but also marks [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T08:45:50.000Z",
    "title": "Ondo Foundation Proposes ONDO Token Unlock: A New Chapter in Democratizing Finance",
    "url": "https://www.cryptopolitan.com/ondo-foundation-token-democratizing-finance/",
    "description": "The Ondo Foundation, a key player in the decentralized finance (DeFi) landscape, has announced a significant development in its journey: a proposal for the release of the ONDO token lock-up. The initiative marks a pivotal moment for the foundation, aligning its community toward a future of open, transparent, and efficient global finance.&#160; The document aims [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T08:42:10.000Z",
    "title": "Ledger Live under scrutiny for alleged user tracking",
    "url": "https://www.cryptopolitan.com/ledger-live-under-scrutiny-for-user-tracking/",
    "description": "A recent report by a pseudonymous software developer and privacy advocate known as REKTBuilder, has raised concerns about Ledger Live, the software associated with Ledger, a prominent manufacturer of cryptocurrency hardware wallets.&#160; According to REKTBuilder&#8217;s findings, Ledger Live is purportedly tracking its users and collecting data on their wallet usage, including details about the apps [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T09:00:00.000Z",
    "title": "Market trends: XRP falls, NuggetRush’s presale ignites demand",
    "url": "https://crypto.news/market-trends-xrp-falls-nuggetrushs-presale-ignites-demand/",
    "description": "As 2023 comes to a close, the cryptocurrency market has been quite a rollercoaster, with XRP and the new player, NuggetRush (NUGX), grabbing attention"
  }
]