[
  {
    "source": "CoinDesk",
    "date": "2023-09-13T08:25:41.000Z",
    "title": "Web3 Doesn’t Care About Bitcoin Prices – And Other Musings From Korea Blockchain Week",
    "url": "https://www.coindesk.com/web3/2023/09/13/web3-doesnt-care-about-bitcoin-prices-and-other-musings-from-korea-blockchain-week/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A packed venue and hopeful cheers from an estimated 10,000 people attending the many Web3 panels could have made one doubt whether the industry remains in one of the deepest bear markets in its young history."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T08:13:13.000Z",
    "title": "Nasdaq's Hashdex mixed Ether ETF filing joins crypto ETF race",
    "url": "https://cointelegraph.com/news/crypto-ether-mixed-etf-nasdaq-hashdex",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/58132829-11f2-49d8-9bdd-a7648661143f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Known as the Hashdex Nasdaq Ethereum ETF, this investment fund is the first filing for futures and spot Ether holdings under the ‘33 Act and is overseen and supervised by Toroso Investments.</p>\n                    <p><p>The Nasdaq stock exchange has submitted an application to the Securities and Exchange Commission (SEC) seeking approval to list an Ethereum Exchange-Traded Fund (ETF) offered by Hashdex, an asset management company. This ETF is designed to include a combination of spot ether holdings and futures contracts in its portfolio and pioneering a new approach to cryptocurrency investment within the regulatory framework. </p><p>Known as the Hashdex Nasdaq Ethereum ETF, this investment fund is the first '33 Act Ethereum futures <a href=\"https://listingcenter.nasdaq.com/assets/rulebook/nasdaq/filings/SR-NASDAQ-2023-035.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> of futures Ethereum under the ‘33 Act and is overseen and supervised by Toroso Investments. Toroso Investments is registered as a commodity pool operator with the Commodity Futures Trading Commission (CFTC) and is also a member of the National Futures Association.</p><p>The current surge in cryptocurrency ETF applications has placed significant emphasis on whether the proposed funds intend to include futures contracts or spot assets. While the SEC has granted approval for the former, the latter remains unapproved. Fund managers appear to be exploring a middle-ground option, testing their chances in this regulatory landscape.</p><p>The primary investment goal of the Hashdex fund is to ensure that its shares mirror the daily fluctuations in the Nasdaq Ether Reference Price. To achieve this objective, the fund intends to allocate its assets to investments in ether, ether futures contracts traded on the CME, as well as cash and cash equivalents. Nasdaq said in the 19b-4 form:</p><blockquote>\"Instead of holding 100% spot Ether, which could make it more susceptible to price manipulation in the spot market, the Fund will hold a mix of Spot Ether, Ether Futures Contracts, and cash,\"</blockquote><p>The Fund aims to decrease its reliance on the spot market and address worries regarding potential manipulation in unregulated Ether spot exchanges by including Ether Futures Contracts and cash in its holdings, it elaborated. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/franklin-templeton-files-bitcoin-spot-etf\"><strong><em>Franklin Templeton files for spot Bitcoin ETF</em></strong></a></p><p>Hashdex <a href=\"https://cointelegraph.com/news/hashdex-joins-race-for-spot-bitcoin-etf-with-unique-strategy\">joined the competition</a> for a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund in the United States. However, Hashdex’s approach differs from recent filings as it won’t depend on the Coinbase surveillance sharing agreement, opting to acquire spot Bitcoin from physical exchanges within the CME market. </p><p>In the previous week, both Ark Invest and 21Shares <a href=\"https://cointelegraph.com/news/spot-ethereum-etf-race-begins-vaneck-ark-21-shares-filing\">submitted applications to the SEC</a> for a spot ether ETF, a type of ETF also being pursued by VanEck. The SEC has thus far <a href=\"https://cointelegraph.com/news/sec-delays-decision-on-wisdomtree-s-spot-bitcoin-etf\">deferred its determinations on all the applications</a> it has received for spot cryptocurrency funds.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-13T08:30:41.000Z",
    "title": "Binance US CEO Brian Shroder exits as exchange cuts one-third of workforce",
    "url": "https://cryptoslate.com/binance-us-ceo-brian-shroder-exits-as-exchange-cuts-one-third-of-workforce/",
    "description": "<p>Binance US CEO Brian Shroder has left his role at the embattled crypto exchange amid a significant workforce reduction, which saw around one-third of its employees laid off, too. A Binance US spokesperson confirmed the incident, adding that the action gives the platform more than seven years of financial runway to continue operating as a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-us-ceo-brian-shroder-exits-as-exchange-cuts-one-third-of-workforce/\">Binance US CEO Brian Shroder exits as exchange cuts one-third of workforce</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-13T08:28:52.000Z",
    "title": "Circle CEO Foresees U.S. Stablecoin Regulation as Catalyst for Crypto Industry Growth",
    "url": "https://www.cryptoglobe.com/latest/2023/09/circle-ceo-foresees-u-s-stablecoin-regulation-as-catalyst-for-crypto-industry-growth/",
    "description": "Jeremy Allaire, the CEO of Circle, believes that the United States is on the verge of implementing legislation that will regulate stablecoins, providing much-needed clarity for the cryptocurrency industry. During an interview with journalist Laura Shin on episode 543 of the Unchained Podcast, Allaire expressed optimism that the ongoing discussions around stablecoin regulation will ultimately […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-13T08:12:01.000Z",
    "title": "Ripple CEO Says ‘Gary Gensler Is a Hammer and Everything Looks Like a Nail’",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ripple-ceo-says-gary-gensler-is-a-hammer-and-everything-looks-like-a-nail/",
    "description": "During his visit to Singapore for TOKEN2049, Ripple CEO Brad Garlinghouse sat down with Bloomberg reporter Annabelle Droulers to discuss a range of topics, including Ripple’s ongoing legal battle with the U.S. Securities and Exchange Commission (SEC), the company’s international expansion, and the broader state of the cryptocurrency industry. Garlinghouse expressed frustration with the SEC’s […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-13T08:30:27.000Z",
    "title": "Defining Oracles: Enablers of the Decentralized Finance World",
    "url": "https://news.bitcoin.com/defining-oracles-enablers-of-the-decentralized-finance-world/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Defining Oracles: Enablers of the Decentralized Finance World\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2060346761.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Oracles are entities that enable various functions in blockchain structures by providing access to legacy or offchain information systems, acting as data ports for decentralized finance applications. These oracles act as information providers for tasks that require either the posting of data or require data to complete specific tasks. What Are Oracles? In ancient times, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T08:27:14.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T08:14:13.000Z",
    "title": "BitMEX re-enters derivatives arena with novel prediction market",
    "url": "https://www.cryptopolitan.com/bitmex-re-enters-derivatives-arena-with-prediction-market/",
    "description": "BitMEX, a name once synonymous with crypto derivatives, has unveiled a prediction market, marking its return to its core business. The new product allows traders to capitalize on real-world events including cryptocurrency price movements. However, this move comes after a period of restructuring and a shift in leadership, with Stephan Lutz taking the reins as ... <a title=\"BitMEX re-enters derivatives arena with novel prediction market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitmex-re-enters-derivatives-arena-with-prediction-market/\" aria-label=\"More on BitMEX re-enters derivatives arena with novel prediction market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T08:10:41.000Z",
    "title": "Keira Knightley Contemplating Copyrighting Her Face Amid AI Concerns",
    "url": "https://www.cryptopolitan.com/keira-knightley-contemplating-copyright/",
    "description": "Renowned actress Keira Knightley is contemplating copyrighting her face due to concerns about the rise of artificial intelligence (AI). Knightley, famous for her roles in &#8220;Pirates of the Caribbean&#8221; and other films, is increasingly worried about the potential misuse of her likeness in the age of AI. In a recent interview with the Daily Telegraph, ... <a title=\"Keira Knightley Contemplating Copyrighting Her Face Amid AI Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/keira-knightley-contemplating-copyright/\" aria-label=\"More on Keira Knightley Contemplating Copyrighting Her Face Amid AI Concerns\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T08:30:29.000Z",
    "title": "Chainlink sharks accumulating, Borroe.Finance gains momentum while Cardano dumps",
    "url": "https://crypto.news/chainlink-sharks-accumulating-borroe-finance-gains-momentum-while-cardano-dumps/",
    "description": "Borroe.Finance and Chainlink are firm while Cardano is under pressure as whales sell"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T08:30:00.000Z",
    "title": "MetaMask expands to include Bitcoin with Snaps rollout",
    "url": "https://crypto.news/metamask-expands-to-include-bitcoin-with-snaps-rollout/",
    "description": "ConsenSys has launched MetaMask Snaps, a rollout that enables interoperability with multiple layer-1 blockchains, including Bitcoin and Solana. On Sept. 12, Consensys launched MetaMask Snaps — a feature set that adds versatility to the existing MetaMask wallet. MetaMask has predominantly&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T08:10:38.000Z",
    "title": "Arthur Hayes Predicts Early 2024 Crypto Bull Run And Ascent Of Filecoin",
    "url": "https://www.newsbtc.com/news/arthur-hayes-early-2024-crypto-bull-run-filecoin/",
    "description": "On September 13th, Arthur Hayes, co-founder and former CEO of BitMEX, delivered a comprehensive analysis of the crypto landscape at Token2049 in Singapore. His insights, which spanned from macroeconomic trends to the intricate dynamics of AI, culminated in a bullish prediction for Filecoin, a decentralized storage solution in the crypto domain. Why The Bitcoin And Crypto Bull Could Start Early 2024 Hayes began by dissecting the symbiotic relationship between debt, AI, and the intrinsic value of Bitcoin and cryptocurrencies. Historically, he noted, crypto bull markets have been propelled either by fiat currency liquidity or by groundbreaking technological advancements. Related Reading: Tron’s Justin Sun Mulls Over Making A Move On FTX’s Crypto Stash, Here’s Why However, a simultaneous convergence of these two driving forces has been conspicuously absent. &#8220;Over the past decade, one of these two factors has always been the reason we&#8217;ve had a bull market in crypto. Yet, we haven&#8217;t witnessed a bull market where both were present at the same time,&#8221; Hayes remarked. Assuming that both factors could play out next year, Hayes ventured a bold prediction for the crypto sector&#8217;s trajectory. &#8220;I believe the next bull market in crypto could commence in early 2024. This could potentially be the most significant bull market not only for cryptocurrencies but also for risk assets since the eras of World War II and the Great Depression,&#8221; he stated. Diving deeper into global economic trends, Hayes highlighted the alarming acceleration of global debt, especially in the wake of the COVID-19 pandemic. He presented a stark picture of the US public debt maturity profile, emphasizing the looming challenges. &#8220;What do governments resort to when faced with a mountain of debt that needs issuance, but there&#8217;s a dearth of willing buyers at feasible interest rates? The answer is simple: they print money,&#8221; Hayes elucidated. As the discussion transitioned to technology&#8217;s intersection with crypto, Hayes identified AI as the prevailing zeitgeist. Drawing parallels with past technological revolutions, he emphasized AI&#8217;s transformative potential within the crypto space. He cited the meteoric adoption of AI technologies, such as Chat GPT, and the burgeoning investments in AI-centric firms like NVIDIA as testament to this trend. Will Filecoin Rise From The Ashes? Hayes then meticulously connected the dots between AI&#8217;s demands and the indispensable role of decentralized storage in the crypto ecosystem. He posited that centralized storage solutions, while prevalent, pose significant risks, especially for burgeoning AI applications. &#8220;Why does AI, a dominant force in the crypto and tech sectors, necessitate decentralized storage? Relying on centralized solutions like Amazon means entrusting vast swathes of data to entities that can unilaterally alter terms, hike prices, or even shut down services, potentially under governmental directives,&#8221; Hayes explained. Related Reading: BREAKING: Crypto Exchange CoinEX Reportedly Hit By Massive Hack, Losses Exceed $27 Million This line of reasoning led Hayes to spotlight Filecoin, emphasizing its significance in the crypto landscape. Despite its dramatic price decline from its zenith, Hayes championed the untapped potential of Filecoin. &#8220;Filecoin&#8217;s value in the crypto space isn&#8217;t merely speculative. It&#8217;s down nearly 99% from its peak of $300 to $3 today. Yet, its tangible utility is evident, with real customers actively using the network and significant data being stored,&#8221; he detailed. Hayes further highlighted his investment in Seal Storage, a Filecoin storage platform. SEAL has undertaken a project named Atlas, associated with CERN, the renowned European particle accelerator. By leveraging SEAL, CERN aims to optimize data costs, and in return, SEAL garners rewards in Filecoin for hosting this data on the network. This synergy isn&#8217;t exclusive to CERN. The University of California, Berkeley, recognizing the potential, has integrated SEAL for analogous purposes. Furthermore, SEAL&#8217;s innovative approach has caught the attention of other prestigious institutions, leading to collaborative ventures with NASA and various esteemed universities across the United States. At press time, Filecoin (FIL) traded at $3.11 Featured image from Bloomberg, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-13T08:12:25.000Z",
    "title": "Binance and Bitcoin Battle the SEC: Joint Motion for Confidential Docs Filed",
    "url": "https://www.crypto-news-flash.com/binance-and-bitcoin-battle-the-sec-joint-motion-for-confidential-docs-filed/?utm_source=rss&utm_medium=rss&utm_campaign=binance-and-bitcoin-battle-the-sec-joint-motion-for-confidential-docs-filed",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-104x69.jpg 104w\" sizes=\"(max-width: 800px) 100vw, 800px\" />The joint motion has most investors wondering if it is a stalemate between the plaintiff, SEC, and defendant, Binance.  Binance US has been charged by the DoJ, the SEC, and the CFTC for allegedly operating an illegal exchange and executing money laundering. Binance Holding Ltd., Bam Trading Services, and Changpeng Zhao (CZ) through their lawyers [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-13T08:13:27.000Z",
    "title": "My TOP 3 Get Rich Crypto Airdrops | September 2023",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/my-top-3-get-rich-crypto-airdrops-september-2023/",
    "description": "<p>Airdrops can be like free money! Some recent memorable airdrops include  Aptos with up to $2,500 for only downloading an NFT. Also, Arbitrum with airdrops between $400 and $1,250. The more tasks you completed, the higher your airdrop was. That is what many airdrops need you to do, completing tasks. Every so often, the tasks are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/my-top-3-get-rich-crypto-airdrops-september-2023/\">My TOP 3 Get Rich Crypto Airdrops | September 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-13T08:22:01.000Z",
    "title": "UAE’s Bid to Become the Crypto Capital of the World",
    "url": "https://coinedition.com/uaes-bid-to-become-the-crypto-capital-of-the-world/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/UAE-Launches-Sharjahverse-in-Partnership-with-Multiverse-Labs.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Has a Major Role in UAE’s Global Trade; Says Al-Zeyoudi\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/UAE-Launches-Sharjahverse-in-Partnership-with-Multiverse-Labs.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/UAE-Launches-Sharjahverse-in-Partnership-with-Multiverse-Labs-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/UAE-Launches-Sharjahverse-in-Partnership-with-Multiverse-Labs-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/UAE-Launches-Sharjahverse-in-Partnership-with-Multiverse-Labs-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/UAE-Launches-Sharjahverse-in-Partnership-with-Multiverse-Labs-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The United Arab Emirates currently leads the list of crypto owners per capita, with more than 27% of its population identifying as crypto asset owners. This metric is indicative of the UAE’s bid to become the crypto capital of the world by introducing an appropriate regulatory framework for the crypto industry. According to a recent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uaes-bid-to-become-the-crypto-capital-of-the-world/\">UAE&#8217;s Bid to Become the Crypto Capital of the World</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]