[
  {
    "source": "CoinDesk",
    "date": "2023-12-29T14:13:14.000Z",
    "title": "Bitcoin Miners Offload $129M BTC in Day, Sending Reserves to the Lowest Point Since May",
    "url": "https://www.coindesk.com/business/2023/12/29/bitcoin-miners-offload-129m-btc-in-day-sending-reserves-to-the-lowest-point-since-may/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin miners' reserves slid to the lowest since May following a spate of withdrawals to exchanges this week, data from CryptoQuant shows."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-29T14:10:14.000Z",
    "title": "End-of-year stablecoin cap rally mirrors Bitcoin’s price uptick",
    "url": "https://cryptoslate.com/end-of-year-stablecoin-cap-rally-mirrors-bitcoins-price-uptick/",
    "description": "<p>In the crypto market, tracking the supply of stablecoins is essential for understanding liquidity trends. Stablecoins, predominantly used as trading pairs for other cryptocurrencies on exchanges, reflect the flow of funds in the market. The aggregate capitalization of the top five stablecoins &#8211; Tether (USDT), USD Coin (USDC), Binance USD (BUSD), TrueUSD (TUSD), and Dai [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/end-of-year-stablecoin-cap-rally-mirrors-bitcoins-price-uptick/\">End-of-year stablecoin cap rally mirrors Bitcoin&#8217;s price uptick</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-29T14:30:47.000Z",
    "title": "Judge Grants Summary Judgment for SEC in Landmark Crypto Case Against Terraform Labs",
    "url": "https://news.bitcoin.com/judge-grants-summary-judgment-for-sec-in-landmark-crypto-case-against-terraform-labs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lun.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a definitive ruling, U.S. District Judge Jed Rakoff favored the Securities and Exchange Commission (SEC) in the multi-billion-dollar fraud case involving Terraform Labs and its founder, Do Kwon. Rakoff noted that the Howey test criteria were satisfied for a range of Terra-related assets and additionally stated that there is “no genuine dispute that UST, [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-29T14:15:01.000Z",
    "title": "ZKSpace Officially Upgrades to ZKBase, Launches ZKSwap for BRC20, and Implements 1:1 Exchange between ZKS and ZKB",
    "url": "https://news.bitcoin.com/zkspace-officially-upgrades-to-zkbase-launches-zkswap-for-brc20-and-implements-11-exchange-between-zks-and-zkb/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/66e6b646-de29-4753-abe4-cf8a46efd38a.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/66e6b646-de29-4753-abe4-cf8a46efd38a-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/66e6b646-de29-4753-abe4-cf8a46efd38a-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/66e6b646-de29-4753-abe4-cf8a46efd38a-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/66e6b646-de29-4753-abe4-cf8a46efd38a.jpeg 720w\" sizes=\"(max-width: 696px) 100vw, 696px\" />PRESS RELEASE. To empower the BTC and ETH ecosystems, the ZKSpace team has rebranded and upgraded to ZKBase. As an infrastructure protocol based on ZK (Zero Knowledge) proof technology, ZKBase is dedicated to providing scalability solutions for mainstream blockchains such as Ethereum and Bitcoin, and building decentralized cross-chain and Layer2 ecosystems. Our new official website, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T14:24:47.000Z",
    "title": "Andreessen Horowitz Foresees a Revolutionary 2024 in Crypto",
    "url": "https://www.cryptopolitan.com/andreessen-a-revolutionary-2024-in-crypto/",
    "description": "Venture capital giant Andreessen Horowitz, commonly known as a16z, has recently shared its vision for the future of cryptocurrency, predicting groundbreaking developments in decentralization, user experience, and the integration of artificial intelligence in the crypto space by 2024. This announcement comes from a blog post penned by key members of the a16z team, outlining their [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T14:21:58.000Z",
    "title": "ViGPT App propels Vietnam’s national AI goals",
    "url": "https://www.cryptopolitan.com/vigpt-app-propels-vietnams-national-ai-goals/",
    "description": "In a strategic move echoing global trends, Vietnam has officially entered the burgeoning field of generative artificial intelligence (Gen AI) with the launch of the ViGPT app by VinBigdata, a subsidiary of Vingroup. This development aligns seamlessly with the Vietnamese government&#8217;s initiatives to foster domestic technological self-reliance, particularly in the realm of language models. Vietnamese [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T14:13:18.000Z",
    "title": "ChainGPT Unveils AI Trading Assistant to Transform Cryptocurrency Trading",
    "url": "https://www.cryptopolitan.com/chaingpt-unveils-ai-trading-assistant/",
    "description": "In a groundbreaking move at the intersection of artificial intelligence and financial technology, ChainGPT has unveiled its AI Trading Assistant, a game-changing addition to the Crypto AI Hub. The tool, slated for global release, aims to redefine the cryptocurrency trading experience for both novices and seasoned traders alike. Sophisticated market analysis and real-time signals ChainGPT&#8217;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T14:36:06.000Z",
    "title": "Most notable crypto bankruptcies in 2023",
    "url": "https://crypto.news/crypto-bankruptcies/",
    "description": "Explore the list of crypto bankruptcies in 2023, including detailed insights into the collapse of major exchanges. It&#8217;s quite evident that crypto had one of its worst years in 2022. The cascading collapse of two industry giants, Terraform Labs (responsible&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T14:30:21.000Z",
    "title": "Bitcoin Erases Recovery As Miners Cash Out 3,000 BTC",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-erases-recovery-miners-cash-3000-btc/",
    "description": "On-chain data shows the Bitcoin miners have participated in a 3,000 BTC selloff recently, something that may explain the asset&#8217;s latest pullback. Bitcoin Miner Reserve Has Taken A Plunge Recently As pointed out by analyst Ali in a new post on X, the BTC miners have participated in some selling recently. The indicator of interest here is the &#8220;miner reserve,&#8221; which keeps track of the total amount of Bitcoin sitting in the wallets of all miners. When the value of this metric goes up, it means that the miners are receiving a net number of coins in their addresses right now. Such a trend suggests that these chain validators are choosing to accumulate the asset currently, which can naturally have bullish effects on the price. Related Reading: Bitcoin Whales Bought The Recent Dip While Market Panicked On the other hand, a decline implies that this cohort is transferring coins out of their wallets at the moment. Generally, the miners make such outflows when they are looking to sell their BTC, so this kind of trend can have bearish implications for the cryptocurrency. Now, here is a chart that shows the trend in the Bitcoin miner reserve over the past month: The value of the metric seems to have sharply dropped in recent days &#124; Source: @ali_charts on X As displayed in the above graph, the Bitcoin miner reserve has registered a sharp drop during the past couple of days. During this withdrawal spree, these chain validators transferred out more than 3,000 BTC from their wallets, worth around $128 million at the current exchange rate. Bitcoin had recovered to the $43,800 level earlier after news had come out about Microstrategy completing another substantial purchase. As the miners made these outflows, though, the cryptocurrency witnessed a drawdown towards the $42,000 mark. Given the timing, it would appear possible that the miners had made these transfers to cash in on the recovery and this extra selling pressure may have contributed to the decline that the asset ended up seeing. Miners are a group that has to pay constant operating costs in the form of electricity bills, so they regularly sell some of the BTC they mine and earn from transaction fees in order to cover these expenses. More often not, though, the miners only participate in relatively low levels of selling, which is readily absorbed by the market and the cryptocurrency doesn&#8217;t feel too much impact This time around, though, these chain validators have sold a sizeable amount inside a narrow window, which is potentially why Bitcoin has appeared to have been affected. In some other news, the market intelligence platform IntoTheBlock has revealed the average holding time on the Bitcoin blockchain and how it compares against other networks. The average holding time across three networks &#124; Source: IntoTheBlock on X As is visible above, Bitcoin holders carry their coins for 4.3 years on average, which is far greater than what Cardano (ADA) and Avalanche (AVAX) blockchains observe. Related Reading: When Will Bitcoin Bull Run Begin? This Could Be The Metric To Watch While miners don&#8217;t tend to HODL because of their running costs, it would appear that the normal investors on the BTC network are more than making up for it by holding for very extended periods. BTC Price The market doesn&#8217;t seem to be too discouraged after the drop due to the selling pressure from the miners, as Bitcoin is now once again making a recovery push. So far, BTC has climbed back to the $42,900 level. Looks like BTC has been overall moving sideways recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-29T14:32:27.000Z",
    "title": "Vitalik Buterin’s Bold Plan: Streamlining Ethereum’s Transition to PoS",
    "url": "https://www.crypto-news-flash.com/vitalik-buterins-bold-plan-streamlining-ethereums-transition-to-pos/?utm_source=rss&utm_medium=rss&utm_campaign=vitalik-buterins-bold-plan-streamlining-ethereums-transition-to-pos",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The proposed solutions include reducing the number of signatures required from validators, and addressing technical complexities arising from Ethereum&#8217;s pursuit of decentralization. The adjustments, including a transition to a moderate level of signatures per slot, intend to enhance the chain&#8217;s quantum resistance and maintain effective slashing mechanisms. Vitalik Buterin, Ethereum&#8217;s co-founder, has put forth proposals [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-29T14:19:19.000Z",
    "title": "PancakeSwap’s Bold Move: 99.95% Community Support for 300 Million CAKE Token Reduction",
    "url": "https://www.crypto-news-flash.com/pancakeswaps-bold-move-99-95-community-support-for-300-million-cake-token-reduction/?utm_source=rss&utm_medium=rss&utm_campaign=pancakeswaps-bold-move-99-95-community-support-for-300-million-cake-token-reduction",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/blockchain-4420011-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The PanCakeSwap community has overwhelmingly supported a proposal to reduce the CAKE token&#8217;s maximum supply from 750 million to 450 million. The CAKE price has surged by 50% in the past week, reaching $3.69, with potential for a 58% increase toward the $5.5 peak. The PanCakeSwap community has shown a strong and positive response to [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-29T14:24:49.000Z",
    "title": "India Targets 9 Major Crypto Exchanges with URL Ban",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/india-targets-9-major-crypto-exchanges-with-url-ban/",
    "description": "<p>This move comes as part of a bigger effort to regulate the digital asset space and ensure compliance with financial laws. The Financial Intelligence Unit of India, responsible for combating money laundering and financial crimes, has identified several prominent crypto exchanges for potential restriction. Let&#8217;s discover more about this important news. India Plans URL Ban [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/india-targets-9-major-crypto-exchanges-with-url-ban/\">India Targets 9 Major Crypto Exchanges with URL Ban</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]