[
  {
    "source": "Decrypt",
    "date": "2023-08-11T14:54:39.000Z",
    "title": "Bitcoin Mining Could Help Decarbonize Energy Grids, Researchers Say",
    "url": "https://decrypt.co/152088/bitcoin-mining-carbon-footprint-decarbonization",
    "description": "Bitcoin mining can indeed help achieve decarbonization, but faces some stiff practical challenges along the way, researchers find."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T14:40:18.000Z",
    "title": "SEC punts on ARK 21Shares spot Bitcoin ETF, opens proposal to comments",
    "url": "https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3e0f000d-cc5f-4110-a5f0-ae62a0c36ae4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ARK Investment Management founder and CEO Cathie Wood predicted on Aug. 7 the SEC would delay its decision on the firm's spot BTC ETF application.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has delayed a decision on approving or disapproving the spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund proposed by ARK Investment Management.</p><p>In an Aug. 11 notice, the SEC <a href=\"https://www.sec.gov/files/rules/sro/cboebzx/2023/34-98112.pdf\" target=\"_blank\" rel=\"noopener nofollow\">opened</a> a 21-day comment period for the ARK 21Shares Bitcoin ETF to the public following publication in the Federal Register, the latest delay for the regulator determining whether to approve or disapprove of a spot crypto ETF in the United States. ARK originally filed to list the ETF in May, giving the SEC a maximum of 240 days — until January 2024 — to reach a final decision.</p><p>“The regulated market of significant size test does not require that the spot bitcoin market be regulated in order for the Commission to approve this proposal, and precedent makes clear that an underlying market for a spot commodity or currency being a regulated market would actually be an exception to the norm,” said the SEC. </p><p>ARK Investment Management is one of many firms in the U.S. applying to get a spot crypto ETF listed on a regulated exchange. BlackRock, the largest asset management firm in the world, notably <a href=\"https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review\">sent in its own application</a> in July. A number of firms also amended existing applications to include cryptocurrency exchange <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">Coinbase as a surveillance-sharing partner</a> following reports SEC officials could be more open to accepting an ETF under those conditions.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T15:00:59.000Z",
    "title": "Kraken Surges Ahead In Altcoin Liquidity To Overtake Coinbase In US: Kaiko",
    "url": "https://www.newsbtc.com/news/kraken-ahead-in-altcoin-liquidity/",
    "description": "The world of cryptocurrency exchanges, often clouded with volatility and competition, has recently been witnessing a distinct shift in dynamics, particularly as a Kraken is taking the lead in the US altcoin trading space. The latest data reveals Kraken, the California-based crypto exchange, is now dominating its rivals, specifically Coinbase, in the altcoin market. Dominating The Altcoin Trading Landscape Data analytics from crypto research firm Kaiko has highlighted Kraken&#8217;s emergence as the premier US crypto exchange for altcoin trading. With significant shifts in market depth percentages and a notable increase in market share, Kraken appears to be carving out a niche for itself in an otherwise volatile industry. 📈🤔In July, Kraken emerged as the most liquid platform for alts in the US. 👉 Its claiming almost half of the market depth for the top 10 alts. pic.twitter.com/2fumt7yi9a — Dessislava Ianeva (@DessislavaIane2) August 9, 2023 Related Reading: Gateway Issues Cause Withdrawal And Deposit Delays For Kraken Exchange Market depth is a crucial metric for crypto exchanges as it represents an exchange&#8217;s capability to manage large buy or sell orders without causing drastic price changes. And according to recent data from Kaiko, Kraken now commands roughly 47% of the market depth for the top 10 altcoins. This dominance, especially in the wake of the previous year&#8217;s price drop and the unfortunate collapse of FTX, underscores the resilience Kraken has brought to the altcoin trading sector. While the entire crypto trading industry has been grappling with declining trading volumes, Kraken has managed to hold its own. A steady uptick in its market share is evident as it jumped from 8.3% in August 2022 to 21.1% in July, according to data from The Block&#8217;s dashboard.  Behind Kraken Ascendancy Kraken reportedly attributes this upward trajectory to a few specific improvements in its offerings. Notably, the introduction of Kraken Pro, their advanced trading platform which rolled out in December, is believed to be a pivotal move. A spokesperson for the crypto exchange elaborated on the exchange&#8217;s recent performance, pointing out that their &#8220;share of total volumes has hit an 18-month high.&#8221; Furthermore, there&#8217;s been a significant surge in their share of EUR spot markets, rising from 35% to 53%, and the AUD spot markets have seen exponential growth, multiplying sixfold over the past year. Related Reading: Regulators Are To Blame For All The Crisis In Crypto, Says Kraken CEO Despite the laudable progress, it&#8217;s crucial to note that Kraken, like many others in the industry, has felt the effects of the industry-wide decline in trading volumes. Their monthly trading volumes have seen a dip from a high of $28.07 billion in March to $13.6 billion in the previous month. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T15:09:02.000Z",
    "title": "Are Regulators Going for PayPal After its Launch of Stablecoin? Banks Warned to Cease Business With PayPal",
    "url": "https://www.crypto-news-flash.com/are-regulators-going-for-paypal-after-its-launch-of-stablecoin-banks-warned-to-cease-business-with-paypal/?utm_source=rss&utm_medium=rss&utm_campaign=are-regulators-going-for-paypal-after-its-launch-of-stablecoin-banks-warned-to-cease-business-with-paypal",
    "description": "<img width=\"1920\" height=\"1459\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-300x228.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-1024x778.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-768x584.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-1536x1167.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-24x18.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-36x27.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/paypal-3258002_1920-48x36.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The US Federal Reserve has cautioned banks regarding their involvement with PayPal&#8217;s PYUSD stablecoin. Amidst PayPal&#8217;s stablecoin launch, scammers release counterfeit PYUSD tokens, urging vigilance from investors. The US Federal Reserve has unexpectedly cautioned banks about their involvement with PayPal and its recently introduced PYUSD stablecoin. The Fed&#8217;s recent statement is linked to banks engaged [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T15:00:37.000Z",
    "title": "Buy Anarchy (ANA) Now If You’re Serious About Getting Rich This Year, Renowned Ethereum (ETH) Maxist Warns",
    "url": "https://www.crypto-news-flash.com/buy-anarchy-ana-now-if-youre-serious-about-getting-rich-this-year-renowned-ethereum-eth-maxist-warns/?utm_source=rss&utm_medium=rss&utm_campaign=buy-anarchy-ana-now-if-youre-serious-about-getting-rich-this-year-renowned-ethereum-eth-maxist-warns",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-11-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-11-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Anarchy (ANA), an up-and-coming meme coin, has caught the attention of a renowned figure in the Ethereum community, known for their steadfast support of the blockchain revolution. This Ethereum Maxist, a visionary with a track record of accurately predicting trends, is now urging individuals to consider investing in Anarchy if they harbor serious ambitions of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-11T15:05:27.000Z",
    "title": "NFT News | NFTs Waiting On Fresh Liquidty | August Week 2",
    "url": "https://www.altcoinbuzz.io/nft/nft-news-nfts-waiting-on-fresh-liquidty-august-week-2/",
    "description": "<p>As we progress further into August, Bitcoin and Ethereum continue to fluctuate. Both are seen dipping, with Ethereum at just under $1850 and Bitcoin at $29500. With crypto stuck in a range, the NFT market is struggling to see any uplift.  So, is it an adverse phase for investors? Or will the market rise like [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/nft/nft-news-nfts-waiting-on-fresh-liquidty-august-week-2/\">NFT News | NFTs Waiting On Fresh Liquidty | August Week 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-11T14:45:19.000Z",
    "title": "Top 3 reasons Why Many People Still Don’t Understand Bitcoin",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-reasons-why-many-people-still-dont-understand-bitcoin/",
    "description": "<p>Despite its widespread recognition, there remains a significant portion of the population that struggles to comprehend the intricacies and implications of this decentralized digital currency. In this article, we delve into the top three reasons why many people still don&#8217;t understand Bitcoin, offering detailed explanations to shed light on this enigmatic phenomenon. 1) Complexity of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-reasons-why-many-people-still-dont-understand-bitcoin/\">Top 3 reasons Why Many People Still Don&#8217;t Understand Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]