[
  {
    "source": "CoinDesk",
    "date": "2023-06-02T20:47:16.000Z",
    "title": "Why Did Bitcoin’s Price Rise? BTC Hovers Over $27K as Investors Shrug Off Hot Jobs Data",
    "url": "https://www.coindesk.com/markets/2023/06/02/why-did-bitcoins-price-rise-btc-hovers-over-27k-as-investors-shrug-off-hot-jobs-data/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether and other major cryptos spent much of the day in positive territory."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T20:45:00.000Z",
    "title": "US lawmakers aim for crypto regulatory clarity with proposed bill putting the screws to SEC",
    "url": "https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9bc51ead-a6b8-47b4-86d8-e123650fef69.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The framework under the bill would allow certain tokens to qualify as digital commodities if they were decentralized and crack down on the SEC’s previous approach to crypto.</p>\n                    <p><p>Lawmakers with the United States House Financial Services Committee and House Agriculture Committee have released a draft discussion offering certain crypto assets a pathway to being labeled digital commodities.</p><p>According to a discussion draft <a href=\"https://financialservices.house.gov/uploadedfiles/digital_002_xml.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on June 2, lawmakers <a href=\"https://docs.house.gov/meetings/AG/AG00/20230606/116051/HHRG-118-AG00-20230606-SD002.pdf\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> “establishing a functional framework” aimed at providing regulatory clarity for crypto firms in the United States. The draft bill would prohibit the U.S. Securities and Exchange Commission (SEC) from denying digital asset trading platforms from registering as a regulated alternative trading system and allow such firms to offer “digital commodities and payment stablecoins.”</p><p>Specifically, the proposed legislation cracks down on the approach many in the crypto space have <a href=\"https://cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security\">criticized the SEC</a> for taking by not offering clear rules of the road. The framework under the bill would allow certain digital assets to qualify as digital commodities if they were “functional and considered decentralized” and require the SEC to provide a “detailed analysis” of any objections to a classification of a firm as decentralized.</p><p>“The Act also requires the SEC to modify its rules to allow broker-dealers to custody digital assets, if they meet certain requirements,” said the draft. “Additionally, the Act would require the SEC to write rules to modernize certain regulations for digital assets.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEW: Key House Republicans Unveil Crypto Market Structure Draft Bill<br><br>The draft legislation was unveiled today by House Financial Services Committee Chairman <a href=\"https://twitter.com/PatrickMcHenry?ref_src=twsrc%5Etfw\">@PatrickMcHenry</a> and House Agriculture Committee Chairman <a href=\"https://twitter.com/CongressmanGT?ref_src=twsrc%5Etfw\">@CongressmanGT</a> <a href=\"https://t.co/QTn32ai68B\">https://t.co/QTn32ai68B</a></p>&mdash; Eleanor Terrett (@EleanorTerrett) <a href=\"https://twitter.com/EleanorTerrett/status/1664701669722972160?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase’s chief legal officer Paul Grewal <a href=\"https://twitter.com/iampaulgrewal/status/1664709526333935639\" target=\"_blank\" rel=\"noopener nofollow\">lauded</a> the draft bill, saying it “lays a strong foundation for regulatory jurisdiction and definitions” but warranted an in-depth review before a formal introduction. The U.S.-based crypto exchange recently <a href=\"https://cointelegraph.com/news/coinbase-national-ad-campaign-crypto\">launched a pro-adoption ad campaign</a> ahead of a lobbying-focused event in Washington, D.C., scheduled for July.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-crackdown-on-crypto-staking-in-the-us-could-boost-decentralization\"><strong><em>SEC crackdown on crypto staking in the US could boost decentralization</em></strong></a></p><p>Introduced by House Financial Services Committee Chair Patrick McHenry and House Agriculture Committee Chair Glenn Thompson — both Republicans — the legislation lacked input from lawmakers on the other side of the political aisle. Democrats and Republicans have sometimes <a href=\"https://cointelegraph.com/news/crypto-cannot-be-partisan-says-us-lawmaker-who-scored-negative-on-bipartisanship-index-report\">demonstrated a willingness</a> to have a bipartisan approach to crypto regulation, but it’s unclear how far the proposed legislation could advance in a divided Congress.</p><p>At the time of publication, U.S. lawmakers in the House and Senate had passed legislation aimed at <a href=\"https://cointelegraph.com/news/deal-to-avoid-us-debt-default-nixes-proposed-30-crypto-mining-tax-says-ohio-lawmaker\">stopping the government from going into default</a> by raising the debt ceiling. President Joe Biden is expected to sign the bill into law on June 2. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T20:57:44.000Z",
    "title": "Energizing the future: Red Bull and Mysten Labs’ Sui Network strategic partnership",
    "url": "https://www.cryptopolitan.com/red-bull-partners-with-sui-network-formula1/",
    "description": "Sui Blockchain, a renowned blockchain company, recently made waves with its revolutionary multiyear contract with Formula 1&#8217;s Red Bull Racing. This alliance highlights blockchain technology&#8217;s potential to transform motorsports. Sui Blockchain and Red Bull Racing want to use blockchain technology to boost operational efficiency, optimize operations, and improve data management. Using decentralized ledger technology, the ... <a title=\"Energizing the future: Red Bull and Mysten Labs&#8217; Sui Network strategic partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/red-bull-partners-with-sui-network-formula1/\" aria-label=\"More on Energizing the future: Red Bull and Mysten Labs&#8217; Sui Network strategic partnership\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T20:50:37.000Z",
    "title": "Crypto reform subject of draft bill from US Senate",
    "url": "https://crypto.news/crypto-reform-subject-of-draft-bill-from-us-senate/",
    "description": "The U.S. Senate is working on a draft bill shifting digital assets initially classified as securities to be regulated as commodities."
  }
]