[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T18:51:19.000Z",
    "title": "Arkham Intel Exchange Shows 11 Submissions Since Debut Including Finding Elon Musk’s Wallet",
    "url": "https://www.coindesk.com/business/2023/07/21/arkham-intel-exchange-shows-11-submissions-since-debut-including-finding-elon-musks-wallet/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Some bounties that have received a submission include identifying the addresses that exploited FTX during its collapse."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T18:55:00.000Z",
    "title": "Price analysis 7/21: BTC, ETH, XRP, BNB, ADA, SOL, DOGE, MATIC, LTC, DOT",
    "url": "https://cointelegraph.com/news/price-analysis-7-21-btc-eth-xrp-bnb-ada-sol-doge-matic-ltc-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8ea4c57f-1005-4ce8-831b-82f905a2ee01.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Several Bitcoin price indicators suggest that BTC’s narrow trading range could end soon, resulting in a volatile price move in BTC and altcoins.</p>\n                    <p><p>Bitcoin continues to test investors’ patience, as it remains stuck inside a tight range. Although the near term is boring, traders need to be on their toes because narrow ranges are generally followed by a sharp increase in volatility. The only problem is that it is difficult to predict the direction of the breakout with certainty.</p><p>Glassnode’s latest weekly newsletter highlighted that Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) consolidation has shrunk the Bollinger Bands, which are <a href=\"https://cointelegraph.com/news/bitcoin-price-bollinger-bands-echo-january-gains\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-bollinger-bands-echo-january-gains/amp\">separated by just 4.2%</a>. Citing various on-chain indicators, the authors concluded that investors are unwilling to sell, and in several aspects, it looks similar to “periods like 2016 and 2019-20, characterized by choppy market conditions.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1de9727e-a368-4a4e-89bc-7f7f44601fcd.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><em>Coin360</em></figcaption></figure><p>Although Bitcoin’s near term may look uncertain, the long term remains bullish. Capriole Investments founder Charles Edwards <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-interview-charles-edwards\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-bitcoin-etf-interview-charles-edwards/amp\">said in an interview with Cointelegraph</a> that access to BlackRock’s exchange-traded fund application could make it “easier for institutions to put Bitcoin on their balance sheet.”</p><p>Will Bitcoin plunge below the support of the range and start a new downward move, dragging several altcoins lower? Let’s study the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has been sustaining below the 20-day exponential moving average (EMA) of $30,067 since July 17, which is a negative sign. It shows a lack of aggressive buying at current levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5b8072ea-8ba2-4a8c-ba59-a8efa5b050c6.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls pushed the price above the 20-day EMA on July 20, but the long wick on the candlestick shows selling at higher levels. The bears will try to strengthen their position by pulling the price below the crucial support at $29,500. </p><p>If they succeed, it will indicate that the consolidation has resolved in favor of the bears. The BTC/USDT pair may then skid to the 50-day simple moving average (SMA) of $28,869 and thereafter to $27,500.</p><p>Conversely, if the price turns up sharply and breaks above the 20-day EMA, it will suggest that the pair may rise to $31,000. A new uptrend could be expected on a break and close above $32,400.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has been trading near the 20-day EMA ($1,896) for the past few days. This suggests a state of equilibrium between the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f79c62e5-e70e-4b82-a49e-353d4b1b01be.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The important support to watch on the downside is the 50-day SMA ($1,854). If this support breaks down, the ETH/USDT pair may tumble to $1,800 and then to $1,700. Such a move will suggest that the pair may continue to oscillate inside the large range between $1,626 and $2,000.</p><p>Contrarily, if the price turns up from the current level or the 50-day SMA and rises above $2,000, it will signal that bulls are in the driver’s seat. The pair may then soar to $2,141 and eventually to $2,200.</p><h2>XRP price analysis</h2><p>The bulls propelled XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) above the overhead resistance of $0.83 on July 19 and 20, but they could not build upon this strength.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/7349472c-b0b3-4ade-8f85-5473bde4ff04.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>That may have tempted short-term bulls to book profits and the aggressive bears to initiate short positions. The bears will try to pull the price toward the support at the 20-day EMA ($0.65).</p><p>If the price rebounds off this level, the XRP/USDT pair may continue its range-bound action between $0.65 and $0.85 for some time.</p><p>A break and close above $0.85 could open the doors for a possible retest of $0.94, while a drop below $0.65 could sink the pair to $0.56.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) continues to trade inside the symmetrical triangle pattern, suggesting indecision between the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/378dad4c-2456-4eee-86a5-fc1ef77b35f0.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The symmetrical triangle typically acts as a continuation pattern, but in some instances, it could also behave as a reversal pattern. The flattish 20-day EMA ($243) and the relative strength index (RSI) near the midpoint do not give a clear advantage either to the bulls or the bears.</p><p>If buyers thrust the price above the triangle, the BNB/USDT pair may rise to the overhead resistance at $265. This is an important resistance to keep an eye on because a break above it will clear the path for a potential rally to $280 and then to $300.</p><p>The bears will have to sink and sustain the price below the triangle to seize control. The selling could intensify further if the $220 support gives way.</p><h2>Cardano price analysis</h2><p>Cardano’s (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) bounce off the 20-day EMA ($0.31) on July 19 fizzled out at $0.33 on July 20. This suggests that bears are selling on relief rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6536467c-f1fa-4590-b01a-341784f878da.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price has again returned to the 20-day EMA, which remains the key level to watch out for in the near term. If the price turns up sharply and breaks above $0.34, the ADA/USDT pair may advance to $0.38.</p><p>On the contrary, if the price continues lower and breaks below the moving averages, it will signal that bears are back in the game. The pair could then descend to the uptrend line. This level may attract solid buying by the bulls.</p><h2>Solana price analysis</h2><p>The bulls tried to propel Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) above the overhead resistance at $27.12 on July 19 and 20, but the bears did not budge. This shows that bears are selling on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d78042f9-adba-4e16-be13-e2e0b57856a7.png\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The failure to rise above $27.12 may tug the price to the 20-day EMA ($23.55). This level is likely to witness a tough battle between the bulls and the bears. If the price sinks below the 20-day EMA, it will suggest that the short-term momentum has weakened. That could open the doors for a deeper correction to the 50-day SMA ($19.63).</p><p>If bulls want to prevent the decline, they will have to quickly push and sustain the price above $27.12. If they do that, the SOL/USDT pair could rally to $29.12 and subsequently to $32.13.</p><h2>Dogecoin price analysis</h2><p>The bulls successfully defended the 20-day EMA ($0.07) in the past few days, indicating that Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) is attracting buyers at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1adcba45-7488-4c6e-8784-6c057480b641.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The rising 20-day EMA and the RSI above 63 suggest that the path of least resistance is to the upside. If buyers sustain the price above $0.07, it will signal the start of a new up move. The DOGE/USDT pair may jump to $0.08 and later to $0.10.</p><p>If bears want to invalidate this positive view, they will have to quickly yank the price below the moving averages. Such a move will suggest that the rally above $0.07 may have been a bull trap. The pair may then slump to $0.06.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/xrp-price-searches-for-a-fresh-bullish-catalyst-to-trigger-a-move-above-1\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/xrp-price-searches-for-a-fresh-bullish-catalyst-to-trigger-a-move-above-1/amp\"><strong><em>XRP price searches for a fresh bullish catalyst to trigger a move above $1</em></strong></a></p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) turned up from the 20-day EMA ($0.74) on July 20, indicating that the bulls are trying to flip the level into support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c7e6a99b-66ed-4c4f-b419-8a7502d4acf2.png\"><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA is moving up and the RSI is in the positive zone, indicating that bulls have the upper hand. If buyers clear the overhead hurdle at $0.80, the MATIC/USDT pair could climb to $0.90. This level may again act as a minor obstacle, but if bulls overcome it, the pair may rise to $1.04.</p><p>Contrary to this assumption, if the price turns down and plummets below the 50-day SMA ($0.71), it will signal that bears are back in the game. The pair could then slide to $0.60.</p><h2>Litecoin price analysis</h2><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) has been stuck between the moving averages for the past few days, indicating indecision between the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1f915d6a-b5d3-42ee-a18f-a26b52bff260.png\"><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls tried to push the price above the 20-day EMA ($94) on July 19 and 20, but the bears held their ground. This shows that the bears are trying to flip the 20-day EMA into resistance. The 20-day EMA has started to turn down and the RSI has slipped into negative territory, giving a slight edge to the bears.</p><p>If the price breaks and closes below the 50-day SMA ($90), the selling could pick up and the LTC/USDT pair may slump to $80. Alternatively, a break and close above the 20-day EMA could open the doors for a relief rally to $106.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) bounced off the strong support at $5.15 on July 19 and reached the overhead resistance at $5.64 on July 21, indicating that lower levels continue to attract buyers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6fa661a2-00ab-4f7a-a735-149e57096869.png\"><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The long wick on the July 21 candlestick shows that the bears are aggressively selling the rallies to $5.64. This suggests that the DOT/USDT pair could remain stuck between $5.15 and $5.64 for a while longer.</p><p>A minor advantage in favor of the bulls is that the RSI has stayed in positive territory and the 20-day EMA ($5.25) is moving up gradually. Buyers need to overcome the barrier at $5.64 to start the next leg of the uptrend toward $7.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T18:49:42.000Z",
    "title": "Sam Bankman-Fried's brother planned to buy island and prep for apocalypse: court filing",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-brother-planned-buy-island-prep-for-apocalypse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/84548cb2-4177-49e3-b6ae-2f4ef2299834.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to court documents, Gabriel Bankman-Fried wrote a memo to the FTX Foundation with a plan to build a bunker to survive “some event where 50%-99.99% of people die\".</p>\n                    <p><p>Gabriel Bankman-Fried, the brother of former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, had a plan to survive a global catastrophe using funds from the now defunct cryptocurrency exchange.</p><p>According to a July 20 filing with United States Bankruptcy Court for the District of Delaware, Gabriel planned to purchase the island nation of Nauru in the Pacific using <a href=\"https://cointelegraph.com/news/ftx-sues-sam-bankman-fried-other-execs-recoup-one-billion\">allegedly misappropriated funds</a> through the FTX Foundation. Projects with the charity — “that served little purpose other than to enhance the public stature of Defendants,” according to court documents — included a $300,000 book grant on “humans’ utility function” as well as a $400,000 grant to a YouTuber.</p><p>However, one of Gabriel Bankman-Fried’s plans included preparing for a potential apocalypse by purchasing Naura, an island northeast of Australia with a population of roughly 12,000 as of 2023. According to a memo between Gabriel and an unnamed officer of the FTX Foundation, he planned to establish a bunker to get through “some event where 50%-99.99% of people die [to] ensure that most EAs [effective altruists] survive” and build a lab focused on “human genetic enhancement”.</p><p>“Probably there are other things it’s useful to do with a sovereign country, too,” said the memo, referring to the planned acquisition.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/terraform-labs-seeks-access-ftx-wallets-fraud-defense\"><strong><em>Terraform Labs seeks access to FTX wallets in fraud defense</em></strong></a></p><p>Prior to FTX’s downfall in November 2022, Gabriel Bankman-Fried had founded Guarding Against Pandemics, an nonprofit organization aimed at preparing for the next COVID-19. He reportedly stepped down from his position as executive director of the organization amid the crypto exchange’s bankruptcy.</p><p>Sam Bankman-Fried’s first criminal trial in the United States has been scheduled for Oct. 2, where he faces charges including fraud related to the commingling of funds between FTX and Alameda Research. It’s unclear whether Gabriel will offer testimony against his brother, but debtors in the FTX bankruptcy case have <a href=\"https://cointelegraph.com/news/ftx-legal-team-calls-for-sam-bankman-fried-s-family-to-answer-questions-under-oath-report\">considered subpoenaing him</a> to provide information on any financial benefits he may have received from the exchange.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:58:01.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:56:04.000Z",
    "title": "FTX sues former CEO and executives for misappropriation of funds",
    "url": "https://www.cryptopolitan.com/ftx-former-ceo-executives-misappropriation/",
    "description": "In a major legal development, FTX, the now-bankrupt crypto exchange, has filed a lawsuit against its former CEO, Sam Bankman-Fried, along with other former key executives, seeking to recover more than $1 billion in allegedly misappropriated funds. The complaint, filed on July 20 in a United States Bankruptcy Court, also named former Alameda Research CEO, ... <a title=\"FTX sues former CEO and executives for misappropriation of funds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-former-ceo-executives-misappropriation/\" aria-label=\"More on FTX sues former CEO and executives for misappropriation of funds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:51:34.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:39:52.000Z",
    "title": "Uniswap founder’s Twitter account breached to carry out scams",
    "url": "https://www.cryptopolitan.com/uniswap-founders-twitter-carry-out-scams/",
    "description": "In a recent incident, members of the Crypto Twitter community swiftly identified and alerted others to a scam perpetrated through Uniswap founder Hayden Adams’ compromised account. The “Web3 Security Alerts” channel on Telegram was quick to notify followers about the breach, which occurred on July 20. During the breach, Adams’ Twitter account, with over 254,000 ... <a title=\"Uniswap founder&#8217;s Twitter account breached to carry out scams\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-founders-twitter-carry-out-scams/\" aria-label=\"More on Uniswap founder&#8217;s Twitter account breached to carry out scams\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T18:53:17.000Z",
    "title": "We gave ChatGPT $20,000 to invest and this is how it spent it",
    "url": "https://www.newsbtc.com/research/we-gave-chatgpt-20000-to-invest-and-this-is-how-it-spent-it/",
    "description": "2023 has seen the rise of AI, with programs such as Bard and ChatGPT offering answers to any and all queries, ranging from what the weather is to writing college essays. We all know AI is based on machine learning, but how much can we trust the advice it gives? We wanted to find out if we can trust these programs, so we gave ChatGPT a budget of $10k to invest in stocks and $10k to invest in cryptocurrencies, subsequently following the advice provided.  Before following this advice, it is worth noting ChatGPT states the information given is not financial advice, and consulting with a financial advisor is always recommended. ChatGPT also suggests doing your own research to make more informed decisions regarding which stocks are worth investing in. The program provides further advice for cryptocurrencies, stressing the volatility of cryptocurrencies and the importance of considering your financial situation when making investment decisions. Regularly reviewing your portfolio based on market conditions and investment performance is also advised. The Breakdown It took a little bit of training, but we eventually got ChatGPT to suggest exactly how much of my budget to invest in each stock/ coin, the breakdown is as follows: &#160; Stock Percentage Total Invested Apple Inc 10% $1000 Amazon.com Inc 10% $1000 Microsoft Corporation 9% $900 Alphabet Inc 9% $900 NVIDIA Corporation 8% $800 Tesla Inc 7% $700 NextEra Energy, Inc 7% $700 Amgen Inc 4% $400 Johnson &#38; Johnson 4% $400 Moderna, Inc 4% $400 Pfizer Inc 4% $400 Gilead Sciences, Inc 3% $300 PayPal Holdings Inc 3% $300 General Motors Company 3% $300 NIO Inc 3% $300 First Solar, Inc 2% $200 Enphase Energy, Inc 2% $200 Shopify Inc 2% $200 Vestas Wind Systems A/S 2% $200 MercadoLibre, Inc 1% $100 Johnson Controls International plc 1% $100 Square, Inc 1% $100 Rivian 1% $100 Coin Percentage Total Invested Bitcoin 20% $2000 Ethereum 20% $2000 Binance Coin 10% $1000 Litecoin 10% $1000 Solana 10% $1000 Polkadot 10% $1000 Ripple 10% $1000 Cardano 10% $1000 The suggested stocks are rather expected; higher investments in stable stocks and a lower investment into stocks with more fluctuations. The cryptocurrency investments are slightly more interesting, however, as, of the 1000+ coins currently on the market, it’s given me a short list of eight to invest in.  &#160; The Experiment The first week The experiment started off on unsteady legs with stocks ending with a profit of $159 and cryptocurrencies making a loss of $64 after the first day. Five of the eight cryptocurrencies invested in made a loss, with Binance Coin performing the worst, with our $956 investment suffering a $44 decrease. Stocks increased throughout the week but decreased right at the end ($25 lower compared to the previous day), making the final weekly total $10,220. This is a $220 increase from the initial investment, a solid start for our experiment. Our crypto investment did not perform nearly as well in the first week, with only three  days ending in a profit from the initial $10k investment. The fourth day was the worst of our whole experiment, with an ending total of $9,741. Only two of the coins invested turned a profit on that day, with Ethereum making a loss of $114 from the initial investment. Our week ended on a slightly more positive note with a final total of $10,021, a $21 increase from the initial investment. &#160; The second week During the second week,  the total reached $10,643 by the end of the second day. This is $423 more than the total at the end of week one. However, this high was short-lived as the final value decreased for the remainder of the week, ending on $10,492. Whilst $272 more than the final value of the first week, it’s $151 less than the second day’s total. After a shaky beginning, our cryptocurrency investment far outperformed our stocks investment in the second week, peaking at $11,118 on the fourth day. This then decreased on the fifth and final day, making the final value of the week $10,987, a $967 increase from the first week. &#160; The third week The start of the third week saw more decreases for our stocks investments. Nine of our 23 investments decreased on the second and third day. The latter half of the week performed better, increasing to $10,559 in total by the final day. Our cryptocurrency investment performed similarly, with a decrease at the start of the week and an increase towards the end. The final value dropped to $10,609 on the fourth day, then increased dramatically to $10,974 by the end of the fifth. The final value of the week was $11,402, a $415 increase from week two. &#160; The final week The final week of our stock investments was a disappointment with the overall value decreasing slightly for a final figure of $10,587. This is an overall increase of $587 from our initial investment, which is an overall ROI of 6%. On the first day of the final week, our crypto investments increased by $314 to $11,719 in total, this is the highest end of day total we reached in our experiment. This was the high point, however, as we decreased throughout the rest of the week, ending with a final total of $11,359, a 14% ROI. &#160; Overall Performance Stocks Whilst we ended up turning a profit from our stock investments, there were ten investments which made a loss from the initial investment, almost 45% of investments made. The worst-performing stock was Pfizer inc. which decreased from the third week and ended up with an ROI of -10%. This was after the company announced they were discontinuing the development of the type 2 diabetes and obesity candidate lotiglipron over safety concerns.  Rivian proved the best-performing stock, with an ROI of 88%, initially priced at $14.03 per stock it increased to $25.51 over the month. This is after the company announced that Q2 2023 was the best financial quarter in the company’s history. &#160; Cryptocurrency On the other hand, we had much more luck with our crypto investments, with only one of the investments returning a loss, making up 13% of the initial investment. This was Ripple (XRP), there are several reasons for this, one being that the transaction volume of XRP is down 90%. The coin with the highest ROI is Solana (SOL) with an ROI of 39%, which is a $389 increase. SOL is considered a relatively stable coin with strong community backing, making it a good coin to invest in. Hits or Misses? Whilst it’s possible Bitcoin was suggested as one of the largest investments because it’s the biggest cryptocurrency. It was actually a great crypto to invest in as the price went from $26k to $30k, this was due to news that a new, safer, crypto exchange launched, receiving investments from Invesco and WisdomTree. There is one stock we feel could have been missed from ChatGPT’s suggestions, this is Meta, the company who owns Facebook and Instagram. They’ve recently released a new app as part of Instagram called Threads, a Twitter competitor. It was released at the perfect time, after news that Twitter was limiting the number of Tweets its users could see.  This isn’t one of the stocks ChatGPT suggested investing in, so we wanted to see what could have happened had ChatGPT suggested investing in META stocks. Using historical data for the last month, we calculated that if we had invested $1,000, we would have $1,100 by the end of the experiment. This is more than we earned from the $1,000 we invested in Amazon and Apple stocks. Methodology We started by asking ChatGPT for stock market opportunities. Initially, it gave a generic answer of the types of industries which should be invested in and why. From these industries, we asked it to recommend specific companies from each. We then sent the list of all the suggested stocks back to it and asked for a weighting of a $10k investment. We found that one of the stocks suggested, Waymo, is not a publicly traded business, we had to go back to ChatGPT and ask for it to remove this stock and add a new one. It was replaced by Johnson Controls International plc. It was a much easier process to get answers about which cryptocurrencies to invest in. As ChatGPT gave us an initial list of coins, and when asked how much to invest in each it gave a general strategy for investing in cryptocurrency. 40-50% should come from Bitcoin and Ethereum combined and 10-20% for each of the remaining coins. We decided to put 20% into Bitcoin, 20% into Ethereum and 10% for the remaining coins."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T18:45:46.000Z",
    "title": "Liquid Staking Explodes To Become Largest Sub-Sector in Decentralized Finance, According to Binance Report",
    "url": "https://dailyhodl.com/2023/07/21/liquid-staking-explodes-to-become-largest-sub-sector-in-decentralized-finance-according-to-binance-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/liquid-staking-explodes-to.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Liquid staking now has the biggest total value locked (TVL) among decentralized finance (DeFi) sub-sectors following an impressive growth of over 131% since the start of the year. According to Binance Research, liquid staking in unseated decentralized exchanges (DEXes) was the leading DeFi sub-sector on April 28th with a difference of $6.8 million in TVL. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/liquid-staking-explodes-to-become-largest-sub-sector-in-decentralized-finance-according-to-binance-report/\">Liquid Staking Explodes To Become Largest Sub-Sector in Decentralized Finance, According to Binance Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T18:41:06.000Z",
    "title": "Elon Musk’s Tesla Keeps Dogecoin (DOGE) As Payment Option While Removing Bitcoin (BTC): Blockchain Reporter",
    "url": "https://dailyhodl.com/2023/07/21/elon-musks-tesla-keeps-dogecoin-doge-as-payment-option-while-removing-bitcoin-btc-blockchain-reporter/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/doge-adoption-at-tesla.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire Elon Musk’s Tesla is keeping Dogecoin (DOGE) as a payment option while removing the source code that once allowed Bitcoin (BTC) payments. According to blockchain report Colin Wu, the king crypto and Dogecoin have been present in the electric car manufacturer’s source code since January despite Tesla removing Bitcoin as a payments option in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/elon-musks-tesla-keeps-dogecoin-doge-as-payment-option-while-removing-bitcoin-btc-blockchain-reporter/\">Elon Musk’s Tesla Keeps Dogecoin (DOGE) As Payment Option While Removing Bitcoin (BTC): Blockchain Reporter</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]