[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T17:30:00.000Z",
    "title": "The future of BTC mining and the Bitcoin halving",
    "url": "https://cointelegraph.com/news/future-btc-mining-and-the-bitcoin-halving",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e09d8944-879f-4fba-bea5-38f9aa6546f5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s episode of Market Talks discusses the future of BTC mining and how miners can maximize profits, as well as the upcoming Bitcoin halving and its impact on the mining industry.</p>\n                    <p><p>On the latest episode of Cointelegraph’s <em>Market Talks</em>, host <a href=\"https://cointelegraph.com/authors/ray-salmond\">Ray Salmond</a> spoke with Dan Rosen, associate director of derivatives at Luxor, a United States-based Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining pool, research hub and service provider.</p><p>The show touched on a number of broad topics, including Rosen’s view on how the upcoming Bitcoin halving will impact BTC price, why Bitcoin’s volatility is set to remain in the double-digits for years to come, and miners’ ability to hedge their operations via hash rate derivatives.</p><p>According to Rosen:</p><blockquote>“Any maturing asset goes through experiences of high volatility when it first launches, and if you compare Bitcoin to the tech stocks of the early 90s, like Apple and Google, their volatility was astronomical. Bitcoin has also touched crazy high levels of volatility in the 70% to 100% [range] four years ago. This is dropping over time, but we will continue to see this trend as the asset becomes more investable and the eventual launch of an ETF [exchange-traded fund]. One day, we are likely to see a 20% or sub-20% annualized asset class, in maybe four or five years.” </blockquote><p>Historically, outside of pledging mined Bitcoin rewards, miners have had few options for hedging risk within their operations. Luxor’s hash rate derivatives essentially add infrastructure to this area of the industry by allowing miners to hedge their exposure to changes in hashprice. The derivatives give miners the option to predict and lock in future revenue during events of unexpected volatility that impact the efficiency of their operations. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-mining-difficulty-new-peak-btc-price-dip\"><strong><em>Bitcoin difficulty jumps 6% to new peak as miners ignore BTC price dip</em></strong></a></p><h2>Macro continues to impact Bitcoin’s price and miners</h2><p>Regarding the macro and how this could impact Bitcoin’s price and its miners, Rosen said, “The market is starting to realize that we’re probably not going to get to that 2% inflation target rate any time soon, and it does appear that the market is starting to price in that inflation longer-term will hover around the 2.5% to 3% range. At the same time, we’re still seeing the U.S. dollar as a flight-to-safety asset, and this is impacting equities and creating macro headwinds at the same time, leading to a depreciated value of dollar-denominated assets.” </p><p>Despite this dismal economic outlook, Rosen believes:</p><blockquote>“While Bitcoin price might not hit six figures leading into the halving or directly after it, I wouldn’t be surprised to see new lows over the next six months due to macro headwinds and then a stronger rally afterward.” </blockquote><p>Listen to the full episode of <em>Market Talks</em> on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>, and don’t forget to click “Like” and “Subscribe” to keep up-to-date with all our latest content.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T17:30:10.000Z",
    "title": "Binance accused of hiding names of sanctioned Russian banks behind color codes",
    "url": "https://cryptoslate.com/binance-accused-of-rebranding-sanctioned-russian-banks/",
    "description": "<p>Binance reportedly renamed sanctioned Russian banks on its peer-to-peer (P2P) platform to allow them to continue operations, local media RBC-Crypto reported on Aug. 23. According to the report, Binance renamed the bank cards for Sber and Tinkoff to &#8220;green&#8221; and &#8220;yellow&#8221; local cards on its payment options for P2P trading. Through its P2P services, Binance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-accused-of-rebranding-sanctioned-russian-banks/\">Binance accused of hiding names of sanctioned Russian banks behind color codes</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T17:31:04.000Z",
    "title": "\n                        Philatelie Liechtenstein and Renowned Artist Romero Britto Reveal Groundbreaking NFT Stamp\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/philatelie-liechtenstein-and-renowned-artist-romero-britto-reveal-groundbreaking-nft-stamp",
    "description": "\n                        <p class=\"s5\">In an exciting merger of tradition and technology, Philatelie Liechtenstein, part of Liechtenstein&rsquo;s official postal service, has debuted an NFT postage stamp infused with the artistry of internationally acclaimed neo-pop artist, Romero Britto. Launched on March 29, 2023, this innovation sets a new benchmark for both philately and the digital art realm.</p>\nPop-art, stamps, and blockchain\n<p class=\"s5\">Liechtenstein's foray into the world of blockchain technology began as early as 2021, but this recent collaboration with Britto, known for his distinctive public art installations worldwide, including Hyde Park, London, and John F. Kennedy Airport, New York, has undoubtedly generated new attention in the world of post stamps.&nbsp;</p>\n\n<p class=\"s5\">\"We are proud to have been issuing stamps for 111 years now. The NFTs were created through the digital twin of a painting by Romero Britto, now on display in the Liechtenstein National Museum,\" says Roland Seger, CEO at LiechtensteinischePost AG.</p>\n\n<p class=\"s5\">Drawing from his personal journey, Britto told NullTX that, </p>\n\n<p>\"As art ambassador for the Philately Liechtenstein art edition, things have come full circle for me. When I was a kid in&nbsp;Brazil, I couldn't travel. But stamps let me dream. Through them, I could travel the world in my mind and get to faraway places.\"</p>\n\n<p class=\"s5\">&nbsp;</p>\n<p class=\"s5\">The NFT Art Edition stands out in the novel arena of crypto-based stamps not just due to its blend of tradition and innovation but also because of its message of unity. </p>\n\n<p class=\"s5\">\"My art, the painting for the philately and the design of the NFT stamps are meant to express joy of life. This style conveys my philosophy: a visual language of happiness! The work in the Liechtenstein National Museum stands not only for friendship, but also for the connection between tradition and the digital world. Mushrooms (through their roots) are the best-connected creatures in our world - just as we are digitally on the internet today,\" Britto reflected.</p>\n\n<p class=\"s5\">Each stamp, built on Ethereum&rsquo;s ERC-721 standard, includes a unique SQR code, linking directly to its corresponding NFT on the Ethereum blockchain. This guarantees transparency and authenticity for collectors. Additional physical perks include gold foil embossed packaging and a certificate of authenticity.</p>\n<p class=\"s5\">Britto further emphasized the democratizing power of NFTs, saying, </p>\n\n<p class=\"s5\">\"Art is for everyone. We should share love and positivity with each other. With my art, I want to convey this attitude. The NFTs allow everyone to participate in the art world. Through this unique project, everyone gets access to a world that was previously only available to a few&nbsp;people..\"</p>\n\nA growing field\n<p class=\"s5\">As Liechtenstein's philately dives headfirst into the digital age, their initiatives not only revolutionize notions of authenticity and ownership but also underscore their commitment to evolving while paying homage to a century-old tradition. And notably, they&rsquo;re not the only players in their field to realize the potential of NFTs.</p>\n<p class=\"s5\">Since the thoughtleader&rsquo;s first venture into blockchain back in 2021, the release of Stamp 4.0, the world&rsquo;s first NFT stamp, other postage services in Europe have caught on to the idea. As Cointelegraph reported, the Dutch and Austrian postage services have followed suit and released their own blockchain-based stamps to the public in Fall 2022.</p>\n<p class=\"s5\">The future of philately seems promising, with a perfect blend of the past, present, and future, creating an inviting space for both traditional stamp enthusiasts and new-age collectors. As the world continues to become more digitalized, it seems fair to assume that collectors and even consumers will be seeing more post services leverage blockchain technology. It's even conceivable that postal services will abandon the old-fashioned physical stamps and soon rely entirely on their NFT counterparts for domestic and international mail.</p>\n<p class=\"s5\">One thing is for sure: thanks to collaborations like these, Philatelie Liechtenstein ensures its revered position in philatelic history for ages to come.</p>\n<p class=\"s10\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-24T17:30:33.000Z",
    "title": "Pantera Capital Predicts Bitcoin to Skyrocket to $148,000 Post-2024 Halving",
    "url": "https://news.bitcoin.com/pantera-capital-predicts-bitcoin-to-skyrocket-to-148000-post-2024-halving/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Pantera Capital Predicts Bitcoin to Skyrocket to $148,000 Post-2024 Halving\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/panteraass.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent &#x201C;Blockchain Letter&#x201D; to investors, published on August 22, Pantera Capital &#x2014; a venture capital firm headed by Dan Morehead &#x2014; has projected that the price of bitcoin (BTC) could soar to $147,843 per coin following the 2024 halving. The firm employed the stock-to-flow (S2F) ratio as a price model to evaluate and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T17:37:00.000Z",
    "title": "Universal Robots Academy Empowers Over 200,000 Individuals in Collaborative Robotics",
    "url": "https://www.cryptopolitan.com/academy-empowers-over-200000-individuals/",
    "description": "In a transformative stride towards democratising robotics, Universal Robots, the pioneering collaborative robot (cobot) enterprise, has successfully engaged over 200,000 learners through its Universal Robots Academy. Since its inception in 2016, the academy has burgeoned in popularity, offering comprehensive robotics training through free online modules, classroom sessions, and authorized training centres across the world. Global ... <a title=\"Universal Robots Academy Empowers Over 200,000 Individuals in Collaborative Robotics\" class=\"read-more\" href=\"https://www.cryptopolitan.com/academy-empowers-over-200000-individuals/\" aria-label=\"More on Universal Robots Academy Empowers Over 200,000 Individuals in Collaborative Robotics\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T17:30:53.000Z",
    "title": "Cardano, Solana, Polygon, and the Rise of ApeMax: The Next Big Thing in Cryptocurrency",
    "url": "https://www.crypto-news-flash.com/cardano-solana-polygon-and-the-rise-of-apemax-the-next-big-thing-in-cryptocurrency/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-solana-polygon-and-the-rise-of-apemax-the-next-big-thing-in-cryptocurrency",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-123.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-123.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-123-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In recent times, the crypto-verse has been rife with buzz about leading platforms like Cardano, Solana, and Polygon. Each of these giants has its own merits, from Cardano&#8217;s third-generation blockchain prowess to Solana&#8217;s high-throughput capacity and Polygon&#8217;s multi-chain scaling solution. However, amidst this trio&#8217;s shadows emerges a project that has been garnering significant attention from [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T17:15:28.000Z",
    "title": "Ethereum Analyst Benjamin Cowen Reveals Bearish Target, Sees ETH ‘Coming Home’",
    "url": "https://www.crypto-news-flash.com/ethereum-analyst-benjamin-cowen-reveals-bearish-target-sees-eth-coming-home/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-analyst-benjamin-cowen-reveals-bearish-target-sees-eth-coming-home",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Based on the logarithmic regression trendline, the Ethereum (ETH) price can undergo severe correction from here. The Ethereum technical chart shows weakness with a head-and-shoulder pattern, suggesting downward targets of $1,100. The world&#8217;s second-largest cryptocurrency, Ethereum (ETH), has been showing signs of weakness for a while. Last week amid the broader market crash, the ETH [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T17:16:00.000Z",
    "title": "BTC May Surge to $148K After 2024’s Bitcoin Halving: New Analysis",
    "url": "https://coinedition.com/btc-may-surge-to-148k-after-2024s-bitcoin-halving-new-analysis/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Big_whale_moves_have_shown_up_on_Bitcoins_network_today-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Pantera Capital, an American hedge fund that specializes in crypto, recently released an article, shedding insights on the market impact of the recent XRP ruling and the upcoming Bitcoin halving. The analysis asserted that the “recent positive events” could provide a “strong setup” for a bullish trend in the virtual asset space. The platform provided [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-may-surge-to-148k-after-2024s-bitcoin-halving-new-analysis/\">BTC May Surge to $148K After 2024’s Bitcoin Halving: New Analysis</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]