[
  {
    "source": "CoinDesk",
    "date": "2024-01-30T16:11:39.000Z",
    "title": "Thailand's SEC Breaks New Ground in 2024 With Crypto-Friendly Rules",
    "url": "https://www.coindesk.com/policy/2024/01/30/thailands-sec-breaks-new-ground-in-2024-with-crypto-friendly-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Thailand's SEC has updated its rules by removing retail investors' limits for asset-backed tokens, creating new rules for custodians and giving them a larger role in monitoring digital asset business."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-30T16:26:34.000Z",
    "title": "Non-custodial fiat off-ramp now available in crypto wallets via Visa debit",
    "url": "https://cryptoslate.com/non-custodial-fiat-off-ramp-now-available-in-crypto-wallets-via-visa-debit/",
    "description": "<p>Crypto and NFT payments infrastructure company Transak has partnered with Visa to integrate Visa debit capabilities into its global off-ramp service. This move increases the options for crypto-to-fiat off-ramps, allowing users in over 145 countries to convert their crypto holdings into local fiat currencies. Using a product called Visa Direct, Transak will allow the fluid [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/non-custodial-fiat-off-ramp-now-available-in-crypto-wallets-via-visa-debit/\">Non-custodial fiat off-ramp now available in crypto wallets via Visa debit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-30T16:31:09.000Z",
    "title": "Vitalik Buterin outlines four ways crypto and AI can collaborate",
    "url": "https://cryptobriefing.com/vitalik-buterin-four-ways-crypto-ai-collaborate/?utm_source=feed&utm_medium=rss",
    "description": "Buterin envisions a future where AI and crypto work together to create more efficient, secure, and democratic digital systems."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-30T16:29:43.000Z",
    "title": "App-Specific Rollup Cartesi Announces A $1 Million Ecosystem Grants Initiative",
    "url": "https://www.cryptoglobe.com/latest/2024/01/app-specific-rollup-cartesi-announces-a-1-million-ecosystem-grants-initiative/",
    "description": "New York City, United States, January 30th, 2024, Chainwire Developers can receive up to $50,000 USDC per project, plus dedicated tech support, introduction to accelerators and investors, marketing support and project consulting.  Cartesi (CTSI), an app-specific rollup protocol with a virtual machine that runs Linux distributions, announced today an allocation for $1 million to the Cartesi Grants […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-30T16:12:57.000Z",
    "title": "Ripple (XRP), Cardano (ADA) and ScapesMania: The Race to $1 in the 2024 Crypto Market",
    "url": "https://cryptodaily.co.uk/2024/01/ripple-xrp-cardano-ada-and-scapesmania-the-race-to-1-in-the-2024-crypto-market",
    "description": "Are you ready for the next big crypto race? Ripple (XRP) and Cardano (ADA) are on the verge of a massive surge, eyeing the coveted $1 mark in the 2024 crypto market! Stay tuned to witness these altcoins potentially outshine Bitcoin and Ethereum, and redefine the cryptocurrency landscape."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-30T16:30:22.000Z",
    "title": "Transak Partners With Visa for Rapid Crypto to Fiat Conversion in 145 Nations",
    "url": "https://news.bitcoin.com/transak-partners-with-visa-for-rapid-crypto-to-fiat-conversion-in-145-nations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Transak Partners With Visa for Rapid Crypto to Fiat Conversion in 145 Nations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bis.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Tuesday, Transak, a company specializing in payment infrastructure, revealed its partnership with the financial services powerhouse Visa. This collaboration aims to empower users in 145 nations with the capability to seamlessly exchange their crypto holdings into local fiat currencies, leveraging the Visa Direct platform. Enhanced Crypto Liquidity: Transak&#8217;s Alliance with Visa Facilitates Swift Global [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T16:34:08.000Z",
    "title": "Abracadabra Finance Hit by Security Breach, Loses $6.4 Million",
    "url": "https://www.cryptopolitan.com/abracadabra-finance-security-breach-6-4-mil/",
    "description": "Abracadabra Finance, a prominent player in the decentralized finance (DeFi) sector, has become the latest victim of a significant security breach.&#160; The DeFi protocol reportedly suffered a substantial attack, leading to a loss exceeding $6.4 million. The incident has raised concerns about the vulnerability of DeFi platforms to sophisticated cyber threats. The technical flaw exploited [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T16:16:25.000Z",
    "title": "Peaq Launches ‘Peaq verify’: A Revolutionary Data Verification Framework in the Web3 Era",
    "url": "https://www.cryptopolitan.com/peaq-peaq-verify-framework-data-verification/",
    "description": "In a groundbreaking development, Peaq has announced the launch of &#8216;Peaq verify,&#8217; a sophisticated three-tier Decentralized Physical Infrastructure Networks (DePIN) data verification framework. The innovative solution is poised to transform the landscape of data verification, impacting a wide range of devices such as vehicles, machines, robots, and other Web3-connected devices. The introduction of &#8216;Peaq verify&#8217; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-30T16:30:17.000Z",
    "title": "Skybridge Capital CEO Reveals When Bitcoin Price Will Reach $170,000",
    "url": "https://www.newsbtc.com/news/bitcoin/when-bitcoin-price-170000/",
    "description": "Skybridge Capital CEO Anthony Scaramucci recently predicted that Bitcoin will hit $170,000. Shedding more light on this prediction, Scaramucci stated when this will happen and why he believes this price level is very attainable. When Bitcoin’s Price Will Hit $170,000 In an interview with Scott Melker, Scaramucci stated that Bitcoin’s price will hit $170,000 after the Bitcoin Halving. Specifically, he hinted that the crypto token was going to rise to this price level 18 months after the Halving event. The Skybridge Capital CEO further explained what he was basing his prediction on. Scaramucci mentioned that his prediction was based on past Bitcoin Halving cycles, noting that Bitcoin’s price increased about four times 18 months after Bitcoin miners’ rewards were cut in half. He expects that this time won’t be different, as $170,000 represents just over a fourfold increase from $35,000, which Scaramucci predicts will be Bitcoin’s price when the Halving takes place in April.  The Skybridge Capital CEO stated that his putting Bitcoin’s price at $35,000 by April was him just being “conservative.” If Bitcoin’s price turned out to be higher, at a price like $50,000, the the crypto token will rise to $200,000 in the next 18 months, Scaramucci claimed. Basically, his base prediction was that Bitcoin would do a 4x in the next 18 months after the Halving.  BTC bulls reclaim control &#124; Source: BTCUSD on Tradingview.com Bitcoin Will Get To At Least Half Of Gold’s Market Cap Scaramucci’s long-term prediction is that Bitcoin will “easily” get to half of Gold’s market cap, which stands at $13.7 trillion. That means Bitcoin’s market cap, which currently stands at around $850 billion, could rise to close to $7 trillion. If that happens, the Skybridge Capital CEO believes that Bitcoin’s price will become about 10 times its current price, rising to $400,000 in the process. Highlighting Bitcoin’s potential, Scaramucci stated that it would be “ridiculous” for people not to understand Bitcoin’s dynamics as a store of value and at least have some exposure to it. He also alluded to the Spot Bitcoin ETFs and how there is bound to be more institutional demand for the flagship crypto token following the approval of these funds.   This isn’t the first time that Scaramucci has mentioned the effect that Wall Street’s adoption of Bitcoin could have on the market. In September last year, he predicted that the Bitcoin market was going to widen once asset managers like BlackRock had a Spot Bitcoin ETF in their “arsenal.” At the time of writing, Bitcoin is trading at around $43,300, up over 2% in the last 24 hours, according to data from CoinMarketCap.  Featured image from Breet, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-30T16:26:35.000Z",
    "title": "Dogecoin’s Slam Dunk: Dallas Mavericks’ DOGE Acceptance Sparks 2024 Speculation",
    "url": "https://www.crypto-news-flash.com/dogecoins-slam-dunk-dallas-mavericks-doge-acceptance-sparks-2024-speculation/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-slam-dunk-dallas-mavericks-doge-acceptance-sparks-2024-speculation",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin-DOGE-logo-with-dark-numerical-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-dark-numerical-background-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Dallas Mavericks owner Mark Cuban reaffirms the NBA team&#8217;s active acceptance of Dogecoin (DOGE) as a valid payment method. Cryptocurrency analyst Muro also predicts the DOGE price amid positive market sentiments and the anticipation of DOGE&#8217;s integration into the X Payments feature led by Elon Musk. Dallas Mavericks owner and billionaire Mark Cuban, recently affirmed [...]"
  }
]