[
  {
    "source": "Decrypt",
    "date": "2023-06-16T19:42:16.000Z",
    "title": "Abra Cease-and-Desist Reveals Ties to Binance and Prime Trust",
    "url": "https://decrypt.co/144947/abra-cease-and-desist-reveals-ties-to-binance-and-prime-trust",
    "description": "The Texas regulator claims Abra has ties to Binance and Prime Trust, and roughly $70M stuck on Babel, Genesis, and 3AC."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-16T19:29:41.000Z",
    "title": "Europe Moves on AI Regulation to 'Counter Dangers to Democracy'",
    "url": "https://decrypt.co/144973/europe-moves-ai-regulation-counter-dangers-democracy",
    "description": "As the United States stalls on AI regulation, the European Parliament is moving along after passing a draft law on Wednesday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T19:35:51.000Z",
    "title": "Think AI tools aren't harvesting your data? Guess again",
    "url": "https://cointelegraph.com/news/artificial-intelligence-tools-harvesting-your-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/2cb6a794-fb4a-43b3-b777-aeb547320ab3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>When you use a “free” product like ChatGPT, your personal data is the product — and governments across the globe are using that to their advantage.</p>\n                    <p><p>The meteoric ascent of generative artificial intelligence has created a bonafide technology sensation thanks to user-focused products such as OpenAI’s ChatGPT, Dall-E and Lensa. But the boom in user-friendly AI has arrived in conjunction with users seemingly ignoring or being left in the dark about the privacy risks imposed by these projects.</p><p>In the midst of all this hype, however, international governments and major tech figures are starting to sound the alarm. Citing privacy and security concerns, <a href=\"https://cointelegraph.com/news/italy-blocks-chatgpt-investigates-suspected-violations\">Italy just placed a temporary ban on ChatGPT</a>, potentially inspiring a similar block in Germany. In the private sector, hundreds of AI researchers and tech leaders, including Elon Musk and Steve Wozniak, <a href=\"https://cointelegraph.com/news/elon-musk-and-tech-execs-call-for-pause-on-ai-development\">signed an open letter</a> urging a six-month moratorium on AI development beyond the scope of GPT-4. </p><p>The relatively swift action to try to rein in irresponsible AI development is commendable, but the wider landscape of threats that AI poses to data privacy and security goes beyond one model or developer. Although no one wants to rain on the parade of AI’s paradigm-shifting capabilities, tackling its shortcomings head-on now is necessary to avoid the consequences becoming catastrophic.</p><h2>AI’s data privacy storm</h2><p>While it would be easy to say that OpenAI and other Big Tech-fuelled AI projects are solely responsible for AI’s data privacy problem, the subject had been broached long before it entered the mainstream. Scandals surrounding data privacy in AI have happened prior to this crackdown on ChatGPT—they’ve just mostly occurred out of the public eye.</p><p>Just last year, Clearview AI, an AI-based facial recognition firm reportedly utilized by thousands of governments and law enforcement agencies with limited public knowledge, was banned from selling facial recognition technology to private businesses in the United States. Clearview also landed a fine of $9.4 million in the United Kingdom for its illegal facial recognition database. Who’s to say that consumer-focused visual AI projects such as Midjourney or others can’t be used for similar purposes?</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Clearview AI, the facial recognition tech firm, has confirmed my face is in their database. I sent them a headshot and they replied with these pictures, along with links to where they got the pics, including a site called &quot;Insta Stalker.&quot; <a href=\"https://t.co/ff5ajAFlg0\">pic.twitter.com/ff5ajAFlg0</a></p>&mdash; Thomas Daigle (@thomasdaigle) <a href=\"https://twitter.com/thomasdaigle/status/1270484220058664970?ref_src=twsrc%5Etfw\">June 9, 2020</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The problem is they already have been. A slew of recent deepfake scandals involving pornography and fake news created through consumer-level AI products have only heightened the urgency to protect users from nefarious AI usage. It takes a hypothetical concept of digital mimicry and makes it a very real threat to everyday people and influential public figures.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elizabeth-warren-wants-the-police-at-your-door-in-2024\"><strong><em>Elizabeth Warren wants the police at your door in 2024</em></strong></a></p><p>Generative AI models fundamentally rely upon new and existing data to build and strengthen their capabilities and usability. It’s part of the reason why ChatGPT is so impressive. That being said, a model that relies on new data inputs needs somewhere to get that data from, and part of that will inevitably include the personal data of the people using it. And that amount of data can easily be misused if centralized entities, governments or hackers get ahold of it.</p><p>So, with a limited scope of comprehensive regulation and conflicting opinions around AI development, what can companies and users working with these products do now?</p><h2>What companies and users can do</h2><p>The fact that governments and other developers are raising flags around AI now actually indicates progress from the glacial pace of regulation for Web2 applications and crypto. But raising flags isn’t the same thing as oversight, so maintaining a sense of urgency without being alarmist is essential to create effective regulations before it’s too late.</p><p>Italy’s ChatGPT ban is not the first strike that governments have taken against AI. The EU and Brazil are all passing acts to sanction certain types of AI usage and development. Likewise, generative AI’s potential to conduct data breaches has sparked early legislative action from the Canadian government.</p><p>The issue of AI data breaches is quite severe, to the point where OpenAI even had to step in. If you opened ChatGPT a couple of weeks ago, you might have noticed that the chat history feature was turned off. OpenAI temporarily shut down the feature because of a severe privacy issue where strangers’ prompts were exposed and ​​revealed payment information.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/artificial-intelligence-crypto-your-own-risk\"><strong><em>Don’t be surprised if AI tries to sabotage your crypto</em></strong></a></p><p>While OpenAI effectively extinguished this fire, it can be hard to trust programs spearheaded by <a href=\"https://cointelegraph.com/explained/how-web3-resolves-fundamental-problems-in-web2\">Web2</a> giants slashing their AI ethics teams to preemptively do the right thing.</p><p>At an industrywide level, an AI development strategy that focuses more on federated machine learning would also boost data privacy. Federated learning is a collaborative AI technique that trains AI models without anyone having access to the data, utilizing multiple independent sources to train the algorithm with their own data sets instead.</p><p>On the user front, becoming an AI Luddite and forgoing using any of these programs altogether is unnecessary, and will likely be impossible quite soon. But there are ways to be smarter about what generative AI you grant access to in daily life. For companies and small businesses incorporating AI products into their operations, being vigilant about what data you feed the algorithm is even more vital.</p><p>The evergreen saying that when you use a free product, your personal data <em>is </em>the product still applies to AI. Keeping that in mind may cause you to reconsider what AI projects you spend your time on and what you actually use it for. If you’ve participated in every single social media trend that involves feeding photos of yourself to a shady AI-powered website, consider skipping out on it.</p><p>ChatGPT reached 100 million users just two months after its launch, a staggering figure that clearly indicates our digital future will utilize AI. But despite these numbers, AI isn’t ubiquitous quite yet. Regulators and companies should use that to their advantage to create frameworks for responsible and secure AI development proactively instead of chasing after projects once it gets too big to control. As it stands now, generative AI development is not balanced between protection and progress, but there is still time to find the right path to ensure user information and privacy remain at the forefront.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Ryan Paterson</strong> is the president of Unplugged. Prior to taking the reins at Unplugged, he served as the founder, president and CEO of IST Research from 2008 to 2020. He exited IST Research with a sale of the company in September 2020. He served two tours at the Defense Advanced Research Agency and 12 years in the United States Marine Corps.</div></div><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Erik Prince </strong>is an entrepreneur, philanthropist and Navy SEAL veteran with business interests in Europe, Africa, the Middle East and North America. He served as the founder and chairman of Frontier Resource Group and as the founder of Blackwater USA — a provider of global security, training and logistics solutions to the U.S. government and other entities — before selling the company in 2010.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T19:30:00.000Z",
    "title": "3 key Ethereum price metrics point to growing resistance at the $1,750 level",
    "url": "https://cointelegraph.com/news/3-key-ethereum-price-metrics-point-to-growing-resistance-at-1750",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cf28d57a-13e0-4ae9-a11d-9fdae9533d1e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum price looks poised for additional downside as low as the $1,560 level.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/bitcoin-price\">ETH</a>) price plunged 7% between June 14 and June 15, reaching its lowest level in three months and impacting investors’ view that the altcoin was en-route to turning $2,000 to support. </p><p>It is worth noting that the $1,620 bottom represents a $196 billion market capitalization for Ether, which is higher than PetroChina’s $186 billion, and not far from chipmaker AMD’s $198 billion.</p><p>Being the 66th largest global tradable asset in the world is no small feat, especially considering that the cryptocurrency is merely 8 years old and does not return any kind of direct profit for the project’s maintenance. On the other hand, securities enjoy the benefits of corporate earnings and eventual government subsidies, so perhaps investors should be concerned by the recent price drop from Ether.</p><h2>Ether price pressured succumbs to regulation and lowered network activity</h2><p>Regulatory pressure helped to subdue investors’ appetite for Ether as the Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/requiring-dexes-to-register-with-sec-like-other-exchanges-is-impossible-says-coinbase-clo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/requiring-dexes-to-register-with-sec-like-other-exchanges-is-impossible-says-coinbase-clo/amp\">(SEC) proposed a rule change</a> regarding the definition of an exchange. Paul Grewal, chief legal officer of the Coinbase exchange, has pushed back against the proposed change, claiming that it violates the Administrative Procedure Act.</p><p>More concerningly, decentralized applications (Dapps) usage on the Ethereum network failed to gain momentum despite gas fees plummeting by 75%. The 7-day average transaction cost dropped to $4 on June 14, down from $16 one month prior. Meanwhile, Dapps active addresses declined by 18% in the same period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1812ffec-44df-4286-b90f-97c3c4175945.png\"><figcaption style=\"text-align: center;\"><em>30-day Ethereum DApp activity. Source: DappRadar</em></figcaption></figure><p>Notice that the decline happened across the board, affecting decentralized finance (DeFi), NFT marketplaces, gaming and collectibles alike. Curiously, the total value locked (TVL), which measures the deposits locked in Ethereum's smart contracts, declined by a mere 2% versus mid-May to 14.6 million ETH, according to DefiLlama.</p><p>To analyze the odds of Ether’s price breaking below the $1,650 support, one should check for a reduced ETH futures premium and increased costs for protective put options.</p><p>Ether<a href=\"https://cointelegraph.com/trading-for-beginners/crypto-derivatives\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/crypto-derivatives/amp\"> quarterly futures</a> are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.</p><p>As a result, ETH futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9099702d-b7e7-4b72-be56-7016f2b7eeab.png\"><figcaption style=\"text-align: center;\"><em>Ether 2-month futures annualized premium. Source: Laevitas</em></figcaption></figure><p>According to the futures premium, known as the basis indicator, professional traders have been avoiding leveraged longs (bullish bets). Despite the modest improvement to 2%, the indicator remains far from the neutral 5% threshold.</p><p>To exclude externalities that might have solely impacted the Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/25c9266e-233b-4c57-be8b-f6e48f048f00.png\"><figcaption style=\"text-align: center;\"><em>Ether 30-day 25% skew. Source: Laevitas</em></figcaption></figure><p>The skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew. As displayed above, the delta skew has been signaling fear since June 10 and peaked at 21% on June 15 — the highest level in three months.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-happened-in-crypto-today/amp\"><strong><em>Here’s what happened in crypto today</em></strong></a></p><h2>Ether’s price looks poised to drop down to $1,560</h2><p>Investors tend to focus solely on short-term price movements and forget that Ether’s price is up 37% year-to-date in 2023. Moreover, by relying too much on Ethereum Network's $24 billion total value locked (TVL), traders might have missed the signals of weakening demand for Dapps use.</p><p>For now, bears have the upper hand considering the ETH derivatives metrics, so a retest of the $1,560 support is the most likely outcome. That does not mean that the 2023 gains are at risk, but until the regulatory FUD dissipates, bulls will have a hard time moving Ether above the $1,750 resistance.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T19:30:00.000Z",
    "title": "Meta’s new ‘Voicebox’ AI is a text-to-speech tool that learns like ChatGPT",
    "url": "https://cointelegraph.com/news/meta-voicebox-ai-text-to-speech-tool-learns-like-chatgpt",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7b334a70-5bfc-4f63-a047-c3f62a5fd689.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Meta claims Voicebox is the first AI that can generalize text-to-speech tasks it wasn’t trained to accomplish and describes it as a “breakthrough.” </p>\n                    <p><p>Meta AI recently <a href=\"https://voicebox.metademolab.com/\" target=\"_blank\" rel=\"noopener nofollow\">unveiled</a> a “breakthrough” text-to-speech (TTS) generator it claims produces results up to 20 times faster than state-of-the-art artificial intelligence models with comparable performance. </p><p>The new system, dubbed Voicebox, eschews traditional TTS architecture in favor of a model more akin to OpenAI’s ChatGPT or Google’s Bard.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/vjqK031bgQQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Among the main differences between Voicebox and similar TTS models, such as ElevenLabs Prime Voice AI, is that Meta’s offering can generalize through in-context learning. </p><p>Much like ChatGPT or other transformer models, Voicebox uses large-scale training datasets. Previous efforts to use massive troves of audio data have resulted in severely degraded audio outputs. For this reason, most TTS systems use small, highly-curated, labelled datasets. </p><p>Meta overcomes this limitation through a novel training scheme that ditches labels and curation for an architecture capable of “in-filling” audio information. </p><p>As Meta AI put in a June 16 <a href=\"https://ai.facebook.com/blog/voicebox-generative-ai-model-speech/\" target=\"_blank\" rel=\"noopener nofollow\">blog post</a>, Voicebox is the “first model that can generalize to speech-generation tasks it was not specifically trained to accomplish with state-of-the-art performance.”</p><p>This makes it possible for Voicebox to translate text to speech, remove unwanted noise by synthesizing replacement speech, and even apply a speaker’s voice to different language outputs. </p><p>According to an accompanying research paper published by Meta, its pre-trained Voicebox system can <a href=\"https://scontent.ftij2-1.fna.fbcdn.net/v/t39.8562-6/351115037_821695399385346_5760299707145339818_n.pdf?_nc_cat=103&amp;ccb=1-7&amp;_nc_sid=ad8a9d&amp;_nc_ohc=41HlMFkgcfgAX802dZT&amp;_nc_ht=scontent.ftij2-1.fna&amp;oh=00_AfAyLKJwd82NUPPfiBr5y7pjfmoP1yGeiHwhq3Bi-16srw&amp;oe=64925FD1\" target=\"_blank\" rel=\"noopener nofollow\">accomplish</a> all of this using only the desired output text and a three-second audio clip.</p><p>The arrival of robust speech-generation comes at particular sensitive time as social media companies continue to <a href=\"https://cointelegraph.com/news/reddit-crypto-community-goes-offline-here-s-why\">struggle with moderation</a> and, in the U.S., a looming presidential election threatens to once again test the limits of online misinformation detection. </p><p>Former U.S. president Donald Trump, for example, currently faces allegations that he mishandled confidential government materials after leaving office. Among the purported evidence <a href=\"https://edition.cnn.com/2023/05/31/politics/trump-tape-classified-document-iran-milley/index.html\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> in the case against him are audio recordings wherein he allegedly admitted to potential wrongdoing. </p><p>While there’s currently no indication that the former president intends to deny the content described in the audio files, his case illustrates that data integrity resides at the core of the U.S. legal system and, by extension, its democracy. </p><p>Voicebox isn’t the first tool of its kind, but it appears to be among the most robust. As such, Meta’s developed a tool for determining if speech was generated by it which the company claims can “trivially detect” the difference between real and fake audio. Per the blog post: </p><blockquote>“As with other powerful new AI innovations, we recognize that this technology brings the potential for misuse and unintended harm. In our paper, we detail how we built a highly effective classifier that can distinguish between authentic speech and audio generated with Voicebox to mitigate these possible future risks.”</blockquote><p>In the cryptocurrency world, AI has become as integral to day-to-day operations for most businesses as the internet or electricity. The largest exchanges rely on AI chatbots for customer interactions and sentiment analysis, and trading bots have become commonplace. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bybit-plugs-into-chatgpt-for-ai-powered-trading-tools\"><strong><em>Bybit plugs into ChatGPT for AI-powered trading tools</em></strong></a></p><p>The advent of robust text-to-speech systems such as Voicebox, combined with automated trading, could help bridge a gap for would-be cryptocurrency traders who rely on TTS systems that, currently, may struggle with crypto jargon or multi-lingual support.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-16T19:30:36.000Z",
    "title": "Coinbase Introduces 4% USDC Rewards Amidst SEC Dispute",
    "url": "https://news.bitcoin.com/coinbase-introduces-4-usdc-rewards-amidst-sec-dispute/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase Introduces 4% USDC Rewards Amidst SEC Dispute\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddd-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On June 15, the San Francisco-based cryptocurrency exchange Coinbase announced that customers can now earn 4% rewards on the stablecoin USDC. The news follows Coinbase&#8217;s current dispute with the U.S. Securities and Exchange Commission (SEC) over the firm&#8217;s staking-as-a-service product. Coinbase Rolls Out 4% Stablecoin Rewards for Global Customers, Except Hawaii Residents Coinbase is now [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:54:00.000Z",
    "title": "VeChain Price Prediction 2023-2031: What’s the Growth Potential of VET?",
    "url": "https://www.cryptopolitan.com/vechain-price-prediction/",
    "description": "VeChain Price Prediction 2023-2032 Since its launch, Vechain’s focus has been building technologies that solve obstacles impeding the mass adoption of blockchain technology. Two mnths ago, one of the most important pieces of technology in this mission was officially launched — VORJ. VORJ is a no-code Web3-as-a-Service platform that enables anyone to create, deploy and ... <a title=\"VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vechain-price-prediction/\" aria-label=\"More on VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:51:59.000Z",
    "title": "Everything you need to know about Meta’s AI Voicebox",
    "url": "https://www.cryptopolitan.com/everything-to-know-about-metas-ai-voicebox/",
    "description": "Meta has introduced its latest breakthrough in artificial intelligence (AI) technology called Voicebox. This state-of-the-art AI model is designed to perform various speech generation tasks through in-context learning, including editing, sampling, and stylizing audio. With its remarkable capabilities, Voicebox has the potential to revolutionize virtual assistants, audio editing, and communication in the metaverse. In this ... <a title=\"Everything you need to know about Meta&#8217;s AI Voicebox\" class=\"read-more\" href=\"https://www.cryptopolitan.com/everything-to-know-about-metas-ai-voicebox/\" aria-label=\"More on Everything you need to know about Meta&#8217;s AI Voicebox\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:41:43.000Z",
    "title": "Texas regulator accuses lending firm Abra of committing fraud",
    "url": "https://www.cryptopolitan.com/texas-regulator-accuses-lending-firm-fraud/",
    "description": "In recent developments, Abra, a prominent crypto lending firm, has come under scrutiny as Texas regulators accuse the company of securities fraud and claim it has been insolvent since March 31. The Texas State Securities Board issued an emergency cease and desist order against Abra and its founder, William Barhydt, while alleging deceptive practices related ... <a title=\"Texas regulator accuses lending firm Abra of committing fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/texas-regulator-accuses-lending-firm-fraud/\" aria-label=\"More on Texas regulator accuses lending firm Abra of committing fraud\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:30:00.000Z",
    "title": "Monero Price Prediction 2023-2032: Should You Buy XMR Now?",
    "url": "https://www.cryptopolitan.com/monero-price-prediction/",
    "description": "Monero Price Prediction 2023-2032 This Monero Price Prediction will cover details about Monero, applications, price history, and factors affecting the native currency. There are plenty of things to consider before moving on to the Monero (XMR) price prediction. How much is Monero worth? Today&#8217;s Monero price is $136.21 USD with a 24-hour trading volume of $58,166,645 ... <a title=\"Monero Price Prediction 2023-2032: Should You Buy XMR Now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-prediction/\" aria-label=\"More on Monero Price Prediction 2023-2032: Should You Buy XMR Now?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:29:31.000Z",
    "title": "Key takeaways from Arthur Hayes’ latest article",
    "url": "https://www.cryptopolitan.com/takeaways-from-arthur-hayes-latest-article/",
    "description": "Arthur Hayes has become known for his interesting takes on various events happening in the world. His recent piece, a mixture of speculation and analysis about the economic future of China and its subsequent impact on cryptocurrencies, is particularly fascinating. I am going to break down and explore the key insights he provided. So, let&#8217;s ... <a title=\"Key takeaways from Arthur Hayes&#8217; latest article\" class=\"read-more\" href=\"https://www.cryptopolitan.com/takeaways-from-arthur-hayes-latest-article/\" aria-label=\"More on Key takeaways from Arthur Hayes&#8217; latest article\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:23:25.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T19:17:24.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? The live Aave price is $50.59, with a 24-hour trading volume of 38,874,410. AAVE is up by 0.30% in the last 24 hours. The current CoinMarketCap ranking is #50, with a live market cap of $729,798,351. It has a circulating supply of 14,426,583 AAVE coins and a max. supply of ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-16T20:00:46.000Z",
    "title": "DigiToads Presale on Fire as Robinhood Delists ADA, SOL, and MATIC",
    "url": "https://nulltx.com/digitoads-presale-on-fire-as-robinhood-delists-ada-sol-and-matic/",
    "description": "As the new meme coin with extensive practical utilities, DigiToads (TOADS) has made its place strong in investors&#8217; wallets while raising more than $4.8M in the capital.  The fluctuating crypto market news and top crypto coins&#8217; struggles to stay at a steadily growing pace continue to spread uncertainty in the market every passing day. From [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T19:15:33.000Z",
    "title": "Bitcoin Bullish Momentum Building: Expert Predicts Rise To $27,200",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bullish-momentum-rise-to-27200/",
    "description": "Bitcoin has been on a rollercoaster ride recently, with sudden price drops and spikes keeping investors on their toes. Last week, the cryptocurrency failed to break through its $27,500 resistance level and dropped to a low of $24,700.  However, Bitcoin has again shown signs of regaining its bullish momentum, with a 5% increase in the last 24 hours and trading at $26,400 at the time of writing. Many analysts have predicted a continuation of the uptrend in Bitcoin&#8217;s price, which has been ongoing since January 2023. Related Reading: Curve (CRV) Observes 7% Bounce As Short Squeeze Occurs Bearish Momentum Fades As Bitcoin Retests $26,500 According to Glassnode co-founder Yan Allemann, the current stage in this trend is the retesting of the $26,200 level as bearish momentum fades.  Allemann believes that this is an important stage, as it will determine whether Bitcoin can break through its previous resistance and move toward the next target of $27,200 However, while Bitcoin is showing signs of regaining its bullish momentum, it&#8217;s important to recognize that it is still fragile at this level. Therefore, building confidence among investors is crucial to sustaining Bitcoin&#8217;s upward trend. On a positive note, BlackRock&#8217;s recent application with the Securities and Exchange Commission (SEC) for its new exchange-traded fund (ETF) has given Bitcoin holders and bulls hope.  As reported by NewsBTC, the recent announcement of BlackRock&#8217;s Bitcoin exchange-traded fund has the potential to impact BTC’s price significantly. If approved, this ETF would enable a wider range of investors to gain exposure to Bitcoin, which could drive up demand and ultimately increase its price. ETFs provide a convenient way for institutional investors to access Bitcoin, creating a new demand avenue for the cryptocurrency. This could increase buying pressure and a potential surge in Bitcoin&#8217;s price. Potential BTC Reversal From Support Bitcoin has recently bounced from its bullish trend and the top of its range, indicating that it still has some work to do before establishing a sustainable upward trend.  According to market analyst Crypto Con, one of the most accurate indicators of Bitcoin&#8217;s bullish or bearish momentum is the 140-day moving average (MA), which shows that BTC’s price is below this crucial level. The 140DMA is a widely followed indicator in the cryptocurrency market, as it clearly signals whether Bitcoin is in a bullish or bearish phase.  When BTC’s price is above the 140DMA, it&#8217;s a bullish signal, indicating that the cryptocurrency will likely continue its upward trend. Conversely, when the price is below the 140DMA, it&#8217;s a bearish signal, suggesting that the cryptocurrency will likely experience a downward trend. Bitcoin&#8217;s price is below the 140DMA, indicating that it&#8217;s in a bearish phase. However, Crypto Con hopes the cryptocurrency will experience a huge reversal from this support level, leading to a bearish fakeout of the 140DMA. This strong bullish signal could indicate that Bitcoin is ready to continue its upward trend. Related Reading: Shiba Inu Lead Developer Unveils Shibacals, Advancing Shibarium Development As BlackRock&#8217;s potential Bitcoin ETF gains attention and BTC gradually regains its bullish momentum, investors are increasingly optimistic that Bitcoin&#8217;s bottom is already behind. There is a growing belief that the largest cryptocurrency in the market is poised to reach new annual highs in 2023 and possibly even surpass its all-time high. However, for BTC to continue its upward trend, the cryptocurrency needs to maintain its current level of $26,000 throughout the weekend. A sustained price above this price mark could indicate that BTC is on track for a green week in the coming days. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-16T20:00:23.000Z",
    "title": "Billionaire Investor Mark Cuban Warns 99% of Crypto Assets Will Fail, Says ‘Winners Will Be Game Changers’",
    "url": "https://dailyhodl.com/2023/06/16/billionaire-investor-mark-cuban-warns-99-of-crypto-token-will-fail-says-winners-will-be-game-changers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/mark-token-will-fail.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire celebrity investor Mark Cuban thinks the vast majority of digital assets will go bust – but he&#8217;s still a believer in crypto. This week, the Shark Tank star had a friendly debate on Twitter with John Reed Stark, a crypto skeptic who founded the U.S. Securities and Exchange Commission&#8217;s (SEC) Office of Internet Enforcement, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/16/billionaire-investor-mark-cuban-warns-99-of-crypto-token-will-fail-says-winners-will-be-game-changers/\">Billionaire Investor Mark Cuban Warns 99% of Crypto Assets Will Fail, Says ‘Winners Will Be Game Changers’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-16T19:55:46.000Z",
    "title": "Crypto Trader Calls Yesterday’s Bitcoin (BTC) Bounce but Admits to Possibly Misinterpreting One Key Metric",
    "url": "https://dailyhodl.com/2023/06/16/crypto-trader-calls-yesterdays-bitcoin-btc-bounce-but-admits-to-possibly-misinterpreting-one-key-metric/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-Primed-for-Bounce.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Justin Bennett called yesterday&#8217;s Bitcoin (BTC) rebound hours before it happened. Yesterday, Bennett told his 112,400 Twitter followers that a Bitcoin bounce could be on its way after a rough week for the crypto king. &#8220;Pretty spot on from BTC so far but maybe a bounce soon to flush some shorts.  Still a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/16/crypto-trader-calls-yesterdays-bitcoin-btc-bounce-but-admits-to-possibly-misinterpreting-one-key-metric/\">Crypto Trader Calls Yesterday’s Bitcoin (BTC) Bounce but Admits to Possibly Misinterpreting One Key Metric</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]