[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T15:20:10.000Z",
    "title": "Beeple Goes Punk With $208K NFT Purchase",
    "url": "https://www.coindesk.com/web3/2023/08/02/beeple-goes-punk-with-208k-nft-purchase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The artist behind the most expensive NFT ever sold bought his first-ever PFP, CryptoPunk #4593."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-02T15:15:50.000Z",
    "title": "Litecoin Undergoes Third 'Halving,' in Milestone for 12-Year-Old Blockchain",
    "url": "https://www.coindesk.com/tech/2023/08/02/litecoin-undergoes-third-halving-in-milestone-for-12-year-old-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The blockchain's \"halving,\" where the pace of new issuance of cryptocurrency gets cut in half every four years, took place Wednesday, when it reached data block 2,520,000."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T15:16:47.000Z",
    "title": "Litecoin halving completes as LTC sees increased payments adoption",
    "url": "https://cointelegraph.com/news/litecoin-halving-completes-ltc-sees-increased-payments-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f4df51af-076e-43a2-9e3d-885802c789ad.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Litecoin block rewards have now halved to 6.25 LTC as the halving clock is reset for another four years.  </p>\n                    <p><p>The Litecoin halving event has been completed with block rewards now halved at 6.25 Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) per block. </p><p>On Aug. 2, the Litecoin blockchain went through its automated <a href=\"https://cointelegraph.com/news/litecoin-halving-where-is-ltc-price-rally\">halving procedure</a> at block 2,520,000. LTC miners are now getting half the rewards and the clock has been reset for the next halving in roughly four years' time. </p><p>Litecoin founder Charlie Lee commented on the discrepancies between the different halving countdown timers, suggesting that the <a href=\"https://www.nicehash.com/countdown/ltc-halving-2023-08-06-11-00\" target=\"_blank\" rel=\"noopener nofollow\">NiceHash</a> one was the most accurate. However, all of them agreed on an Aug. 2 date.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is funny. I googled &quot;Litecoin Block Halving Countdown&quot; and checked the first 4 hits. The ETA for the halving is all over the map!<br><br>From my quick calculation, I believe NiceHash&#39;s countdown is the most accurate. I expect the halving to occur in about a 1 day, 2 hours, and 30… <a href=\"https://t.co/7lvOKCtiOh\">pic.twitter.com/7lvOKCtiOh</a></p>&mdash; Charlie Lee Ⓜ️️ (@SatoshiLite) <a href=\"https://twitter.com/SatoshiLite/status/1686353701118918656?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Moreover, <a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a> prices have been down trending since early July when they topped $110 for the first time since April 2022. The silver to Bitcoin’s gold is currently hovering around the $92 level where it was this time a fortnight ago. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Litecoin&#39;s third HALVING is just hours away. The block reward will automatically adjust from 12.5 to 6.25 <a href=\"https://twitter.com/search?q=%24LTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$LTC</a> - thus making Litecoin a predictable monetary supply and a deflationary currency. <br><br>Litecoin ⚡ Sound Money. <a href=\"https://t.co/9h1rh4f0vi\">pic.twitter.com/9h1rh4f0vi</a></p>&mdash; Litecoin (@litecoin) <a href=\"https://twitter.com/litecoin/status/1686486271336861696?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Speaking on the adoption of Litecoin as a payment method, BitPay CEO Stephen Pair told Cointelegraph that Litecoin and Bitcoin Lightning payments had their best months in recent history on the global payments platform. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/litecoin-price-poised-for-700-gains-vs-bitcoin-says-charlie-lee\"><strong><em>Litecoin price poised for 700% gains vs. Bitcoin, says Charlie Lee</em></strong></a></p><p>As of June, LTC <a href=\"https://bitpay.com/stats/\" target=\"_blank\" rel=\"noopener nofollow\">surpassed</a> Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) as the crypto of choice for <a href=\"https://cointelegraph.com/news/bitcoin-still-dominates-total-payments-on-bitpay-despite-the-bear-market\">payments on BitPay</a>, accounting for 35%. BitPay claims to have processed 57,949 crypto-related total transactions over the past 30 days. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2415989d-d1bb-4d08-9270-d4ec3f196761.jpg\"  /><figcaption style=\"text-align: center;\"><em>BitPay payments by crypto asset. Source: BitPay</em></figcaption></figure><p>While North America, Europe and the United Kingdom remain the firm's largest markets Pair said there was notable growth for crypto payments in Africa. </p><blockquote>“We are seeing notable growth in African-based BitPay users, with more merchants and spenders replacing traditional banking systems in favor of cryptocurrency.”</blockquote><p>“Latin America is also an area where we expect to see a rise in activity from BitPay merchants and customers over the next few years,” he added.</p><p>Litecoin is the 12th largest cryptocurrency by market capitalization with $6.8 billion with its daily trading volume around $1.14 billion.</p><p>There are currently 73.5 million LTC in circulation out of a maximum supply of 84 million.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\"><strong><em>‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-02T15:28:25.000Z",
    "title": "Polygon zkEVM’s Chain Could be Improving with Spark Protocol Deployment",
    "url": "https://cryptobriefing.com/polygon-zkevms-spark-protocol-deployment/?utm_source=feed&utm_medium=rss",
    "description": "Spark Protocol, anopen-source ZK-Rollup giving the , announced a proposal to deploy its system on the Polygon zkEVM chain, aiming to foster growth and innovation in the multi-chain EVM ecosystem..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T15:15:00.000Z",
    "title": "Shiba Inu Sharks Are Rapidly Accumulating SHIB and Pomerdoge, Upcoming Surge Predicted",
    "url": "https://cryptodaily.co.uk/2023/08/shiba-inu-sharks-are-rapidly-accumulating-shib-and-pomerdoge-upcoming-surge-predicted",
    "description": "<p class=\"s5\">Market analysts have forecasted another bull market, with meme coins expected to surge massively. In anticipation of gains, Shiba Inu sharks and dolphins are rapidly accumulating SHIB tokens. Pomerdoge (POMD), adding to the excitement in the meme coin landscape, is building a P2E gaming ecosystem. Top analysts are forecasting a massive surge for the POMD token.</p>\n<p>Click Here To Find Out More About The Pomerdoge (POMD) Presale</p>\nShiba Inu Sharks and Dolphins Amass SHIB Tokens\n<p class=\"s5\">The cryptocurrency market is on the cusp of another bull market and Shiba Inu investors are getting ready. According to new data published by Santiment, they are now accumulating tokens projected to rise in the bull market.</p>\n<p class=\"s5\">The data shows that over the last eight weeks, Shiba Inu sharks and dolphins have bought $9 million worth of SHIB. Sharks and dolphins are wallets that hold between 10 million-100 billion SHIB tokens. The accumulation of SHIB tokens comes after the public release of a beta bridge in anticipation of the Shibarium launch.</p>\n<p class=\"s5\">Shibarium is Shiba Inu&rsquo;s most anticipated layer-2 scaling solution expected to improve network performance. The launch scheduled for August is expected to cause a SHIB rally. Now trading at $0.000008384, Shiba Inu is expected to bridge the $0.000010 resistance at the launch of Shibarium.</p>\nPomerdoge (POMD) Accumulation Spikes Ahead of Massive Rally \n<p class=\"s5\">Another token Shiba Inu investors have been stacking up is Pomerdoge (POMD). The new play-to-earn token promises even bigger returns than Shiba Inu in 2023. Promising up to a 4,000% increase before the end of 2023, Pomerdoge has captured the attention of a lot of investors.</p>\n<p class=\"s5\">It combines the already popular meme coin sector with the fast-growing P2E sector. The goal is to create an immersive gaming ecosystem where gamers are rewarded for their accomplishments as well as their effort.</p>\n<p class=\"s5\">Gamers will create avatars in the ecosystem known as Pomerdoges. They will be able to customize and upgrade their Pomerdoges to increase their chances of winning in competitions. Pomerdoge will also allow gamers to interact amongst themselves outside the area for competitions.</p>\n<p class=\"s5\">The ecosystem will also feature a Pomerplace &ndash; a non-fungible token marketplace. Here, the gamers will be able to trade skins, in-game items, and other valuable assets. The combination of meme coins with entertainment is what has made POMD one of the most popular tokens still in presale.</p>\n<p class=\"s5\">Early participants of the presale will get access to an exclusive collection of 7,777 NFTs. Each of these NFTs will hold immense value and benefits. At the time of this writing, the POMD token trades at $0.007 in the first stage of its presale. The promised price rally would see the token trade as high as $0.28 by the end of this year.</p>\nFind out more about the Pomerdoge (POMD) Presale Today\n<p class=\"s5\">Website: https://pomerdoge.com/</p>\n<p class=\"s5\">Telegram Community: https://t.me/pomerdoge</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T15:15:00.000Z",
    "title": "Litecoin and TRON (TRX) Trade Volume Sinks, Tradecurve To 100x When It Lists",
    "url": "https://cryptodaily.co.uk/2023/08/litecoin-and-tron-trx-trade-volume-sinks-tradecurve-to-100x-when-it-lists",
    "description": "<p class=\"s6\">Tradecurve (TCRV) is considered one such rare project, with which you can mint millions in the crypto industry.Therefore, its ongoing presale is getting oversubscribed during each stage. On the other hand, Litecoin (LTC) and TRON (TRX) are swinging wildly, making their holders nervous.</p>\n<p class=\"s6\">The crypto market is intrinsically volatile, but you can get some enormous returns on your investment if you choose a stable, and growth-oriented project.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nLitecoin&rsquo;s (LTC) Trade Volume Sinks\n<p class=\"s6\">Amid the current dwindling market, Litecoin (LTC) has not been able to put up a strong performance. As per the data from Tradingview, the trading volume on the Litecoin network has been declining.</p>\n<p class=\"s6\">Subsequently, the price of Litecoin has tumbled, with its exchange rate falling by 18% in the past week. Currently, Litecoin is being traded at $72.58. Experts say that Litecoin&rsquo;s market health has worsened since the SEC described LTC as a security.</p>\n<p class=\"s6\">Thus, the hype around Litecoin&rsquo;s upcoming halving event has waned. Although the Litecoin community hopes to see a price rebound ahead of the halving event scheduled in August, the fading hype around it may hurt LTC in the long run.</p>\nTRON (TRX) And DWF Labs Join Hands\n<p class=\"s6\">TRON (TRX) has been suffering with selloff pressure for the past many days. Subsequently, Tron&rsquo;s value on exchanges has taken a toll. The trading price of TRON has nosedived by more than 10% in the past seven days.</p>\n<p class=\"s6\">At the time of writing, TRON is changing hands at $0.0695. Meanwhile, to sustain its network growth and prevent the price from falling further, TRON has entered into a strategic partnership with DWF Labs.</p>\n<p class=\"s6\">Through this collaboration, DWF Labs will act as a liquidity provider for TRON. However, experts believe that TRON will not be able to get any immediate relief with this partnership.</p>\nTradecurve Shows Bullish Path To Dwindling Market\n<p class=\"s6\">After the collapse of the FTX exchange, which wiped out $2 billion in customer funds, traders have become apprehensive about the credibility of centralized exchanges. The situation has worsened with the latest lawsuits filed against well-established platforms like Binance and Coinbase. Therefore, traders are jumping ships to register on the Tradecurve (TCRV) exchange.</p>\n<p class=\"s6\">It is a new decentralized trading platform, which is set to enter the top 3 crypto exchanges list. The platform enables people to trade various classes of assets on a single platform, without relying on fiat payments.</p>\n<p class=\"s6\">To assure traders of their anonymity and privacy, Tradecurve has not implemented any KYC procedure on the platform. This makes it one of the first such crypto exchanges, eclipsing other centralized platforms like Coinbase, where users are mandated to input their sensitive details. It has also implemented 2FA security, and DeFi capabilities to ensure the protection of traders.</p>\n<p class=\"s6\">The platform offers many benefits to its token holders, including exclusive deposit bonuses, discounts on transaction fees, and high leverage starting from 500:1. The platform&rsquo;s presale stage 5 is live, and a token is now available for $0.025. The project&rsquo;s market value has been pegged to grow by 80x in the next few months.</p>\nFor more information about the Tradecurve (TCRV) presale:\n<p class=\"s6\">Website: https://tradecurve.io/</p>\n<p class=\"s6\">Buy presale: https://app.tradecurve.io/sign-up</p>\n<p class=\"s6\">Twitter: https://twitter.com/Tradecurveapp</p>\n<p class=\"s6\">Telegram: https://t.me/tradecurve_official</p>\n<p class=\"s6\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T15:30:00.000Z",
    "title": "Biggest Movers: MATIC Bounces From 4-Week Low, After Collision With Key Support Point",
    "url": "https://news.bitcoin.com/biggest-movers-matic-bounces-from-4-week-low-after-collision-with-key-support-point/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: MATIC Bounces From 4-Week Low, After Collision With Key Support Point\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2246314145.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Polygon rebounded from a four-week low on Wednesday, as bulls rejected a breakout below a key support point. The wider market cap was mostly higher in today’s session, led by the optimism surrounding Microstrategy’s latest bitcoin investment. Chainlink also jumped higher after recent losses. Polygon (MATIC) Polygon (MATIC) bounced back higher during Wednesday’s session, as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:37:17.000Z",
    "title": "Here’s an in-depth look at what happened in crypto today",
    "url": "https://www.cryptopolitan.com/a-look-at-what-happened-in-crypto-today-2/",
    "description": "Good morning Americans &#8211; too early to catch up on the crypto industry? I don’t think so. While the American markets were asleep &#8211; here is what the rest of the world was up and about doing. To start off &#8211; The Kenyan government is not having the tale-benefit talk about Worldcoin &#8211; the coin ... <a title=\"Here’s an in-depth look at what happened in crypto today\" class=\"read-more\" href=\"https://www.cryptopolitan.com/a-look-at-what-happened-in-crypto-today-2/\" aria-label=\"More on Here’s an in-depth look at what happened in crypto today\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:33:09.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:15:58.000Z",
    "title": "Upstart’s AI Stock Surges in July – Can the Momentum Continue in August and Beyond?",
    "url": "https://www.cryptopolitan.com/upstarts-ai-stock-surges-in-july-bull-market/",
    "description": "Artificial intelligence (AI) stocks are gaining significant traction in the market, and one company that has been on fire is Upstart (NASDAQ: UPST), an AI-based consumer lending firm. Upstart&#8217;s stock price nearly doubled in July, outperforming the S&#38;P 500, which only saw modest gains. The surge in Upstart&#8217;s stock came despite a lack of major ... <a title=\"Upstart&#8217;s AI Stock Surges in July &#8211; Can the Momentum Continue in August and Beyond?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/upstarts-ai-stock-surges-in-july-bull-market/\" aria-label=\"More on Upstart&#8217;s AI Stock Surges in July &#8211; Can the Momentum Continue in August and Beyond?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T15:36:29.000Z",
    "title": "Kenya suspends Worldcoin operations over security and data concerns ",
    "url": "https://crypto.news/kenya-suspends-worldcoin-operations-over-security-and-data-concerns/",
    "description": "Kenya has suspended all Worldcoin project activities in the country until it can be confident that there are no risks to the public"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T15:11:42.000Z",
    "title": "MicroStrategy’s $750M Stock Sale Hints at More Bitcoin Acquisition – Bull Run Excitement Grows Among BTC Investors",
    "url": "https://www.crypto-news-flash.com/microstrategys-750m-stock-sale-hints-at-more-bitcoin-acquisition-bull-run-excitement-grows-among-btc-investors/?utm_source=rss&utm_medium=rss&utm_campaign=microstrategys-750m-stock-sale-hints-at-more-bitcoin-acquisition-bull-run-excitement-grows-among-btc-investors",
    "description": "<img width=\"1280\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-1024x639.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-768x479.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-163x102.png 163w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />MicroStrategy plans to sell $750 million worth of stock that could likely be used to purchase Bitcoin (BTC). The company remains the largest non-crypto firm with BTC holdings in its reserves. The largest non-crypto-focused and publicly traded company holder of Bitcoin (BTC), MicroStrategy, is still bent on increasing its portfolio for the global leading cryptocurrency. [...]"
  }
]