[
  {
    "source": "Decrypt",
    "date": "2024-02-01T19:35:31.000Z",
    "title": "Bitcoin Billionaire Arthur Hayes: It's Time to ‘Get Back on the Solana Train’",
    "url": "https://decrypt.co/215282/get-back-on-the-solana-train-arthur-hayes-bitcoin",
    "description": "The respected crypto authority predicts a significant rally for Solana (SOL) amid brewing banking sector challenges."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T19:11:21.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Polygon Labs has laid off 19% of its staff in an effort to \"enhance performance.\" Meanwhile, all spot Bitcoin (BTC) exchange-traded funds (ETFs) combined, except Grayscale Bitcoin Trust (GBTC), added 142,294 Bitcoin in total in January 2024, while Celsius, now from Chapter 11 bankruptcy in the United States, is set to start distributing $3 billion worth of crypto and fiat to creditors. </p><p>Polygon Labs, the developer behind the Polygon ecosystem, <a href=\"https://cointelegraph.com/news/polygon-labs-cuts-staff-efficiency\">announced large staff cuts</a> on Feb. 1. </p><p>In a blog post, CEO Marc Boiron said the firm would let go of 60 people “for the sake of enhanced performance.” He described the layoffs as “difficult, but necessary,” noting there were no financial motivations for the decision. As such, the CEO said each remaining employee would get a 15% pay hike. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-01T19:18:11.000Z",
    "title": "US to launch survey on cryptocurrency miners’ energy consumption",
    "url": "https://cryptoslate.com/us-to-launch-survey-on-cryptocurrency-miners-energy-consumption/",
    "description": "<p>The United States, through the Energy Information Administration (EIA), will start collecting data about cryptocurrency miners&#8217; energy consumption rate within the nation starting next week. On Jan. 31, the EIA revealed its intention to initiate a provisional survey targeting commercial cryptocurrency miners. This survey was authorized by the Office of Management and Budget (OMB) as [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/us-to-launch-survey-on-cryptocurrency-miners-energy-consumption/\">US to launch survey on cryptocurrency miners&#8217; energy consumption</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-01T19:22:07.000Z",
    "title": "Chainalysis finds pump-and-dumps in over half of 2023 DEX Ethereum listings",
    "url": "https://cryptobriefing.com/chainalysis-pump-dumps-half-2023-dex-ethereum-listings/?utm_source=feed&utm_medium=rss",
    "description": "53% of ERC-20 tokens listed on DEXes in 2023 showed pump-and-dump red flags - netting $241M total but only $2,672 per token on average"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-01T19:30:12.000Z",
    "title": "Hong Kong Worldcoin Offices Visited Amid Privacy Investigation",
    "url": "https://news.bitcoin.com/hong-kong-worldcoin-offices-visited-amid-privacy-investigation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Hong Kong Worldcoin Offices Visited Amid Privacy Investigation\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/810721d3-1b4c-4323-8166-8963f43d9a37.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The offices of the Worldcoin project, a biometric scanning and wallet initiative, have been visited by authorities in Hong Kong amidst a broad privacy investigation. The authorities, complying with a court warrant, advised the general audience to protect their sensitive data carefully and avoid casually providing their biometric information to third parties. Worldcoin Under Investigation [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-01T19:31:20.000Z",
    "title": "Genesis agrees $21m SEC settlement in Gemini Earn lawsuit",
    "url": "https://crypto.news/genesis-sec-settlement-gemini-earn-lawsuit/",
    "description": "The SEC’s civil lawsuit against Barry Silbert-backed Genesis has ended in a mutual settlement amid bankruptcy proceedings for the defunct crypto service provider. "
  },
  {
    "source": "BTCManager",
    "date": "2024-02-01T19:24:39.000Z",
    "title": "Bitcoin mining causing health, noise crises in small Texas town",
    "url": "https://crypto.news/bitcoin-mining-health-crisis-texas/",
    "description": "Residents of Granbury, Texas, are facing unprecedented disturbances, health issues, and environmental crises due to a local Bitcoin mining operation, as reported by TIME. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-01T19:30:26.000Z",
    "title": "Bitcoin Set For ‘Dullest Rally’ With A Twist, Whale Forecasts",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-set-for-dullest-rally-with-a-twist-whale-forecasts/",
    "description": "Bitcoin has been unable to retain its bullish momentum and seems likely to extend its current downside trend. However, the long run remains positive, and the next months could see BTC reach its all-time high, but in a different fashion than in previous rallies, according to a large investor. Related Reading: Bitcoin Set For Weekend Rally Amid New Banking Crisis: Arthur Hayes As of this writing, Bitcoin trades at $42,000 with a 1% loss in the last 24 hours. Over the previous week, the cryptocurrency still records a 5% profit. Bitcoin Whales Makes Bullish Forecast According to a pseudonym Bitcoin Whale that goes by “Joe007” on social media X, the cryptocurrency is poised for a bull run. The institutions trading the US spot Bitcoin Exchange Traded Fund (ETF) will drive this bullish momentum. In that sense, these institutions are likely to suck the volatility out of Bitcoin by pushing to trade similar to traditional assets. Thus, Joe007 claims that this cycle’s rally will lack the excitement of 2017 and 2021 when BTC hit $20,000 and $69,000, respectively, creating euphoria amongst investors. The Bitcoin whale stated: I think we&#8217;re about to witness the most boring rally in Bitcoin history. No retail-driven parabolic swings that excite degens/noobs and produce headlines. Rather a slow relentless drive higher by professional accumulators taking out layer after layer of paper handed holders. The whale dismissed the possibility when asked if traditional institutions could fail in “taming” BTC due to the “systemic crises” in the space. In addition, Joe007 dismissed the possibility of the cryptocurrency not running higher in the long run. The only thing that could stand between Bitcoin and a rally is a “low probability” scenario where the traditional finance sector experiences a similar crash to 2008. The BTC whale added: (…) unless there is a sudden complete tradfi meltdown (2008-style or worse). Then I can see Bitcoin being dragged into a general panic-crash, at least initially. Certainly possible but hard to assign realistic probability. BTC Price In The Short Term On low timeframes, an analyst pointed at the Daily On Balance Volume (OBV), which suggests further downside for BTC. The chart below shows that this metric broke out of a trending channel during Bitcoin’s recent crash. Related Reading: Bitcoin Halving Prep: Analyst Outlines Key Points Ahead Of Event The OBV was rejected out of a critical level and seems poised to trend to the upside along with the price of BTC. The analyst stated: Daily OBV still looks like it wants more downside. Looks like this might have been a lower high that we just put in. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-01T19:14:00.000Z",
    "title": "El Salvador’s Pro-Bitcoin Policy Will Remain After Election: Vice President",
    "url": "https://coinedition.com/el-salvadors-pro-bitcoin-policy-will-remain-after-election-vice-president/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/El-Salvadors-Pro-Bitcoin-President-Condemns.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"El Salvador’s Vice President Asserts Pro-Bitcoin Stance\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/El-Salvadors-Pro-Bitcoin-President-Condemns.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/El-Salvadors-Pro-Bitcoin-President-Condemns-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/El-Salvadors-Pro-Bitcoin-President-Condemns-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/El-Salvadors-Pro-Bitcoin-President-Condemns-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/El-Salvadors-Pro-Bitcoin-President-Condemns-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>El Salvador’s vice president, Felix Ulloa, confirmed on Wednesday that the pioneering cryptocurrency, Bitcoin, will remain a legal tender in the country during President Nayib Bukele’s second term, Reuters reported.  Ahead of the election slated for February 4th, Ulloa stated that the current administration’s pro-Bitcon stance will continue into the next term. That also includes [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/el-salvadors-pro-bitcoin-policy-will-remain-after-election-vice-president/\">El Salvador’s Pro-Bitcoin Policy Will Remain After Election: Vice President</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]