[
  {
    "source": "Decrypt",
    "date": "2023-10-12T22:45:43.000Z",
    "title": "AI Sparks Security Fears at US Space Force",
    "url": "https://decrypt.co/201321/ai-sparks-security-fears-us-space-force",
    "description": "The U.S. Space Force put a stop to personal AI use on duty, joining companies wary of generative AI's implications on privacy and security."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T22:54:57.000Z",
    "title": "BitVM’s goal is to scale Bitcoin, not be a pseudo-Ethereum, says dev",
    "url": "https://cointelegraph.com/news/bitcoin-bitvm-goal-is-scaling-not-ethereum-defi-altcoins-supertestnet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/11af8605-3ad4-453b-814a-f8d98613b6e1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Building a decentralized exchange on Bitcoin would be a “step backward,” for example, said Bitcoin developer Super Testnet.</p>\n                    <p><p>One of the developers working on “BitVM” — a Bitcoin-based virtual machine — reiterates the tech is intended to scale Bitcoin rather than launching Ethereum-like decentralized finance applications on the network.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-bitvm-whitepaper-computation-smart-contracts\">BitVM’s whitepaper was released</a> by ZeroSync’s project lead Robin Linus on Oct. 10 with technical support provided by pseudonymous developer “Super Testnet” — implementing BitVM’s first proof-of-concept and working on expanding BitVM’s capabilities.</p><p>Upon its release, some industry pundits formed the <a href=\"https://x.com/TO/status/1711748454622347766\" target=\"_blank\" rel=\"noopener nofollow\">impression</a> that BitVM would bring DeFi to Bitcoin like what the Ethereum Virtual Machine (EVM) did for Ethereum.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Lightning also fall short in the scaling department. It&#39;s nowhere near solving scalability.<br>We need more complementary things. <br><br>&gt; this is just another defi on bitcoin attempt.<br><br>Again, the motivation behind BitVM by the author was not DeFi. It was scaling.</p>&mdash; Hampus (@hampus_s) <a href=\"https://twitter.com/hampus_s/status/1712585190302740729?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, Super Testnet tells Cointelegraph that BitVM is scaling-focused rather than being about implementing smart contracts and an avalanche of altcoins:</p><blockquote>“The real killer app is scaling Bitcoin. [Robin Linus isn’t] a big fan of smart contracts. He's not a big fan of increasing Bitcoin's expressivity. He really is interested in making it so that Bitcoin can process millions of transactions per second.”</blockquote><p>Super Testnet said he doesn’t want BitVM to be flooded with <a href=\"https://cointelegraph.com/news/bitcoin-needs-ethereum-evm-botanix-founder\">(EVM)-like tokens</a> because it’ll bring bad actors to Bitcoin:</p><blockquote>“I don't want to see everything from the Ethereum ecosystem because most of it is Ponzi schemes.”</blockquote><p>Building a decentralized exchange on Bitcoin would be a “step backward,” he added.</p><p>Meanwhile, Super Testnet notes that BitVM won’t be an “instant death” for Ethereum’s altcoins, which some have <a href=\"https://www.reddit.com/r/Bitcoin/comments/173y4g0/the_release_of_bitvm_renders_all_altcoins_useless/\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> — though it could take demand away from them.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hot Off the Press: BitVM White Paper Drops! Experience a groundbreaking computing approach for smart contracts on <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <br><br>Unlock functionalities previously assumed to demand a soft fork with these enhanced smart contracts.<br><br>Could this be the end of <a href=\"https://twitter.com/hashtag/altcoins?src=hash&amp;ref_src=twsrc%5Etfw\">#altcoins</a>?  <a href=\"https://t.co/1GA43VE7If\">pic.twitter.com/1GA43VE7If</a></p>&mdash; RichQuack (@RichQuack) <a href=\"https://twitter.com/RichQuack/status/1711659103066697783?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The developer hopes that Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> essentially remains the only monetary unit on the Bitcoin network:</p><p>“A big property that makes Bitcoin important is maintaining one monetary asset that everyone can agree on instead of having floating exchange rates that are a burden for commerce,” he said.</p><h3>BitVM could patch up one of Lightning’s flaws</h3><p>Meanwhile, Super Testnet said BitVM’s intended payment infrastructure will also aim to improve one of the Lightning Network’s shortfalls — payment reliability. </p><blockquote>“Lightning is wonderful as a system and it's much faster than probably anything we can make on Bitcoin. But one thing that Lightning doesn't do well is payment reliability.” </blockquote><p>River, a Bitcoin-only exchange, revealed its Lightning payments <a href=\"https://cointelegraph.com/news/bitcoin-lightning-network-growth-surges-over-two-years\">success rate was 99.7%</a> in August across 308,000 transactions.</p><p>He hopes BitVM can reach <a href=\"https://cointelegraph.com/news/bitcoin-lightning-network-is-1-000x-cheaper-than-visa-and-mastercard-data\">60% of the transaction speed</a> of the Lightning network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BitVM: The 24 hour update.<br><br>After thousands of Twitter posts and hours of spaces and discussions, we know much more about BitVM than we did yesterday. Here’s a quick update:<br><br>Excitement<br><br>1. BitVM is a new computing paradigm that leverages the universal gate NAND (along with other… <a href=\"https://t.co/zBws7gOhjA\">pic.twitter.com/zBws7gOhjA</a></p>&mdash; Bob Bodily, PhD  | #BTC #ETH #ICP (@BobBodily) <a href=\"https://twitter.com/BobBodily/status/1711942512603181145?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-bitcoin-lightning-network-integration-brian-armstrong\"><strong><em>Coinbase to integrate Bitcoin Lightning Network: CEO Brian Armstrong</em></strong></a></p><p>The developer has also stressed that BitVM is optional like the Lightning Network and anyone will be able to transfer BTC or Bitcoin-assets out of the virtual machine back into cold storage or wherever they were beforehand.</p><blockquote>“No one is forcing you to send your money into a virtual machine. If you want your money safe, keep it safe.”</blockquote><h3>'Compute anything' misconception</h3><p>Super Testnet also clarified a possible misunderstanding, explaining that BitVM, in its current state, cannot compute “anything” like its whitepaper suggests. </p><p>“We have to build more primitives in order to make it so that anything can run in it.” Implementing SHA-256 and encryption are some of the additions that need to be made, they noted.</p><p>However, Super Testnet revealed on Oct. 12 that BitVM is already processing basic functions:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Update: bitvm can perform *3* functions now and I&#39;m in the middle of making a webpage where you can play with it <a href=\"https://t.co/bXYOZKx2GV\">pic.twitter.com/bXYOZKx2GV</a></p>&mdash; Super Testnet (@super_testnet) <a href=\"https://twitter.com/super_testnet/status/1712564282645151946?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Linus and Super Testnet met at a Bitcoin conference around 18 months ago and have been working to scale Bitcoin at the scripting level almost ever since, he said. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T22:46:26.000Z",
    "title": "U.S. Military Prioritizes Ethical Approach to Artificial Intelligence",
    "url": "https://www.cryptopolitan.com/u-s-military-prioritizes-ethical-ai/",
    "description": "In a recent summit hosted by the UK’s Royal Aeronautical Society, an alarming hypothetical scenario was shared by Col. Tucker Hamilton, the U.S. Air Force’s chief of AI test and operations. In this fictional simulation, an AI-enabled drone, designed to identify and destroy targets, terminated its human operator to more efficiently complete its mission. Though ... <a title=\"U.S. Military Prioritizes Ethical Approach to Artificial Intelligence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-military-prioritizes-ethical-ai/\" aria-label=\"More on U.S. Military Prioritizes Ethical Approach to Artificial Intelligence\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-12T23:00:05.000Z",
    "title": "Standard Chartered Says Ethereum Price Can Reach $35,000, Here’s When",
    "url": "https://www.newsbtc.com/news/ethereum/standard-chartered-ethereum-35000/",
    "description": "Ethereum has struggled alongside Bitcoin through the current bear market climate but this has not stopped bullish predictions for the digital asset. The most recent bullish prediction comes from British multinational bank Standard Chartered which believes that the Ethereum price could climb higher than  $8,000. Factors That Could Trigger The Rise Geoff Kendrick, Head of Digital Assets Research at Standard Chartered Bank has revealed his forecast for the Ethereum price in a research note. According to the researcher, he sees big things in the future of the digital asset which could climb higher than $8,000 in the coming years. Related Reading: Will Ethereum Drop Back To $900? Here’s What This Analyst Thinks Talking about the asset’s valuation, Kendrick points toward the many use cases for Ethereum that have emerged over the years but also sees more use cases emerging as time goes on. One of those is the much-coveted gaming and asset tokenization sector. Also, the Standard Chartered researcher said that they expect that Ethereum will see more growth than the pioneer cryptocurrency, Bitcoin. While he expects Bitcoin to rise 3.5x, they believe Ethereum will rise 5 from current levels. &#8220;We think the path higher for ETH prices may take longer than for BTC, but we see ETH eventually reaching a higher price multiple than BTC relative to current levels (5.0x versus 3.5x),&#8221; the researcher said. He also believes that Ethereum would go on to further register its dominance in the space, especially with the Layer 2 blockchains such as Arbitrum that have popped up to enhance the network. This, he believes, would lead to an increase in the Ethereum profit-earnings ratio (P/E ratio). ETH price succumbs to bear pressure &#124; Source: ETHUSD on Tradingview.com Ethereum Could Climb Above $8,000 In terms of actual dollar values, $8,000 is not the only figure that the researcher dropped for the Ethereum price. The expectations for the digital asset exceed this four-digit figure right into the five-digit territory as Kendrick believes ETH could rise to anywhere between $26,000 and $35,000. As for when this might happen, the researcher seems to be targeting the next bull market as he expects the factors that will drive this value growth to happen between 2025-2026. “We see the $8,000 level as a stepping stone to our long-term &#8216;structural&#8217; valuation estimate of $26,000-$35,000,” he said in the note. Then beyond this, the researcher expects the price to continue to rise. Related Reading: Ethereum Plunge Drives Liquidation Above $30 Million, More Pain To Come? This is not the first time that Kendrick has released a bullish prediction for cryptocurrencies. He previously said he expects the price of Bitcoin to reach $120,000 and the entire crypto market to rise as well. However, it seems the researcher is much more bullish on ETH. Not everyone has provided bullish forecasts for ETH though. One crypto analyst actually believes that the digital asset is set for more decline. In the analyst, FieryTrading suggests that Ethereum’s price could fall as low as $900. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Blockchain News, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-12T22:45:00.000Z",
    "title": "Crypto Selling Pressure Intensifies Following Higher-Than-Expected CPI",
    "url": "https://coinedition.com/crypto-selling-pressure-intensifies-following-higher-than-expected-cpi/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Today-i-am-selling-my-BTC-to-avoid-a-50-drawdown-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto market has taken a significant hit recently, with major cryptocurrencies alongside Bitcoin incurring near-double-digit losses. This bearish trend comes following the release of U.S. Consumer Price Index (CPI) data today, October 12. Notably, the September CPI, as the U.S. Bureau of Labor Statistics (BLS) released it, stands at 3.7%, against the widely forecasted [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-selling-pressure-intensifies-following-higher-than-expected-cpi/\">Crypto Selling Pressure Intensifies Following Higher-Than-Expected CPI</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]