[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T03:30:19.000Z",
    "title": "US District Judge Rejects Approach in SEC v Ripple Ruling on XRP",
    "url": "https://news.bitcoin.com/us-district-judge-rejects-approach-in-sec-v-ripple-ruling-on-xrp/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US District Judge Rejects Approach in SEC v Ripple Ruling Over XRP\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/judge-rejects-ripple-case-approach.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A senior U.S. district judge has rejected the approach taken in the Securities and Exchange Commission (SEC) v. Ripple ruling regarding XRP. &#x201C;The court declines to draw a distinction between these coins based on their manner of sale,&#x201D; explained the district judge presiding over the SEC v. Terraform Labs case. Judge Rakoff Rejects Approach in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T03:14:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T03:30:56.000Z",
    "title": "FTT Token Surges 17% After FTX Confirms Rumors Of Relaunch",
    "url": "https://www.newsbtc.com/ftx/ftt-token-surges-17-after-ftx-confirms-rumors-of-relaunch/",
    "description": "Bankrupt crypto exchange FTX has submitted a proposal that may result in the relaunch of its international arm FTX.com. On August 1, the company’s bankruptcy administrators confirmed rumors of a relaunch by filing a draft plan of reorganization in which it proposes the kick-off of a “rebooted” offshore exchange exclusive to non-U.S. users only. Related Reading: FTT Flies 45% On Rumors Of FTX Planned Relaunch FTT Gains By 17% Amidst Plans To Terminate Claims FTT, native token of the FTX exchange, recorded a significant boost in its price on the emergence of the exchange’s proposal to relaunch in the international market.  According to data by CoinMarketCap, FTT rose by 17% on Tuesday, moving from $1.34 to $1.59. Thereafter, the token experienced a decline, falling as low as $1.42, but has been climbing back up since then. Interestingly, FTT’s gain today has occurred amidst the exchange’s plans in relation to its native token. According to the draft plan of reorganization, FTX stated intentions to cancel all FTT claims as a result of their “equity-like characteristics.&#8221;  The statement read:   ….claims by holders of FTT (whether or not held on any FTX exchange), preferred stock, and equity investors in the Debtors and related claims. All these claims and interests will be canceled and extinguished as of the Effective Date, and holders will not receive any distribution. At the time of writing, FTT is trading at $1.45, having gone up by 7.39% in the last day. Meanwhile, the token’s daily trading volume is up by 378.65% and is now valued at $43.8 million. FTT trading at $1.43 on the daily chart &#124; Source: FTTUSDT chart on Tradingview.com Related Reading: Ethereum DeFi Coins Plunge As Curve Concerns Threaten Major Market Crash FTX.com To Relaunch As Exchange Plans Settlement For Foreign Customers As part of its reorganization plan, FTX is implementing a categorization system for claimants. Those who use FTX.com exchange will be referred to as Dotcom customers, while FTX U.S. customers will be placed in the U.S. Customer Pool. This approach is aim at helping FTX better organize its customer data and provide more efficient service to its valued clients. In regards to the settlement of Dotcom creditors, FTX proposes that debtors may partner with third-party investors to set up a new exchange that will operate as an offshore platform. Alternatively, this exchange can also be formed as a merger or “similar transaction.”  Thereafter, the debtors may then choose to grant the Dotcom customer pool some share of the company instead of conducting a full cash settlement. A statement from the draft read: Rather than all cash, the Debtors may determine that the Offshore Exchange Company remit non-cash consideration to the Dotcom Customer Pool in the form of equity securities, tokens, or other interests in the Offshore Exchange Company or rights to invest in such equity securities tokens or other interests (“Take-Back Interests”).  Talks concerning an FTX.com relaunch began as early as January, with the company CEO, John J. Ray III, stating he had authorized a team to explore that possibility. In June, WSJ reported that the company had begun discussions with potential investors in a bid to meet the goal. Featured image from PRNewswire, chart from Tradingview.com"
  }
]