[
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T16:16:45.000Z",
    "title": "If Worldcoin can improve the world, why not give it a chance?",
    "url": "https://cointelegraph.com/news/worldcoin-improve-world-why-not-give-chance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/940a4dc6-f03e-4930-83fa-4c3f7fb7c29f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Worldcoin could make it easier to create digital identities for people worldwide. And even if it fails, more projects like it are coming.</p>\n                    <p><p>All eyes have been on Worldcoin (<a href=\"https://cointelegraph.com/worldcoin-wld-price-index\">WLD</a>) since the July 24 launch of its “World ID” system. The issues associated with the launch have been well reported at this juncture. They include possible <a href=\"https://cointelegraph.com/news/worldcoin-orb-had-serious-security-vulnerability-in-operator-onboarding-certik\">onboarding security risks</a> along with Worldcoin’s use of biometric data, which is now under investigation by governments in several countries — including the United Kingdom, <a href=\"https://cointelegraph.com/news/french-privacy-watchdog-questions-worldcoin-s-data-collection-method-report\">France</a> and <a href=\"https://cointelegraph.com/news/argentine-agency-investigation-worldcoin-biometric-data\">Argentina</a>.</p><p>In the tech industry, where many of the most significant innovations of the past few decades have occurred, there is often a tension between the drive to innovate and the need to consider ethical implications. As technologies like machine learning, facial recognition and big data analytics become more advanced, the ethical stakes also rise.</p><p>In some cases, criticism from external analysts, journalists or ethicists can actually lead to positive outcomes by encouraging companies to consider ethical implications and perhaps even alter their business practices. In other cases, it can create a backlash that stymies innovation or leads to increased regulation. Either way, ethical and social concerns are a significant aspect of the landscape that innovators must navigate, and these concerns are often magnified when the innovations touch on sensitive areas like privacy, autonomy and social justice.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-controversy-explained-in-latest-cointelegraph-report\"><strong><em>Worldcoin controversy explained in latest Cointelegraph Report</em></strong></a></p><p>So, while innovators often face criticism on multiple fronts — whether it’s questioning the feasibility of their ideas, their potential to disrupt markets or the ethical implications of their work — their relationship with external observers is complex and multifaceted. Criticism can be both a hurdle and a constructive force, depending on the situation.</p><p>Rather than argue the merits of Worldcoin specifically, I would argue that we risk severely delaying technological advancement if we criticize it to death instead of criticizing it to improve.</p><p>Worldcoin wants to solve the digital identity issue, and its approach to doing so is bypassing governments. A solution to interoperable, accessible digital identity means you do not have to worry if you lose your identity documents, or if you are no longer able to access them because of changes within your home country.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/0995ee3f-b91c-40ba-af66-20527e5c0106.jpg\"  /><figcaption style=\"text-align: center;\"><em>Four major components of Worldcoin</em></figcaption></figure><p>Having worked with the United Nations in the past on solutions for distributed digital identity, I know that a well-designed system could fight corruption, resist identity replication, reduce fraud, and protect citizens against censorship. This is especially helpful for people who receive support from supranational organizations. A digital identity that can never expire, and can be accessed and read all over the world, is not just convenient. It can be life-saving.</p><p>It is easy enough to make the argument for this system on the fact that while a single government may do identity well, there is no seamless system worldwide for identity. Further, no significant progress has been made by any consortium of governments to use technology to address this issue. Worldcoin saw an opportunity to address this issue privately — and now it is paying the price of being the first mover.</p><p>This evokes a memory of another Web3 first mover. Libra was a similarly ambitious project that sought to solve market failures with a private-sector solution. In this case, Libra attempted to provide stable money, which is, by most definitions, a public service. In doing so, it would have bypassed central banks. </p><p>One of the reasons we don’t have this system working today is because Libra was disbanded after severe scrutiny. Some of its failings could have stemmed from being tied to a well-known founder who has not safeguarded our data or best interests well — Mark Zuckerberg. With the benefit of hindsight, we can say for sure that the minds working on the project were not Zuckerberg. And while stymied at Libra, they have attempted to solve this in different ways at other companies — from Circle (which has another stablecoin) to Lightspark (which facilitates Lightning payments).</p><p>Progress has not necessarily been lost, but it has been changed. We are not where we could be — in a world with more stable and accessible payment rails for everyone. Further to that, in the intervening years, there were significant and damaging attacks on the merits of the Libra project. These attacks still affect stablecoins today.</p><p>So, in response to such an onslaught of criticism, somebody may want Worldcoin to go the route of Libra. It may fail not simply because of missteps by the founders. This is a reasonable reason to fail, and it is the journey of entrepreneurship. No, I fear it may fail because it is attempting to build something we have no paradigm for, and that creates a breeding ground for “punching down” on the entire technology stack that <a href=\"https://cointelegraph.com/news/are-we-underestimating-the-power-of-digital-identity\">digital identity</a> will require (and that we will all require if we want secure digital identity in our lifetimes).</p><p>To pause my pessimistic view for a moment: I am sure that even if Worldcoin fails, progress will be made on digital identity. But the fear and suspicion will not fade quickly, which could seriously impact the uptake by the communities that need digital identity the most.</p><p>Yes, there’s a trend of private sector technologies trying to replace public services. Depending on how effectively your government works for you, you will have different opinions on the merits of this choice. But we should remember that the private sector can be better at problem-solving, especially when it comes to efficiently applying new technologies at speed.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-world-could-be-facing-a-dark-future-thanks-to-cbdcs\"><strong><em>The world could be facing a dark future thanks to CBDCs</em></strong></a></p><p>No, a private company should not have the last word on identity — but if it has already invested in the infrastructure and technology, should we not build on its efforts? It has achieved groundbreaking innovation in the area of ID management and storage and processing. If it is open to creating a more polished “open innovation model,” we could use this work as a way to improve several global systems. One that comes to mind is global voting. Governance still remains firmly localized, for example, even as we face global challenges like climate change.</p><p>Changing a core system — such as voting — would require a mindset change entirely in how we view, use and trust our systems. But many of us started this journey when we discovered blockchain. In 2009, we wondered how our society would change in a post-centralized world. How can we trust a system that isn’t controlled by just us, our governments or one company? Now, we face the same question. How is our society going to change in a post-proof world? How do we operate in a system where we can be sure proof exists but that we won’t ever see or know it ourselves?</p><p>This is the discussion we need to be having about Worldcoin — less about the company, less about the founders and far more about the system it (or someone else) will build. Because Worldcoin is not the last ambitious project that seeks to solve the fragmented systems we operate in — others will follow it. And we should pose the same questions to them: How are you safeguarding privacy? How are you incentivizing users without taking advantage of their economic situation? What is your governance mechanism? How robust is it? Why should we choose you, and how does your business model benefit if we do? What impact will you have on our world, positively or negatively, and what partners, advisers, overseers and auditors should be in place to help mitigate it?</p><p>We should soon pose these questions to Worldcoin with an eye toward a future where it, or someone else, will successfully implement this system. </p><p>In closing, it is easy to attack Worldcoin, but we should all remain mindful that some authorities, especially those with a vested interest in not providing digital identity to their citizens, will feel threatened by the borderlessness of this initiative. Not everyone criticizing Worldcoin is doing so for the sake of improving it. I challenge us to think bigger. If this system, and a post-proof world, is to be built, let us build it better now.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Paolo Tasca</strong> is a professor and economist. He founded two blockchain organizations, the University College London Centre for Blockchain Technologies and the Distributed Ledger Technology Science Foundation. He advises several organizations, including Ripple, INATBA and the International Organization for Standardization, among others. He has also consulted and worked with the United Nations, the European Parliament, the Cleveland Fed, the European Central Bank, the central banks of Italy, Chile, Brazil, Colombia and Canada, and Nexo. He previously served as the lead economist for digital currencies and P2P financial systems at the German central bank (Deutsche Bundesbank).</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-31T16:17:48.000Z",
    "title": "Mastercard Partners with Nexo for Simplified Cryptocurrency Transactions",
    "url": "https://cryptobriefing.com/mastercard-partners-with-nexo/?utm_source=feed&utm_medium=rss",
    "description": "In partnership with Mastercard and DiPocket, Nexo enhances its card offerings by introducing a Dual Mode feature."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T16:20:18.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T16:11:54.000Z",
    "title": "Lufthansa airline’s mind-blowing NFT loyalty program",
    "url": "https://www.cryptopolitan.com/lufthansa-airlines-nft-loyalty-program/",
    "description": "Lufthansa, a prominent European airline group, has taken a bold step into the world of blockchain technology by introducing a nonfungible token (NFT) loyalty program on the Polygon Network. Through this innovative initiative, Lufthansa aims to transform ordinary travel experiences into a realm of digital rewards and opportunities. The initiative was revealed on August 31st ... <a title=\"Lufthansa airline&#8217;s mind-blowing NFT loyalty program\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lufthansa-airlines-nft-loyalty-program/\" aria-label=\"More on Lufthansa airline&#8217;s mind-blowing NFT loyalty program\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T16:17:52.000Z",
    "title": "Worldcoin Achieves New Record: 9.5K Argentinians Verify World IDs in a Single Day",
    "url": "https://www.crypto-news-flash.com/worldcoin-achieves-new-record-9-5k-argentinians-verify-world-ids-in-a-single-day/",
    "description": "<img width=\"1280\" height=\"849\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/people-431943_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/people-431943_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/people-431943_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/people-431943_1280-1024x679.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/people-431943_1280-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/people-431943_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Worldcoin has hit a record sign-ups in a single day in Argentina. Despite tough regulatory hurdles, the project is still making waves across the board. Worldcoin, the blockchain-backed biometrics project from OpenAI co-founder Sam Altman, is making impressive progress in terms of new signups in the crypto-forward Latin American nation of Argentina. According to a [...]"
  }
]