[
  {
    "source": "CryptoSlate",
    "date": "2023-09-15T07:58:17.000Z",
    "title": "F2Pool returns 19 BTC to Paxos after overpayment of over $500k",
    "url": "https://cryptoslate.com/f2pool-returns-19-btc-to-paxos-after-overpayment-of-over-500k/",
    "description": "<p>A recent erroneous Bitcoin transaction that led to an inflated transaction fee of $510,000, nearly 480,000 times the average network fee of $2.176, traced back to Paxos, has been returned. The company acknowledged its mistake, attributing the inflated fee to a bug in a single transfer that has now been rectified by F2Pool, the miner [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/f2pool-returns-19-btc-to-paxos-after-overpayment-of-over-500k/\">F2Pool returns 19 BTC to Paxos after overpayment of over $500k</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-15T08:01:21.000Z",
    "title": "HK Lawmaker Johnny NG Responds To Buterin On Crypto Regulation",
    "url": "https://cryptodaily.co.uk/2023/09/hk-lawmaker-johnny-ng-responds-to-buterin-on-crypto-regulation",
    "description": "The Ethereum founder had expressed considerable reservations and urged caution for crypto businesses considering Hong Kong as a base for their crypto operations."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T08:05:35.000Z",
    "title": "South Korean Bitcoin lender Delio to sue financial regulators",
    "url": "https://www.cryptopolitan.com/south-korean-bitcoin-lender-delio-to-sue-financial-regulators/",
    "description": "South Korean Bitcoin lender Delio is gearing up to file an administrative lawsuit against the country&#8217;s Financial Service Committee (FSC).  The firm contends that the FSC&#8217;s allegations of fraud and embezzlement are unfounded and stem from a flawed interpretation of existing laws. Delio argues that the regulatory body has acted unreasonably. The Financial Intelligence Unit ... <a title=\"South Korean Bitcoin lender Delio to sue financial regulators\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korean-bitcoin-lender-delio-to-sue-financial-regulators/\" aria-label=\"More on South Korean Bitcoin lender Delio to sue financial regulators\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T07:42:24.000Z",
    "title": "IBM’s Top Online Courses on edX to Unlock Knowledge for Free",
    "url": "https://www.cryptopolitan.com/ibms-top-online-courses-on-edx/",
    "description": "In a world where technology is rapidly evolving, staying updated with the latest skills is more crucial than ever. IBM, a global leader in technology and consulting, is offering a range of free courses to help professionals and students alike.The IBM offers 15 courses you can take for free, offering a valuable resource for those ... <a title=\"IBM&#8217;s Top Online Courses on edX to Unlock Knowledge for Free\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ibms-top-online-courses-on-edx/\" aria-label=\"More on IBM&#8217;s Top Online Courses on edX to Unlock Knowledge for Free\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T07:55:53.000Z",
    "title": "Is Bitcoin Forming A Double Bottom? Here’s What Needs To Happen",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-double-bottom-what-needs-to-happen/",
    "description": "In recent days, Bitcoin has shown signs of a potential reversal, with the cryptocurrency charting three consecutive green daily candles. The last time such a pattern was observed was early July and between mid and late June, when Bitcoin rallied from just under $25,000 to over $31,000. This shift in price dynamics has led to a change in market sentiment, with the bearish outlook slowly giving way to a more bullish perspective. While Bitcoin has successfully averted the confirmation of a double top on the 1-week chart fo the moment, this price action has fueled discussions among analysts about the possibility of Bitcoin forming a double bottom pattern, a significant technical indicator. Bitcoin Double Bottom In The Making? A double bottom is a classic technical analysis pattern that signifies a potential trend reversal from bearish to bullish in markets. It is characterized by two distinct troughs or lows in the price chart, separated by a peak or a minor high in between. The pattern resembles the letter &#8220;W,&#8221; with the first trough indicating a significant low, followed by a temporary rebound, and then a second trough, usually near the same price level as the first. A valid double bottom is confirmed when the price breaks above the peak or resistance level between the two troughs, signaling a potential upward trend reversal. Rekt Capital, a renowned crypto analyst, recently shared his insights suggesting that Bitcoin&#8217;s current price pattern in the weekly chart resembles a double top, which typically indicates a bearish reversal. This pattern is characterized by an &#8216;M&#8217; shape. However, for this to be confirmed, the price would need to break down from the $26,000 support. At press time, Bitcoin was trading at $26,618, successfully fending off the double top validation at the moment. Related Reading: Bitcoin Surges To $26,700, But Will This Rise Last? On the flip side, a double bottom, which forms a &#8216;W&#8217; shape, would require Bitcoin to rebound from the $26,000 mark and tweeted today, &#8220;Could this BTC Double Top actually be a Double Bottom? And the simple answer is &#8211; technically, yes. [&#8230;] But for BTC to form a Double Bottom, it would need to rebound from $26k and rally to $30.6k (which is its validation point).&#8221; He further highlighted the challenges Bitcoin faces, noting the uncertainty surrounding the $26k support level and the numerous confluent resistances ahead, which might hinder the completion of the double bottom formation. Rekt Capital  elaborated on the significance of the $26,000 level, tweeting, &#8220;It looks like BTC may be choosing the &#8216;relief rally&#8217; route first in an effort to potentially turn old support into new resistance. The black Monthly level (~$27,200) is approximately confluent with the Bull Market support band as well.&#8221; He also pointed to Bitcoin&#8217;s recent bearish monthly candle close for August, emphasizing that Bitcoin closed below approximately $27,150, thereby confirming it as a lost support. Therefore he warns that the current price move by Bitcoin could only be a relief rally to confirm $27,150 as new resistance before dropping into the $23,000 region. Related Reading: Bitcoin Unprecedented Liquidity And Rate Reversal: A Perfect Storm For Market Correction? &#8220;It&#8217;s possible BTC could rebound into ~$27,150, maybe even upside wick beyond it this September. [&#8230;] $23,000 is the next major Monthly support now that ~$27150 has been lost,&#8221; he remarked. More Resistance Levels For BTC Price So it&#8217;s clear that BTC has a major resistance level of $27,150 to break before the bulls can even dream of confirming a double bottom pattern. But there are also other key resistances to overcome before $30,600 can be breached and the double bottom confirmed. On-chain analysis firm CryptoQuant emphasized the role of short-term Bitcoin holders, who often provide the liquidity for significant price movements. According to their data, the break-even price for these holders lies between $27,500 and $29,000. If Bitcoin remains below these levels for an extended period, these holders might be incentivized to sell, potentially exerting downward pressure on the price: The more time we spend below these price levels, the more incentive there will be to exit liquidity from the market, and the basis condition for the return of the upward trend of Bitcoin depends on the price jump above the short-term realized prices. On the 4-hour time frame, BTC needs to overcome three major resistances: $26,857 (38.2% Fibonacci retracement level), $27,365 (23.6% Fibonacci retracement level) and $28,186 (post-Grayscale high from August 29th). Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T08:00:04.000Z",
    "title": "Veteran VC Sees Bitcoin Soaring to $100,000 and InQubeta growing 8,500%",
    "url": "https://www.crypto-news-flash.com/veteran-vc-sees-bitcoin-soaring-to-100000-and-inqubeta-growing-8500/?utm_source=rss&utm_medium=rss&utm_campaign=veteran-vc-sees-bitcoin-soaring-to-100000-and-inqubeta-growing-8500",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-47.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-47.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-47-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The ever-evolving decentralized finance (DeFi) space continually witnesses shifts in the market dynamics of the best DeFi cryptos. One such crypto is Bitcoin ($BTC), predicted to soar to $100,000 by Standard Chartered, a leading veteran venture capital (VC) firm within the finance sector. Conversely, a new cryptocurrency, InQubeta ($QUBE), is capturing the attention of DeFi [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T07:40:04.000Z",
    "title": "Shibarium Rockets: Explosive Growth and BONE Staking Surge in Shiba Inu’s Layer-2 Blockchain – Is SHIB Price Poised for an Upswing to $0.0001?",
    "url": "https://www.crypto-news-flash.com/shibarium-rockets-explosive-growth-and-bone-staking-surge-in-shiba-inus-layer-2-blockchain-is-shib-price-poised-for-an-upswing-to-0-0001/?utm_source=rss&utm_medium=rss&utm_campaign=shibarium-rockets-explosive-growth-and-bone-staking-surge-in-shiba-inus-layer-2-blockchain-is-shib-price-poised-for-an-upswing-to-0-0001",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bone\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shibarium, Shiba Inu&#8217;s layer-2 scaling solution, records over 2.5 million transactions and 1.2 million unique wallet addresses. BONE Shibaswap tokens surge to over 27.1 million, reflecting growing user engagement. In the dynamic world of cryptocurrencies, Shiba Inu&#8217;s innovative layer-2 scaling solution, Shibarium, has emerged as a force to be reckoned with. The latest data from [...]"
  }
]