[
  {
    "source": "CoinDesk",
    "date": "2023-10-11T20:55:49.000Z",
    "title": "DeFi Protocol BarnBridge Prepares for SEC Action, Fines",
    "url": "https://www.coindesk.com/business/2023/10/11/defi-protocol-barnbridge-prepares-for-sec-action-fines/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The decentralized autonomous organization is holding a vote on how to respond to securities regulators."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-11T20:51:26.000Z",
    "title": "The Protocol: Bitcoin Might Get Ethereum-Style Smart Contracts Under ‘BitVM’ Plan",
    "url": "https://www.coindesk.com/tech/2023/10/11/the-protocol-bitcoin-might-get-ethereum-style-smart-contracts-under-bitvm-plan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ZeroSync's Robin Linus has ignited excitement in the Bitcoin community by introducing the \"BitVM\" paper, proposing a straightforward method for incorporating smart contracts into the original blockchain, a feature predominantly associated with Ethereum and its numerous derivatives."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-11T21:00:17.000Z",
    "title": "Caroline Ellison alleges auto-deletion of messages, bribery of foreign officials, and more in second day of testimony",
    "url": "https://cryptoslate.com/caroline-ellison-alleges-auto-deletion-of-messages-bribery-of-foreign-officials-and-more-in-second-day-of-testimony/",
    "description": "<p>Ex-Alameda Research CEO Caroline Ellison took the stand in a second day of testimony in Sam Bankman-Fried criminal trial on Oct. 11. Ellison testified that she communicated with Bankman-Fried and other company members through Signal, a messaging app with an auto-delete feature that Bankman-Fried instructed employees to use. She further testified that Bankman-Fried instructed her and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/caroline-ellison-alleges-auto-deletion-of-messages-bribery-of-foreign-officials-and-more-in-second-day-of-testimony/\">Caroline Ellison alleges auto-deletion of messages, bribery of foreign officials, and more in second day of testimony</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-11T20:42:35.000Z",
    "title": "SANDBOX GROUP Announces Move Into Web3 Through Partnership With XDB Chain",
    "url": "https://cryptodaily.co.uk/2023/10/sandbox-group-announces-move-into-web3-through-partnership-with-xdb-chain",
    "description": "SANDBOX GROUP Announces Move Into Web3 Through Partnership With XDB Chain"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-11T20:45:10.000Z",
    "title": "Wormhole Foundation, Borderless Capital and Outlier Ventures Launch  The Wormhole Base Camp Accelerator Program",
    "url": "https://cryptodaily.co.uk/2023/10/wormhole-foundation-borderless-capital-and-outlier-ventures-launch-the-wormhole-base-camp-accelerator-program",
    "description": "Today, Wormhole Foundation, the steward of the leading interoperability platform empowering development and growth across blockchains, and Outlier Ventures, the leading global Web3 accelerator, announced the launch of the Wormhole Base Camp accelerator program."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-11T20:49:27.000Z",
    "title": "CoinMarketCap provides a Personal Crypto Analyst for all with new ChatGPT Plugin",
    "url": "https://cryptodaily.co.uk/2023/10/coinmarketcap-provides-a-personal-crypto-analyst-for-all-with-new-chatgpt-plugin",
    "description": "CoinMarketCap is excited to announce the launch of the CoinMarketCap Plugin for ChatGPT, bringing together the world’s most trusted cryptocurrency data with the world’s most advanced AI chatbot."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T21:00:13.000Z",
    "title": "State Securities Regulators Support SEC in Lawsuit Against Crypto Exchange Coinbase",
    "url": "https://news.bitcoin.com/state-securities-regulators-support-sec-in-lawsuit-against-crypto-exchange-coinbase/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"State Securities Regulators Support SEC in Lawsuit Against Crypto Exchange Coinbase\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1167823897.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A group uniting regional securities regulators in North America has backed the U.S. Securities and Exchange Commission (SEC) in its Coinbase lawsuit. The move goes against arguments in favor of adopting dedicated rules for crypto assets in the United States as opposed to implementing existing regulations. Securities Regulators Association Throws Weight Behind SEC’s Position in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T21:00:29.000Z",
    "title": "Telegram And TON Foundation Collaborate With Alibaba Cloud In Quest For Fastest Blockchain",
    "url": "https://www.newsbtc.com/toncoin-ton/telegram-and-ton-foundation-collaborate-with-alibaba-cloud-in-quest-for-fastest-blockchain/",
    "description": "Telegram&#8217;s partner, the Open Network (TON) Foundation, in partnership with Alibaba Cloud, has announced plans to set up 256 servers for a performance testing event scheduled for October 31, 2023.  Per the announcement, the objective of this event is to officially establish the TON blockchain as the world&#8217;s fastest blockchain to earn accreditation from the Guinness World Records. TON’s  Upcoming Performance Test According to a report by Yahoo Finance, the TON blockchain has experienced significant growth since 2022, witnessing a 20-fold increase in addresses from 170,000 to 3.5 million.  Related Reading: Bulls Vs Bears: XRP Price Gears Up For Big Squeeze, Which Side Will Prevail? The network has also expanded its validator nodes to 350, fostering a more decentralized network across 25 nations. The blockchain has maintained a track record throughout this expansion, with no major network disruptions reported. Both parties view the upcoming performance test as a crucial step in showcasing the unique capabilities of the TON blockchain, which serves as a trusted infrastructure layer for the Web3 ecosystem within Telegram. Anatoly Makosov, the Core Development Lead at the TON Foundation, expressed anticipation for the performance testing event, highlighting the TON blockchain&#8217;s technical superiority, particularly regarding scalability.  Makosov emphasized that TON&#8217;s large-scale public performance testing is an exciting opportunity to witness significant results and validate the blockchain&#8217;s technical prowess. Makosov stated: We look forward to October 31, 2023, to confirm that the TON blockchain technically stands out among any other blockchain, especially in its ability to scale. This is the first large-scale public performance testing of TON &#8211; we&#8217;re just as excited as you are to see the results. MEXC Ventures Makes Major Investment In TON Blockchain MEXC Ventures, a subsidiary of MEXC&#8217;s global cryptocurrency exchange, has also announced a significant investment in The Open Network. According to Yahoo Finance, this investment is MEXC&#8217;s largest Layer-1 funding and is accompanied by a partnership with the TON Foundation.  Justin Hyun, Director of Growth at the TON Foundation, expressed enthusiasm about the partnership with MEXC, emphasizing their shared goal of offering global access to the decentralized Web3 ecosystem within Telegram.  Per the report, the foundation is committed to delivering a “user-centric experience” for the community. MEXC&#8217;s support “significantly strengthens” its ability to develop new tools and services seamlessly integrating crypto with social media. Steve Yun, President of the TON Foundation, highlighted MEXC&#8217;s belief in the TON blockchain&#8217;s potential for building a Web3 super-app ecosystem on Telegram. Yun expressed confidence in the TON ecosystem&#8217;s and MEXC&#8217;s mutual growth as they prepare for the next market cycle. Related Reading: Crypto Whales’ Big Bet: An Examination Of Their 3 New Altcoin Targets The collaboration between the Open Network Foundation, Alibaba Cloud, and MEXC Ventures underscores blockchain technology&#8217;s increasing recognition and adoption, particularly in the Web3 space.  These partnerships aim to enhance the functionality, scalability, and accessibility of the TON blockchain while promoting global adoption and innovation within the decentralized ecosystem. At the time of writing, the native token of the protocol, Toncoin, is trading at $2,006, reflecting a marginal decline of 0.2% over the past 24 hours. Nevertheless, the token has experienced substantial growth year to date, boasting an impressive increase of 59% during this timeframe. Featured image from Shutterstock, chart from TradingView.com "
  }
]