[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T21:07:37.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T20:55:56.000Z",
    "title": "Russian Government advises against cryptocurrencies as savings option",
    "url": "https://www.cryptopolitan.com/russian-government-advises-against-cryptocurrencies-as-savings-option/",
    "description": "Russian Ministry of Finance has cautioned citizens against using cryptocurrencies as savings. With the decline in interest for foreign fiat currencies due to imposed restrictions and Western sanctions, the official emphasized that high-risk assets like cryptocurrencies are unsuitable for most people&#8217;s savings and should primarily be considered by wealthier individuals. During the blockchain conference &#8220;Finance ... <a title=\"Russian Government advises against cryptocurrencies as savings option\" class=\"read-more\" href=\"https://www.cryptopolitan.com/russian-government-advises-against-cryptocurrencies-as-savings-option/\" aria-label=\"More on Russian Government advises against cryptocurrencies as savings option\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T20:45:43.000Z",
    "title": "Step-by-Step guide: How to stake SUI Tokens",
    "url": "https://www.cryptopolitan.com/step-by-step-guide-how-to-stake-sui-tokens/",
    "description": "The SUI tokens launch on Binance&#8217;s Launchpool has drawn much attention from the crypto world. Validators can vote on upgrades according to the Amount they have staked via SUI, which is used for network support and staking. The involvement of Justin Sun and the prospect of legal action have increased the interest in the growth ... <a title=\"Step-by-Step guide: How to stake SUI Tokens\" class=\"read-more\" href=\"https://www.cryptopolitan.com/step-by-step-guide-how-to-stake-sui-tokens/\" aria-label=\"More on Step-by-Step guide: How to stake SUI Tokens\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T21:00:29.000Z",
    "title": "Lido Centralization Risks On Ethereum Raises Concerns: Will LDO Crash?",
    "url": "https://www.newsbtc.com/news/defi/lido-centralization-risks-ethereum-concerns-ldo-crash/",
    "description": "Lido, the liquidity staking protocol that supports staking, is now under some of the Ethereum community members&#8217; crosshair. There are fears that the platform is centralizing Ethereum and could make the blockchain fragile. As of June 1, Lido is the largest decentralized finance protocol. DeFiLlama data shows that the platform manages $13.2 billion  in staked assets.  At this level, Lido has nearly twice the total value locked (TVL) as in MakerDAO, one of the original decentralized money markets in the sphere.  MakerDAO has $6.29 billion in TVL and only serves Ethereum. Lido Is Ethereum&#8217;s Weak Point? Concern from critics is not only about the dominance of Lido in terms of TVL but the number of validators using the protocol.  According to on-chain data, over 19 million Ethereum has been staked in the Beacon Chain, that is, the proof-of-stake network.  However, out of this amount, 6 million Ethereum has been staked through Lido. This translates to roughly 36% of all staked Ethereum passing through the liquidity staking protocol. Moreover, parallel data shows that 32% of all Ethereum validators use Lido infrastructure.  In Ethereum&#8217;s proof-of-stake system, validators are needed to verify transactions and secure the network against external attacks.  Related Reading: Litecoin Attempts To Revitalize The Crypto Market With Bullish Breakout The distribution of validators, who now don&#8217;t have to run energy-consuming and expensive rigs, is critical for decentralizing the Ethereum network.  Global distribution of Ethereum validators would translate to a robust platform where users and operators of protocols, presently managing over $26 billion of assets, don&#8217;t have to worry about a majority attack. It is this level of centralization that is emerging in Lido that some Ethereum community members are concerned could destabilize the network.  In the past, Prysm, a client operator, lost a significant portion of its market share when it was discovered that over 66% of all Ethereum proof-of-work nodes were using their software. Could this same intervention be require to suppress Lido&#8217;s expansion? According to the critics, the current community is lacking in educational material and initiative to address problems as they emerge. Thus far, with 32% of all validators using LidoDAO infrastructure, it is more than twice the limit Vitalik Buterin, the co-founder of Ethereum, had recommended for every entity wishing to host the network&#8217;s validators.  LDO Prices Could Drop With centralization questions emerging, LidoDAO could be forced to decentralized, even by breaking down into multiple entities. However, for LDO holders, any action to break up the protocol&#8217;s dominance could have a drastic effect on prices. Related Reading: The $24,000 BTC Bullseye: Is Bitcoin Headed For A Summer Swoon? As of June 1, LDO, the governance token of LDO, is one of the top performers. From December 2022 lows, LDO has rallied 125% to spot rates, as more ETH holders opted to stake through Lido Finance infrastructure to earn annual rewards from the Ethereum proof-of-stake network. Feature Image From Canva, Chart From TradingView"
  }
]