[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T22:45:51.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T23:00:10.000Z",
    "title": "SHIB Burn Rate Jump 1,100% Amid Expectations Of Shibarium Relaunch",
    "url": "https://www.newsbtc.com/shib/shib-burn-rate-jump-1100-amid-expectations-of-shibarium-relaunch/",
    "description": "Off the back of the much-anticipated Shibarium launch, the SHIB burn rate has seen a tremendous rise. This surge in the burn rate comes despite the Layer 2 blockchain running into problems on the day of its launch last week, and still being in private mode. But while it could point to renewed vigor among the meme coin’s investors, something else seems to be driving this accelerated burn rate. SHIB Burn Rate Is Up 1,108% In One Day According to data from Shiba Inu burn tracking website Shibburn, there has been a remarkable increase in burn rate in the last 24 hours compared to the prior day. In total, there have been over 1.046 billion tokens burned, which translates to a 1,108.78% increase during this timeframe. Related Reading: AVAX Price Bucks Under The Pressure Of Upcoming $102 Million Token Unlock This is in stark contrast to the previous day’s figures which came out at around 100 million tokens burned. However, while the jump in burn rate is interesting, the address doing most of the SHIB burn is even more interesting. Looking at the burn addresses posted by Shibburn, one address keeps popping up and that is the 0x4be2 address. A quick look on-chain revealed that this address is actually the contract address for the MARSWAP (MSWAP) token. Burn rate up over 1,100% &#124; Source: Shibburn This token seems to dedicate a portion of fees generated from transactions toward SHIB burn and as it gains popularity, the number of SHIB tokens being burned has jumped. So far, Marswap accounts for about 40% of burnt tokens. But a single address, 0xcf6d, which is the ShibaSwap LP Token (SSLP) contract address, burned 418,719,732 tokens in what has been the single largest burn event in the last day. Token price remains highly volatile &#124; Source: SHIBUSD on Tradingview.com How Is The Token Price Responding? Despite the marked increase in the SHIB burn rate, the price of the meme coin has not responded as positively as expected. The token price seems to be keeping in line with the general crypto market sentiment and continues to trade in the red. Related Reading: Bitcoin Liquidations Top $500 Million Amid $1 Billion Crypto Decimation Although there has been a small shift in the last hour at the time of this writing, with SHIB’s price moving up a meager 0.16%, its price is still taking losses of 1.48% on the daily chart. Even more concerning is its significant loss of 21.94% on the weekly chart. Given this trend, it is unlikely that SHIB will make a break from the market and rally. Rather, a recovery from here will follow a Bitcoin rise. However, one event that could trigger a recovery is the Shibarium relaunch. According to lead developer Shytoshi Kusama, the layer 2 network could be gearing up for a relaunch in the coming days. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Analytics Insight, chart from TradingView.com"
  }
]