[
  {
    "source": "CryptoSlate",
    "date": "2024-03-19T15:00:30.000Z",
    "title": "Grayscale hints at lower fees for its Bitcoin ETF as market matures",
    "url": "https://cryptoslate.com/grayscale-hints-at-lower-fees-for-its-bitcoin-etf-as-market-matures/",
    "description": "<p>Grayscale Bitcoin exchange-traded fund (GBTC) fees will gradually decrease as the market evolves, according to CEO Michael Sonnenshein. In a March 19 CNBC report, Sonnenshein pointed out that the fee reductions would align with market maturity, saying: &#8220;We have seen this in countless other exposures, countless other markets, you name it, where typically when products [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscale-hints-at-lower-fees-for-its-bitcoin-etf-as-market-matures/\">Grayscale hints at lower fees for its Bitcoin ETF as market matures</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T15:00:10.000Z",
    "title": "53% of Game Devs Fear AI Copyright Theft, Not Job Loss",
    "url": "https://www.cryptopolitan.com/game-devs-fear-ai-copyright-theft-job-loss/",
    "description": "Despite the incessant headlines of AI threats, most game developers appear rather unfazed by the rise of the technology in the gaming industry.&#160; Most Game Developers Are Unfazed About AI New survey findings by W4 Games showed that 44% of developers are concerned about the rise of AI in game development. However, the majority (55%) [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T14:46:28.000Z",
    "title": "SEC to seek additional $158m for ‘wild west of crypto markets’",
    "url": "https://crypto.news/sec-wild-west-crypto-markets/",
    "description": "In March 2024, the U.S. SEC asked Congress to appropriate an additional $158 million in federal funds. "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T14:41:06.000Z",
    "title": "Post-Binance life: Changpeng Zhao is turning to education with a new project",
    "url": "https://crypto.news/post-binance-life-changpeng-zhao-is-turning-to-education-with-a-new-project/",
    "description": "Amid legal hurdles, CZ unveiled Giggle Academy, a free educational project for grades 1 through 12. On Mar. 19, Changpeng Zhao, known in the crypto community as &#8220;CZ,&#8221; announced a new project called &#8220;Giggle Academy&#8221; on Twitter. Within hours of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T15:00:09.000Z",
    "title": "Dogecoin Growth Hits Roadblock As Holder Activity Enters Dreaded Period Of Stagnancy",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-growth-holder-activity/",
    "description": "The Dogecoin (DOGE) network has entered a period of stagnancy, as the number of addresses holding the meme coin has slowed. This is a stark contrast to February and January, when the network experienced a significant expansion.  Dogecoin Has Added Only 60,000 New Addresses In March Data from the market intelligence platform Santiment shows that the total number of DOGE holders has increased by only 60,000 since the beginning of this month. At the start of the month, 6.51 million users were holding the meme coin, with this figure only increasing to 6.57 million since then. Related Reading: Bitcoin Whales Enter Full Accumulation Mode: Here’s How Much BTC They Pulled From Exchanges This is unlike February when the total number of DOGE holders rose from 5.92 million to 6.51 million. Specifically, around this same time last month, the network had already seen an increase of 450,000 in the total number of addresses holding DOGE. Meanwhile, NewsBTC reported that over 400,000 new addresses were added in two weeks between January and February.  Dogecoin also set a new record in January alone when 247,240 new DOGE addresses were created on January 29. Crypto analyst Ali Martinez noted that a sustained uptrend in the network’s expansion “could soon reflect positively” on DOGE’s price. That underscores how significant the number of addresses holding the meme coin is.  The stagnancy in Dogecoin’s holder activity might also come as a surprise to some in the crypto community, considering the meme coin frenzy that has taken the crypto space by storm. However, a plausible explanation is that meme coin traders aren’t necessarily invested in the prominent meme tokens but have their eyes on the undervalued gems.  How Other Top Meme Coins Have Fared Data from Santiment also shows that the other two meme coins, Shiba Inu (SHIB) and Pepe (PEPE), which make up the top three largest meme coins by market cap, haven’t fared better. Shiba Inu hasn’t seen its holder count increase since the beginning of the month, with the total number of users holding the meme coin still at 1.38 million.  Related Reading: Is Ripple Behind The XRP Price Crash? Massive Selling Spree Sparks Concern On the other hand, PEPE still has less than 200,000 holders despite boasting a year-to-date (YTD) gain of over 370%. These figures place DOGE firmly ahead of SHIB and PEPE in terms of the number of users they all have. Dogecoin is expected to see its user base pick up once again as soon as there is a renewed interest in network functionalities like the Doginals.  At the time of writing, DOGE is trading at around $0.12, down almost 14% in the last 24 hours, according to data from CoinMarketCap.  DOGE price at $0.12 &#124; Source: DOGEUSDT on Tradingview.com Featured image from Vietnam Insider, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T15:00:26.000Z",
    "title": "Polygon News: Matic Drops 13.54%, Holders Unsatisfied with Performance Begin Hedging Towards 1000x A.I Token",
    "url": "https://www.crypto-news-flash.com/polygon-news-matic-drops-13-54-holders-unsatisfied-with-performance-begin-hedging-towards-1000x-a-i-token/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-news-matic-drops-13-54-holders-unsatisfied-with-performance-begin-hedging-towards-1000x-a-i-token",
    "description": "<img width=\"1280\" height=\"717\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13-1200x672.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13-768x430.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-46-13-450x252.jpg 450w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The move towards Option2Trade (O2T) from Polygon (MATIC) underscores a crucial point in crypto investments: the search for stability in an inherently unstable market often leads investors to embrace newer technologies and platforms that promise not just returns, but a revolution in how those returns are generated. As the crypto landscape continues to evolve, the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T15:00:24.000Z",
    "title": "Dogecoin Price Falls As DOGE Investors Enter New Rival Meme Coin Set For 100x",
    "url": "https://www.crypto-news-flash.com/dogecoin-price-falls-as-doge-investors-enter-new-rival-meme-coin-set-for-100x/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-price-falls-as-doge-investors-enter-new-rival-meme-coin-set-for-100x",
    "description": "<img width=\"1200\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-57-32.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-57-32.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-57-32-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-57-32-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-57-32-150x113.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-19_15-57-32-450x338.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />In a surprising turn of events, the cryptocurrency market is witnessing a significant shift as Dogecoin&#8217;s (DOGE) price falls, with investors turning their attention to Shiba Budz (BUDZ), a new rival meme coin on the cusp of potentially delivering a 100x return. This shift is not merely a fluctuation but a signal of the changing [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-19T14:57:26.000Z",
    "title": "Ghostface Killah Embraces Bitcoin Ordinals for Music Release",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ghostface-killah-embraces-bitcoin-ordinals-for-music-release/",
    "description": "<p>Ghostface Killah announced on X his plan to release exclusive music as Bitcoin Ordinals. This aligns with cryptocurrency trends and offers new ways for artists and fans to engage with music decentraly. Ghostface Killah Bridges Music with Crypto via Ordinals Ghostface Killah&#8217;s initiative will see a total of 10,000 Ordinals being minted, with these digital [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ghostface-killah-embraces-bitcoin-ordinals-for-music-release/\">Ghostface Killah Embraces Bitcoin Ordinals for Music Release</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]