[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T12:26:27.000Z",
    "title": "Why is Dogecoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-dogecoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-04/3020589e-2d53-4d13-bc4a-e447b62f26a2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dogecoin price hits a two-month high amid speculations that Twitter’s rebrand to X would add a DOGE payment option.</p>\n                    <p><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) price is up today as traders speculate about its addition to <a href=\"https://cointelegraph.com/news/twitter-bluebird-elon-musk-rebrands-x\">Twitter’s rebranded social media platform</a> dubbed “X.”</p><h2>DOGE price hits May 2023 high</h2><p>On July 25, DOGE price climbed nearly 5.5% to $0.078, its highest level in two months. </p><p>The token’s intraday gains came as a part of a weekly rally that started two days ago when Elon Musk rebranded Twitter to X while <a href=\"https://cointelegraph.com/news/elon-musk-dogecoin-price-twitter-x-rebrand\">adding the DOGE symbol</a><a href=\"https://cointelegraph.com/news/elon-musk-dogecoin-price-twitter-x-rebrand\"></a> to his bio. </p><p>Since then, Dogecoin has jumped over 11%, akin to its previous bullish reactions to Musk’s pro-dogecoin statements.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9d041e34-f9d2-4cf8-b59a-8fda18335c31.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD daily price chart. Source: TradingView</em></figcaption></figure><p>On July 25, Musk revealed X as an “everything app,” with a special focus on financial services.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Twitter was acquired by X Corp both to ensure freedom of speech and as an accelerant for X, the everything app. This is not simply a company renaming itself, but doing the same thing.<br><br>The Twitter name made sense when it was just 140 character messages going back and forth – like…</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1683656350046232578?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p> That has prompted some analysts to believe that the billionaire entrepreneur would add a DOGE payment option on X — more than a year after flirting with the idea <a href=\"https://cointelegraph.com/news/bitcoin-hits-40k-investors-pump-dogecoin-doge-after-musk-confirms-twitter-purchase/amp\">during a social media interaction</a>.</p><p>“Just watch Elon Musk troll everyone by making DOGE the first crypto to be used on the X platform,” David Gokhshtein, the founder of Gokhshtein Media, <a href=\"https://twitter.com/davidgokhshtein/status/1683613714543419394\" target=\"_blank\" rel=\"noopener nofollow\">asserted</a>.</p><h2>DOGE bears liquidated</h2><p>The Dogecoin price rally has triggered more than $6 million worth of short liquidations since July 24, comprising around 60% of the total positions liquidated.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ae195474-2d74-49e0-a6df-785990475ff6.png\"  /><figcaption style=\"text-align: center;\"><em>Dogecoin total liquidations chart. Source: TradingView</em></figcaption></figure><p>Short sellers exit their positions with buy orders, thus pushing the prices higher. That further shows why the Dogecoin price rose on July 25. Nonetheless, DOGE's open interest-weighted funding rate has slipped into the negative territory, showing bears are paying bulls to keep their positions open.</p><p>That shows most derivative traders have turned bearish toward the Dogecoin market despite its ongoing price rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/756228ac-f6b6-468f-8903-0af218cdac44.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE OI-weighted funding rate. Source: Coinglass</em></figcaption></figure><h2>Dogecoin price analysis 2023</h2><p>From a technical standpoint, the DOGE price has entered the breakout stage of its <a href=\"https://cointelegraph.com/news/why-is-dogecoin-doge-price-down-today\">prevailing Bump-and-Run-Reversal (BARR) Bottom pattern</a>, with a price target of around $0.88, up around 15%, by September 2023. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2f00d6a4-3d8c-4653-829a-43c9eba9844e.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Conversely, a bearish scenario involves Dogecoin entering a short term correction as its daily relative strength index (RSI) nears 70, an \"overbought\" area, and its price tests $0.078 as resistance. The $0.078-level was instrumental in capping DOGE's upside attempts in March 2023.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/dogecoin-soared-23-000-in-2021-is-history-starting-to-repeat-for-doge-price\">Dogecoin soared 23,000% in 2021 — Is history starting to repeat for DOGE price?</a></em></strong></p><p>In this case, DOGE price's immediate downside target appears to be around $0.073 for July, coinciding with its 0.382 Fib line of the Fibonacci retracement graph.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T12:23:38.000Z",
    "title": "Short-term holders continue to capitulate",
    "url": "https://cryptoslate.com/insights/short-term-holders-continue-to-capitulate/",
    "description": "<p>Quick Take In the world of Bitcoin, recent trends have shown that short-term holders continue to capitulate, even as Bitcoin trades briefly just below $29,000. This trend has led to over 20,000 coins being sold at a loss, marking one of the highest levels of capitulation this year from short-term holders. Just five days ago, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/short-term-holders-continue-to-capitulate/\">Short-term holders continue to capitulate</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T12:30:00.000Z",
    "title": "Russia Is about to Launch its CBDC, President Putin Signs New Law",
    "url": "https://cryptodaily.co.uk/2023/07/russia-is-about-to-launch-its-cbdc-president-putin-signs-new-law",
    "description": "<p>Russia's bill regarding the digital ruble is now signed into law and will take effect on August 1, 2023.</p>\nRussia&rsquo;s CBDC Legislation Finally Signed into Law\n<p>Russia moves forward with the launch of its central bank digital currency (CBDC), digital ruble, thus taking a step towards crypto regulation in the country.</p>\n<p>The digital ruble legislation bill was first introduced to the lower chamber of the Federal Assembly of the Russian Federation, the State Duma, in December 2022. The bill passed its first reading in March 2023 and its third final reading on July 11, 2023.&nbsp;</p>\n<p>On July 24, Russia&rsquo;s president Vladimir Putin finally signed the CBDC bill into law which is scheduled to come into force on August 1, 2023.</p>\n<p>The new law introduces amendments to several articles of the Russian Federation Civil Code. According to the law, the digital ruble will be treated as a means of cashless payment. Russia&rsquo;s central bank will be the main entity responsible for the digital ruble&rsquo;s infrastructure and the safety of the stored assets.</p>\nHow the Digital Ruble Is Expected to Work\n<p>The digital ruble is primarily designed to be a means of payment or a money transfer method and not aimed at investment purposes. Russia&rsquo;s central bank reported that transfers and payments in digital rubles will be free for regular citizens, although corporate clients will have to pay 0.3% of the payment amount.&nbsp;</p>\n<p>The authorities have referred to the digital ruble as a &ldquo;new opportunity for citizens and businesses&rdquo;. It&rsquo;s also important to note that the use of the new currency in the country will be completely voluntary.</p>\n\n<p>&ldquo;No one is going to force anyone into the digital ruble. Its use is absolutely voluntary, it is an additional opportunity for people: they can use it if they want to.&rdquo; &ndash; said the governor of Bank of Russia, Elvira Nabiullina.</p>\n\n<p>The government authorities previously reported that trials of the CBDC were to be run in collaboration with 13 local banks that have passed the necessary technical stages of preparation. The digital ruble wallet and transfers should be available in any of the Russian banks&rsquo; mobile apps, although all the operations will be carried out by the Central Bank itself.</p>\n<p>The Bank of Russia highlights the reliability, security, and efficiency of the CBDC operations thanks to their centralized regulation.</p>\n<p>Olga Skorobogatova, the Bank of Russia&rsquo;s deputy governor, compared the digital ruble to other digital assets:</p>\n\n<p> \"the digital ruble is not a cryptocurrency or a stablecoin, where either there is no issuer, or it is not clear who it is.\"</p>\n\n<p>The mass adoption of the digital ruble in Russia is expected in 2025-2027. The CBDC could be a way to avoid sanctions against Russia imposed by the West when making cross-border payments. It could also be part of the effort to regulate the use of digital assets in the country.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T12:30:21.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Find Price Support Ahead of US Consumer Confidence Report",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-find-price-support-ahead-of-us-consumer-confidence-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC, ETH Find Price Support, Ahead of US Consumer Confidence Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1638354850.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rebounded from a one-month low Tuesday, as markets prepare for the upcoming U.S. consumer confidence report. The confidence index is expected to increase to a reading of 111.5 in July, up from 109.7 the month prior. Ethereum also bounced higher, after colliding with a key price floor. Bitcoin After dropping to a one-month low [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T12:34:31.000Z",
    "title": "AI-Driven Game Mechanics in Board Games Will Soon Be A Reality With Hasbro and Xplored",
    "url": "https://www.cryptopolitan.com/ai-driven-game-mechanics-with-hasbro-and-xplored/",
    "description": "In a groundbreaking partnership, toy giant Hasbro has joined forces with Italian tech company Xplored, signaling a potential future where artificial intelligence becomes an integral part of board games. Adam Biehl, senior vice president and general manager of Hasbro Game, envisions a seamless integration of technology into analog gaming experiences, introducing innovative gameplay to players ... <a title=\"AI-Driven Game Mechanics in Board Games Will Soon Be A Reality With Hasbro and Xplored\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-driven-game-mechanics-with-hasbro-and-xplored/\" aria-label=\"More on AI-Driven Game Mechanics in Board Games Will Soon Be A Reality With Hasbro and Xplored\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T12:26:14.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The U.S. Securities and Exchange Commission (SEC) has begun reviewing applications from six companies, including BlackRock, to establish spot bitcoin exchange-traded funds. This marks the initial phase in the SEC&#8217;s procedure to determine the approval of the most recent set of proposals. The SEC has also officially recognized applications from Bitwise, ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T12:19:37.000Z",
    "title": "Why Worldcoin’s AI-Busting Advocacy Could Use Some Support from the Community",
    "url": "https://www.cryptopolitan.com/why-worldcoins-ai-busting-advocacy-community/",
    "description": "The recently launched Worldcoin, aimed at distinguishing humans from artificial intelligence online by &#8220;AI-busting&#8221;, has drawn mixed reactions in the crypto space. While the project garnered attention for its focus on AI, it has faced severe criticism over its privacy concerns and tokenomics model. Within just one day, the value of Worldcoin&#8217;s WLD token plummeted ... <a title=\"Why Worldcoin&#8217;s AI-Busting Advocacy Could Use Some Support from the Community\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-worldcoins-ai-busting-advocacy-community/\" aria-label=\"More on Why Worldcoin&#8217;s AI-Busting Advocacy Could Use Some Support from the Community\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T12:32:09.000Z",
    "title": "Bitcoin dominance wanes: Chainlink, Borroe, and Monero step up in altcoin season",
    "url": "https://crypto.news/bitcoin-dominance-wanes-chainlink-borroe-and-monero-step-up-in-altcoin-season/",
    "description": "Declining Bitcoin dominance driving Chainlink, Borroe, and Monero prices higher in the developing altcoin season"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T12:28:56.000Z",
    "title": "Coinbase-backed Rain secures crypto license in UAE",
    "url": "https://crypto.news/coinbase-backed-rain-secures-crypto-license-in-uae/",
    "description": "Rain crypto exchange has secured a regulatory license from United Arab Emirates (UAE) authorities. Rain Exchange, a Bitcoin (BTC) trading venue headquartered in Bahrain, has secured regulatory approval from UAE authorities to operate its digital assets brokerage and custody platform.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T12:18:39.000Z",
    "title": "Bitcoin funds decline as crypto investors flock to Ether and XRP",
    "url": "https://crypto.news/bitcoin-funds-decline-as-crypto-investors-flock-to-ether-and-xrp/",
    "description": "Bitcoin-related investment products decline as investors report their first week of outflows since Blackrock's filing for a spot Bitcoin ETF in June."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T12:30:29.000Z",
    "title": "Countdown To FOMC: What Bitcoin And Crypto Traders Must Brace For",
    "url": "https://www.newsbtc.com/news/countdown-fomc-bitcoin-crypto-must-brace-for/",
    "description": "As the eagerly anticipated Federal Open Market Committee (FOMC) meeting approaches, the financial world is abuzz with speculation about the potential implications for Bitcoin and crypto. Tomorrow, on Wednesday, July 26th, at 2 pm EST, the FOMC will announce its interest rate decision. As usual, Federal Reserve (Fed) chair Jerome Powell will face the media at 2:30 pm EST. According to the CME FedWatch tool, the majority of the market is expecting a 25 basis point increase (99.8%). However, the real intrigue lies in what comes after this move and whether it marks the end of the rate hike cycle. After tomorrow’s decision, the market expects the Fed to keep the key interest rate high for a longer period of time. A first rate cut could come in March 2024 at the earliest, if not in May. Tomorrow is #FOMC day, expect volatility. #Bitcoin #Crypto 98.9% probability of a 25 bps hike by the Fed. Market expects the Fed to keep the key interest rate high for a longer period of time. A first rate cut could come in March &#8217;24 at the earliest, if not in May. pic.twitter.com/C8wscv6BMd — Jake Simmons (@realJakeSimmons) July 25, 2023 Implications For Bitcoin And Crypto For the past 16 months, the U.S. Federal Reserve has been grappling with inflation while hiking interest rates to levels not seen in 20 years. But all signs point to a possible end of the tightening cycle. The market is firmly expecting the 0.25 bps hike to a range of 5.25 to 5.5% will be the last. Meanwhile, Bitcoin and crypto have experienced a period of relative immunity to macroeconomic events and rate hike speculations in the first seven months of the year. However, investors must be aware that such conditions might not last indefinitely. Related Reading: Bitcoin Witnesses Historic Whale Exodus: What You Need To Know On Monday, the Bitcoin price retraced to $29,000 support level. Seemingly, market participants have been cautious in the lead-up to the FOMC&#8217;s July meeting, aware that the FOMC meeting can have a profound impact. In June, Fed Chairman Jerome Powell hinted at the possibility of further rate hikes this year, with some committee members advocating for two more increases. The market now anxiously awaits the outcome of this meeting to ascertain the central bank&#8217;s future policy stance. However, factors such as declining inflation in the United States and a weaker labor market strengthen the market expectations. The previously skyrocketing inflation, which led to the tightening cycle, has shown signs of abating. June&#8217;s Consumer Price Index (YoY) data revealed a decline in inflation to 3.0% from 4.0%. The core rate fell from 5.3% in May to 4.8% in June. Both declines were stronger than previously anticipated. Remarkably, the core rate is now trading below the level of the US federal funds rate, which was pretty rare in the last 20 years. Related Reading: Over $41 Million in Bitcoin Long Positions Liquidated as BTC Crashes Toward $29K The prolonged strength of the US labour market has long been the biggest headache for the Federal Reserve because of the imbalance between supply and demand. At the peak of this imbalance, there were two job openings for every available worker, which drove up wages accordingly. As demand and supply approach equilibrium, job creation numbers have declined. Also, there are even early indications of declining consumer spending. So, what does all of this mean for Bitcoin and crypto investors? As always, it&#8217;s essential to approach the market with a balanced perspective. While BTC and cryptocurrencies have shown resilience in the face of traditional economic events, they are not entirely insulated from larger macroeconomic trends. Investors should closely monitor the FOMC&#8217;s interest rate decision and Jerome Powell’s subsequent statements. Any signals about the future rate hike cycle could have repercussions for both the traditional as well as Bitcoin and crypto markets, triggering a further sell-off. At press time, the market continued to show indecision. BTC was trading at $29,200. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T12:28:29.000Z",
    "title": "Best Meme Coin | Analyzing the Top 6 Meme Coins to Buy in 2023",
    "url": "https://www.crypto-news-flash.com/best-meme-coin-analyzing-the-top-6-meme-coins-to-buy-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=best-meme-coin-analyzing-the-top-6-meme-coins-to-buy-in-2023",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T124608.791.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T124608.791.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T124608.791-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of cryptocurrencies, meme coins have been captivating the attention of crypto enthusiasts in recent times. The quest for groundbreaking opportunities has driven crypto buyers and fans to explore the realm of the best meme coins, eager to uncover the next big sensation. Embarking on an in-depth exploration, this comprehensive guide discusses [...]"
  }
]