[
  {
    "source": "CoinDesk",
    "date": "2023-06-22T14:00:00.000Z",
    "title": "Northstake Raises $3M to Boost Institutional Crypto Staking",
    "url": "https://www.coindesk.com/business/2023/06/22/northstake-raises-3m-to-boost-institutional-crypto-staking/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The 2.8 million-euro fundraise comes from PreSeed Ventures, Morph Capital, The Aventures Fund, Funfair Ventures and Delta Blockchain Fund."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-22T14:00:00.000Z",
    "title": "Startup Kaito Gets $87.5M Valuation in New Funding to Build AI Search Engine for Crypto",
    "url": "https://www.coindesk.com/business/2023/06/22/startup-kaito-gets-875m-valuation-in-new-funding-to-build-ai-search-engine-for-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The search engine combines real-time data with large language models like ChatGPT."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-22T13:59:43.000Z",
    "title": "Cryptp Custody Firm BitGo Cancels Prime Trust Acquisition",
    "url": "https://www.coindesk.com/business/2023/06/22/cryptp-custody-firm-bitgo-cancels-prime-trust-acquisition/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BitGo made the decision after \"considerable effort and work to find a path forward with Prime Trust.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T13:46:04.000Z",
    "title": "How AI is changing the way humans interact with machines",
    "url": "https://cointelegraph.com/news/how-ai-is-changing-how-humans-interact-with-machines",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/991fa864-787b-4587-8a65-60ad62c203da.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Exploring how artificial intelligence and natural language processing are redefining everyday interactions with different technologies.</p>\n                    <p><p>The past 12 months have seen the global digital paradigm evolve tremendously, especially regarding how humans interact with machines. In fact, the space has undergone such a radical transformation that people of all ages are now fast becoming conversant with artificial intelligence (AI) models, most popularly OpenAI’s ChatGPT. </p><p>The primary driving force behind this revolution has been the advancements made in natural language processing (NLP) and conversational AI. NLP is a subfield of AI that focuses on the interaction between computers and humans using everyday language and speech patterns. The ultimate objective of NLP is to read, decipher, understand and make sense of human language in a way that is understandable and easy to digest for users.</p><p>To elaborate, it combines computational linguistics — i.e., rule-based modeling of human language — with other fields, such as machine learning, statistics and deep learning. As a result, NLP systems allow machines to understand, interpret, generate, and respond to human language in a meaningful and contextually appropriate way.</p><p>Moreover, NLP involves several key tasks and techniques, including part-of-speech tagging, named entity recognition, sentiment analysis, machine translation and topic extraction. These tasks help machines understand and generate human language-type responses. For example, part-of-speech tagging involves identifying the grammatical group of a given word, while named entity recognition involves identifying individuals, companies or locations in a text. </p><h3>NLP redefining communication frontiers</h3><p>Even though AI-enabled tech has only recently started becoming part of the digital mainstream, it has profoundly influenced many people for the better part of the last decade. Companions like Amazon’s Alexa, Google’s Assistant and Apple’s Siri have woven themselves into the fabric of our everyday lives, assisting us with everything from jotting down reminders to orchestrating our smart homes. </p><p>The magic behind these helpers is a potent mix of NLP and AI, enabling them to comprehend and react to human speech. That said, the scope of NLP and AI has now expanded into several other sectors. For example, within customer service, chatbots now enable companies to provide automated customer service with immediate responses to customer inquiries. </p><p>With the ability to juggle multiple customer interactions simultaneously, these automated chatbots have already slashed wait times.</p><p>Language translation is another frontier where NLP and AI have made remarkable progress. Translation apps can now interpret text and speech in real time, dismantling language barriers and fostering cross-cultural communication. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/cf2b2fb8-63b4-42a5-a4d8-73e61a150029.jpg\"  /></figure><p>A <a href=\"https://www.thelancet.com/pdfs/journals/lancet/PIIS0140-6736(20)30226-9.pdf\" target=\"_blank\" rel=\"noopener nofollow\">paper</a> in The Lancet notes that these translation capabilities have the potential to redefine the health sector. Researchers believe these systems can be deployed in countries with insufficient health providers, allowing doctors and medical professionals from abroad to deliver live clinical risk assessments.</p><p>Sentiment analysis, another application of NLP, is also being <a href=\"http://eprints.bournemouth.ac.uk/33093/1/Buhalis%20and%20Sinarta%20Real-time%20Service%20Final.pdf\" target=\"_blank\" rel=\"noopener nofollow\">employed to decipher the emotional undertones</a> behind words, making responses from platforms like Google Bard, ChatGPT and Jasper.ai even more human-like. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/bitcoin-adoption-in-mexico-boosted-by-lightning-partnership-with-retail-giant\">Bitcoin adoption in Mexico boosted by Lightning partnership with retail giant</a></em></strong></p><p>Thanks to their growing prowess, these technologies can be integrated into social media monitoring systems, market research analysis and customer service delivery. By scrutinizing customer feedback, reviews and social media chatter, businesses can glean valuable insights into how their customers feel about their products or services.</p><p>Lastly, AI and NLP have ventured into the realm of content generation. AI-powered systems can now <a href=\"https://d3.harvard.edu/platform-digit/submission/copyai-applying-natural-language-processing-to-content-creation/\" target=\"_blank\" rel=\"noopener nofollow\">craft</a> human-like text, churning out everything from news articles to poetry, helping create website content, generating personalized emails and whipping up marketing copy. </p><h2>The future of AI and NLP </h2><p>Looking toward the horizon, many experts believe the future of AI and NLP to be quite exciting. Dimitry Mihaylov, co-founder and chief science officer for AI-based medical diagnosis platform Acoustery, told Cointelegraph that the integration of multimodal input, including images, audio, and video data, will be the next significant step in AI and NLP, adding:</p><blockquote>“This will enable more comprehensive and accurate translations, considering visual and auditory cues alongside textual information. Sentiment analysis is another focus of AI experts, and that would allow a more precise and nuanced understanding of emotions and opinions expressed in text. Of course, all companies and researchers will work on enabling real-time capabilities, so most human interpreters, I am afraid, will start losing their jobs.”</blockquote><p>Similarly, Alex Newman, protocol designer at Human Protocol, a platform offering decentralized data labeling services for AI projects, believes that NLP and AI are on the verge of significantly increasing individual productivity, which is crucial given the anticipated shrinkage of the workforce due to AI automation. </p><p>Newman sees sentiment analysis as a key driver, with a more sophisticated interpretation of data taking place through neural networks and deep learning systems. He also envisions the open-sourcing of data platforms to better cater to those languages that have traditionally been under-served by translation services.</p><p>Megan Skye, a technical content editor for Astar Network — an AI-based multichain decentralized application layer on Polkadot — sees the sky as the limit for innovation in AI and NLP, particularly with AI’s ability to self-assemble new iterations of itself and extend its own functionality, adding: </p><blockquote>“AI and NLP-based sentiment analysis is likely already happening on platforms like YouTube and Facebook that use a knowledge graph, and could be extended to the blockchain. For example, if a new domain-specific AI is configured to accept freshly indexed blocks as a stream of source input data, and we had access to or developed an algorithm for blockchain-based sentiment analysis.”</blockquote><p>Scott Dykstra, chief technical officer for AI-based data repository Space and Time, sees the future of NLP at the intersection of edge and cloud computing. He told Cointelegraph that in the near to mid-term, most smartphones would likely come with an embedded large-language model that will work in conjunction with a massive foundational model in the cloud. “This setup will allow for a lightweight AI assistant in your pocket and heavyweight AI in the data center,” he added.</p><h3>The road ahead is paved with challenges</h3><p>While the future of AI and NLP is promising, it is not without its challenges. For example, Mihaylov points out that AI and NLP models rely heavily on large volumes of high-quality data for training and performance. </p><p>However, due to various data privacy laws, acquiring labeled or domain-specific data can be challenging in some industries. Furthermore, different industries have unique vocabularies, terminologies and contextual variations that require very specific models. “The shortage of qualified professionals to develop these models presents a significant barrier,” he opined.</p><p>Skye echoes this sentiment, noting that while AI systems can potentially operate autonomously in almost any industry, the logistics of integration, modification of workflows, and education present significant challenges. Furthermore, AI and NLP systems require regular maintenance, especially when the quality of answers and a low probability of error are important.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\">Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</a></em></strong></p><p>Lastly, Newman believes that the problem of access to new data sources pertinent to each industry looking to use these technologies will become more and more apparent with each passing year, adding:</p><blockquote>“There’s plenty of data out there; it’s just not always accessible, fresh or sufficiently prepared for machine training. Without data that reflects the particulars of an industry, its language, rules, systems, and specifics, AI won’t be able to appreciate any context and operate effectively.”</blockquote><p>Therefore, as more and more people continue to gravitate toward the use of the aforementioned technologies, it will be interesting to see how the existing digital paradigm continues to evolve and mature, especially given the rapid rate at which the use of AI seems to be seeping into various industries.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T14:07:47.000Z",
    "title": "Twitter is buzzing with speculation over BlackRock’s motives as it moves toward crypto",
    "url": "https://cryptoslate.com/twitter-is-buzzing-with-speculation-over-blackrocks-motives-as-it-moves-toward-crypto/",
    "description": "<p>On June 15, BlackRock, the world&#8217;s largest asset manager, filed a spot Bitcoin ETF application with the SEC during a period of low market sentiment following the regulator&#8217;s enforcement actions against Binance and Coinbase over alleged securities law violations. An institution of BlackRock&#8217;s stature expressing interest in the market has shown itself to be a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/twitter-is-buzzing-with-speculation-over-blackrocks-motives-as-it-moves-toward-crypto/\">Twitter is buzzing with speculation over BlackRock&#8217;s motives as it moves toward crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T14:02:19.000Z",
    "title": "Energy Web X Taps Into The Polkadot Blockchain",
    "url": "https://cryptodaily.co.uk/2023/06/energy-web-x-taps-into-the-polkadot-blockchain",
    "description": "<p>Energy Web will leverage Polkadot&rsquo;s interoperable multichain technology to bring decarbonization to Web3.</p>\n<p>Energy Web, the world&rsquo;s largest ecosystem of companies using open source, decentralized technologies to accelerate the energy transition, is coming to Polkadot, the next-generation blockchain network powering the movement for a better web.</p>\n<p>The move will allow Energy Web to create the framework for a new technology, &lsquo;Energy Web X&rsquo;, which will help its partners, including major players such as Shell, Vodafone, Volkswagen, and RMI - accelerate their decarbonization strategies.</p>\n<p>Having developed digital solutions with dozens of major energy companies and non-profit organizations from over 25 countries, Energy Web is focused on two key areas:</p>\n<p>Firstly, Energy Web wants to help electric utilities digitize and integrate distributed energy resources into the grid.</p>\n<p>Secondly, Energy Web aims to bring deep transparency and verifiability to emerging green product supply chains &ndash; including 24/7 matched renewable electricity, sustainable aviation fuel, and sustainably produced Bitcoin.</p>\n<p>Jesse Morris, CEO of Energy Web, commented:</p>\n\n<p>&ldquo;Energy Web and our global enterprise partners are collectively on a mission to make clean energy an integral and widely-accessible part of the global electricity system. To achieve this important goal, we decided to search for a blockchain platform that offers real enterprise-grade security and seamless upgradeability to ensure a safe and future-proof environment.</p>\n<p>Polkadot excels on both of these fronts with its shared security model and best-in-class core technology. We couldn&rsquo;t be more excited to build out the energy transition vertical on Polkadot.&rdquo;&nbsp;</p>\n\n<p>Adding:</p>\n\n<p>&ldquo;Energy Web X will be based on worker node networks. Each of these is a decentralized group of computers jointly executing sensitive business processes that involve or impact multiple companies. Enterprises will be able to deploy thousands of independent worker nodes, coordinate them in cohesive networks, and allow the public to verify the results of their work.&rdquo;</p>\n\n<p>Bj&ouml;rn Wagner, CEO of Parity Technologies, a leading contributor to the Polkadot network, said:</p>\n\n<p>&ldquo;The energy transition vertical is a perfect use case to take advantage of the benefits of blockchain technology, and it&rsquo;s a space where Polkadot is well positioned to be a market leader. We&rsquo;re especially pleased to see Polkadot bring competitive advantages to initiatives and enterprises making a positive environmental and social impact.</p>\n\n<p>In choosing to build a custom Polkadot parachain, Energy Web will get the performance and security its industry partners require and faster time to market and access to Polkadot&rsquo;s best-in-class interoperability. I&rsquo;m excited to partner with the Energy Web team to accelerate the transition to clean energy.&rdquo;</p>\n<p>Energy Web will launch a bid for a parachain slot on Polkadot to build a thriving ecosystem focused on the global energy transition. Further details about Energy Web X&rsquo;s plans will be revealed at Polkadot Decoded, the network&rsquo;s flagship summit, in Copenhagen, June 28-29.</p>\n<p>Ana Trbovich, vice chair of the Energy Web Foundation, will also appear on a regulatory panel at the event.</p>\n<p>The announcement comes soon after other big names from the music, gaming and accounting industries joined the Polkadot blockchain. The Energy Web X parachain will join the many other projects built on the Polkadot Relay Chain. By the end of Q1, 42 parachains had joined Polkadot, representing sectors such as decentralized finance (DeFi), privacy, social media, sustainability, NFTs, gaming, and the metaverse. Many of these parachains are platforms in themselves, collectively hosting hundreds of Web3 applications.</p>\n<p>Parachains help projects expand at scale by leveraging each other&rsquo;s strengths to unlock new use cases and enjoy the shared security advantages provided by Polkadot.</p>\nAbout Energy Web\n<p>Energy Web is a global non-profit on a mission to accelerate the transition to cleaner, more renewable energy sources by developing and deploying open-source Web3 technologies that help companies unlock business value from clean and distributed energy resources. It has partnerships with Shell, Engie, Elia Group, Singapore Power Group, and AEMO.</p>\nAbout Polkadot\n<p>Polkadot is a network that provides the technical advances necessary to make blockchain technology practical, accessible, scalable, interoperable and future-proof. It removes limitations and barriers to entry and fuels innovation, growing the decentralized technology space and bringing the Web3 vision to life.</p>\nAbout Parity Technologies\n<p>Parity Technologies has offices in Berlin, London and Lisbon, staffed by some of the world&rsquo;s leading blockchain innovators, core engineers, Rust developers, and solutions architects. It launched Polkadot in tandem with Web3 Foundation in May 2020 and continues to support and develop the network.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-22T14:00:27.000Z",
    "title": "Pepe Surges Amidst Meme Coin Market Gains; Whales Accumulated Significant PEPE During Price Dip",
    "url": "https://news.bitcoin.com/pepe-surges-amidst-meme-coin-market-gains-whales-accumulated-significant-pepe-during-price-dip/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Pepe Surges Amidst Meme Coin Market Gains; Whales Accumulated Significant PEPE During Price Dip\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/valk2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />While the crypto economy has reached a value of $1.2 trillion, meme coin markets have experienced substantial gains this week, with the top five meme tokens recording both 24-hour and seven-day gains. According to recent data, pepe is leading the pack with a 34% increase in the last 24 hours and a 66% increase over [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T14:03:26.000Z",
    "title": "Circle Internet Financial rebuilds stablecoin reserves with U.S. Treasury bills following debt ceiling standoff",
    "url": "https://www.cryptopolitan.com/circle-internet-financial-rebuilds-stablecoin-reserves-with-u-s-treasury-bills/",
    "description": "Circle Internet Financial, the stablecoin issuer, has strategically rebuilt its reserve assets for the USD Coin (USDC) following a recent debt ceiling standoff in the United States. In an effort to safeguard the stability of the USDC, Circle has made a decisive move to repurchase U.S. Treasury bills backed by its Circle Reserve Fund (USDXX) ... <a title=\"Circle Internet Financial rebuilds stablecoin reserves with U.S. Treasury bills following debt ceiling standoff\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-internet-financial-rebuilds-stablecoin-reserves-with-u-s-treasury-bills/\" aria-label=\"More on Circle Internet Financial rebuilds stablecoin reserves with U.S. Treasury bills following debt ceiling standoff\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T13:53:07.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-22T14:00:38.000Z",
    "title": "Exploring Avorak AI: The New Revolution in Bitcoin Trading",
    "url": "https://nulltx.com/exploring-avorak-ai-the-new-revolution-in-bitcoin-trading/",
    "description": "As Bitcoin maintains its prominence worldwide, it still attracts seasoned traders and newcomers looking to capitalize on its potential. However, navigating the complex Bitcoin arena requires a deep understanding of market trends, data analysis, and precise timing. As such, new technologies and innovations emerge with solutions that enhance the efficiency and profitability of trading. Avorak [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T14:01:46.000Z",
    "title": "Crypto community wagers on missing Titanic sub",
    "url": "https://crypto.news/crypto-community-wagers-on-missing-titanic-sub/",
    "description": "The crypto community is betting on the missing Titanic sub crew's fate as rescue operations continue. "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T13:57:42.000Z",
    "title": "LTC Gains Momentum as Halving Approaches: Key On-Chain Metrics Show Promising Growth for Litecoin",
    "url": "https://www.crypto-news-flash.com/ltc-gains-momentum-as-halving-approaches-key-on-chain-metrics-show-promising-growth-for-litecoin/?utm_source=rss&utm_medium=rss&utm_campaign=ltc-gains-momentum-as-halving-approaches-key-on-chain-metrics-show-promising-growth-for-litecoin",
    "description": "Litecoin (LTC) has experienced a surge in on-chain metrics, with a 55 percent increase in new addresses and a 28 percent increase in daily active addresses over the past week. The upcoming Litecoin halving event, scheduled in less than two months, is expected to have a positive impact on the network.  While everyone&#8217;s currently talking [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T13:40:44.000Z",
    "title": "Unraveling Ethereum’s Hidden Connections: Fox Journalist Exposes Vitalik Buterin’s Link to Prometheum",
    "url": "https://www.crypto-news-flash.com/unraveling-ethereums-hidden-connections-fox-journalist-exposes-vitalik-buterins-link-to-prometheum/?utm_source=rss&utm_medium=rss&utm_campaign=unraveling-ethereums-hidden-connections-fox-journalist-exposes-vitalik-buterins-link-to-prometheum",
    "description": "Fox Journalist unravels the connection between Ethereum co-founder Vitalik Buterin and Prometheum. Ethereum and Prometheum seem to be favored by the US Securities and Exchange Commission (SEC).  Ethereum co-founder Vitalik Buterin has been the center of discussion lately following reports that former US Securities and Exchange Commission (SEC) director William Hinman had contacted him before [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-22T14:07:58.000Z",
    "title": "Everything About Bitcoin ETFs",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/everything-about-bitcoin-etfs/",
    "description": "<p>An ETF is an investment vehicle that is publicly traded, like a stock, but tracks the performance of an underlying asset or index, rather than that of a single company. Also, an ETF provides investors a way to gain exposure to the value of its underlying asset, such as gold or oil. In this article, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/everything-about-bitcoin-etfs/\">Everything About Bitcoin ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-22T14:02:00.000Z",
    "title": "Looking Back at Chinese Ministry of Truth 2018 Best Blockchain Ranking",
    "url": "https://coinedition.com/looking-back-at-chinese-ministry-of-truth-2018-best-blockchain-ranking/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Mr. Huber, a well-known figure in the crypto community, ignited a conversation on Twitter by referring back to a 2018 report from the Chinese Ministry of Truth, where the best blockchains in the world were identified. The report, released by the CCID Research Institute of the Ministry of Industry and Information Technology, unveiled the Global [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/looking-back-at-chinese-ministry-of-truth-2018-best-blockchain-ranking/\">Looking Back at Chinese Ministry of Truth 2018 Best Blockchain Ranking</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-22T13:47:34.000Z",
    "title": "Flamingo (FLM) Price Prediction 2023-2030: Will FLM Price Reach $1 Soon?",
    "url": "https://coinedition.com/flamingo-flm-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Flamingo-(FLM)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Flamingo-FLM-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Decentralized Finance (DeFi) platforms have become popular this year as the demand for decentralization continues to rise. Flamingo Finance’s native token, FLM has recently entered the market as one of the top trending coins. Flamingo Finance is a DeFi platform that allows users to convert assets, wrap assets, and perform various other functions.  Flamingo has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/flamingo-flm-price-prediction/\">Flamingo (FLM) Price Prediction 2023-2030: Will FLM Price Reach $1 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-22T13:45:00.000Z",
    "title": "Kylie Davies Launches VC Fund 3AC Ventures, Eyes Roll on Twitter",
    "url": "https://coinedition.com/kylie-davies-launches-vc-fund-3ac-ventures-eyes-roll-on-twitter/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/3AC-is-dead-long-live-3AC-Ventures-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Three Arrows co-founder Kyle Davies tweeted on June 23 that “3AC is dead,” while celebrating the launch of his new VC fund, Three Arrows Capital (3AC) Ventures. Davies’ tweet follows right after OPNX announced 3AC Ventures as its ecosystem partner. In response to Davies’ tweet, Nansen AI CEO Alex Svanevik asked the question on everybody’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/kylie-davies-launches-vc-fund-3ac-ventures-eyes-roll-on-twitter/\">Kylie Davies Launches VC Fund 3AC Ventures, Eyes Roll on Twitter</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]