[
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T06:10:00.000Z",
    "title": "Elon's 'not afraid of blowing things up' —  ex-Twitter exec on working under Musk",
    "url": "https://cointelegraph.com/news/ex-twitter-executive-reveals-elon-musk-secrets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b3232ddc-ad50-424b-9128-45382221a39e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Esther Crawford claimed Elon Musk’s inability to handle criticism created a “zealous and fanatical” inner circle.</p>\n                    <p><p>A former product director at Twitter, now X, has shed new light into the once inner workings of the social media firm, along with some of the peculiarities that come with working under entrepreneur Elon Musk. </p><p>In a lengthy 2,400-word tweet and accompanying video, Crawford described the pre-Musk Twitter as both “amazing and terrible” being hamstrung by bureaucracy, while the new post-Musk Twitter has been “difficult and dramatic.”</p><blockquote>“Twitter moved at the speed of molasses and suffered from bureaucracy but now X is run by a mercurial leader whose instinct is driven by the unique and undoubtedly weird experience of being the biggest voice on the platform.”</blockquote><p>Crawford was one of the few members from the original Twitter team that voluntarily stayed on board after Musk took over — a decision she said was made in the hope that the billionaire would begin steering the company in the right direction. </p><p>Notably, she was fired along with 200 others in Musk’s February round of layoffs. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Like seemingly everyone on this app I have plenty of opinions about Twitter &gt; X and figure now is a good time to open up a bit about my experience at the company.<br><br>I tweeted for years into the void for the love of it like many of you, but after selling my startup to Twitter in… <a href=\"https://t.co/bw7CHhk0Xg\">pic.twitter.com/bw7CHhk0Xg</a></p>&mdash; Esther Crawford ✨ (@esthercrawford) <a href=\"https://twitter.com/esthercrawford/status/1684291048682684416?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“I saw him as the guy who built incredible and enduring companies like Tesla and SpaceX, so perhaps his private ownership could shake things up and breathe new life into the company,” she wrote.</p><p>Describing Musk as “bold and inspiring” she admitted he was “oddly charming and genuinely funny,” even if he was prone to repeating the same stories and jokes over and over.</p><p>Despite his endearing qualities, Musk’s infamous leadership style became problematic rather quickly, with Crawford saying that he often lacked empathy to a “painful” degree. </p><p>Crawford adds that Musk was extremely unpredictable and that many Twitter employees became scared to present him with bad news or opinions that contradicted his own. </p><blockquote>“Since it was hard to read what mood he might be in and what his reaction would be to any given thing, people quickly became afraid of being called into meetings or having to share negative news with him.”</blockquote><p>This inability to deal with criticism, Crawford explained, ultimately led to the creation of a “fanatical and zealous” inner circle that offered unwavering support for everything Musk said.</p><p>Ultimately however, it became apparent that Musk was “obviously not afraid of blowing things up” and often looked outside of employees or the trusted members of his inner circle for advice on major decisions.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Should I step down as head of Twitter? I will abide by the results of this poll.</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1604617643973124097?ref_src=twsrc%5Etfw\">December 18, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Instead he'd poll Twitter, ask a friend, or even ask his biographer for product advice. At times it seemed he trusted random feedback more than the people in the room who spent their lives dedicated to tackling the problem at hand. I never figured out why and remain puzzled by it,\" she said.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/twitter-threads-users-are-the-real-losers\"><strong><em>Twitter vs. Threads: Users are the real losers</em></strong></a></p><p>Cointelegraph contacted Twitter for comment but did not receive an immediate response. </p><p>Since Musk took over the company in Oct. 2022, he has introduced a <a href=\"https://cointelegraph.com/news/twitter-s-crypto-price-index-feature-expands-to-30-tokens-and-counting\">wealth of new crypto</a> and <a href=\"https://cointelegraph.com/news/twitter-to-launch-crypto-and-stock-trading-in-partnership-with-etoro-reports\">finance-related features</a> to the app.</p><p>As part of its most recent rebranding to “X” Musk intends for the social media platform <a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\">to become an “everything app”</a> which will include electric payments, voice calls and potentially some <a href=\"https://cointelegraph.com/news/elon-musk-dogecoin-price-twitter-x-rebrand\">form of integration with the meme token Dogecoin</a> (DOGE).</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T06:38:49.000Z",
    "title": "Stack Overflow’s OverflowAI Elevates the Developer Ecosystem",
    "url": "https://www.cryptopolitan.com/stack-overflows-overflowai-developer/",
    "description": "Stack Overflow has unveiled OverflowAI, marking a significant leap into the world of generative AI, providing developers with new AI capabilities, and solidifying its position as the go-to platform relied upon by a generation of developers for technical guidance. Both the public Stack Overflow site and its commercial product, Stack Overflow for Teams, now have ... <a title=\"Stack Overflow&#8217;s OverflowAI Elevates the Developer Ecosystem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stack-overflows-overflowai-developer/\" aria-label=\"More on Stack Overflow&#8217;s OverflowAI Elevates the Developer Ecosystem\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T06:15:08.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.705. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced a decrease of 1.54%in the ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T06:31:50.000Z",
    "title": "Link Whale Accumulation Continues With Massive Transactions Recorded",
    "url": "https://nulltx.com/link-whale-accumulation-continues-with-massive-transactions-recorded/",
    "description": "Chainlink (LINK) has been on a tear in recent days, jumping ahead of the altcoin pack on Thursday. The price of LINK is now trading at its highest level at $8.46 since April, and there are a few reasons for this surge. Heavy Whale Transaction One reason is heavy whale accumulation. According to on-chain data, [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T06:31:22.000Z",
    "title": "Worldcoin vs. Bitcoin: The Race to Onboard Billions to Crypto Markets – Is Worldcoin a threat to BTC?",
    "url": "https://www.crypto-news-flash.com/worldcoin-vs-bitcoin-the-race-to-onboard-billions-to-crypto-markets-is-worldcoin-a-threat-to-btc/?utm_source=rss&utm_medium=rss&utm_campaign=worldcoin-vs-bitcoin-the-race-to-onboard-billions-to-crypto-markets-is-worldcoin-a-threat-to-btc",
    "description": "<img width=\"512\" height=\"322\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-30T195243.699.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Worldcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-30T195243.699.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/unnamed-2023-04-30T195243.699-300x189.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Worldcoin&#8217;s identity protocol, led by OpenAI&#8217;s Sam Altman, aims to surpass Bitcoin in distributing cryptocurrency globally, potentially reaching billions of users. Recent updates reveal Worldcoin&#8217;s rapid growth, with millions of verified users and increasing interest in its innovative approach. According to the latest updates from CoinDesk, Worldcoin, the identity protocol developed by OpenAI&#8217;s Sam Altman, [...]"
  }
]