[
  {
    "source": "CoinDesk",
    "date": "2024-01-09T14:40:35.000Z",
    "title": "Protocol Village: Elastos Launches 'Elacity DRM' for Web3 Rights Management",
    "url": "https://www.coindesk.com/tech/2024/01/04/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Jan. 4-10."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T14:52:16.000Z",
    "title": "Top Solana Alternatives for the Year 2024",
    "url": "https://cryptodaily.co.uk/2024/01/top-solana-alternatives-for-the-year-2024",
    "description": "Discover the top alternatives to Solana in 2024, featuring an in-depth analysis of the most promising blockchain platforms. Explore our expert reviews on their features, scalability, security, and community support to find the best fit for your crypto investments and projects."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T14:55:47.000Z",
    "title": "What would Satoshi Nakamoto say about spot Bitcoin ETFs? I wager disappointment",
    "url": "https://www.cryptopolitan.com/satoshi-nakamoto-say-about-spot-bitcoin-etfs/",
    "description": "Satoshi Nakamoto, the elusive and pseudonymous creator of Bitcoin, introduced the world to a decentralized and peer-to-peer electronic cash system with the publication of the Bitcoin whitepaper in 2008. While Nakamoto&#8217;s identity remains unknown, the impact of (his/hers/their) creation on the financial landscape is undeniable.&#160; If we were to imagine what Satoshi Nakamoto might say [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T15:00:50.000Z",
    "title": "SEC committee may delay decision on spot Bitcoin ETF",
    "url": "https://crypto.news/sec-committee-may-delay-decision-on-spot-bitcoin-etf/",
    "description": "Fox Business journalist Eleanor Terrett reported that the U.S. Securities and Exchange Commission may delay a decision on spot Bitcoin ETFs."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T15:00:00.000Z",
    "title": "Meme Moguls may flip Shiba Inu and Dogecoin ",
    "url": "https://crypto.news/meme-moguls-may-flip-shiba-inu-and-dogecoin/",
    "description": "This article compares on-chart data of Shiba Inu (SHIB), Dogecoin (DOGE), and Meme Moguls (MGLS) to see which cryptocurrency investors can consider"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T14:54:59.000Z",
    "title": "Solana surges 14%, closing the gap with BNB again",
    "url": "https://crypto.news/solana-surges-14-closing-the-gap-with-bnb-again/",
    "description": "Solana recorded impressive gains after dropping below the $90 mark on Jan. 8, and its Relative Strength Index suggests strong bull momentum."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T15:00:31.000Z",
    "title": "Filecoin: Rocky Start Hits Protocol With Slow New Year Progress – Here’s Why",
    "url": "https://www.newsbtc.com/news/filecoin-rocky-start-hits-protocol-with-slow-new-year-progress-heres-why/",
    "description": "Although the broader market is experiencing a strong start this year, Filecoin has opened the year at a snail’s pace. According to Coingecko, the token is up over 4% in the past 24 hours. However, the week started with FIL bleeding nearly 27%.  With investors uninspired by the ongoing broader market rally, FIL might be in for a rough few months after ending 2023 on a positive note.  Related Reading: Maker Takes The Spotlight With 34% Gain – Can MKR Hold This Position? On-Chain Growth Prevents A Bigger Disaster  In their most recent blog post, they highlight the recent achievements of the ecosystem. Over 2,442 unique smart contracts deployed on-chain, with over 3,000 projects native on Filecoin. But overall, Filecoin has been fairly silent in terms of development, despite boasting an extremely active developer base with over 15,000 contributors on GitHub. Swan Chain – a layer-2 protocol powered by Filecoin itself – is the one creating a positive noise. In their recent post on X, the protocol posted a roadmap for this year.  If Swan’s planned roadmap is followed and implemented, it may reverse the overall bearish attitude on FIL. However, this will inevitably take time, costing investors precious moments on the red rather than starting the year on the green.  But 2023 was a bountiful year for Swan Chain. In the blog post detailing the protocol’s achievements last year, their testnets Lagrange and Mars covered different aspects of the ecosystem and saw great success. This might be a sign that investors should be in for the long term rather than expect short-term gains.  FIL market cap currently at $2.776 billion. Chart: TradingView.com Filecoin: More Pain In The Short To Medium-Term? As of writing, the token is completely in the red after an impressive year-end rally. The bulls are now fighting over control of the $5.825 price level which will provide a better platform for higher highs in in the long term. However, this may not be the case in the next couple of days.  &#160; FIL’s market is dominated by the bears that will inevitably bring the token’s price to sub-$5 if the bearishness continues. But this also presents the opportunity for the bulls to slow the token’s descent until they find strong support for the long haul.  At the moment, $5.231 will be the point at which the bulls will slow FIL’s downward spiral. If they can hold on to this price level in the long run, investors and traders will see gains trickle in little by little.  Related Reading: Polygon NFTs Explode: 6-Month High Volume Ignites Market – Details Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T15:00:45.000Z",
    "title": "The Presale That’s Overtaking $SHIB as the Hottest New Memecoin on the Market",
    "url": "https://www.crypto-news-flash.com/the-presale-thats-overtaking-shib-as-the-hottest-new-memecoin-on-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=the-presale-thats-overtaking-shib-as-the-hottest-new-memecoin-on-the-market",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-63.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-63.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-63-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-63-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-63-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Galaxy Fox burst onto the scene full-throttle and has since taken the memecoin market by storm with its unstoppable presale. This new project has dominated the crypto-trending news in recent weeks as it racked in around $2.5 million in revenue. Its distinctive features seem to be what&#8217;s driving investor enthusiasm. Meanwhile, $SHIB is facing a [...]"
  }
]