[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T09:41:12.000Z",
    "title": "Bitcoin Whale Moves $37M BTC After 11 Years of Dormancy",
    "url": "https://www.coindesk.com/markets/2023/07/26/bitcoin-whale-moves-37m-btc-after-11-years-of-dormancy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The movement is the latest in a trend of early buyers and holders moving their tokens to new wallets after several years of inactivity."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T10:01:10.000Z",
    "title": "Crypto Gaming Startup Ultra Launches Esports Platform With Token, NFT Prizes",
    "url": "https://decrypt.co/150076/crypto-gaming-startup-ultra-launches-esports-platform-token-nft-prizes",
    "description": "Ultra Arena features on-chain digital identities and reputation, with an aim to help amateur players rise up the ranks—and maybe even go pro."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T10:01:02.000Z",
    "title": "Ransomware May Be Dying Out, But Cryptojacking Is Up 399%: Cybersecurity Firm",
    "url": "https://decrypt.co/150112/ransomware-may-be-dying-but-cryptojacking-is-399-cybersecurity-firm",
    "description": "The education sector saw 320 times more cryptojackings in the first half of 2023 than last year—and weirdly, market downturns spark more attacks."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T09:50:59.000Z",
    "title": "Alibaba to support Meta’s AI model Llama - report ",
    "url": "https://cointelegraph.com/news/alibaba-to-support-meta-ai-model-llama",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/483ba13d-f71f-4de0-a8b3-e9661a3643d5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Alibaba’s cloud computing service taps Meta’s artificial intelligence model Llama to power new software development. </p>\n                    <p><p>E-commerce group <a href=\"https://cointelegraph.com/tags/alibaba\">Alibaba </a>will become the first Chinese company to make use of Meta’s open-source artificial intelligence (AI) model Llama to power zero-cost development of programs.</p><p>According to an initial <a href=\"https://www.reuters.com/technology/alibabas-cloud-unit-brings-metas-ai-model-llama-its-clients-2023-07-26/\" target=\"_blank\" rel=\"noopener nofollow\">report </a>from Reuters which cited an official statement from Alibaba Cloud through its WeChat account, the cloud computing arm of the Chinese conglomerate has deployed a Llama 2-based solution to allow businesses to develop software and tools using AI:</p><blockquote>“Today, Alibaba Cloud has launched the first training and deployment solution for the entire Llama2 series in China, welcoming all developers to create customised large models on Alibaba Cloud.”</blockquote><p>Meta’s Llama2 model was released in <a href=\"https://about.fb.com/news/2023/07/llama-2/\" target=\"_blank\" rel=\"noopener nofollow\">July 2023</a> as a free-to-use service rivaling the likes of early movers including OpenAI’s ChatGPT and Google Bard. Meta intends to allow Llama2 to be free to use for companies with less than 700 million monthly active users.</p><p>The announcement from Meta highlighted that Microsoft remained its preferred partner for developing its generative AI tool while Llama 2 would be freely available for research and commercial use.</p><p><a href=\"https://cointelegraph.com/news/open-ai-launches-official-chat-gpt-app-android\"><strong><em>Related: OpenAI launches official ChatGPT app for Android</em></strong></a></p><p>Meta also noted that it was adopting an open approach to provide increased access to foundational AI technology to benefit businesses around the world. This includes supporting companies around the world that are building products on Llama 2, cloud providers including the model in its offerings as well as research efforts exploring “safe and responsible deployment of large generative models”.</p><p>Alibaba Cloud is set to become one of a handful of prominent cloud computing services including Amazon Web Service (AWS) that will tap into Llama 2’s large language model.</p><p>The development comes after the United States moved to curtail the sale of select AI processing hardware chipsets in <a href=\"https://www.bloomberg.com/news/articles/2023-06-28/us-plans-new-ai-computer-chip-export-controls-aimed-at-nvidia?sref=323RPL5z&amp;in_source=embedded-checkout-banner\" target=\"_blank\" rel=\"noopener nofollow\">June 2023</a> as the country looks to retain a competitive advantage in the rapidly developing area of AI tools.</p><p>The Reuters report also suggests that the integration of Meta’s new AI model could present an avenue for the country to reaffirm ties in China. Meta’s Facebook <a href=\"https://time.com/6139988/countries-where-twitter-facebook-tiktok-banned/\" target=\"_blank\" rel=\"noopener nofollow\">has been banned</a> in China since 2009 alongside Twitter, YouTube and other Western-based social media and content platforms.</p><p>Cointelegraph has contacted Alibaba Cloud and Meta to ascertain the finer details of the Llama 2 integration, but hasn't yet received a response.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/alibaba-to-support-meta-ai-model-llama&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\">Experts want to give AI human ‘souls’ so they don’t kill us all</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T09:43:31.000Z",
    "title": "Singapore High Court rules crypto personal property, compares it to fiat money ",
    "url": "https://cointelegraph.com/news/crypto-singapore-high-court-rules-crypto-personal-property-compares-it-to-fiat-money",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/62ed9bba-ae96-4748-a8f8-99621f6129b0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Judge didn’t see any difference between crypto, fiat money or shells, as long as all those objects, physical or not, share value, created by mutual faith in it. </p>\n                    <p><p>Cryptocurrency is deemed property capable of being held on trust, Judge Philip Jeyaretnam of the High Court of Singapore decided in a ruling on July 25. The Judge said he didn’t see any difference between crypto, fiat money or shells, as long as all those objects, physical or not, share value, created by mutual faith in it. </p><p>Judge Jeyaretnam handed down his <a href=\"https://www.elitigation.sg/gd/s/2023_SGHC_199\" target=\"_blank\" rel=\"noopener nofollow\">ruling</a> in a case brought by ByBit against its former employee, Ho Kai Xin. ByBit claimed the staff-member transferred around 4.2 million of USDT from the crypto exchange to her private accounts. The court has now ordered Ho, who’s been accusing a non-present cousin of controlling the relevant accounts, to return all the money back to ByBit. </p><p>While the decision may seem obvious, it contains some formulations, important for the juridical status of digital assets. Judge Jeyaretnam calls the stolen USDT, as well as cryptocurrencies in general, a property. Even though they don’t have any physical presence, the Judge believes that:</p><blockquote>“We identify what is going on as a particular digital token, somewhat like how we give a name to a river even though the water contained within its banks is constantly changing.”</blockquote><p>He rebukes the common suspicion of crypto not having any “real” value, reminding that value is “a judgment made by an aggregate of human minds”. Jeyaretnam also classifies crypto in the category of “things in action”. In British common law, that means a type of property, personal rights over which could be claimed or enforced by legal action, and not by taking physical possession. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end\"><strong><em>Singapore to require crypto firms to put user assets into trusts by year-end</em></strong></a></p><p>In his decision, the Judge cited the consultation paper by the Monetary Authority of Singapore (MAS) that will implement segregation and custody requirements for digital payment tokens. If it is possible in practice to identify and segregate such digital assets, it should be legally possible to hold them on trust, the Judge notes. </p><p>The decision mentions Order 22 of Singapore’s Rules of Court 2021, which defines “movable property” to include “cash, debt, deposits of money, bonds, shares or other securities, membership in clubs or societies, and cryptocurrency or other digital currency.”</p><p>In May 2022, the High Court of Justice in London ruled that nonfungible tokens (NFT) represent “private property.” The experts <a href=\"https://cointelegraph.com/news/uk-court-recognizes-nfts-as-private-property-what-now\">called the decision a “great precedent”</a> for people investing in NFTs, who might hope that the British courts would protect their property rights.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-singapore-high-court-rules-crypto-personal-property-compares-it-to-fiat-money&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T09:57:07.000Z",
    "title": "Bitcoin derivatives market trends",
    "url": "https://cryptoslate.com/insights/bitcoin-derivatives-market-trends/",
    "description": "<p>Quick Take The derivatives market for Bitcoin has been instrumental in driving recent price movements, and a key metric to consider is open interest. &#8216;Open interest&#8217; represents the total amount of capital committed in open futures contracts. Over the past few days, this figure has surged to over 413,000 Bitcoin, according to Glassnode. However, when [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-derivatives-market-trends/\">Bitcoin derivatives market trends</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T09:59:38.000Z",
    "title": "Bitcoin pressure cooker about to explode",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-pressure-cooker-about-to-explode",
    "description": "<p>Bitcoin has reached the point where the price action direction for the next few months could well be decided.</p>\nSuper low volatility\n<p>Bitcoin is either on the brink of the cliff, or it is on the launchpad. Most analysts appear to be going with the cliff theory, given that bitcoin has not been able to break through the huge resistance at $31,000, which it has been trying to do since March of this year.</p>\n<p>Volatility is incredibly low. Bollinger bands are as tight as they&rsquo;ve ever been and something has to give. As the bands tighten further around bitcoin it has the effect as though someone is squeezing a bar of wet soap with more and more force until it suddenly bursts out like a projectile.</p>\nThe current state of play\n<p>To describe the scene, bitcoin is sitting on very strong support at around $29,200. On the daily timeframe it is also resting on the 50-day moving average. Below, currently at about $27,000, is the upwards trendline which defines this bull market, and just below that is the last bastion of defence in the 200-day moving average.</p>\n<p>It must be said that if bitcoin were to fall through the entirety of all this support, what we all thought was the start of the next bull market may turn into the most deceiving bear market rally.</p>\nA bearish short term?\n<p>Likely bearish news is due as soon as later today. The Federal Reserve is in the midst of its latest FOMC meeting and Fed Chair Jerome Powell will make an interest rate announcement, that is very widely expected to be another 25 basis point rise to the upside.</p>\n<p>Of course, the market has already priced this in, as well as the other possible quarter point rise that the Fed has said it wants to make before the end of the year. Be that as it may, there is bound to be a lot of volatility around the time of the announcement, and also afterwards when Powell may make some hawkish utterances in order to further quell the market.</p>\n<p>When all is said and done bitcoin does appear to be demonstrating much weaker price action and the widely expected plummet to the downside could certainly take place. However, the bull market trendline and the 200-day moving average are both waiting below so look for bitcoin to make a strong bounce from these supports.</p>\nBullish medium term\n<p>Looking further ahead, this bull market trendline is converging with the $31,000 resistance, thereby forming an ascending triangle. As price action funnels towards the culmination of this bullish chart pattern, expect another explosion, and this time towards the upside.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T09:52:27.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.125, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.94% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T09:57:34.000Z",
    "title": "Compound (COMP) price gains 10% despite market correction",
    "url": "https://crypto.news/compound-comp-price-gains-10-despite-market-correction/",
    "description": "As Bitcoin (BTC) grapples with resistance near the $30,000 level after a week of fluctuations, Compound (COMP) rises by 10% in 24 hours. At the beginning of the week, Bitcoin opened with a certain price, and since then, it has&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T09:50:01.000Z",
    "title": "KuCoin’s CEO refutes 30% layoff rumors",
    "url": "https://crypto.news/kucoins-ceo-refutes-30-layoff-rumors/",
    "description": "KuCoin has denied reports that it will lay off 300 workers, 30% of its workforce while conceding the potential of future personnel adjustments."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T09:40:27.000Z",
    "title": "Binance Coin (BNB) Price Poised For A Major Breakout – Which Way Will It Go?",
    "url": "https://www.newsbtc.com/news/binance-coin-bnb-price-poised-for-a-major-breakout-which-way-will-it-go/",
    "description": "Binance Coin bulls have shown signs of sluggishness, leading to a concerning dip below the crucial $240 support level. This downward movement suggests that bearish forces may be gaining dominance in the near-term market outlook. Currently, BNB is shaping an intriguing chart pattern known as the inverted flag. Amidst the recent market turbulence, BNB&#8217;s price has experienced a 0.2% dip in the past 24 hours and a seven-day decline of 2.1%. The coin is currently trading at $237, figures from crypto market tracker CoinGecko shows.  As the former high of $261.9 seems to be a distant memory, investors are keenly observing this bearish continuation pattern and its potential implications. Source: Coingecko Understanding BNB’s Inverted Flag Pattern The inverted flag pattern is a technical chart pattern that signals a potential downtrend continuation. It is formed when a sharp decline in the price of an asset (the flagpole) is followed by a brief period of consolidation, represented by a downward-sloping channel (the flag). This pattern suggests that the price will likely break the lower support trendline after a temporary relief rally and continue its downward trajectory. Related Reading: Shiba Inu: Will This Bullish Formation Lead To A 25% Upsurge? With a loss of 2.0% in the last week, the BNB price is approaching the lower support trendline of the inverted flag pattern. As BNB’s bearish continuation pattern takes hold, the chances of the price breaking this dynamic support become more significant. A daily candle closing below this trendline would signal a strong possibility of the downward trend resuming. BNB market cap currently at $36.5 billion. Chart: TradingView.com Binance Coin: Potential Reversal At Support However, there is hope for BNB holders as signs of a potential reversal emerge. If the coin price shows resilience and starts to rebound at the bottom support trendline, it would indicate that buyers are actively defending this critical level.  Related Reading: Cardano TVL – A Crucial Factor For ADA Price Revival? Such a reversal could prolong the ongoing relief rally and push the BNB price back toward the overhead trendline, currently sitting near $265. A bullish breakout from this resistance could invalidate the bearish thesis and trigger a sustainable recovery for BNB. &#160; BNB price action in the last 24 hours. Source: CoinMarketCap Investors should exercise caution as the inverted flag pattern unfolds and closely monitor the price action around the lower support trendline. A confirmed break below this level would confirm the bearish continuation pattern, prompting some investors to consider cutting their losses or adopting a defensive stance. On the other hand, a clear rebound from the support could present a buying opportunity for those anticipating a reversal. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Tradedog"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T10:00:58.000Z",
    "title": "Solana and Stellar (XLM) Struggle For Stability, Tradecurve Expected to 50x During Presale",
    "url": "https://www.crypto-news-flash.com/solana-and-stellar-xlm-struggle-for-stability-tradecurve-expected-to-50x-during-presale/?utm_source=rss&utm_medium=rss&utm_campaign=solana-and-stellar-xlm-struggle-for-stability-tradecurve-expected-to-50x-during-presale",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T102510.794.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T102510.794.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T102510.794-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T102510.794-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Capturing the attention of investors is difficult in the crypto market, which is flooded with projects. However, Tradecurve (TCRV) has not only grabbed the attention of investors but also secured millions of dollars in presale investments. On the contrary, long-standing projects like Solana (SOL) and Stellar (XLM) are losing their loyal investors. Let’s see what [...]"
  }
]