[
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T07:00:00.000Z",
    "title": "Crypto data platform Glassnode sells Bitcoin tax software to Blockpit",
    "url": "http://cointelegraph.com/news/glassnode-exits-bitcoin-tax-space",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/cdb40ddd-ae17-467f-bd89-433bae9d4434.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After acquiring the crypto tax platform Accointing in October 2022, Glassnode is selling the business to focus on DeFi and institutional offerings.</p>\n                    <p><p>Cryptocurrency intelligence firm Glassnode has said it’s dropping crypto tax-related projects to focus on new solutions targeting institutional investors and decentralized finance (DeFi).</p><p>Glassnode, on Nov. 6 announced the sale of its crypto-focused tax platform known as Accointing to the European crypto compliance provider Blockpit. The firms declined to disclose the size of the deal to Cointelegraph, only revealing that the transaction was a “multimillion-dollar deal.”</p><p>“Glassnode will exit the crypto tax space with the sale of Accointing to Blockpit,” a spokesperson said, adding that the deal enables the firm to deepen its focus on delivering new Digital Asset Intelligence Solutions to its institutional clients.</p><p>“We have used the last months to reshape our infrastructure, enabling our move into DeFi data solutions and expansions into other digital asset ecosystem areas in the future,” Glassnode representative noted, adding:</p><blockquote>“After having built the leading on-chain data platform for Bitcoin and Ethereum, we are currently expanding our product offering into DeFi. Our aim is to equip Institutions with DeFi data and tools that help them to trade in and navigate the DeFi space.”</blockquote><p>The transaction came just a year after Glassnode <a href=\"https://www.accesswire.com/719336/leading-crypto-market-intelligence-provider-glassnode-acquires-crypto-portfolio-tracking-tax-platform-accointing\" target=\"_blank\" rel=\"noopener nofollow\">acquired</a> Accointing to introduce tax-reporting compliance tools into its platform in October 2022.</p><p>The acquisition of Accointing marks another foray by Blockpit into merging with competitors, as the platform previously <a href=\"https://cointelegraph.com/news/european-crypto-tax-firms-merge-in-bid-to-expand-to-north-american-markets\">merged with the German rival platform Cryptotax</a> in 2020. With the latest acquisition, Blockpit reiterated its ambition and vision for a consolidated and unified crypto tax platform for Europe.</p><p>“Due to the very similar nature of the Blockpit and Accointing platform, the acquisition really is a perfect opportunity,” Blockpit co-founder and CEO Florian Wimmer told Cointelegraph.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/5-nations-challenge-crypto-experts-investigators-tax-crimes\"><strong><em>5 nations challenge crypto experts and investigators to target tax crimes</em></strong></a></p><p>Wimmer said that Accointing users could “easily migrate their profiles and data” to a new Blockpit account, which he promised would take just a few minutes. The account migration will allow Blockpit to focus all their joint resources on developing a unified platform, deliver more features and offer a better customer experience, the CEO said, adding:</p><blockquote>“At the same time, Blockpit is doubling its revenue without increasing the cost — as we will shut down the Accointing infrastructure in the short term — massively increasing our cash flow.”</blockquote><p>The deal’s timing is also perfect, Wimmer said, referring to the upcoming regulations like the <a href=\"https://cointelegraph.com/news/council-of-europe-adopts-dac8-crypto-tax-reporting-rule\">Crypto-Asset Reporting Framework</a>, or CARF, and the crypto tax reporting rule known as the <a href=\"https://cointelegraph.com/news/council-of-europe-adopts-dac8-crypto-tax-reporting-rule\">Directive on Administrative Cooperation</a>, or DAC8.</p><p>“Starting 2026, all crypto asset service providers, including custodians, exchanges, brokerages and others, will be forced to report user Know Your Customer data alongside transaction data to tax authorities,” Wimmer noted. According to the exec, the upcoming regulations will “massively increase the enforcement and prosecution of tax fraudsters.”</p><p>Formally adopted in October 2023, DAC8 aims to grant tax collectors the jurisdiction to monitor and evaluate every cryptocurrency transaction carried out by individuals or entities within any other member state of the EU.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  }
]