[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T04:56:27.000Z",
    "title": "SEC Asked Coinbase to Stop Trading in all Cryptocurrencies Other Than Bitcoin Before Suing: Report",
    "url": "https://www.coindesk.com/policy/2023/07/31/sec-asked-coinbase-to-stop-trading-in-all-cryptocurrencies-other-than-bitcoin-before-suing-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The United States Securities and Exchange Commission (SEC) asked cryptocurrency exchange Coinbase to stop trading in all cryptocurrencies other than bitcoin (BTC) prior to suing the exchange, according to a report of the Financial Times."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T05:03:42.000Z",
    "title": "Australia's Bendigo Bank blocks high-risk payments to crypto exchanges",
    "url": "https://cointelegraph.com/news/bendigo-bank-crypto-blocks-pushes-australians-offshore-chainalysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/3b631064fa3b3b22ba83efd41db4b0fa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Chainalysis policy lead Chengyi Ong warned crypto users may eventually have no choice but to deal with offshore unregulated exchanges.</p>\n                    <p><p>Australia’s Bendigo Bank has become the fourth major bank in the country to announce blocks for “high-risk crypto payments,” citing the need to protect customers from investment scams.</p><p>The bank said on July 31 it implemented new rules on instant payments to crypto exchanges which adds “some friction to certain genuine payments,” explained its head of fraud Jason Gordon.</p><p>It cited combatting fraudulent payments and enhancing protections for its 2.3 million customers as reasons for the blocks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/08aff600-cd5d-4587-9362-9815637c75cf.PNG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of Bendigo Bank's warning about investment scams. Source: Bendigo Bank</em></figcaption></figure><p>A Bendigo Bank spokesperson told Cointelegraph that certain instant crypto transactions that it identifies as higher risk will be blocked, but the bank is not disclosing further details at this time. </p><p>The spokesperson said it identifies high-risk transactions by employing “a combination of factors” but refused to comment on specifics. The bank said it was not disclosing what exchanges may be affected by its changes.</p><p>Bendigo Bank’s blocks follow similar actions in recent months from three of Australia’s Big Four banks — <a href=\"https://cointelegraph.com/news/commonwealth-bank-decline-limit-payments-to-high-risk-crypto-exchanges\">Commonwealth Bank</a>, <a href=\"https://cointelegraph.com/news/crypto-national-australia-bank-joins-crypto-exchange-boycott-cites-scams\">National Australia Bank</a> (NAB) and <a href=\"https://cointelegraph.com/news/australian-big-4-bank-begins-trial-for-cryptocurrency-payment-blocks\">Westpac</a>.</p><p>In an interview conducted before the recent Bendigo Bank announcement, Chainalysis’ APAC Policy Head Chengyi Ong warned that such actions will force Australia’s crypto public to interact with offshore exchanges. </p><p>Speaking to Cointelegraph, Ong argued that such blocks won’t stop criminal actors from using other platforms, crypto or not, while uncertainty over banking access could also drive crypto exchanges and users outside the jurisdiction of authorities.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/heartland-tri-state-closed-by-fdic-as-banking-crisis-deepens\"><strong><em>Kansas Heartland Tri-State Bank closed by FDIC as banking crisis deepens</em></strong></a></p><p>Instead of cutting off exchanges, Ong says banks — alongside regulators, telecommunication providers and social media platforms — need to cooperate at every point of the scam lifecycle.</p><blockquote>“[We need to target] all the potential attack vectors and all the potential points of interaction between a victim and a scammer. We have to tackle every single one of those touchpoints.”</blockquote><p>Dr. Aaron Lane, Senior Lecturer with the RMIT Blockchain Innovation Hub told Cointelegraph the “best thing” banks can do for consumer protection is to constructively work with exchanges, adding:</p><blockquote>\"Debanking as a risk tool should be reserved for individual cases of serious and unacceptable risk, not a general posture towards an entire industry or asset class.\" </blockquote><p>Australia has been <a href=\"https://cointelegraph.com/news/blockchain-australia-new-ceo-takes-aim-regulation-by-enforcement-united-states\">weighing crypto-specific laws</a> for over three years, and Dr. Lane urged lawmakers to take crypto law reform “out of the too-hard basket.”</p><p>Ong’s and Dr. Lane’s comments follow an <a href=\"https://cointelegraph.com/news/crypto-debanking-could-drive-industry-underground-australia-treasury\">official statement</a> from the Department of the Treasury in June that included similar warnings.</p><p>The Treasury said it understands its inaction on debanking will stifle financial services competition and innovation and could “drive businesses underground and to operate exclusively in cash.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><p class=\"post-content__disclaimer\">Additional reporting by Brayden Lindrea.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T05:01:14.000Z",
    "title": "OPNX launches Justice Tokens for Terra whistleblower victims",
    "url": "https://www.cryptopolitan.com/opnx-launches-justice-tokens-for-terra-whistleblower-victims/",
    "description": "Open Exchange (OPNX), a derivatives and bankruptcy claim trading platform established by Three Arrows Capital founders Su Zhu and Kyle Davies, has announced the creation of FatManTerra Justice Tokens. These tokens are designed to compensate those who have been negatively affected by defamation in the cryptocurrency space. The first batch of these tokens is intended ... <a title=\"OPNX launches Justice Tokens for Terra whistleblower victims\" class=\"read-more\" href=\"https://www.cryptopolitan.com/opnx-launches-justice-tokens-for-terra-whistleblower-victims/\" aria-label=\"More on OPNX launches Justice Tokens for Terra whistleblower victims\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T04:51:16.000Z",
    "title": "AI in Central Banking? Twitterati Responds to El-Erian’s Proposal for Fed Review",
    "url": "https://www.cryptopolitan.com/ai-in-central-banking-proposal-fed-review/",
    "description": "Mohamed A. El-Erian, a renowned economist, has ignited a debate surrounding the Federal Reserve&#8217;s accountability and policy formation process. In a recent tweet, he suggested that the Federal Reserve perform a similar external assessment like the Bank of England. El-Erian&#8217;s call for greater transparency and accountability in central banking comes amid growing concerns over the ... <a title=\"AI in Central Banking? Twitterati Responds to El-Erian&#8217;s Proposal for Fed Review\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-central-banking-proposal-fed-review/\" aria-label=\"More on AI in Central Banking? Twitterati Responds to El-Erian&#8217;s Proposal for Fed Review\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T04:46:26.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T05:03:42.000Z",
    "title": "Dogecoin Price (DOGE) Breaking This Resistance Could Spark Fresh Surge",
    "url": "https://www.newsbtc.com/analysis/dogecoin-price-doge-surge-0-082/",
    "description": "Dogecoin is showing positive signs above the $0.075 resistance against the US Dollar. DOGE could extend its rally if it breaks the $0.0835 resistance zone. DOGE is currently trading in a bullish zone above $0.075 resistance against the US dollar. The price is trading well above the $0.0765 zone and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support near $0.0760 on the 4-hours chart of the DOGE/USD pair (data source from Kraken). The price could start another increase if it clears $0.0820 and $0.0835. Dogecoin Price Remains In Uptrend In the last Dogecoin price prediction, we discussed how DOGE rallied over 10%. The price extended its increase above the $0.0820 resistance, outperforming Bitcoin and Ethereum. Finally, it tested the $0.0840 zone. A high was formed near $0.0837 and recently there was a downside correction. There was a minor decline below the $0.080 level. The price traded below the 23.6% Fib retracement level of the upward move from the $0.0695 swing low to the $0.0837 high. However, the bulls were active near the $0.0765 support. DOGE is trading well above the $0.0765 zone and the 100 simple moving average (4 hours). There is also a major bullish trend line forming with support near $0.0760 on the 4-hours chart of the DOGE/USD pair. Source: DOGEUSD on TradingView.com On the upside, the price is facing resistance near the $0.080 level. The first major resistance is near the $0.082 level. A close above the $0.082 resistance might send the price toward the $0.0835 resistance. The next major resistance is near $0.0855. Any more gains might send the price toward the $0.088 level. Are Dips Limited in DOGE? If DOGE’s price fails to gain pace above the $0.0820 level, it could continue to move down. Initial support on the downside is near the $0.0765 level. The next major support is near the $0.0760 level and the trend line. If there is a downside break below the $0.0760 support, the price could decline further. In the stated case, the price might decline toward the $0.070 level. Technical Indicators 4 Hours MACD – The MACD for DOGE/USD is now losing momentum in the bullish zone. 4 Hours RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.0765, $0.0760, and $0.072. Major Resistance Levels – $0.080, $0.082, and $0.0835."
  }
]