[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T12:00:00.000Z",
    "title": "Cubist, Led by Computer Science Professors, Releases Wallet-as-a-Service 'CubeSigner'",
    "url": "https://www.coindesk.com/tech/2023/11/01/cubist-led-by-computer-science-professors-releases-wallet-as-a-service-cubesigner/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "According to CEO Riad Wahby, who's an assistant professor of electrical and computer engineering at Carnegie Mellon, the new wallet will be \"a hundred times faster\" than competing products."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-01T12:00:02.000Z",
    "title": "ATP Tennis Tour Offers Customizable 2023 Finals Posters via NFT Drop",
    "url": "https://decrypt.co/203936/atp-offers-customizable-2023-tennis-finals-posters-nft-drop",
    "description": "Tennis tour ATP will sell NFT posters around the 2023 finals, with buyers able to customize the color scheme and receive a physical print."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T12:00:43.000Z",
    "title": "Vitalik Buterin says Ethereum layer-2 solutions will become more diverse and specialized",
    "url": "https://cryptoslate.com/vitalik-buterin-says-ethereum-layer-2-solutions-will-become-more-diverse-and-specialized/",
    "description": "<p>The Ethereum layer-2 ecosystem continues to expand and diversify, according to Ethereum co-founder Vitalik Buterin in a recent blog post. As new scaling solutions emerge, Buterin predicts increasing heterogeneity in layer 2 designs based on specific security and cost tradeoffs. Rollups, validiums, sidechains, and other layer-2 constructions offer different balances between decentralization, security, and scalability. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/vitalik-buterin-says-ethereum-layer-2-solutions-will-become-more-diverse-and-specialized/\">Vitalik Buterin says Ethereum layer-2 solutions will become more diverse and specialized</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-01T12:00:26.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: Market Holds Its Breath for Fed’s Upcoming Policy Decision ",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-market-holds-its-breath-for-feds-upcoming-policy-decision/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/chanmdkddjjsdjj.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As November 2023 unfolds, the crypto economy is buzzing with market activity, showcasing a striking performance from bitcoin (BTC) alongside a steady progression from ethereum (ETH). Crypto markets are calm and consolidated at the moment, as market observers and traders wait for the news stemming from the Federal Open Market Committee (FOMC) policy announcement. Bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T12:01:54.000Z",
    "title": "Taiwan cracks largest USDT money laundering scheme",
    "url": "https://www.cryptopolitan.com/taiwan-cracks-largest-usdt-money-laundering/",
    "description": "Taichung, Taiwan &#8211; In a significant development, Taiwanese police have successfully dismantled what appears to be the nation&#8217;s largest crypto-related money laundering operation. The operation involved a staggering 324.2 million USDT and was linked to an investment fraud case that came to light. The case has shed light on the intricate web of cryptocurrency-based illicit ... <a title=\"Taiwan cracks largest USDT money laundering scheme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/taiwan-cracks-largest-usdt-money-laundering/\" aria-label=\"More on Taiwan cracks largest USDT money laundering scheme\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T12:01:10.000Z",
    "title": "Crypto Regulations in France: Assimilating the Digital Financial Wave Within Legal Compliance",
    "url": "https://www.cryptopolitan.com/crypto-regulations-in-france-assimilating/",
    "description": "The digital revolution ushered in by cryptocurrencies represents a new chapter in finance. Bitcoin and other digital currencies have sparked a global shift, touching various sectors, including the innovative financial landscape in France. As a nation celebrated for contributing to economic thought and robust financial institutions, crypto regulations in France are tailor-fitted to assimilate this ... <a title=\"Crypto Regulations in France: Assimilating the Digital Financial Wave Within Legal Compliance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-regulations-in-france-assimilating/\" aria-label=\"More on Crypto Regulations in France: Assimilating the Digital Financial Wave Within Legal Compliance\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T11:53:16.000Z",
    "title": "Decentralized IDs: a paradigm shift or a double-edged sword?",
    "url": "https://crypto.news/decentralized-ids-a-paradigm-shift-or-a-double-edged-sword/",
    "description": "Decentralized identities (DIDs) are at the forefront of online security and privacy solutions for the web3 scene, according to various industry leaders. However, their benefits come hand in hand with significant drawbacks."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T11:42:45.000Z",
    "title": "BitTorrent price plunges as volatility skyrockets",
    "url": "https://crypto.news/bittorrent-price-plunges-as-volatility-skyrockets/",
    "description": "The BitTorrent (BTT) price has been constantly declining since January 2022 but has risen to an 11-week high on Oct. 31 when the platform announced a renewed product.  BitTorrent announced the BitTorrent Web PRO on Oct. 31 on X (formerly&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T12:00:49.000Z",
    "title": "Solana (SOL) Breaks Multi-Month Trend As Firedancer Hits Testnet",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-breaks-multi-month-trend-firedancer-testnet/",
    "description": "The Solana price is currently experiencing a breathtaking rally. Since marking a bottom below $8 on December 29, the SOL price has risen more than 395%. And news from the Solana Breakpoint conference, which is currently being held in Amsterdam from October 30 to November 3, 2023, further fueled the price yesterday. In the last 24 hours, the price has risen 7.5%, and a whopping 23% in the last seven days. Firedancer Launched On Solana Testnet Central to the current excitement is the launch of Firedancer on Solana&#8217;s testnet. This new validator client, designed for the Solana blockchain, promises to significantly improve the scalability of the network, diminish latency times, and overall enhance network performance. The brain behind Firedancer Solana is Jump Crypto, a division of the Jump Trading Group, dedicated to pioneering solutions in the blockchain space. Their vision for Firedancer is comprehensive. It is designed to refine the Solana network across all tiers, starting from its foundational consensus mechanism to its broadest performance metrics. Ultimately, Firedancer aims to scale Solana to one million transactions per second (TPS). Related Reading: Solana Flying, Bulls Reverse Post-FTX Collapse Losses But SOL Analysts Cautious Highlighting the criticality of Firedancer to the future roadmap of Solana, Dan Albert, Executive Director of the Solana Foundation, proclaimed during his live stage appearance at the conference, &#8220;These guys have been hustling hard. Really did a lot of work, working around the clock in the last couple of weeks and I am really excited to announce that right now the first version of Firedancer is live on testnet.&#8221; 🔥💃 The first version of @jump_firedancer 🔥💃 Live on testnet. 🔥💃 Right now. Watch @DanPaul000 share the news live on the @SolanaConf stage. Only at #Breakpoint2023. Watch the livestream: https://t.co/51G659GtUO pic.twitter.com/llaHoiendH — Solana (@solana) October 31, 2023 Validating this enthusiasm, Raoul Pal, CEO and co-founder of Real Vision Group and former Goldman Sachs executive, expressed his bullish outlook, stating: Firedancer is a VERY big deal, not just for Solana but for blockchain technology overall. It is a quantum leap in speed (10x faster than the fastest blockchain today) whilst increasing security and robustness of the Solana Virtual Machine [SVM]. We&#8217;re eagerly awaiting its migration to Mainnet in the summer of 2024. Pal further encapsulated the potential of Solana and Firedancer in a recent conversation with Scott Melker. He opined, “I’ve been observing the charts, particularly Solana versus ETH (SOL/ETH) and Solana versus Bitcoin (SOL/BTC), and it unmistakably resembles a rocket ship in its ascent. It&#8217;s truly astonishing.&#8221; Related Reading: FTX Transfers $150M In Assets, Including Ethereum And Solana, Amid Bankruptcy SOL Price Breaks Multi-Month Trend However, in the midst of this euphoria, some analysts urge caution. With SOL&#8217;s price surging to touch a 1-year high of $39.88 yesterday, analyst Pentoshi offered a sobering perspective, noting, “SOL takes out these equal highs at the top of the range and in the next couple weeks likely a chance to refuel at the mid-range at $32.xx.&#8221; In addition, the 1-day chart shows that SOL broke out of an ascending trend channel (black) in a very bullish manner. SOL rose yesterday above the late October high of $38.78, which the price marked just before it plummeted in the wake of FTX&#8217;s collapse, losing more than 68% in four days. The next few days will be all about closing above $38.78 for the SOL bulls. If this succeeds, the Fibonacci extension level of 1.618 at $57.85 could be the next major target. Otherwise, a correction toward the 0.786 Fibonacci retracement level at $32.18 could be in the cards. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T11:53:00.000Z",
    "title": "XRP’s Whale Activity Reaches New Highs After Its Price Hit $0.6",
    "url": "https://coinedition.com/xrps-whale-activity-reaches-new-highs-after-its-price-hit-0-6/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/30400000_XRP_14317998_USD_transferred_from_Bitso_to_unknown-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On-chain activity has surged for Ripple (XRP) after the altcoin’s price rose to $0.6 for the first time since its tumble back in August of this year, according to an X post shared by the market intelligence platform Santiment, earlier today. The platform’s data also indicated that XRP whale activity has been steadily increasing as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrps-whale-activity-reaches-new-highs-after-its-price-hit-0-6/\">XRP’s Whale Activity Reaches New Highs After Its Price Hit $0.6</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-01T11:45:02.000Z",
    "title": "Ethereum (ETH) Rival Cardano (ADA) Hits On-Chain Milestone As Old Wallets Start To Move: Santiment",
    "url": "https://dailyhodl.com/2023/11/01/ethereum-eth-rival-cardano-ada-hits-on-chain-milestone-as-old-wallets-start-to-move-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Dormant-Wallet-From-ICO.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from market intelligence firm Santiment shows that Ethereum (ETH) competitor Cardano (ADA) just hit a major milestone. In a new post on the social media platform X, the crypto analytics firm says that long-time ADA holders have suddenly started moving the largest amount of tokens in more than a year. The firm also [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/01/ethereum-eth-rival-cardano-ada-hits-on-chain-milestone-as-old-wallets-start-to-move-santiment/\">Ethereum (ETH) Rival Cardano (ADA) Hits On-Chain Milestone As Old Wallets Start To Move: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]