[
  {
    "source": "CoinDesk",
    "date": "2023-09-11T21:14:12.000Z",
    "title": "Trading Firms Deposit Millions in BTC, ETH and ARB to Exchanges as Crypto Sell-Off Intensifies",
    "url": "https://www.coindesk.com/markets/2023/09/11/trading-firms-deposit-millions-in-btc-eth-and-arb-to-exchanges-as-crypto-sell-off-intensifies/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto markets dropped sharply on Monday, with bitcoin’s price dipping below $25,000."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-11T21:26:19.000Z",
    "title": "Bitfinex and Tether CTO Paolo Ardoino to Testify in Market Manipulation Lawsuit",
    "url": "https://decrypt.co/155935/bitfinex-tether-cto-paolo-ardoino-market-manipulation-lawsuit",
    "description": "Ardoino will be deposed this week after the court denied his counsel’s request for more time to prepare."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T21:30:00.000Z",
    "title": "How senators plan on regulating AI: Law Decoded, Sept. 4–11 ",
    "url": "https://cointelegraph.com/news/how-senators-plan-on-regulating-ai-law-decoded-sept-4-11",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6ec23bb7-e44e-4e37-a3ba-e528fdb82eb4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Senators Richard Blumenthal and Josh Hawley's framework emphasizes that technology companies cannot rely on liability protections to shield them from legal actions.</p>\n                    <p><p>Last week, two United States senators <a href=\"https://cointelegraph.com/news/senators-unveil-bipartisan-blueprint-for-comprehensive-ai-regulation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/senators-unveil-bipartisan-blueprint-for-comprehensive-ai-regulation/amp\">unveiled a bipartisan blueprint for artificial intelligence (AI) legislation</a>. The framework put forward by Senators Richard Blumenthal and Josh Hawley advocates for mandatory licensing for AI firms and makes it clear that technology liability protections will not shield these companies from legal action.</p><p>The framework proposes creating a licensing system overseen by an independent regulatory body. It mandates that AI model developers register with this oversight entity, which would possess the authority to conduct audits of these licensing applicants. It also suggests that Congress should make it explicit that Section 230 of the Communications Decency Act, which provides legal protections to tech firms for third-party content, does not extend to AI applications. </p><p>Blumenthal and Hawley, who lead the Senate Judiciary Subcommittee on Privacy, Technology and Law, have also revealed plans for a hearing. This hearing will include testimony from prominent figures, such as Brad Smith, vice chairman and president of Microsoft; William Dally, chief scientist and senior vice president of research at Nvidia; and Woodrow Hartzog, professor at Boston University School of Law.</p><p>A previous attempt to start the regulatory dialogue on AI was made by Senate Majority Leader Chuck Schumer, who also <a href=\"https://cointelegraph.com/news/senator-schumer-calls-for-comprehensive-ai-legislation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/senator-schumer-calls-for-comprehensive-ai-legislation/amp\">introduced an AI framework in June</a>. His framework outlined an extensive range of fundamental principles, as opposed to the more detailed measures proposed by Hawley and Blumenthal.</p><h3>Australian lawmakers reject crypto bill</h3><p>Australia’s Senate Committee on Economics Legislation has provided feedback on the cryptocurrency bill introduced by Senator Andrew Bragg. It recommended that the Senate not pass the bill and that the government continue to research the topic instead. Senator Bragg <a href=\"https://cointelegraph.com/news/australian-senator-introduces-private-bill-to-expedite-crypto-regulation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/australian-senator-introduces-private-bill-to-expedite-crypto-regulation/amp\">introduced the Digital Assets (Market Regulation) Bill 2023</a> in March, aiming to “protect consumers and promote investors.” The draft bill provides regulatory recommendations for stablecoins, licensing of exchanges, and custody requirements.</p><p><a href=\"https://cointelegraph.com/news/crypto-australian-lawmakers-send-back-crypto-bill-by-andrew-bragg\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-australian-lawmakers-send-back-crypto-bill-by-andrew-bragg/amp\">Continue reading</a> </p><h3>China shut down 80 crypto influencers’ accounts</h3><p>Sina Weibo, one of the most popular Chinese social media apps with over 258 million daily active users, has removed 80 influencer accounts promoting cryptocurrency activities. The accounts with over 8 million total followers were accused of breaching eight regulations related to telecommunications, finance, banking, online marketing, securities, exchanges and internet safety for their role in promoting cryptocurrencies. Starting this year, China has been cracking down on private crypto-related activities due to a combination of capital flight, money laundering and the need to preserve its state-run crypto efforts.</p><p><a href=\"https://cointelegraph.com/news/80-chinese-crypto-influencer-accounts-shut-down-latest-crackdown\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/80-chinese-crypto-influencer-accounts-shut-down-latest-crackdown/amp\">Continue reading</a></p><h3>Taiwan will restrict unregistered foreign crypto exchanges</h3><p>Taiwan is reportedly planning to put restrictions on unregistered overseas crypto exchanges operating within its jurisdiction as part of its incoming guidance for virtual asset service providers (VASPs). The draft guidelines include enhancing information disclosure and require operators to set standards for reviewing listings and delistings. In addition, they also require separate custody of customer and platform assets and specify that VASPs should implement ways to prevent money laundering.</p><p>Among the 10 principles set by the FSC is a rule prohibiting foreign VASPs from illegally soliciting business in Taiwan. The FSC proposed that overseas crypto platforms that do not have a company registration in Taiwan and do not comply with its Anti-Money Laundering laws should not solicit business in Taiwan or from its citizens.</p><p><a href=\"https://cointelegraph.com/news/taiwan-restricts-unregistered-overseas-crypto-exchanges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/taiwan-restricts-unregistered-overseas-crypto-exchanges/amp\">Continue reading</a> </p>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T21:23:39.000Z",
    "title": "Arbitrum (ARB) falls to all-time low as network usage metrics decline ",
    "url": "https://cointelegraph.com/news/arbitrum-arb-falls-to-all-time-low-network-usage-metrics-decline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3a9f0aeb-d47f-47ee-aa5f-1b0d36d74d2b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ARB price slumps to a new low as a decline in TVL, active addresses engaging with its DApps and a general malaise across the crypto market take their toll. </p>\n                    <p><p>Arbitrum (ARB) has emerged as a leading contender within the Ethereum network's layer-2 scalability solutions, boasting a significant total value locked (TVL) and notable activity. However, between Sept. 9 and Sept. 11, the price of ARB tokens experienced a sharp decline of 14.5%, marking its lowest point in history.</p><p>Investors are now eagerly seeking insight into the factors driving this movement and questioning whether Arbitrum still possesses the competitive edge, especially considering that irrespective of ARB token performance, the network TVL exceeds $1.6 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/dd3a8280-6448-43cd-80fe-c5f333d66ae5.png\"  /><figcaption style=\"text-align: center;\"><em>Arbitrum (ARB) vs. competitors Polygon (MATIC), Optimism (OP), Loopring (LRC). Source: TradingView</em></figcaption></figure><p>It is worth noting that the past week has been challenging for most cryptocurrencies but among Ethereum's scaling solutions, none experienced a drop exceeding 9%, except for Arbitrum.</p><h2>ARB governance proposals bring questionable benefits</h2><p>One potential source of concern stems from the<a href=\"https://cointelegraph.com/news/arbitrums-fraud-proofs-havent-been-used-since-it-launched\"> absence of any instances of fraud proof issuance</a> since the launch of the Arbitrum mainnet in August 2021. Offchain Labs confirmed this information to Cointelegraph on Sept. 4. Developers, however, have explained that this situation aligns with the intended operation of the system, as validators with malicious intentions risk losing their entire stake. Consequently, this data is unlikely to have significantly impacted the price in the past week.</p><p>Additional factors that may help elucidate the recent price downturn are associated with governance proposals. The first proposal, posted on Sept. 2, aims to <a href=\"https://forum.arbitrum.foundation/t/arbitrums-short-term-incentive-program-arbitrum-improvement-proposal/16131\" target=\"_blank\" rel=\"noopener nofollow\">allocate</a> up to 75 million ARB tokens from the project's treasury to address \"short-term community needs\" for active decentralized applications (dApps) within the ecosystem. However, even if approved, this allocation represents less than 2% of the DAO treasury holdings and is unlikely to have triggered the ARB token price correction, regardless of one's stance on the proposal.</p><p>Another governance proposal that has garnered attention was introduced on September 9th by PlutusDAO. This proposal seeks to return tokens from the DAO treasury to ARB holders through the activation of a <a href=\"https://forum.arbitrum.foundation/t/request-for-comment-proposal-to-activate-arb-staking/16240\" target=\"_blank\" rel=\"noopener nofollow\">staking</a> mechanism, creating a native yield for participants, which could involve up to 2% of the total supply annually. Nevertheless, some investors view this inflationary approach as unnecessary and argue that it only exerts downward pressure on prices.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">im not a VC so i&#39;d &quot;benefit&quot; from this but..<br><br>dilution through inflation would be a PVP proposal, instead of trying to bring more value into the ecosystem it extracts it from other ARB holders   <br><br>Arbitrum is in a good position all round, one of the most popular chains, huge… <a href=\"https://t.co/IDpcdQfQHT\">https://t.co/IDpcdQfQHT</a></p>&mdash; PSY (@PSYTWEAK) <a href=\"https://twitter.com/PSYTWEAK/status/1700882185983512958?ref_src=twsrc%5Etfw\">September 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As user Psytweak highlighted on the X (formerly Twitter) social network, \"dilution through inflation\" does not contribute positively to the ecosystem, as it merely distributes DAO treasury holdings.</p><p>Beyond token governance, there are also concerns related to liquidation risks on both centralized and decentralized exchanges that offer leveraged trading. For instance, Lookonchain has observed a whale withdrawing ARB tokens from the Aave lending platform and transferring some to Binance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A whale who is long <a href=\"https://twitter.com/search?q=%24ARB&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ARB</a> on <a href=\"https://twitter.com/hashtag/Aave?src=hash&amp;ref_src=twsrc%5Etfw\">#Aave</a> is selling <a href=\"https://twitter.com/search?q=%24ARB&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ARB</a> to repay the debt.<br><br>Over the past 5 hours, the whale has withdrawn 5M <a href=\"https://twitter.com/search?q=%24ARB&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ARB</a> ($3.85M) from <a href=\"https://twitter.com/hashtag/Aave?src=hash&amp;ref_src=twsrc%5Etfw\">#Aave</a> and deposited 3.8M <a href=\"https://twitter.com/search?q=%24ARB&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ARB</a> ($2.93M) to <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a>.<br><br>And the whale currently holds 8M <a href=\"https://twitter.com/search?q=%24ARB&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ARB</a> ($6.16M).<a href=\"https://t.co/HpuZnHbap4\">https://t.co/HpuZnHbap4</a> <a href=\"https://t.co/qduKeWC4ul\">pic.twitter.com/qduKeWC4ul</a></p>&mdash; Lookonchain (@lookonchain) <a href=\"https://twitter.com/lookonchain/status/1701299947533115788?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The challenge with this analysis lies in the ambiguity of cause and effect. Typically, leverage long positions are compelled to close when token prices have already fallen, rather than the reverse. This underscores the importance of investors examining Arbitrum's activity and deposit trends over the past couple of months, which could have potentially triggered the recent price performance.</p><h2>Declining network activity is most likely the culprit</h2><p>Arbitrum's TVL has notably declined to $1.67 billion, marking its lowest level since mid-February.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b8a0f065-621f-4985-aab8-98bd6507a357.png\"  /><figcaption style=\"text-align: center;\"><em>Arbitrum network total value locked, USD. Source: DefiLlama</em></figcaption></figure><p>This 25% decrease over the past two months raises several concerns, primarily indicating a loss of investor confidence. This downturn has the potential to reduce liquidity and undermine the project's overall viability. Furthermore, it might deter new participants, impeding network growth and adoption. </p><p>Next, it's crucial to examine the number of active addresses within the network's top dApps.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/84a30e64-fcc4-4484-bba7-1160776cba4d.png\"  /><figcaption style=\"text-align: center;\"><em>Arbitrum network top decentralized applications by active addresses. Source: DappRadar</em></figcaption></figure><p>There is a noticeable decline in 30-day active addresses, even among well-established dApps like Uniswap, 1inch, Radiant, SushiSwap, and GMX. Therefore, when considering the decrease in TVL alongside reduced user activity, it becomes evident that there is a substantial decline in demand for the network. While pinpointing a singular cause for this movement is challenging, one can speculate that competing chains such as <a href=\"https://cointelegraph.com/news/zk-sync-launches-stark-based-proof-system\">zKsync Era</a> and <a href=\"https://cointelegraph.com/news/coinbase-base-daily-active-users-reaches-high\">Coinbase’s Base</a> may have contributed.</p><p>The data suggests that Arbitrum's 14.5% correction appears to result from a combination of investor dissatisfaction with the governance mechanism and the network's lackluster activity, despite offering significantly lower fees compared to Ethereum. Unless there is an upswing in transactions and an expansion of its user base, it is unlikely that ARB will be able to close the price performance gap with its competitors.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T21:16:37.000Z",
    "title": "Grayscale BTC discount narrows after the SEC court victory",
    "url": "https://www.cryptopolitan.com/grayscale-btc-discount-narrows-sec-victory/",
    "description": "Grayscale’s Bitcoin Investment vehicle (GBTC) share prices close against the Bitcoin price, now trading 17% below the BTC price. The discount between BTC and GBTC has dropped to its lowest since December 2021. Grayscale currently holds $17.10 billion worth of BTC. This follows a recent win by Grayscale against the Security Exchange Commission(SEC). In its ... <a title=\"Grayscale BTC discount narrows after the SEC court victory\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-btc-discount-narrows-sec-victory/\" aria-label=\"More on Grayscale BTC discount narrows after the SEC court victory\">Read more</a>"
  }
]