[
  {
    "source": "CoinDesk",
    "date": "2023-10-13T18:24:58.000Z",
    "title": "Ethereum's New Low-Fee Regime May Put Its 'Ultra Sound Money' Thesis to Test",
    "url": "https://www.coindesk.com/markets/2023/10/13/ethereum-new-low-fee-regime-may-put-its-ultra-sound-money-thesis-to-test/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Ethereum network's revenue from fees dropped to its lowest level since April 2020 as speculative activity disappeared and users migrated to layer 2s, IntoTheBlock said."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-13T18:30:29.000Z",
    "title": "Stablecoin Market Navigates Shifting Sands as Tether Announces New CEO and USDR Depegs",
    "url": "https://news.bitcoin.com/stablecoin-market-navigates-shifting-sands-as-tether-announces-new-ceo-and-usdr-depegs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stablecoin Market Navigates Shifting Sands as Tether Announces New CEO and USDR Depegs\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dolla.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The stablecoin landscape has been stagnant for the last two months, barely exceeding $123 billion as we approach the third week of October. Even though fiat-pegged token trading saw a spike this week, on October 13, stablecoin transactions made up 22.96% of the global crypto economy&#x2019;s trade volume. Just a day earlier, they constituted 74% [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T18:32:00.000Z",
    "title": "ProShares unveils Ethereum short futures ETF launch",
    "url": "https://crypto.news/proshares-unveils-ethereum-short-futures-etf-launch/",
    "description": "James Seyffart, an ETF Research Analyst for Bloomberg Intelligence, reported that ProShares has announced the launch of a new short Ethereum Futures ETF."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T18:23:33.000Z",
    "title": "Friend.tech targeted by scammers in phishing ad campaign",
    "url": "https://crypto.news/friend-tech-targeted-by-scammers-in-phishing-ad-campaign/",
    "description": "A SlowMist investigation has exposed the manipulation of Google search results by phishing ads associated with Friend.tech, the decentralized social media platform."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T18:11:18.000Z",
    "title": "Bitcoin bearishness continues despite halving, ETF hopes: analyst",
    "url": "https://crypto.news/bitcoin-bearishness-continues-despite-halving-etf-hopes-analyst/",
    "description": "Popular cryptocurrency analyst Nicholas Merton — known as DataDash on YouTube — remains skeptical on Bitcoin's near-term prospects despite optimism around the upcoming halving and potential approval of a Bitcoin ETF."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T18:30:07.000Z",
    "title": "Man Makes A Fortune With $22 In Bitcoin: 3 Altcoins For October 2023 That Can Do This",
    "url": "https://www.newsbtc.com/altcoin/bitcoin-3-altcoins-october/",
    "description": "Bitcoin’s history is filled with stories of people who put small, disposable amounts of money into the crypto and ended up making a fortune. This has been no different from the case of one Norwegian man, whose throwaway $22 Bitcoin investment has turned into a life-changing sum. When Kristoffer Koch had originally invested in Bitcoin back in 2009, the cryptocurrency was only trading for a few cents. Koch, at the time, was intrigued which is why he said he made the purchase. He got 5,000 BTC for around $22 at the time, although this figure often varies. Nevertheless, Koch ended up forgetting about this purchase until four years later when Bitcoin had blown up. By the time the Norwegian man got into his Bitcoin wallet, his initial $22 purchase had ballooned into $850,000. Upon seeing the life-changing sum, Koch revealed that he had used part of the money to buy himself a flat in Oslo. Related Reading: US Mega Bank JPMorgan Predicts Harsh Drop In This Bitcoin Metric As stories like these continue to make the rounds, a question on the lips of investors, especially those who came in later than the likes of Koch, is which cryptocurrencies could replicate such growth. So here are some picks that look good. Fetch AI (FET) Brings AI To Crypto The AI narrative is still holding strong both within and outside the crypto market and this has positioned some projects to be able to take advantage of its expected growth. Fetch AI’s native FET token has already shown the opportunity that lies in this space but that was only in a bear market. A bull market could see FET’s price rise further and do numbers. The project is looking to democratize AI access through a crypto economy. This means users will be able to access AI in a completely decentralized and permissionless way unlike the AI products seen in traditional spheres. Secret (SCRT) Challenges Bitcoin With Privacy Presently, when the topic of privacy coins comes up, two names tend to pop up quickly, which include Monero’s XMR and Secret’s SCRT. Secret actually users ‘Secret Contracts’ to allow decentralized applications to offer completely private transactions. As the demand for privacy grows among crypto users who constantly have to be aware of the government’s encroachment, SCRT’s value proposition becomes even more important. Added to its low $51 million market cap, SCRT could see a rally similar to that of Bitcoin. Radiant Capital (RDNT) With Fragmented Liquidity When it comes to carrying out transactions on-chain, liquidity becomes king, and this is where Radiant Capital (RDNT) comes in. The project is looking to consolidate fragmented liquidity in a bid to enhance the available liquidity for decentralized finance (DeFi) protocols. Related Reading: Bitcoin Price Plunge: Long-Term Holders Buy $1.35 Billion Worth Of BTC This will work across a number of lending protocols regardless of the blockchain that they are on. So instead of hopping from one protocol to another, DeFi users can take advantage of this using a single protocol. Radiant’s value proposition in a sector that is continuously evolving and growing could see it put on a Bitcoin-like rally. This could see its market cap go from its current $70 million to billions of dollars. BTC price gearing up to retest $27,000 &#124; Source: BTCUSD on Tradingview.com Featured image from MARCA, chart from Tradingview.com"
  }
]