[
  {
    "source": "Cointelegraph",
    "date": "2023-10-01T06:47:28.000Z",
    "title": "DOJ readies witnesses in Bankman-Fried trial, spotlight on FTX assets",
    "url": "https://cointelegraph.com/news/doj-readies-witnesses-in-bankman-fried-trial-spotlight-on-ftx-assets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/831b0a83-8552-47bb-b214-a0b62fa5ead3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This initiative also encompasses their comprehension of Sam Bankman-Fried's remarks and conduct, particularly regarding FTX's asset management.</p>\n                    <p><p>The Department of Justice (DOJ) has affirmed its plan to summon former FTX clients, investors, and staff as witnesses in the upcoming trial involving Sam Bankman-Fried, the former FTX executive. This will shed light on how these individuals viewed their interactions with Bankman-Fried and his company. </p><p>The DOJ <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590939/gov.uscourts.nysd.590939.301.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">submitted</a> a letter motion in limine on Sept. 30, to enable them to get the interpretation of the witnesses on FTX’s treatment of customer assets, which will hold significant importance. </p><p>Importantly, these testimonies are intended to provide valuable perspectives on the interactions between the accused and these witnesses. This initiative also encompasses their comprehension of Bankman-Fried's remarks and conduct, particularly regarding FTX's asset management. The DOJ intends to emphasize the experiences of both retail and institutional clients who entrusted substantial assets to FTX with the belief that the platform would safeguard them securely.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7f5ac501-00f5-4498-b26e-d2300faffc05.JPG\"><figcaption style=\"text-align: center;\"><em>Court filing in the U.S. District Court for the Southern District of New York. Source: CourtListener</em></figcaption></figure><p>Furthermore, a distinctive situation has <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590939/gov.uscourts.nysd.590939.302.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">emerged</a> concerning one of the DOJ's witnesses, referred to as \"FTX Customer-1,\" who resides in Ukraine. Given the ongoing conflict, there are difficulties associated with traveling to the United States to provide testimony. Consequently, the DOJ has suggested using video conferencing as a viable alternative. However, Bankman-Fried's defense has not yet approved this proposal.</p><p>Nonetheless, the legal team representing Bankman-Fried, led by lawyer Mark Cohen, has <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyer-jury-questions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-lawyer-jury-questions/amp\">voiced concerns about the jury questions</a> put forth by the DOJ. According to Bankman-Fried’s defense, these interrogations insinuate guilt on Bankman-Fried's part, potentially undermining the principle of \"innocent until proven guilty.\"</p><p>Additionally, the defense contends that these inquiries may not effectively uncover the jurors' inherent biases, especially if related to their personal encounters with cryptocurrencies. Moreover, certain questions could inadvertently guide the jury's perspective instead of eliciting authentic insights, possibly compromising the trial's impartiality.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyer-jury-questions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-lawyer-jury-questions/amp\"><strong><em>Sam Bankman-Fried’s lawyer challenges US gov’t proposed jury questions</em></strong></a></p><p>With the jury selection scheduled to start on Oct. 3, closely followed by the trial, the spotlight is firmly on this high-stakes legal confrontation. This case underscores not only its immediate consequences but also underscores the vital importance of transparent communication and unbiased questioning in upholding the principles of justice.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-01T07:04:10.000Z",
    "title": "Top Trader Who Nailed 2022 Bitcoin Bottom Warns BTC and Altcoin Rallies Could Unwind Really Fast – Here’s Why",
    "url": "https://dailyhodl.com/2023/10/01/top-trader-who-nailed-2022-bitcoin-bottom-warns-btc-and-altcoin-rallies-could-unwind-really-fast-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-Market-Cap-Primed-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who rode the crypto breakout earlier this year is issuing a warning, saying that the latest Bitcoin (BTC) and altcoin rallies could abruptly reverse. In a new strategy session, analyst DonAlt tells his 53,400 YouTube subscribers that the crypto markets are likely rallying because traders are anticipating the approval of multiple Ethereum (ETH)-based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/01/top-trader-who-nailed-2022-bitcoin-bottom-warns-btc-and-altcoin-rallies-could-unwind-really-fast-heres-why/\">Top Trader Who Nailed 2022 Bitcoin Bottom Warns BTC and Altcoin Rallies Could Unwind Really Fast – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]