[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-11T18:48:12.000Z",
    "title": "$LINK: Why a Prominent Crypto Analyst Believes Chainlink Price  is Headed Toward $200",
    "url": "https://www.cryptoglobe.com/latest/2023/11/link-why-a-prominent-crypto-analyst-believes-chainlink-price-is-headed-toward-200/",
    "description": "In a recent YouTube video, the popular pseudonymous crypto analyst known as Chico Crypto explained why he believes Chainlink ($LINK) is on a trajectory toward a $200 valuation. He discussed Chainlink’s recent developments, potential partnerships, and its role in the evolving landscape of traditional finance and cryptocurrencies. Chainlink is a decentralized oracle network designed to […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-11T19:00:48.000Z",
    "title": "New All-Time Highs For Bitcoin In 2023? Analyst Shares Ultra Bullish Prediction",
    "url": "https://www.newsbtc.com/news/new-all-time-highs-for-bitcoin-in-2023-analyst-shares-ultra-bullish-prediction/",
    "description": "The flagship cryptocurrency, Bitcoin, is up by over 100% year-to-date (YTD). Despite these impressive gains, there is still reason to believe that the crypto token’s resurgence isn’t done, as there could still be new highs before the year runs out based on analysis from prominent figures in the community.  Bitcoin To Hit $69,000 This Year? In a post shared on his X (formerly Twitter) platform, prominent crypto analyst Dave the Wave suggested that Bitcoin could surge to its previous highs this last quarter of the year. Although he didn’t state what highs exactly, the accompanying chart he shared in the post showed that he was hinting at Bitcoin’s all-time high of about $69,000.  A run to previous #btc highs this last quarter is not unthinkable. pic.twitter.com/INesJPY9ov — dave the wave🌊🌓 (@davthewave) November 9, 2023 Related Reading: Polygon (MATIC) Poised For A Bullish Surge, Analyst Who Predicted 2021 Fall Says This isn’t the first time the crypto analyst has shared his belief that Bitcoin could hit $69,000 this year. In an earlier X post, he shared a similar chart, which put up a price target of $70,000 based on the speculation of “another mini-parabola frontrunning the halving.”  It is not unusual for the market to pump significantly, as historical data suggests. Bitcoin’s price has increased significantly before and after every halving event. Before the most recent halving event, which took place in 2020, BTC rose by over 17% in the weeks leading up to it and saw a further 559% increase after the event.  Bitcoin (BTC) is currently trading at $37.072. Chart: TradingView.com However, many might argue that an all-time high (ATH) before the halving event, which takes place in April 2024, seems like a far reach, especially if the analyst is projecting that the new high will occur before this year runs out.  Bitcoin To Hit New All-Time High Before April? While a new all-time high before the year runs out seems like a big task, some prominent figures have, however, backed the crypto token to hit a new ATH before April. One of them happens to be Bitcoin OG and founder of Blockstream, Adam Back. Interestingly, Back predicted (back in August) that BTC will hit or even surpass $100,000 before March 31st, 2024.  To show how confident he was of his assertion, the crypto founder went as far as placing a bet with another X user who disagreed with his position. They both agreed to wager a bet of 1 million satoshis, with the winner (depending on Bitcoin’s price by March 31, 2024) taking all.  Related Reading: Solana Breaks Past $54 On Steady Price Momentum – Will SOL Hit $60 This Month? The CEO of Jan3 and a fellow Bitcoiner, Samson Mow, had also agreed with Back in some way, as he believes that Bitcoin will also hit a new ATH pre-halving and not post. However, unlike Back, he didn’t mention any price target. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-11T18:44:06.000Z",
    "title": "Ripple (XRP) Gears Up for Market Twists Amidst Investor Watch",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-gears-up-for-market-twists-amidst-investor-watch/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-gears-up-for-market-twists-amidst-investor-watch",
    "description": "<img width=\"512\" height=\"473\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-30.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-30.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-30-300x277.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple (XRP) experiences a 7% weekly gain, with historical data suggesting November as a favorable month for the asset. Significant whale activity observed in the XRP ecosystem, indicating potential shifts in market dynamics. Ripple&#8217;s Promising November Trajectory In the constantly evolving world of cryptocurrency, Ripple (XRP) stands out with its recent 7% gain in a [...]"
  }
]