[
  {
    "source": "CoinDesk",
    "date": "2024-02-27T21:57:30.000Z",
    "title": "Why the ENS Battle Over Eth.Link Matters",
    "url": "https://www.coindesk.com/consensus-magazine/2024/02/27/why-the-ens-battle-over-ethlink-matters/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The critical piece of infrastructure serves as a bridge between Web3 and the wider web and symbol for the limits of decentralization."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-27T22:01:02.000Z",
    "title": "Other Page Brings Enhanced Web3 Profiles to Magic Eden NFT Marketplace",
    "url": "https://decrypt.co/219028/other-page-brings-forever-profiles-to-nft-marketplace-magic-eden",
    "description": "The partnership will enable Magic Eden users to “flex the lore and legacy” of their avatars and digital assets through Other Page."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-27T21:44:01.000Z",
    "title": "The Entire Luxury Industry Is About to Embrace Crypto, Says Aura CEO",
    "url": "https://decrypt.co/219314/entire-luxury-industry-embrace-crypto-aura-ceo",
    "description": "Luxury brands, in part thanks to a new EU law, are set to embrace on-chain digital passports connected to their products. The Aura Blockchain Consortium is leading that charge."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-27T21:50:24.000Z",
    "title": " IMF urges careful design, slow introduction for Pacific Island digital currencies ",
    "url": "https://cointelegraph.com/news/imf-urges-careful-design-slow-introduction-pacific-island-digital-currencies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmI0ODQwYmQtZWRkMC00YzQ5LTkzYjktOWJjMTI4NzM3NjJjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The island nations have common challenges and widely varying conditions. Just don’t use crypto, the IMF says. </p>\n                    <p><p>Conditions in Pacific Island countries (PICs) create unique currency needs. Digital currencies are up to the task of meeting those needs, with the right design features, the International Monetary Fund (IMF) <a href=\"https://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2024/02/21/Rise-of-Digital-Money-Implications-for-Pacific-Island-Countries-543239\" target=\"_blank\" rel=\"noopener nofollow\">found</a> in a new paper. At the same time, it warned against the use of unbacked cryptocurrencies as national currency.</p><p>PICs are tiny, diverse and geographically isolated markets with particular servicing and inclusion challenges, such as a high dependence on remittances and vulnerability to reduced correspondent bank services. They are also liable to run afoul of international Anti-Money Laundering efforts because of poor controls. </p><p>PICs differ by the development of local payment systems and whether they have their own fiat currency, among other things. Some PICs have no local financial infrastructure at all. </p><p><a href=\"https://cointelegraph.com/news/imf-urges-careful-design-slow-introduction-pacific-island-digital-currencies\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-27T22:00:41.000Z",
    "title": "Bitfinex hacker testifies in Bitcoin Fog trial as government witness",
    "url": "https://cryptoslate.com/bitfinex-hacker-testifies-in-bitcoin-fog-trial-as-government-witness/",
    "description": "<p>Convicted Bitfinex hacker Ilya Lichtenstein has become a key government witness in a jury trial involving the alleged operator of crypto mixer Bitcoin Fog Roman Sterlingov, Bloomberg News reported on Feb. 27. US prosecutors arrested and charged Sterlingov in April 2021 over allegations that the mixer helped launder 1.2 million BTC — worth $335 million [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitfinex-hacker-testifies-in-bitcoin-fog-trial-as-government-witness/\">Bitfinex hacker testifies in Bitcoin Fog trial as government witness</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T21:50:17.000Z",
    "title": "Central Bank of Nigeria raises interest rate—here’s why",
    "url": "https://www.cryptopolitan.com/central-bank-of-nigeria-raises-interest-rate/",
    "description": "The Central Bank of Nigeria (CBN) has announced an increase in the interest rate to 22.75%. This adjustment was disclosed following the conclusion of the Monetary Policy Committee (MPC) meeting, which spanned two days. The session, which took place between Monday and Tuesday, aimed at reviewing the nation&#8217;s economic landscape and implementing measures to stabilize [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-27T22:00:00.000Z",
    "title": "Bitcoin and Chainlink investors monitoring Kelexo",
    "url": "https://crypto.news/bitcoin-and-chainlink-investors-monitoring-kelexo/",
    "description": "Kelexo is attracting interest from Bitcoin and Chainlink investors. In stage 2 of the presale, KLXO is trading for $0.028"
  }
]