[
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T06:30:00.000Z",
    "title": "Mark Cuban takes on SEC, John Reed Stark and ‘crypto derangement syndrome’",
    "url": "https://cointelegraph.com/news/mark-cuban-sec-john-reed-stark-crypto-derangement-syndrome",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d4c83f1a-0b8f-423e-a4c7-81882ac7432c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The billionaire investor got stuck into a heated debate with former SEC official John Reed Stark over crypto regulation.</p>\n                    <p><p>Crypto Twitter was witness to a fierce debate this wee, with billionaire investor Mark Cuban accusing SEC’s Gary Gensler of throwing crypto under the bus while a former SEC official was quick to come to the regulator’s defense.</p><p>In a spirited, back-and-forth exchange on Twitter with former SEC officer John Reed Stark that started on June 14, Cuban took issue with Stark’s seeming defense of the SEC’s recent <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">legal action</a> against crypto exchange giant Binance. </p><p>Cuban accused Stark of misinterpreting the impact of the case and blamed SEC Chair Gary Gensler’s “regulation via litigation” approach for sabotaging crypto startups. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">John. I think you are misreading the impact of what the judge said.  It’s not related to this suit.  <br><br>Not all crypto businesses that have tokens or are considering using tokens are large “enterprises”. Which is the assumption, I believe you are making.  (Correct me if I’m wrong…</p>&mdash; Mark Cuban (@mcuban) <a href=\"https://twitter.com/mcuban/status/1669081002063585285?ref_src=twsrc%5Etfw\">June 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Stark had earlier argued that crypto-related businesses should be treated as “large enterprises” by regulators. However, Cuban argued that many crypto businesses are small and shouldn't be told to “hire securities lawyers” just to get a start in the industry. </p><p>Stark also reiterated his support for the <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-the-sec\">SEC’s actions against Binance</a>, noting that the industry remains largely unregulated and that the move will eliminate “bad actors” and promote <a href=\"https://www.fxstreet.com/cryptocurrencies/news/solana-blockchain-spurs-carbon-footprint-transparency-with-emissions-dashboard-launch-202304212350\" target=\"_blank\" rel=\"noopener nofollow\">transparency</a>.</p><p>From there, the debate <a href=\"https://twitter.com/JohnReedStark/status/1669140123378671619\" target=\"_blank\" rel=\"noopener nofollow\">pivoted</a> to a discussion on how best to regulate cryptocurrencies, with Stark pushing the line that crypto assets should not be treated as “pink sheets or stocks.”</p><p>Conversely, Cuban called Stark’s take biased, suggesting that tokens could, in fact, be treated similarly to other securities and that the SEC should propose clearer guidelines for them.</p><p>Mark Cuban is a well-known American entrepreneur and investor. He first became involved in crypto in 2017, when he declared Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) to be nothing more than a pyramid scheme. Over time, Cuban has become more supportive of digital assets and now appears to advocate for the industry. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Now we are talking tech.  You are in my space John.  I don’t comment. I do.  My entire career has been people telling me why the companies I started were ridiculous and not needed.  Until they found themselves using them. <br><br>Smart contracts are about 6 years old.  Maybe the name… <a href=\"https://t.co/da2zEvjtHU\">https://t.co/da2zEvjtHU</a></p>&mdash; Mark Cuban (@mcuban) <a href=\"https://twitter.com/mcuban/status/1669338225197072387?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>John Reed Stark was previously Chief of the SEC’s Office of Internet Enforcement. Currently, Stark stands as a moderate skeptic of crypto and provides a wide range of legal commentary on digital assets to his 21,000 followers on Twitter. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/impossible-to-know-what-is-a-security-mark-cuban-on-sec\"><strong><em>‘Near impossible to know’ what is and isn’t a security — Mark Cuban on SEC</em></strong></a></p><p>Ultimately, Cuban conceded that just like all of the early-internet companies, “90 percent of blockchain companies” and “99 percent of tokens” will go broke. Those that emerge victorious “will be game changers. That’s the way tech works,” he said.</p><p>Cuban wrapped things up with words of support for crypto, saying that no one could refute the potential impact of crypto on the wider economy. </p><p>He said “Crypto Derangement Syndrome” — his term for an irrational hatred of crypto — would have the same negative effect as those overhyping its potential.</p><blockquote>“With all due respect, Crypto Derangement Syndrome is just as big a problem as the crypto maxis over hyping crypto.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>‘Moral responsibility’ — Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-06-16T06:30:43.000Z",
    "title": "Here’s The Impact Of BlackRock’s Bitcoin ETF Application On The Cryptocurrency Industry?",
    "url": "https://nulltx.com/heres-the-impact-of-blackrocks-bitcoin-etf-application-on-the-cryptocurrency-industry/",
    "description": "BlackRock&#8217;s application for a Bitcoin ETF is a significant development for the cryptocurrency industry. The world&#8217;s largest asset manager with over $9 trillion in assets under management, BlackRock&#8217;s involvement in the cryptocurrency space is a sign of growing institutional interest in digital assets. SEC&#8217;s Past Hesitant Response There have been hesitant responses to approving spot [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T06:25:04.000Z",
    "title": "Tether Faces Liquidation Threat for $1.5B BTC Holdings, Analyst Warns",
    "url": "https://coinedition.com/tether-faces-liquidation-threat-for-1-5b-btc-holdings-analyst-warns/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/TETHER-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/TETHER-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/TETHER-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/TETHER-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>DeFi analyst cryptopainzy tweeted on June 15, noting that &#8220;$USDT holds $1.5 billion worth of $BTC.&#8221; According to the Twitter user, under significant strain, it may become necessary for Tether to liquidate these holdings to uphold the peg. Moreover, they claim that the acquisition of said BTC was initially funded by profits. Cryptopainzy further tagged [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tether-faces-liquidation-threat-for-1-5b-btc-holdings-analyst-warns/\">Tether Faces Liquidation Threat for $1.5B BTC Holdings, Analyst Warns</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]