[
  {
    "source": "CoinDesk",
    "date": "2023-07-12T16:52:11.000Z",
    "title": "Digitex Founder Ordered to Pay $16M to Resolve CFTC Action, Banned From Trading",
    "url": "https://www.coindesk.com/policy/2023/07/12/digitex-founder-ordered-to-pay-16m-to-resolve-cftc-action-banned-from-trading/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The founder of crypto exchange Digitex, Adam Todd, has been ordered by a federal court to pay almost $16 million to resolve accusations that he ran an illegal platform and sought to manipulate its native token, DGTX, the U.S. Commodity Futures Trading Commission (CFTC) said in a Wednesday statement."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T17:06:43.000Z",
    "title": "'Bitcoin Senator' Renews Push to Remedy Crypto’s ‘Erratic Regulatory Framework’",
    "url": "https://decrypt.co/148298/bitcoin-senator-renews-push-to-remedy-cryptos-erratic-regulatory-framework",
    "description": "Sen. Cynthia Lummis said that a bipartisan bill she's been working on with Sen. Kirsten Gilibrand for more than a year is ready to be reintroduced."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T16:59:23.000Z",
    "title": "Bitcoin mining difficulty hits all-time high as BTC miner selling peaks",
    "url": "https://cointelegraph.com/news/bitcoin-mining-difficulty-hits-all-time-high-as-btc-miner-selling-peaks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/803b57a1-2f67-4bb0-a2a3-a83405d677bd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In recent weeks BTC miners sent a record amount of Bitcoin to exchanges right as the network’s difficulty metric hit a new all-time high.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining difficulty <a href=\"https://cointelegraph.com/news/cpi-btc-supply-5-things-bitcoin-this-week\">reached an all-time high</a> of 53.91 trillion units after the latest difficulty adjustment on July 12. It is a measure of how difficult it is to mine Bitcoin blocks.</p><p>The blockchain adjusts its difficulty every two weeks to maintain its processing time of 10 minutes. When the network’s processing power increases, it adjusts to make mining challenging, reducing the profitability for individual miners.</p><p>The latest adjustment will add to the pressure on miners who have been <a href=\"https://cointelegraph.com/news/bitcoin-on-chain-data-shows-miners-offloading-btc-as-revenues-shrink\">selling off their mined BTC</a> since June. Some analysts suspect that the lack of miner accumulation has likely restricted an uptrend in BTC price.</p><p>With the latest difficulty adjustment, the profitability of medium and small scale miners will likely drop into negative territory, forcing them to temporarily turn off some of their ASIC miners. </p><p>The potential capitulation of weaker miners could finally enable larger miners to accumulate Bitcoin, which may reduce the mining selling pressure.</p><h2>Are miners close to capitulation? </h2><p>The <a href=\"https://cointelegraph.com/news/bitcoin-mining-metric-that-has-predicted-every-big-btc-rally-since-2020-is-flashing-again\">Hash Ribbon indicator</a> created by independent analyst, Charles Edwards, tracks the 30 and 60-day moving average (MA) of the network’s hashrate. When the 30-day MA falls below the 60-day MA, it is a signal that miner capitulation may be occurring, meaning unprofitable miners are moving out.</p><p>The two lines are marginally close to a crossover and the increase in difficulty may finally provide the catalyst for capitulation of weaker miners.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ea478506-4b01-4966-abd4-aa537ecf17c1.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD daily price chart with Hash Ribbon indicator. Source: TradingView</em></figcaption></figure><p>The exodus of weaker miners would bring more rewards for the more efficient miners, potentially allowing them to save a portion of their output instead of selling.</p><h2>Can Bitcoin push higher after miner selling ceases? </h2><p>Recently, miners were seen unloading record amounts of BTC to exchanges. According to a K33 Research report, publicly listed miners sold 100% or more of their output in May.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/01a31a12-d571-4741-bf8d-488632902594.jpg\"  /><figcaption style=\"text-align: center;\"><em>Monthly updates on Bitcoin sold by public miners in 2022. Source: K33 Research</em></figcaption></figure><p>In June and July as well, the 30-day cumulative transfer volume from BTC from miner wallets to exchanges spiked to a six-year peak, suggesting that miners likely continued to unload their Bitcoin at an alarming rate.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2c1d9e5c-33dc-4c79-be37-318ee5525253.jpg\"  /><figcaption style=\"text-align: center;\"><em>30-day cumulative volumes of BTC transferred from miners to exchanges. Source: Bitcoin Magazine</em></figcaption></figure><p>The one-hop supply of miners from Coin Metrics, which represents the total amount held in wallets that received coins from mining pools, also dipped to one-year lows. It shows that miners have been uploading more coins than their production output.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-s-pre-halving-rally-may-start-soon-here-s-why\">Bitcoin’s pre-halving rally may start soon — Here’s why</a></em></strong></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2d22c71f-1541-4aed-b324-cf655dfd8069.jpg\"  /><figcaption style=\"text-align: center;\"><em>One-hop supply of miners. Source: Coin Metrics</em></figcaption></figure><p>While miners have resorted to selling, the supply distribution data from on-chain analytics firm Santiment <a href=\"https://twitter.com/santimentfeed/status/1677805758216556544\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that Bitcoin whales did the opposite.</p><p>The most prolific BTC investors, often known as whales and sharks marked by addresses holding between 10 to 10,000 BTC, have increased their holdings by $2.15 billion since June 17.</p><p>On top of that, Bitcoin held by exchanges have also <a href=\"https://cointelegraph.com/news/bitcoin-exchanges-same-btc-supply-late-2017\">fallen below 2017</a> levels, suggesting that investors are moving the BTC off exchange and increasing its illiquid supply.</p><p>While the accumulation of Bitcoin among whales has previously pushed the price of BTC higher, this time, it has remained suppressed in a narrow range between $29,500 and <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-down-today\">$31,500</a>, which could partially be due to miner selling pressure.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T17:00:00.000Z",
    "title": "The Transformation of Mining in the Cryptocurrency World",
    "url": "https://cryptodaily.co.uk/2023/07/the-transformation-of-mining-in-the-cryptocurrency-world",
    "description": "<p>The world of cryptocurrency mining has undergone a remarkable transformation since its inception, and one of the most significant advancements in recent years is the rise of cloud mining.</p>\n<p>This innovative approach has revolutionized the mining landscape by offering an alternative to the traditional hardware-intensive methods. In this article, we will explore how cloud mining is rapidly emerging as the primary means of mining cryptocurrencies and discuss its numerous advantages.</p>\n<p>Additionally, we will delve into the remarkable opportunities presented by Liquid Mining, an application that allows users to mine startups effortlessly, without the need for hardware or coding knowledge. In conclusion, it will be apparent why cloud mining has emerged as the preferred option for crypto devotees, rendering mining both accessible and lucrative via the simplicity of a smartphone.</p>\n<p>https://www.youtube.com/watch?v=qXZ0UGKpBKo&nbsp;</p>\n<p>The Emergence of Cloud Mining:During the initial stages of cryptocurrency mining, people were required to make significant investments in specialized mining hardware and handle intricate configurations. Nevertheless, the emergence of cloud mining has streamlined this process, abolishing the requirement for tangible hardware and technical expertise. Cloud mining provides users with the opportunity to lease computational resources from distant data facilities, thereby delegating the mining operations. This method has quickly won widespread acceptance for its simplicity, effectiveness, and financial viability.</p>\n<p>Advantages of Cloud Mining:</p>\n<ul class=\"lst-kix_pjnt47nm4i9j-0 start\">\n<li>Universality: Cloud mining broadens the field of mining opportunities, enabling anyone with an internet connection to partake. It eradicates hurdles like prohibitive hardware costs, specialized knowledge, and high power consumption, making mining accessible to both novices and experienced miners.</li>\n<li>&nbsp;</li>\n<li>Economic Efficiency: By taking advantage of cloud mining services, individuals can sidestep significant costs tied to the purchase, upgrade, and maintenance of mining equipment. Cloud mining providers oversee the infrastructure and related costs, allowing miners to zero in exclusively on mining without the concerns of hardware investments or operational expenses.</li>\n<li>&nbsp;</li>\n<li>Versatility and Expansion Capacity: Cloud mining provides the flexibility to tailor mining resources based on demand. Users can comfortably scale their mining activities up or down, aligning with market dynamics and their own preferences. This level of versatility imparts an agility that traditional mining infrastructures fail to offer.</li>\n<li>&nbsp;</li>\n</ul>\n<p>The Liquid Mining Advantage:</p>\n<p>Liquid Mining, a trailblazing player in the cloud mining sphere, pushes the envelope even further. It enables users to mine startups and nascent cryptocurrencies, eliminating the need for hardware or coding expertise. This revolutionary solution levels the mining playing field, authorizing individuals to engage in stimulating projects right from their mobile devices. By facilitating direct links between users and promising startups, Liquid Mining extends an unparalleled chance for preliminary investment and active involvement in the crypto revolution.</p>\n<p>Embracing Profitability and Convenience:Cloud mining, with distinctive services like those offered by&nbsp;Liquid Mining, has demonstrated its potential for high returns. By negating the necessity for physical hardware and pricey infrastructure, miners can distribute their resources more effectively, culminating in enhanced profits. Furthermore, cloud mining equips individuals to mine cryptocurrencies at their convenience, using nothing more than their smartphones. This versatility revolutionizes the field, as it invites people to become part of the mining community without the constraints of a fixed location or hefty hardware investments.</p>\n<p>Conclusion:</p>\n<p>The progression in crypto mining has been extraordinary, with cloud mining surfacing as the catalyst behind this metamorphosis. Through cloud mining, individuals have the opportunity to engage in the mining process in an uncomplicated and economical manner. The perks of cloud mining, including accessibility, affordability, and scalability, have launched it to the leading edge of the mining sector. Additionally, the Liquid Mining platform&nbsp;has unlocked new possibilities, allowing users to mine emerging startups with ease. In the end, the profitability and convenience of cloud mining, coupled with the capability to participate merely using a smartphone, establish it as the favorite choice for crypto devotees globally. As the mining landscape continues to evolve, cloud mining is set to reshape the industry and empower individuals to be part of the exciting world of cryptocurrency mining.</p>\n\n\n\n\n\n\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n\n\n\n\n\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T16:52:47.000Z",
    "title": "South Korea Will Mandate Companies to Disclose Crypto Holdings",
    "url": "https://cryptodaily.co.uk/2023/07/south-korea-will-mandate-companies-to-disclose-crypto-holdings",
    "description": "<p>South Korea will mandate all companies that own or issue cryptocurrencies to disclose their holdings in financial statements from 2024.</p>\n<p>South Korea's Financial Services Commission (FSC) issued draft rules requiring companies holding or issuing cryptocurrencies to disclose their holdings in financial statements from 2024.</p>\nLocal Crypto Firms to Disclose Holdings\n<p>In a press statement, the FSC said firms would have to disclose information about their holdings' characteristics, quantities, business models and internal accounting policies. Additionally, domestic companies must disclose information regarding profits, book value, and the market value of their cryptocurrencies.</p>\n<p>The new accounting standards are expected to take effect in January 2024.</p>\n<p>In its statement, the FCA said:</p>\n\n<p>The government is enhancing accounting transparency in virtual asset transactions by requiring companies to disclose detailed information, following the&nbsp;passage of the Virtual Assets Act&nbsp;in the parliament on June 30.</p>\n\n<p>South Korean lawmakers passed legislation that protects investors and grants the FSC and The Bank of Korea the power to oversee crypto operators and asset custodians. The newly enacted Virtual Asset Users Protection Act also authorizes the power to impose penalties and liabilities for damages caused by unfair trading practices.</p>\nGuidelines Seek to Provide Accounting Clarity\n<p>Until now, firms and their auditors differed in their view regarding the timing and criteria for determining whether the sale of virtual assets to customers constituted profit.</p>\n<p>Under the FSC's new rules, if companies sell assets, the sale will be regarded as profit after the company fulfils obligations to its holder.</p>\n<p>The announcement added that the cost incurred in developing virtual assets and their platforms would not be considered intangible assets.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T17:09:43.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T17:07:51.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T16:53:14.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T16:52:40.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T16:44:25.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s live Aave price is $75.29, with a 24-hour trading volume of $97,639,261. Aave is up 3.02% in the last 24 hours. The current CoinMarketCap ranking is #40, with a live market cap of $1,089,590,350. It has a circulating supply of 14,472,377 AAVE coins and ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T16:48:40.000Z",
    "title": "Tether issues 1 billion USDT on Tron, market dominance at 65%",
    "url": "https://crypto.news/tether-issues-1-billion-usdt-on-tron-market-dominance-at-65/",
    "description": "Tether Treasury has minted 1 billion USDT, equivalent to $1,000,485,000, on the Tron network"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T17:00:03.000Z",
    "title": "FTT Up By 21% Despite FTX Claims Portal Troubles",
    "url": "https://www.newsbtc.com/ftx/ftt-up-by-21-despite-ftx-claims-portal-troubles/",
    "description": "FTT, the native token of the controversial FTX ecosystem, has been pumping lately. This recent price upswing was triggered by the launch of a customer claims portal, an online platform for customers to access their account information and submit electronic proof of claims in FTX’s restructuring proceedings.  Although the portal became unavailable barely an hour after launch, the price of FTT has managed to stay afloat, with a 21% increase in the last day. FTX Claims Portal Goes Offline For Unknown Reasons Last month, the debtors in FTX’s insolvency case announced that an online claims portal was in the final stages of launch. The portal reportedly went live on Tuesday, July 11, enabling customers of the bankrupt crypto exchange to access their account information. Related Reading: Shiba Inu Ecosystem Token BONE Surges 88%, Too Late To Buy? The platform &#8211; before going offline &#8211; said users can access their account balance as of November 11, 2022 &#8211; the day FTX filed for bankruptcy in the United States. Then, if required, customers would also be able to submit an electronic proof of claim with the FTX Debtors’ claims and noticing agent (Kroll Restructuring Administration). However, the claims portal only stayed live for about an hour before going down for unknown reasons. As of this writing, there has been no official statement from FTX addressing the crash. That said, it is worth noting that customers still have until September 29, 2023, to file a claim. This can be done via alternative means besides the website, like through US mail. FTT Rallies 21% In A Single Day &#8211; Price Overview After the FTX claims portal went live yesterday, the FTX token (FTT) received a lot of attention from crypto enthusiasts. And the token’s price showed a positive reaction, gaining more than 24% roughly an hour after the launch.  However, this price surge was short-lived, as the FTT token soon shed a considerable chunk of its early gain. This is understood to be in response to the claims portal going offline. It is worth noting that FTT has been on a positive run in recent weeks. According to CoinGecko data, the token’s value has increased by nearly 117% in the past month. That said, it appears that FTT won’t be staying down for long. The cryptocurrency looks set to touch the previous 24-hour high of $1.79 again, with a 6.7% price increase in the last hour. Related Reading: Coinbase Stock Surges Nearly 10% Despite Cathie Wood’s Ark Invest $12 Million Sale As of this writing, the FTT token changes hands at $1.71, with a daily trading volume of about $96.2 million. CoinGecko data shows that the trading volume has swelled by 729.9% in the past day, suggesting massive market activity. FTTUSD trading at $1.69323630 &#124; Source: FTTUSD chart from TradingView Featured image from The Independent, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T17:02:59.000Z",
    "title": "Web3 Empowerment, Advanced Trading Tools, and Next-Gen Experiences: Chainlink Integration Unleashes a Wave of Innovation",
    "url": "https://www.crypto-news-flash.com/web3-empowerment-advanced-trading-tools-and-next-gen-experiences-chainlink-integration-unleashes-a-wave-of-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=web3-empowerment-advanced-trading-tools-and-next-gen-experiences-chainlink-integration-unleashes-a-wave-of-innovation",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /> EtherScore became part of Chainlink BUILD to boost the security and functionality of its on-chain reputation system. Oku Trade has integrated Chainlink Automation to trigger limit orders on the Uniswap DEX.  The Chainlink platform has been making key partnerships in the crypto ecosystem while offering its Web3 services along with technical support. A number of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-12T16:55:52.000Z",
    "title": "Former SEC Chair Jay Clayton Says Approval of Spot Bitcoin ETF Would Be Hard To Resist Under This Condition",
    "url": "https://dailyhodl.com/2023/07/12/former-sec-chair-jay-clayton-says-approval-of-spot-bitcoin-etf-would-be-hard-to-resist-under-this-condition/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/says-approval-of-spot.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Jay Clayton, the former chair of the U.S Securities and Exchange Commission (SEC), thinks a Bitcoin (BTC) spot exchange-traded fund (ETF) could get approved if financial institutions can prove such a product would mimic the conditions of the Bitcoin futures market. No US Bitcoin spot ETF application has ever been approved thus far, despite submissions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/former-sec-chair-jay-clayton-says-approval-of-spot-bitcoin-etf-would-be-hard-to-resist-under-this-condition/\">Former SEC Chair Jay Clayton Says Approval of Spot Bitcoin ETF Would Be Hard To Resist Under This Condition</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-12T16:51:08.000Z",
    "title": "Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-Based BTC.B-USDC Vaults",
    "url": "https://dailyhodl.com/2023/07/12/struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btc-b-usdc-vaults/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 12, 2023 – Tortola, British Virgin Islands In its ongoing journey to reshape the crypto investing landscape, Struct Finance – a DeFi platform that enables investors to engage with tailored interest rate products linked to digital assets – is thrilled to announce the launch of the BTC.B-USDC Vaults. The tranche-based BTC.B-USDC interest rate product [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btc-b-usdc-vaults/\">Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-Based BTC.B-USDC Vaults</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]