[
  {
    "source": "Decrypt",
    "date": "2024-03-06T23:53:55.000Z",
    "title": "Goofy Biden and Trump Meme Coins Are Skyrocketing on Solana",
    "url": "https://decrypt.co/220498/goofy-biden-trump-meme-coins-skyrocketing-solana",
    "description": "Degens who caught the newest Solana meme coin sensation—led by “Jeo Boden”—early this week are currently sitting on well over 100x returns."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T00:01:41.000Z",
    "title": " Arizona’s Senate mulls proposal to add Bitcoin ETFs to retirement portfolios ",
    "url": "https://cointelegraph.com/news/arizona-senate-consider-bitcoin-etfs-retirement-portfolios",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZTJkMzVkMjktMmI5ZC00YjE0LWI1NjItOGMwMmI3MjJkNGZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Satoshi Action Fund’s CEO Dennis Porter said even adding a small amount of Bitcoin ETF exposure could “DRAMATICALLY” de-risk an asset portfolio. </p>\n                    <p><p>The Arizona State Senate is considering a proposal to encourage the inclusion of Bitcoin exchange-traded funds (ETFs) in two of the <a href=\"http://cointelegraph\" target=\"_blank\" rel=\"noopener nofollow\">state’s retirement portfolios.</a></p><p>The resolution is currently being reviewed by the House for a second time after it passed the Senate's Third Reading in a 16-13 vote on Feb. 22, records show. </p><p>If passed, the proposal would encourage the Arizona State Retirement System (ASRS) and the Public Safety Personnel Retirement System (PSPRS) to consider adding exposure to Bitcoin ETFs in their respective portfolios, <a href=\"https://legiscan.com/AZ/supplement/SCR1016/id/426920\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to state records.</p><p><a href=\"https://cointelegraph.com/news/arizona-senate-consider-bitcoin-etfs-retirement-portfolios\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-06T23:52:00.000Z",
    "title": "Long-Dormant Bitcoin Whale Triggered Markt Crash After Dumping Over $60 Million Worth of $BTC",
    "url": "https://www.cryptoglobe.com/latest/2024/03/long-dormant-bitcoin-whale-triggered-markt-crash-after-dumping-over-60-million-worth-of-btc/",
    "description": "A long-dormant Bitcoin whale that was last active in 2010 has reemerged after a 14-year hiatus, contributing to a recent slump in the market after selling more than  $67 million worth of the flagship cryptocurrency on Nasdaq-listed crypto exchange Coinbase, contributing to a market crash. The price of Bitcoin reached a new all-time high of […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-07T00:00:17.000Z",
    "title": "“A Who’s Who of Web3”: Sector’s Biggest Names Sign-up to Bionic’s Advisory Board",
    "url": "https://news.bitcoin.com/a-whos-who-of-web3-sectors-biggest-names-sign-up-to-bionics-advisory-board/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240306_180241_616.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Game-changing capital formation platform Bionic DAO today unveiled a list of the big-name sector leaders who have agreed to join its new Advisory Board ahead of the platform’s launch in Spring 2024. The stellar list of names signing up to support Bionic DAO, one of the year’s most eagerly anticipated Web3 projects, has [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T00:05:34.000Z",
    "title": "Shiba Inu Lead Dev Co-Signs Prediction That Would Send SHIB To $100 Billion",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-lead-dev-prediction/",
    "description": "Shiba Inu saw a massive rally over the past month, going from below $0.00001 to above $0.00004, just 50% below its all-time high price. This has strengthened bullish resolve among investors in SHIB as crypto analysts continue to call for higher prices, one of which has been co-signed by Shiba Inu lead developer Shytoshi Kusama. Shiba Inu Market Cap Headed For $100 Billion In a post on X (formerly Twitter), crypto analyst Jake Gagain made a very bullish prediction for the Shiba Inu price. According to him, the meme coin could see its market cap rise as high as $100 billion in the bull market. “$SHIB Will Reach 100 Billion This Cycle,” the post read. Related Reading: Institutions Can’t Get Enough Of Crypto As Trading Volumes Hit New $30 Billion Record This prediction caught the attention of Shiba Inu&#8217;s lead developer, Shytoshi Kusama, who took to the social media platform to lend his support. The quote response featured a GIF which said, “Your words, not mine,” something that is often used to support a statement by another person. https://t.co/aUePEauoUo pic.twitter.com/vp0gk4FDtv — Shytoshi Kusama™ (@ShytoshiKusama) March 5, 2024 Gagain’s prediction is interesting because it would mean that the market cap of SHIB would be three times higher than what it was during its last all-time high. If it does come to fruition, then the SHIB price at this high market cap would see it climb above $0.0002. Reaching this price point would mean that the price of SHIB would have to climb another 500% from its current value of $0.000037. SHIB At $0.0001 Is Possible Gagain is not the only crypto analyst who sees the price of Shiba Inu eventually crossing the $0.0001 level. Another analyst, Oscar Ramos, recently shared their own bullish prediction for the SHIB price, which he believes would cross $0.0001. Related Reading: Analyst Predicts Massive Rally For Dogecoin Price With A $1 Target, Here’s How As Ramos explains, some of the facts that will drive this rally will be retail investors as they flock back into the market. This influx of funds, the analyst explains, could send the SHIB price above $0.0001. Additionally, Ramos points to the previous performance of SHIB as evidence of how much the price can grow in a short time. For Ramos, SHIB at $0.0001 is a certainty this cycle. However, despite being bullish on the Shiba Inu price, the crypto analyst also reeled in unrealistic expectations for the price. He explains that the meme coin rising to $0.1 or even $1 is not possible in this bull market. For now, the cryptocurrency has to focus on reaching a $60 billion market cap, which would help it cross $0.0001. As for when to sell, the analyst cautions that investors should be looking to exit their position at around the $0.0002 mark, as this could mark the peak. SHIB price drops alongside BTC &#124; Source: SHIBUSD on Tradingview.com Featured image from MEXC Blog, chart from Tradingview.com"
  }
]