[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T04:40:43.000Z",
    "title": "FTX co-founder exposes SBF’s funding for US politicians",
    "url": "https://www.cryptopolitan.com/ftx-co-founder-sbf-funding-for-politicians/",
    "description": "In the latest turn of events, former FTX high-ranking official, Nishad Singh, peeled back the curtain on the behind-the-scenes dealings of SBF, FTX&#8217;s embattled figurehead. Singh&#8217;s revelations during the trial, which has now entered its third week, sent shockwaves through the crypto community and the world of political finance. Unraveling a Web of Financial Intricacy ... <a title=\"FTX co-founder exposes SBF&#8217;s funding for US politicians\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-co-founder-sbf-funding-for-politicians/\" aria-label=\"More on FTX co-founder exposes SBF&#8217;s funding for US politicians\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T04:46:55.000Z",
    "title": "Ethereum Price Faces Crucial Test: Will $1,570 Withstand the Pressure?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-faces-test-1570/",
    "description": "Ethereum price started a steady increase from the $1,520 zone against the US dollar. ETH is now struggling to clear the $1,605 and $1,620 resistance levels. Ethereum is attempting a recovery wave above the $1,570 level. The price is trading just above $1,575 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,572 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further if there is a close above the $1,620 resistance level. Ethereum Price Gains Traction Ethereum started a fresh increase from the $1,520 level. ETH gained traction like Bitcoin and spiked above the $1,600 resistance level. It even climbed above $1,620, but the bears appeared near $1,650. A high was formed near $1,669 before there was a fresh decline. Ether trimmed gains and settled below the $1,600 level. It tested the $1,575 support and is currently consolidating near the 23.6% Fib retracement level of the recent decline from the $1,669 swing high to the $1,574 low. Ethereum is now trading just above $1,575 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,572 on the hourly chart of ETH/USD. On the upside, the price is facing resistance near the $1,605 level. The first major resistance is near the 50% Fib retracement level of the recent decline from the $1,669 swing high to the $1,574 low at $1,620. A close above the $1,620 resistance might start a decent increase. Source: ETHUSD on TradingView.com In the stated case, Ether could rise and recover toward the $1,665 resistance. Any more gains might open the doors for a move toward $1,750. Another Decline in ETH? If Ethereum fails to clear the $1,605 resistance, it could start another decline. Initial support on the downside is near the $1,575 level and the 100-hourly Simple Moving Average. The next key support is $1,550. A downside break below the $1,550 support might send the price further lower. In the stated case, the price could drop toward the $1,520 level. Any more losses may perhaps send Ether toward the $1,440 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,575 Major Resistance Level – $1,620"
  }
]