[
  {
    "source": "CryptoSlate",
    "date": "2023-12-15T23:00:20.000Z",
    "title": "Ethereum Name Service now fully decentralized as DAO takes control",
    "url": "https://cryptoslate.com/ethereum-name-service-now-fully-decentralized-as-dao-takes-control/",
    "description": "<p>Ethereum Name Service (ENS) has achieved decentralized governance, according to a message from the project&#8217;s creator on Dec. 14. ENS is a naming system for the Ethereum blockchain that adds human-readable names to various resources, including crypto wallets and websites. Until now, the project&#8217;s root node was managed by members of the Ethereum community. Nick [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-name-service-now-fully-decentralized-as-dao-takes-control/\">Ethereum Name Service now fully decentralized as DAO takes control</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T22:46:06.000Z",
    "title": "South Korea’s central bank urges swift action on CBDC amid growing stablecoin popularity",
    "url": "https://www.cryptopolitan.com/south-koreas-swift-action-on-cbdc/",
    "description": "South Korea&#8217;s central bank governor, Rhee Chang-yong, emphasized the urgency of addressing Central Bank Digital Currencies (CBDCs) during the 2023 MOEF-BOK-FSC-IMF International Conference on Digital Money. Stablecoins&#8217; surge raises systemic concerns Governor Chang-yong expressed apprehensions about the burgeoning popularity of stablecoins in the country, warning that their widespread adoption as a digital payment method could [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T23:00:44.000Z",
    "title": "Shiba Inu Faces Make Or A Point As Analyst Identifies Critical Trading Pattern",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-critical-trading-pattern/",
    "description": "Shiba Inu bulls continue to struggle to hold on to gains from the last week despite losing their hold at the $0.00001 level. This shows a commitment to pushing the price of the meme coin even higher at a time when large cap altcoins are not really getting much attention. Given this, the SHIB price has traded in a tight range for a while now, something that could either make or break the price. Shiba Inu Trading In A Descending Parallel Pattern Crypto analyst Ali Martinez has identified a pattern that the Shiba Inu price has been trading inside recently. Using a price chart of the altcoin, the crypto analyst shows that SHIB has continued to trade inside what is known as a descending parallel pattern. Related Reading: Terra Classic Validator Presents ‘Legally Absolved Route’ To Burn 800 Million USTC Now, descending parallel patterns only show up in an asset when there are a lot of prominent downtrends in the price of that asset over time. Due to this, the appearance of a descending parallel pattern is often very bearish for the price. However, it is not all bad news given that descending parallel patterns can also lead to a surge in the price of an asset. As Martinez outlines in his analysis, the current pattern being exhibited by the SHIB price can end up going one of two ways. The first of these is the bullish path which could lead to a breakout. In this case, the analyst maintains that there needs to be a decisive weekly breakout which could push the price toward $0.000014. On the flip side of this thought is the more bearish path that could signal a drop back to October levels. This happens is the price of SHIB ends up facing a region which could lead to a cascade of downward movement. In this case, the meme coin could fall back to $0.000008 once more. SHIB price at $0.0000099 &#124; Source: SHIBUSD on Tradingview.com SHIB Struggles To Keep Up Since facing rejection at $0.00001095, the SHIB price has struggled to keep up with its gains. This makes it the level to beat if the bulls want to regain control. However, there is still a lot of resistance to the asset that it could be an uphill battle to win. Related Reading: Avalanche Open Interest Just Smashed A New ATH, Can AVAX Reclaim $100? There are some things that could help to return positive sentiment for Shiba Inu among investors. For one, the Shiba Inu lead developer Shytoshi Kusama has teased what they called a “game-changing announcement.” If the announcement does turn out to be as big as expected, it could propel SHIB’s price forward. Shibarium, the Shiba Inu Layer 2 blockchain, has also seen a lot of usage recently. This flurry of activity has increased the amount of fees generated, climbing over $1.2 million. The project’s lead dev has confirmed that these generated fees will be used to burn SHIB. As the SHIB supply is reduced, the price is expected to rally. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Analytics Insight, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-15T23:01:10.000Z",
    "title": "Dogecoin Competitor BONK Continues Precipitous Climb, Exploding Nearly 100% in 24 Hours",
    "url": "https://dailyhodl.com/2023/12/15/dogecoin-competitor-bonk-continues-precipitous-climb-exploding-nearly-100-in-24-hours/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/rival-explodes-amid.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Dogecoin (DOGE) competitor Bonk (BONK) is continuing its steep ascent, nearly doubling up in price over the last 24 hours. The meme asset, which was built over smart contract platform Solana (SOL), recently surpassed its rival Shiba Inu (SHIB) in daily trading volume en route to its price of $0.000028 at time of writing, an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/15/dogecoin-competitor-bonk-continues-precipitous-climb-exploding-nearly-100-in-24-hours/\">Dogecoin Competitor BONK Continues Precipitous Climb, Exploding Nearly 100% in 24 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]