[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T06:44:46.000Z",
    "title": "Australia’s largest bank  to reject “certain”  crypto transactions",
    "url": "https://www.cryptopolitan.com/australia-bank-to-reject-crypto-transactions/",
    "description": "Australia&#8217;s largest bank, Commonwealth Bank (CBA), has announced that it will refuse or temporarily delay certain payments to cryptocurrency exchanges due to concerns over the risk of scams. This decision follows recent legal challenges faced by two major global exchanges at the hands of the United States securities regulator. Additionally, it comes shortly after another ... <a title=\"Australia&#8217;s largest bank  to reject “certain”  crypto transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australia-bank-to-reject-crypto-transactions/\" aria-label=\"More on Australia&#8217;s largest bank  to reject “certain”  crypto transactions\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T07:01:53.000Z",
    "title": "Shiba Inu Hits Crucial Barrier – How This May Impact Investor Sentiment",
    "url": "https://www.newsbtc.com/news/shiba-inu-reaches-crucial-support-barrier-how-this-may-impact-investor-sentiment/",
    "description": "Shiba Inu (SHIB) has found itself in a challenging position as it grapples with a prolonged downward trend, reaching a critical support level that investors have anxiously awaited. The popular meme coin, known for its adorable dog-themed branding, has struggled to reverse its declining price trajectory in recent months. Despite the initial hype and enthusiasm surrounding SHIB, the coin has faced an uphill battle in the volatile market of digital currencies. As the price continued to backpedal, the community of SHIB holders and supporters looked to the long-awaited support level as a potential turning point for the beleaguered cryptocurrency.  However, the road to recovery remains uncertain, with SHIB struggling to regain its former glory. Related Reading: Now That Optimism ‘Bedrock’ Hard Fork Is Done, What Can We Expect? Shiba Inu: &#8216;Final Destination&#8217; Support Is Reached Shiba Inu has finally reached what market observers have dubbed its &#8220;Final Destination&#8221; support level, a significant price point of $0.000008 that has long been regarded as a crucial roadblock for a potential trend reversal.  Source: TradingView A lot of people were anticipating a big spike in the price of SHIB, seeing it as a turning point for the token. They were expecting a spike that would mark a turning point and take SHIB to greater heights. But despite periodic outbursts of excitement and temporary rallies that fueled optimism, the token has struggled to make any real headway. SHIB holders are at a crossroads, uncertain about the future direction of the cryptocurrency, due to the absence of persistent upward momentum. The meme coin is under more scrutiny than ever before, and investors are being prompted to rethink their approaches in light of this crucial juncture. SHIB market cap drops below the $5 billion handle. Chart: TradingView.com The $0.000008 level holds particular significance as it is considered a robust support level that has historically acted as a springboard for price recoveries. The failure of SHIB to gain momentum and break out significantly from this crucial support level has left investors and analysts uncertain about the token&#8217;s future trajectory. Related Reading: Polygon (MATIC) Large Transactions Explode 742% Amid Latest SEC Attack Meme Coin Struggles Amidst Crypto Lawsuits And Bitcoin&#8217;s Plunge Shiba Inu&#8217;s recent struggles to reverse its downward trend were exacerbated by the broader turmoil in the cryptocurrency market. The token&#8217;s decline came in the wake of Bitcoin&#8217;s sharp drop to the $25,000 level, triggered by the mounting charges faced by Binance and Coinbase. These lawsuits sent shockwaves throughout the crypto industry, leaving investors and traders on edge. As one of the many altcoins affected by Bitcoin&#8217;s plunge, Shiba Inu experienced added pressure in the face of the market-wide sell-off. The negative sentiment surrounding the lawsuits and the uncertainty surrounding regulatory scrutiny created a challenging environment for SHIB to regain its footing. Featured image from Fearless Photographers"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T07:04:10.000Z",
    "title": "Bitcoin (BTC) Flashing a Potential ‘Impulsive’ Move to the Upside, Says Top Crypto Trader – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/06/08/bitcoin-btc-flashing-a-potential-impulsive-move-to-the-upside-says-top-crypto-trader-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/btc-Potential-Impulsive-Move-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that Bitcoin (BTC) could potentially be on the verge of a bullish move. The pseudonymous trader Bluntz tells his 223,200 Twitter followers that Bitcoin is showing signs of a potential breakout. Bluntz says his target is Bitcoin exceeding a price of $28,800. &#8220;BTC now back into the range once [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/bitcoin-btc-flashing-a-potential-impulsive-move-to-the-upside-says-top-crypto-trader-here-are-his-targets/\">Bitcoin (BTC) Flashing a Potential ‘Impulsive’ Move to the Upside, Says Top Crypto Trader – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]