[
  {
    "source": "CoinDesk",
    "date": "2023-10-17T15:41:19.000Z",
    "title": "SBF Trial: For Once, Bankman-Fried's Lawyer Lands a Punch      ",
    "url": "https://www.coindesk.com/policy/2023/10/17/live-news-updates-sbf-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sam Bankman-Fried's former colleague, Nishad Singh, will have to answer questions from the FTX founder's lawyer about the last few years of the exchange's operations."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-17T15:59:02.000Z",
    "title": "Bitcoin Miner Using Paraguay Itaipu Dam to Power Its New Facility",
    "url": "https://decrypt.co/201963/bitcoin-miner-sazmining-paraguay-itaipu-dam",
    "description": "Sazmining President Kent Halliburton thinks the surplus of hydroelectic power and low costs could make Paraguary \"the new Texas\" for Bitcoin miners."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T16:00:00.000Z",
    "title": "7 crypto leaders share tips to help Web3 companies prep for tax season",
    "url": "https://cointelegraph.com/innovation-circle/7-crypto-leaders-share-tips-to-help-web3-companies-prep-for-tax-season",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0d3385ab-be8f-4dbf-8399-85422184f0d6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Web3 companies face unique challenges when it comes to prepping for tax season, and they need to employ smart strategies to tackle them.</p>\n                    <p><p>No company looks forward to tax season, but for Web3 businesses, preparing can be particularly difficult. Global operations subject Web3 businesses to a variety of tax regulations and compliance requirements, and many regions lack regulatory clarity. Different digital tokens may have different tax statuses, making correct classification and reporting a tremendous challenge. The complexity is further increased by having to keep meticulous records of various cryptocurrency transactions, dealing with crypto-to-crypto swaps and managing market volatility.</p> <p>Further, the incorporation of blockchain and cryptocurrency data into accounting systems presents additional technological obstacles that the overall tax accounting software market hasn’t caught up with yet. And last — but certainly not least — Web3 companies are likely to come under increased tax authority scrutiny. The bottom line? In all their operations, Web3 companies must constantly keep an eye on the tax implications of their activities and diligently work to ensure they’re meeting their obligations. Below, seven members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> share their experience to help Web3 companies prep for a (relatively) smooth and simple tax season.</p> <h2>Choose a tax-friendly country and ensure on-time payment</h2> <p>On-time payment of taxes and proper clarity with the tax authorities can prevent unnecessary harassment. Crypto businesses are seen with a degree of suspicion throughout the world — even in those countries that are supposed to be crypto-friendly, like Singapore. Further, it is very important to choose a tax-friendly country such as the United Arab Emirates to lower your business expenditures. – <a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\">Abhishek Singh</a>, <a href=\"http://acknoledger.com/\">Acknoledger</a></p> <h2>Ensure all activities are accurately documented</h2> <p>Web3 companies approaching tax season should engage with a tax professional who is well-versed in crypto and blockchain transactions. Ensure all activities, from token sales to smart contract interactions, are accurately documented. Being proactive can mitigate potential tax liabilities and compliance issues. – <a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\">Tomer Warschauer Nuni</a>, <a href=\"http://www.kryptomon.co\">Kryptomon</a></p> <h2>Don’t take any shortcuts</h2> <p>Being prepared is vital, as not only is the space continuously adapting, but it is also volatile. This means that if you do not plan correctly and take the right measures, you could find yourself in troubled waters. Seeking the help of professionals who know the crypto and Web3 space well is incredibly important. – <a href=\"https://circle.cointelegraph.com/u/923e790f-d991-437d-a1eb-575af185daca\">Ilias Salvatore</a>, <a href=\"http://flooz.xyz\">Flooz XYZ</a></p> <h2>Maintain meticulous records and seek expert legal counsel</h2> <p>Although cryptocurrency appears to be moving out of legal “gray areas,” its institutions still face significantly greater complexity in terms of accounting and tax compliance when compared to those that operate with fiat currency. Maintaining meticulous records and collaborating with a legal and compliance firm that specializes in digital assets and blockchain is paramount; it’s essential to have guidance on current and forthcoming regulations. – <a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\">Sheraz Ahmed</a>, <a href=\"http://storm.partners/\">STORM Partners</a></p> <h2>Automate transaction tracking</h2> <p>In the digital forest that is Web3, every crypto leaf has its shadow. Instead of waiting for “tax winter,” harness the glowworms of automation! Design a system that illuminates every transaction, making tax season feel like a serene, moonlit night rather than a stormy evening. – <a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\">Arvin Khamseh</a>, <a href=\"http://soldoutnfts.io\">SOLDOUT NFTs</a></p> <h2>Hand transaction information to experts with specialized software</h2> <p>Work with accountants who are familiar with the crypto space and who can take your transaction information and plug it into specialized software that can sort and summarize the data from the blockchain. You don’t want to manually do that, especially if you are the type who trades several times a day. – <a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\">Zain Jaffer</a>, <a href=\"http://www.zain-ventures.com\">Zain Ventures</a></p> <h2>Find an experienced crypto tax accountant</h2> <p>Work with a good crypto tax accountant as early as possible. Make sure they are experienced in handling both traditional and crypto transactions from both a tax and an accounting perspective. Look for a tax specialist who has deep personal crypto experience as well as extensive crypto tax technical knowledge and who is knowledgeable in using crypto tax and accounting software. – <a href=\"https://circle.cointelegraph.com/u/b29c78d5-088e-419d-965d-6068acea1df1\">Sharon Yip</a>, <a href=\"http://polygonadvisory.com\">Polygon Advisory Group, LLC</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T15:54:09.000Z",
    "title": "Immutable delays $67M token vesting by another year",
    "url": "https://cointelegraph.com/news/immutable-delays-67-million-token-vesting-another-year",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/6dab1330-221b-4695-bc69-b0ef90f82318.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>125 million IMX tokens allocated for developer rewards will be vested monthly starting July 2024. </p>\n                    <p><p>Developers of Ethereum layer-2 nonfungible tokens (NFT) scaling solution Immutable (IMX) will delay the vesting of 125 million IMX in token rewards, worth $67 million at the time of publication, to July 2024.</p><p>According to the October 17 <a href=\"https://twitter.com/0xferg/status/1714270599214981164\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> by Robbie Ferguson, Immutable's co-founder, the move is to enhance Immutable's long-term sustainability. \"At a minimum, when we finally do decide to let these tokens unlock - they will be done on linear monthly vesting schedule over time, instead of a cliff,\" said Ferguson.</p><p>The blockchain executive also revealed there are over 200 funded games built on Immutable. Meanwhile, Ferguson claimed Immutable's treasury has approximately four years of runway for its 270 staff. Currently, 52% of Immutable's 2 billion tokens are reserved for project development and ecosystem incentives.</p><p>For its roadmap, the project plans to launch its zero-knowledge Ethereum Virtual Machine (zkEVM) alongside cross-rollup liquidity. In addition, its ecosystem blockchain games are set for debut, as told by Ferguson:</p><blockquote>\"The games funded 2 years ago are going live over the next 12 months. We will see hits, and web3's user adoption curves will be drawn by the biggest games, not just the biggest exchanges.\"</blockquote><p><a href=\"https://cointelegraph.com/news/immutable-x-imx-gains-50-following-the-close-of-a-200m-fundraising-round\">Cointelegraph reported</a> in March 2022 that Immutable raised $200 million in its Series C funding round led by Singaporean state-owned investment firm Temasek, with participation from Animoca Brands, Tencent, Arrington Capital and Princeville Capital. Developers said at the time that the funding would go towards improving Immutable's layer-2 scaling solution on Ethereum and scaling the Immutable Gaming Studio.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ We&#39;re here for the long run.<br><br>Last year, we committed to re-locking 125M <a href=\"https://twitter.com/search?q=%24IMX&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$IMX</a> of <a href=\"https://twitter.com/Immutable?ref_src=twsrc%5Etfw\">@Immutable</a>’s Project Dev allocation for another 1 year. A few weeks from now, these tokens are scheduled to unlock.<br><br>We’re proud to once again re-lock this allocation until July 2024 at a minimum.</p>&mdash; Robbie Ferguson  | Immutable (@0xferg) <a href=\"https://twitter.com/0xferg/status/1714270599214981164?ref_src=twsrc%5Etfw\">October 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Mt. Gox collapse saw birth of Chainalysis</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-17T15:47:13.000Z",
    "title": "Biggest Movers: TON Hovers Above $2, ADA Bears End 4-Day Winning Run",
    "url": "https://news.bitcoin.com/biggest-movers-ton-hovers-above-2-ada-bears-end-4-day-winning-run/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2351008821.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Toncoin rose for a third straight day on Tuesday, despite crypto markets mostly stalling in today&#x2019;s session. At the time of writing, the global market cap is up 0.02%, as traders move to secure Monday&#x2019;s gains. Cardano was in the red, following a four-day bull run. Toncoin (TON) Toncoin was a big mover in today&#x2019;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T16:08:00.000Z",
    "title": "Questions rise as Ripple records 75M XRP transfers ",
    "url": "https://www.cryptopolitan.com/ripple-records-75m-xrp-transfers-but-why/",
    "description": "Ripple (XRP) has been a prominent name in the crypto world as it has made headlines with its innovative blockchain technology solutions. Its cross-border payments have made it a unique asset to invest in, and both retail and institutional investors have boarded its network.&#160; Top of the recent news on the digital network is the ... <a title=\"Questions rise as Ripple records 75M XRP transfers \" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-records-75m-xrp-transfers-but-why/\" aria-label=\"More on Questions rise as Ripple records 75M XRP transfers \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T16:05:50.000Z",
    "title": "AI’s Role in Shaping the Future of Pension Funds: A Double-Edged Sword",
    "url": "https://www.cryptopolitan.com/ais-shaping-the-future-of-pension-funds/",
    "description": "In the rapidly advancing world of technology, pension funds are gearing up to harness the potential of artificial intelligence (AI). According to the recent joint report from Mercer and the CFA Institute, while AI promises new horizons for pension management, it isn’t devoid of challenges. A quantum leap in investment analysis Traditionally, pension fund managers ... <a title=\"AI’s Role in Shaping the Future of Pension Funds: A Double-Edged Sword\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-shaping-the-future-of-pension-funds/\" aria-label=\"More on AI’s Role in Shaping the Future of Pension Funds: A Double-Edged Sword\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T16:07:21.000Z",
    "title": "BNB Chain launches data storage solution Greenfield",
    "url": "https://crypto.news/bnb-chain-launches-data-storage-solution-greenfield/",
    "description": "The BNB Chain ecosystem has launched the mainnet of its highly anticipated Greenfield, marking a major milestone in decentralized data storage and management."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T16:02:32.000Z",
    "title": "Federal Reserve governor dampens prospects for future CBDC",
    "url": "https://crypto.news/federal-reserve-governor-dampens-prospects-for-future-cbdc/",
    "description": "Federal Reserve Governor Michelle Bowman recently expressed skepticism about the unique benefits of a U.S. CBDC over other financial alternatives at a Harvard Law School roundtable discussion."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T15:41:23.000Z",
    "title": "Bitcoin goes up, altcoins go down: analyst explains",
    "url": "https://crypto.news/bitcoin-goes-up-altcoins-go-down-analyst-explains/",
    "description": "The price of Bitcoin has surged over the past day, pumping nearly 10% to over $19,500. Meanwhile, most major altcoins like Ethereum have continued their downward trajectory."
  },
  {
    "source": "Kraken Blog",
    "date": "2023-10-17T16:03:46.000Z",
    "title": "Introducing the ultimate free fan engagement experience: Williams Racing Collectibles+ Grid Pass",
    "url": "https://blog.kraken.com/product/nft/introducing-the-ultimate-free-fan-engagement-experience-williams-racing-collectibles-grid-pass",
    "description": "Collect your free pass and unlock immediate exclusive digital and physical perks and access to unique Williams Racing experiences, powered by Kraken. Kraken, the Official Crypto and Web3 Partner of Williams Racing, is excited to announce a new innovation in fan engagement and digital collectibles; Williams Racing Collectibles+ Grid Pass, powered by Kraken. The program [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T16:00:58.000Z",
    "title": "Ripple Job Posting Sparks IPO Rumors, Will XRP Price Finally Cross $100?",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-ipo-rumors-xrp-price/",
    "description": "The Ripple Initial Public Offering (IPO) rumors continue to wax stronger as many expect that the event will push the XRP price upward. Back then, it was mostly just rumors and speculation, but the XRP community has gotten their hands on a Ripple job listing that suggests there might be some truth to the IPO rumors. Ripple Is Looking For A Shareholder Communications Manager In a listing that was shared by multiple influencers in the XRP community, Ripple looks to be on the hunt for a Shareholder Communications Senior Manager. Now, according to the job listing requirements, whoever is accepted for this role will be expected to basically work with multiple teams at Ripple and maintain communications between ‘prospective shareholders and investors.’ Related Reading: Crypto Research Firm Predicts 200% XRP Price Rally To $1.5 Also, the individual will be “managing a shareholder database/mailing list and investor/analyst communication database.” Given this description, many in the community have taken it as a sign that Ripple is hiring in preparation for a potential IPO. Source: X Some of the job descriptions also coincide with things and events that tend to take place in companies that have undergone the IPO process. One example pointed out in this Bitcoinist report is the Annual Analyst Day expected to the carried out by the Shareholder Communications Senior Manager. This is an event that is done by publicly traded companies. The expectations of a Ripple IPO go as far back as 2020 when its Chief Executive Officer (CEO) Brad Garlinghouse first talked about initial public offerings in crypto. Back then, Garlinghouse had said that “you’ll see initial public offerings in the crypto/blockchain space” in the next 12 months. He wasn’t far off as Coinbase would become the first crypto exchange to go public the next year on April 14, 2021. What Happens To XRP Price Is There Is An IPO? The impact of a potential Ripple IPO on the XRP price has been discussed at length, especially in the second half of this year. One of the very first mentions of this was by financial expert Linda Jones who talked at length about how valuable Ripple would be if there were an IPO. Related Reading: How Ripple’s Rumored Token Burn Could Affect The XRP Price Using the XRP market cap, Jones explained that at $35 a share, Ripple would be valued at $5.7 billion which is much lower than XRP’s $21 billion valuation. So the financial expert explained that Ripple’s valuation would be a lot higher. Eventually, she arrived at a $107 billion valuation which would mean Ripple stock would trade at a price of $600. Using XRP’s correlation to Ripple’s development, this could easily see the XRP price surge above $100. Crypto influencer Ben Armstrong aka BitBoy also shared his thoughts on what would happen to the XRP price in the event of an IPO. The influencer said back in July that he expects the XRP price to reach as high as $35 if Ripple were to undergo such a situation. While there is no confirmation from Ripple on this news, the consensus remains that such a move would be bullish for the XRP price. XRP briefly recovers above $0.5 &#124; Source: XRPUSD on Tradingview.com Featured image from Analytics Insight, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T16:10:13.000Z",
    "title": "Blackfort Exchange Network Announces Join and Invite Airdrop Campaign",
    "url": "https://www.crypto-news-flash.com/blackfort-exchange-network-announces-join-and-invite-airdrop-campaign/?utm_source=rss&utm_medium=rss&utm_campaign=blackfort-exchange-network-announces-join-and-invite-airdrop-campaign",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Blackfort33_1697557397co6LBQj1Co.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Blackfort33_1697557397co6LBQj1Co.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Blackfort33_1697557397co6LBQj1Co-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Blackfort33_1697557397co6LBQj1Co-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Blackfort33_1697557397co6LBQj1Co-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, United Arab Emirates, October 17th, 2023, Chainwire BlackFort Network has announced an airdrop campaign for its users to have BXN Tokens straightforwardly with an active participation to network. Every user downloading and registering the BlackFort Wallet gets 100 BXN as a join airdrop. If they invite their contacts and their contacts download the wallet, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T16:00:19.000Z",
    "title": "As Whale Accumulation of XRP Increases, NuggetRush Set To Explode on Investor Interest",
    "url": "https://www.crypto-news-flash.com/as-whale-accumulation-of-xrp-increases-nuggetrush-set-to-explode-on-investor-interest/?utm_source=rss&utm_medium=rss&utm_campaign=as-whale-accumulation-of-xrp-increases-nuggetrush-set-to-explode-on-investor-interest",
    "description": "<img width=\"512\" height=\"473\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74-300x277.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />XRP experienced an uptick in whale accumulation, indicating confidence in its potential and proposition. NuggetRush is poised for explosive growth following massive investor interest. NuggetRush’s blend of meme, P2E, and impact gaming will propel it to a 45x increase post-launch. Exciting trends have recently emerged in the crypto scene. Noteworthy ones include the surge in [...]"
  }
]