[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T04:54:37.000Z",
    "title": "What Happens to Football NFTs Now That Panini Lost its License?",
    "url": "https://www.coindesk.com/web3/2023/08/23/what-happens-to-football-nfts-now-that-panini-lost-its-license/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Don’t worry, your NFTs aren’t going to be lost to the ether anytime soon."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T05:00:03.000Z",
    "title": "Breaking Point: Bitcoin Fate Hangs On $25,400 Support, $20,500 Looms As Potential Bottom",
    "url": "https://www.newsbtc.com/bitcoin-news/breaking-point-bitcoin-fate-hangs-on-25400-support-20500-looms-as-potential-bottom/",
    "description": "Bitcoin (BTC), the leading cryptocurrency in terms of market capitalization, is displaying persistent indications of an ongoing downtrend. Currently oscillating between the $26,000 level and the $25,800 mark, it is edging closer to a crucial support level at $25,400.  The significance of this threshold cannot be overstated for BTC bulls, as it holds the potential to halt the ongoing decline. Bitcoin Faces Crucial Levels, Analyst Warns Of Potential Dip Bitcoin finds itself at a critical juncture as it tests a crucial support level, according to renowned crypto analyst Ali Martinez. The analyst points to the critical support level of $25,400, which serves as a make-or-break threshold for BTC bulls.  Related Reading: By The Numbers: Deciphering XRP’s Lost Momentum Amid The SEC Lawsuit According to his analysis, a breakdown below this level could trigger further downside momentum, potentially leading to a dip to $22,650 or even $20,590.  While cautioning about potential downside risks, Martinez also highlights a key resistance level that Bitcoin needs to overcome for a bullish trend reversal. The $28,830 mark emerges as a crucial hurdle that BTC must surpass to shift the market sentiment in favor of the bulls.  A successful breakthrough above this resistance level could trigger renewed buying interest and potentially ignite a sustained upward move for Bitcoin. However, as depicted in the chart above, Bitcoin briefly lost its crucial $25,400 support on August 17, dipping below the $25,100 mark. The breach triggered an immediate response from Bitcoin bulls, leading to a swift recovery and reclaiming of the $26,000 level. Nevertheless, what is certain, is that BTC has struggled to consolidate above this line and continue its upward momentum.  However, many market participants view this as a potential consolidation phase for Bitcoin, a pattern that has occurred historically after significant declines. These consolidation phases are often followed by a resumption of the bull run, as evidenced by previous instances. For instance, on March 11, Bitcoin experienced a sharp decline from its first yearly high of $25,000, only to recover and conclude a one-month uptrend on April 14 at $30,900. Similarly, on June 14, after falling from its initial yearly high to the $25,000 mark once again, Bitcoin recovered and surged to achieve another yearly high at $31,800. These historical instances suggest that the current price action for BTC is within the realm of normal. It follows a pattern of temporarily dampening investor hopes and then, under favorable circumstances, rebuilding confidence and propelling investors to new heights of optimism. Related Reading: Optimism (OP) Continues Market Recovery As Network Whales Triple Holdings Overall, the sustainability of Bitcoin&#8217;s upcoming support floor is yet to be determined, and it remains to be seen if this current price action will follow the historical pattern of recovery seen in the past.  Should this trend persist, there is a possibility of a short-term recovery ranging between $5,000 to $10,000 for the dominant cryptocurrency in the market. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T04:52:23.000Z",
    "title": "BNB Price Prediction: Why Bulls Could Aim Recovery To $230",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-prediction-recovery-to-230/",
    "description": "BNB price (Binance coin) is attempting a recovery from $202 against the US Dollar. The price could start a strong increase if it clears the $215 resistance level. Binance coin price is slowly moving higher from the $202 zone against the US Dollar. The price is now trading below $230 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $208 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair might gain bullish momentum above $215 and $216. Binance Coin Price Eyes Fresh Increase In the past few days, BNB price saw a major decline from well above the $235 level. The price declined below the $225 and $220 levels to enter a bearish zone, similar to Bitcoin and Ethereum. It even spiked below the $212 support. It tested the $202 zone and recently started an upside correction. There was a move above the $210 level. Besides, there was a break above a key bearish trend line with resistance near $208 on the 4-hour chart of the BNB/USD pair. However, BNB price is still trading well below $230 and the 100 simple moving average (4 hours). On the upside, it is facing resistance near the $214 level. It is close to the 23.6% Fib retracement level of the downward move from the $248 swing high to the $203 low. Source: BNBUSD on TradingView.com A clear move above the $214 zone could send the price further higher. The next major resistance is near $225 or the 50% Fib retracement level of the downward move from the $248 swing high to the $203 low. A close above the $225 resistance might increase the chances of a push above the $230 resistance. Another Decline in BNB? If BNB fails to clear the $214 resistance, it could start another decline. Initial support on the downside is near the $208 level. The next major support is near the $202 level. If there is a downside break below the $202 support, the price could drop toward the $200 support. Any more losses could send the price toward the $185 support. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is losing pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently near the 50 level. Major Support Levels – $208, $202, and $200. Major Resistance Levels – $214, $225, and $230."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T04:41:19.000Z",
    "title": "Shiba Inu Publishes Groundbreaking SHIBPaper to Improve the Whole Ecosystem and Connect 7.5 Billion People Worldwide – Can It Drive SHIB Price to $0.00000015? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inu-publishes-groundbreaking-shibpaper-to-improve-the-whole-ecosystem-and-connect-7-5-billion-people-worldwide-can-it-drive-shib-price-to-0-00000015-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-publishes-groundbreaking-shibpaper-to-improve-the-whole-ecosystem-and-connect-7-5-billion-people-worldwide-can-it-drive-shib-price-to-0-00000015-report",
    "description": "<img width=\"1280\" height=\"711\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-300x167.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-1024x569.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-768x427.png 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The Shiba Inu World Paper provides detailed insights into the entire Shiba Inu projects involving its services, products, partners, platforms, and ecosystem tokens. The Shiba Inu team also released upgraded security measures to prevent any further technical glitches in Shibarium. Amid a lot of chatter and FUD within the Shiba Inu ecosystem, the Shiba Inu [...]"
  }
]