[
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T18:00:00.000Z",
    "title": "Paxos receives in-principle approval to issue stablecoins in Abu Dhabi",
    "url": "http://cointelegraph.com/news/paxos-approval-stablecoins-abu-dhabi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2fcebee3-8f8c-4326-a0ae-cacea9ea6f82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The approval followed a similar move by regulators in Singapore, where Paxos said its local entity would launch a U.S. dollar-backed stablecoin.</p>\n                    <p><p>Crypto firm Paxos has secured in-principle approval from Abu Dhabi’s regulator on two fronts: to issue stablecoins and conduct digital asset services.</p><p>In a Nov. 29 announcement, Paxos <a href=\"https://www.prnewswire.com/news-releases/paxos-receives-in-principle-approvals-from-the-financial-services-regulatory-authority-to-issue-stablecoins-and-conduct-digital-asset-services-from-the-abu-dhabi-global-market-302000692.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the Financial Services Regulatory Authority in the Abu Dhabi Global Market had granted in-principle approval for the company to issue U.S. dollar-backed stablecoins, as well as “offer crypto-brokerage and custody services” in the Emirate. The approval <a href=\"https://cointelegraph.com/news/paxos-singapore-issue-usd-stablecoin-after-license-approval\">followed a similar move</a> by regulators in Singapore, where Paxos said its local entity would launch a U.S. dollar-backed stablecoin.</p><p>“Our IPAs from the FSRA, on the heels of our IPA from the Monetary Authority of Singapore, solidify our commitment to pursuing international growth through regulated frameworks,” said Paxos head of strategy Walter Hessert. “Paxos is unique in the industry for this approach and we will continue expanding our regulatory licensing to serve global enterprises as a trusted, innovative partner.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/iota-launches-100-million-abu-dhabi-foundation-for-middle-east-expansion\"><strong><em>Iota launches $100M Abu Dhabi foundation for Middle East expansion</em></strong></a></p><p>According to Paxos, it will continue to expand the use of its stablecoins upon full approval. The firm reiterated transparency regarding its stablecoin reserves as “stable, safe, and reliable.” PayPal <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">launched its PYUSD stablecoin</a> issued by Paxos in August.</p><p>On Nov. 1, the Abu Dhabi Global Market <a href=\"https://cointelegraph.com/news/abu-dhabi-global-market-comprehensive-dlt-foundations-regulations\">introduced comprehensive regulations</a> related to distributed ledger technology. The region began preparing regulations on cryptocurrency starting in 2018.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T17:46:28.000Z",
    "title": "Crypto Stories: Charlie Shrem tells how he became a Bitcoin millionaire",
    "url": "http://cointelegraph.com/news/crypto-stories-charlie-shrem-tells-how-became-bitcoin-millionaire",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/396ce706-92f9-46a6-8853-63a58992a3fc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Shrem made a fortune off his Bitcoin payment service, BitInstant, but then went to prison for alleged money laundering.</p>\n                    <p><p>Charlie Shrem went from running a small online business to becoming a Bitcoin millionaire and making the cover of Forbes magazine. And then, he went to prison.</p><p>In the <a href=\"https://www.youtube.com/watch?v=oXn5WvMhaqA\" target=\"_blank\" rel=\"noopener nofollow\">latest episode of Cointelegraph’s <em>Crypto Stories</em></a>, Shrem tells the story of how he founded BitInstant, grew it into a multimillion-dollar Bitcoin empire, an then was arrested for his role in it.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/oXn5WvMhaqA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Shrem’s first business was an e-commerce site that only charged $5 shipping per item. The idea was his cousin’s, but Shrem used his coding skills to create the actual site. The business sold lights, toothbrushes, razors, and other assorted items. </p><p>In his free time, Shrem hung out on online message boards. That’s where he found out about Bitcoin. At the time, the only way to buy Bitcoin was to wire transfer large amounts of funds to <a href=\"https://cointelegraph.com/news/the-mess-that-was-mt-gox-four-years-on\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/the-mess-that-was-mt-gox-four-years-on/amp\">Mt. Gox</a>, and it took a week for the deposit to clear within the banking system. A customer who wanted to buy smaller amounts or wanted to buy instantly had no way of doing so.</p><p>Shrem met up with a person in one of these forums named “Gareth,” and the two o started a business that would allow people to buy or sell Bitcoin instantly. Their company was called “BitInstant.” To allow for instant purchases, the company deposited money into Mt. Gox and purchased Bitcoin with it. They then sold this Bitcoin off in smaller amounts to various customers.</p><p>But Shrem and his partner ran into a problem. As their transaction volume grew, they needed more and more cash to deposit into Mt. Gox, and their capital was running out quickly, as Shrem explained:</p><blockquote>“It always needed more money because we were growing in transaction size. So in a way that an ATM needs money to sit in the machine all day, we needed money to sit in the exchanges for a week, [be]cause it would take up to a week to top up again. It was a cycle, so we always needed 7 to 8 times our transaction volume.”</blockquote><p>The two entrepreneurs met Roger Ver, who helped them with a $100,000 capital injection to continue scaling the business. Ver also suggested the team hire Eric Vorhees. Later, Vorhees and Shrem ran across David Azar at a tech convention, who invested more. Finally, during his honeymoon, Azar met Cameron and Tyler Winklevoss on a beach and convinced them to invest in the company, which provided enough cash to allow the company to overcome its scaling difficulties.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/erik-voorhees-lashes-disgusting-behavior-of-bitcoin-maxis-not-the-community-i-come-from\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/erik-voorhees-lashes-disgusting-behavior-of-bitcoin-maxis-not-the-community-i-come-from/amp\"><strong>Erik Voorhees lashes ‘disgusting’ behavior of Bitcoin maxis</strong></a></em></p><p>BitInstant grew so fast it eventually became responsible for 30% of all transactions on the Bitcoin blockchain. Meanwhile, Shrem was struggling in his relationships with his family and  the Jewish community he belonged to. Shrem began to feel that his religious community was stifling, especially after he fell in love with a person who was not Jewish. This frustration eventually reached a peak, and Shrem decided to leave the Jewish community.</p><p>Then, while attempting to disembark from a plane in New York, Shrem was <a href=\"https://cointelegraph.com/news/bitcoin_promotor_charlie_shrem_indicted\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin_promotor_charlie_shrem_indicted/amp\">arrested and charged with money laundering</a> for his role in BitInstant. Authorities claimed that some BitInstant customers had used the Bitcoin they purchased from the company for illicit purposes, including criminal transactions on the Silk Road dark web marketplace.</p><p>When released on bail, Shrem was placed under house arrest and forced to live with his strict Jewish parents, who believed that his arrest was a punishment from God in response to him leaving the community. “They thought I deserved what was coming to me,” Shrem said. “They were excited to see me go to jail, because they felt that I hurt them so hard.”</p><p>That's all for Part 1 of Charlie Shrem's crypto story. There is more to come in part 2.</p><p><em><strong>Follow the full story: </strong><a href=\"https://www.youtube.com/watch?v=oXn5WvMhaqA\" target=\"_blank\" rel=\"noopener nofollow\"><strong>The Untold Story of Charlie Shrem</strong></a><strong>.</strong></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T17:40:20.000Z",
    "title": "Ripple CTO David Schwartz calls for legislative action to clarify crypto regulations",
    "url": "https://cryptoslate.com/ripple-cto-david-schwartz-calls-for-legislative-action-to-clarify-crypto-regulations/",
    "description": "<p>David Schwartz, CTO of Ripple, recently shared his thoughts on the changing dynamics of U.S. securities law. Specifically, he addressed its application to digital assets and underscored the necessity for legislative clarity to pave the way for balanced regulation. Schwartz underscored the flexible nature of the Howey test, which serves as a cornerstone for securities [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-cto-david-schwartz-calls-for-legislative-action-to-clarify-crypto-regulations/\">Ripple CTO David Schwartz calls for legislative action to clarify crypto regulations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-29T18:00:32.000Z",
    "title": "ZKSpace Unveils Major Development: Expansion into BRC20 and Initial Plan for 2.0 Tokenomics Trilogy",
    "url": "https://news.bitcoin.com/zkspace-unveils-major-development-expansion-into-brc20-and-initial-plan-for-2-0-tokenomics-trilogy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/acc625af-9614-4493-b3cc-ee78e74f01bc.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. ZKSpace has recently announced two significant developments: its expansion into the BRC20 ecosystem and the unveiling of its Tokenomics 2.0 Trilogy. Expansion into the BRC20 Ecosystem: Background: Following the BTC network&#x2019;s Taproot upgrade, the BRC20 ecosystem has gained traction in the cryptocurrency domain. ZKSpace is now pivoting towards this ecosystem to meet growing [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-29T17:49:44.000Z",
    "title": "Bondex: Changing the Recruitment Landscape for Users Benefits",
    "url": "https://news.bitcoin.com/bondex-changing-the-recruitment-landscape-for-users-benefits/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bondex: Changing the Recruitment Landscape for Users Benefits\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bondex.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. London, United Kingdom, 29th November, 2023. Bondex, the groundbreaking decentralized professional talent network, is proud to announce the launch of its innovative Job Portal, marking a paradigm shift in the recruitment landscape. In partnership with some of the biggest names in the space for their first external marketing campaigns, including names like Coinlist [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T17:57:23.000Z",
    "title": "Sinbad crypto mixer sanctioned by U.S. Treasury",
    "url": "https://crypto.news/sinbad-crypto-mixer-sanctioned-by-u-s-treasury/",
    "description": "Sinbad was used by North Korean cyber criminals to launder hundreds of millions stolen from some of crypto’s biggest hacks like Ronin Bridge and Atomic Wallet, said the Treasury."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T18:00:06.000Z",
    "title": "A Golden Opportunity For Ethereum? 600% Buy Signal Returns",
    "url": "https://www.newsbtc.com/news/ethereum/golden-ethereum-signal-bull-market-is-imminent/",
    "description": "Ethereum has formed a “golden cross” pattern on the 1-week timeframe, marking the second such signal this year. While the long-term implications could be very positive if history repeats itself, there are reasons to temper expectations. A weekly golden cross has formed &#124; ETHUSD on TradingView.com Ethereum Golden Cross And A Possible Target For New ATHs 1W ETHUSD has formed a golden cross for the second time in 2023. A golden cross is a buy signal in moving average-based trading systems. It suggests that the trend is moving in an upward direction and because trends tend to persist, this is notable. The golden signal occurs when a shorter-term moving average (the 50-week MA) crosses through a longer-term moving average (the 200-week MA) from below. A death cross forms when the opposite happens. Related Reading: This Pattern Points To $10,000+ Ethereum Price, But When? The last confirmed golden cross for Ethereum in December 2020 preceded a massive 600% rally over the next year to the asset’s all-time high near $4,900. A repeat move of similar magnitude this time would put Ethereum above $12,000—over six times today’s price of around $2,000. However, it is important to note that not all golden crosses lead to the anticipated upside. In 2023 alone, 1W ETHUSD has death crossed and golden crossed twice now, demonstrating how moving average-based systems are prone to whipsaw without an established trend to follow. Above 20 on the ADX confirms the trend &#124; ETHUSD on TradingView.com An Uptrend Or More Whipsaw? How The ADX Confirms Trends The whipsawing death cross and golden cross price action on the Ethereum 1-week chart failed to generate follow-through in either direction. So how can we be sure that this isn&#8217;t yet another premature crossover? This is where the Average Directional Index (ADX) comes in when gauging the validity of moving average crosses. The ADX aims to measure trend strength, typically on a scale of 0 to 100. Related Reading: Ethereum Price Prediction for 2023, 2024, 2025, 2030 and Beyond As the 1-week ADX edges up from below 20, it confirms growing momentum that reduces the odds of more whipsawing price action. Traders often use such ADX readings to confirm golden/death crosses and enter only the most high-conviction signals. The 1W ETHUSD Average Directional Index isn&#8217;t yet above 20, but is approaching this key level. Above it, it gives the golden cross much more validity. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T17:45:00.000Z",
    "title": "Cristiano Ronaldo’s Partnership with Binance Results in a Lawsuit",
    "url": "https://coinedition.com/cristiano-ronaldos-partnership-with-binance-results-in-a-lawsuit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cristiano Ronaldo’s Partnership with Binance Results in a Lawsuit\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Footballer Cristiano Ronaldo has been sued by three investors for promoting Binance’s unregistered sale of securities. The investors allege that Ronaldo has been responsible for their losses as his promotions prompted them to invest in Binance. The complaint claims that Ronaldo should have known about Binance’s sale of unregistered securities. Portuguese footballer Cristiano Ronaldo has [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cristiano-ronaldos-partnership-with-binance-results-in-a-lawsuit/\">Cristiano Ronaldo’s Partnership with Binance Results in a Lawsuit</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-29T17:55:00.000Z",
    "title": "Central Banker Says Crypto ‘Miserably’ Failed Test of Money, Will Make Way for CBDCs and TradFi Products: Report",
    "url": "https://dailyhodl.com/2023/11/29/central-banker-says-crypto-miserably-failed-test-of-money-will-make-way-for-cbdcs-and-tradfi-products-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/central-banker-failed-test.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The head of Singapore&#8217;s central bank doesn&#8217;t think crypto has a future in financial services. Ravi Menon, the managing director of the Monetary Authority of Singapore (MAS), said in a speech earlier this month that cryptocurrencies have &#8220;failed the test of digital money.&#8221; &#8220;They have performed poorly as a medium of exchange or store of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/29/central-banker-says-crypto-miserably-failed-test-of-money-will-make-way-for-cbdcs-and-tradfi-products-report/\">Central Banker Says Crypto ‘Miserably’ Failed Test of Money, Will Make Way for CBDCs and TradFi Products: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]