[
  {
    "source": "Decrypt",
    "date": "2023-06-01T15:10:00.000Z",
    "title": "You 'Have' to Be on Mobile: InfiniGods Cofounders on Gaming",
    "url": "https://decrypt.co/videos/interviews/l3KBurz4/you-have-to-be-on-mobile-infinigods-cofounders-on-gaming",
    "description": "InfiniGods developers Damon Gura and Owen O’Donoghue share their stance on why mobile gaming is essential to Web3 adoption and general success in the video games industry."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T15:30:00.000Z",
    "title": "Google Bard Shiba Inu prediction Tradecurve price increased by 25%",
    "url": "https://cryptodaily.co.uk/2023/06/google-bard-shiba-inu-prediction-tradecurve-price-increased-by-25",
    "description": "<p class=\"s5\">The AI tool built by Google, known as Bard, has made waves across the Web3 space as a lot of users are using it for price prediction. One of the most notable altcoins to get a significant level of attention due to the bullish outlook of Google Bard is Shiba Inu, and today, we will explore why it thinks that the crypto has high-growth potential.</p>\n<p class=\"s5\">The presale-stage project Tradecurve has increased by 25% in the past week, and it has its own AI system as well that can change the way investors make decisions when trading.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p class=\"s8\">Google Bard Makes Prediction Surrounding Shiba Inu&rsquo;s Future Value</p>\n<p class=\"s5\">Google Bard was consulted to get the price predictions for the Shiba Inu cryptocurrency, as users on a global scale are using AI to check the future value of their favorite cryptocurrencies. Note that the price predictions that are made by the Google Bard AI might not always be 100% accurate or correct. However, they will provide much-needed insights into the potential future direction a cryptocurrency's value might be headed to. When Shiba Inu was released in 2020, it was dubbed the \"Dogecoin Killer\" and experienced a massive 1,500% increase after it was released. This excessive increase resulted in the crypto community speculating on the different scenarios, and one of them predicted that SHIB could climb to $1.</p>\n<p class=\"s5\">However, according to Google Bard, $1 is highly unlikely at this point. Bard's projection for the future of Shiba Inu is still optimistic, however. As of May 29, 2023, Shiba Inu trades at $0.00000883. Bard predicts that the maximum value for the cryptocurrency in 2023 is at $0.0000259, an increase of 193.32%. Aside from Shiba Inu, one other cryptocurrency caught the attention of crypto traders as well, and that project is Tradecurve.</p>\n<p></p>\n<p class=\"s8\">Tradecurve Already Sees an Increase of 25% And Can Spike By 100x At Launch</p>\n<p class=\"s5\">Tradecurve has transitioned from Stage 2 of its presale, where one TCRV token was worth $0.012, to Stage 3, where its price increased by 25%, and now trades at $0.015. Analysts and investors are eyeing the Tradecurve platform as it also implements AI to make trades, users can access hundreds of algorithmic and AI-driven trading systems and create AI-oriented bots to optimize the performance of their portfolio.</p>\n<p class=\"s5\">This hybrid platform requires no KYC, features Proof of Reserves (PoR), and allows anyone to make trades just by depositing crypto and then using it as collateral when trading other cryptocurrencies or any other derivative.</p>\n<p class=\"s5\">According to the Tradecurve whitepaper, the platform will feature high leverage beginning at 500:1, a VIP account service, zero requirements for FIAT payments, exclusive deposit bonuses, a dedicated Trading academy, and negative balance protection.</p>\n<p class=\"s5\">The team estimates that they will make $20 million during the presale and that they can onboard 100,000 new users at launch. TCRV will also get listed on Tier-1 exchanges and on Uniswap, and as a result, Google Bard predicts that TCRV can climb 100x by the end of 2023.</p>\n<p class=\"s5\">Learn more about Tradecurve and the TCRV utility token at the links below:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p class=\"s5\">&nbsp;</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T15:13:53.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T15:33:55.000Z",
    "title": "Filecoin Data Tools (FDT) Revolutionizes Data Onboarding: A Comprehensive Guide to the Latest Tools and Partnerships",
    "url": "https://www.crypto-news-flash.com/filecoin-data-tools-fdt-revolutionizes-data-onboarding-a-comprehensive-guide-to-the-latest-tools-and-partnerships/?utm_source=rss&utm_medium=rss&utm_campaign=filecoin-data-tools-fdt-revolutionizes-data-onboarding-a-comprehensive-guide-to-the-latest-tools-and-partnerships",
    "description": "<p>Filecoin has pushed the limits of blockchain engineering with the FDT innovation. This tool alongside its suite of lineups is designed to power a robust Decentralized Finance (DeFi) ecosystem. Open-source blockchain-based platform and data storage marketplace Filecoin (FIL) has launched a new tool dubbed Filecoin Data Tools (FDT) to revolutionize customer data onboarding. The Filecoin [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/filecoin-data-tools-fdt-revolutionizes-data-onboarding-a-comprehensive-guide-to-the-latest-tools-and-partnerships/\">Filecoin Data Tools (FDT) Revolutionizes Data Onboarding: A Comprehensive Guide to the Latest Tools and Partnerships</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T15:32:06.000Z",
    "title": "Pfizer, Samsung and Toyota are exploring crypto, Tradecurve named a top pick",
    "url": "https://www.crypto-news-flash.com/pfizer-samsung-and-toyota-are-exploring-crypto-tradecurve-named-a-top-pick/?utm_source=rss&utm_medium=rss&utm_campaign=pfizer-samsung-and-toyota-are-exploring-crypto-tradecurve-named-a-top-pick",
    "description": "<p>Top brands are beginning to embrace the cryptocurrency space, according to The Axios Harris Poll 100, an annual survey that is conducted by the news outlet known as Axios and the Market research firm known as Harris Poll with the goal of assessing the public reputation of notable brands in the United States.  This survey [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/pfizer-samsung-and-toyota-are-exploring-crypto-tradecurve-named-a-top-pick/\">Pfizer, Samsung and Toyota are exploring crypto, Tradecurve named a top pick</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T15:19:00.000Z",
    "title": "FDUSD Stablecoin Launches in Hong Kong Amid New Asset Trading Guidelines",
    "url": "https://coinedition.com/fdusd-stablecoin-launches-in-hong-kong-amid-new-asset-trading-guidelines/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FDUSD Stablecoin Launches in Hong Kong Amid New Asset Trading Guidelines\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Beijings-Web3-Adoption-Parallels-Hong-Kongs-Web3-Innovation.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>First Digital, a Hong Kong-based qualified custodian and trust company, has unveiled its new stablecoin, First Digital USD (FDUSD), pegged to the U.S. dollar but regulated in Asia. The unveiling coincides with the introduction of a new regulatory framework for digital assets in Hong Kong. According to a press release, the coin aims to provide [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fdusd-stablecoin-launches-in-hong-kong-amid-new-asset-trading-guidelines/\">FDUSD Stablecoin Launches in Hong Kong Amid New Asset Trading Guidelines</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]