[
  {
    "source": "CoinDesk",
    "date": "2023-10-04T12:25:09.000Z",
    "title": "First Mover Americas: Judge Dismisses SEC’s Attempt to Appeal Ripple Ruling ",
    "url": "https://www.coindesk.com/markets/2023/10/04/first-mover-americas-judge-dismisses-secs-attempt-to-appeal-ripple-ruling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Oct. 4, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T12:20:00.000Z",
    "title": "The Agenda podcast predicts the future of crypto and talks adoption",
    "url": "https://cointelegraph.com/news/the-agenda-podcast-predict-future-crypto-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e7b1b6c5-fea4-4bb2-b072-1289fa667476.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On Episode 20 of The Agenda, hosts Ray Salmond and Jonathan DeYoung interview each other about their blockchain journeys, the future of crypto and more.</p>\n                    <p><p>Cointelegraph’s podcast <em>The Agenda</em> first launched back in December 2022, with the first episode exploring the ways crypto can help <a href=\"https://cointelegraph.com/news/the-agenda-podcast-chats-crypto-and-sex-work-with-wetspace-ceo-allie-rae\">sex workers bypass bank censorship</a>. Since then, the show has explored myriad topics, ranging from <a href=\"https://cointelegraph.com/news/who-watches-the-watchers-cryptoharlem-founder-matt-mitchell-explains-why-surveillance-is-the-enemy\">hacktivism</a> and <a href=\"https://cointelegraph.com/news/mutual-aid-daos-and-activism-the-agenda-podcast-chats-with-pactdao-co-founder-marisa-rando\">blockchain-powered mutual aid</a> to the ways blockchain can be used to <a href=\"https://cointelegraph.com/news/the-agenda-podcast-chats-with-energy-web-on-how-to-fight-climate-change-with-help-of-blockchain\">fight climate change</a> and <a href=\"https://cointelegraph.com/news/origintrail-on-ai-real-world-adoption-and-the-value-of-knowledge-the-agenda-podcast\">combat artificial intelligence misinformation</a>.</p><p>On Oct. 4, <em>The Agenda</em> released its 20th episode — and to celebrate, co-hosts Jonathan DeYoung and Ray Salmond decided to interview each other to learn more about one another’s experience hosting the podcast, their blockchain journeys, their predictions for the future of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), and more.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b8bd5838-695c-412b-a0d9-d3e416ce61e8.jpg\"  /></figure><h2>Takeaways and lessons learned</h2><p>To kick things off, DeYoung asked Salmond if he had learned anything new from hosting <em>The Agenda</em>. Salmond shared that from an investment standpoint, the show emphasizes the importance of focusing less on short-term token prices and more on a project’s long-term fundamentals — aka, “adjusting one’s horizons.”</p><p>“I think what a lot of these builders and founders and projects demonstrate to us on the podcast is that their primary concern is not the token price,” Salmond said. “And for people that support the project, perhaps they should look beyond the token price too and see what sort of progress the project is making in its mission statement.”</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/how-blockchain-takes-the-electronic-music-industry-to-a-whole-new-level\">How blockchain takes the electronic music industry to a whole new level</a></strong></em></p><p>In return, Salmond asked DeYoung what first got him hooked on blockchain technology. DeYoung shared that after starting at Cointelegraph, he realized that the significance of decentralization of crypto was a broader extension of the principles he learned to be true while working in the area of community disaster resilience.</p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><p>“When you bring control to the community level and communities organize locally, people are more prepared for disasters, more resilient for disasters, and are able to respond and recover better from disasters,” DeYoung shared, adding:</p><blockquote>“When I started to think about that from the lens of decentralization, then it sort of started to click as to the whole crypto ethos is a much broader way of looking at this specific issue of community resilience and applying it just on a much larger scale, or applying it to different things instead.”</blockquote><h2>The future of crypto</h2><p>Both Salmond and DeYoung were curious about each other’s vision for what the future of crypto will hold. DeYoung believes that mass adoption is inevitable, given that <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">all the signs</a> have been pointing in that direction for a while now. However, he cautioned that crypto is at risk of being co-opted by powerful interests, as often happens with new technologies.</p><blockquote>“A realistic, maybe long-term vision for crypto would be something akin to how the internet is operated now, where there are a few centralized infrastructure providers, where everybody is using it or a lot of people are using it in some form or another without even realizing or without understanding how the back-end technology works,” said DeYoung. “I think there will always be radical implementations of blockchain, just as there is of the internet, but I feel like it might get sort of sanitized as time goes on.”</blockquote><p>Salmond, for his part, agreed that crypto would go mainstream and challenged the idea that another crypto “bubble” would pop anytime soon. “We are not in a bubble in crypto right now, not even close,” he argued. “The wand has not even been dipped into the soapy solution that someone would then hold and blow in to create a bubble.”</p><p>He added that while he doesn’t believe Bitcoin will replace the dollar as an international reserve currency, corporations and governments around the world are still likely to adopt it:</p><blockquote>“I do think that you will continue to see Bitcoin come onto corporate balance sheets and that you’ll see sovereigns also begin to put Bitcoin into their sovereign wealth funds or into their treasuries.”</blockquote><p>To hear more from DeYoung and Salmond’s conversation<em> </em>— including their perspectives on how the crypto space has evolved, their dream blockchain projects and more — listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out Cointelegraph’s <a href=\"https://cointelegraph.com/podcasts\">full lineup</a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T12:37:37.000Z",
    "title": "Failed 3AC co-founder Su Zhu $35M villa converted into an ecological urban farm",
    "url": "https://cryptoslate.com/failed-3ac-co-founder-su-zhus-35m-villa-converted-into-an-ecological-urban-farm/",
    "description": "<p>A $35 million villa in Singapore owned by Su Zhu, the co-founder of failed crypto hedge fund Three Arrows Capital (3AC), has reportedly been converted into a farm, local media Business Times reported. According to the report, the Yarwood Avenue property has been repurposed into an urban ecological farm run by Abundant Cities, a company [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/failed-3ac-co-founder-su-zhus-35m-villa-converted-into-an-ecological-urban-farm/\">Failed 3AC co-founder Su Zhu $35M villa converted into an ecological urban farm</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T12:11:03.000Z",
    "title": "OpenSea Launches 'Studio': New NFT Management Platform for Creators",
    "url": "https://cryptodaily.co.uk/2023/10/opensea-launches-studio-new-nft-management-platform-for-creators",
    "description": "Creators can configure allowlists, upload media and metadata, and construct dedicated project pages with ease."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T12:29:14.000Z",
    "title": "Bitcoin has bottomed but struggling with negative liquidity",
    "url": "https://crypto.news/bitcoin-has-bottomed-but-struggling-with-negative-liquidity/",
    "description": "Bitcoin price remains attractive due to low public interest despite negative liquidity identified by a Bloomberg analyst "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T12:15:45.000Z",
    "title": "Kraken’s Record BTC Deposit: Signaling a Surge Past $30K?",
    "url": "https://www.crypto-news-flash.com/krakens-record-btc-deposit-signaling-a-surge-past-30k/?utm_source=rss&utm_medium=rss&utm_campaign=krakens-record-btc-deposit-signaling-a-surge-past-30k",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Kraken sees a mammoth deposit of 14,924 Bitcoin, its most substantial inflow since 2018. With a 5% BTC price increase from the past week, speculation mounts on a potential break beyond the $30K mark. Deciphering Kraken&#8217;s Unprecedented BTC Deposit Blockchain analytics and on-chain data has revealed a compelling narrative for Bitcoin enthusiasts and investors. The [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T12:35:00.000Z",
    "title": "Bears Choke ADA Prices in 2023, Can Cardano Breath a Sigh of Relief?",
    "url": "https://coinedition.com/bears-choke-ada-prices-in-2023-can-cardano-breath-a-sigh-of-relief/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/ADA-Price-Drops-To-Immediate-Support-Level.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ADA Price Drops To Immediate Support Level\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/ADA-Price-Drops-To-Immediate-Support-Level.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/ADA-Price-Drops-To-Immediate-Support-Level-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/ADA-Price-Drops-To-Immediate-Support-Level-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/ADA-Price-Drops-To-Immediate-Support-Level-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/ADA-Price-Drops-To-Immediate-Support-Level-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Youtuber and CEO of Into The Cryptoverse, Benjamin Cowen made a comparison of Cardano’s (ADA) Return on investment (ROI) in 2019 with ROI in 2023. According to the tweet shared, it could be noted that the 2023 ROI has dwindled. In particular, the ROI rose from 1 to a value higher in 2023 during the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bears-choke-ada-prices-in-2023-can-cardano-breath-a-sigh-of-relief/\">Bears Choke ADA Prices in 2023, Can Cardano Breath a Sigh of Relief?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]