[
  {
    "source": "CoinDesk",
    "date": "2023-06-09T09:10:36.000Z",
    "title": "Crypto Exchange OKX Burns $258M of OKB Tokens in Record Move",
    "url": "https://www.coindesk.com/markets/2023/06/09/crypto-exchange-okx-burns-258m-of-okb-tokens-in-record-move/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "OKX periodically buys back and burns the tokens to gradually reduce their supply on the open market."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T09:15:44.000Z",
    "title": "Bitcoin price can gain 60% if 'textbook' chart pattern confirms — Trader",
    "url": "https://cointelegraph.com/news/bitcoin-price-can-gain-60-if-textbook-chart-pattern-confirms-trader",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4f4b823a-2750-4df9-956b-559a81261822.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is attempting to cement an inverse head and shoulders pattern, success in which could spark a \"sprint\" to $40,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) may be in line for 60% upside if a long-term chart feature stays intact.</p><p>In part of his <a href=\"https://twitter.com/mikybullcrypto/status/1666889525275009027\" target=\"_blank\" rel=\"noopener nofollow\">latest analysis</a> on June 8, popular trader Mikybull Crypto flagged encouraging signs on the BTC/USD weekly chart.</p><h2>Weekly Bitcoin price chart keeps $40,000 on the table</h2><p>With Bitcoin still wedged in a narrow trading range it entered almost three months ago, market participants have little to go on when it comes to short-term price targets.</p><p>Day-to-day performance has offered no decisive trend up or down — and $30,000 remains formidable resistance overhead.</p><p>“The market is still in the same position it has been the past few days. Don't get chopped up, place some bids at the extremes and wait,” trader Jelle <a href=\"https://twitter.com/CryptoJelleNL/status/1667088303458271234\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> in advice now typical of the current market perspective. </p><blockquote>“Stay focussed on the higher timeframe direction.”</blockquote><p>For Mikybull Crypto, however, those higher timeframes point to some much more interest price action around the corner.</p><p>The weekly chart, he argued, shows BTC/USD completing and now retesting an inverse <a href=\"https://cointelegraph.com/news/this-classic-trading-pattern-signaled-that-bitcoin-price-had-hit-a-top\">head and shoulders pattern</a>.</p><p>This is the bullish counterpart to the standard head and shoulders — a pattern that shows resistance being cemented and which is typically followed by downside. </p><p>While daily timeframes have seen that form of head and shoulders materialize around April’s $31,000 local highs, the broader trend may yet play out in bulls’ favor.</p><p>“Bitcoin is flashing a text book inverse head and shoulders on the weekly TF. Price is currently retesting the Neckline after the breakout,” Mikybull Crypto explained. </p><blockquote>“As taught, if the range between the head and neckline is usually the sprint, we are anticipating another 60% rally on BTC.”</blockquote><p>That 60% “sprint” would place BTC/USD at around $40,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/23ee6352-5ebf-43df-9c65-ba55d3c33a88.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Mikybull Crypto/Twitter</em></figcaption></figure><h2>Casting aside rangebound \"expectations\"</h2><p>The $40,000 mark and the nearby area is in fact already a popular target for various traders.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-bitcoin-supply-fell-over-10-in-the-past-year-glassnode\">US Bitcoin supply fell over 10% in the past year — Glassnode</a></em></strong></p><p>Crypto Kaleo has continued to <a href=\"https://cointelegraph.com/news/bitcoin-offers-good-signs-as-analysts-retain-40k-btc-price-target\">describe</a> $40,000 as a \"magnet\" for the market, while Bitcoin price has <a href=\"https://cointelegraph.com/news/bitcoin-traders-weigh-next-move-with-btc-price-at-crucial-200-week-trendline\">preserved</a> key support trend lines throughout the three-month range.</p><p>In a prediction this week, meanwhile, fellow trader and analyst Credible Crypto said that $40,000 would not form the ceiling for BTC in 2023.</p><p>\"Expectations: 'The Bitcoin halving is in April 2024. Expect $BTC to go sideways between 20-40k for about 12 months which is when we accumulate as much Bitcoin as we can. Once the halving hits, we start our next bull run to 100k+ into 2025. WAGMI,'\" he <a href=\"https://twitter.com/CredibleCrypto/status/1664797040654831616\" target=\"_blank\" rel=\"noopener nofollow\">told</a> followers. </p><blockquote>\"Reality: BTC makes a new ATH in 2023 leaving the majority sidelined. Not everyone makes it.\"</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T09:24:30.000Z",
    "title": "Poolin sent over 5K Bitcoin to exchanges since May 30",
    "url": "https://cryptoslate.com/insights/poolin-sent-over-5k-bitcoin-to-exchanges-since-may-30/",
    "description": "<p>Quick Take On June 5, CryptoSlate reported that a high volume of Bitcoin was being sent from miner balance to exchanges. Further analysis has confirmed a significant proportion of the miner outflow is attributable to the Poolin miner pool. Poolin sent 1,200 Bitcoin to Binance yesterday. This takes their total BTC outflow to 5,800 since [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/poolin-sent-over-5k-bitcoin-to-exchanges-since-may-30/\">Poolin sent over 5K Bitcoin to exchanges since May 30</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T09:34:04.000Z",
    "title": "Polygon (MATIC) And Uwerx (WERX) Are Two Altcoins With Possible Expanding Utilities In 2023",
    "url": "https://www.cryptopolitan.com/polygon-matic-and-uwerx-werx-are-two-altcoins-with-possible-expanding-utilities-in-2023/",
    "description": "One of the most proven and easy places for dApps to build and launch is on the Polygon(MATIC) blockchain. The advent of Web3 was to improve technology advancements in the global financial system, and Polygon is a network leading in this regard. However, Uwerx is a new project looking to join in this endeavor. The ... <a title=\"Polygon (MATIC) And Uwerx (WERX) Are Two Altcoins With Possible Expanding Utilities In 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-matic-and-uwerx-werx-are-two-altcoins-with-possible-expanding-utilities-in-2023/\" aria-label=\"More on Polygon (MATIC) And Uwerx (WERX) Are Two Altcoins With Possible Expanding Utilities In 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T09:26:53.000Z",
    "title": "Naked Gravity: TMS Network (TMSN) Distorting Space-Time Around Cosmos (ATOM) and Optimism (OP)",
    "url": "https://www.cryptopolitan.com/naked-gravity-tms-network-tmsn-distorting-space-time-around-cosmos-atom-and-optimism-op/",
    "description": "Enter the domain of groundbreaking cryptocurrencies with the emergence of TMS Network (TMSN). This revolutionary digital asset is making waves by not only disrupting the financial landscape but also distorting space-time around two prominent entities—Cosmos (ATOM) and Optimism (OP).&#160; Join us as we explore Cosmos (ATOM), Optimism (OP), the remarkable TMS Network (TMSN), and the ... <a title=\"Naked Gravity: TMS Network (TMSN) Distorting Space-Time Around Cosmos (ATOM) and Optimism (OP)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/naked-gravity-tms-network-tmsn-distorting-space-time-around-cosmos-atom-and-optimism-op/\" aria-label=\"More on Naked Gravity: TMS Network (TMSN) Distorting Space-Time Around Cosmos (ATOM) and Optimism (OP)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T09:25:52.000Z",
    "title": "Explore TMS Network (TMSN)’s Screaming Momentum Over Decentraland (MANA) and Chainlink (LINK)",
    "url": "https://www.cryptopolitan.com/explore-tms-network-tmsns-screaming-momentum-over-decentraland-mana-and-chainlink-link/",
    "description": "Amidst the dynamic cryptocurrency landscape, where new opportunities constantly arise, one cannot ignore the incredible surge of TMS Network (TMSN). This decentralized platform has captivated the attention of investors and enthusiasts alike, pushing existing cryptos like Decentraland (MANA) and Chainlink (LINK) to the side.&#160; This article will unveil the most recent updates surrounding Decentraland (MANA) ... <a title=\"Explore TMS Network (TMSN)&#8217;s Screaming Momentum Over Decentraland (MANA) and Chainlink (LINK)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/explore-tms-network-tmsns-screaming-momentum-over-decentraland-mana-and-chainlink-link/\" aria-label=\"More on Explore TMS Network (TMSN)&#8217;s Screaming Momentum Over Decentraland (MANA) and Chainlink (LINK)\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T09:14:49.000Z",
    "title": "Pepecoin 15% Drop Sparks Speculation: Will Further Pain Follow?",
    "url": "https://www.newsbtc.com/news/pepecoin-15-drop-sparks-speculation-will-further-pain-follow/",
    "description": "Pepecoin (PEPE) is now facing a daunting challenge as it experiences a substantial decline from its recent major surge.  Despite an impressive rally of over 50,000% between April 15 and May 5, PEPE has seen its value plummet by more than 60%, with a significant 15% drop occurring in the past week alone.  The sudden decline in Pepecoin&#8217;s value has triggered a wave of uncertainty among market participants. Many are now questioning whether this dip is just a temporary setback or a sign of deeper underlying issues. Related Reading: FUD Storm: Top 5 Market Losers In Heightened Uncertainty Pepecoin Price Movement Creates Bearish Sentiment Pepecoin (PEPE) witnessed a breakout in its price yesterday, but the momentum was short-lived as it quickly plummeted by over 30%, establishing a new low. This sharp decline has given rise to a large descending triangle pattern, signaling a potentially bearish outlook for the cryptocurrency. $PEPE PRICE BROKE OUT YESTERDAY BUT DID NOT HOLD. WAITING TO SEE A SUCCESSFUL RETEST TO CONFIRM REVERSAL.#PEPEARMY pic.twitter.com/cdsrLBcTOO — 0x1ee7 (@0x1ee7) June 7, 2023 Currently, PEPE faces a support level at $0.0000010, while resistance is encountered at $0.0000013. As the price approaches the apex of this formation, a crucial point where the triangle converges, PEPE could be poised for a significant movement in the coming days. Total market cap of cryptocurrencies currently at $1.07 trillion on the daily chart at TradingView.com PEPE is currently trading at a price of $0.00000112 via CoinGecko, showing a modest 24-hour rally of 2.7%. However, over the past seven days, the coin has experienced a decline of 12.3%. Source: Coingecko Investors and traders closely monitoring PEPE are advised to exercise caution as the price nears a critical juncture. The impending move from the apex of the descending triangle formation could potentially determine the direction in which the coin will head next. Mixed Signals In Trading Volume Pepecoin presents a mixed picture when considering its trading volume and market capitalization. While the price decline raises concerns, other metrics suggest a more optimistic scenario for the meme-based cryptocurrency. According to CoinMarketCap, PEPE has experienced an increase in trading volume, rising by 27% over the past 24 hours to reach $241 million. This surge in trading activity indicates that there is still considerable interest and engagement from market participants, potentially hinting at underlying support for the coin. Related Reading: Polkadot Metrics Surge With Project Launches – Good News For DOT Price? In addition, PEPE&#8217;s market capitalization has shown a slightly bullish trend, with a notable jump of 20.23% to reach $492 million.  However, it is important to note that trading volume and market capitalization do not necessarily guarantee a sustained recovery or an upward price movement for PEPE.  These metrics can be influenced by various factors, including short-term trading activity and speculative interest. Therefore, while they provide some positive indications, they should be interpreted cautiously in the context of PEPE&#8217;s bearish bias. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) Featured image from mvaligursky/DepositPhotos"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T09:15:14.000Z",
    "title": "Bitcoin Remains Resilient at $26.5K Amid Binance, Coinbase Turmoil: Is BTC’s Price Heading for $20,000 or $30,000 Next? Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-remains-resilient-at-26-5k-amid-binance-coinbase-turmoil-is-btcs-price-heading-for-20000-or-30000-next-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-remains-resilient-at-26-5k-amid-binance-coinbase-turmoil-is-btcs-price-heading-for-20000-or-30000-next-report",
    "description": "<p>Selling pressure in Bitcoin and altcoins have subsided with BTC registering a good bounce back from under $26,000 levels. There is a shift in the global landscape of digital assets, with a movement of BTC supply from the West to the East, driven by rising regulatory scrutiny in the US and other Western countries. With [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-remains-resilient-at-26-5k-amid-binance-coinbase-turmoil-is-btcs-price-heading-for-20000-or-30000-next-report/\">Bitcoin Remains Resilient at $26.5K Amid Binance, Coinbase Turmoil: Is BTC&#8217;s Price Heading for $20,000 or $30,000 Next? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-09T09:15:37.000Z",
    "title": "Ancient Bitcoin Whale Comes Alive, Moves $37,854,468 in BTC at 13,435% Profit",
    "url": "https://dailyhodl.com/2023/06/08/ancient-bitcoin-whale-comes-alive-moves-37854468-in-btc-at-13435-profit/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/mysterious-bitcoin-whale.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Bitcoin (BTC) whale that has lain low for slightly over a decade is suddenly coming alive, according to on-chain data. Blockchain tracker Lookonchain says that the long-dormant address has moved 1,432 Bitcoin after lying low since April 2013. &#8220;A BTC whale that has been dormant for 10.2 years transferred all 1,432.93 BTC (worth approximately [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/ancient-bitcoin-whale-comes-alive-moves-37854468-in-btc-at-13435-profit/\">Ancient Bitcoin Whale Comes Alive, Moves $37,854,468 in BTC at 13,435% Profit</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]