[
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T06:17:22.000Z",
    "title": "How easy is a SIM swap hack and how does one guard against it?",
    "url": "https://cointelegraph.com/news/crypto-sim-swap-how-easy-is-sim-swap-crypto-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/f895a90c-8c6c-4b00-b588-8bb9ebc50b9d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As SIM swap attacks are often seen as non-demanding in terms of technical skills, users must pay due diligence to their identity security.</p>\n                    <p><p>Despite the rise of cybersecurity infrastructure, the online identity still faces many risks, including those related to the hacks of one’s phone numbers.</p><p>In early July, LayerZero CEO Bryan Pellegrino became one of the latest victims of a SIM swap attack, which allowed hackers to briefly take over his Twitter.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And... we&#39;re back in. This was basically my life for the past 24 hours. Luckily we saw hack immediately and the battle began <a href=\"https://t.co/pjrkMfQ2vT\">pic.twitter.com/pjrkMfQ2vT</a></p>&mdash; Bryan Pellegrino (@PrimordialAA) <a href=\"https://twitter.com/PrimordialAA/status/1676726399955251202?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“My guess is that somebody grabbed my badge out of the trash and somehow was able to trick a rep into using it as a form of ID for the SIM swap while I was leaving Collision,” Pellegrino wrote soon after having his Twitter account back.</p><p>“It was ‘Bryan Pellegrino — speaker’ just your normal paper conference badge,” Pellegrino told Cointelegraph.</p><p>The incident involving Pellegrino’s mishap may lead to users assuming that performing a SIM swap hack is as easy as just grabbing someone’s badge. Cointelegraph has reached out to some cryptocurrency security firms to find out whether that’s the case.</p><h2>What is a SIM swap hack? How big is it?</h2><p>A SIM swap hack is a form of identity theft where attackers <a href=\"https://cointelegraph.com/news/sim-swap-hackers-target-crypto-investors-cell-services-not-available\">take over a victim’s phone number</a>, allowing them to gain access to bank accounts, credit cards or crypto accounts.</p><p>In 2021, the Federal Bureau of Investigation <a href=\"https://www.ic3.gov/Media/Y2022/PSA220208\" target=\"_blank\" rel=\"noopener nofollow\">received</a> more than 1,600 SIM swapping complaints involving losses of more than $68 million. This represented a 400% increase in the number of complaints received in the three prior years, indicating that SIM swapping is “definitely on the rise,” CertiK’s director of security operations Hugh Brooks told Cointelegraph.</p><p>“If there is no move away from SMS-based 2FA and telecommunications providers do not lift their security standards, we are likely to see attacks continue to grow,” Brooks stated.</p><p>According to SlowMist chief information security officer (CISO) 23pds, SIM swapping is currently not too widespread, but it has a significant potential to rise further in the near future. He stated:</p><blockquote>“As the popularity of Web3 grows and attracts more people into the industry, the likelihood of SIM swapping attacks also increases due to its relatively lower technical requirements.”</blockquote><p>23pds mentioned a few cases involving SIM swap hacks in crypto over the past few years. In October 2021, Coinbase officially <a href=\"https://oag.ca.gov/system/files/09-24-2021%20Customer%20Notification.pdf\" target=\"_blank\" rel=\"noopener nofollow\">disclosed</a> that hackers stole crypto from at least 6,000 customers due to a 2FA breach. Previously, British Hacker Joseph O’Connor was indicted in 2019 for <a href=\"https://cointelegraph.com/news/plugwalkjoe-indicted-for-784k-cryptocurrency-theft-scheme\">stealing roughly $800,000 in crypto</a> via multiple SIM swap hacks.</p><h2>How hard is it to perform a SIM swap hack?</h2><p>According to CertiK’s exec, SIM swap hacking can often be done with information that is publicly available or can be obtained through social engineering.</p><p>“Overall, SIM swapping might be seen as a lower barrier to entry for attackers when compared to the more technically demanding attacks like smart contract exploits or exchange hacks,” Brooks said.</p><p>SlowMist’s 23pds agreed that SIM swapping doesn’t require high-level technical skills. He also noted that such SIM swaps are “prevalent even in the Web2 world,” so it's “not surprising” to see it emerge in the Web3 environment as well.</p><p>“It is often easier to execute, with social engineering being used to deceive relevant operators or customer service personnel,” 23pds said.</p><h2>How to prevent SIM swapping hacks?</h2><p>As SIM swap attacks are often seen as non-demanding in terms of hackers’ technical skills, users must pay due diligence to their <a href=\"https://cointelegraph.com/news/how-to-protect-your-identity-online\">identity security to prevent such hacks</a>.</p><p>The core protection measure from a SIM swap hack is to restrict the usage of SIM card-based methods for 2FA verification. Instead of relying on methods like SMS, one should better use apps like Google Authenticator or Authy, Hacken’s Budorin noted.</p><p>SlowMist CISO 23pds also mentioned more strategies like multi-factor authentication and enhanced account verification like additional passwords. He also strongly recommended users to establish strong PIN or passwords for SIM cards or mobile phone accounts.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sim-swap-hacker-plugwalk-joe-sentenced-to-five-years-in-prison\"><strong><em>Over $765K worth of NFTs stolen after SIM swap attack on Gutter Cat Gang</em></strong></a></p><p>Another measure to avoid SIM swapping is to properly protect personal data like name, address, phone number and date of birth. SlowMist CISO also recommended scrutinizing online accounts for any anomalous activity.</p><p>Platforms should be also responsible for promoting safe 2FA practices, CertiK’s Brooks stressed. For example, firms can require additional verification before allowing changes to account information and educate users about the risks of SIM swapping.</p><p><em>Additional reporting by Cointelegraph editor Felix Ng.</em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\"><strong><em>Asia Express: China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival</em></strong></a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T06:33:00.000Z",
    "title": "Aave Protocol Launches GHO Stablecoin on Ethereum Mainnet with $2M Minted",
    "url": "https://www.cryptopolitan.com/aave-protocol-gho-stablecoin-on-ethereum/",
    "description": "Decentralized finance (DeFi) platform Aave has recently unveiled its new stablecoin, GHO, on the Ethereum mainnet. GHO is an algorithmic dollar-pegged stablecoin designed to provide stability and transparency to the DeFi ecosystem. With over $2.19 million worth of GHO minted already, Aave aims to revolutionize the stablecoin landscape through its decentralized and over-collateralized approach. This ... <a title=\"Aave Protocol Launches GHO Stablecoin on Ethereum Mainnet with $2M Minted\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-protocol-gho-stablecoin-on-ethereum/\" aria-label=\"More on Aave Protocol Launches GHO Stablecoin on Ethereum Mainnet with $2M Minted\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T06:27:10.000Z",
    "title": "How AI-Powered Regtech Delivers Enhanced Compliance and Risk Management",
    "url": "https://www.cryptopolitan.com/ai-powered-regtech-delivers-compliance/",
    "description": "The financial industry is witnessing a disruptive force with the emergence of AI-powered Regtech (regulatory technology), revolutionizing compliance and risk management operations. At the core of this transformation lies Artificial Intelligence (AI), wielding powerful algorithms and machine learning to automate and optimize regulatory processes. As AI-driven Regtech solutions automate compliance operations and provide predictive insights, ... <a title=\"How AI-Powered Regtech Delivers Enhanced Compliance and Risk Management\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-regtech-delivers-compliance/\" aria-label=\"More on How AI-Powered Regtech Delivers Enhanced Compliance and Risk Management\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T06:22:44.000Z",
    "title": "USTC Surprises With Nearly 60% Rally – What’s Going On?",
    "url": "https://www.newsbtc.com/news/ustc-surprises-with-nearly-60-rally-whats-going-on/",
    "description": "The value and popularity of TerraUSD Classic, or USTC, the algorithmic stablecoin of the Terra Classic (LUNC) ecosystem, have skyrocketed recently. Today, the stablecoin makes a surprise rally, sparking a great deal of interest among investors and cryptocurrency aficionados. The sharp growth in USTC could be an indication of a sharp rise in demand and emphasizes the market&#8217;s rising confidence in this stablecoin. Data from crypto market tracker Coingecko shows USTC trading at $0.0186, notching a 24-hour increase in value of 21.4%. In the last seven days, the stablecoin registered an impressive 58% rally, causing its trading volume to balloon to a solid 409%. Source: Coingecko USTC Organic Growth Pushes Stablecoin Up Despite the fact that the causes of this upswing are yet unknown, the recent spike in USTC&#8217;s value shows organic growth. &#8220;Organic growth&#8221; refers to the increase in value of USTC that occurs naturally, without the influence of external factors or artificial means. Related Reading: Dogecoin Engagement Fails To Impress, Raising Concerns About Broader Interest It suggests that the growth is the result of the company&#8217;s internal operations, strategies, and market dynamics, rather than being driven by external factors such as acquisitions, mergers, or financial manipulations. After it was de-pegged more than a year ago, USTC saw a huge price decline. Since USTC is a stablecoin with a 1:1 tie to the USD, its price should always be $1. The stablecoin has since traded at lower prices, reaching a 52-week high of $0.06 during that time. There are signs, nevertheless, that USTC could revisit the $1 level and recoup its worth. Total market cap of cryptocurrencies as of today stood at $1.17 trillion. Chart: TradingView.com The TerraUSD Classic de-pegging caused major difficulties for the larger digital currency ecosystem, and its effects are still being felt today. A few Web3.0 firms with exposure to its parent company Terraform Labs went out of business in addition to the more than 99% decline in price of its linked cryptocurrency, Terra Classic. Related Reading: BNB Chain Inks New Record With Soaring User Activity – A Boost For Price? The implosion of FTX Derivatives Exchange was finally driven by the bankruptcies of Celsius Network and Voyager Digital, which prolonged the crypto winter even further. Meanwhile, in order to expand supply and rekindle interest in the stablecoin, the Terra Classic community is launching projects like staking and burning LUNC tokens while also working to improve infrastructure. Source: Coingecko Will The Terra Classic Stablecoin Retest $1? There is growing consensus that the TerraUSD Classic token is steadily approaching a retesting of the significant $1 price level. Among investors and enthusiasts alike, this strong rising trend has spurred new optimism. As the TerraUSD Classic token gains momentum, it boosts community members&#8217; faith in its capability to uphold its pegged value and function as a dependable digital asset. The community may become excited and eager in anticipation of a probable retest of the $1 price level, which would improve the outlook for TerraUSD Classic&#8217;s long-term prospects. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Analytics Insight"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T06:11:32.000Z",
    "title": "Billion-Dollar Exchange Binance has completed Bitcoin Lightning Network Integration Revolutionizing BTC Withdrawals and Transactions Speed",
    "url": "https://www.crypto-news-flash.com/billion-dollar-exchange-binance-has-completed-bitcoin-lightning-network-integration-revolutionizing-btc-withdrawals-and-transactions-speed/?utm_source=rss&utm_medium=rss&utm_campaign=billion-dollar-exchange-binance-has-completed-bitcoin-lightning-network-integration-revolutionizing-btc-withdrawals-and-transactions-speed",
    "description": "<img width=\"1431\" height=\"805\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Smart Chain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain.jpg 1431w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain-1024x576.jpg 1024w\" sizes=\"(max-width: 1431px) 100vw, 1431px\" />The integration allows Binance users to conduct deposits and withdrawals on the Bitcoin Lightning Network. Binance&#8217;s integration of the Lightning Network for Bitcoin transactions also sets an example for other exchanges. Earlier today on Monday, July 17, crypto exchange Binance made an official announcement of completing the integration of the Bitcoin Lightning Network at its [...]"
  }
]