[
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T02:13:01.000Z",
    "title": " ​​Farcaster sees 400% increase in daily active users amid ‘frames’ frenzy ",
    "url": "https://cointelegraph.com/news/farcaster-daily-active-users-warpcast-frames",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDE4NDg4ZjUtYTA0OS00MzM3LWExMmYtZWZjMTk5NDg2ZjliLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Farcaster network has notched nearly 25,000 daily active users following amid a surge of new interest in a new innovation called “frames” on its Warpcast app. </p>\n                    <p><p>Daily active users on the Farcaster protocol — a decentralized network for social media applications — has spiked a staggering 400% over the last week following the introduction of “frames” on its social media application Warpcast.</p><p>Daily active users on the Farcaster network grew from approximately 5,000 on Jan. 28 to over 24,700 by Feb. 3, according to Dune Analytics <a href=\"https://dune.com/pixelhack/farcaster\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. Frames were added to Warpcast on Jan. 27. </p><p>The influx of new user activity has been linked to a spike in interest for “frames” — a new innovation that allows users to engage with external links and applications without leaving the Warpcast app. </p><p><a href=\"https://cointelegraph.com/news/farcaster-daily-active-users-warpcast-frames\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T02:12:57.000Z",
    "title": "Forward Protocol Goes Native with $FORWARD IVO Round on GoForward",
    "url": "https://www.cryptopolitan.com/forward-protocol-goes-native-with-forward-ivo-round-on-goforward/",
    "description": "The Forward project is pleased to share the news about the $FORWARD IVO round, which is about to go live on its in-house launchpad—GoForward. The $FORWARD IVO will be the first token offering hosted on the GoForward platform. The IVO round is the next phase of a coordinated $FORWARD token launch campaign, ramping up to [&#8230;]"
  }
]