[
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T05:51:45.000Z",
    "title": "JPEX crypto exchange launches asset-lock-up plan, as some users cry foul",
    "url": "https://cointelegraph.com/news/jpex-crypto-exchange-dividend-plan-users-cry-foul-ca",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/2de6dd84-fe12-407f-a680-d4cd651f8b05.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>JPEX has pushed ahead with its DAO Shareholder Dividend Scheme. However, some users claim their assets are being converted without their knowledge.</p>\n                    <p><p>Embattled crypto exchange JPEX has pushed ahead with a plan that will purportedly transition the platform into a decentralized autonomous organization (<a href=\"https://cointelegraph.com/daos-for-beginners/what-is-a-dao\">DAO</a>) and convert user assets to dividend shares with an incentive to lock them up for two years.</p><p>An Oct. 4 <a href=\"https://blog.jp-ex.io/en/dao-shareholder-dividend-program-referendum-results/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> from JPEX said voting for its “DAO Shareholder Dividend Scheme” was completed on Sept. 28, claiming that 68% of users voted in favor for the scheme.</p><p>The scheme <a href=\"https://blog.jp-ex.io/en/n-special-announcement-20230920/\" target=\"_blank\" rel=\"noopener nofollow\">involves</a> letting users convert their currently frozen assets to DAO Stakeholder dividends at a 1:1 ratio, with JPEX offering a repurchase option at 30% of the conversion price after a year and a 100% repurchase after two years. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8a90035a-cfb9-4d90-ba76-701cc08aed3b.png\"  /><figcaption style=\"text-align: center;\"><em>Example of JPEX’s DAO dividend scheme repurchase options. Source: JPEX</em></figcaption></figure><p>In an earlier announcement, JPEX said users who agreed to the scheme will receive dividends from JPEX through new token listing and trading fees and would receive a distribution of JPEX Coin (JPC) — the exchange’s native token — in proportion to shareholder dividends.</p><p>The scheme appears to be an incentive for users to keep their funds on the embattled exchange, which has been experiencing liquidity issues. </p><p>However, a JPEX user — who was given anonymity — told the South China Morning Post in an Oct. 4 <a href=\"https://www.scmp.com/news/hong-kong/law-and-crime/article/3236716/hong-kong-jpex-crypto-scandal-dividends-plan-defiant-platform-prevents-users-withdrawing-assets?campaign=3236716&amp;module=perpetual_scroll_0&amp;pgtype=article\" target=\"_blank\" rel=\"noopener nofollow\">report</a> claims her assets had been converted seemingly without her agreement or prior knowledge.</p><p>She claims that she and other users found they could no longer withdraw their assets following JPEX’s announcement to proceed with the plan.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Hong Kong police and the city’s Securities and Futures Commission have formed a joint task force to crack down on illegal crypto exchange activities. Meanwhile, the JPEX scandal continues to unfold. <a href=\"https://t.co/lOBRNlLs7m\">https://t.co/lOBRNlLs7m</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709745869904629863?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“All of my [Tether] USDT and other cryptocurrencies are gone,” the person said. She claimed her assets were converted to JPC — a low liquidity token with few use cases.</p><p>“Some other users holding the tokens and other assets have also found them transferred,” the user said. “Given the unknown price and the impossibility of withdrawal, our assets have now become just waste paper.”</p><p>It’s not known if the people quoted in the report voted in favor of the plan but some JPEX users previously told the SCMP they’d been forced to accept the plan as there was no option to vote against it on its app.</p><p>JPEX did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-binance-ceo-cz-rejected-sbf-40m-request-futures-exchange-book\"><strong><em>New book claims Binance CEO CZ rejected SBF’s $40M request for futures exchange</em></strong></a></p><p>JPEX’s dividend plan comes amid Hong Kong police <a href=\"https://cointelegraph.com/news/jpex-scandal-fraud-hong-kong-arrests-sfc-masterminds\">arresting multiple people</a> in connection with the exchange as it’s <a href=\"https://cointelegraph.com/news/jpex-increases-withdrawal-fee-to-almost-1k-after-warning-from-hong-kong-s-watchdog\">accused of operating</a> an unauthorized crypto platform by the region's securities watchdog.</p><p>Hong Kong police say the Dubai-based exchange defrauded at least 2,300 people of $178 million (1.4 billion Hong Kong dollars).</p><p>Earlier on Oct. 4, the region's police and securities regulator <a href=\"https://cointelegraph.com/news/hong-kong-police-sfc-crypto-task-force-jpex-scandal\">launched a crypto-focused task force</a> aiming to combat illicit activities by crypto exchanges.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-05T05:46:57.000Z",
    "title": "Hong Kong Exchanges and Clearing Limited Is Using Smart Contracts",
    "url": "https://www.cryptoglobe.com/latest/2023/10/hong-kong-exchanges-and-clearing-limited-is-using-smart-contracts/",
    "description": "On 4 October 2023, Hong Kong Exchanges and Clearing Limited (HKEX) announced the imminent launch of Synapse, a groundbreaking platform set to debut on 9 October. Synapse aims to bring a new level of automation and efficiency to settlement activities within the Stock Connect program. According to HKEX’s press release, Synapse leverages DAML smart contracts […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-05T06:00:44.000Z",
    "title": "Report: Tom Brady Received $55 Million for FTX Commercials Before Its Collapse",
    "url": "https://news.bitcoin.com/report-tom-brady-received-55-million-for-ftx-commercials-before-its-collapse/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Tom Brady Received $55 Million for FTX Commercials Before Its Collapse\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/brady.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a report, former National Football League quarterback Tom Brady was paid $55 million to feature in the collapse cryptocurrency exchange FTX&#8217;s advertisements. As part of the arrangement, Brady would devote 20 hours of his time each year for three years. Celebrities Paid to Promote FTX The former U.S. National Football League (NFL) quarterback [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T05:43:15.000Z",
    "title": "How Are Chinese AI Firms Surpassing Regulatory Hurdles for Innovation?",
    "url": "https://www.cryptopolitan.com/chinese-ai-firms-surpass-regulatory-hurdles/",
    "description": "In a surprising revelation, the Chinese government, often perceived as imposing stringent controls on emerging technologies, is revealed to be actively supporting and enabling the growth of its artificial intelligence sector. Contrary to popular belief, the interim measures on generative AI, initially met with skepticism, highlight a strategic motivation to foster indigenous innovation. This article ... <a title=\"How Are Chinese AI Firms Surpassing Regulatory Hurdles for Innovation?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinese-ai-firms-surpass-regulatory-hurdles/\" aria-label=\"More on How Are Chinese AI Firms Surpassing Regulatory Hurdles for Innovation?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T05:43:01.000Z",
    "title": "Bitcoin Cash Price Won’t Go Down Quietly – Risk of Bounce Grows",
    "url": "https://www.newsbtc.com/analysis/bch/bitcoin-cash-price-support-220/",
    "description": "Bitcoin Cash price is holding the key $220 support against the US Dollar. BCH seems to be aiming for a fresh increase unless there is a move below $220. Bitcoin cash price is showing positive signs above the $220 level against the US Dollar. The price is trading above $220 and the 100 simple moving average (4 hours). There was a break below a key bullish trend line with support near $238 on the 4-hour chart of the BCH/USD pair (data feed from Kraken). The pair could start a fresh increase unless there is a move below $220. Bitcoin Cash Price Holds Support In the past few days, Bitcoin Cash price saw a steady decline from the $255 resistance zone. BCH declined below the $240 support to enter a short-term bearish zone, like Bitcoin and Ethereum. The price declined below the 50% Fib retracement level of the upward move from the $203 swing low to the $255 high. Besides, there was a break below a key bullish trend line with support near $238 on the 4-hour chart of the BCH/USD pair. However, the bulls were active above the $220 support. The price found support near the 61.8% Fib retracement level of the upward move from the $203 swing low to the $255 high. Bitcoin Cash is now trading above $220 and the 100 simple moving average (4 hours). Immediate resistance is near the $236 level. The next major resistance is near $244. Any further gains could lead the price toward the $250 resistance zone. Source: BCH/USD on TradingView.com The next major hurdle is near the $262 level, above which BCH might start a decent increase toward the $280 level or $288 in the coming days. Downside Break in BCH? If Bitcoin Cash price fails to clear the $244 resistance, it could start a fresh decline. Initial support on the downside is near the $225 level. The next major support is near the $220 level, where the bulls are likely to appear. If the price fails to stay above the $220 support, the price could test the $212 support. Any further losses could lead the price toward the $200 zone in the near term. Technical indicators 4-hour MACD – The MACD for BCH/USD is losing pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI is currently below the 50 level. Key Support Levels – $225 and $220. Key Resistance Levels – $236 and $244."
  }
]