[
  {
    "source": "CoinDesk",
    "date": "2023-09-01T10:52:53.000Z",
    "title": "Lira-Backed TRYB Token Becomes World's Second-Largest Non-Dollar-Pegged Stablecoin",
    "url": "https://www.coindesk.com/markets/2023/09/01/lira-backed-tryb-token-becomes-worlds-second-largest-non-dollar-pegged-stablecoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The market cap of BiLira's TRYB token has increased more than 300% to $136.10 million, the second-highest among non-U.S. dollar-pegged stablecoins."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-01T10:50:40.000Z",
    "title": "Who’s Who in Global Crypto Regulation",
    "url": "https://decrypt.co/resources/whos-who-in-global-crypto-regulation",
    "description": "It is difficult to properly assess cryptocurrencies through the lenses of traditional finance—it is even challenging to determine which agencies may be responsible for their oversight."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T11:01:24.000Z",
    "title": "Gemini rejects Genesis, FTX proposed settlement, describes it as ‘sweetheart pre-plan deal’",
    "url": "https://cryptoslate.com/gemini-rejects-genesisftx-proposed-settlement-descibes-it-as-sweetheart-pre-plan-deal/",
    "description": "<p>Crypto exchange Gemini rejected the proposed settlement deal between bankrupt crypto platform FTX and Genesis, according to an Aug. 31 court filing. Gemini posited that the proposed settlement between the failed firms is an attempt to manipulate the voting process for the bankruptcy plan, further describing it as a &#8220;sweetheart pre-plan deal&#8221; designed to benefit [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gemini-rejects-genesisftx-proposed-settlement-descibes-it-as-sweetheart-pre-plan-deal/\">Gemini rejects Genesis, FTX proposed settlement, describes it as &#8216;sweetheart pre-plan deal&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T11:00:50.000Z",
    "title": "Binance receives unprecedented Bitcoin transfer as ‘whales’ influence sends market plunging",
    "url": "https://cryptoslate.com/insights/binance-receives-unprecedented-bitcoin-transfer-in-2023-as-whales-influence-sends-market-plunging/",
    "description": "<p>Quick Take Yesterday marked a significant movement in the Bitcoin market, recording a roughly 4% decline in value, as the price of Bitcoin plunged below the $26,000 mark. This move was coupled with the largest influx of Bitcoin to exchanges witnessed in 2023, with the majority of these inflows accredited to prominent holders, commonly referred [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-receives-unprecedented-bitcoin-transfer-in-2023-as-whales-influence-sends-market-plunging/\">Binance receives unprecedented Bitcoin transfer as &#8216;whales&#8217; influence sends market plunging</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-01T10:58:44.000Z",
    "title": "Whales accumulating XRP, investors bullish on QUBE",
    "url": "https://crypto.news/whales-accumulating-xrp-investors-bullish-on-qube/",
    "description": "While XRP, with its increased whale activity, has caught the eyes of crypto enthusiasts, QUBE, the native token of InQubeta, is gaining ground"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-01T10:52:27.000Z",
    "title": "Ronaldinho denies ties to dubious 18k crypto pyramid scheme",
    "url": "https://crypto.news/ronaldinho-denies-ties-to-dubious-18k-crypto-pyramid-scheme/",
    "description": "Football legend Ronaldinho denies involvement in a controversial crypto scheme 18k Ronaldinho, while testifying before a legislative committee. Brazilian football legend and global icon Ronaldinho directly refuted allegations linking him to a cryptocurrency-based financial pyramid. Testifying before a legislative committee&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T11:00:43.000Z",
    "title": "Here’s What Bitcoin Price The Bull Market Will Start According To This Analyst",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-bull-market/",
    "description": "The Bitcoin price has been experiencing a series of price fluctuations for two years now. The cryptocurrency has been on a bullish threshold multiple times but has failed to hold a bullish momentum for long.  Nevertheless, a Bloomberg analyst has predicted an unfeigned bull run for BTC, but the potential uptrend comes with certain factors and conditions. Investors Prepare For Possible Bitcoin Bull Run The slow growth of Bitcoin price has left investors and crypto enthusiasts hoping for a potential bull run since its crash in 2022, which saw the cryptocurrency dropping from $46,000 to below $20,000. The morale of the crypto space has been uplifted, however, following a forecast made by Senior Macro Strategist at Bloomberg Intelligence, Mike McGlone, who proposes a potential bull run for Bitcoin. Related Reading: Bitcoin Price Crashes Below $26,000 As SEC Pushes Back On 7 Spot ETF Filings In an X (formerly Twitter) post, the senior analyst implies that if the Bitcoin price rises above the $30,000 mark, investors should expect a significant bull run similar to the uptrend recorded in 2020 when Bitcoin was at its all-time high. McGlone explained that Bitcoin’s $30,000 is analogous to its $12,000 price mark in 2020, just before its surge. To put this in perspective, in 2020, while Bitcoin price was as low as $12,000, the cryptocurrency recorded one of the highest surges in its history, and McGlone has equated that price jump to the bullish momentum he foresees for Bitcoin if it crosses the $30,000 price threshold. “Bitcoin $30,000 May Be New $12,000, With Fed-Tightening Overhang,” McGlone said in the X post. He also added that Bitcoin&#8217;s price may see substantial growth if regulatory burdens are addressed and spot Bitcoin ETFs are eventually approved.   “The inevitable approval of Bitcoin ETFs in the US is moving closer, but the elephant in the room for all risk assets remains. The Fed is still tightening despite the tilt toward economic contraction,” the analyst said. Factors Hindering Bullish Momentum For The Bitcoin Price As the crypto space keeps an eye out for more confirmation of a favorable price reversal for Bitcoin, several factors could impede Bitcoin’s expected growth trajectory. Industry experts have highlighted that the increased adoption of the Bitcoin ETF following Grayscale’s victory against the SEC could have a significant impact on the price of Bitcoin. However, the United States Securities and Exchange Commission (SEC) previously rejected applications for spot Bitcoin ETFs by prominent financial service firms and crypto exchanges in the industry.  The SEC has also delayed applications for Bitcoin ETF from renowned firms like Blackrock, and WisdomTree even after Judges from the District of Columbia Court of Appeals in the US were not in favor of the SEC’s rejection of Grayscale’s Bitcoin ETF.  Related Reading: Dogecoin And Bitcoin Become Latest Additions To Robinhood Wallet Furthermore, the SEC has also been aggressively suing many crypto exchanges, including Binance and Coinbase. This lack of a proper regulatory framework has affected the prices of cryptocurrencies, including Bitcoin, so crypto investors are hesitant to invest in an exchange facing multiple lawsuits and potential legal repercussions. Bitcoin’s transaction volume has also taken a hit, plunging to 3-year lows. The transaction volume declined by a staggering 90% previously cutting short a potential rally and positioning the cryptocurrency at a bearish mark. Additionally, Bitcoin mining which was once a lucrative crypto venture has also seen a significant decline for participants. However, while the factors hindering a Bitcoin price growth spurt are considerable, investors&#8217; hopes still remain strong as they prepare for a price spike. BTC price falls to $26,000 as interest wanes &#124; Source: BTCUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  }
]