[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-02T15:30:03.000Z",
    "title": "NFT Sales Slide for Third Consecutive Week Amid Crypto Downturn",
    "url": "https://news.bitcoin.com/nft-sales-slide-for-third-consecutive-week-amid-crypto-downturn/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"NFT Sales Slide for the Third Consecutive Week Amid Crypto Downturn\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/nft.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sales of non-fungible tokens (NFTs) have taken another hit, declining over 10% from the previous week, with transactions totaling $85,046,840 since Saturday, August 26, 2023. This marks the third consecutive week of falling NFT sales, reflecting the broader crypto economy&#x2019;s downturn and its significant impact on the NFT marketplace. Can NFTs Rally in September? Recent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-02T15:32:00.000Z",
    "title": "Legal experts weigh Ripple’s strong defense against SEC’s interlocutory appeal",
    "url": "https://www.cryptopolitan.com/legal-expert-weigh-ripple-against-sec-appeal/",
    "description": "A new twist has emerged in the ongoing legal battle between the Securities and Exchange Commission (SEC) and Ripple (XRP). John Deaton, the founder of CryptoLaw and attorney for XRP holders, has spotlighted a pivotal argument in Ripple&#8217;s recent filing. This argument, Deaton suggests, could significantly weaken the SEC&#8217;s stance. Ripple and its top executives ... <a title=\"Legal experts weigh Ripple&#8217;s strong defense against SEC&#8217;s interlocutory appeal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/legal-expert-weigh-ripple-against-sec-appeal/\" aria-label=\"More on Legal experts weigh Ripple&#8217;s strong defense against SEC&#8217;s interlocutory appeal\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-02T15:30:00.000Z",
    "title": "Examining growth potential for PepeCoin, Conflux, and Injective in 2023",
    "url": "https://crypto.news/examining-growth-potential-for-pepecoin-conflux-and-injective-in-2023/",
    "description": "In 2023, PepeCoin (PEPE), Conflux (CFX), and Injective (INJ) continue to attract investor attention "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-02T15:30:50.000Z",
    "title": "XRP Whales On The Move Again, As Altcoin Records Significant Utility Spikes",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-whales-on-the-move-again-as-altcoin-records-significant-utility-spikes/",
    "description": "In the last 48 hours, the XRP market has witnessed a significant amount of large-scale transactions, drawing much attention from the general crypto space. According to data from blockchain tracker Whale Alert, XRP whales conducted transactions involving over a billion XRP on Friday, September 1.  Related Reading: XRP Price Prediction – Topside Bias Vulnerable Unless Bulls Clear This Hurdle Ripple Transfers 75 Million XRP To Unknown Wallet In Whale Buying Spree Through a series of posts by Whale Alert on social media platform X (formerly Twitter), it can be inferred that the XRP market witnessed four major whale transactions.  The biggest of these transactions was the transfer of 424,354,912 XRP &#8211; valued at $214,293,666 &#8211; from one unknown wallet to the other. In this context, unknown wallets refer to addresses with no affiliation to a crypto exchange.  Furthermore, there was the move of XRP, 19,920,318 XRP worth $10,167,904, from another unknown wallet to the Binance exchange. It was also noted that a whale transferred 66,666,659 XRP, worth $33,065, 809 from an unknown wallet to the Binance exchange.  However, the most notable transaction that caught most traders&#8217; eye came from Ripple, the company behind the XRP cryptocurrency.  Whale Alert reported that Ripple transferred 75,000,000 XRP, worth $37,058,145, from its Binance wallet to an unknown wallet.  Following this move, some crypto enthusiasts believe that this particular unknown wallet also belongs to Ripple, as the company could be intending to soon offload those tokens on an exchange. This speculation has led to most investors predicting an incoming market dump.  Ripple also conducted other transactions on September 1, locking about 800,000,000 XRP in escrow.  However, this does not raise any concern as the crypto payment firm is known to release 1,000,000,000 XRP at the start of every month before proceeding to lock up about 80% of the new tokens a few hours later.  Related Reading: XRP Price Prediction for 2023, 2024, 2025, 2030 and Beyond XRP Records 7-Month Highest Transaction Volume Among Other Positives Following the massive transactions in the XRP market, on-chain analytics firm Santiment has provided a report highlighting some of the effects of these whale movements. According to an X post on September 1, Santiment reports an on-chain transaction volume of 4.8 billion XRP, marking the seven highest value of this metric in the XRP market over the last seven months.  The analytics firm also noted that there are currently about 2.03 billion XRP in circulation, representing the token’s highest-circulating supply since May 31. In addition, XRP development activity was also reported to be on the high side. At the time of writing, XRP still finds itself struggling amid a general market downturn. The fifth-largest cryptocurrency trades at $0.4983 with a 1.88% loss in the last day, according to data from CoinMarketCap. XRP trading at XRPUSD on the daily chart &#124; Source: XRPUSD chart on Tradingview.com Featured image from Unsplash, chart from Tradingview."
  }
]