[
  {
    "source": "CoinDesk",
    "date": "2023-08-11T17:43:38.000Z",
    "title": "'Good Luck' Convincing a Jury: Cameron Winklevoss Rebuts DCG Court Filing",
    "url": "https://www.coindesk.com/business/2023/08/11/good-luck-convincing-a-jury-cameron-winklevoss-rebuts-dcg-court-filing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "His Gemini crypto exchange and conglomerate Digital Currency Group are battling – in and out of court – over the failure of Gemini's Earn lending service."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T17:52:10.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The United States Securities and Exchange Commission has delayed its ruling on the ARK 21Shares spot Bitcoin exchange-traded fund (ETF) application. Meanwhile, Worldcoin now allows unverified users to reserve WLD tokens for 12 months, and Gemini has become the latest major exchange to relist XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) following the July ruling in the SEC v. Ripple case. </p><h2>SEC delays decision on ARK 21Shares spot Bitcoin ETF</h2><p>In a move that surprised few people in the crypto industry, the United States Securities and Exchange Commission has delayed its ruling on a spot Bitcoin ETF application submitted by ARK Investment Management.</p><p>The SEC’s Aug. 11 notice <a href=\"https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments\">opened a 21-day comment period</a> for the ARK 21Shares Bitcoin ETF — an application that was initially submitted in May. The securities regulator now has until January 2024 to reach a final decision on whether to approve or deny the spot Bitcoin ETF application. </p><p>The SEC gave its usual justification for pushing back the approval process, noting: </p><blockquote>“The regulated market of significant size test does not require that the spot bitcoin market be regulated in order for the Commission to approve this proposal, and precedent makes clear that an underlying market for a spot commodity or currency being a regulated market would actually be an exception to the norm.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today on <a href=\"https://twitter.com/BloombergTV?ref_src=twsrc%5Etfw\">@BloombergTV</a>&#39;s ETF IQ <a href=\"https://twitter.com/CathieDWood?ref_src=twsrc%5Etfw\">@CathieDWood</a> agreed with our assessment (below) that if spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETFs are approved by the SEC, it will be multiple at the same time and not just one. <a href=\"https://t.co/oNOeqs4HDL\">https://t.co/oNOeqs4HDL</a> <a href=\"https://t.co/K18qFNOtQL\">pic.twitter.com/K18qFNOtQL</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1688633785573588992?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As Cointelegraph reported, ARK Investment Management founder Cathie Wood predicted earlier this week that the SEC would eventually <a href=\"https://cointelegraph.com/news/cathie-wood-predicts-sec-simultaneously-allowing-multiple-spot-crypto-etf\">approve multiple spot Bitcoin ETF applications</a> at the same time.</p><h2>Worldcoin opens up WLD reservations for unverified users</h2><p>The iris-scanning crypto project Worldcoin has now made it possible for even unverified customers to reserve WLD (<a href=\"https://cointelegraph.com/worldcoin-wld-price-index\">WLD</a>) tokens.</p><p>The World App now offers a reservations feature to make it easier for everyone to reserve their WLD tokens before verifying their World ID, as shown in the image below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e17c621c-44ee-45cd-899f-5b81db06f1b4.png\"  /><figcaption style=\"text-align: center;\"><em>World App with reservation feature. Source: Worldcoin</em></figcaption></figure><p>The Worldcoin project consists of three key elements: the World ID, the World App and WLD token. Users willing to scan their iris to create a biometric data-based ID system are rewarded with WLD tokens.</p><h3>XRP briefly hits $50 on Gemini as users suspect “price glitch”</h3><p>Crypto users have reported seeing “wonky” prices for Ripple’s XRP token on the Gemini crypto exchange, only hours after the exchange relisted the token on its platform for trading. </p><p>Several crypto community members on X (formerly known as Twitter) on Aug. 11 posted screenshots of what many have described as a “price glitch” that has seen XRP’s displayed price on the exchange rise above $1 a number of times, even spiking to $50 on one occasion.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Wow. Current price of <a href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$XRP</a> on <a href=\"https://twitter.com/Gemini?ref_src=twsrc%5Etfw\">@Gemini</a>. Is this a glitch? <a href=\"https://t.co/Nbzro1ahlW\">pic.twitter.com/Nbzro1ahlW</a></p>&mdash; Yassin Mobarak  (@Dizer_YM) <a href=\"https://twitter.com/Dizer_YM/status/1689805652577665024?ref_src=twsrc%5Etfw\">August 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, some observers suggest it may be the result of a thin order book and low liquidity, given the recent relisting. </p><p><a href=\"https://cointelegraph.com/news/us-crypto-exchanges-second-chance-xrp-listings-after-court-ruling\">Gemini announced it had made XRP available</a> again for trading on the crypto exchange on Aug. 10.</p><p>It comes after United States District Court Judge Analisa Torres ruled in Ripple’s case against the Securities Exchange Commission that <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">XRP is not a security when sold on exchanges.</a></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T17:51:32.000Z",
    "title": "SEC decision on Bitcoin ETFs won't leave out Wall Street giants",
    "url": "https://cointelegraph.com/news/sec-decision-bitcoin-etfs-wont-leave-out-wall-street-giants",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/900d51e1-64fa-40d6-9221-d3ac00ff8da4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Securities and Exchange Commission's prolonged deliberation over a spot Bitcoin ETF is stoking expectations of a joint decision for all applications.  </p>\n                    <p><p>The Securities and Exchange Commission's (SEC) delay in deciding whether to approve a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) in the United States is fueling expectations that a final verdict will come in a batch that includes key players on Wall Street, including BlackRock and Fidelity. </p><p>\"There’s a tremendous amount of pressure on the SEC to approve a number of these ETFs, particularly because the approved Futures backed products are lagging spot performance substantially, harming investors,” markets veteran and co-founder of CoinRoutes Dave Weisberger told Cointelegraph, adding that all pending applications will likely be included in a final decision.</p><p>The SEC <a href=\"https://cointelegraph.com/news/spot-crypto-etf-applications-federal-register-sec-approval\">is analyzing a total of eight applications</a> for a spot Bitcoin ETF, following past delays and denials of the crypto product in recent years. Companies up for a decision are Ark and 21Shares, Bitwise, BlackRock, VanEck, WisdomTree, Invesco and Galaxy Digital, Fidelity, and Valkyrie. Together, the firms manage over $15 trillion in global assets. </p><p>On Aug. 11, the U.S. markets regulator <a href=\"https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments\">opened a 21-day comment period</a> for the ARK 21Shares Bitcoin ETF. As per the <a href=\"https://www.sec.gov/files/rules/sro/cboebzx/2023/34-98112.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, the SEC is seeking answers on whether ARK 21Shares' proposal is designed to prevent fraudulent and manipulative acts and practices, as well as whether the Bitcoin market is susceptible to manipulation.</p><p>Furthermore, the regulator raised concerns about Coinbase's surveillance-sharing agreement, asking commenters to examine whether Coinbase's participation in the ETFs surveillance would, in fact, help to detect, investigate, and deter fraud and manipulation in Bitcoin's price. </p><p>\"The SEC’s main concern about spot crypto ETFs is about the potential market manipulation by a big whale. Theoretically, it can happen if the SEC approves the ETFs of one or two investment funds. But if it decides to register all 8 ETFs, it will sharply mitigate the probability of manipulation, because these firms will be able to trade with each other frequently, taking opposite sides,\" explained Ruslan Lienkha, chief of markets at YouHodler. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e4d896b7-326b-4fe3-a0cc-49fcce8876ef.png\"  /><figcaption style=\"text-align: center;\"><em>SEC application timeline for a spot Bitcoin ETF. Source: Bloomberg Intelligence/J</em><em>ames Seyffart</em></figcaption></figure><p>The delay had a lower impact on Bitcoin's price, hovering around the $30,000-mark at the time of writing. According to Mauricio Di Bartolomeo, co-founder of crypto lending platform Ledn, traders and investors are \"expecting them [the SEC] to take all the time they could,\" with today's decision having a low impact \"in terms of market expectations.\"</p><p>The SEC still has two deadlines before a final decision is made. The third deadline for ARK 21Shares application is due by January 202. Valkyrie has the latest application in line, with two upcoming deadlines in January and March next year. </p><p>The BTC ETF outcome could reshape the crypto investment landscape. According to Lienkha, an approval could potentially bring over $70 billion in liquidity to the Bitcoin market. \"The opportunity to invest in Bitcoin through ETFs will give regular investors more confidence, as with professional help, they don’t have to dive into all the technical details and analyze potential risks by themselves,\" he noted. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T17:56:38.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T17:55:56.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T17:55:15.000Z",
    "title": "How AI Transforms ECMO Patient Survival Prediction, Monash Breakthrough",
    "url": "https://www.cryptopolitan.com/monash-ai-transforms-ecmo-patient-survival/",
    "description": "In a groundbreaking collaboration, Monash University&#8217;s visionary team of engineers and cardiologists has harnessed the power of artificial intelligence (AI) to create an algorithm that astutely predicts the survival rates of critically ill patients reliant on external heart-lung support, known as extracorporeal membrane oxygenation (ECMO). This pioneering effort marks a significant advancement in the field. ... <a title=\"How AI Transforms ECMO Patient Survival Prediction, Monash Breakthrough\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monash-ai-transforms-ecmo-patient-survival/\" aria-label=\"More on How AI Transforms ECMO Patient Survival Prediction, Monash Breakthrough\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T17:45:33.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T17:39:49.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T18:00:55.000Z",
    "title": "Did XRP Price Really Hit $50 On Gemini Exchange",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-hit-50-on-gemini/",
    "description": "On August 10, the price of XRP inexplicably spiked for a brief moment on the Gemini exchange. For a moment, the price of XRP reached an astounding $50 per coin before quickly crashing back down to the same level on spot markets on other exchanges. Brief Price Surge On Gemini According to various posts on social media platform X (formerly known as Twitter), it would seem that Gemini experienced a technical issue that caused the XRP price displayed on their exchange to show an erroneous price of $50. During that time, however, XRP was trading around only $0.63.  Related Reading: Bittrex, SEC Reach Settlement In Securities Violation Case It would appear as if Gemini is currently experiencing a thin order book after recently relisting XRP on its spot markets. Users have posted screenshots on social media of the token&#8217;s price on the exchange rising above $1 several times. However, the exchange has since updated its chart to make it look like the cryptocurrency only spiked to $1.50. Gemini updates XRP chart to reflect $1.50 spike &#124; Source: Gemini The bump, which took a few seconds to correct, was likely a result of low liquidity. According to crypto trading expert Ali Martinez, the liquidity was so low that only a $37,000 order was enough to move XRP prices on the exchange by 2%. $XRP hit $50 on @Gemini, but now they have updated their charts to make it seems like #XRP hit $1.60. 😅 Still, the market depth on this #crypto exchange is very low. Only a $37,000 order is required to move #Ripple prices by 2%. pic.twitter.com/k5u2GV5PnH — Ali (@ali_charts) August 11, 2023 Another observer also mentioned that a user had accidentally put up a sell order for a lot of tokens at $50, spiking up the price on Gemini in the process. A price swing of that magnitude seems highly impossible without any major news or event driving widespread interest in XRP.  Following this, as of the time of writing, the exchange has announced it has put its platform into full site maintenance. the order book is very thin, i have been watching all day, at one point there was nothing for sale, someone put a lot to sell at $50.00 and someone must have fat fingered a market order and then they were the proud owner of $50 XRP, this was from a few hours ago pic.twitter.com/W5AoG2eV0r — John S (@lifebythedrop63) August 11, 2023 Token price trending at $0.63 &#124; Source: XRPUSD on Tradingview.com Relisting XRP Gemini is the latest exchange to relist XRP after Ripple&#8217;s partial victory in court against the United States Securities and Exchange Commission (SEC). Due to regulatory concerns, the token was initially delisted on various exchanges after the SEC filed a lawsuit against Ripple in 2020.  However, US Judge Analisa Torress ruled in July that XRP sales to the general public are not in violation of federal laws, so many of these crypto exchanges have gone ahead to relist XRP on their platforms. Related Reading: New Milestone For Ethereum Could Spell Good News For ETH Price Other crypto exchanges that have also moved to relist the token since the ruling include Coinbase, Kraken, and Bitstamp. At the time of writing, XRP is trading at $0.6311, up by 33.09% in the past month. Despite the initial euphoria community members may have experienced due to the Gemini glitch, the Ripple ecosystem still has a long way to go before XRP can actually hit $50 on the open market. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T18:00:09.000Z",
    "title": "Borroe ($ROE) ‘s Bull Run: Why It’s Overshadowing Litecoin (LTC) and BNB",
    "url": "https://www.crypto-news-flash.com/borroe-roe-s-bull-run-why-its-overshadowing-litecoin-ltc-and-bnb/?utm_source=rss&utm_medium=rss&utm_campaign=borroe-roe-s-bull-run-why-its-overshadowing-litecoin-ltc-and-bnb",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In a surprising turn of events, Litecoin (LTC) went bearish after its halving event on August 2. Although the token has been on a bearish trajectory since mid-July, investors thought the four-year halving event would turn the markets. On the other hand, Binance Coin (BNB) holders benefitted from investment opportunities on the exchange. Investors are [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T17:54:00.000Z",
    "title": "Aave DAO Greenlights ‘aCRV OTC’ Proposal For CRV Token Acquisition",
    "url": "https://coinedition.com/aave-dao-greenlights-acrv-otc-proposal-for-crv-token-acquisition/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Aave DAO Greenlights &#039;aCRV OTC&#039; Proposal For CRV Token Acquisition\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Aave-DAO-Greenlights-aCRV-OTC-Proposal-For-CRV-Token-Acquisition-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Aave aims for CRV liquidity via rewarding pools, guided by veCRV dominance. Aave&#8217;s community passed the &#8220;aCRV OTC&#8221; proposal, securing CRV through USDT utilization. Aiming to secure 5 million CRV, the Aave community split over the proposal with 58% in favor. An update on the Aave governance forum suggests that the community has passed the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/aave-dao-greenlights-acrv-otc-proposal-for-crv-token-acquisition/\">Aave DAO Greenlights &#8216;aCRV OTC&#8217; Proposal For CRV Token Acquisition</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-11T18:05:24.000Z",
    "title": "Analyst Says Bitcoin’s Going To Be an ‘Easy Long-Term Trade’ Due to One Catalyst, Updates Outlook on Shiba Inu",
    "url": "https://dailyhodl.com/2023/08/11/analyst-says-bitcoins-going-to-be-an-easy-long-term-trade-due-to-one-catalyst-updates-outlook-on-shiba-inu/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Lender-Says-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is calling Bitcoin (BTC) an easy trade over the long term due to one possible catalyst. Pseudonymous analyst The Flow Horse, also known as Cantering Clark, tells his 180,900 X followers that he is long-term bullish on BTC because he believes the U.S. Securities and Exchange Commission (SEC) will eventually [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/11/analyst-says-bitcoins-going-to-be-an-easy-long-term-trade-due-to-one-catalyst-updates-outlook-on-shiba-inu/\">Analyst Says Bitcoin’s Going To Be an ‘Easy Long-Term Trade’ Due to One Catalyst, Updates Outlook on Shiba Inu</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]