[
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T08:27:06.000Z",
    "title": "Binance says 'no comment' on report it mulled closing U.S. arm to protect its global firm",
    "url": "https://cointelegraph.com/news/binance-says-no-comment-on-report-it-mulled-closing-u-s-arm-to-protect-its-global-firm",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/48956c90-e513-498a-9a37-23a816aa39da.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance declined to comment on the issue when Cointelegraph reached out to confirm the report. </p>\n                    <p><p>Binance has declined to comment on a media report that CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng Zhao</a> almost shuttered the crypto trading platform's arm in the United States in an effort to protect its global company.</p><p>Citing anonymous sources, the tech media outlet <a href=\"https://www.theinformation.com/articles/binance-ceo-changpeng-zhao-pushed-to-shutter-u-s-exchange\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the board of directors of Binance's US entity, Binance.US initiated a vote to liquidate the company. However, they were unable to reach a unanimous decision, with Binance.US CEO Brian Shroder standing against the decision. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/dc9e3bbe-5f94-4146-ad05-4e13e88d8a9a.jpg\"  /><figcaption style=\"text-align: center;\"><em>Initial report on Binance CEO attempting to shut down the US exchange. Source: The Information</em></figcaption></figure><p>According to the report, Shroder was worried that an abrupt shutdown of the US-based exchange would be detrimental to its users as they would be forced to quickly move or liquidate their assets. </p><p>Cointelegraph reached out to Binance but a spokesperson for the exchange said they were \"not commenting\" on this issue. </p><p>Binance and Zhao have become a target of US regulators in the past few months. On March 27, the US Commodity Futures Trading Commission (CFTC) <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">filed a lawsuit against Binance</a> and Zhao for alleged trading violations. On June 5, the US Securities and Exchange Commission (SEC) also <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed a lawsuit against the exchange</a>, its US arm, and Zhao, alleging that Binance \"enriched themselves\" with billions of US dollars while putting investors at risk. </p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/nigeria-sec-warns-against-trading-on-binance\"><strong>Nigeria’s SEC warns against trading on Binance</strong></a></p><p>Despite the regulatory challenges and risks, Binance still continues to expand its business in various parts of the globe. On Aug. 1, Binance officially <a href=\"https://cointelegraph.com/news/binance-japan-begins-launching-trading-services\">announced the launch of Binance Japan</a>, offering spot trading for 34 tokens. The exchange plans to migrate its global users based in Japan to its local version starting on Aug 14, in an effort to comply with the country’s regulatory framework. </p><p>In a Twitter ask-me-anything (AMA) session on July 31, Zhao noted that amid the regulatory and transparency risks concerning stablecoins, it’s important to diversify. The CEO highlighted that he is cautious of stablecoins like Tether (USDT), which is the largest stablecoin by market capitalization, and admitted that even Binance USD (BUSD) comes with unforeseeable risks. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-and-china-try-to-crush-binance-sbfs-40m-bribe-claim-asia-express/\"><strong><em>US and China try to crush Binance, SBF’s $40M bribe claim: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T08:22:47.000Z",
    "title": "Worldcoin cryptocurrency project suspended in Kenya",
    "url": "https://cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/eac5dc66-38d0-4f7c-b6e9-7f709205b04c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Kenyan authorities want to ensure that Worldcoin poses no risks to the security of citizens before it allows the project to gather iris data.</p>\n                    <p><p>The new cryptocurrency and digital identity project, <a href=\"https://cointelegraph.com/explained/what-is-worldcoin-and-how-does-it-help-preserve-world-id\">Worldcoin</a>, is facing a rough start in Kenya, with the government halting all local activity associated with it.</p><p>Kenya’s minister of internal security took to Facebook on Aug. 2 to <a href=\"https://www.facebook.com/InteriorMinistryKenya/posts/pfbid0VZhFn424Q9bCkRPmNZ4e1dW5ZYCifDAGtrhhU52X8zDBh8US8AWZ7zw7hbxNxHq8l\" target=\"_blank\" rel=\"noopener nofollow\">announce</a> that the country has suspended the activities of Worldcoin until relevant public agencies had certified the absence of risks to Kenyans.</p><p>“Relevant security, financial services and data protection agencies have commenced inquiries and investigations to establish the authenticity and legality of the aforesaid activities,” Minister Kithure Kindiki said in a statement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f38e3cf7-0d94-4666-a814-bc68f1de4604.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The statement by Kenya’s minister of internal security on Worldcoin. Source: Facebook</em></figcaption></figure><p>The minister stressed that the government of Kenya is specifically concerned with Worldcoin collecting crucial identification information like iris scans in exchange for a digital ID.</p><p>“Appropriate action will be taken on any natural or juristic person who furthers, aids, abets or otherwise engages in or is connected with the activities afore described,” the statement said.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-iris-scan-every-eight-seconds-sam-altman-japan-video\"><strong><em>Worldcoin rebuts reports of lackluster takeup as Altman cites Japan queues</em></strong></a></p><p>As previously reported by Cointelegraph, the <a href=\"https://cointelegraph.com/news/worldcoin-launches-token-to-distinguish-humans-from-bots\">Worldcoin project was officially launched</a> on July 24, 2023, after three years of development. The project was co-founded by Sam Altman, the CEO of OpenAI — the firm behind the popular artificial intelligence (AI)-based chatbot ChatGPT.</p><p>Worldcoin’s mission builds on expectations that it will become too difficult to <a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\"></a><a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\">differentiate between humans and online bots</a> as AI technology grows. To differentiate humans from AI, the startup created a digital ID system based on proof-of-personhood. Such a digital ID is generated by scanning an individual’s iris and giving them a World ID.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T08:13:32.000Z",
    "title": "Bitcoin Lightning on Coinbase agenda, Brian Armstrong tells Jack Dorsey",
    "url": "https://cointelegraph.com/news/bitcoin-lightning-on-coinbase-agenda-brian-armstrong-to-jack-dorsey",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/fb8f1538-bd01-4b56-be73-58e8dbe434ca.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Armstrong confirmed that Coinbase was looking into adding support for Bitcoin Lightning while reassuring his support for Bitcoin payments.</p>\n                    <p><p>Brian Armstrong, the CEO of Coinbase, confirmed that the crypto exchange is “looking into” adding the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Lighting network in its quest to spread crypto payments adoption across the globe.</p><p>On July 28, Armstrong addressed the crypto community on Twitter (rebranded to X), highlighting the potential of cryptocurrencies to improve global payments infrastructure. He further suggested:</p><blockquote>“This will take lots of work from all of us, Coinbase included, getting layer 2's integrated, better on-ramps, simpler UX/onboarding, etc.”</blockquote><p>Armstrong’s vision for global crypto payments was questioned by long-standing Bitcoin supports — including MicroStrategy founder Michael Saylor and Square CEO Jack Dorsey — given no mention of Bitcoin in the post, as shown below. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The next step for crypto is to make payments instant and free globally.<br><br>This will take lots of work from all of us, Coinbase included, getting layer 2&#39;s integrated, better on-ramps, simpler UX/onboarding, etc.<br><br>A magic threshold would be getting the average payment under 1 cent… <a href=\"https://t.co/IDWTHsZNUq\">https://t.co/IDWTHsZNUq</a></p>&mdash; Brian Armstrong ️ (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1684281133658431488?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://cointelegraph.com/news/thirteen-years-after-first-bitcoin-purchase-layer-2-solutions-struggle-to-gain-traction\">The Lightning Network</a> aims to make Bitcoin transactions faster and cheaper by allowing users to create off-chain transaction channels. While Saylor simply recommended integrating Bitcoin Lightning on Coinbase, Dorsey questioned “what \"crypto\" is a better money transmission protocol (than Bitcoin) and why?” After 5 days of silence, Armstrong responded to Dorsey, stating:</p><blockquote>“Not sure why you think we’re ignoring Bitcoin - we’ve onboarded more people to Bitcoin than probably any company in the world.”</blockquote><p>Armstrong confirmed that Coinbase was looking into adding support for Bitcoin Lightning while reassuring his support for Bitcoin payments. Dorsey acknowledged Coinbase’s role in spreading Bitcoin adoption and agreed to partner with Armstrong in putting resources into Bitcoin and layer 2 technologies, <a href=\"https://twitter.com/jack/status/1686610126453846016\" target=\"_blank\" rel=\"noopener nofollow\">adding</a>:</p><blockquote>“We want an open protocol for money transmission for the internet that’s not controlled by a single individual, company, or government.”</blockquote><p>The open discussion between the two crypto entrepreneurs concluded with both pledging to be on the same team.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lightning-labs-tools-let-ai-transact-hold-bitcoin\"><strong><em>Lightning Labs releases tools letting AI transact and hold Bitcoin</em></strong></a></p><p>On July 17, Binance completed the integration of Bitcoin Lightning Network within a month of sharing its intention to do so.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/0f247a3a-f13d-4868-9f4b-330fb2476b95.jpg\"  /><figcaption style=\"text-align: center;\"><em>Screenshot showing users can select \"LIGHTNING\" as an option when depositing Bitcoin. Source: Binance</em></figcaption></figure><p>Binance has joined Bitfinex, River Financial, OKX, Kraken and CoinCorner as the other prominent exchanges to have embraced the Lightning Network.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/\">Chinese police vs. Web3, blockchain centralization continues: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T08:38:04.000Z",
    "title": "Litecoin trading volume jumps 30% amid halving hype",
    "url": "https://crypto.news/litecoin-trading-volume-jumps-30-amid-halving-hype/",
    "description": "The third Litecoin (LTC) halving is only hours away, and market data indicates a surge in LTC trading activity in the last 24 hours. This halving happens every 840,000 blocks, according to Litecoin&#8217;s whitepaper. At the time of writing, the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T08:15:12.000Z",
    "title": "Curve DAO (CRV) Price Recovery Post-Exploit: What Would Be A Realistic Scenario?",
    "url": "https://www.newsbtc.com/all/curve-dao-crv-price-recovery-post-exploit-what-would-be-a-realistic-scenario/",
    "description": "Curve DAO (CRV) has established itself as a prominent DeFi platform, renowned for providing ample liquidity, particularly for stablecoins. However, an unfortunate security breach occurred over the weekend, causing a significant decrease in both the total funds entrusted to Curve and the value of its native token, CRV, which serves as a means of transaction within the protocol.  According to a report from Bloomberg, this decline in CRV&#8217;s price has put the substantial sum of over $100 million in loans at risk of being liquidated, posing a serious challenge for Curve Finance&#8217;s founder, Michael Egorov. Related Reading: Dogecoin Price Prospects: Can The Memecoin Climb To The $0.1 Level? As news of the potential liquidation of the Curve Founder&#8217;s assets spread, the sentiment among investors turned increasingly fearful, resulting in a notable impact on the CRV market&#8217;s price action in recent days. Many are now questioning whether there is any hope for a recovery. CRV price action in the last week. Source: Coingecko CRV Price Analysis: Mixed Trends Prompt Speculation On Sentiment According to CoinGecko, the price of CRV currently stands at $0.563, reflecting a decrease of -2.40% in the last 24 hours. Additionally, over the past seven days, CRV has experienced a significant decline of 22.1%. Despite the recent uptick, a bearish sentiment overshadows the CRV token&#8217;s prospects. Notably, a fundamental support level lies at the $0.5 mark, which underwent testing in November and December 2022. Furthermore, a potential positive price response might be witnessed at the $0.32 support level from October and November 2020. CRV is currently in the red, with a price of $0.563 on the daily chart on TradingView.com Unveiling Potential Shifts In Sentiment An intriguing observation comes from the CRV price report, highlighting a sudden spike in previously dormant Open Interest (OI) charts within the past 48 hours. This occurrence coincided with a period of losses for the Curve DAO token on the chart. A noteworthy development emerged during the recent rebound from $0.5 as the OI continued its ascent. This phenomenon raises the question: could this point to a direction toward bullish sentiment? Related Reading: The Litecoin $95 Question: Is A Bullish Breakout In The Pipeline? As the CRV token navigates these mixed trends, market participants contemplate the interplay between short-term gains, historical support levels, and the evolving Open Interest dynamics. The complex mosaic of these factors will likely shape the sentiment and direction of CRV&#8217;s journey in the days to come. Egorov Responds To Contagion Concerns Amidst CRV Incident Meanwhile, Egorov talked to Bloomberg in the same report, shedding light on his strategic approach to mitigate the impact of the ongoing liquidation threat. He shared his focus on diminishing the sizes of his loans as a precautionary measure. Speaking about the potential contagion effects of the situation, Egorov conveyed his perspective in an email to the publication:  &#8220;I cannot comment much about contagion effects apart from saying that we, and I personally, work on minimizing or eliminating the impact,” he wrote. “In any case, I think we and all DeFi will come out stronger surviving this event.&#8221; (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Bankless Times"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T08:30:13.000Z",
    "title": "Amid Ripple’s Triumph, Borroe and Litecoin on the Cusp of 1500% Growth This Year",
    "url": "https://www.crypto-news-flash.com/amid-ripples-triumph-borroe-and-litecoin-on-the-cusp-of-1500-growth-this-year/?utm_source=rss&utm_medium=rss&utm_campaign=amid-ripples-triumph-borroe-and-litecoin-on-the-cusp-of-1500-growth-this-year",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T101151.644.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T101151.644.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T101151.644-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T101151.644-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T101151.644-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T101151.644-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The world of cryptocurrencies is never short of surprises, with market sentiments often swinging wildly based on various factors. As Ripple (XRP) experiences triumph with favorable legal rulings, investors are keeping a close eye on two other promising cryptocurrencies &#8211; Borroe ($ROE) and Litecoin (LTC) &#8211; both of which are showing signs of immense growth [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T08:15:48.000Z",
    "title": "BREAKING: BlackRock Investigated in The U.S., Is the Highly Anticipated Bitcoin Spot ETF at Risk?",
    "url": "https://www.crypto-news-flash.com/breaking-blackrock-investigated-in-the-u-s-is-the-highly-anticipated-bitcoin-spot-etf-at-risk/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-blackrock-investigated-in-the-u-s-is-the-highly-anticipated-bitcoin-spot-etf-at-risk",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The US House of Representatives Select Committee snubbed BlackRock for its investments in blacklisted Chinese firms. BlackRock issued a clarification that they haven&#8217;t invested outside the ambit of the US government laws. BlackRock recently created huge waves in the crypto space by filing for the spot Bitcoin ETF back in June 2023. However, the world&#8217;s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-02T08:36:42.000Z",
    "title": "4 Solutions For Closed Bank Accounts By Crypto Withdrawals",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-solutions-for-closed-bank-accounts-by-crypto-withdrawals/",
    "description": "<p>As the power and control of money shift away from traditional institutions, banks are desperately attempting to resist the inevitable changes. An increasing number of instances have emerged where banks are closing the accounts of users who engage in cryptocurrency transactions. Especially in the regulatory hellscape US. So how can you avoid getting your US [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-solutions-for-closed-bank-accounts-by-crypto-withdrawals/\">4 Solutions For Closed Bank Accounts By Crypto Withdrawals</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T08:35:29.000Z",
    "title": "1,400+ Voters Participate Coin Edition’s Poll For BTC-Lowest-Price: 41% Say $25K",
    "url": "https://coinedition.com/1400-voters-participate-coin-editions-poll-for-btc-lowest-price-41-say-25k/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/How-low-do-you-think-BTC-will-go-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coin Edition initiated a poll on July 31 requesting its followers to predict the lowest price that BTC could reach. 1,411 voters participated in the poll with 41.1% saying that BTC would reach $25,000. 21.9% of the voters selected $12,000 and $20,000 as the lowest price while 15.1% stated that BTC would reach $15,000.  When [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/1400-voters-participate-coin-editions-poll-for-btc-lowest-price-41-say-25k/\">1,400+ Voters Participate Coin Edition’s Poll For BTC-Lowest-Price: 41% Say $25K</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]