[
  {
    "source": "Crypto Daily",
    "date": "2023-12-26T19:35:47.000Z",
    "title": "Year-End Surprise: Polkadot (DOT), Compound (COMP), and Algorand (ALGO) Setting Up for a Major Breakthrough?",
    "url": "https://cryptodaily.co.uk/2023/12/year-end-surprise-polkadot-dot-compound-comp-and-algorand-algo-setting-up-for-a-major-breakthrough",
    "description": "Explore the pivotal developments in the crypto world as 2023 draws to a close, focusing on DOT (Polkadot), COMP (Compound), and ALGO (Algorand). Uncover how these altcoins are shaping the future of blockchain with strategic partnerships, market trends, and innovative projects. Dive into our analysis to see what the end of the year holds for these leading cryptocurrencies."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-26T19:30:54.000Z",
    "title": "Barry Silbert Resigns as Chairman of Grayscale Investments",
    "url": "https://news.bitcoin.com/barry-silbert-resigns-as-chairman-of-grayscale-investments/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Barry Silbert Resigns as Chairman of Grayscale Investments\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dcgggggs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Digital Currency Group (DCG) founder Barry Silbert has resigned from his position as the chairman of Grayscale Investments. Current DCG chief financial officer Mark Shifke succeeds Silbert and is joined by Edward McGee and Matthew Kummell as members of the new look board. Preparing for Grayscale&#8217;s Next Chapter Barry Silbert, the founder and CEO of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:38:27.000Z",
    "title": "Mark Cuban’s big move with 2.8M MATIC tokens to Coinbase",
    "url": "https://www.cryptopolitan.com/mark-cubans-big-move-with-2-8m-matic/",
    "description": "Billionaire investor Mark Cuban has recently made a significant move involving his holdings in Polygon (MATIC), a prominent Ethereum scaling platform. According to Spot On Chain, a wallet identified as belonging to Cuban has transferred approximately 2.826 million MATIC tokens to Coinbase. This transaction, executed on December 25th, is valued at around $2.56 million, based [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:37:31.000Z",
    "title": "Tech whiz uses AI to resurrect deceased father’s voice as Christmas gift for mother",
    "url": "https://www.cryptopolitan.com/ai-to-resurrect-deceased-fathers-voice/",
    "description": "In a heartwarming gesture that has captured the internet&#8217;s attention, Philip Willet, a tech enthusiast, employed artificial intelligence (AI) to bring back his deceased father&#8217;s voice as a special Christmas gift for his mother. The touching story has gone viral, amassing over 5.6 million views on the platform where he shared it. A special Christmas [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:36:50.000Z",
    "title": "China announces crackdown on illicit crypto exchanges",
    "url": "https://www.cryptopolitan.com/china-announces-crackdown-illicit-exchanges/",
    "description": "Authorities in China, spearheaded by the State Administration of Foreign Exchange (SAFE), recently executed a robust crackdown on an underground bank involved in illicit crypto-based exchange services. This targeted operation, spanning 17 provinces, intricately utilized over 1,000 bank accounts to facilitate transactions totaling a staggering 15.8 billion yuan, equivalent to approximately $2.2 billion. Illegal exchanges [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:26:10.000Z",
    "title": "Expert warns against sharing private information with Chatbots",
    "url": "https://www.cryptopolitan.com/sharing-private-information-with-chatbots/",
    "description": "In a stern warning to users of chatbot technology, Professor Michael Wooldridge, a distinguished computer scientist from Oxford University, has cautioned against divulging private information to artificial intelligence (AI) systems.&#160; The professor emphasized that sharing personal issues with AI, such as complaints about relationships or expressing political opinions, is &#8220;extremely unwise.&#8221; His warning comes when [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:22:16.000Z",
    "title": "Changpeng Zhao’s crypto wealth soars despite legal woes",
    "url": "https://www.cryptopolitan.com/changpeng-zhaos-crypto-wealth-soars/",
    "description": "Changpeng Zhao, the former CEO of Binance Holdings Ltd., has witnessed a remarkable surge in his estimated wealth, defying legal challenges. In a year marked by significant rebounds in the crypto market, Zhao&#8217;s fortune has expanded by almost $25 billion, according to the Bloomberg Billionaires Index. Legal troubles and financial triumph Despite pleading guilty to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:17:50.000Z",
    "title": "Aleksa Gordic Launches YugoGPT: The Premier ChatGPT Clone for South Slavic Languages",
    "url": "https://www.cryptopolitan.com/aleksa-gordic-launches-yugogpt/",
    "description": "In a groundbreaking development for the South Slavic language-speaking region, Aleksa Gordic, the founder of Runa AI, has unveiled YugoGPT, a robust generative language model tailored specifically for Serbian, Croatian, Bosnian, and Montenegrin (BCMS).&#160; YugoGPT touted as the largest generative language model for these languages, aims to offer a versatile AI assistant capable of understanding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:13:43.000Z",
    "title": "Shiba Inu team confirms manual Shibarium burns pre-upgrade",
    "url": "https://www.cryptopolitan.com/shiba-inu-team-confirm-manual-shibarium-burn/",
    "description": "The Shiba Inu (SHIB) development team has announced a significant change in their token burn strategy. According to Lucie, the project&#8217;s content marketing specialist, burning SHIB tokens, which has been manual until now, is set to become automated. This transition aims to enhance efficiency and transparency in the burn mechanism. Lucie&#8217;s announcement, made via a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:13:39.000Z",
    "title": "Tim Draper shares his optimistic outlook on Bitcoin",
    "url": "https://www.cryptopolitan.com/tim-draper-optimistic-outlook-bitcoin/",
    "description": "Venture capitalist Tim Draper has maintained his optimistic outlook on Bitcoin, doubling down on his prediction that the cryptocurrency’s price will reach $250,000. In a recent interview with Coin Bureau, Draper expressed confidence in his earlier forecast, emphasizing that he expects the $250,000 milestone to be achieved soon and believes the price could surpass that [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T19:31:46.000Z",
    "title": "Binance debuts new web3 AI gaming platform",
    "url": "https://crypto.news/binance-debuts-new-web3-ai-gaming-platform/",
    "description": "Binance has introduced Sleepless AI as the 42nd project on its Launchpool."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T19:19:07.000Z",
    "title": "Today’s top cryptocurrency gainers: PancakeSwap, Sei, BNB",
    "url": "https://crypto.news/todays-top-cryptocurrency-gainers-pancakeswap-sei-bnb/",
    "description": "PancakeSwap, Sei, and Binance Coin have seen significant value surges in cryptocurrency, propelled by strategic decisions and innovative developments."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-26T19:12:35.000Z",
    "title": "Telcoin Hacking: TEL Native Token Impact and Recovery",
    "url": "https://www.crypto-news-flash.com/telcoin-hacking-tel-native-token-impact-and-recovery/?utm_source=rss&utm_medium=rss&utm_campaign=telcoin-hacking-tel-native-token-impact-and-recovery",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/towfiqu-barbhuiya-em5w9_xj3uU-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Telcoin Acts Fast to Secure Platform Post-Multi-Million Hack\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/towfiqu-barbhuiya-em5w9_xj3uU-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/towfiqu-barbhuiya-em5w9_xj3uU-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/towfiqu-barbhuiya-em5w9_xj3uU-unsplash-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/towfiqu-barbhuiya-em5w9_xj3uU-unsplash-450x300.jpg 450w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Telcoin suffers hack in wallet application, causing loss of more than $1 million and TEL token crash. Telcoin team responds quickly, ensuring data security and committing to restore affected balances after the attack. In the world of cryptocurrencies, where security is as valuable a currency as Bitcoin, what has happened to Telcoin shakes the foundations [...]"
  }
]