[
  {
    "source": "CoinDesk",
    "date": "2023-10-30T11:02:07.000Z",
    "title": "Crypto Exchange Linked to 3AC Founders Drops Lawsuit Against Mike Dudas",
    "url": "https://www.coindesk.com/policy/2023/10/30/crypto-exchange-linked-to-3ac-founders-drops-lawsuit-against-mike-dudas/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "OPNX voluntarily dropped its defamation suit against the venture investor and crypto personality."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-30T10:43:16.000Z",
    "title": "Singapore, Japan, UK, Swiss Regulators Plan Asset Tokenization Pilots",
    "url": "https://www.coindesk.com/policy/2023/10/30/singapore-japan-uk-swiss-regulators-plan-asset-tokenization-pilots/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Project Guardian seeks to advance digital asset tokenization pilots in fixed income, foreign exchange and asset management products."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T10:41:27.000Z",
    "title": "Bitcoin price and energy use for mining highly correlated: UN report",
    "url": "http://cointelegraph.com/news/bitcoin-price-mining-energy-highly-correlated-un-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/084aab9c-943d-4fe6-8b6f-bb2712528302.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>UN scientists evaluated the activities of 76 Bitcoin mining nations during the 2020–2021 period and found that the global BTC mining network consumed 173.42 TW/hs of electricity.</p>\n                    <p><p>A recent study conducted by the United Nations suggests a direct correlation between the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and the energy needed for mining operations.</p><p>UN scientists evaluated the activities of 76 Bitcoin mining nations during the 2020–2021 period and found that the global Bitcoin mining network consumed 173.42 terawatt-hours of electricity. During this timeframe, the crypto ecosystem was undergoing a bull run, and Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-price-briefly-hits-69k-ath-before-plummeting-back-to-earth\">rallied to mark its all-time high</a> of $69,000. The UN report highlighted:</p><blockquote>“A 400% increase in Bitcoin’s price from 2021 to 2022 triggered a 140% increase in the energy consumption of the worldwide Bitcoin mining network.”</blockquote><p>At the time, fossil energy sources accounted for 67% of the electricity generated for Bitcoin mining. However, crypto entrepreneurs have taken proactive measures to increase their dependence on green energy.</p><p>Hydropower satisfied over 16% of the total electricity demand of the global Bitcoin mining network; nuclear, solar and wind energy sources provided 9%, 2% and 5%, respectively.</p><p>According to the UN report, the top 10 Bitcoin mining nations at the time — China, United States, Kazakhstan, Russia, Malaysia, Canada, Germany, Iran, Ireland and Singapore — were responsible for 92%–94% of the global carbon, water and land footprint of Bitcoin.</p><p>The global push for greener alternatives to fulfill the grid demand will also help reduce the carbon footprint of Bitcoin and the crypto ecosystem.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-mining-becoming-more-environmentally-friendly\"><strong><em>Bitcoin mining is becoming more environmentally friendly</em></strong></a></p><p>Recently, Genesis Digital Assets Limited, a mining and data center company with over 400 megawatts (MW) of power generation worldwide, opened a new data center in Sweden running 1,900 Bitcoin mining machines, driven by <a href=\"https://cointelegraph.com/news/renewable-energy-bitcoin-mining-sweden\">the country’s burgeoning renewable energy surplus</a>.</p><p>Christian Anders, founder of BT.CX, told Cointelegraph that Bitcoin mining is not very common due to high energy prices. However, he added:</p><blockquote>“Sweden, Finland and Norway have a surplus of energy and negative energy prices from time to time, and primarily renewable energy in the form of hydropower in a remote location which is hard to distribute.”</blockquote><p>In parallel, Bitcoin mining equipment manufacturers continue to deliver energy-efficient hardware. At the World Digital Mining Summit on Sept. 22, Bitcoin miners shared their plans to help decarbonize the crypto ecosystem.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/62f5d806-77b9-48c4-a55d-3e26c34f7337.png\"  /></figure><p>Bitmain rolled out its efficiency-focused Antminer S21, while Nazar Khan, chief operating officer of TerraWulf, highlighted that the role Bitcoin rig manufacturers play “is locating our Bitcoin mining loads in places where that’s happening and how do we facilitate that decarbonization process.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking: Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T11:05:30.000Z",
    "title": "Bitcoin’s mining difficulty adjusts upwards for the fourth consecutive time",
    "url": "https://cryptoslate.com/insights/bitcoins-mining-difficulty-adjusts-upwards-for-the-fourth-consecutive-time/",
    "description": "<p>Quick Take Bitcoin&#8217;s mining difficulty, an important metric for the health of the network, has seen another positive adjustment, 62.46T, marking the fourth consecutive rise. This time, the increase is slightly over 2%, a subtle yet important change that signifies the continued growth and resilience of the network. As a consequence of this adjustment, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-mining-difficulty-adjusts-upwards-for-the-fourth-consecutive-time/\">Bitcoin&#8217;s mining difficulty adjusts upwards for the fourth consecutive time</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T10:51:22.000Z",
    "title": "RGU Professor Wins Academic of the Year at UK Awards",
    "url": "https://www.cryptopolitan.com/rgu-professor-wins-academic-awards/",
    "description": "Professor Eyad Elyan from Robert Gordon University (RGU), specializing in Artificial Intelligence and machine learning, has been awarded the title of Academic of the Year at the Innovate UK Knowledge Transfer Partnership (KTP) Awards 2023. His achievement is attributed to his pivotal role in leading a groundbreaking KTP project with Aberdeen-based inspection specialists AISUS Offshore. ... <a title=\"RGU Professor Wins Academic of the Year at UK Awards\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rgu-professor-wins-academic-awards/\" aria-label=\"More on RGU Professor Wins Academic of the Year at UK Awards\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T10:45:23.000Z",
    "title": "USDT’s Meteoric Rise in Brazil’s Crypto Market",
    "url": "https://www.cryptopolitan.com/usdts-meteoric-rise-in-brazils-crypto-market/",
    "description": "In a remarkable turn of events, Brazil has witnessed a staggering surge in the adoption of Tether (USDT) in 2023, solidifying its position as the frontrunner in the country&#8217;s cryptocurrency landscape. According to data from Brazil&#8217;s revenue service agency, USDT now constitutes a remarkable 80% of all cryptocurrency transactions in the nation. As of mid-October ... <a title=\"USDT&#8217;s Meteoric Rise in Brazil&#8217;s Crypto Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/usdts-meteoric-rise-in-brazils-crypto-market/\" aria-label=\"More on USDT&#8217;s Meteoric Rise in Brazil&#8217;s Crypto Market\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T11:00:00.000Z",
    "title": "Saudi Arabia’s NEOM partners with Animoca, eyes $50m deal",
    "url": "https://crypto.news/saudi-arabias-neom-partners-with-animoca-eyes-50m-deal/",
    "description": "Animoca will develop web3 solutions and establish a hub in Saudi Arabia following the partnership with NEOM Investment Fund. Metaverse and blockchain gaming venture capital firm Animoca Brands has entered into a strategic partnership agreement with the NEOM Investment Fund,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T11:00:50.000Z",
    "title": "Ethereum Resilient Above $1,800 Pre-FOMC Meeting – Details",
    "url": "https://www.newsbtc.com/news/ethereum-resilient-above-1800-pre-fomc-meeting-vital-levels-to-watch/",
    "description": "Ethereum (ETH), one of the leading cryptocurrencies, is displaying remarkable resilience in the face of recent market fluctuations. Despite experiencing relatively modest gains compared to Bitcoin (BTC) and other major altcoins, ETH has managed to consolidate its position above the $1800 mark. The big question on everyone&#8217;s mind is whether Ethereum can sustain this level or if it will succumb to the prevailing market sentiment. In the world of cryptocurrencies, prices are highly susceptible to market sentiment. Cryptocurrencies often exhibit dramatic price swings based on the emotions and perceptions of investors and traders. Positive sentiment tends to drive prices up, while negative sentiment can lead to sharp declines. In this particular instance, the catalyst for market sentiment is the upcoming US Federal Open Market Committee (FOMC). Related Reading: Charting The Dogecoin Path: More Gains On the Horizon? The Role Of FOMC In Influencing ETH And The Crypto Market The FOMC is a key division of the US Federal Reserve responsible for setting monetary policy in the United States. One of the primary tools at its disposal is the adjustment of interest rates. When the FOMC meetings take place, the decisions made regarding interest rates can have a significant impact on various financial markets, including cryptocurrencies. If the FOMC decision leans towards a hawkish stance, implying an increase in interest rates, it could result in a surge of bearish sentiment across the cryptocurrency market. In such a scenario, Ethereum sellers might exert pressure, potentially pushing the altcoin below the $1700 mark. Conversely, a dovish or unchanged policy stance could lead to a more positive sentiment, allowing ETH to maintain its current position and even experience upward momentum. Source: Coingecko As of the latest data available on CoinGecko, Ethereum is trading at $1,816, showcasing a 1.8% gain over the last 24 hours and a notable 8.8% increase over the past seven days. While these gains may appear modest when compared to the cryptocurrency market&#8217;s usual volatility, they reflect Ethereum&#8217;s capacity to maintain a steady footing in turbulent times. Related Reading: Pepe Conquers The Weekend Charts With 61% Rally – Here’s Why Ethereum currently trading at $1,826.1 on the daily chart: TradingView.com Ethereum Layer 2 Solutions Break Records A noteworthy development in the Ethereum ecosystem is the remarkable performance of Layer 2 (L2) solutions. These scaling solutions are designed to alleviate Ethereum&#8217;s network congestion and high gas fees. Recently, L2 solutions set a new all-time high in Total Value Locked (TVL), briefly touching $12 billion before stabilizing around $11.89 billion. This achievement surpasses the previous historic high registered back in April at $11.85 billion, signifying the increasing adoption of Ethereum&#8217;s Layer 2 solutions. Source: L2Beat. With the $1,800 threshold serving as a crucial psychological barrier, the ultimate direction of Ethereum&#8217;s price movement hinges on the delicate balance between market sentiment and the decisions of key financial institutions.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T10:58:51.000Z",
    "title": "Bitcoin Whales Gather $1 Billion in BTC as Institutional Demand Surges; Is a $40,000 Price Surge on the Horizon?",
    "url": "https://www.crypto-news-flash.com/bitcoin-whales-gather-1-billion-in-btc-as-institutional-demand-surges-is-a-40000-price-surge-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-whales-gather-1-billion-in-btc-as-institutional-demand-surges-is-a-40000-price-surge-on-the-horizon",
    "description": "<img width=\"2048\" height=\"1365\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/BTC1-48x32.jpg 48w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />Over the past week, Bitcoin whales acquired over 30,000 BTC, equivalent to approximately $1 billion, signaling aggressive accumulation. Investment firm VanEck&#8217;s resubmission for a spot Bitcoin ETF with the SEC, following other financial giants like BlackRock, highlights the strong demand for this product. The world&#8217;s largest cryptocurrency Bitcoin (BTC) has been flirting around $35,000 levels [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-30T10:59:57.000Z",
    "title": "All you have to Know About Celestia’s Airdrop",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/all-you-have-to-know-about-celestias-airdrop/",
    "description": "<p>OTC deals indicate $TIA will be listed at $2. Since Celestia has announced integration with Arbitrum, there is high anticipation of mainnet, too. There are rumors that Celestia&#8217;s Airdrop will launch on the mainnet today (31st October) at 2 PM UTC. Let&#8217;s discover more info about it. Announcing integration into @Arbitrum Orbit 🪐 and the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/all-you-have-to-know-about-celestias-airdrop/\">All you have to Know About Celestia&#8217;s Airdrop</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T10:54:00.000Z",
    "title": "Avalanche’s Snowtrace to Deactivate, Community in Frenzy",
    "url": "https://coinedition.com/avalanches-snowtrace-to-deactivate-community-in-frenzy/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Snowtrace, the blockchain explorer and analytics platform for the decentralized smart contracts firm Avalanche C-Chain, has alerted the community about its closure of activities. According to the prior notice on the platform’s official website, Snowtrace will be deactivated today at 00:00 UTC. Crypto analytics platform PeckShieldAlert took to X earlier today to draw the community’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/avalanches-snowtrace-to-deactivate-community-in-frenzy/\">Avalanche’s Snowtrace to Deactivate, Community in Frenzy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]