[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T15:10:15.000Z",
    "title": "Crypto Exchange KuCoin to 'Adjust Some Personnel as Needed', but Denies Report of Major Layoffs",
    "url": "https://www.coindesk.com/business/2023/07/25/crypto-exchange-kucoin-to-adjust-some-personnel-as-needed-denies-layoffs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A report circulated on Twitter on Tuesday that the exchange plans to eliminate 30% of its workforce amid declining profit."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T15:16:18.000Z",
    "title": "Solana game developer Automata announces mass layoffs",
    "url": "https://cointelegraph.com/news/solana-game-developer-automata-announces-mass-layoffs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3eb8fd8a-6cf1-4768-b223-36eb393f9c61.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"It is with a heavy heart that I am writing today to share news about team restructuring efforts we are effectuating today,\" wrote CEO and co-founder Michael Wagner.  </p>\n                    <p><p>Solana game developer Automata (ATMTA) will undergo \"a significant headcount reduction\" to preserve its ability to develop Star Atlas. After the restructuring, the Automata team will comprise just 45 staff, compared to 235 in late 2022.</p><p>According to the July 24 <a href=\"https://discord.com/channels/789226204980707409/799478132993425429\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> on Discord, Michael Wagner, CEO and co-founder of ATMTA, said the restructured team will instead shift its focus to \"delivering SAGE and the newly announced Crew Mobile App.\" Meanwhile, the development of a software development kit (SDK) combining Unreal Engine 5 and Solana will \"resume at a significantly slower pace.\" The SDK serves as the basis for the Star Atlas game.</p><p>In explaining the changes, Wagner wrote that approximately 33% of the project's revenue was taken as in-game token Atlas, which the team \"steadfastly held.\" The token has lost approximately 80% of its value in the past year. In addition:</p><blockquote>\"We also had to pay a material tax liability approaching $30 million. And as many of you already know, we lost approximately $15 million from our treasury with the collapse of FTX, which represented a significant portion of our liquid cash balance.\"</blockquote><p>Developers said that the team managed to recover a \"sizable portion\" of the FTX funds in January, but runway remains \"greatly reduced.\" Wagner also stated that it was \"unlikely\" for the project to close an equity and debt financing deal signed in January.</p><blockquote>\"It is a hard truth that our current high rate of AAA-quality development is capital intensive and, at present, unsustainable without a significant shift in business strategy.\"</blockquote><p>At the same time, the Solana blockchain <a href=\"https://cointelegraph.com/news/solana-uptime-improves-with-one-outage-this-year\">recorded all-time high usage</a> in the first half of 2023. The network had a 100% uptime in Q2. The Solana Foundation introduced grants to support the ecosystem earlier this year. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\">How smart people invest in dumb memecoins: 3-point plan for success</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T15:14:55.000Z",
    "title": "Worldcoin faces regulatory scrutiny amid community backlash on privacy concerns",
    "url": "https://cryptoslate.com/worldcoin-faces-regulatory-scrutiny-amid-community-backlash-on-privacy-concerns/",
    "description": "<p>Worldcoin&#8217;s (WLD) recent launch has drawn Britain&#8217;s regulatory scrutiny amid community concerns over its privacy issues. Reuters reported that a spokesperson for the Information Commissioner&#8217;s Office (ICO) acknowledged the project&#8217;s launch, adding that the regulatory body would inquire further about its operations. ICO has yet to respond to CryptoSlate&#8217;s request for comment at the time [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/worldcoin-faces-regulatory-scrutiny-amid-community-backlash-on-privacy-concerns/\">Worldcoin faces regulatory scrutiny amid community backlash on privacy concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-25T15:27:34.000Z",
    "title": "Worldcoin’s Shady History and Data Collection Practices: MIT Technology Review",
    "url": "https://cryptobriefing.com/worldcoins-shady-history-and-data-collection-practices-mit-technology-review/?utm_source=feed&utm_medium=rss",
    "description": "Worldcoin has been courting users with a plan as ambitious as it is controversial and was recently launched on July 24, 2023. Built on the promise of an equitably distributed,..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:32:23.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:28:19.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:25:05.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $70.69, with a 24-hour trading volume of $46,901,072. Aave is up 1.84% in the last 24 hours. The current CoinMarketCap ranking is #42, with a live market cap of $1,024,249,121. It has a circulating supply of 14,488,605 AAVE coins and a max. supply of 16,000,000 AAVE ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:20:07.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:18:22.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:12:13.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T15:10:22.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T15:30:43.000Z",
    "title": "Here’s How Crypto Offers A Lifeline For This Bahamian Payment Company",
    "url": "https://www.newsbtc.com/news/crypto-payments-by-bahamian-payment-company/",
    "description": "The Latin American region faces high costs and challenges of traditional settlements, as people sending money to their close ones have to deal with high rates of transfer, and a portion of the population still remains unbanked. However, in a recent development, the Bahamas payment company, Island Pay, is now incorporating cryptocurrency for remittance transactions to make it a smoother and cheaper process. Island Pay is set to introduce crypto wallets that utilize the stablecoin USDC as the medium of exchange. The payment firm plans to roll out the CiNKO wallet in more than 30 countries. The wallet which caters to users in the Caribbean and LATAM regions will enable individuals to conduct transactions with vendors, make payments to others (including those without bank accounts), and fund pre-paid cards. Island Pay CEO Richard Douglas stated: Our goal is to continuously look for ways to advance financial inclusion in the region and enhance financial experiences for both the unbanked and banked populations. Related Reading: Will Bitcoin Rebound? This Metric May Be The One To Watch Crypto Revolutionizes Remittance Landscape, Advancing Financial Inclusion By integrating crypto for remittance, Island Pay demonstrates its commitment to fostering financial inclusion and enriching monetary experiences for both banked and unbanked individuals in the region. The incorporation of this technology will lead to significant reductions in international money transfer fees. When receiving USDC stablecoins on CiNKO, users will not be charged. They may, however, encounter gas fees, depending on the blockchain network used for the transaction. The demand for crypto transactions has surged due to the existing challenges in conventional remittance methods. According to the World Bank, the average cost of sending $200 can be as high as 6.2%. Additionally, these transactions often take several days to process through traditional financial intermediaries. As pointed out in Circle&#8217;s recent report, the technology has the potential to slash the cost of sending money abroad by a substantial 80%. This report predicts that Blockchain&#8217;s capacity to enhance cost savings for financial institutions engaged in cross-border transactions will reach a market cap of $10 billion by the year 2030. Even before this, the Bahamas boasted a well-established presence in the fintech sector, with various global payment platforms and crypto wallets operating in the region. Rifos disclosed that the remittance and payments sectors are currently the fastest-growing fintech segments in LATAM. The surge in smartphone adoption and connectivity has also played a crucial role in fostering innovation and advancements in these areas. Related Reading: Aave May Rally 20% Supported by Historical Levels, But Crucial Resistance Remains Despite the high fees with traditional channels, remittances to Latin America and the Caribbean witnessed remarkable growth. There has been a 27% increase in 2021 and an 11% increase in 2022, with a total of $145 billion in 2017. The region&#8217;s GDP is expected to slow down to 3.3% this year, but remittances are expected to reach an all-time high. Featured image from Freeman Law, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T15:30:52.000Z",
    "title": "Decentraland (MANA) Suffers Miserable Week While VC Spectra (SPCT) Continues to Impress Investors",
    "url": "https://www.crypto-news-flash.com/decentraland-mana-suffers-miserable-week-while-vc-spectra-spct-continues-to-impress-investors/?utm_source=rss&utm_medium=rss&utm_campaign=decentraland-mana-suffers-miserable-week-while-vc-spectra-spct-continues-to-impress-investors",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T161010.970.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T161010.970.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T161010.970-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Decentraland (MANA) is struggling to keep up with the expectations of its investors. As big whales turn their backs on Decentraland (MANA), VC Spectra (SPCT) is the best alternative. Having given a 37.5% ROI to its investors in Stage 2 of the public presale and raising over $2.4 million in private presale events, VC Spectra [...]"
  }
]