[
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T04:49:36.000Z",
    "title": " Robinhood crypto trading rises 75% in Nov, CEO tips ‘9 figures&#039; in revenue ",
    "url": "https://cointelegraph.com/news/robinhood-crypto-trading-surge-november-ceo-vlad-tenev",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNjg4YTkzZjctY2RmYi00OTNkLWEwNWMtNWZhMzZjYTI5ODFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The trading platform posted a sharp rise in monthly crypto trading volumes in November, while CEO Vlad Tenev said he hopes to eventually reel in “nine figures” in annual revenue.</p>\n                    <p><p >Crypto-friendly trading platform Robinhood has reported a 75% month-on-month increase in digital asset trading volume in November.</p><p >In an 8-K <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1783879/000178387923000277/hood-20231204.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> to the Securities and Exchange Commission on Dec. </p><p >The activity however equity trading volumes and options contracts traded were roughly flat in the same month compared to October.</p><p >The bumper month marks a reversal for Robinhood, which <a href=\"https://cointelegraph.com/news/robinhood-european-expansion-q3-revenue-drop\">revealed a 55% decrease</a> in cryptocurrency notional volumes over the year in its Q3 results filing. </p><p >As a result, its Q3 revenue came in below analyst estimates for the quarter at $467 million. </p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/18a6ac1c-c062-4ce7-97e6-e72e5d23fc07.jpg\"  /><figcaption style=\"text-align: center;\"><em>Robinhood’s 8-K report showing preliminary operating data for November 2023. Source: SEC</em></figcaption></figure><p >Robinhood could be eyeing a more profitable fourth quarter in light of the recent crypto market rally, which has seen total capitalization surge 40% to $1.6 trillion over the past two months. </p><p >Robinhood co-founder and CEO Vlad Tenev told investors in a November earnings call that the platform could eventually reel “nine figures” in annual revenue.</p><p><a href=\"https://cointelegraph.com/news/robinhood-crypto-trading-surge-november-ceo-vlad-tenev\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T04:50:14.000Z",
    "title": "What’s the Science of New Humans?",
    "url": "https://www.cryptopolitan.com/whats-the-science-of-new-humans/",
    "description": "The convergence of CRISPR, AI, and synthetic biology is rapidly transforming our understanding of human biology and paving the way for a new era of human enhancement. These powerful technologies have the potential to revolutionize healthcare, enable us to overcome biological limitations, and even transform our very conception of what it means to be human. ... <a title=\"What&#8217;s the Science of New Humans?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whats-the-science-of-new-humans/\" aria-label=\"More on What&#8217;s the Science of New Humans?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T04:55:30.000Z",
    "title": "Ethereum Price Bull Run Could Extend By 5%, Why ETH Could Rally To $2,500",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bull-run-2500/",
    "description": "Ethereum price is gaining pace above the $2,200 resistance. ETH is up over 8% and might continue to rise toward the $2,500 resistance in the coming days. Ethereum is gaining pace and recently surpassed the $2,250 resistance. The price is trading above $2,200 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $2,225 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its rally if it clears the $2,275 resistance zone. Ethereum Price Follows Bitcoin Ethereum price started a strong increase above $2,000, like Bitcoin. ETH cleared many hurdles near $2,120 to enter a positive zone. The price even surged above the $2,200 level to set the tone for a larger increase. A new multi-month high was formed near $2,275 and the price is now consolidating gains. There was a minor move below the 23.6% Fib retracement level of the upward move from the $2,148 swing low to the $2,275 high. However, Ethereum is still trading above $2,200 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $2,225 on the hourly chart of ETH/USD. On the upside, the price is facing resistance near the $2,250 zone. Source: ETHUSD on TradingView.com The next key resistance is near the $2,275 level. A clear move above the $2,275 zone could send the price toward the $2,320 level. The next resistance sits at $2,350. Any more gains could start a wave toward the $2,500 level. Are Dips Limited in ETH? If Ethereum fails to clear the $2,250 resistance, it could start a downside correction. Initial support on the downside is near the $2,220 level and the trend line. The next key support is $2,175 or the 76.4% Fib retracement level of the upward move from the $2,148 swing low to the $2,275 high. The main support is now near $2,150 or the 100-hourly Simple Moving Average. A downside break below $2,150 might start a steady decline. The key support is now at $2,080, below which there is a risk of a move toward the $2,020 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,175 Major Resistance Level – $2,250"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-05T04:40:33.000Z",
    "title": "The Future of Trust in a Digital World – Self-Sovereign Identity",
    "url": "https://dailyhodl.com/2023/12/04/the-future-of-trust-in-a-digital-world-self-sovereign-identity/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/Outcome-of-US-Presidential-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" /><p>In today&#8217;s interconnected world, trust is the currency of interaction. The higher the risks, the higher the stakes, and the more trust is required. By trusting another party, you essentially empower them to act and decide in a manner that affects you, and by subsequently verifying their actions, you can confirm that they do indeed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/the-future-of-trust-in-a-digital-world-self-sovereign-identity/\">The Future of Trust in a Digital World – Self-Sovereign Identity</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]