[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T14:59:37.000Z",
    "title": "Valkyrie Refiles for Spot Bitcoin ETF With Coinbase as Surveillance Partner",
    "url": "https://www.coindesk.com/business/2023/07/05/valkyrie-refiles-for-spot-bitcoin-etf-with-coinbase-as-surveillance-partner/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Valkyrie Digital Assets refiled its application for a spot bitcoin exchange traded fund (ETF) with the U.S. Securities and Exchange Commission, joining asset managers including BlackRock and Fidelity in taking another stab at the process."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-05T15:01:04.000Z",
    "title": "Bitcoin, Ethereum CME Contracts Hit $46.8B in Trading Volume Last Month",
    "url": "https://decrypt.co/147389/bitcoin-ethereum-cme-contracts-hit-46-8b-trading-volume-last-month",
    "description": "Amid the latest flurry of Bitcoin ETF refilings, institutional investors appear to be taking a second look at the largest cryptocurrencies."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T14:46:02.000Z",
    "title": "The Supreme Court could stop the SEC’s war on crypto",
    "url": "https://cointelegraph.com/news/supreme-court-could-stop-the-sec-war-on-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/77d1961f-4cb3-4c09-bc90-b6b6fb319ff1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett are among a group on the Supreme Court who may not smile upon the SEC’s interpretation of the law.</p>\n                    <p><p>When the leaders of the American Revolution signed the Declaration of Independence on July 4, 1776, they had no guarantee of victory. The battle for independence was underway, and their prospects were uncertain. Despite occasional victories, these audacious freedom fighters were grossly outnumbered and had difficulty retaining volunteer soldiers. Their commitment to the cause of freedom was their only fighting chance.</p><p>Cryptocurrency as an <a href=\"https://cointelegraph.com/news/the-importance-of-open-source-in-computer-science-and-software-development\">open-source software</a> industry is in a similar predicament. The United States Securities and Exchange Commission and banking regulators are trying to dismantle this budding industry, brandishing lawsuits and an intimidating array of regulatory measures designed to make compliance impossible.</p><p>Crypto’s fighting chance is embedded within the very words and legal principles put forth by America’s founders in the Constitution. They designed the Constitution on the principle of the separation of powers inspired by the Enlightenment. Their vision was of a system with three separate but coequal branches of government, each acting as a safeguard against the potential abuse of power by the others.</p><p>Coinbase stands at the vanguard in the modern battlefield of cryptocurrency as it stares down a <a href=\"https://cointelegraph.com/news/coinbase-sec-to-present-response-to-coinbase-s-legal-defense-on-july-13\">lawsuit brought by the SEC</a>. In June, the company delivered a declaration in response to the lawsuit that leans on the “major questions doctrine.” This essential legal principle holds agencies like the SEC accountable when they circumvent Congress’ role in our constitutional structure and manipulate vague and antiquated statutes for their own ends.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elizabeth-warren-wants-the-police-at-your-door-in-2024\"><strong><em>Elizabeth Warren wants the police at your door in 2024</em></strong></a></p><p>In recent landmark cases that curbed executive overreach in both the Obama and Biden administrations, the Supreme Court has underscored the importance of the major questions doctrine. This doctrine underlines the crucial point that when agencies attempt to regulate questions of significant national or political importance, they must have explicit authorization from Congress.</p><p>This doctrine is not new nor untested. When the Food and Drug Administration (FDA) attempted to regulate cigarettes, justifying action by defining them under the FDA’s authority over drugs, the Supreme Court struck down the agency’s overreach. The court pointed out that nicotine, while technically a drug, did not fall under the palliative class of drugs Congress had intended when creating the FDA.</p><p>A similar verdict was reached regarding the Environmental Protection Agency’s (EPA) attempt to regulate carbon emissions. The EPA was prevented from broadening its mandate over power plant pollution to set a national policy on carbon emissions, which was beyond its remit and would usurp the role of the legislature.</p><p>The Supreme Court’s decision striking down Biden’s student loan forgiveness program is the most recent invocation of the major questions doctrine. Coinbase general counsel Paul Grewal astutely observed that one could substitute crypto for student loans in the court’s ruling and envision a similar outcome.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Actually, it’s far worse. The “economic and political significance” of falsely claiming authority over all digital assets other than BTC is not just “staggering,” but untethered to the fundamental requirement that there be enforceable rights between enterprise and purchaser. 2/3</p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1676128240631414784?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>SEC Chairman Gary Gensler’s apologists argue that the securities laws from the 1930s have successfully adapted to the internet era, hence they can adapt to crypto as well. This argument would carry weight if the SEC made similar adaptations to crypto as they did to the internet.</p><p>Over the years, the SEC has proven its capacity to evolve, allowing prospectus delivery over the internet and sanctioning executive communications through social media. But when it comes to crypto, the SEC stubbornly insists that developers must comply with laws that, without nuanced adaptation, are impossible to adhere to.</p><p>This grudging approach of “just come in and register” while blatantly ignoring the numerous questions raised in Coinbase’s 2022 request for rulemaking is exactly why the major questions doctrine — as interpreted by Justices Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett — is so relevant to the SEC’s approach to crypto regulation. The doctrine acts as a constitutional compass, guiding the direction of authority, and restraining overreach by various agencies.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-hurting-little-guys-for-wall-street\"><strong><em>Gary Gensler is hurting the little guys for Wall Street</em></strong></a></p><p>The framers of the Constitution left us an arsenal of tools to wage a revolution for freedom within the design of the U.S. Constitution. Legal scholars and constitutionalists, including Gorsuch, are reviving the founders’ vision of a delicate balance of power among the three branches with the major questions doctrine.</p><p>Crypto defendants, such as Coinbase, Ripple and Binance, are pioneering a revolution of their own. They are at the forefront of a movement aiming to decentralize power, shifting it from centralized institutions to the hands of individuals. In their struggle, they are armed with the very same tools our founders used to shape this nation.</p><p>There’s a striking parallel between our founders’ fight for political freedom and the current struggle for financial freedom in the digital realm. The underpinnings of both these movements are deeply rooted in a quest for autonomy and liberty.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>J.W. Verret</strong> is an associate professor at George Mason University’s Antonin Scalia Law School. He is a practicing crypto forensic accountant and also practices securities law at Lawrence Law LLC. He is a member of the Financial Accounting Standards Board’s Advisory Council and a former member of the SEC Investor Advisory Committee. He also leads the Crypto Freedom Lab, a think tank fighting for policy change to preserve freedom and privacy for crypto developers and users.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T15:00:29.000Z",
    "title": "Large cluster of leveraged Bitcoin bets at risk of liquidation",
    "url": "https://cryptoslate.com/insights/large-cluster-of-leveraged-bitcoin-bets-in-danger-of-liquidation/",
    "description": "<p>Quick Take The use of a liquidation map as a tool for understanding investor leverage has been effectively demonstrated by Coinglass. This approach involves plotting liquidation levels in correlation with Bitcoin&#8217;s price. There&#8217;s a substantial grouping of potential liquidations that stands out just below the $30,000 benchmark, stretching as low as $29,000. What&#8217;s especially remarkable [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/large-cluster-of-leveraged-bitcoin-bets-in-danger-of-liquidation/\">Large cluster of leveraged Bitcoin bets at risk of liquidation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-05T14:45:53.000Z",
    "title": "Crypto Advertisements Soon to Have Major Restrictions in UK",
    "url": "https://cryptobriefing.com/crypto-advertisement-restrictions-uk/?utm_source=feed&utm_medium=rss",
    "description": "The UK Government has expanded the scope of the financial promotion regime to incorporate specific crypto assets. This new regulation, which comes into effect on October 8, 2023, mandates all..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Stops Eyed Below 30635 - 6 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-stops-eyed-below-30635-6-july-2023",
    "description": "<p>BTC/USD Bears Eye Stops Below 30635:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 6 July 2023</p>\n<p>Bitcoin (BTC/USD) continued to orbit the 31000 figure early in the Asian session as the pair remained within striking distance of testing the recent twelve-month high around the 31443.67 area, just below an upside price objective associated with buying pressure that strengthened around the 26637.41 area. Decent selling pressure intensified around the 31142.38 area and this elevates the risk of another test of the 29427 area, representing the 38.2% retracement of the broader appreciating range from 26165.98 to 31443.67.&nbsp; &nbsp;Below that area, the 28604.83 level represents the 50% retracement of that appreciating range.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.</p>\n<p>Following recent selling pressure, areas of potential technical support and buying pressure include the 29863, 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30576.33 and the&nbsp;100-bar MA&nbsp;(Hourly) at 30698.91.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T14:46:57.000Z",
    "title": "Validation Cloud Node API Integrates Casper Mainnet, Empowering Enterprise Blockchain Users",
    "url": "https://cryptodaily.co.uk/2023/07/validation-cloud-node-api-integrates-casper-mainnet-empowering-enterprise-blockchain-users",
    "description": "<p>Zug, Switzerland, July 5th, 2023, Chainwire</p><p>Casper Network, a leading blockchain platform for enterprise and DeFi applications, is now integrated into Validation Cloud's Node API. The Casper integration will give applications and enterprises access to Validation Cloud&rsquo;s platform, which delivers fast, scalable, and intelligent connectivity into commercial blockchains. For Casper, the most impressive part of the integration process was the delivery speed - a mere five days from start to finish.</p>&ldquo;We&rsquo;re thrilled about the integration of Casper Network into Validation Cloud&rsquo;s node API. This partnership opens up exciting opportunities for developers and enterprises.&nbsp;By combining Casper&rsquo;s scalability and security with Validation Cloud&rsquo;s speed and resilience, we&rsquo;re providing developers with the ability to get started in hours, not days or months. This streamlined process reflects our commitment to empowering innovation while maintaining the highest standards of integrity and trust,&rdquo; said&nbsp;Steve Duignan, Head of Growth, Casper Association.&ldquo;We&rsquo;re excited for enterprises and DeFi applications to take advantage of this integration to deploy nodes and we look forward to seeing what developers and enterprises build on the Casper Network using Validation Cloud's infrastructure,&rdquo; said Validation Cloud CSO Alex Nwaka.<p>Casper Network is known for its ability to provide scalable and secure blockchain solutions for enterprises and DeFi applications, making Validation Cloud&rsquo;s infrastructure a perfect complement. Not only will the integration with Validation Cloud further enhance Casper&rsquo;s capabilities, but will also make the network more accessible to applications and enterprises alike.</p><p>Validation Cloud's node API provides a comprehensive and user-friendly way to interact with multiple blockchain networks, including Casper Network, which allows users to focus on building applications instead of managing infrastructure. With this integration, developers can take advantage of Casper Network's features, including smart contracts, asset issuance, and more, while seamlessly managing their nodes through Validation Cloud's node API.</p><p>Connect to Casper now at app.validationcloud.io&nbsp;</p><p>About Validation Cloud</p><p>Validation Cloud is a Web3 data streaming and infrastructure company that connects organizations into Web3 through a fast, scalable, and intelligent platform. Headquartered in Zug, Switzerland, Validation Cloud offers highly performant and customizable products in staking, node, and data-as-a-service. Learn more at Validationcloud.io | LinkedIn | Twitter | Medium</p><p>About Casper</p><p>Casper is a powerful, public smart contract platform empowering creators, communities, and businesses to connect with integrity and trust. It operates as a future-proof blockchain enabling long-term solutions to real-world challenges.&nbsp;Casper features an adaptable and modular architecture that allows it to continuously evolve. This makes Casper a future-proof blockchain network that is well-equipped to meet the challenges of the present and the future.</p><p>The Casper Association is a not-for-profit Swiss based organization that strives to promote the widespread adoption of blockchain technology by developing and implementing Casper.&nbsp;By seamlessly integrating with existing technology stacks, Casper empowers organizations of all sizes to unlock the full potential of blockchain and create solutions that effectively tackle real-world challenges.&nbsp;</p>ContactDirector of CommunicationsKelly ClarkValidation Cloudpress@validationcloud.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T14:43:52.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T14:56:58.000Z",
    "title": "South Korea to launch second phase of virtual asset legislation",
    "url": "https://crypto.news/south-korea-to-launch-second-phase-of-virtual-asset-legislation/",
    "description": "In a move aimed at further strengthening regulations and protecting users in the crypto market, South Korean financial authorities are reportedly gearing up to initiate a research project for the second phase of the country’s virtual asset legislation."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T14:50:06.000Z",
    "title": "From surveillance to empowerment: ethical web3 enthusiast advocates for privacy at ETHBarcelona",
    "url": "https://crypto.news/from-surveillance-to-empowerment-ethical-web3-enthusiast-advocates-for-privacy-at-ethbarcelona/",
    "description": "Mykola Siusko, ambassador manager at Nym Technologies SA and ethical web3 enthusiast, delivered a thought-provoking speech on the significance of privacy and its impact on society during the ETHBarcelona conference. With a focus on empowerment and connectivity, Siusko highlighted the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T15:00:06.000Z",
    "title": "Analyst Says XRP Will Reach $100, Here’s Why",
    "url": "https://www.newsbtc.com/analysis/xrp/analyst-says-xrp-will-reach-100-heres-why/",
    "description": "XRP, one of the prominent cryptocurrencies in the market, has witnessed a remarkable surge in its daily burn rate, sparking speculation about its potential to go on a bull rally. Crypto analyst and influencer 24HRSCRYPTO is one of those who have put forward an extremely optimistic outlook for the XRP cryptocurrency. The analyst says that the altcoin, which is currently trading below $1, will reach as high as $100, and has provided reasons. XRP&#8217;s Daily Burn Rate Surges, Fueling Speculation of $100 Token Value 24HRSCRYPTO unveiled an astonishing increase in XRP&#8217;s burn rate through a series of tweets that captivated the attention of the XRP community. Related Reading: Bitcoin Humpback Wallets Reach ATH, Is BlackRock Behind The Surge? The surge in XRP&#8217;s daily burn rate has been a topic of great interest within the crypto community. Just a month ago, the total supply of XRP stood at 99,988,863,851. However, it has now dropped to 99,988,616,835, indicating a reduction of 247,016 XRP.  🚨 THIS IS HUGE! MASSIVE SPIKE IN DAILY BURN RATE 🚨 30 days ago, #XRP&#8216;s total supply was 99,988,863,851 👉🏻today the total supply is 99,988,616,835 (247,016 XRP burned and gone forever in 30days) about 8,233 a day &#8211; which goes perfectly with the below 24HR burn rate. That number… https://t.co/OipXjajMnx — 𝟸𝟺𝙷𝚁𝚂𝙲𝚁𝚈𝙿𝚃𝙾 (@24hrscrypto1) July 4, 2023 With the total supply of XRP decreasing by 247,016 over the course of just 30 days, equivalent to an average of approximately 8,233 XRP burned per day, the stage is set for a potential upward trend that could lead to a significant appreciation in XRP&#8217;s value. In comparison to the figures observed in previous months, the recent 247,016 burned XRP represents a significant increase. This development has prompted crypto enthusiasts to question the potential for further growth and whether it could drive XRP&#8217;s value to unprecedented heights. The increased burn rate and the subsequent reduction in XRP&#8217;s supply have sparked a wave of excitement among investors. It suggests the possibility of a bullish trend, with the burn rate potentially rising even further as trillions of dollars flow into the crypto market. XRP price trending above $0.47 &#124; Source: XRPUSD on TradingView.com Senior Ripple Engineer Shares Insight A deeper dive into the factors driving the heightened burn rate reveals valuable insights as a Software engineer at Ripple, Neil Hartner, shed light on the situation, attributing the surge to the deletion of XRPL accounts as a deleted account equals two XRP burned. Hartner specifically highlighted Poloniex, a leading crypto exchange, which recently deleted a staggering 85,566 outdated XRPL accounts. This action alone contributed to the burning of 171,132 XRP. As the burn rate accelerates and the supply of XRP dwindles, the prospect of XRP reaching $100 per token gains traction.  While some skeptics may question the validity of such a bold claim, the consistent upward trend in the burn rate provides a compelling argument if it continues at such a scale.  Related Reading: Zilliqa (ZIL) Notches 10% In Anticipation Of Network Upgrade The continuous rise in the burn rate and the deletion of XRPL accounts by prominent exchanges reflect the evolving landscape of the crypto market. Investors and enthusiasts are closely monitoring these trends, eagerly anticipating the future value of XRP and the potential rewards it may bring. Amidst these developments, XRP&#8217;s current trading price stands at $0.4883, with a market valuation exceeding $25.5 billion.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T15:05:00.000Z",
    "title": "Crypto Validator Revives 5% Commission For LUNC on Classy’s Sphere",
    "url": "https://coinedition.com/crypto-validator-revives-5-commission-for-lunc-on-classys-sphere/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Validator Revives 5% Commission For LUNC on Classy’s Sphere\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, Twitter influencer and LUNC validator ClassyCrypto tweeted about Classy&#8217;s Crypto Sphere, a Proof-of-Stake infrastructure provider, making a transition back to a 5% commission on the Terra Classic token. Classy claimed that the LUNC community deserves its power back and the starting point would mean moving back to a minimum commission while pushing forward [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-validator-revives-5-commission-for-lunc-on-classys-sphere/\">Crypto Validator Revives 5% Commission For LUNC on Classy’s Sphere</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]