[
  {
    "source": "Decrypt",
    "date": "2024-01-04T22:54:44.000Z",
    "title": "Solana’s LFG Token Lures Ethereum Users, Plans Second Airdrop and Grants Program",
    "url": "https://decrypt.co/211778/solana-lfg-ethereum-users-second-airdrop-grants-program",
    "description": "Solana's “Less Fn Gas” airdropped LFG tokens to Ethereum users who spent over $4,269 in gas over the last year. It doesn't want to stop there."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T22:49:04.000Z",
    "title": " Ether ETF likely coming as SEC ‘implicitly’ nodded ETH as commodity: Analyst ",
    "url": "https://cointelegraph.com/news/spot-ethereum-etf-likely-debut-2024-sec-commodity-analyst",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMWJjY2MyMTMtZGZmNy00ZmMwLTg4ZGItOTFmNGVmNjQwZjQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to Bloomberg ETF analyst James Seyffart, the U.S. securities regulator implicitly accepted Ether as a commodity when it green-lit Ethereum futures ETFs.</p>\n                    <p><p>The United States securities regulator implicitly accepted Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) as a commodity when it approved Ethereum futures exchange-traded funds last year — meaning a spot ETF variant is likely set for this year, according to Bloomberg ETF analyst James Seyffart.</p><p>Speaking during CryptoQuant’s private webinar on Jan. 4, Seyffart alluded to the approval of Ethereum futures ETFs in October 2023, noting that the SEC did not challenge the token classification through the ETFs registration process with the Commodity Futures Trading Commission (CFTC). </p><p> Seyffart said the SEC likely had no bandwidth to dispute the token classification.</p><p><a href=\"https://cointelegraph.com/news/spot-ethereum-etf-likely-debut-2024-sec-commodity-analyst\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-04T22:54:19.000Z",
    "title": "Multiple spot Bitcoin ETFs will be approved, TechCrunch’s inside sources say",
    "url": "https://cryptoslate.com/multiple-spot-bitcoin-etfs-will-be-approved-techcrunchs-inside-sources-say/",
    "description": "<p>TechCrunch senior crypto reporter Jacquelyn Melinek claimed on Jan. 4 that regulators will approve more than one spot Bitcoin ETF at once. Melinek posted to Twitter/X: &#8220;[I  have] heard from sources extremely close to the matter that the bitcoin spot ETF is going to be approved by the SEC for multiple firms&#8217; applications.&#8221; Though simultaneous [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/multiple-spot-bitcoin-etfs-will-be-approved-techcrunchs-inside-sources-say/\">Multiple spot Bitcoin ETFs will be approved, TechCrunch&#8217;s inside sources say</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-04T23:00:17.000Z",
    "title": "SEC Meets With Major Exchanges to Discuss Spot Bitcoin ETFs — Analysts Expect Imminent Approval",
    "url": "https://news.bitcoin.com/sec-meets-with-major-exchanges-to-discuss-spot-bitcoin-etfs-analysts-expect-imminent-approval/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Meeting With Exchanges to Discuss Spot Bitcoin ETF Applications — Analysts Expect Imminent Approval\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-meeting-with-exchanges.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) has met with officials from major exchanges to discuss spot bitcoin exchange-traded funds (ETFs). Sources close to the proceedings say the securities regulator could begin notifying issuers of spot bitcoin ETF approval on Friday and trading could begin as early as next week. &#x201C;SEC is giving final comments [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T22:58:48.000Z",
    "title": "Bitcoin’s volatility can’t stop its climb as ETF decision nears",
    "url": "https://www.cryptopolitan.com/bitcoins-volatility-cant-stop-its-climb/",
    "description": "Despite a rollercoaster ride of ups and downs, Bitcoin has recently witnessed a resurgence, demonstrating its resilience in the face of volatility. The digital currency&#8217;s rebound, particularly after a significant drop on concerns about the approval of a bitcoin exchange-traded fund (ETF), paints a picture of an asset undeterred by market speculations and fears. Bitcoin&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T22:44:39.000Z",
    "title": "What Russia’s central bank tells us about the country’s economy",
    "url": "https://www.cryptopolitan.com/russia-central-bank-about-countrys-economy/",
    "description": "2024 marks a pivotal year for global finance, particularly regarding Russia&#8217;s central bank reserves. A striking development is the increasing likelihood that the western sanctioning coalition may seize these reserves, initially frozen during the onset of Vladimir Putin’s aggressive campaign in Ukraine. The notion is to redirect these funds to Ukraine, holding Moscow accountable for [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-04T22:45:00.000Z",
    "title": "Cardano Whales Indicate Bullish Momentum Amidst Crypto Boom",
    "url": "https://nulltx.com/cardano-whales-indicate-bullish-momentum-amidst-crypto-boom/",
    "description": "As the cryptocurrency space continues to thrive, all eyes are on the potential approval of a Bitcoin Spot Exchange-Traded Fund (ETF) by the US Securities and Exchange Commission (SEC). In the midst of this, Cardano (ADA) has emerged as a noteworthy player in 2024, showcasing significant market momentum through increased [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T23:00:40.000Z",
    "title": "Thorchain Dominates Cross-Chain Trading Volume: What’s Next for RUNE?",
    "url": "https://www.newsbtc.com/news/defi/thorchain-dominates-cross-chain-trading-volume/",
    "description": "Thorchain, a cross-chain liquidity network, has emerged as a frontrunner in cross-chain transfers, surpassing its competitors in volume and transaction activity, on-chain data shows.  Thorchain Trading Volume Expands As Prominence Increases Citing Galaxy Research data, a user on X, Bullion, noted that Thorchain processed $4.82 billion in cross-chain transactions over the past 30 days, while Cosmos&#8217; Inter-Blockchain Communication (IBC) protocol handled $3.35 billion worth of transactions during the same period. Among layer-2 bridges, Arbitrum Bridge led the pack with $1.21 billion in cross-chain volume. Others, like Polygon POS and Stargate, processed $564 million and $694 million, respectively. The spike in Thorchain&#8217;s trading volume and liquidity indicates the protocol&#8217;s increasing significance in the broader decentralized finance (DeFi) landscape. The protocol&#8217;s unique features and innovative solutions have made it a preferred destination for cross-chain asset transfers.  Related Reading: Crypto Analyst Predicts Cardano Price Jump In January – Here’s The Target At the heart of Thorchain is its ability to facilitate cross-chain asset swapping in a trustless and non-custodial manner. In this arrangement, and like popular decentralized exchanges like Uniswap, Thorchain allows users to retain control of their funds without depending on intermediaries.  The stream swaps technology seems to be drawing user attention to Thorchain. This feature allows users to swap with near-slippage free even without high liquidity. Technically, and as expected in decentralized exchanges, the lower the liquidity, the higher the slippage. The offer for low or zero slippage gives Thorchain a significant advantage over other cross-chain swaps. Beyond trading, Thorchain has incorporated other defi solutions, including lending. In this arrangement, Thorchain now supports the trustless lending of assets without liquidity risk or interest, a deviation from traditional lending protocols, including Aave.  As DeFi TVL Recovers, Will RUNE Break To New 2024 Highs? Together, these features have contributed to Thorchain&#8217;s growing trading volume, further cementing its position in the recovering DeFi scene. According to DeFiLlama, Thorchain has a total value locked (TVL) of around $322 million. Meanwhile, Thorchain claims to have over 91,000 swappers. Cumulatively, the protocol has processed over $61 billion in trading volume. As DeFi expands from 2022 pits, RUNE, the platform&#8217;s native token, has also benefited. Looking at the RUNE daily chart, it is up roughly 5X from 2023 lows. Related Reading: Shibarium Transactions Crash Almost 50%, Shiba Inu Price Wobbles Despite the re-pricing of asset prices on January 3, RUNE remains resilient. Prices are trending inside a bull flag. Any breakout above $6.5 and local resistances could catalyze demand, lifting the coin above $7.3 to new 2024 highs. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-04T23:01:29.000Z",
    "title": "XRP Lawyer Volunteers To Represent Retail Token Holders in Upcoming US Congress Hearing",
    "url": "https://dailyhodl.com/2024/01/04/xrp-lawyer-volunteers-to-represent-retail-token-holders-in-upcoming-us-congress-hearing/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/XRP-Lawsuit-Summary-Judgement.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A prominent crypto lawyer who helped Ripple Labs and XRP in the case against the U.S. Securities and Exchange Commission (SEC) is volunteering to represent US retail token holders during an upcoming Congressional hearing. Responding to an announcement made by the Financial Services GOP about the upcoming Capital Markets and Digital Assets, Financial Technology and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/04/xrp-lawyer-volunteers-to-represent-retail-token-holders-in-upcoming-us-congress-hearing/\">XRP Lawyer Volunteers To Represent Retail Token Holders in Upcoming US Congress Hearing</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]