[
  {
    "source": "Decrypt",
    "date": "2023-09-07T14:53:55.000Z",
    "title": "Who is Vitalik Buterin, Ethereum Creator?",
    "url": "https://decrypt.co/resources/who-is-vitalik-buterin-ethereum-creator",
    "description": "Buterin’s interest in broadening Bitcoin’s scope led him to pursue a Turing-complete programming language to realize his vision. The young programmer created an initial white paper for this concept, which he called Ethereum, in 2013."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T14:50:00.000Z",
    "title": "Polkadot 2.0 and the future of DOT, explained",
    "url": "https://cointelegraph.com/explained/polkadot-20-and-the-future-of-dot-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/0be602f405b71dd861adce3e1102cddb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Polkadot 2.0 will bring a range of new features and is set to change how the Polkadot network works.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-116117-0\">            <h2 data-ct-widget=\"explained-block-title\">                The future of DOT and Polkadot            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>The enhanced utility of the Polkadot network is expected to boost the value of DOT tokens if Polkadot 2.0 is well-received and gains traction.</em></p><p>That’s because projects will need DOT tokens to acquire coretime. Additionally, DOT — the native token of the Polkadot network and the primary token for settling network fees — could benefit from increased demand, subsequently driving up its value.</p><p>To benefit holders and boost DOT value, entities with surplus coretime may sell it. As a result, the secondary market value of DOT might grow. Additionally, decentralized finance services on Polkadot offer earning potential to DOT holders, which raises the token’s use, value and liquidity.</p><p>Moreover, revenue from coretime sales will be channeled into the Polkadot Treasury. DOT tokenholders decide how Treasury funds are distributed through OpenGov. Treasury spend is fluid, and tokens not assigned to projects bidding for funds are periodically burnt.  </p><p>The burning mechanism creates deflationary pressure on DOT, which is nominally an <a href=\"https://cointelegraph.com/explained/inflationary-vs-deflationary-cryptocurrencies-explained\">inflationary token</a>.This balances the overall circulating supply of the token, which could be something to take into account when considering the future value of DOT.</p><p>However, potentially more important aspects to consider in this regard are market dynamics, overall adoption and developments within the Polkadot network, such as the arrival of Polkadot 2.0.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116117-1\">            <h2 data-ct-widget=\"explained-block-title\">                About DOT Polkadot’s native token            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>DOT, Polkadot’s native token, fulfills three integral roles within the ecosystem, each contributing to the network’s functionality and growth.</em></p><p>The first role of the DOT token is governance. DOT holders can participate in network governance proposals, encompassing critical decisions such as network upgrades and fee adjustments. This participatory function is a cornerstone of Polkadot’s long-term viability. By enabling DOT holders to influence network operations, Polkadot fosters a transparent and democratic governance structure that ensures fairness.</p><p>DOT tokens also have a vital operational purpose by bolstering network security and transaction processing through the staking process. Nominators use some of their DOT holdings to select validators, who  are responsible for validating transactions and appending blocks to the blockchain. Their engagement in this process is rewarded with additional DOT tokens, incentivizing their contribution to the network’s operation. </p><p>This operational facet is essential for the day-to-day functioning of Polkadot, as DOT’s utilization ensures a secure and efficient platform for developers to construct their applications.</p><p>Lastly, DOT tokens are used in slot auctions. The current Polkadot blockspace auction model allows projects to obtain a parachain by bonding DOT tokens. The process is pretty straightforward: the project that pledges the highest number of DOT tokens in an auction obtains the parachain slot. Projects can bid for a slot using their own DOT holdings or through a crowd loan. A crowd loan allows projects to raise DOT from their communities and supporters to bid for a parachain slot.</p><p>The DOT tokens submitted as collateral during an auction are effectively tied up for the entire duration of the lease. Consequently, the project cannot utilize these DOT tokens for any other purpose during this timeframe.</p><p>Following the finalization of the auction, the winning project can link its parachain to the Polkadot Relay Chain. Subsequently, the parachain becomes operational and benefits from the Polkadot network security and scalability attributes. The slot durations are limited to two years.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116117-2\">            <h2 data-ct-widget=\"explained-block-title\">                The main components of the Polkadot network            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>The Polkadot network comprises three fundamental components that collectively form its intricate structure, including the Relay Chain, parachains and bridges.</em></p><p>The Relay Chain lies at the core of the Polkadot ecosystem, functioning as the primary blockchain of the network. It helps to safeguard overall network integrity and facilitate communication among parachains.</p><p>Parachains stand as parallel blockchains that represent the various Layer-1 projects building in the Polkadot ecosystem. They serve as hosts for decentralized applications and various blockchain-driven projects. The versatility of parachains lies in their adaptability to cater to the specific requirements of the hosted projects. </p><p>For instance, a parachain designated for a decentralized exchange could be configured to manage a high volume of transactions efficiently. Parachains such as the<a href=\"https://cointelegraph.com/news/astar-network-to-launch-smart-contracts-that-support-two-virtual-machines\"> Astar Network</a> also incorporate features such as <a href=\"https://cointelegraph.com/news/what-is-an-ethereum-virtual-machine-evm-and-how-does-it-work\">Ethereum Virtual Machine (EVM) compatibility</a>, WebAssembly (WASM)<a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\"> smart contracts</a> and cross-consensus messaging (XCM) to facilitate seamless communication between <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized applications (DApps)</a>.</p><p>On the other hand, bridges serve as vital conduits connecting the Polkadot network to other blockchain networks. The overarching goal of bridges is to enhance the interoperability of disparate blockchain networks so they can communicate and interact effectively.</p><p>To better illustrate how they work, consider the scenario where a developer seeks to construct an application harnessing data from two incompatible blockchains. Such an endeavor would be untenable without a bridge system, given the inherent incompatibility between them. In such a case, Polkadot acts as an enabler, facilitating communication and data sharing between the two disparate blockchains.</p><p>A real-world use case would involve a user aiming to transfer assets across different blockchains. Without a solution like the XCM messaging format, which allows blockchains to interact, such an operation would necessitate reliance on a centralized exchange. Networks like Polkadot allow users to migrate assets between blockchains directly, eliminating the need for third-party intermediaries. </p><p>Another unique property of the Polkadot network is that it operates as a layer-0 blockchain. A layer-0 blockchain serves as a foundational framework upon which subsequent blockchains can be constructed.</p><p>As a<a href=\"https://cointelegraph.com/learn/whats-the-difference-between-blockchain-layers-l0-and-l1\"> layer-0 blockchain</a>, it provides infrastructure that empowers programmers to fashion their own blockchains while ensuring cross-chain interoperability. As such, blockchains developed atop the Polkadot platform can seamlessly communicate and engage with one another, regardless of technological variations.</p><p>This is a substantial advantage over conventional blockchains, which frequently exist in isolated silos, incapable of mutual communication. It makes the Polkadot network ideal for crafting decentralized applications utilizing data from multiple blockchains.</p><p>As Polkadot is already established as the foundational layer, it alleviates many of the problems programmers face when working with rigid layer-1 chains by providing a more adaptable base infrastructure. Governance of the Polkadot network is carried out directly by holders of the DOT token, whereby token holders actively participate in a voting process to vote on all proposals aimed at making changes to the network. The democratic approach, launched earlier this year and known as OpenGov, grants every token holder a voice in shaping the platform’s evolution.</p><p>When it comes to transaction validation, Polkadot employs a nominated proof-of-stake (NPoS) mechanism to select its validator set, focusing on enhancing chain security. Validator nodes are responsible for block production, parachain block validation, and finality assurance, while nominators can support specific validators with their stake, backing trusted candidates with their tokens.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-116117-3\">            <h2 data-ct-widget=\"explained-block-title\">                What is Polkadot 2.0?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em><a href=\"https://cointelegraph.com/learn/what-is-polkadot-dot-a-beginners-guide-to-the-decentralized-web-3-0-blockchain\">The Polkadot network</a> has grown significantly over the past couple of years due to its unique utilitarian features. And now, a new vision for the network's future, which we can call Polkadot 2.0, has been laid out.</em></p><p>Initially announced in June 2023 by Polkadot founder Gavin Wood, the new network will change the way Polkadot assigns its resources. Speaking during the Polkadot Decoded 2023 event held in Copenhagen, Wood took the time to delve into the ideological concepts of the new system.</p><p>Wood <a href=\"https://polkadotters.medium.com/gavin-wood-unveils-the-next-era-of-polkadot-at-decoded-2023-transitioning-from-blockchain-to-4610774fd741\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">said</a> Polkadot 2.0 would use a new system for allocating blockspace. The system would be more flexible than the current lease model, allowing developers to buy blockspace as needed, either in bulk or on demand. This, according to the crypto network developer, would make it easier for new projects to enter the Polkadot ecosystem. He explained that the changes would also make Polkadot more attractive to Web2 businesses <a href=\"https://cointelegraph.com/explained/how-web3-resolves-fundamental-problems-in-web2\">adopting Web3 frameworks</a>.</p><p>The core concept driving the evolution of Polkadot 2.0 centers on the introduction of elastic cores, catering to adaptable computational capabilities. Presently, parachains function akin to fixed CPU cores within the Polkadot supercomputer. However, the upcoming system will allocate resources like Relay Chain security flexibly, responding to real-time needs. This innovation holds the promise of significantly enhancing efficiency throughout the ecosystem.</p><p>Another significant change in Polkadot 2.0 revolves around its strategy for coretime allocation. Coretime signifies the time needed for validation and consensus on the Polkadot Relay Chain. In the new version, coretime will be purchasable as block time. This will be<a href=\"https://polkaworld.medium.com/how-much-revenue-can-coretime-bring-to-polkadot-2-0-will-the-demand-for-dot-increase-53a19b93bfa2\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> achieved</a> using an auction and a pay-as-you-go model with a fixed price.</p><p><img alt=\"Changes in core assignment\" src=\"https://s3.cointelegraph.com/storage/uploads/view/04393811b699507c1dce8446a5fc4576.jpg\" title=\"Changes in core assignment\"></p><p>The table below highlights the transition from fixed slot leasing in Polkadot 1.0 to a more dynamic and tradable coretime asset in Polkadot 2.0, allowing for greater flexibility and customization in coretime allocation.</p><p><img alt=\"Coretime allocation in Polkadot 1.0 vs. Coretime allocation in Polkadot 2.0\" src=\"https://s3.cointelegraph.com/storage/uploads/view/1439137b9d0a39afa09962cc1eddd7c5.jpg\" title=\"Coretime allocation in Polkadot 1.0 vs. Coretime allocation in Polkadot 2.0\"></p><p>According to Wood, the design of the new system would be based on the emergent needs of developers to avoid future design problems. He also noted that the new system could increase the liquidity of<a href=\"https://cointelegraph.com/polkadot-price-index\"> Polkadot (DOT</a>) tokens by reducing token lockup periods.</p><p>Introducing the new model would be a significant milestone for Polkadot, marking a shift away from the<a href=\"https://cointelegraph.com/learn/what-are-parachains-polkadot-and-kusama-parachains\"> current parachains model</a> where blockspace is allocated primarily through an auction process and a fixed lease period. The new system is expected to make Polkadot more accessible and affordable for developers, fostering innovation in the Web3 ecosystem.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T14:47:30.000Z",
    "title": "Ripple CTO says 'tide is turning' on US regulatory environment ",
    "url": "https://cointelegraph.com/news/ripple-cto-says-tide-is-turning-on-us-regulatory-environment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/dcb1a735-091f-4be8-a9b9-878a6b401ee6.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>David Schwartz believes the U.S. legal system is looking more skeptically at SEC cases against various cryptocurrency industry participants. </p>\n                    <p><p>A court ruling that cleared Ripple's XRP token of being considered a security offering might signal a turn in the tide against regulatory scrutiny of the cryptocurrency ecosystem in the United States and current lawsuits involving the likes of Coinbase and Binance.US and pending ETF applications.</p><p>Speaking exclusively to Cointelegraph during the company’s annual Apex developer conference being hosted in Amsterdam, Netherlands, Ripple CTO David Schwartz weighed in on the potential precedent set by a federal judge ruling that XRP was not a security <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">when sold programmatically on cryptocurrency exchanges</a>. </p><p>Ripple has been entwined in a <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">protracted legal battle</a> with the U.S. Securities and Exchange Commission since 2020, but its recent part victory may have positive implications for a number of crypto-related lawsuits instituted by the SEC.</p><p>Schwartz admitted that the SEC case had cost Ripple business deals that had been on the table, but stressed that the bigger loss was felt in the community as ecosystem support felt stifled by the delisting of XRP across a number of prominent exchanges. This has since changed with the latest ruling in favour of XRP:</p><blockquote>“The ruling that we've had so far was sufficient to allow exchanges to relist XRP, and it was big, I think, for the entire ecosystem.”</blockquote><p>Schwartz said that the tide was perhaps turning in the United States, where crypto ecosystem participants began considering relocating to different jurisdictions in order to continue operating away from a cloud of regulatory uncertainty:</p><blockquote>“I feel bad that I have to tell people that the United States is probably not where they want to be, but the tide is turning. You know, the ruling in our suit that basically said that XRP is not inherently a security, that’s huge.”</blockquote><p>Schwartz said that the wider industry was now feeling the scrutiny that Ripple had first endured from the SEC in 2020, with the likes of major cryptocurrency blockchains like Solana, Cardano and Polygon seeing their respective tokens labeled alongside others as unregistered securities in the SEC’s lawsuits against Coinbase earlier in 2023.</p><blockquote>“They (SEC) can apply these very same arguments to whatever cryptocurrency you like or whatever business you like. Fortunately, people understand that argument a lot better now that they've seen the SEC go after Coinbase and others and some of the things they've done.”</blockquote><p>The Ripple CTO also believes that U.S. judges are looking more skeptically at cases brought forward by the SEC and that companies with the resources are taking a stand that will benefit the wider industry. </p><blockquote>“They're starting to get huge pushback from Coinbase and pushback on the ETFs. Hopefully that will prompt some changes at the legislature level, hopefully positive ones.”</blockquote><p>Ripple's Apex conference brings together developers building within the XRP Ledger blockchain ecosystem. The blockchain forms the backbone of RippleNet, the platform that manages Ripple's XRP payments system. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ripple-cto-says-tide-is-turning-on-us-regulatory-environment&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\">NFT collapse and monster egos feature in new Murakami exhibition</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T14:47:28.000Z",
    "title": "Former FTX exec is planning to plead guilty to criminal charges: Report",
    "url": "https://cointelegraph.com/news/ftx-exec-plead-guilty-criminal-charges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a4280489-0146-4375-8249-4e576048737f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Sept. 7 court appearance by Ryan Salame could see the former co-CEO of FTX Digital Markets plead guilty, following the examples of Caroline Ellison, Gary Wang, and Nishad Singh.</p>\n                    <p><p>Ryan Salame, the former co-CEO of FTX Digital Markets, is reportedly planning to plead guilty to criminal charges related to his alleged involvement in illicit activities at the failed cryptocurrency exchange.</p><p>According to a Sept. 7 Bloomberg report citing “people familiar with the case”, Salame <a href=\"https://news.bloomberglaw.com/business-and-practice/ex-ftx-executive-salame-to-plead-guilty-to-criminal-charges\" target=\"_blank\" rel=\"noopener nofollow\">plans</a> to plead guilty to a variety of charges during a scheduled court appearance. His guilty plea would make him one of many executives previously tied to FTX to do so since the exchange’s collapse in November 2022.</p><p> Former Alameda Research CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Caroline Ellison</a> and FTX co-founder Gary Wang pleaded guilty to federal fraud charges in December 2022. FTX’s former engineering director Nishad Singh <a href=\"https://cointelegraph.com/news/former-ftx-director-to-reportedly-plead-guilty-to-fraud-charges\">pleaded guilty to similar charges</a> in February 2023.</p><p>FTX Digital Markets was crypto exchange FTX’s affiliate in the Bahamas, where many of the executives including former CEO Sam Bankman-Fried were based prior to the company’s bankruptcy. Bankman-Fried has <a href=\"https://cointelegraph.com/news/sam-bankman-fried-superseding-indictment-includes-campaign-finance-allegations\">pleaded not guilty to 12 criminal charges</a>, which he will address in two trials scheduled to begin on Oct. 2, 2023 and March 11, 2024.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ftx-exec-plead-guilty-criminal-charges&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T14:45:23.000Z",
    "title": "Short-term holders bear the brunt of Bitcoin’s volatility",
    "url": "https://cryptoslate.com/short-term-holders-bear-the-brunt-of-bitcoins-volatility/",
    "description": "<p>Bitcoin&#8217;s drop from $29,000 in mid-August has significantly changed market dynamics. Despite the short-lived jump to $27,000 following the news about Grayscale&#8217;s win against the SEC, Bitcoin is still hovering around $25,700. A deeper dive into on-chain metrics reveals that this downward pressure primarily comes from short-term holders offloading their assets. One of the most [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/short-term-holders-bear-the-brunt-of-bitcoins-volatility/\">Short-term holders bear the brunt of Bitcoin’s volatility</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T15:00:12.000Z",
    "title": "COCOS Price Prediction for September: Experts Recommend Anarchy for Better Profit",
    "url": "https://www.crypto-news-flash.com/cocos-price-prediction-for-september-experts-recommend-anarchy-for-better-profit/?utm_source=rss&utm_medium=rss&utm_campaign=cocos-price-prediction-for-september-experts-recommend-anarchy-for-better-profit",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-21.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-21.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-21-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-21-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Every investor understands that the pursuit of profit is the heart and soul of their journey. However, it&#8217;s not just about making profits; it&#8217;s about making the most. While some may settle for little gains, astute investors weigh their options and go for one which offers the best possible returns on investment. Today, we’ll be [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T14:57:32.000Z",
    "title": "Crypto Analyst Spotlights Chainlink’s Potential Bullish Surge: Is it Time to Invest in LINK?",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-spotlights-chainlinks-potential-bullish-surge-is-it-time-to-invest-in-link/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-spotlights-chainlinks-potential-bullish-surge-is-it-time-to-invest-in-link",
    "description": "Chainlink (LINK) might be gearing up for a bullish breakout against Bitcoin (BTC), predicts Michaël van de Poppe. The market seemingly hasn&#8217;t recognized Chainlink’s potential since the Cross-Chain Interoperability Protocol (CCIP) introduction in July. Chainlink&#8217;s Undervalued Position in the Crypto Sphere One of the crypto world&#8217;s revered voices, Michaël van de Poppe, who commands the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T14:53:32.000Z",
    "title": "Stellar (XLM) Set to Unveil Major Announcement in 6 Days – Is It the Right Time to Accumulate for Potential Profits? Buy the Rumors and Sell the News? Get the Insights",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-set-to-unveil-major-announcement-in-6-days-is-it-the-right-time-to-accumulate-for-potential-profits-buy-the-rumors-and-sell-the-news-get-the-insights/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-set-to-unveil-major-announcement-in-6-days-is-it-the-right-time-to-accumulate-for-potential-profits-buy-the-rumors-and-sell-the-news-get-the-insights",
    "description": "<img width=\"1000\" height=\"733\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Stellar-Lumens-300x220.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Stellar-Lumens-768x563.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Stellar&#8217;s impressive rise past $0.12 distinguishes it among cryptocurrencies, and an intriguing announcement is on the horizon. Reddit users speculate about a potential rebrand, strategic moves with MoneyGram, or collaboration with India&#8217;s G20 summit. Stellar&#8217;s XLM has been making waves in the news due to its remarkable rise, confidently surpassing the $0.12 threshold in its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-07T15:03:00.000Z",
    "title": "Cardano’s Price Stuck As Bulls And Bears Battle For Control",
    "url": "https://coinedition.com/cardanos-price-stuck-as-bulls-and-bears-battle-for-control/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano’s Price Stuck As Bulls And Bears Battle For Control\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/CARDANO-16-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano’s (ADA) price has remained in a range between $0.24 and $0.28 over the past few days, suggesting a state of uncertainty with neither the bulls nor the bears taking clear control. At press time, the Ethereum-killer remained in its consolidation channel, trading at $0.257, according to CoinMarketCap. Following a 0.44% increase in ADA&#8217;s price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardanos-price-stuck-as-bulls-and-bears-battle-for-control/\">Cardano’s Price Stuck As Bulls And Bears Battle For Control</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]