[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T10:00:35.000Z",
    "title": "Apple Ventures into Generative AI: Negotiations Underway for News Archives Access",
    "url": "https://www.cryptopolitan.com/apple-into-generative-ai-negotiations/",
    "description": "In a recent development reported by The New York Times, technology giant Apple is making strides in the field of generative AI, aiming to secure access to major publishers&#8217; news archives for training purposes. Despite the notable absence of Apple in the generative AI arena, the company is reportedly in negotiations with key publishers and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T09:51:38.000Z",
    "title": "AI Image Dataset Controversy: Child Sexual Abuse Material Raises Alarms",
    "url": "https://www.cryptopolitan.com/ai-image-child-sexual-abuse-raises-alarms/",
    "description": "In a recent revelation, the Stanford Internet Observatory has uncovered a disconcerting reality within the realm of artificial intelligence (AI) development. The largest image dataset employed for training AI image generation models, LAION-5B, has been found to contain 3,226 images suspected to be child sexual abuse material (CSAM). This revelation has prompted LAION to swiftly [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-23T09:55:06.000Z",
    "title": "UN Embraces Blockchain: Utilizing ZK-Proofs and Decentralized IDs for Refugee Safety – IOTA Offers the Same Tech But Better",
    "url": "https://www.crypto-news-flash.com/un-embraces-blockchain-utilizing-zk-proofs-and-decentralized-ids-for-refugee-safety-iota-offers-the-same-tech-but-better/?utm_source=rss&utm_medium=rss&utm_campaign=un-embraces-blockchain-utilizing-zk-proofs-and-decentralized-ids-for-refugee-safety-iota-offers-the-same-tech-but-better",
    "description": "<img width=\"674\" height=\"432\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/IOTA.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/IOTA.png 674w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/IOTA-300x192.png 300w\" sizes=\"(max-width: 674px) 100vw, 674px\" />The UNHCR is actively exploring decentralized identity solutions, particularly zero-knowledge proofs (ZK-proofs), to ensure the safety of refugees crossing borders. The agency acknowledges the potential of blockchain technology and has already initiated a pilot project using USD Coin (USDC) stablecoin for swift financial assistance to Ukrainian refugees. The treasurer of a United Nations agency recently [...]"
  }
]