[
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T02:33:26.000Z",
    "title": "FTX hacker could be using SBF trial as a smokescreen: CertiK",
    "url": "https://cointelegraph.com/news/ftx-hacker-sam-bankman-fried-trial-obscure-funds-transfer-certik",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a5b8a068-08ee-4533-b47c-b4d6a4b3fdd5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The still-unidentified FTX hackers started ramping up their movement of stolen funds in recent weeks, potentially using media attention of the trial as a cover to hide the illicit activity.</p>\n                    <p><p>The hacker responsible for stealing over $400 million from FTX and FTX US in November could be using the hype around Sam Bankman-Fried’s fraud trial to further obfuscate the funds, says CertiK’s director of security operations Hugh Brooks.</p><p>Only days before the start of Bankman-Fried's criminal trial, the FTX hacker, known as “FTX Drainer,\" began <a href=\"https://cointelegraph.com/news/ftx-hacker-wallet-stirs-as-ethereum-etf-prepare-for-us-debut\">moving millions in Ether </a>it had gained from the November attack.</p><p>The movements have continued throughout the trial. In the last three days, the hacker <a href=\"https://etherscan.io/address/0x5ab55afcbFde83e0b3fBeff67Ed0dA73Ba7b629C\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> approximately 15,000 ETH (worth roughly $24 million) to three new wallet addresses.</p><p>“With the onset of the FTX trial and the substantial public attention and media coverage it is receiving, the individual accountable for draining the funds might be feeling an increased urgency to conceal the assets,” said Brooks.</p><blockquote>“It's also plausible that the FTX drainer harbored an assumption that the trial would monopolize so much attention from the Web3 industry that there would be insufficient bandwidth to trace all stolen funds while also covering the trial concurrently.”</blockquote><p>FTX, which had once been valued at $32 billion, declared bankruptcy on Nov. 11. That same day, employees at FTX began noticing massive withdrawals of funds from the exchange’s wallets. </p><p>An Oct. 9 <a href=\"https://www.wired.com/story/ftx-1-billion-crypto-heist/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Wired has provided fresh insight into how events transpired during the night of the attack. </p><p>After FTX employees realized that the attacker had complete access to a series of wallets, the team declared that \"the fox [was] in the hen house” and scrambled to keep the remaining funds out of the hacker’s hands.</p><p>The team reportedly made the decision to transfer a staggering amount of the remaining funds — between $400 and $500 million — to a privately owned Ledger cold wallet, while waiting to hear back from BitGo, the company tasked with taking custody of the exchange’s assets post-bankruptcy. </p><p>The move likely prevented the attacker from gaining a full $1 billion in the raid.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-hacker-wallet-stirs-as-ethereum-etf-prepare-for-us-debut\"><strong><em>FTX hacker’s wallet stirs as Ethereum ETFs prepare for US debut</em></strong></a></p><p>Meanwhile, Brooks explained that the hacker appears to have changed its method for obscuring funds.</p><p>On Nov. 21, the FTX hacker was observed attempting to launder funds by using a “peel chain” method, which involves sending decreasing amounts of funds to new wallets and “peeling” off smaller amounts to new wallets. </p><p>However, the hacker has recently been using a more sophisticated method to obscure the transfer of the illicit assets, said Brooks. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/293b3897-050f-4103-9835-e27b83483be5.png\"  /><figcaption style=\"text-align: center;\"><em>The new laundering method being employed by the FTX hacker as recorded on Oct. 2. Source: CertiK</em></figcaption></figure><p>The funds stored in the original Bitcoin wallet are distributed through multiple wallets, transferring smaller divisions of funds to a series of additional wallets, a tactic that “considerably prolongs” the tracing process. </p><p>Brooks said they have yet to identify any individuals or groups that could be behind the FTX hack, and that investigations are continuing.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-10T02:30:13.000Z",
    "title": "Analyst Warns of US Dollar Collapse, Predicts Bitcoin Owners to Benefit",
    "url": "https://news.bitcoin.com/analyst-warns-of-us-dollar-collapse-predicts-bitcoin-owners-to-benefit/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Analyst Warns of US Dollar Collapse, Predicts Bitcoin Owners to Benefit\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/chris-wood-dollar-collapsing.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Global financial services firm Jefferies has warned of &#x201C;the collapse of the U.S.-dollar paper standard to the benefit of both gold bullion owners and also owners of bitcoin.&#x201D; He explained that the Federal Reserve, and other G7 central banks, &#x201C;will not be able to exit from unconventional monetary policy in a benign manner and will [&#8230;]"
  }
]