[
  {
    "source": "CoinDesk",
    "date": "2024-03-18T21:59:49.000Z",
    "title": "Fidelity Adds Staking to Ether ETF Application, Sending LIDO Up 9%",
    "url": "https://www.coindesk.com/business/2024/03/18/fidelity-adds-staking-to-ether-etf-application-sending-lido-up-9/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Money management giant Fidelity wants to allow traders of its potential ethereum fund to be able to stake some of the assets, it wrote in an amendment with the U.S. Securities and Exchange Commission (SEC)."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-18T21:50:38.000Z",
    "title": "Crypto Firm Bakkt Shakes Up Leadership, Names Board Member Andy Main New CEO",
    "url": "https://www.coindesk.com/business/2024/03/18/crypto-firm-bakkt-shakes-up-leadership-names-board-member-andy-main-new-ceo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The current CEO Michael will step down “to pursue other opportunities.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-18T21:51:21.000Z",
    "title": " SEC hit with sanctions for its &#039;gross abuse of power&#039; in Debt Box case ",
    "url": "https://cointelegraph.com/news/sec-s-conduct-in-debtbox-case-constituted-a-gross-abuse-of-power",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTNiN2JjOGItMGNiMy00M2ZmLWE3NzMtOTdkNmRkMTM0YmM2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC initially conceded it misled the court but argued a sanction wasn't appropriate.</p>\n                    <p><p>A United States district court has imposed sanctions on the Securities and Exchange Commission (SEC) for acting in \"bad faith\" in a lawsuit it brought against Debt Box.</p><p>The SEC initially filed a motion to dismiss without prejudice but that was <a href=\"https://assets.ctfassets.net/c5bd0wqjc7v0/1u6cDaFa3REg8wHUc6onZ8/e1257f64a80ca440d887f67821f872fe/Debt_Box_Order.pdf\" target=\"_blank\" rel=\"noopener nofollow\">denied</a> by Judge Robert J. Shelby in a March 18 filing.</p><p>\"The operation of the American judicial system rests on the fundamental proposition that every party who comes before the court is bound by and adheres to the same set of rules,\" Shelby added.</p><p><a href=\"https://cointelegraph.com/news/sec-s-conduct-in-debtbox-case-constituted-a-gross-abuse-of-power\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-18T22:08:49.000Z",
    "title": "Is Ethereum’s price headed to $5k after Dencun upgrade?",
    "url": "https://cryptodaily.co.uk/2024/03/is-ethereums-price-headed-to-5k-after-dencun-upgrade",
    "description": "Ethereum’s buy/sell ratio has seen a shift towards the negative as Ethereum's price soared past the $4,000 mark in the early days of March, hitting a 40-day low at 0.93% on March 14, just a day after the Dencun upgrade was implemented."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T22:00:14.000Z",
    "title": "Bitcoin Whales Enter Full Accumulation Mode: Here’s How Much BTC They Pulled From Exchanges",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-whales-btc-exchanges/",
    "description": "The Bitcoin price movement last week revealed a series of ups and downs, from starting the week at a new all-time high of  $73,780 to crashing 12% in the days after to reach below $65,000. Crypto data analysts have spotted massive amounts of Bitcoin being withdrawn from major exchanges during the period of uncertainty, indicating that large investors anticipate further price appreciation.  According to a social media post by crypto analyst Ali Martinez, the total BTC balance on crypto exchanges fell by over 21,400 in the past week, with the creation of 13 new whales, each holding over 1,000 BTC. BTC Withdrawal From Exchanges Bitcoin crossed over $73,700 last week to register a new all-time high but has struggled to gain a footing above the price level. Interestingly, it would seem the new all-time high sparked a wave of profit-taking from some investors. However, on-chain and exchange data indicate Bitcoin is still undergoing a bullish sentiment from some investors, particularly large investors.  Related Reading: XRP Records Massive 80% Surge In Trading Volume – Can Price Reach A New ATH? Crypto analyst Ali Martinez noted this bull accumulation pattern in a post on his social media platform X. According to a Glassnode chart shared by the analyst, the total amount of BTC on exchanges has been on a free-fall since the middle of January. Notably, the total BTC balance saw a brief increase in the first few days of March before resuming a free-fall on March 5. In the past week alone, 21,401 BTC were moved off crypto exchanges.  As the #Bitcoin bull run momentarily pauses, it&#8217;s noteworthy that 21,401 #BTC have been moved off crypto exchanges over the past week, and the network has welcomed 13 new whales, each holding over 1,000 $BTC. pic.twitter.com/oSXaKBR4Z1 — Ali (@ali_charts) March 16, 2024 Similarly, the crypto analytics platform IntoTheBlock noted this outflow pattern during the week. According to ITB, BTC withdrawal from crypto exchanges reached its highest point this year on March 15. Interestingly, $750 million worth of Bitcoin was withdrawn on this day, the highest since May 2023. Over $750m $BTC was withdrawn from exchanges yesterday, the highest since May 2023. The majority of these withdrawals originate from Bitfinex ($524m) and Kraken ($130m) pic.twitter.com/8d3eIJROhv — IntoTheBlock (@intotheblock) March 15, 2024 What Does This Mean For Bitcoin? The Bitcoin ecosystem has witnessed serious money on the move since the beginning of the year, leading to a strong price surge for the cryptocurrency. However, this rally has since slowed down to spark a price correction, with market sentiment reaching the most negative sentiment toward BTC since December 2023. Bitcoin is currently trading at $68,201, down by 3.44% in the past seven days.  Related Reading: Crypto Pundit Says God Candle Is Imminent For This Solana-Based Meme Coin After such a strong surge in price, it’s normal for the momentum to slow down as the market consolidates and decides on the next move. While momentum has slowed, the overall trend for Bitcoin remains bullish. Judging by the massive amounts of Bitcoin pulled from exchanges recently, it looks like whales are gearing up for a continued rally. Bitcoin is now showing signs of a rally, and is now up by 5% in the past 24 hours.  BTC price crashes as trading week opens &#124; Source: BTCUSD on Tradingview.com Featured image from Business Today, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-18T22:01:35.000Z",
    "title": "IMF Demands $3,000,000,000 Bailout Debt From Pakistan Through New Crypto Taxes: Report",
    "url": "https://dailyhodl.com/2024/03/18/imf-demands-3000000000-debt-from-pakistan-through-new-crypto-taxes-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/imf-say-complete-bans.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The International Monetary Fund (IMF) is reportedly recommending the Pakistan Federal Board of Revenue (FBR) expand the scope of their gains taxes to include crypto. According to a report from the Pakistani news outlet The News, the IMF is asking the FBR to bring crypto gains into the country&#8217;s tax net. The IMF is asking Pakistan&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/18/imf-demands-3000000000-debt-from-pakistan-through-new-crypto-taxes-report/\">IMF Demands $3,000,000,000 Bailout Debt From Pakistan Through New Crypto Taxes: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]