[
  {
    "source": "NewsBTC",
    "date": "2023-08-31T02:00:34.000Z",
    "title": "XRP Lawyer Reacts: Grayscale’s Triumph Paves Way For Bitcoin’s Next Big Thing",
    "url": "https://www.newsbtc.com/bitcoin-news/xrp-lawyer-reacts-grayscales-triumph-paves-way-for-bitcoins-next-big-thing/",
    "description": "The crypto industry echoed the news of Grayscale Investments&#8217; groundbreaking victory over the United States Securities and Exchange Commission (SEC) yesterday. This landmark lawsuit has established intriguing possibilities concerning approving a much-anticipated spot Bitcoin ETF product. A Win Bigger Than Just Approval? John Deaton, the renowned lawyer representing XRP holders, is among the voices adding to this discussion. As the industry ponders the ramifications of Grayscale&#8217;s lawsuit triumph, Deaton provides insights into the prospects and timeline of the highly anticipated Bitcoin ETF. Related Reading: Renowned Economist Explains Why Grayscale’s Win Is Not Good For Bitcoin Price Deaton&#8217;s commentary arrives hot on the heels of a Bloomberg report. The report underlined that even if the lawsuit&#8217;s outcome doesn&#8217;t lead directly to the greenlighting of a spot Bitcoin ETF, the very nature of this win holds substantial implications for the overarching crypto environment. The victory, according to the report, particularly stands as a testament to BTC, its miners, Coinbase, and the entirety of the cryptocurrency domain, the XRP lawyer added: It’s a massive win for #Bitcoin , BTC miners, @coinbase, and the Crypto industry in general. Does it mean the @Grayscale Spot ETF, along with the others, will be granted immediately? No. But a spot ETF is happening. The relevant question is whether it will in 2023? https://t.co/uUZUJ94dHz — John E Deaton (@JohnEDeaton1) August 29, 2023 The Bitcoin ETF Timeline While the hope surrounding the Bitcoin ETF&#8217;s approval is palpable, the attorney provides a reality check to the community. Grayscale&#8217;s aspirations for the BTC ETF remain high, but immediate approval seems unlikely. Contrary to the gist of the Bloomberg news report, Deaton is confident about the eventual establishment of a spot Bitcoin ETF. Yet, the timeline remains uncertain. On August 29, Judge Rao of the Columbia Circuit approved Greyscale&#8217;s petition to transform their financial product into a Bitcoin Exchange Traded Fund (ETF). This marked a significant victory for Greyscale in its legal battle against the US SEC, which had previously denied the firm&#8217;s application to convert its Grayscale Bitcoin Trust (GBTC) into an ETF on June 29, 2022. Related Reading: Bitcoin Insider Trading Suspicions Take Root Following Grayscale Win, What’s Happening? The court filing by the US District of Columbia Circuit noted: The denial of Grayscale’s proposal was arbitrary and capricious because the Commission failed to explain its different treatment of similar products. We therefore grant Grayscale’s petition and vacate the order. Grayscale&#8217;s CEO, Michael Sonnenshein, quickly took to his X account (formerly known as Twitter) to celebrate the decision. He expressed gratitude to the community and concluded by updating that the firm&#8217;s legal team is actively reviewing the Court&#8217;s opinion to asses the next steps.  🚨 JUST IN 🚨 The D.C. Circuit ruled in favor of @Grayscale in our lawsuit challenging the SEC&#8217;s decision to deny $GBTC&#8216;s conversion to an ETF! Thank you to everyone who has been on this journey with us, especially our investors. We are grateful for your support and… — Sonnenshein (@Sonnenshein) August 29, 2023 Featured image from iStock, Chart from TradingView"
  }
]