[
  {
    "source": "Decrypt",
    "date": "2023-08-10T19:31:12.000Z",
    "title": "AI Is Literally Trying to Kill You With This Grocery Store App",
    "url": "https://decrypt.co/152060/ai-is-literally-trying-to-kill-you-with-this-grocery-store-app",
    "description": "Trying to use up leftovers? An AI-powered app produced ghastly results when users input things like \"turpentine\" and \"ant-poison.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T19:15:00.000Z",
    "title": "Digital Currency Group files motion to dismiss Gemini lawsuit, claiming it's a PR campaign",
    "url": "https://cointelegraph.com/news/digital-currency-group-files-motion-dismiss-gemini-lawsuit-claiming-public-relations-campaign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/7a087f7f-946c-4bcc-9f2e-a34775ab8c45.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gemini’s complaint filed in July alleged DCG and Barry Silbert had made \"false, misleading, and incomplete representations and omissions\" related to Genesis and the Earn program.</p>\n                    <p><p>Venture capital firm Digital Currency Group (DCG) has filed a motion to dismiss a lawsuit brought by cryptocurrency exchange Gemini which alleged fraud related to its Earn program.</p><p>In an Aug. 10 filing with United States District Court for the Southern District of New York, lawyers for DCG and its CEO Barry Silbert <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.603648/gov.uscourts.nysd.603648.17.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> Gemini’s lawsuit filed in July was a “continuation of [a] public relations campaign” targeting the firm on social media with “personal, vicious, and false” claims. The filing echoed Gemini’s complaint, in which the crypto exchange said it sought to recover funds incurred as a result of “DCG’s and Silbert’s false, misleading, and incomplete representations and omissions to Gemini” and their role “in encouraging and facilitating Genesis’s fraud against Gemini”.</p><p>Genesis, a DCG subsidiary, had been the crypto lender responsible for operating an Earn program launched in 2021 in partnership with Gemini. The program claimed Gemini users could loan crypto to Genesis with the promise the firm would repay it with interest. However, the <a href=\"https://cointelegraph.com/news/breaking-crypto-lender-genesis-global-halts-withdrawals\">firm halted withdrawals</a> in November 2022 citing “unprecedented market turmoil” and filed for Chapter 11 bankruptcy in January 2023.</p><p>According to the DCG filing, Silbert and the firm “had virtually nothing to do with the Gemini Earn program” and Gemini could largely not back up its claims of fraudulent activity:</p><blockquote>\"The Complaint is a hodgepodge of conclusory allegations against non-defendant Genesis, all belied by the fact that Gemini has not filed these spectacular claims in the Genesis bankruptcy.\"</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gemini-launches-ethereum-staking-in-the-uk\"><strong><em>Winklevoss twins’ Gemini launches Ethereum staking in the UK</em></strong></a></p><p>The collapse of Three Arrows Capital in 2022 reportedly left Genesis with $1.2 billion in funds in limbo amid bankruptcy proceedings. Cameron and Tyler Winklevoss, the co-founders of Gemini, have claimed that Genesis and DCG owed $900 million to the exchange’s clients. </p><p>Both Gemini and Genesis are <a href=\"https://cointelegraph.com/news/gemini-files-to-dismiss-sec-s-lawsuit-over-its-earn-product\">facing a civil suit</a> from the U.S. Securities and Exchange Commission brought in January over its Earn program. The regulator claims the program offered the sale of unregistered securities. New York State’s Department of Financial Services is also <a href=\"https://cointelegraph.com/news/new-york-financial-regulator-investigates-gemini-over-fdic-claims-report\">reportedly investigating the exchange</a> over similar allegations.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blackrock-bullish-on-bitcoin-gemini-ceos-delusion-and-cexs-unhappy-staff-hodlers-digest-july-2-8/\"><strong><em>BlackRock bullish on Bitcoin, Gemini CEO’s ‘delusion,’ and CEXs’ unhappy staff: Hodler’s Digest, July 2-8</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-10T19:31:00.000Z",
    "title": "Cardano’s DeFi Ecosystem Hits New Milestone with Over 600 Million $ADA Locked",
    "url": "https://www.cryptoglobe.com/latest/2023/08/cardanos-defi-ecosystem-hits-new-milestone-with-over-600-million-ada-locked/",
    "description": "The total value locked on Cardano’s decentralized finance (DeFi) ecosystem has recently reached a new milestone above the 600 million $ADA mark, with the amount of the network’s native tokens locked on DeFi applications having tripled since the beginning of the year. According to data from DeFi tracking and analytics service DeFiLlama, the total value locked […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T19:30:00.000Z",
    "title": "Fed Reveals New Rules for Dealing with Stablecoins in the US",
    "url": "https://cryptodaily.co.uk/2023/08/fed-reveals-new-rules-for-dealing-with-stablecoins-in-the-us",
    "description": "<p>The Federal Reserve of the U.S. issued new guidelines regarding the use of stablecoins and other digital assets by the national banks.</p>\nFed Tightens the Regulation of Stablecoins\n<p>Just a day after PayPal had announced the launch of its U.S. dollar-pegged stablecoin PYUSD, the Federal Reserve of the U.S. published new guidelines clarifying the ways state member banks can interact with dollar-denominated digital currencies.</p>\n<p>Basically, national banks are now required to seek permission of the Federal Reserve to engage in any sorts of activities related to the U.S. dollar-pegged digital assets, referred to as &ldquo;dollar tokens&rdquo;.&nbsp;</p>\n<p>According to the statement, state member banks need to notify the Federal Reserve about the activities they mean to perform with the use of dollar tokens, whether it is issuing, holding, transacting, or even testing digital assets. The Federal Reserve might ask for additional information regarding the proposed activity. To proceed with the use of stablecoins in any way, the bank needs to receive a &ldquo;a written notification of supervisory nonobjection from the Federal Reserve&rdquo;.</p>\n\n<p>&ldquo;A state member bank seeking to engage in such dollar token activities, including for the purpose of testing, must notify its lead supervisory point of contact at the Federal Reserve of the bank&rsquo;s intention to engage in the proposed activity and should include a description of the proposed activity. Federal Reserve supervisory staff may follow up with the bank to seek additional information in order to better understand the proposal and the control framework that the state member bank has put in place. After receiving a written notification of supervisory nonobjection, state member banks will continue to be subject to supervisory review and heightened monitoring of these activities,&rdquo; reads the statement.</p>\n\nMitigating Risks Related to the Use of &ldquo;Dollar Tokens&rdquo;\n<p>To acquire the notification of nonobjection from the Federal Reserve, the bank needs to showcase an effective system of risk management and the ability to measure and control the risks of the proposed stablecoin activities on a regular basis.&nbsp;</p>\n<p>The Federal Reserve outlines five major types of risks linked to the use of dollar tokens:</p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">operational risks: associated with the governance and the management of the network;</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">cybersecurity risks: related to the stablecoin&rsquo;s network, smart contracts, and any use of open source code;</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">liquidity risks, such as high redemptions of the token in a short period of time;</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">illicit finance risks: customer identity verification, due diligence, monitoring suspicious activities, etc;</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">consumer compliance risks: related to identifying and ensuring compliance.</li>\n</ul>\n<p>The Federal Reserve has also reported that it would evaluate the banks&rsquo; comprehension of the relevant laws and their commitment to them.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-10T19:30:31.000Z",
    "title": "Bitcoin Mining Council Reveals Sustainable Growth: New Survey Sheds Light on Industry’s Power and Efficiency",
    "url": "https://news.bitcoin.com/bitcoin-mining-council-reveals-sustainable-growth-new-survey-sheds-light-on-industrys-power-and-efficiency/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Mining Council Reveals Sustainable Growth: New Survey Sheds Light on Industry&#039;s Power and Efficiency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hg6799000.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent report, the Bitcoin Mining Council (BMC) unveiled the results of its first half of 2023 survey, highlighting the industry&#x2019;s strides in electricity consumption, technological efficiency, and sustainable power. Furthermore, the survey details that the BMC accounts for 43.4% of the global mining network. Insights From the Bitcoin Mining Council&#x2019;s Latest Survey The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T19:38:57.000Z",
    "title": "UK Announces Leaders for Upcoming AI Safety Summit",
    "url": "https://www.cryptopolitan.com/uk-announces-leaders-for-upcoming-ai-safety-summit/",
    "description": "London, UK &#8211; The UK government has unveiled the key figures who will spearhead the much-anticipated AI Safety Summit this autumn. Matt Clifford, CEO of Entrepreneur First, and Jonathan Black, Heywood Fellow at the Blavatnik School of Government, have been entrusted with the responsibility of leading the event. A meeting of minds on AI safety ... <a title=\"UK Announces Leaders for Upcoming AI Safety Summit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-announces-leaders-for-upcoming-ai-safety-summit/\" aria-label=\"More on UK Announces Leaders for Upcoming AI Safety Summit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T19:16:42.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T19:12:56.000Z",
    "title": "The Rise of Large Language Models (LLMs) in Enterprise Analytics",
    "url": "https://www.cryptopolitan.com/the-rise-of-llms-in-enterprise-analytics/",
    "description": "The digital realm is witnessing a transformative phase with the introduction of Large Language Models (LLMs) like ChatGPT. Since its inception in 2022, ChatGPT&#8217;s meteoric rise, amassing 100 million active monthly users in just two months, is a clear indication of its groundbreaking capabilities. While LLMs have found applications in diverse sectors, from chatbots to ... <a title=\"The Rise of Large Language Models (LLMs) in Enterprise Analytics\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-rise-of-llms-in-enterprise-analytics/\" aria-label=\"More on The Rise of Large Language Models (LLMs) in Enterprise Analytics\">Read more</a>"
  }
]