[
  {
    "source": "Decrypt",
    "date": "2024-02-15T00:55:23.000Z",
    "title": "Ethereum and Solana Post Big Gains, Following Bitcoin Bullishness",
    "url": "https://decrypt.co/217607/ethereum-solana-gains-follow-bullish-bitcoin-signals",
    "description": "Market indicators are all green, but there are reasons to be bullish beyond how they mirror what Bitcoin does."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T01:00:00.000Z",
    "title": "This Competitor to Shiba Inu (SHIB), Currently Valued at $0.01, Could Turn Your $100 Investment into $10,000 by 2024",
    "url": "https://www.cryptopolitan.com/this-competitor-to-shiba-inu-shib-currently-valued-at-0-01-could-turn-your-100-investment-into-10000-by-2024/",
    "description": "In the rapidly evolving world of cryptocurrency, a new challenger to Shiba Inu (SHIB) has emerged, capturing the attention of investors and enthusiasts alike. With its current valuation at a mere $0.01, this contender is not just another digital currency in the crowded market. It stands out with a promise of significant returns, suggesting that [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T01:00:52.000Z",
    "title": "Litecoin Whale Deposits Big To Binance, LTC’s 3% Drop To Extend?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-whale-big-binance-ltcs-3-drop-extend/",
    "description": "On-chain data shows a Litecoin whale has made a large deposit to cryptocurrency exchange Binance, which could add to the coin&#8217;s decline. Litecoin Whale Has Transferred 100,000 LTC To Binance Today According to data from the cryptocurrency transaction tracker service Whale Alert, a large transfer has been spotted on the Litecoin network during the past day. This transaction involved the movement of 100,000 LTC across the blockchain, worth more than 7 million US Dollars at the time of the move. Since the transfer scale is so large, a whale entity was likely behind it. Related Reading: Extreme Greed Is Back For Bitcoin, Is It Time To Sell? Generally, the transfers of whales can be something worth watching out for, as they may end up causing ripples in the market. How a move from such a humongous holder would affect the asset, though, depends on the intent behind it. Here are some additional details regarding the latest Litecoin whale transfer that may provide a hint about why the investor made the move: Looks like the transaction only required a negligible fee of 0.008 LTC ($0.56) to be possible &#124; Source: Whale Alert As displayed above, the whale transferred 100,000 LTC to wallets associated with the cryptocurrency exchange Binance in this move. The sending addresses were all unknown wallets that were unattached to any centralized platforms. Such wallets are usually the investors&#8217; addresses. Transactions like this, where coins move from self-custodial wallets towards exchanges, are called &#8220;exchange inflows.&#8221; The latest exchange inflow from the Whale suggests that the investor wanted to use one of the platform&#8217;s services, which can include selling. As such, the transfer can be bad news for Litecoin. LTC Has Gone Down 3% In Past 24 Hours Despite Market Surge While most cryptocurrency sectors have enjoyed profits during the last day, Litecoin has been the odd one as it has registered negative returns. As the chart below displays, LTC plunged from above the $73 level to the $68 mark during its latest drop. The value of the asset seems to have gone through a rollercoaster in the last two days &#124; Source: LTCUSD on TradingView Litecoin has registered a bit of a rebound since its low, though, as it has returned above $70. Despite this increase, however, the coin has still been down around 3% in the past 24 hours. Given the timing of the Binance inflow transaction made by the whale, it&#8217;s possible the move was for selling after all, as it coincided with this rebound in the cryptocurrency. Related Reading: CryptoQuant Founder Puts $112,000 Target For Bitcoin This Year The whale may be using this small surge to exit from the asset, potentially for moving into the greener pastures the rest of the market seems to be providing. Regarding the market cap, Litecoin has fallen to just the 20th spot on the top cryptocurrencies list, meaning there are nineteen larger digital assets than it currently. There is still some gap between LTC and 21st-placed Uniswap (UNI), so the coin may not be at risk of slipping further, at least for now. The market cap of the asset appears to be $5.2 billion at the moment &#124; Source: CoinMarketCap Featured image from Thomas Lipke on Unsplash.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-15T01:00:42.000Z",
    "title": "Trader Predicts Big Surge for Bitcoin Ecosystem Altcoin and Two Additional Crypto Assets – Here Are His Targets",
    "url": "https://dailyhodl.com/2024/02/14/trader-predicts-big-surge-for-bitcoin-ecosystem-altcoin-and-two-additional-crypto-assets-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/trader-surge-two.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader believes that a trio of altcoins are gearing up for big moves to the upside. Pseudonymous analyst Kaleo tells his 620,300 followers on the social media platform X that he&#8217;s bullish on the native asset of ORDI (ORDI), a crypto project that aims to bring non-fungible token (NFT) capabilities to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/14/trader-predicts-big-surge-for-bitcoin-ecosystem-altcoin-and-two-additional-crypto-assets-here-are-his-targets/\">Trader Predicts Big Surge for Bitcoin Ecosystem Altcoin and Two Additional Crypto Assets – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]