[
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T20:40:04.000Z",
    "title": "Bitcoin holds $30K as bulls flaunt their advantage in Friday’s $715M BTC options expiry ",
    "url": "https://cointelegraph.com/news/bitcoin-holds-30k-as-bulls-flaunt-their-advantage-in-fridays-btc-options-expiry",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/af163938-8165-4506-a4f5-2a42ab51b994.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>News of regulatory enforcement against the crypto sector fell to the wayside as Bitcoin price rallied above $30,000, and options data suggests the trend will continue.</p>\n                    <p><p>Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) 15% rally toward $30,300 between June 19 and June 21 caught most traders by surprise, triggering $125 million in liquidations of leveraged short futures contracts. Narrowing down the trigger for the rally is complicated, but some analysts point to the potential inflow of institutional investors if Blackrock’s <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco/amp\">exchange-traded fund (ETF) application</a> gets regulatory approval.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BlackRock just filed with the SEC to create a spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF.<br><br>Given their reputation, this has the highest likelihood of happening out of all the attempts at a spot ETF so far.<br><br>The institutional liquidity floodgates may finally open  <a href=\"https://t.co/c9g2Ten1h8\">https://t.co/c9g2Ten1h8</a> <a href=\"https://t.co/L2NmXq11gL\">pic.twitter.com/L2NmXq11gL</a></p>— Joe Consorti ⚡ (@JoeConsorti) <a href=\"https://twitter.com/JoeConsorti/status/1669451164167938050?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>ARK Invest CEO and chief investment officer Cathie Wood explained the rationale for the <a href=\"https://cointelegraph.com/news/why-cathie-wood-is-bullish-on-coinbase-stock-and-believes-bitcoin-will-reach-1-million\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-cathie-wood-is-bullish-on-coinbase-stock-and-believes-bitcoin-will-reach-1-million/amp\">firm’s bullishness on Bitcoin price</a>, more specifically their $1 million target. According to Wood, even in a deflationary environment, Bitcoin can still outperform by offering a solution to the traditional financial system’s counterparty risk.</p><p>Furthermore, the negative regulatory pressure eased on June 16 after Binance exchange was able to<a href=\"https://cointelegraph.com/news/sec-and-binance-us-strike-deal-on-asset-access\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-and-binance-us-strike-deal-on-asset-access/amp\"> strike a temporary agreement</a> with the U.S. Securities and Exchange Commission (SEC) to avoid a potential asset freeze. The event further cemented Bitcoin bears’ opportunity to profit on the $715 million weekly BTC options expiry.</p><h2>Bears made a mistake when BTC price dropped below $25,000</h2><p>Bitcoin’s price dropped below $26,300 on June 10, fueling bearish bets by traders using option contracts. Such a level was only recouped on June 16, which explains why bears have concentrated their bets on Bitcoin prices trading below $27,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a47c6fb7-1fa7-4fcc-aeeb-05d19f813617.png\"><figcaption style=\"text-align: center;\"><em>Deribit </em><em>Bitcoin options aggregate open interest for June 23. Source: Deribit</em></figcaption></figure><p>The 0.82 put-to-call ratio reflects the difference in open interest between the $415 million call (buy) options and the $300 million put (sell) options. However, the outcome will be lower as bears were caught by surprise as Bitcoin gained 10% in two days.</p><p>For instance, if Bitcoin's price remains near $29,800 at 8:00 a.m. UTC on June 23, there will be only $5 million in put options. This distinction arises since the right to sell Bitcoin at $28,000 or $29,000 is rendered void if BTC trades above that on the expiry.</p><h2>Bulls are in a good position to capture a $250 million profit</h2><p>Below are the four most likely scenarios based on the current price action. The number of options contracts available on June 23 for call (buy) and put (sell) instruments varies depending on the expiration price. The imbalance favoring each side constitutes the theoretical profit:</p><ul><li><strong>Between $27,000 and $28,000:</strong> 3,500 calls vs. 1,200 puts. The net result favors the call (buy) instruments by $60 million.</li><li><strong>Between $28,000 and $29,000:</strong> 7,300 calls vs. 500 puts. The net result favors the call instruments by $195 million.</li><li><strong>Between $29,000 and $30,000:</strong> 8,600 calls vs. 100 puts. The bulls' advantage increases to $250 million.</li><li><strong>Between $30,000 and $31,000:</strong> 10,400 calls vs. 0 puts. Bulls have total control, profiting $310 million.</li></ul><p>This rough estimate considers only put options in bearish bets and call options in neutral-to-bullish trades. Nonetheless, this oversimplification excludes more complex investment strategies. A trader, for example, could have sold a call option, effectively gaining negative exposure to Bitcoin above a specific price, but this effect is difficult to estimate.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/singapore-mas-proposes-digital-money-standards\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/singapore-mas-proposes-digital-money-standards/amp\"><strong><em>Singapore MAS proposes digital money standards with major industry players</em></strong></a></p><p>Bears will likely try to downplay the multiple <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco/amp\">Bitcoin exchange-traded funds (ETF) applications</a>, including Blackrock’s and WisdomTree’s. Meanwhile, bulls should closely monitor the regulatory changes, including the ongoing <a href=\"https://cointelegraph.com/news/binance-france-investigation-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-france-investigation-report/amp\">Binance exchange’s investigation in France</a>, as the Paris Prosecutor’s Office reportedly cited “acts of illegal exercise of the function of a service provider on digital assets (PSAN), and acts of aggravated money laundering.”</p><p>The critical level for the weekly expiration is $28,000, but it is impossible to predict the outcome due to increased cryptocurrency regulatory risks. If bulls are able to profit $250 million or higher, those funds will most likely be used to further strengthen the $28,000 support.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T20:44:32.000Z",
    "title": "Stably pauses withdrawals, minting after Prime Trust halts deposits",
    "url": "https://cryptoslate.com/stably-pauses-withdrawals-minting-after-prime-trust-halts-deposits/",
    "description": "<p>Stablecoin and trading firm Stably is temporarily halting numerous services on June 22 as it attempts to find new custodial partners. The company will pause deposits, withdrawals, and buying and selling on its cryptocurrency trading platforms, Stably Ramp and Stably Prime. The company has also stopped onboarding new users to those services. Stably will stop [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/stably-pauses-withdrawals-minting-after-prime-trust-halts-deposits/\">Stably pauses withdrawals, minting after Prime Trust halts deposits</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T21:00:35.000Z",
    "title": "Why LINK Is Poised To Outperform Altcoins Sector, Analyst Sets Target For $10",
    "url": "https://www.newsbtc.com/news/chainlink/why-link-is-poised-to-outperform-altcoins-sector-analyst-sets-target-for-10/",
    "description": "The crypto market keeps scoring profits over today’s trading session as Chainlink (LINK), and others follow in the footsteps of Bitcoin’s rally. The green season could start, but which altcoin will prevail in the race? Related Reading: Bitcoin Whales Show Most Active Hour In 3 Months As BTC Breaks $30,000 One analyst shared a theory about LINK’s potential to outperform the altcoins sector and stand as a top gainer in the coming months. As of this writing, Chainlink’s native token trades at $5.6 with a 6% profit in the last 24 hours alone. Chainlink (LINK) Price Target For A Bull Market LINK is one of the altcoins that gained popularity in 2020 and 2021 when decentralized finance (DeFi) protocols saw increasing adoption. Today, the cryptocurrency has taken a hit from the persistent bearish trend in the entire sector. However, analyst Daan Crypto believes Chainlink could recover and trend toward new yearly highs. Recently, LINK’s price crashed from a high of $9.50, forming an Average Range at those levels. In other words, $9.50 has been operating as heavy resistance for LINK’s price in 2023. During LINK’s downside trend, the analyst believes that bulls managed to defend $5.50, which hints at a positive forecast for the cryptocurrency. Via Twitter Daan Crypto stated while sharing the chart below: $LINK Followed the plan. It deviated below it&#8217;s 400 day range and retook it. Wouldn&#8217;t expect this to outperform many of the new shiny coins but the invalidation is clear as day and the risk/reward is solid. It&#8217;s do or die here. The chart above shows that if LINK bulls can continue the momentum, the token could rise as far as $10. This target corresponds with the channel’s top when the token has been moving for over a year. Related Reading: ‘Ripple (XRP) Is A Must-Hold For The Next Bull Run,’ Says Bitcoin Maxi However, traders should remember that the token has been unable to break above that resistance, always recording massive losses after hitting that top. In the short term, as conditions in the crypto market are favorable, LINK seems poised to keep trending to the upside. Cover image from Unsplash, chart from Tradingview"
  }
]