[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T04:42:34.000Z",
    "title": "How to Rate the Best Games According to Expert Reviewers",
    "url": "https://www.cryptopolitan.com/how-to-rate-the-best-games/",
    "description": "The gaming industry is in the midst of a renaissance, with a slew of high-profile releases captivating players around the globe. Game enthusiasts have witnessed a continuous stream of AAA blockbusters and innovative indie gems this year.  Since it’s the beginning of a new year of games, It&#8217;s time to closely examine how expert reviewers [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-25T04:55:10.000Z",
    "title": "Ethereum Price is Primed For a Correction And Only 1 Thing is Holding it Back",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-holding-2165/",
    "description": "Ethereum price is attempting an upside correction from the $2,150 support. ETH could gain pace if it clears the $2,240 resistance zone. Ethereum started an upside correction from the $2,165 zone. The price is trading below $2,240 and the 100-hourly Simple Moving Average. There was a break above a connecting bearish trend line with resistance near $2,235 on the hourly chart of ETH/USD (data feed via Kraken). The pair might start a steady increase if it clears the $2,240 resistance zone. Ethereum Price Holds Support Ethereum price extended its decline below the $2,240 support zone. ETH spiked below $2,200 before the bulls appeared near the $2,165 level. The price formed a short-term base and started an upside correction like Bitcoin. There was a move above the $2,200 resistance level. Besides, there was a break above a connecting bearish trend line with resistance near $2,235 on the hourly chart of ETH/USD. However, the bears are active near the $2,240 resistance. They defended the 23.6% Fib retracement level of the downward move from the $2,480 swing high to the $2,165 low. Ethereum is now trading below $2,240 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,240 level. The next hurdle could be $2,300 or the 100-hourly Simple Moving Average, above which the price might rise and test the 50% Fib retracement level of the downward move from the $2,480 swing high to the $2,165 low at $2,320. The next major resistance is now near $2,360. Source: ETHUSD on TradingView.com A clear move above the $2,360 level might start a decent increase. In the stated case, the price could rise toward the $2,420 level. Any more gains might send the price toward the $2,500 zone. Another Drop in ETH? If Ethereum fails to clear the $2,240 resistance, it could start another decline. Initial support on the downside is near the $2,200 level. The next key support could be the $2,165 zone. A downside break below the $2,165 support might start another substantial decline. In the stated case, Ether could test the $2,080 support. Any more losses might send the price toward the $2,000 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,165 Major Resistance Level – $2,240"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-25T05:08:00.000Z",
    "title": "XRP Trails Bitcoin’s Historical Patterns and Mirrors Altcoins Broader Trends: Analyst",
    "url": "https://coinedition.com/analyst-explains-the-factors-behind-an-xrp-potential-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Trails Bitcoin’s\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Popular-Analyst-Claims-God-Candle-Breakout-on-XRPs-Chart-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Blockchain Backer has noted the crucial factors behind a potential XRP rally in the next bull run. According to Blockchain Backer, there is a historical correlation between XRP and Bitcoin. The analyst also established an interconnectedness between Bitcoin and the stock market. Renowned cryptocurrency analyst identified as Blockchain Backer has noted the crucial factors behind [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-explains-the-factors-behind-an-xrp-potential-rally/\">XRP Trails Bitcoin’s Historical Patterns and Mirrors Altcoins Broader Trends: Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]