[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-24T04:02:59.000Z",
    "title": "Crypto phishing scam drains $600,000 from users tricked by fake airdrops",
    "url": "https://cryptobriefing.com/crypto-phishing-scam-drains-600000-users-tricked-fake-airdrops/?utm_source=feed&utm_medium=rss",
    "description": "Scammers used fake airdrop campaigns and trustworthy crypto brands to lure victims, amassing six-figure in crypto within eight hours."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-24T03:42:00.000Z",
    "title": "Cardano ($ADA) Outshines Bitcoin, Ethereum, and Polkadot in Key Metric",
    "url": "https://www.cryptoglobe.com/latest/2024/01/cardano-ada-outshines-bitcoin-ethereum-and-polkadot-in-key-metric/",
    "description": "The popular smart contract platform Cardano ($ADA) has maintained its top stop in cryptocurrency development activity, outperforming other major digital assets including Bitcoin ($BTC) and Ethereum ($ETH). That’s according to data from on-chain analytics firm Santiment, which noted that the “blockchain of blockchains” Polkadot ($DOT) and its public pre-production environment Kusama ($KSM) came in second […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T04:07:15.000Z",
    "title": "Federal Court of Canada declares Emergency Law unconstitutional",
    "url": "https://www.cryptopolitan.com/federal-court-of-canada-on-emergency-law/",
    "description": "In a recent ruling, the Federal Court of Canada has deemed the government&#8217;s use of the Emergencies Act to curb funds and cryptocurrencies supporting protesting truckers as unreasonable and unconstitutional. Justice Richard Mosley, in his decision on January 23rd, 2024, concluded that there was no genuine national emergency justifying the invocation of the Emergencies Act.&#160; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:51:27.000Z",
    "title": "Is Beijing’s New Facial ID System the Key to Quick and Easy Foreign Business Registration?",
    "url": "https://www.cryptopolitan.com/beijings-facial-id-business-registration/",
    "description": "In a major development aimed at enhancing the business environment for foreigners, Beijing has recently implemented a transformative policy, effective as of January 18. This initiative allows foreign entrepreneurs to complete the entire process of registering a business online, utilizing facial recognition (facial ID) technology.  This significant move, aimed at simplifying procedures and drastically reducing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:40:35.000Z",
    "title": "Tornado Cash trial: A landmark case for Web3 and privacy",
    "url": "https://www.cryptopolitan.com/tornado-cash-trial-a-landmark-case/",
    "description": "In a pivotal development that could have far-reaching implications for open-source software and Web3, the Tornado Cash crypto mixer is under intense scrutiny. The platform, known for its privacy-centric features, has been embroiled in controversy following allegations of its use by North Korean hackers for money laundering.&#160; This situation escalated to the legal prosecution of [&#8230;]"
  }
]