[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T07:56:01.000Z",
    "title": "Upbit Halts Trading of Curve Finance's Token After $100M Exploit",
    "url": "https://www.coindesk.com/markets/2023/07/31/upbit-halts-trading-of-curve-finances-token-after-100m-exploit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Other exchanges say they are monitoring the situation closely but have not taken any action."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T07:40:00.000Z",
    "title": "Zero-knowledge proofs, explained",
    "url": "https://cointelegraph.com/explained/zero-knowledge-proofs-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/05fb21561c0dd992bcca7edc3de1e09e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Zero-knowledge (ZK) proofs allow for proving a statement’s truth without revealing any information beyond its validity.</p>\n                    <p><h2>What are the disadvantages of zero-knowledge proofs?</h2><p></p><p><em>ZK-proofs provide privacy and security benefits, but they can be computationally intensive and complex to implement. </em></p><p>Developing and verifying ZK-proofs can be resource- and computationally intensive, particularly for more complicated proofs. This can result in longer processing times for transactions and more computational work, which might make blockchain systems more difficult to scale.</p><p>Furthermore, ZK-proofs might add a layer of complexity that might make the protocol more difficult to audit and verify, sparking worries about potential security flaws or bugs. Furthermore, while ZK-proofs improve privacy by hiding information, they may also facilitate illegal activity in some situations, creating difficulties for regulatory compliance.</p><p>ZK-proofs might also not be appropriate for all use cases or sectors because they require particular training and experience to implement properly. This might prevent them from being widely used and adopted across many fields. </p><p>Although ZK-proofs provide useful privacy and security features, their drawbacks necessitate careful study and evaluation of the associated trade-offs prior to their adoption into particular systems or applications.</p><h2>Can ZK-proofs be integrated into blockchain platforms?</h2><p></p><p><em>Yes, ZK-proofs can be integrated into <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain platforms</a>, and in fact, they have been successfully implemented in various blockchain networks. ZK-proofs provide a potent technique for boosting efficiency, security and privacy in blockchain systems.</em></p><p>When integrated into blockchain platforms, ZK-proofs can serve multiple purposes:</p><h3>Privacy and confidentiality</h3><p>ZK-proofs allow for private transactions, letting users perform transactions without disclosing the underlying information, such as the transaction amount and sender and receiver addresses. The improvement of user privacy on open blockchains depends on this.</p><h3>Verification and auditing</h3><p>Without disclosing the real data or information, ZK-proofs can be used to check the accuracy of specific computations or statements. This guarantees data integrity and makes effective auditing procedures possible.</p><h3>Scalability</h3><p>ZK-proofs can increase the scalability of the platform by offering concise proofs for complex computations, which can help minimize the computational and storage overhead on the blockchain.</p><h3>Identity and authentication</h3><p>By using ZK-proofs for safe identity verification and authentication while protecting user privacy, blockchain-based applications will be securer.</p><h3>Cross-chain interoperability</h3><p>ZK-proofs can help with cross-chain communication and asset transfers while protecting privacy by facilitating <a href=\"https://cointelegraph.com/learn/what-is-blockchain-interoperability-a-beginners-guide-to-cross-chain-technology\">interoperability among various blockchain networks</a>.</p><h2>What are the applications of zero-knowledge proofs?</h2><p></p><p><em>ZK-proofs are useful tools that have many uses in a variety of fields and address important privacy and security issues.</em></p><p>ZK-proofs are crucial in the world of <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrencies</a> for improving transaction privacy and scalability. They allow for anonymous transactions without disclosing the particulars of the transaction or the identity of the users, as is the case with privacy-focused cryptocurrencies, such as Zcash (<a href=\"https://cointelegraph.com/zec-price-index\">ZEC</a>).</p><p>ZK-proofs can be used in the authentication and access control fields to demonstrate an understanding of a password or a cryptographic key without revealing the password or key itself. This results in better user-friendly and secure authentication techniques.</p><p>ZK-proofs are also used in electronic voting systems, where they allow voters to demonstrate the legitimacy of their vote without disclosing the actual vote, protecting both voter privacy and the integrity of the electoral process.</p><p>ZK-proofs also have implications for secure data transfer and verification, giving one side the ability to demonstrate the accuracy of computations on private data without disclosing the data itself.</p><p>Zero-knowledge proofs can improve transaction privacy in <a href=\"https://cointelegraph.com/learn/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">central bank digital currencies (CBDCs)</a> by <a href=\"https://cointelegraph.com/news/what-are-zk-snarks-and-how-do-they-affect-digital-privacy\">facilitating private transactions</a> and upholding user anonymity. By balancing privacy and transparency in CBDC transactions, ZK-proofs enable auditability without disclosing transaction specifics.</p><h2>How do zero-knowledge proofs work?</h2><p></p><p><em>ZK-proofs allow a prover to persuade a verifier of a statement’s veracity without disclosing any information about the assertion itself. The prover and verifier interact in multiple rounds of the protocol, and in the conclusion, the verifier develops confidence in the veracity of the claim without learning any <a href=\"https://cointelegraph.com/news/researchers-use-zero-knowledge-to-address-privacy-aml-concerns-in-stablecoins\">additional information about the secret</a>.</em></p><p>Let’s use the “Three Color Problem,” also known as the “Graph Coloring Problem,” as an illustration of how ZK-proofs function.</p><h3>The problem</h3><p>Imagine that you have a map with multiple areas (vertices) connected by lines (edges), and this is the issue. The goal is to use one of three colors to color each region so that no two neighboring parts have the same color. Can you persuade someone that you are aware of the correct coloring without exposing the actual hues given to each region?</p><h3>Solution using the ZK-proofs protocol</h3><h4>Setup</h4><p>The prover and the verifier both agree on the regions and links of the graph (map).</p><h4>Statement</h4><p>The prover asserts to have a reliable three-coloring for the provided graph.</p><h4>Round 1: Commitment</h4><p>The prover chooses colors at random for each location in secret without disclosing them. Instead, the prover provides the verifier with one encrypted promise for each region. The verifier cannot see what colors are inside the commitments because they are locked like boxes.</p><h4>Round 2: Challenge </h4><p>The verifier chooses a random region and requests that the prover open the commitment for that particular zone. The prover must disclose the hue of that area’s commitment.</p><h4>Round 3: Response</h4><p>After committing to the colors, the prover must now prove that the revealed coloring is accurate. This entails displaying the color differences between adjacent sections. The verifier examines the response to ensure that the prover correctly followed the rules.</p><h4>Iteration</h4><p>Rounds 2 and 3 are repeated numerous times using various regions that are chosen at random. This procedure is repeated as many times as necessary to establish a high degree of trust in the veracity of the prover’s assertion.</p><h4>Conclusion</h4><p>The verifier becomes confident that the prover actually has a valid three-coloring without knowing the actual colors used if the prover regularly produces valid responses for each round.</p><p>The verifier gradually increases the prover’s capacity to recognize a valid three-coloring of the graph by repeating the procedure for various regions. However, the zero-knowledge property is maintained since the verifier never discovers the real colors assigned to each region during the procedure.</p><p>The above illustration shows how ZK-proofs can be used to persuade someone that a solution exists while keeping the solution’s identity a secret, offering a potent tool for boosting privacy and security in a variety of applications.</p><h2>What is a zero-knowledge proof?</h2><p></p><p><em>A zero-knowledge (ZK) proof is a cryptographic protocol that enables one person (the prover) to convince another (the verifier) that a particular claim is true without disclosing any details about the claim itself. </em></p><p>Researchers Shafi Goldwasser, Silvio Micali and Charles Rackoff presented the idea for the first time in the early 1980s. The main goal of a ZK-proof is to persuade the verifier that a claim is true <a href=\"https://cointelegraph.com/explained/zk-starks-vs-zk-snarks-explained\">without revealing any information</a> other than the claim’s veracity. </p><p>A good zero-knowledge proof should fulfill the following three criteria:</p><ul><li>Completeness: The verifier will accept the proof with a high probability if the proposition is true, and both the prover and the verifier adhere to the protocol.</li><li>Soundness: If the claim is untrue, no prover should be able to persuade the verifier of the opposite, save under extremely unlikely circumstances.</li><li>Zero-knowledge: Even after engaging with the prover, the verifier only understands the truth of the statement and nothing else about the secret.</li></ul><p>There are different types of ZK-proofs:</p><h3>Interactive ZK-proofs</h3><p>Interactive zero-knowledge proofs require back-and-forth communication between the prover and verifier.</p><h3>Non-interactive ZK-proofs</h3><p>Non-interactive zero-knowledge proofs provide a compact proof that can be verified in a single step.</p><h3>Statistical ZK-proofs</h3><p>Statistical zero-knowledge proofs offer computational soundness with a small probability of error. </p><h3>Proof-of-knowledge (PoK)</h3><p>PoK is a subclass of ZK-proofs that shows that the prover possesses specific knowledge related to the statement.</p><h3>Proofs of shuffle and range</h3><p>These ZK-proofs are used in electronic voting and privacy-preserving transactions.</p><h3>Sigma protocols</h3><p>Sigma protocols are a class of ZK-proofs that involve three steps: commitment, challenge and response.</p><h3>Bulletproofs</h3><p>Bulletproofs are designed to provide efficient range proofs for large sets of values.</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T07:51:00.000Z",
    "title": "SEC Asked Coinbase To Trade Only In Bitcoin Before Suing Exchange",
    "url": "https://cryptodaily.co.uk/2023/07/sec-asked-coinbase-to-trade-only-in-bitcoin-before-suing-exchange",
    "description": "<p>Coinbase CEO Brian Armstrong has revealed that the United States Securities and Exchange Commission (SEC) had asked Coinbase to halt all cryptocurrency trading, except that of Bitcoin.&nbsp;</p>\n<p>According to Armstrong, the SEC had requested this prior to suing the exchange for failing to register as a broker.</p>\nDelist Every Asset Apart From Bitcoin&nbsp;\n<p>The Coinbase CEO made the revelation in a detailed interview, stating that the Securities and Exchange Commission had made the request before suing the exchange. Armstrong added that the regulator approached the exchange, stating that they viewed every other asset apart from Bitcoin as a security and asking Coinbase to delist assets it viewed as securities. When Coinbase asked how the SEC came to that conclusion, the regulator declined to explain its interpretation of the law. Armstrong stated,&nbsp;</p>\n\n<p>&ldquo;They came back to us, and they said&hellip; we believe every asset other than Bitcoin is a security. And, we said, well, how are you coming to that conclusion, because that&rsquo;s not our interpretation of the law. And they said, we&rsquo;re not going to explain it to you; you need to delist every asset other than Bitcoin.&rdquo;</p>\n\n<p>According to the lawsuit filed by the Securities and Exchange Commission against Coinbase, it viewed 13 assets as securities. The assets in question are Solana (SOL), Polygon (MATIC), Cardano (ADA), FIL, SAND, AXS, ICP, NEAR, CHZ, DASH, VGX, and NEXO. The agency also accused Coinbase of failing to register with it as a broker, clearing agency, or national securities exchange. This, according to the SEC, meant that Coinbase was dodging the disclosure regime established by the United States Congress for the US securities markets.&nbsp;</p>\nNot Much Choice At That Point&nbsp;\n<p>Armstrong added that the exchange did not have much choice at the time. He added that if Coinbase had followed the Securities and Exchange Commission&rsquo;s instructions, it would set a wrong precedent and send out the wrong message. Coinbase accepting the SEC&rsquo;s instructions would have meant that most businesses and entities in the crypto space would have been deemed to be operating outside the law unless they had registered with the Securities and Exchange Commission. Armstrong added that delisting every asset apart from Bitcoin would have effectively ended the crypto industry in the United States.&nbsp;</p>\n\n<p>&ldquo;We really didn&rsquo;t [did not] have a choice at that point; delisting every asset other than Bitcoin, which by the way, is not what the law says, would have essentially meant the end of the crypto industry in the US. It kind of made it an easy choice&hellip; let&rsquo;s [let us] go to court and find out what the court says.&rdquo;</p>\n\nRipple-SEC Case Provides Some Regulatory Clarity&nbsp;\n<p>The crypto industry in the United States has been asking the Securities and Exchange Commission for better regulatory clarity. While the SEC has not been forthcoming, the recent SEC-Ripple case ruling brought some much-needed clarity on the subject of security and non-security. In the Ripple-SEC case, the judge ruled that XRP is not a security. The asset&rsquo;s sale on exchanges, distribution to developers, sales by employees, and distribution to charities were all off the radar.&nbsp;</p>\n<p>However, the judge ruled that institutional sales of the XRP token were in violation of federal securities laws. After Ripple&rsquo;s partial victory, many experts and industry watchers believe the ruling would benefit the Coinbase lawsuit.&nbsp;</p>\nSEC And Coinbase: The Case So Far&nbsp;\n<p>The Securities and Exchange Commission had sued Coinbase in June, alleging that the exchange allowed investors and traders to purchase, sell, and trade crypto asset securities. The filing stated that Coinbase merged three functions typically separated in traditional markets: clearing agencies, brokers, and exchanges.&nbsp;</p>\n\n<p>&ldquo;Coinbase has never registered with the SEC as a broker, national securities exchange, or clearing agency, thus evading the disclosure regime that Congress has established for our securities markets.&rdquo;</p>\n\n<p>The Securities and Exchange Commission filed its lawsuit against Coinbase in the US District Court for the Southern District of New York. The lawsuit alleged that the exchange violated several registration provisions of the Securities Exchange Act of 1934 and the securities offering registration provisions included in the Securities Act of 1933. At the time, Gurbir S. Grewal, the director of the SEC&rsquo;s enforcement division, had stated,&nbsp;</p>\n\n<p>&ldquo;You simply can&rsquo;t ignore the rules because you don&rsquo;t like them or because you&rsquo;d prefer different ones: the consequences for the investing public are far too great.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T08:00:05.000Z",
    "title": "XRP To Skyrocket To $500 Within 7 Months, Predicts Wells Fargo Treasury Manager",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-skyrocket-500-7-months-wells-fargo-treasury-manager/",
    "description": "In a recent statement, Wells Fargo&#8217;s Treasury Management officer Shannon Thorp provided an eye-catching price prediction for XRP. The forward-thinking executive anticipates a potential surge in XRP&#8217;s value to anywhere between $100 and $500 in the short term, specifically within the next 4 to 7 months. This price hike prediction represents an astounding 14,200 % to 71,400% increase from the current trading value. Finding The Right Best Model Thorp acknowledges the longstanding debate within the XRP community, where one faction relies solely on chart patterns and trends exhibited by Bitcoin to draw short-term price predictions. On the other hand, another group emphasizes the significance of XRP&#8217;s utility, believing that its partnerships and the replacement of antiquated systems will be the key drivers of its price. However, Thorp presents a novel perspective, emphasizing that XRP is NOT a security and basing price forecasts on traditional securities logic is counterintuitive to the original vision set forth by the Ripple team. Related Reading: This Machine Learning Tool Was Asked To Predict XRP Price, Here’s What It Said Expanding on her rationale, Thorp introduces the concept of Liquidity Strength (LS) as a pivotal metric to consider when predicting XRP&#8217;s future value. To ascertain a price range for the token, she takes into account the total supply, including circulating tokens, burnt tokens, those owned by banks, governments, and individuals, and assumes that Ripple has released all their XRP from escrow. According to Thorp, if one company were to possess all 100 billion tokens, their Liquidity Strength (LS) in a price range of $1.00 to $5.00 would amount to $100 billion to $500 billion. However, she argues that such a calculation fails to consider the potential growth in the economy, messaging and settling activities, and the continuous benefits derived from using XRP. Drawing on real-world examples, Thorp compares the token&#8217;s potential to that of SWIFT, which handles approximately 44.8 million messages per day. Even if Ripple could capture only 30% of SWIFT&#8217;s daily value, which she approximates at $7 trillion, it would result in a staggering $2.1 trillion in daily value (roughly 13.2 million messages) for XRP. Considering XRP&#8217;s quick settlement time of 1 to 5 seconds, the liquidity would indeed be present. However, Thorp highlights the challenge of conducting large transactions with limited Liquidity Strength, as it may require a significant portion of a bank&#8217;s XRP holdings. XRP Price Prediction To arrive at her price prediction, Thorp factors in various elements such as all global banks, burnt XRP, individual holdings, XRP distributed to large banks and creators, and tokens available on liquidity hubs and exchanges. She estimates that at any given time, there may be 50 to 75 billion XRP supporting Liquidity Strength (LS). When distributed across approximately 300 to 1000 different banks, liquidity providers, and governments, this would yield around $75 million XRP/dollars for each institution. Taking into account J.P. Morgan as a top-tier bank with a daily transaction volume exceeding $8 trillion, Thorp postulates that even if Ripple captured only 10% of this market, which amounts to $800 billion, the existing 75 billion XRP in circulation would not suffice to move such massive sums efficiently. Thorp acknowledges that this estimation solely pertains to cross-border transactions and does not encompass derivatives, real estate, CBDCs, technical parallels, and NFTs. Related Reading: Traders’ Interest In XRP Remains Solid Despite Price Retreat, Data Shows With the groundwork laid, Thorp makes her price prediction, projecting XRP&#8217;s price range to be anywhere from $100 to $500 in the near short term (4 &#8211; 7 months). Her calculation is based on the Liquidity Strength (LS) scenario, where a XRP price of $100 with a supply of 50 billion XRP would yield an LS of $5 trillion, while $500 would result in an LS of $25 trillion. According to Thorp, this valuation gives the market breathing room, allows for growth, and assures that no single entity needs to hold billions of XRP to operate daily. Furthermore, Thorp believes that a potential &#8220;flip of the switch&#8221; moment could trigger this price surge &#8211; an event akin to a re-evaluation for XRP, similar to how gold is assessed. Notably, Thorp&#8217;s speculation sets an exciting stage for the future of XRP, albeit it is important to remember that her prediction is based on several assumptions that may or may not actualize. As always, those interested in investing should conduct their due diligence, consider multiple perspectives, and make informed decisions. At press time, the XRP price was at $0.7074. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T08:03:43.000Z",
    "title": "What’s Happening To Tezos? XTZ Falling To 2022 Lows While QUBE Traders Expect 10X On Launch",
    "url": "https://www.crypto-news-flash.com/whats-happening-to-tezos-xtz-falling-to-2022-lows-while-qube-traders-expect-10x-on-launch/?utm_source=rss&utm_medium=rss&utm_campaign=whats-happening-to-tezos-xtz-falling-to-2022-lows-while-qube-traders-expect-10x-on-launch",
    "description": "<img width=\"512\" height=\"234\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T082106.328.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T082106.328.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T082106.328-300x137.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is characterized by volatility, with digital assets susceptible to the whims of market dynamics. Tezos, which used to be a promising investment, is now facing bearish sentiment as its price falls to levels not seen since 2022. On the other hand, InQubeta continues to wow investors and traders, with a 10x return [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T08:03:11.000Z",
    "title": "Cardano’s Mithril Launch Fuels Optimism: Top Analyst Foresees 2500% Surge in ADA During Upcoming Bull Run",
    "url": "https://www.crypto-news-flash.com/cardanos-mithril-launch-fuels-optimism-top-analyst-foresees-2500-surge-in-ada-during-upcoming-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-mithril-launch-fuels-optimism-top-analyst-foresees-2500-surge-in-ada-during-upcoming-bull-run",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-concept-1-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The Mithril upgrade for Cardano&#8217;s network brings about faster node syncing, improved security, and decentralized decision making, thus enhancing efficiency. Top crypto analyst Dan Gambardello predicts a 2500% surge in ADA price, reaching a minimum all-time high of $7.80 in the next bull cycle, reflecting optimism for the Cardano&#8217;s future. Following our recent update, Cardano&#8217;s [...]"
  }
]