[
  {
    "source": "CoinDesk",
    "date": "2024-03-05T09:12:03.000Z",
    "title": "Shiba Inu Prices Briefly Dropped 50% on Coinbase",
    "url": "https://www.coindesk.com/markets/2024/03/05/shiba-inu-prices-briefly-dropped-50-on-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The tokens have logged over $1.7 billion in volumes on the regulated exchange in the past 24 hours, the most among counterparts."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-05T09:25:43.000Z",
    "title": "Fidelity’s Bitcoin ETF records its largest single-day inflow, attracting $405 million",
    "url": "https://cryptoslate.com/insights/fidelitys-bitcoin-etf-records-its-largest-single-day-inflow-attracting-405-million/",
    "description": "<p>Quick Take As Bitcoin hovers just below the all-time high of $69,000, the ETF sector demonstrates substantial activity, reflecting wider market sentiment and significant institutional interest. According to BitMEX, recent inflows into Bitcoin ETFs reached a striking total of $563 million on March 4, equivalent to roughly 8,338 Bitcoins. Data from BitMEX shows that renowned [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/fidelitys-bitcoin-etf-records-its-largest-single-day-inflow-attracting-405-million/\">Fidelity&#8217;s Bitcoin ETF records its largest single-day inflow, attracting $405 million</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-05T09:19:32.000Z",
    "title": "A Bitcoin Supercycle Would ‘Change the Existing World Order’, Leading to ‘Potentially Millions of Dollars per BTC’, Says Global Investor",
    "url": "https://www.cryptoglobe.com/latest/2024/03/a-bitcoin-supercycle-would-change-the-existing-world-order-leading-to-potentially-millions-of-dollars-per-btc-says-global-investor/",
    "description": "In a recent detailed post on social media platform XMarc van der Chijs, a renowned entrepreneur and venture capitalist, shared his increasingly bullish perspective on Bitcoin, foreseeing a potential supercycle in the cryptocurrency market. He co-founded Tudou.com, one of China’s largest video-sharing websites, which later merged with Youku.com to form one of the country’s most […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-05T09:10:48.000Z",
    "title": "JTC Network’s Revolutionary Legal -Recourse Bitcoin Fork Listed on WhiteBIT, Bridging Digital Assets with Official Court Systems",
    "url": "https://www.cryptopolitan.com/jtc-networks-revolutionary-legal-recourse-bitcoin-fork-listed-on-whitebit-bridging-digital-assets-with-official-court-systems-2/",
    "description": "Chicago, Illinois, March 4th, 2024, Chainwire JTC Network, a next-gen Bitcoin fork with native connections to official government legal systems, will be listed for trading on March 5 by the WhiteBIT exchange. WhiteBIT’s listing follows consistent solid performances by the JTC ecosystem, including successful use within the U.S. federal court system, an NFT platform with [&#8230;]"
  }
]