[
  {
    "source": "NewsBTC",
    "date": "2023-07-04T00:19:25.000Z",
    "title": "Why Bitcoin Dominance Hints At A Surprise Altcoin Season Ahead",
    "url": "https://www.newsbtc.com/bitcoin-news/why-bitcoin-dominance-hints-at-a-surprise-altcoin-season-ahead/",
    "description": "Over the last month, a coordinated attack against altcoins by the US SEC caused Bitcoin dominance to surpass 50%. Above the psychological level makes BTC more valuable as a whole than the entire crypto market. However, a technical signal has appeared that in the past put in a peak in BTC.D and suddenly sparked a reversal in altcoins. Here is a closer look at the signal and why a surprise alt season could be right around the corner. Bitcoin Dominance Beats All Other Crypto Combined Bitcoin dominance is a metric that measures the top cryptocurrency’s market cap against the weight of everything else in the space. It is often used as a barometer of health in altcoins, specifically when it’s better to be in BTC, or in alts like Ethereum, Litecoin, or Solana. When BTC.D is falling and the market is healthy, altcoins outperform Bitcoin in terms of alpha. But as high beta assets, alts are significantly more volatile. As a result, when the market is crashing, they suffer much more drawdown by comparison and BTC’s market share becomes increasingly dominant. Related Reading: Bitcoin Starts To Bite Back Says Reptilian Technical Signal This is precisely the case all throughout 2023. Altcoins have taken a beating, but Bitcoin has held its ground. This divergence across the different types of cryptocurrencies has caused the total market cap of BTC to surpass all other coins combined. 50% dominance is clearly an important level. However, it’s a reading on the Relative Strength Index that’s particularly notable. Will dominance be rejected? &#124; BTCUSD on TradingView.com The BTC.D Signal Hinting At A Surprise Altcoin Season The Relative Strength Index is a momentum measuring tool, which tells traders when an asset is overbought or oversold. In crypto, assets can stay overbought or oversold for extended periods of time. But in BTC.D, on weekly timeframes, historically it hasn’t spent much time at overbought conditions. In fact, it has only reached overbought a handful of times. This latest push into overbought territory has reached a reading that in the past put the peak in for Bitcoin dominance and immediately turned around into an epic altcoin season. This setup last appeared in late 2019 when BTC.D was at 70%. Related Reading: Bitcoin Reaches Longest Stretch Ever Without A Bull Run With such overbought conditions, combined with an Elliott Wave count indicative of a five-wave move coming to an end, an altcoin season might not be as far away as most are expecting. Although altcoins outperform in an alt season, hence the name, they require a bullish Bitcoin to bait retail to the market. With BTC beginning to show bullish signs once again, how long until altcoins follow and ultimately outperform? This chart originally appeared in Issue #10 of CoinChartist (VIP). Get 10% off a year subscription with this link: https://coinchartist.substack.com/NEWSBTC Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]