[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T12:46:27.000Z",
    "title": "DeFi Daily Volume Dwindles to 7-Month Lows as Sector Endures Downswing",
    "url": "https://www.coindesk.com/business/2023/07/26/defi-daily-volume-dwindles-to-7-month-lows-as-sector-endures-downswing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The decentralized finance (DeFi) sector has endured a turbulent month, as transaction volume plummeting alongside a series of hacks and exploits."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T12:43:37.000Z",
    "title": "From Early Computers to NFTs: Vera Molnàr's Pioneering Art Journey at Sotheby's",
    "url": "https://decrypt.co/150142/from-early-computers-nft-vera-molnar-pioneering-art-journey-sothebys",
    "description": "Vera Molnár's new generative art series reimagines typography with algorithms, marking the kickoff of Sotheby's Gen-Art Program."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T13:01:00.000Z",
    "title": "Existential threat? Why some banks are anxious about CBDCs",
    "url": "https://cointelegraph.com/news/existential-threat-why-some-banks-are-anxious-about-cbdcs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8ad10081-dd96-44e9-9234-9fd966452e6d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The prospect of a retail CBDC has some major banks anxious over their revenue streams. </p>\n                    <p><p>In the current climate, which is pretty hostile for the digital assets industry following the failures of 2022, central bank digital currencies (CBDCs) are often perceived as “crypto killers.”</p><p>This is hardly an overstatement, as financial authorities’ aspirations concerning CBDCs are relatively straightforward: return firmer control over the movement of money before it gets too decentralized.</p><p>Governments around the world are becoming more proactive in that direction. According to a survey by the Bank for International Settlements, <a href=\"https://cointelegraph.com/news/research-there-could-be-24-cbdcs-live-by-2030\">93% of central banks are already researching</a> CBDCs, and there could be up to 24 CBDCs in circulation by 2030.</p><p>What is largely missing from the public discussion on CBDCs, especially within the crypto community, is that — besides crypto — national digital currencies actually have a very powerful adversary: banks.</p><p>For private financial institutions, the idea of a de facto state-controlled ecosystem of payments and transactions represents an existential threat, in no way less than private cryptocurrencies. Will they try to slow the CBDC revolution or choose to adapt to it?</p><h2>How CBDCs challenge traditional banks</h2><p>JPMorgan CEO Jamie Dimon is <a href=\"https://cointelegraph.com/news/jpmorgan-ceo-calls-crypto-decentralized-ponzi-schemes\">famous for his anti-crypto stance</a>, calling the industry nothing more than “a decentralized Ponzi scheme.” When <a href=\"https://www.youtube.com/live/dNO9iBPlvzk?feature=share&amp;t=6798\" target=\"_blank\" rel=\"noopener nofollow\">asked</a> about CBDCs, the banker’s response was less passionate but no less anxious: </p><blockquote>“I don’t trust it will be properly done. [...] There’s a lot more to banking services than the actual token that moves the money. There are fraud risk alert services, call centers, bank branches, ATMs, CRA.” </blockquote><p>While there’s definitely a lot more to banking services than money movement, this abundance of opportunities would lose steam in the event of mass divestment, even if it happened exclusively among individual customers, not to mention corporate clients. </p><p>By allowing individuals and businesses to hold and transact directly with the central bank, CBDCs could dilute the body of deposits and accounts and, hence, the money mass manipulated by private banking institutions. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/ai-and-dot-com-bubble-share-some-similarities-but-differ-where-it-counts\">AI and dot-com bubble share some similarities but differ where it counts</a></em></strong></p><p>In his recent article on the matter, former Greek Minister of Finance Yanis Varoufakis <a href=\"https://www.project-syndicate.org/commentary/central-bank-digital-currency-would-upend-financial-industry-by-yanis-varoufakis-2023-05\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> the example of First Republic Bank. In May, when First Republic failed, its assets were sold to JPMorgan in violation of the Federal Deposit Insurance Corporation’s cardinal rule that no bank owning more than 10% of insured U.S. deposits should be allowed to absorb another U.S. bank.</p><p>While such a move, sanctioned by the United States government, puts even more potential risk on the financial system, it could have been easily avoided with the help of a CBDC. Then, the Federal Reserve could directly save the funds of First Republic customers by putting them in Fed-guaranteed CBDC deposits. In that case, though, JPMorgan wouldn’t get $92 billion in fresh deposits.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Would a U.S. <a href=\"https://twitter.com/hashtag/CBDC?src=hash&amp;ref_src=twsrc%5Etfw\">#CBDC</a> replace cash or paper currency? (1/3)<br>For more: <a href=\"https://t.co/BZ84GMKdR4\">https://t.co/BZ84GMKdR4</a><a href=\"https://t.co/A8aHz7H2FO\">https://t.co/A8aHz7H2FO</a> <a href=\"https://t.co/EyQU50fMZ8\">pic.twitter.com/EyQU50fMZ8</a></p>&mdash; Federal Reserve (@federalreserve) <a href=\"https://twitter.com/federalreserve/status/1493644619778859011?ref_src=twsrc%5Etfw\">February 15, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, it’s not only “too big to fail” institutions that have reasons to fear forgone profit. In an economic shock scenario where depositors seek refuge for their money, the smaller banks, despite all their mom-and-pop charm, would be the first to lose panicking clients should depositors have an opportunity to transfer their funds directly to central banks. In that sense, CBDCs could even worsen financial instability, <a href=\"https://www.ft.com/content/828133e6-5e93-44ef-ba18-57cf2ffadedb\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> Jonathan Guthrie in the Financial Times.</p><p>There are other issues as well, such as potential competition from the CBDC public operators or their private partners. For now, central banks tend to limit their digital currency ambitions with payments and transfers, but what exactly should stop them from broadening their scope of options in the future? </p><p>Bankers are well aware of such a scenario. In April 2023, representatives of both European private and public banking institutions voiced their cautious support for a “digital euro” — the initiative cherished by the European Union authorities. But some statements were heavily <a href=\"https://cointelegraph.com/news/european-bankers-on-digital-euro-ecb-has-no-interest-in-users-personal-data\">marked by worry</a>. Jerome Grivet, deputy CEO of French bank Crédit Agricole, stated clearly: </p><blockquote>“Central bank digital money could threaten the traditional banks’ business model by competing with their collection activity and disrupting their financing capacity.”</blockquote><p>To avoid this, Grivet emphasized that the digital euro should be limited to use as a payment method rather than a store of value. Burkhard Balz, a member of the executive board at Deutsche Bundesbank, further suggested that central banks should be cautious about expanding their role too much in the digital euro ecosystem. He even proposed that the private sector should be responsible for distributing the digital euro. </p><h2>Is it that bad?</h2><p>“I don’t think there’s fear among banks regarding CBDCs, at least not yet,” Nihar Neelakanti, CEO of a Web3 project Ecosapiens, explained to Cointelegraph. “Right now, there’s more curiosity about how such a major technological upgrade to the financial system would play out.”</p><p>There is still a chance that private banking institutions will become the necessary intermediaries between CBDC platforms and consumers, although it will depend largely on the political will of the central banks. In that case, they could even profit from the new technology. </p><p>But no expert would deny the possible threat to the banks’ prosperity in a scenario where the central banks decide to take control.</p><p>And it’s not only a question of disintermediation in payments and transfers — what if the central banks decided to lend the money directly to customers?</p><p>“Theoretically, because central banks would have control over the CBDC ledger, they also could have access to one’s credit history and worthiness,” Neelakanti explained. In that case, user data could become so centralized that central banks could tailor interest rates to the individual customer’s credit-worthiness:</p><blockquote>“There could be not a single Fed fund’s rate but rather a rate that is unique to each and every borrower in whichever country.”</blockquote><p>Ralf Kubli, a board member at the Casper Network, was quick to disavow these fears, telling Cointelegraph, “Contrary to popular belief, CBDCs don’t offer much in the way of innovation beyond streamlined settlement.” </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/sotheby-s-blockchain-gen-art-program-shows-tech-taking-a-back-seat-to-art\">Sotheby’s blockchain Gen Art program shows tech taking a back seat to art</a></em></strong></p><p>In Kubli’s analysis, central bank digital currencies are essentially just a digital form of settlement acting as a payment rail on top of another payment rail. Thus, they don’t reduce the need for labor or oversight. What they can do, however, is fuel the banks’ pace for innovation in the new competitive environment. A massive paradigm shift in finance is on the horizon, Kubli believes:</p><blockquote>“To navigate the accelerating rate of change in our data-driven world, banks must embrace a digitally native approach to finance that incorporates blockchain’s transaction security, verifiability and enforceability.”</blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T12:54:48.000Z",
    "title": "South Korea strengthens crypto regulation with LEI adoption and crime unit",
    "url": "https://cointelegraph.com/news/crypto-south-korea-strengthens-crypto-regulation-with-lei-adoption-and-crime-unit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/410eb296-bde4-4a8c-a0e4-d7d9eec3b86c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The decision was driven by the country's concern over illicit activities in the crypto market and the desire to safeguard investors. </p>\n                    <p><p>South Korea has established an interagency investigation unit to combat cryptocurrency crimes, aiming to address the rise in illicit activities in the market and the need for investor protection, according to a July 26 report. </p><p>Concurrently, the Korea Securities Depository announced a business agreement with Code, a company specializing in travel rules, in Seoul to encourage the issuance and usage of LEI (Legal Entity Identifier) in the virtual asset market.</p><p>According to an earlier report by local news media, Yonhap News, The Seoul Southern District Prosecutors Office will <a href=\"https://en.yna.co.kr/view/AEN20230726006000320\" target=\"_blank\" rel=\"noopener nofollow\">establish</a> a joint virtual asset crime investigation unit called the Joint Investigation Centre for Crypto Crimes. The unit comprises 30 investigators from seven government agencies and bodies. These include the prosecution, Financial Supervisory Service, National Tax Service and Korea Customs Service, among others.</p><p> A separate <a href=\"https://www.fnnews.com/news/202307261412399732\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from FNNews cited an official statement from Prosecutor General Lee Won-Seok,</p><blockquote>\"The virtual asset crime syndicate should help the initial virtual asset market not shrink and eliminate risks to stably settle in place.\"</blockquote><p>The unit's primary focus is on investigating market players involved in issuing or distributing cryptocurrency to identify irregular trading activities and probe associated criminal activities, the reports sai. Additionally, it will expedite the investigative process for crypto-related criminal cases, covering detection, analysis and handling.</p><p>The launch coincides with the <a href=\"https://cointelegraph.com/news/south-korea-passes-bill-to-tackle-unfair-cryptocurrency-trading\">passing of South Korea's first-of-its-kind legislation</a> at the National Assembly, designed to safeguard crypto investors. The new law introduces penalties, including prison sentences and fines, for individuals engaged in unfair trading practices concerning virtual assets, the utilization of undisclosed information, market price manipulation and illicit transactions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-south-korea-to-ask-firms-to-disclose-crypto-holdings-from-2024\"><strong><em>South Korea to ask firms to disclose crypto holdings starting 2024</em></strong></a></p><p><a href=\"https://www.decenter.kr/NewsView/29SA4N1793/GZ03\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a local news report by Decenter, The LEI introduced by Korea Securities Depository and CODE, is a standardized ID given to corporations worldwide participating in financial transactions. It was introduced for the efficient management of financial transaction information after the 2008 financial crisis.</p><p>The Decenter report states that Code's agreement promotes LEI issuance among virtual asset operators. They aim to support businesses with LEIs in reporting and supervising due diligence, both inter-business and for financial institutions and regulatory authorities. Additionally, they plan to comply with the EU's Transfer of Funds Regulation (TFR).</p><p>Koh Chang-seop, Head of the Securities Settlement Division at Korea Securities Depository, reportedly said that starting in December, LEI will replace Foreign Investment Registration Certificate (IRC) for enhanced transparency.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/huobi-lawsuit-hodlnaut-opnx-3ac-asia-express/\"><strong><em>Korea crypto contagion: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T12:47:21.000Z",
    "title": "Worldcoin struggles to find new users willing to scan iris for crypto ",
    "url": "https://cointelegraph.com/news/crypto-worldcoin-struggles-scan-iris",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6eb4f674-0c93-4f43-8fca-cda6cba8a95d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The controversial crypto project’s new sign-ups have dwindled and numbers pale in comparison to the 2 million sign-ups before the launch of the project. </p>\n                    <p><p>The controversial crypto project Worldcoin was launched for the public on July 24, making way for customers to scan their iris at designated locations in 20 countries and receive 25 Worlcoins (WLD) the native token of the project. </p><p>The project debuted on the back of <a href=\"https://cointelegraph.com/news/sam-altman-worldcoin-world-id-two-million-sign-ups\">2 million pre-signups</a> but the interest seems to have faded after the actual launch. On that first day, users seemed keen, with Hong Kong seeing the highest number of signups.  The city offered three designated spots called Orbs, where users; irises are scanned and they're offered a “world ID.” </p><p>According to a <a href=\"https://www.scmp.com/tech/tech-trends/article/3228973/chatgpt-creators-iris-scanning-crypto-project-signs-hundreds-users-hong-kong-amid-controversy?module=live&amp;pgtype=homepage\" target=\"_blank\" rel=\"noopener nofollow\">report </a>published by South China Morning Post, the three designated locations in Hong Kong each saw about 200 signups on the first day, making it the highest number of signups across the 20 countries included in the launch.</p><p>Heatherm Huang, one of the Orb operators in the city said that the total number of sign-ups in Hong Kong on the first day accounted for nearly half of the total amount Worldcoin saw across all of its new markets.</p><p>Based on the data shared by the Orb operator, Hong Kong accounted for nearly 600 signups (200 signups per Orb location). Thus, with 600 sign-ups being nearly half of all the new registration across 20 countries, the total number of estimated signups across all markets comes to about 1000.</p><p>Cointelegraph reached out to Worldcoin to confirm the precise number of signups after the launch of the project, but has not yet received a response.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-confirms-it-is-the-cause-of-mysterious-safe-deployments\"><strong><em>Worldcoin confirms it is the cause of mysterious Safe deployments</em></strong></a></p><p>The stark contrast in the number of sign-ups before and after the launch suggests a lack of enthusiasm. However, the early on-boards also proved controversial as one MIT <a href=\"https://www.technologyreview.com/2022/04/06/1048981/worldcoin-cryptocurrency-biometrics-web3/\" target=\"_blank\" rel=\"noopener nofollow\">report </a>suggested that the developers behind the project attracted the first million using various deceptions, cash handouts and more, especially in developing countries where data laws are not notably strong.</p><p>The project has drawn scrutiny from many well-known names in the crypto community, including <a href=\"https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin\">Ethereum co-founder Vitalik Buterin</a> and Twitter co-founder Jack Dorsey. In its defence, the project has maintained that it doesn’t collect any personal information and can delete the biometric data upon requests from users.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/sam-altman-worldcoin-world-id-two-million-sign-ups&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T12:59:15.000Z",
    "title": "Archax Unveils New Crypto Exchange Tailored for Institutional Players",
    "url": "https://cryptodaily.co.uk/2023/07/archax-unveils-new-crypto-exchange-tailored-for-institutional-players",
    "description": "<p>Archax, a leading global digital asset exchange, broker, and custodian, has unveiled its latest offering: a crypto exchange designed specifically for institutional investors.&nbsp;</p>\n<p>The first FCA-regulated digital securities exchange, broker, and custodian company in the UK, Archax has launched its new exchange for higher end investors.</p>\n<p>This launch marks Archax's endeavour to bridge the gap between the traditional investment realm and the crypto sector. The newly launched Archax crypto exchange is not just another platform. It's crafted for the nuanced needs of professional investors, offering them a seamless and intuitive trading experience.&nbsp;</p>\n<p>One standout feature is its customizable multi-screen interface, developed in collaboration with interop.io and ChartIQ. This interface allows traders to modify their trading environment, ensuring they have all the tools at their fingertips for quick and informed decision-making.&nbsp;</p>\n<p>Graham Rodford, the CEO and co-founder of Archax, stated:</p>\n\n<p>\"Our new crypto exchange is a testament to Archax's commitment to providing a top-tier trading platform for professionals. We've harnessed our deep institutional knowledge, regulatory acumen, cutting-edge tech, and robust partnerships to offer a platform where institutions can confidently and efficiently delve into the digital asset market.\"&nbsp;</p>\n\n<p>Another feature of the Archax exchange is its powerful API connectivity. This ensures that the platform can effortlessly integrate with existing institutional trading systems, allowing clients to weave the exchange into their current setups and optimise their trading operations.&nbsp;</p>\n<p>In response to market demands, the firm has plans to roll out more trading pairs in the upcoming weeks and throughout the year, kicking things off with BTC and ETH against USD pairs. This move is set to bolster the liquidity and trading choices available to institutional players, granting them access to a wider array of digital assets via a reputable platform.&nbsp;</p>\n<p>The new crypto exchange is a perfect complement to Archax's recently introduced insolvency-proof custody service. Together, they form a robust ecosystem catering to institutional and professional users. Clients can now securely store digital assets, traditional securities, and fiat assets, while also leveraging the benefits of the new crypto exchange and OTC service.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:58:13.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:53:49.000Z",
    "title": "AI Surveillance System DETECTOR Aims to Curb Fare Evasion in NYC Subway",
    "url": "https://www.cryptopolitan.com/ai-surveillance-system-detector-nyc/",
    "description": "The New York City Metropolitan Transport Authority (M.T.A.) has embraced cutting-edge AI surveillance technology to combat fare evasion in the subway system. The AI system, named &#8220;DETECTOR,&#8221; developed by Spanish software company AWAAIT, has already been implemented in seven stations across the city. The M.T.A. plans to expand its use to two dozen more stations ... <a title=\"AI Surveillance System DETECTOR Aims to Curb Fare Evasion in NYC Subway\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-surveillance-system-detector-nyc/\" aria-label=\"More on AI Surveillance System DETECTOR Aims to Curb Fare Evasion in NYC Subway\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T13:07:53.000Z",
    "title": "Enjin Coin and Hex Coin Struggle To Stay Relevant, Tradecurve Gains Whale Attention With 150% Pump",
    "url": "https://nulltx.com/enjin-coin-and-hex-coin-struggle-to-stay-relevant-tradecurve-gains-whale-attention-with-150-pump/",
    "description": "The ongoing market riot has left projects like Enjin Coin (ENJ) and Hex Coin (HEX) severely bleeding. All eyes are currently on Tradecurve (TCRV), a new project that has become a sensation in a matter of days. Its ongoing presale is currently the most profitable investment option, and whales are investing millions into it.  &#62;&#62;Register [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T13:05:10.000Z",
    "title": "Binance losing EU Banking Partner Paysafe, while Traders use Avorak AI to mitigate volatility",
    "url": "https://nulltx.com/binance-losing-eu-banking-partner-paysafe-while-traders-use-avorak-ai-to-mitigate-volatility/",
    "description": "The recent events surrounding Binance and Paysafe have emphasized the importance of adaptability and robustness in the industry. While some watchers suggest this could cause significant impact on crypto prices, the recent launch of Avorak AI provides a ray of hope for traders seeking ways to navigate the challenging volatility of cryptocurrencies. Is Binance in [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T13:02:38.000Z",
    "title": "Investor Alert! TOADS Projected To Be Up 450% , Reasons To Buy Now!",
    "url": "https://nulltx.com/investor-alert-toads-projected-to-be-up-450-reasons-to-buy-now/",
    "description": "Attention all investors! If you&#8217;re seeking a golden opportunity for substantial gains, look no further than DigiToads (TOADS). With its impending price surge of 450% in just one month, the time to act is now. TOADS boasts a combination of unique features and robust tokenomics that set it apart from the competition. Don&#8217;t miss out [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T13:01:39.000Z",
    "title": "Tron (TRX), Chainlink (LINK), and Borroe ($ROE) Are Trending This Week – Here’s Why",
    "url": "https://nulltx.com/tron-trx-chainlink-link-and-borroe-roe-are-trending-this-week-heres-why/",
    "description": "Tron’s (TRX) and Chainlink’s (LINK) innovations have led to significant price rallies during the last week. Meanwhile, Borroe’s ($ROE) incredible real-life utility and extraordinary scalability solutions have enabled this hidden gem to sell over 35% of the token’s Beta Stage supply. Let’s explore why top experts suggest Borroe ($ROE) as one of the best crypto [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T12:59:45.000Z",
    "title": "Prime Trust Officially Broke, InQubeta Investors Expecting Superior Yields And Profits After QUBE Launch",
    "url": "https://nulltx.com/prime-trust-officially-broke-inqubeta-investors-expecting-superior-yields-and-profits-after-qube-launch/",
    "description": "In the ever-volatile and rapidly evolving world of cryptocurrencies, fortunes can shift overnight. As Prime Trust, a renowned crypto custodian, finds itself on shaky ground, investors in the promising AI-focused InQubeta (QUBE) project are anticipating superior yields and profits following the official launch of the QUBE token. With Prime Trust owing customers more than $80 [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T12:57:15.000Z",
    "title": "Monero (XMR) and Polkadot (DOT) Fade As This New Promising AI Crypto Rises With Over $1.7M Raised in Presale",
    "url": "https://nulltx.com/monero-xmr-and-polkadot-dot-fade-as-this-new-promising-ai-crypto-rises-with-over-1-7m-raised-in-presale/",
    "description": "In the constantly evolving landscape of cryptocurrency, where volatility is the norm and game-changing innovations appear overnight, new contenders are constantly emerging. This phenomenon is clearly evident in the unprecedented rise of InQubeta (QUBE), a promising AI crypto that has raised over $1.7 million in presale and counting. Meanwhile, established altcoins such as Monero (XMR) [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T12:51:53.000Z",
    "title": "DigiToads Presale Demand Through The Roof, Over $6.4 Million Raised",
    "url": "https://nulltx.com/digitoads-presale-demand-through-the-roof-over-6-4-million-raised/",
    "description": "In the past six months, venture capital funding in crypto has increased rapidly, and cryptos have become a central talking point of the US presidential race. Global adoption will define the coming cycle. Institutional capital and retail flows from ETF products will lift altcoins to entirely new highs. However, the abundance of ERC20 coins on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T13:00:55.000Z",
    "title": "Binance Rolls Out Zero-Fee Stablecoin But Hits Pause Soon After: Here’s Why",
    "url": "https://www.newsbtc.com/binance/binance-rolls-out-zero-fee-stablecoin-but-hits-pause-soon-after-heres-why/",
    "description": "First Digital USD (FDUSD), a newly introduced stablecoin scheduled to make its debut on Binance on Wednesday has now faced a halt due to technical difficulties. A Bumpy Start To The FDUSD Journey The expected listing of FDUSD on Binance was initially set for July 26, 2023. To incentivize traders, Binance planned to offer zero maker fees for all FDUSD trading pairs. However, due to technical issues encountered by the FDUSD pairs&#8217; liquidity providers, the launch was postponed. Related Reading: Binance Pool’s Litecoin Hash Rate Falls 50%: What’s Next? Trading was halted at 09:45 (UTC), and all pending FDUSD orders were canceled, reflecting the exchange&#8217;s commitment to user protection amid these unforeseen circumstances. In response to these technical glitches, Binance rescheduled the FDUSD listing for the same day at 14:00 (UTC). However, the delay caused by the technical issues put a temporary damper on the excitement surrounding the FDUSD launch. First Digital USD: Just Another Stablecoin? First Digital Group, a conglomerate including Hong Kong-based First Digital Trust, a custodian and trust firm, unveiled the plan for the FDUSD stablecoin in June. Backed by FD121, the stablecoin, pegged to the US dollar on a 1:1 ratio, promised to be fully backed by cash and cash equivalents held in regulated financial institutions&#8217; segregated accounts. The reserves are said to be under constant audit and monitoring by independent third parties, assuring investors of the coin&#8217;s stability. Beyond the initial hiccups, the ambition driving the creation of FDUSD is worth noting. The First Digital Group envisages FDUSD to be more than a simple programmable digital asset.  FDUSD is designed to be compatible with Web3 technologies, positioning it to potentially aid in the creation of future solutions. The stablecoin is able to interact with financial smart contracts, escrow services, and insurance protocols without requiring intermediaries. This integration aims to bridge the gap between traditional finance and decentralized technologies in everyday transactions. Despite Binance&#8217;s continuing regulatory challenges, the exchange keeps making headlines for positive developments, such as the listing of the zero-fee stablecoin. Recently, Binance and its CEO Changpeng Zhao, also known as CZ, revealed plans to dismiss the Commodity Futures Trading Commission’s (CFTC) complaint, according to a court filing. Related Reading: Binance Coin (BNB) Price Poised For A Major Breakout – Which Way Will It Go? This move is a reaction to the financial watchdog&#8217;s earlier accusation against the crypto exchange for purportedly breaking derivatives market rules in the United States. Meanwhile, regardless of the few positive developments by the crypto exchange, Binance&#8217;s native token BNB has continued to move in a bearish trend. Over the past 24 hours, the native token has plunged 0.3% with a current trading price of $237.7, at the time of writing. Binance Coin (BNB)’s price is moving sideways on the 4-hour chart. Source: BNB/USDT on TradingView.com Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-26T12:53:31.000Z",
    "title": "2 Upcoming Crypto Coins to Watch Out For",
    "url": "https://www.altcoinbuzz.io/product-release/2-upcoming-crypto-coins-to-watch-out-for/",
    "description": "<p>One of the easiest ways to profit in crypto is to find new projects before they list on exchanges. Top investors are often hunting for worthy projects to get as cheap as possible.  With the bull market around the corner, getting projects on time could be one of your most effective strategies. We recently gave [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/2-upcoming-crypto-coins-to-watch-out-for/\">2 Upcoming Crypto Coins to Watch Out For</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]