[
  {
    "source": "Decrypt",
    "date": "2023-09-20T20:57:02.000Z",
    "title": "Grayscale Investments Applies to Offer Ethereum Futures ETF",
    "url": "https://decrypt.co/198032/grayscale-etf-ethereum-futures-sec-application",
    "description": "The fund, if approved by the Securities and Exchange Commission, would be separate from the firm’s proposed Bitcoin ETF."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-20T20:51:01.000Z",
    "title": "Andreesen-Backed Fintech Eco App ‘Doubles Down’ On Non-Custodial Crypto",
    "url": "https://decrypt.co/198037/andreesen-horowitz-backed-fintech-eco-app-pivots-non-custodial-crypto",
    "description": "The company will slowly fade out its custodial features and focus on Beam, a recently launched non-custodial crypto wallet."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T20:50:11.000Z",
    "title": "Federal Reserve holds rates steady amid inflation concerns; future hikes still possible",
    "url": "https://cryptoslate.com/federal-reserve-holds-rates-steady-amid-inflation-concerns-future-hikes-still-possible/",
    "description": "<p>The Federal Open Market Committee (FOMC) confirmed today that the benchmark interest rates will remain steady at 5.25% to 5.50%. Speaking after the meeting, US Federal Reserve Chairman Jerome Powell, was anticipated by many, especially considering the 525 basis point increase in the policy rate since March 2022. This brings the current rate to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/federal-reserve-holds-rates-steady-amid-inflation-concerns-future-hikes-still-possible/\">Federal Reserve holds rates steady amid inflation concerns; future hikes still possible</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T21:04:38.000Z",
    "title": "Sui Gains Momentum Overnight, and Tron and Domini Fight for Dominance",
    "url": "https://cryptodaily.co.uk/2023/09/sui-gains-momentum-overnight-and-tron-and-domini-fight-for-dominance",
    "description": "Analysts think Sui ($SUI) may have finally broken out of its bearish trajectory after the token surged in the second week of September 2023. In other news, Tron's (TRX) founder aims to purchase FTX's digital assets. Right now, investors say the best crypto to buy is Domini.art ($DOMI), aiming to democratize high-end art ownership. Find out how!"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T20:46:09.000Z",
    "title": "PayPal USD stablecoin to be integrated into Venmo",
    "url": "https://crypto.news/paypal-usd-stablecoin-to-be-integrated-into-venmo/",
    "description": "Venmo, the peer-to-peer payment app, is set to offer PayPal USD (PYUSD), an ERC-20 stablecoin, in the coming weeks. This move integrates PYUSD into the Venmo platform, creating a seamless channel for transferring assets between millions of users. According to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T20:41:10.000Z",
    "title": "Renewable energy milestone opens door for Tesla to resume crypto payments",
    "url": "https://crypto.news/renewable-energy-milestone-opens-door-for-tesla-to-resume-crypto-payments/",
    "description": "According to Bloomberg Intelligence analyst Jamie Coutts, Bitcoin has now passed the renewable energy milestone. This suggests that Tesla could resume accepting Bitcoin as payment, as cited in a 2021 tweet. The backstory on pulling the plug Elon Musk, a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T21:00:19.000Z",
    "title": "Report Says Ethereum Is Trading Well Below Fair Value, What’s The Correct Figure?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-fair-value/",
    "description": "Ethereum’s price may have been dealt a massive blow as a research report on the Ethereum valuation has revealed that the cryptocurrency giant has been trading below its fair price. Ethereum Trading Value Slips A new on-chain research report has delved deep into the fair value of the Ethereum cryptocurrency since its inception, segregating the cryptocurrency’s value into sections and utilizing its trading activities and active addresses to evaluate the network’s worth over the past years.  Related Reading: Is $10,000 Possible For XRP Price? Crypto Analysts Weigh In Lewis Harland, an RxR analyst, revealed in the research report that Ethereum has been trading below fair value by a 27% discount. The analyst arrived at this conclusion after employing the Metcalfe law-centric valuation model which involves comparing active user base on Ethereum’s robust scaling networks and active user adoption to measure the network’s fair value.  Harland explained that Ethereum’s network valuation can be measured and tracked slightly more accurately when the active user base of the blockchain’s scaling networks is integrated into the model. He stated that if the model excludes active user bases, then Ether&#8217;s (ETH) valuation would be trading significantly below its fair value of $275 billion. “Ethereum’s network valuation tracks the updated ML index better when the active user base of Ethereum’s scaling networks is factored into the model than when omitted,&#8221; Harland, stated in the research report. He added that “the updated model, which does factor in these networks, puts ETH’s valuation at $275 billion (current MCAP trading at a 27% discount), assuming no further user growth in perpetuity.” Going by Harland’s research, Ethereum should be trading at around $2,300 with a market cap of $275 billion. However, Ethereum’s price is currently sitting at $1,637 with a market capitalization of $197.62 billion.  Analyst says ETH price is sitting 27% below fair value &#124; Source: ETHUSD on Tradingview.com Ethereum’s Worth Revealed Through Value Layers While exploring the decline in Ethereum’s trading value, RxR disclosed its analysis of Ethereum’s supposed value using value layers. The research firm explained that Ethereum’s commodity value layer can be analyzed through the amount of ETH millions of users utilize to facilitate their crypto transactions daily. It further stated that the annual run rate of the transaction fees is well over $1.6 billion presently. It also described Ethereum’s equity value, stating that “the value of ETH is the present-day value of the sum of all of its future cash flows. To date, over 3.5m ETH ($5.8B) has been burned by EIP-1559.” Related Reading: PayPal’s PYUSD Report Provides Valuable Insight Into The Stablecoin’s Performance So Far Lastly, the research firm represented Ethereum’s network value layer, and the analysis utilized Metcalfe’s law approach to conclude the recent data that revealed that the Ethereum blockchain network was trading below fair value.  Ethereum’s price has been dealing with a series of strong declines that may push the growth of the ecosystem back a few years. The tenacity of the cryptocurrency’s native token Ether (ETH) was tested when it fell to a critical support level of $1,530 earlier in September. However, the cryptocurrency later made a slight recovery which pushed it back to a more stable position. Featured image from Analytics Insight, chart from Tradingview.com"
  }
]