[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T09:00:00.000Z",
    "title": "Central Banks Successfully Test Over 30 CBDC Use Cases, Including Offline Payments",
    "url": "https://www.coindesk.com/policy/2023/06/16/central-banks-successfully-test-more-than-30-cbdc-use-cases-including-offline-payments/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "An API layer could facilitate a wide range of central bank digital currency payment scenarios, a Bank for International Settlements and Bank of England experiment has shown."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-16T08:40:00.000Z",
    "title": "Binance to Quit Netherlands After Failing to Acquire License",
    "url": "https://www.coindesk.com/business/2023/06/16/binance-to-quit-netherlands-after-failing-to-acquire-license/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange's attempt to secure a virtual asset service provider (VASP) license from the Dutch regulator was unsuccessful."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T08:55:00.000Z",
    "title": "Colombia’s Central Bank Announces Ripple Partnership",
    "url": "https://cryptodaily.co.uk/2023/06/colombia-s-central-bank-announces-ripple-partnership",
    "description": "<p>The Banco de la Republica, Colombia&rsquo;s Central Bank, has announced a partnership with Ripple as it looks to explore the use of blockchain technology in the country.&nbsp;</p>\n<p>Colombia will conduct a pilot project to test Ripple&rsquo;s CBDC platform for its high-value payments system. The country already uses Ripple&rsquo;s technology for land distribution efforts being undertaken.&nbsp;</p>\nThe Banco De La Republica And Ripple Partnership&nbsp;\n<p>Ripple has stated that Colombia&rsquo;s Central Bank, in partnership with the Ministry for the Information and Communications Technologies (MinTIC), will conduct a pilot for Ripples CBDC (central bank digital currency) platform to help improve its high-value payments system. The initiative is part of a larger blockchain experimentation phase being conducted by the Ministry for the Information and Communications Technologies. According to Ripple, its CBDC platform will be experimented with and tested in a controlled environment without the risk of compromising public resources. In a statement, the Minister of Information Technologies and Communications of Colombia said,&nbsp;</p>\n\n<p>&ldquo;Potential efficiencies can be evaluated through the results obtained in the development of a solution with blockchain technology, which manages to improve and complement the processes in the entities in a safe and efficient way.&rdquo;</p>\n\n<p>The vice president of Central Bank Engagements and CBDCs at Ripple, James Wallis, added that he believed the project could clear a path for significant transformative advancements regarding the use of blockchain technology in the public sector.&nbsp;</p>\n\n<p>&ldquo;By harnessing the power of the CBDC Platform, based upon the XRPL, this project will pave the way for transformative advancements in the utilization of blockchain technology within the public sector.&rdquo;</p>\n\n<p>However, the announcement did not disclose when Colombia plans to launch its own central bank digital currency.&nbsp;</p>\nCBDCs Picking Up Steam&nbsp;\n<p>In simple terms, a CBDC is a digital version of a country&rsquo;s fiat currency, such as the Euro and US Dollar, or in Colombia&rsquo;s case, the Colombian Peso. CBDCs are backed by the country&rsquo;s central bank and are digital assets different from cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH). This is because CBDCs are controlled by a centralized entity, the central bank.&nbsp;</p>\n<p>According to the Atlantic Council&rsquo;s central bank digital currency tracker, a total of 120 countries are actively exploring a CBDC. Out of this, 11 countries, including the Bahamas, Jamaica, Antigua and Barbuda, Grenada, and St. Lucia, have launched their own CBDC. A further 18 countries are in the pilot stage. These include India, China, Saudi Arabia, Russia, Australia, Iran, and several others. A further 32 countries have CBDCs in the development stage. These include the United States of America, Brazil, Germany, Spain, the United Kingdom, Norway, Finland, Turkey, Canada, Bhutan, Bahrain, Indonesia, and others.&nbsp;</p>\nColombia and Ripple Have Partnered Before&nbsp;\n<p>The partnership between Colombia and Ripple is not the first time the two have partnered together. Last year, the Colombian government, in partnership with Ripple Labs, launched an initiative to rectify the government&rsquo;s land distribution efforts. The project was backed by Peersyst Technology, a blockchain development company, and Ripple and will permanently store and authenticate property titles on Ripple&rsquo;s public blockchain. This would help eliminate cumbersome bureaucratic procedures and make land distribution more equal in the country.&nbsp;</p>\n<p>Ripple was launched to help banks and financial institutions move funds around quickly without incurring extra fees. Currently, XRP is the world&rsquo;s 6th largest cryptocurrency.&nbsp;</p>\nColombia&rsquo;s Pro-Crypto Stance&nbsp;\n<p>Colombia has adopted a pro-crypto stance since electing Gustavo Petro as president in August 2022. The new president is extremely pro-Bitcoin and has spoken strongly in favor of the cryptocurrency during speeches. He has also taken a proactive approach towards cryptocurrencies in general and has hinted that he truly believes in the power of digital assets. President Petro has made several pro-Bitcoin statements in the past.&nbsp;</p>\n\n<p>&ldquo;Bitcoin removes the power of issuance from the states and the seigniorage of the currency from the banks. It is a community currency that is based on the trust of those who carry out transactions with it. Since it is based on the blockchain, trust is measured and grows, hence its strength.&rdquo;</p>\n\n<p>No surprise then that Colombia has taken several initiatives towards adopting cryptocurrencies and blockchain technology. Right after his election, the government of Colombia launched its digital currency initiative and confirmed its plans for a digital currency. The initiative would be developed in partnership with the country&rsquo;s central bank. It would make Colombia part of an exclusive group of Latin American countries, such as Venezuela and El Salvador, adopting blockchain technology.&nbsp;</p>\n<p>In March 2023, Binance announced that it would be launching its prepaid crypto card in Colombia. This would mark the third country in Latin America where Binance debuted its crypto card after Argentina and Brazil. According to Binance, its new crypto card would allow holders to pay with crypto instead of using standard debit or credit cards.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-16T09:00:00.000Z",
    "title": "InQubeta aims to redefine presale fundraising as crypto investors participate",
    "url": "https://crypto.news/inqubeta-aims-to-redefine-presale-fundraising-as-crypto-investors-participate/",
    "description": "InQubeta aims to redefine crypto presale in the ongoing sale of QUBE tokens. The project merges AI and the blockchain"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T09:06:05.000Z",
    "title": "Shiba Inu’s Testnet Blockchain ‘Puppynet’ Surpasses 20 Million Transactions, Signaling Massive Setup For Price Explosion When Shibarium Launches",
    "url": "https://www.crypto-news-flash.com/shiba-inus-testnet-blockchain-puppynet-surpasses-20-million-transactions-signaling-massive-setup-for-price-explosion-when-shibarium-launches/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-testnet-blockchain-puppynet-surpasses-20-million-transactions-signaling-massive-setup-for-price-explosion-when-shibarium-launches",
    "description": "Puppynet has celebrated crossing 20 million transactions, signaling a bullish setup for SHIB after the launch of Shibarium. Large whale activity is evident with more than $10 million worth of SHIB bought by a single whale on Tuesday. The Shiba Inu Army is celebrating a minor victory in the form of the Shiba Inu testnet [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T08:52:41.000Z",
    "title": "Cardano Secures EMURGO Funding to Accelerate Web3 Development in Billion Dollar Market",
    "url": "https://www.crypto-news-flash.com/cardano-secures-emurgo-funding-to-accelerate-web3-development-in-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-secures-emurgo-funding-to-accelerate-web3-development-in-billion-dollar-market",
    "description": "Cardano-based Maestro protocol has tapped new funding from EMURGO. The broad-based collaborations is aimed at boosting the growth of the Web3.0 ecosystem. Cardano-based platform Maestro has inked a strategic partnership with venture capital firm EMURGO leading to an investment deal.  The fund will go into providing support and resources for Maestro to facilitate the continued [...]"
  }
]