[
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T04:48:47.000Z",
    "title": "Lobby group to dispel crypto mining misconceptions in DC, says founder",
    "url": "https://cointelegraph.com/news/crypto-mining-lobby-digital-energy-council-launched-in-united-states",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/066367ef-01d5-4292-9598-1e10111a23c6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto mining industry is getting a dedicated lobby group aimed at opening up discussions with lawmakers in Washington D.C.</p>\n                    <p><p>The United States crypto mining industry is getting a new lobbying group, with one of its biggest goals to dispel misconceptions about its sustainability from policymakers. </p><p>Launched on Aug. 15, the Digital Energy Council said its <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\">aim is to advance policies</a> that encourage the growth of digital asset mining and energy development.</p><p>DEC founder and president Thomas Mapes told Cointelegraph it was “long overdue” for digital asset miners to have a unified voice in Washington D.C.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Its official  first member association solely focused on the intersection of digital asset mining and energy ⚡️ policy at the federal level, look forward to working with digital asset and energy leaders check it out: <a href=\"https://t.co/kBFRkXHTNy\">https://t.co/kBFRkXHTNy</a> <a href=\"https://t.co/kzNhtfxYZi\">https://t.co/kzNhtfxYZi</a></p>&mdash; Tom Mapes (@tommapes88) <a href=\"https://twitter.com/tommapes88/status/1691609288953725032?ref_src=twsrc%5Etfw\">August 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Mapes previously served as the director of energy at the Chamber of Digital Commerce. Prior to that, he was chief of staff at the U.S. Department of Energy’s Office of International Affairs. </p><p>Mapes said it was during his time at the Energy Department that he began to see crypto mining firms as an essential part of the energy ecosystem — providing energy to the grid during times of demand or purchasing excess energy that would otherwise go unused — among other benefits. </p><p>“I see them as energy companies in the future,” he said, adding:</p><blockquote>“I see energy companies, utility companies, power providers — the big majors — all taking a look at this new technology and figuring out ways they can get involved in this.”</blockquote><p>However, Mapes expressed that many lawmakers have yet to see the industry in the same light. “Within the past year or so, you have pieces of legislation dropping against the industry,” he said.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/futurama-reboot-takes-aim-at-bitcoin-miners\"><strong><em>Futurama’s latest reboot takes aim at Bitcoin miners</em></strong></a></p><p>In March, the chair of the Senate Environment and Public Works Submittee <a href=\"https://cointelegraph.com/news/senators-renew-call-for-epa-investigation-of-crypto-mining-emissions-data\">announced the reintroduction of legislation</a> accusing crypto miners of “sucking megawatt after megawatt from our public grids” and emitting huge amounts of greenhouse gasses, “just so they can make a buck for themselves.”</p><p>Mapes cited Biden's <a href=\"https://cointelegraph.com/news/is-biden-s-controversial-bitcoin-mining-tax-dead-or-set-to-rise-from-the-ashes\">proposed 30% digital asset mining excise tax</a> and the White House’s crypto mining environmental impact report as other examples. </p><p>Mapes confirmed the association has several founding members which include crypto mining and energy firms — some of which are publicly listed companies. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Excited to see the launch of the Digital Energy Council, the first association focused on the intersection of energy security and digital asset mining. Their mission to promote responsible energy practices, grid resilience, and economic growth through crypto mining is crucial for</p>&mdash; Daniel Speiss (@DanielSpeiss) <a href=\"https://twitter.com/DanielSpeiss/status/1691555843223773631?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The association’s membership and its lobbying efforts will be solely focused on the U.S. for now, he added. </p><p><strong><em>Asia Express: <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">China’s risky Bitcoin court decision, is Huobi in trouble or not?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T05:00:00.000Z",
    "title": "A pro-crypto president will catalyze innovation, supporting projects like Borroe",
    "url": "https://crypto.news/a-pro-crypto-president-will-catalyze-innovation-supporting-projects-like-borroe/",
    "description": "A pro-crypto president in the United States will be a massive boost for the industry and may catalyze innovation, supporting tech-led projects like Borroe"
  }
]