[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-16T07:00:49.000Z",
    "title": "Coinbase vs. SEC: A Legal Showdown Shaping Crypto’s Future",
    "url": "https://www.cryptoglobe.com/latest/2023/07/coinbase-vs-sec-a-legal-showdown-shaping-cryptos-future/",
    "description": "The crypto industry is on the edge of its seat as Coinbase, one of the oldest and most recognized companies in the sector, faces off against the U.S. Securities and Exchange Commission (SEC) in a legal battle that could set a precedent for future regulation. The crux of the dispute revolves around the classification of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-16T07:00:00.000Z",
    "title": "Ripple CEO Claims SEC Case May Take Years To Appeal $XRP",
    "url": "https://cryptodaily.co.uk/2023/07/ripple-ceo-claims-sec-case-may-take-years-to-appeal-xrp",
    "description": "<p class=\"md-end-block md-p\">Ripple CEO Brad Garlinghouse recently made statements which predicted a long wait before the U.S. Securities and Exchange Commission (SEC) can file an appeal following Judge Torres' ruling on the Ripple case.</p>\n<p class=\"md-end-block md-p\">According to an interview from Garlinghouse with Bloomberg on July 15, the executive estimates that the SEC's opportunity for appeal could take \"years.\" No other precise detail in terms of this claim was disclosed, however.</p>\nJudge's Ruling on XRP\n<p class=\"md-end-block md-p\">On July 13, Judge Torres partially ruled in favor of Ripple Labs in a lawsuit initiated by the SEC in 2020. The judgement states that the XRP token, with respect to retail sales on digital asset exchanges, is not a security. However, Judge Torres ruled that XRP qualifies as a security when sold to institutional investors, in accordance with the criteria of the Howey Test.</p>\n<p class=\"md-end-block md-p\">Garlinghouse emphasized that the ruling about institutional sales represents \"the smallest piece\" of the lawsuit. He believes that if the SEC decides to appeal the ruling regarding retail sales, it would only \"further solidify\" Judge Torres' decision.</p>\n<p class=\"md-end-block md-p\">Garlinghouse said:</p>\n\n<p class=\"md-end-block md-p\">\"As a matter of law, the law of the land right now is that XRP is not a security. Until there is an opportunity for the SEC to file an appeal, which would take years, frankly, we are very optimistic.&rdquo;</p>\n\nSEC Accused of Bullying Tactics\n<p class=\"md-end-block md-p\">Garlinghouse also took the opportunity to criticize the SEC, alleging it acted as a \"bully\" by targeting \"weak players\" in the crypto industry incapable of mounting a strong defense. He indicated that the Ripple lawsuit marked the first defeat for the SEC in a \"crypto case.\"</p>\n<p class=\"md-end-block md-p\">The Ripple CEO noted the SEC's lawsuit initially led to uncertainty among U.S. crypto exchanges, causing a wait-and-see attitude due to market confusion. According to Garlinghouse, the SEC deliberately fostered this confusion to increase its power, thereby stifling innovation in the U.S.</p>\nImpact on the Crypto Market\n<p class=\"md-end-block md-p\">Garlinghouse argued that the SEC's power play and political manoeuvring have overshadowed sound policy and clear regulatory guidelines. This stance, he says, has hampered U.S. entrepreneurs and investors from fully participating in the crypto market and embracing blockchain technologies.</p>\n<p class=\"md-end-block md-p\">While the recent performance of XRP may be impacted by these developments, the broader implications revolve around regulatory clarity in the crypto industry, and this is something that requires closer attention in terms of how it evolves and becomes more complex with each new case.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T07:08:26.000Z",
    "title": "How Cybercrime Gets An Upgrade With Generative AI Tools for  Sophisticated Attacks",
    "url": "https://www.cryptopolitan.com/cybercrime-gets-upgrade-generative-ai-tools/",
    "description": "A cybersecurity firm has made a concerning discovery – a generative AI tool called WormGPT is being sold to criminals. Another malicious generative AI tool called PoisonGPT has also emerged, designed to intentionally spread fake news online. As the use of generative AI technology becomes more widespread, law enforcement agencies are increasingly worried about its ... <a title=\"How Cybercrime Gets An Upgrade With Generative AI Tools for  Sophisticated Attacks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cybercrime-gets-upgrade-generative-ai-tools/\" aria-label=\"More on How Cybercrime Gets An Upgrade With Generative AI Tools for  Sophisticated Attacks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T06:55:26.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T06:43:08.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-16T07:01:12.000Z",
    "title": "Gorilla Funds CEO explained how to make NFTs and web3 mainstream",
    "url": "https://crypto.news/gorilla-funds-ceo-explained-how-to-make-nfts-and-web3-mainstream/",
    "description": "The widespread adoption of NFTs could be on the horizon, but we need simple solutions for users, Gorilla Funds&#8217; Jakob Sievers tells crypto.news at NFT Show Europe. Web3 is already poised to fundamentally transform the way we operate, according to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-16T06:45:10.000Z",
    "title": "ETHBarcelona: a crypto conference that is also a party",
    "url": "https://crypto.news/ethbarcelona-a-crypto-conference-that-is-also-a-party/",
    "description": "ETHBarcelona, one of the year&#8217;s most anticipated crypto conferences, just concluded, having transformed the typically staid and formal atmosphere of such gatherings into a pulsating, exuberant fiesta that rivaled the best Barcelona parties. While maintaining the gravitas of a serious&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-16T06:52:43.000Z",
    "title": "Will Ripple’s Victory Against the SEC Lead to an Altcoin Bull Run?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/will-ripples-victory-against-the-sec-lead-to-an-altcoin-bull-run/",
    "description": "<p>“XRP is not a security&#8221;. Yes Ripple has won the most historic case against SEC. I have not said this enough earlier. But, I always believed that when $XRP is declared not a security, it will mark the start of the next big bull run.  In the last 24 hours, crypto markets went absolutely crazy! XRP [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/will-ripples-victory-against-the-sec-lead-to-an-altcoin-bull-run/\">Will Ripple’s Victory Against the SEC Lead to an Altcoin Bull Run?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-16T07:04:31.000Z",
    "title": "Top Trader Predicts Strong Surge for Bitcoin (BTC) to New 2023 Highs – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/07/16/top-trader-predicts-strong-surge-for-bitcoin-btc-to-new-2023-highs-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Bitcoin-Hitting-1.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who nailed the end of Bitcoin&#8217;s (BTC) 2021 bull market is predicting a big rally for the crypto king, but not before a move to the downside. Pseudonymous analyst Pentoshi tells his 697,700 Twitter followers that Bitcoin is now likely headed to $28,000 after failing to stay above $31,000. &#8220;If BTC falls back [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/16/top-trader-predicts-strong-surge-for-bitcoin-btc-to-new-2023-highs-but-theres-a-catch/\">Top Trader Predicts Strong Surge for Bitcoin (BTC) to New 2023 Highs – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]