[
  {
    "source": "CoinDesk",
    "date": "2024-01-23T18:54:13.000Z",
    "title": "'Lord, You Told Me to Do This': Pastor Defends Taking $1.3M From Failed Crypto ",
    "url": "https://www.coindesk.com/policy/2024/01/23/lord-you-told-me-to-do-this-pastor-defends-taking-13m-from-failed-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Eli Regalado said God told him to start the INDXcoin project and he's waiting on further guidance after Colorado securities officials accused him of running a crypto scam."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T19:01:33.000Z",
    "title": " How it all went down: Web3 protocol mass phishing campaign timeline ",
    "url": "https://cointelegraph.com/news/how-it-all-went-down-web3-protocol-mass-phishing-campaign-timeline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNGZhZTFkNzAtZDEwZi00YWQ4LTg3ZDMtNGFhYzY0M2I1ODIxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Multiple Web3 protocols and crypto websites become the victim of a coordinated email hacking campaign, including Cointelegraph itself.</p>\n                    <p><p data-ct-non-breakable=\"true\">On Jan. 23. the users of multiple Web3 protocols were hit with a mass phishing campaign by scammers. Over $580,000 worth of crypto has been lost in the attack so far, which used emails sent from the official email addresses of Web3 protocols WalletConnect, TokenTerminal, Social.Fi, and De.Fi, as well as Cointelegraph.</p><p data-ct-non-breakable=\"true\">Here is a timeline of what happened:</p><p data-ct-non-breakable=\"true\"><strong>10:03 am UTC: </strong>WalletConnect announces that its users have been receiving malicious emails. “We’re aware of an email that appears to have been sent from an email address linked to WalletConnect prompting recipients to open a link to be able to claim an airdrop,” the announcement states. “We can confirm that this email was not issued directly from WalletConnect or any WalletConnect affiliates, and that the link appears to lead to a malicious site.” </p><p><a href=\"https://cointelegraph.com/news/how-it-all-went-down-web3-protocol-mass-phishing-campaign-timeline\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T19:00:00.000Z",
    "title": " US Air Force enters the quantum logistics era with $2.5M software deal ",
    "url": "https://cointelegraph.com/news/us-air-force-enters-quantum-computing-logistics-era-2-5-million-software",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjFjOGVmNjctMWYyOC00MGI2LWEwZGEtZGE4MjMyYWNjZjdiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>This first-of-its-kind partnership comes as part of the U.S. Air Force’s commitment to expand its quantum computing operations.</p>\n                    <p><p>The United States Air Force recently inked its first-ever deal for operational-level quantum computing software, marking a new era in U.S. military logistics.</p><p>Purdue spinout Quantum Research Science (QRS) is the contract recipient, <a href=\"https://www.airandspaceforces.com/new-quantum-software-usaf-supply-chain/\" target=\"_blank\" rel=\"noopener nofollow\">earning</a> $2.5 million to build and support quantum computing software capable of handling the Air Force’s global logistics.</p><p>Currently, U.S. military forces organize and manage supply operations the old-fashioned way: using classical binary computers. But, when compared to their futuristic quantum counterparts, binary computers are an ill fit for the problem.</p><p><a href=\"https://cointelegraph.com/news/us-air-force-enters-quantum-computing-logistics-era-2-5-million-software\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T18:58:04.000Z",
    "title": " An Ethereum ETF is coming sooner than you expect ",
    "url": "https://cointelegraph.com/news/ethereum-etf-coming-sooner-than-you-expect",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTMxOTM1MTUtOWM4Zi00NjQ4LWE5OWQtZjZjN2RlNmRlOTgxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin ETFs were delayed because of politics. Now that we have clarity — along with seven deadlines between May and August — Ethereum ETFs aren't far away.</p>\n                    <p><p>We finally have a Bitcoin spot ETF — an event few of us thought we would see in our careers — the industry has now turned to the approval of an Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) spot ETF as its next target. Those gearing up for another decade of juicy headlines, though, will be disappointed. </p><p>The approval of an ETH spot ETF is now not only certain, but imminent. While the United States Securities and Exchange Commission was able to spout nonsense for over 10 years in its various denials of its BTC equivalent, the watchdog can no longer hide behind diffuse objections to what is a patently clear commodity ETP filing.</p><p>Indeed, as was observed by Commissioner Hester Peirce in her damning <a href=\"https://www.sec.gov/news/statement/peirce-statement-spot-bitcoin-011023\" target=\"_blank\" rel=\"noopener nofollow\">indictment</a> of the SEC’s conduct over this approval published on Jan. 10, the denials of these applications never made sense.</p><p><a href=\"https://cointelegraph.com/news/ethereum-etf-coming-sooner-than-you-expect\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T18:40:19.000Z",
    "title": " FINRA finds violations in 70% of crypto asset public communications reviewed ",
    "url": "https://cointelegraph.com/news/finra-violations-crypto-asset-communications",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNWRiNTdjZWYtNzljZC00MzkyLWJlOGItMDg4ZDZkZjgzY2Q3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The U.S. regulator launched the review on crypto-related public communications following the collapse of FTX in November 2022.</p>\n                    <p><p data-ct-non-breakable=\"true\">The Financial Industry Regulatory Authority (FINRA) reported that roughly 70% of crypto-related communications from a survey contained “false, exaggerated, promissory, unwarranted or misleading” claims or otherwise violated guidelines on public communications.</p><p>In a report released on Jan. 23, FINRA <a href=\"https://www.finra.org/rules-guidance/guidance/targeted-examination-letters/sweep-update-jan2024\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it reviewed more than 500 crypto asset-related retail communications starting in November 2022. According to the regulator, it identified more than 70% of the reviewed communications that had “potential substantive violations” of its rules on communications with the public.</p><p>“With the growth in this market and increased interest in crypto assets, the potential harm caused by problematic communications has also increased,” <a href=\"https://www.businesswire.com/news/home/20240123556697/en/FINRA-Publishes-Crypto-Asset-Communications-Sweep-Update\" target=\"_blank\" rel=\"noopener nofollow\">said</a> FINRA senior director Ira Gluck. “In order to have enough information to evaluate a crypto asset investment or service, communications need to clearly describe its risks and features.”</p><p><a href=\"https://cointelegraph.com/news/finra-violations-crypto-asset-communications\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-23T18:55:06.000Z",
    "title": "US lawmaker probing Meta’s involvement with digital assets, blockchain tech",
    "url": "https://cryptoslate.com/us-lawmaker-probing-metas-involvement-with-digital-assets-blockchain-tech/",
    "description": "<p>Congresswoman Maxine Waters, ranking member of the Financial Services Committee, has initiated an investigation into Meta&#8217;s involvement with digital assets over financial stability concerns. Waters wrote a letter to top Meta executives Mark Zuckerberg and Javier Olivan on Jan. 22, highlighting a series of trademark applications that suggest a potential expansion into digital currency and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/us-lawmaker-probing-metas-involvement-with-digital-assets-blockchain-tech/\">US lawmaker probing Meta&#8217;s involvement with digital assets, blockchain tech</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-23T18:43:56.000Z",
    "title": "Why Cryptocurrency Payments Are Increasingly Popular for Businesses",
    "url": "https://cryptodaily.co.uk/2024/01/why-cryptocurrency-payments-are-increasingly-popular-for-businesses",
    "description": "Just a decade ago, cryptocurrency payments were only accepted by a handful of companies. Microsoft was one of the first major retailers to start accepting Bitcoin payments back in 2014."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-23T18:57:56.000Z",
    "title": "“Social control” is added to definition of currency by Federal Reserve - Bitcoin anyone?",
    "url": "https://cryptodaily.co.uk/2024/01/social-control-is-added-to-definition-of-currency-by-federal-reserve-bitcoin-anyone",
    "description": "As the world’s economies groan under the weight of yet more debt piling up on more debt, the Federal Reserve has added the attribute of ‘social control’ to the definition of money. Will the world’s citizens be stopped from buying bitcoin?"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T18:51:42.000Z",
    "title": "Donald Trump discusses his opinions about CBDCs",
    "url": "https://www.cryptopolitan.com/donald-trump-discusses-opinions-about-cbdcs/",
    "description": "In recent developments, former President Donald Trump has revisited the topic of central bank digital currencies (CBDCs), crediting Vivek Ramaswamy, a former Republican presidential candidate, for bringing attention to the matter. During a rally in Laconia, New Hampshire, on January 22, Trump acknowledged Ramaswamy as the sole presidential candidate with a crypto framework in his [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T18:42:44.000Z",
    "title": "Bitcoin ETFs amass Over 100,000 BTC in assets under management",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-amass-over-100000-btc/",
    "description": "Nine new spot Bitcoin ETFs have collectively accumulated more than 100,000 BTC, valued at approximately $4 billion in assets under management.&#160; This achievement underscores the growing interest among investors in gaining exposure to Bitcoin through these exchange-traded funds. Leading ETFs and their holdings Among the nine newly launched Bitcoin ETFs, BlackRock&#8217;s IBIT stands out as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T18:42:21.000Z",
    "title": "Bitcoin slides below $39,000 amid market selloff",
    "url": "https://www.cryptopolitan.com/bitcoin-slides-below-39000-market-selloff/",
    "description": "Bitcoin experienced a decline, dropping below $39,000 early Tuesday morning, influenced by the aftermath of ETF share selloffs. As of the latest update, the cryptocurrency was priced at $38,927, reflecting a 4.3% decrease from the previous day and a 9% decline from the week prior, according to CoinGecko. Bitcoin experiences a significant decline This downturn [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T18:41:15.000Z",
    "title": "Coinbase to address Ethereum client diversity woes",
    "url": "https://crypto.news/coinbase-to-address-ethereum-client-diversity-woes/",
    "description": "Cryptocurrency exchange Coinbase has announced plans to diversify its Ethereum execution client infrastructure."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T19:00:12.000Z",
    "title": "Bitcoin Recovery: This Massive $500 Billion Investment Could Send Price Above $50,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-500-investment-50000/",
    "description": "Previous speculation has resurfaced regarding one of the largest potential Bitcoin buy-ins in the history of cryptocurrency. According to crypto analyst Justin Verrengia, there are indications that Saudi Arabia and Qatar may be gearing up for an enormous Bitcoin purchase, with an official announcement anticipated in the coming week.  Saudi Arabia, Qatar Rumored To Purchase 1 Million BTC In a recent video published on X (formerly Twitter), Verrengia, the host of the popular crypto channel Crypto News Alert spoke on the recent rumors sparked by crypto analyst Mark Keiser regarding a potential large-scale Bitcoin purchase by Middle Eastern country Saudi Arabia and sovereign state Qatar.  Related Reading: JP Morgan Reveals Likelihood Of Spot Ethereum ETFs Getting Approved The crypto analyst disclosed that both governments are potentially considering purchasing about 1 million Bitcoins valued at around $500 billion. Verrengia compared the large-scale buy-in with the 1.1 million BTC held in the wallet address owned by pseudonymous Bitcoin creator Satoshi Nakamoto. He hinted that Saudi Arabia and Qatar may be planning to purchase this staggering sum of Bitcoin using their sovereign wealth funds.  In his video, Verrengia showcased several X posts from Bitcoin maximalist, Mark Keiser, who has been spreading speculations about the possibility of a large-scale Bitcoin purchase by Saudi Arabia and Qatar since 2023.  Keiser suggested in his posts that the potential 1 million BTC investment by these two governments could make asset management company BlackRock and crypto intelligence company Microstrategy “look like peanuts” in comparison.  The crypto analyst also disclosed that Saudi Arabia may be expanding its interest toward digital currencies. This shift can be seen in the recent partnership between the largest oil company in Saudi Arabia, Saudi Aramco, and Japanese financial service, SBI Holdings. Verrengia has heralded this movement as “oil money entering Bitcoin.”  BTC price falls to $38,000 &#124; Source: BTCUSD on Tradingview.com Bitcoin Price Sees Potential Rise Above $50,000 In his video, Verrengia also shared a post by Keiser, who predicted a $100,000 god candle if Saudi Arabia and Qatar purchase the 1 million BTC. A god candle here suggests a unique price pattern where the price of Bitcoin shoots upward by 100%, pushing it to new all-time highs.  Related Reading: How To Buy, Sell, And Trade Tokens on The Polygon Network Presently, the price of Bitcoin is trading around $38,966.81, reflecting a 9.01% decrease in the past seven days, according to CoinMarketCap. A purchase of 1 million BTC would represent a substantial chunk of the total BTC supply, effectively attracting the attention of institutional investors. This could potentially trigger a Fear of Missing Out (FOMO), driving demand for Bitcoin through the roof and sending Bitcoin’s price above $50,000.  In 2023, the hype surrounding the approval of Spot Bitcoin ETFs pushed Bitcoin’s price to a record high above $49,000. A similar result to the coveted $50,000 price mark could be attained if Saudi Arabia and Qatar purchase the rumored 1 million BTC. Featured image from Reuters, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T18:41:13.000Z",
    "title": "Bitcoin’s ETF-Induced Surge Faces Downside Risks, Experts Warn",
    "url": "https://www.crypto-news-flash.com/bitcoins-etf-induced-surge-faces-downside-risks-experts-warn/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-etf-induced-surge-faces-downside-risks-experts-warn",
    "description": "<img width=\"1812\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.jpg 1812w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1536x1017.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-150x99.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-450x298.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1200x795.jpg 1200w\" sizes=\"(max-width: 1812px) 100vw, 1812px\" />With the spot Bitcoin ETF hype gradually declining from the crypto industry, crypto experts are convinced a Bitcoin price correction is more likely to happen before a pre-halving rally materializes. Bitcoin dominance has already formed a reversal pattern as more investors double down on the altcoin market in anticipation of an altseason in the near [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T18:40:08.000Z",
    "title": "Crypto Heavyweight Challenges SEC: Dare to Reject XRP ETF, Says Dizer Capital Founder",
    "url": "https://www.crypto-news-flash.com/crypto-heavyweight-challenges-sec-dare-to-reject-xrp-etf-says-dizer-capital-founder/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-heavyweight-challenges-sec-dare-to-reject-xrp-etf-says-dizer-capital-founder",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Market players urge companies to file for an altcoin-based Exchange-traded fund. Ripple’s co-founder maintains that an altcoin ETF will eventually gain approval. Market sentiments have been mixed since the approval of a handful of ETFs. While some Bitcoiners are excited about the future, other market observers are anticipating the approval of an altcoin-based ETF. Speaking [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-23T19:05:58.000Z",
    "title": "Pantera Capital Says Current Crypto Bull Run ‘Remarkably Different’ From 2021 – Here’s Why",
    "url": "https://dailyhodl.com/2024/01/23/pantera-capital-says-current-crypto-bull-run-remarkably-different-from-2021-heres-why/",
    "description": "<img width=\"1024\" height=\"574\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg 1456w, https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg?resize=300,168 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg?resize=768,430 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg?resize=1024,574 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg?resize=750,420 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Early-Stages-of-Bull.jpg?resize=1140,639 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An American hedge fund and investment firm that specializes in digital assets says the current crypto bull market is unlike the bull run from three years ago. In a new blog post, Pantera Capital liquid strategies portfolio manager Cosmo Jiang and head of content Erik Lowe say that 2021&#8217;s bull run was in part driven by &#8220;speculative [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/23/pantera-capital-says-current-crypto-bull-run-remarkably-different-from-2021-heres-why/\">Pantera Capital Says Current Crypto Bull Run ‘Remarkably Different’ From 2021 – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]