[
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T19:00:50.000Z",
    "title": "Bitcoin’s breakup with gold may be a sign of crypto’s emerging maturity",
    "url": "https://cryptoslate.com/bitcoins-breakup-with-gold-may-be-a-sign-of-cryptos-emerging-maturity/",
    "description": "<p>The U.S. economic landscape has been a significant determinant of investor sentiment. The latest U.S. GDP report, which exceeded market expectations, has left investors hypersensitive to moves and decisions coming from the U.S. government. The market was bracing for a weaker economic performance, but the stronger-than-anticipated GDP figures have caused ripples across various asset classes. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-breakup-with-gold-may-be-a-sign-of-cryptos-emerging-maturity/\">Bitcoin’s breakup with gold may be a sign of crypto&#8217;s emerging maturity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T18:50:53.000Z",
    "title": "South Korea passes new crypto legislation focusing on investor protections",
    "url": "https://cryptoslate.com/south-korea-passes-crypto-legislation-focusing-on-investor-protection-rules/",
    "description": "<p>The South Korean National Assembly passed the Virtual Asset User Protection Act on June 30 during a plenary session, local media SBS reported. The legislation combines 19 different crypto-related bills that aim to establish a regulatory framework for the industry and define digital assets that are securities. However, it primarily focuses on investor protection amid [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/south-korea-passes-crypto-legislation-focusing-on-investor-protection-rules/\">South Korea passes new crypto legislation focusing on investor protections</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T18:45:00.000Z",
    "title": "Blockchain Visionary and Qmall Founder Mykola Udianskyi  Honored as Investment Persona of the Year at World Investment Congress Awards",
    "url": "https://cryptodaily.co.uk/2023/06/blockchain-visionary-and-qmall-founder-mykola-udianskyi-honored-as-investment-persona-of-the-year-at-world-investment-congress-awards",
    "description": "<p>On May 26, 2023, during the annual Cannes Film Festival, the World Investment Congress Awards ceremony took place. The winner of the Investment Persona Congress Awards was Ukrainian IT businessman Mykola Udianskyi.&nbsp;</p>\n<p>The award ceremony for the Investment Congress Awards 2023 was an unforgettable night dedicated to the best and brightest representatives of the investment industry. At the gala dinner, led by event organizer Anna Stukkert and Investment Congress President Thomas Miss, companies, funds, platforms, brokers, consultants, the fashion industry, PR and media outlets that made a positive contribution to the investment industry were recognized.</p>\n<p>One of the most anticipated parts of the evening was the announcement of the Investment Persona Congress Awards. This year, the winner was Mykola Udianskyi, a renowned Ukrainian entrepreneur in the field of information technology and technology, a scientist, and philanthropist. Mr. Udianskyi was recognized for his contributions to blockchain and cryptography, as well as his charitable activities.</p>\n\n<p>&ldquo;The 'Person of the Year' award according to the Congress Awards 2023 goes to Mykola Udianskyi, who is a visionary Ukrainian technology entrepreneur,&rdquo; commented Thomas Miss. \"Mykola is the president of the EHOLD Group with 10 offices in 9 countries. EHOLD employs over 500 people serving a user base exceeding 10 million users in an impressive project portfolio.He is also the founder of the Qmall exchange, which is a Ukrainian market phenomenon. Despite such a difficult year for the country, the exchange was able to gather an active community of 400 thousand users.&rdquo;</p>\n\n<p>The organizers also acknowledged Mykola Udianskyi's charitable activities and his active civic position during the war with Russia.</p>\n\n<p>\"Mr. Udianskyi constantly helps Ukrainians who have lost their homes, income, and jobs during the war. Despite significant risks, he continues to invest funds in the restoration of his hometown, Kharkiv. He also supports Ukrainian soldiers and openly speaks about the war from internationally recognized platforms,\" said Anna Stukkert. \"This is truly inspiring and deserving of respect and support from the global business community.\"</p>\n\n<p>It should be noted that this is not the first award for Mykola Udianskyi. In 2022, he was recognized as the best digital currency expert at the World Influencers and Bloggers Awards and ranked first in Hacker Noon's 2019 list of the top 10 blockchain entrepreneurs in the CIS.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T19:03:41.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T18:41:16.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-30T18:45:00.000Z",
    "title": "Millennials are embracing crypto and meme coins like Alex The Doge ",
    "url": "https://crypto.news/millennials-are-embracing-crypto-and-meme-coins-like-alex-the-doge/",
    "description": "Younger demographics, especially millennials, are embracing digital assets like Bitcoin and meme coins like Alex The Doge"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T19:00:55.000Z",
    "title": "Litecoin Breaks Psychological Barrier But Remains in Bearish Territory: What Lies Ahead?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-breaks-psychological-barrier-but-remains-in-bearish-territory-what-lies-ahead/",
    "description": "The recent surge in Litecoin (LTC) price propelled it to reach a significant psychological level of $100. This upward movement has provided a bullish boost and allowed the altcoin to register gains in recent trading sessions. However, despite this bullishness, the price of LTC remains within bearish territory, indicating ongoing downward pressure. Reclaiming the $100 price mark is crucial for sustaining a bullish trend. Related Reading: XRP Dips After SEC’s ETF Blow But A Rebound Looks Likely In the past 24 hours, LTC has experienced a rally of nearly 17%. On the weekly chart, the altcoin has maintained double-digit gains, reflecting its positive performance over a longer period. It&#8217;s worth noting that Litecoin&#8217;s halving event is just a little over a month away. Historically, the price of the asset tends to increase before this event. However, due to the fluctuating nature of Bitcoin, which often influences major altcoins, LTC might experience slight depreciation. Significant depreciation is less likely as long as LTC maintains its price above the local support level. A sustained increase in demand for the altcoin is necessary to ensure continued gains on the daily chart. The market capitalization of LTC has also increased, indicating bullish momentum in the market. Litecoin Price Analysis: One-Day Chart When writing, Litecoin (LTC) was trading at $97.81. After reaching the $100 mark, LTC has been steadily gaining in price. However, despite the bullish momentum, Litecoin remains within a crucial zone that is bearish and could potentially reverse the gains. This bearish zone, indicated in red, extends from $94 to $103. In previous trading sessions, LTC has retraced when attempting to revisit the $103 level. The $94 mark has also been a reversal point over the past few months. Moreover, Litecoin entered the excess selling zone the maximum number of times, where the price fluctuated between the two (upper and lower) bands of the bearish region. The overhead resistance levels are $100 and $103. In case of a decline from these levels, the price could drop to $94 initially, followed by a potential further decline to $90. Technical Analysis Regarding demand, Litecoin (LTC) was approaching overbought conditions. The Relative Strength Index (RSI) was above the 60 mark, indicating buyers had gained market control. This suggests a higher demand for LTC compared to selling pressure. The increased demand was also reflected in the price, as it climbed above the 20-Simple Moving Average (SMA) line. This signifies that buyers were driving the price momentum in the market, pushing it higher. As long as Litecoin (LTC) maintains its price above the 20-Simple Moving Average (SMA), indicated by the red line on the chart, specifically around the $87 level, the bullish sentiment is expected to persist. Litecoin (LTC) formed a strong buy signal in line with increased demand. The Moving Average Convergence Divergence (MACD) indicator showed a green histogram, indicating a fresh buy signal. This suggests a strong bullish momentum and strength in the LTC market. Related Reading: Litecoin Up 18% In Past 24 Hours, Is Halving Rally Here? Furthermore, the Chaikin Money Flow (CMF) indicator displayed capital inflows outweighing outflows. The indicator was above the half-line, indicating more capital inflows than outflows at the given time. Featured image from UnSplash, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T18:45:17.000Z",
    "title": "Payments Giant Mastercard Launches ‘Blockchain App Store’ in Beta Amid Crypto Foray: Report",
    "url": "https://dailyhodl.com/2023/06/30/payments-giant-mastercard-launches-blockchain-app-store-in-beta-amid-crypto-foray-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/launches-app-store.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments giant Mastercard is rolling out a new platform for blockchain-based applications as it expands its presence in the digital asset space. In a statement to Fortune, Mastercard executive vice president and head of crypto and blockchain Raj Dhamodharan says the Mastercard Multi-Token Network (MTN) is an “app store powered by blockchain technologies for building [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/payments-giant-mastercard-launches-blockchain-app-store-in-beta-amid-crypto-foray-report/\">Payments Giant Mastercard Launches ‘Blockchain App Store’ in Beta Amid Crypto Foray: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T18:41:03.000Z",
    "title": "SEC Says BlackRock and Fidelity’s Spot Bitcoin ETF Filings Are Unclear and Incomprehensive: Report",
    "url": "https://dailyhodl.com/2023/06/30/sec-says-blackrock-and-fidelitys-spot-bitcoin-etf-filings-are-unclear-and-incomprehensive-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/sec-supprot-bitcoin-etf.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is reportedly saying that BlackRock and Fidelity’s applications for a spot Bitcoin (BTC) exchange-traded fund (ETF) are unclear and incomprehensive. According to a new report by The Wall Street Journal, the regulatory agency recently told Nasdaq and the Chicago Board Options Exchange (CBOE), who filed the applications on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/sec-says-blackrock-and-fidelitys-spot-bitcoin-etf-filings-are-unclear-and-incomprehensive-report/\">SEC Says BlackRock and Fidelity’s Spot Bitcoin ETF Filings Are Unclear and Incomprehensive: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]