[
  {
    "source": "Crypto Daily",
    "date": "2023-07-15T07:23:10.000Z",
    "title": "Binance Reportedly Cuts 1,000 Staff After Executives Exit Firm",
    "url": "https://cryptodaily.co.uk/2023/07/binance-reportedly-cuts-1000-staff-after-executives-exit-firm",
    "description": "<p>Crypto exchange Binance reportedly laid off several staff members after a number of executives left the firm. </p>\n<p>Cryptocurrency exchange Binance has cut its staff after an exodus of executives hit the firm, Reuters reports. The Wall Street Journal first reported the news, indicating more than 1,000 staff were let go over the past few weeks.</p>\nCZ Disputes Media Reports\n<p>The layoffs at Binance come after a wave of regulatory scrutiny in the US caused doubt in the industry&rsquo;s future. Binance and its rival Coinbase were sued by the US Securities and Exchange Commission for allegedly violating securities laws.</p>\n<p>The SEC accused Binance and its CEO Changpeng &ldquo;CZ&rdquo; Zhao of operating a &ldquo;web of deception.&rdquo; The exchange vehemently denied the accusations and said it would defend itself vigorously.</p>\n<p>Zhao took to Twitter to clarify media reports and said the numbers being reported are inaccurate. The exchange continues to appoint new staff.&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">As we continuously strive to increase talent density, there are involuntary terminations. This happens in every company. The numbers reported by media are all way off. 4 FUD. On the bright side, they just can&rsquo;t resist talking about us.We are still hiring. 🤝</p>\n&mdash; CZ 🔶 Binance (@cz_binance) July 14, 2023\n<p>\n\n</p>\nExecutives Leave Binance\n<p>Last week, Reuters reported a string of executives left Binance. The exchange&rsquo;s Chief Strategy Officer, Patrick Hillman, said in a tweet that he would be leaving the firm for personal reasons.</p>\n\n<p dir=\"ltr\" lang=\"en\">Apologies for any typos, but I was not expecting to be tweeting about this today. It&rsquo;s true that I am leaving @Binance, but I&rsquo;m doing so on good terms. I continue to respect and support @cz_binance and am grateful for having had the incredible opportunity to work under his&hellip;</p>\n&mdash; Patrick Hillmann (@PRHillmann) July 6, 2023\n<p>\n\n</p>\n<p>Steven Christie, a compliance officer at the exchange, also announced via Twitter that he was leaving the firm. Christie said:</p>\n\n<p>I usually don&rsquo;t tweet much and try and keep a low profile, but wanted to clear the air about a couple of articles that were printed today. I can confirm that I am indeed leaving @binance, but the reasons for my departure are very different than what was reported.</p>\n\n<p>General Counsel for Binance, Hon Ng, also left the firm along with Yibo Ling, Binance&rsquo;s US-based chief business officer.</p>\n<p>CZ also commented on reports of the executive exodus:</p>\n\n<p dir=\"ltr\" lang=\"en\">4. More FUD about some departures. Yes, there is turnover (at every company). But the reasons dreamed up by the &ldquo;news&rdquo; are completely wrong.As an organization that has grown from 30 to 8000 people in 6 years, from 0 to the world&rsquo;s largest crypto exchange in less than 5 months&hellip;</p>\n&mdash; CZ 🔶 Binance (@cz_binance) July 6, 2023\n<p>\n\n</p>\n<p>A spokesperson for Binance told Reuters:</p>\n\n<p>Over the last six years, we have grown from 30 to a team of almost 8,000 across the globe. As we prepare for the next major bull cycle, it has become clear that we need to focus on talent density across the organization to ensure we remain nimble and dynamic.</p>\n\nBinance.US Lays Off Staff\n<p>Soon after the SEC filed suit against Binance, Binance&rsquo;s US arm reportedly conducted a round of layoffs.</p>\n<p>Sources said that around 50 people, or 10%, in the exchange&rsquo;s legal, compliance, and risk departments were dismissed.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-15T07:30:38.000Z",
    "title": "Report: Zimbabwean Economist Says Portion of Goverment Employees’ Salaries Must Be Paid in Gold Coins",
    "url": "https://news.bitcoin.com/report-zimbabwean-economist-says-portion-of-goverment-employees-salaries-must-be-paid-in-gold-coins/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Zimbabwean Economist Says Portion of Goverment Employees&#039; Salaries Must Be Paid in Gold Coins\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1824865598-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A Zimbabwean economist has said authorities should consider paying a portion of government employees&#8217; salaries with gold coins. The economist said partially paying government workers with gold coins can &#8220;help curtail the black market dominance&#8221; in the country&#8217;s currency market. Dollar Shortages and Rising Inflation A Zimbabwean economist, George Nhepera, has urged authorities in the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-15T07:36:01.000Z",
    "title": "Crypto Politicians: Top 4 Prominent Figures",
    "url": "https://nulltx.com/crypto-politicians-top-4-prominent-figures/",
    "description": "There are a few prominent politicians and their government who have expressed support for Bitcoin or shown an interest in cryptocurrency-related topics. Cynthia Lummis (United States): Cynthia Lummis, a U.S. Senator from Wyoming, has been an outspoken advocate for Bitcoin and digital currencies. She has highlighted the potential benefits of Bitcoin as a store of [&#8230;]"
  }
]