[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T07:41:28.000Z",
    "title": "CoinEx Settles for $1.7 Million, Ceases New York Operations",
    "url": "https://www.cryptopolitan.com/coinex-settles-for-1-7-million/",
    "description": "CoinEx, a Hong Kong-based cryptocurrency trading platform, has reached an agreement with the New York Attorney General&#8217;s office to pay $1.7 million in restitution and penalties and cease its operations in New York. The settlement comes as a result of a lawsuit filed by the Attorney General&#8217;s office in February, which alleged that CoinEx violated ... <a title=\"CoinEx Settles for $1.7 Million, Ceases New York Operations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinex-settles-for-1-7-million/\" aria-label=\"More on CoinEx Settles for $1.7 Million, Ceases New York Operations\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-16T07:50:57.000Z",
    "title": "The Premature And Fragile Nature Of The Renewed Memecoin Season In 2023",
    "url": "https://nulltx.com/the-premature-and-fragile-nature-of-the-renewed-memecoin-season-in-2023/",
    "description": "The phenomenon of Memecoins, cryptocurrencies that are often based on memes or popular cultural references, has gained significant attention and popularity in recent years. However, the volatile nature of these coins has raised concerns about their long-term viability as investment assets. The decline in prices and new-time lows experienced by Memecoins like Pepe, Mong, Turbo, [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T08:00:15.000Z",
    "title": "Conflux and Toncoin Suffer Huge Losses While New AI Crypto Begins to Pump",
    "url": "https://www.crypto-news-flash.com/conflux-and-toncoin-suffer-huge-losses-while-new-ai-crypto-begins-to-pump/?utm_source=rss&utm_medium=rss&utm_campaign=conflux-and-toncoin-suffer-huge-losses-while-new-ai-crypto-begins-to-pump",
    "description": "Layer-1 blockchain projects like Toncoin (TON) and Conflux (CFX) are seeing a noticeable drop in investor interest while AI-linked cryptocurrencies like InQubeta (QUBE) are generating lots of interest as investors look to ride the artificial intelligence (AI) technology wave.  InQubeta provides an Ethereum (ETH) based blockchain that connects AI startups with potential investors. It allows [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T07:54:14.000Z",
    "title": "Gold Goes Digital: Golteum Joins Chainlink BUILD to Unlock the Power of Fractionalized NFTs Backed by Physical Metals",
    "url": "https://www.crypto-news-flash.com/gold-goes-digital-golteum-joins-chainlink-build-to-unlock-the-power-of-fractionalized-nfts-backed-by-physical-metals/?utm_source=rss&utm_medium=rss&utm_campaign=gold-goes-digital-golteum-joins-chainlink-build-to-unlock-the-power-of-fractionalized-nfts-backed-by-physical-metals",
    "description": "Golteum integrates with Chainlink&#8217;s BUILD program, unlocking advanced oracle services and accelerating the evolution of their platform offering fractionalized NFTs backed by physical metals. In reciprocity, Golteum will allocate 4% of its native token supply to Chainlink&#8217;s service providers, including stakers. 🏗️ #ChainlinkBUILD 🏗️@golteum, a platform for fractionalized NFTs backed by physical gold bars and [...]"
  }
]