[
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T21:41:25.000Z",
    "title": "Hester Peirce speaks out against LBRY enforcement action: 'The market could have decided'",
    "url": "http://cointelegraph.com/news/hester-peirce-lbry-enforcement-action-troubling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fa22b53a-e9cc-4df7-b8b4-3c5cd6f7eea9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC commissioner said the regulator’s actions “forced a group of entrepreneurs to abandon what they built,” with LBRY announcing in October it planned to wind down operations.</p>\n                    <p><p>Hester Peirce of the United States Securities and Exchange Commission (SEC) has issued a dissenting opinion on the regulator’s lawsuit against blockchain firm LBRY.</p><p>In an Oct. 27 statement, Peirce <a href=\"https://www.sec.gov/news/statement/peirce-statement-lbry-102723\" target=\"_blank\" rel=\"noopener nofollow\">described</a> feeling “unsettled” following the SEC’s enforcement action against LBRY in March 2021. In November 2022, a judge ruled in favor of the SEC, stating that the firm’s LBC token was a security. Though LBRY appealed the decision, the company announced in October that it <a href=\"https://cointelegraph.com/news/blockchain-firm-lbry-wind-down-sec-appeal-final-goodbye\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blockchain-firm-lbry-wind-down-sec-appeal-final-goodbye/amp\">planned to wind down</a>, citing millions of dollars in debt due to legal costs.</p><p>“This case illustrates the arbitrariness and real-life consequences of the Commission’s misguided enforcement-driven approach to crypto,” said Peirce. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some overdue thoughts on our case against LBRY: <a href=\"https://t.co/wLsG4Xr7wz\">https://t.co/wLsG4Xr7wz</a></p>— Hester Peirce (@HesterPeirce) <a href=\"https://twitter.com/HesterPeirce/status/1717965338489352613?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Peirce, the SEC’s case against LBRY was “puzzling” given there was no evidence of fraud and the firm took a conservative approach to digital assets compared to other crypto projects. The SEC commissioner suggested that there had been no clear path for a project like LBRY to come in and register with the regulator, and “it would not be a particularly useful effort” if it had managed to do so.</p><p>“[T]he Commission took an extremely hardline approach in this case,” said Peirce. “For example, after winning on summary judgment, the Commission sought monetary remedies of $44 million and asserted that LBRY’s offer to burn all tokens in its possession was not sufficient assurance that LBRY would not violate the registration provisions in the future. The Commission’s requested remedies were entirely out of proportion to any harm.”</p><p>She added:</p><blockquote>“The time and resources we expended on this case could have been devoted to building a workable regulatory framework that companies like LBRY could have followed. Then the market could have decided LBRY’s fate.”</blockquote><p>“The Commission’s action forced a group of entrepreneurs to abandon what they built,” said Peirce. “Our disproportionate reaction in this case will dissuade people from experimenting with blockchain technology.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-revises-lbry-fine-to-111k\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-revises-lbry-fine-to-111k/amp\"><strong><em>SEC revises $22M penalty against LBRY, seeks $111K instead</em></strong></a></p><p>Peirce has often been a dissenting voice at the SEC in crypto-related enforcement cases. In September, she <a href=\"https://cointelegraph.com/news/sec-embroiled-court-cases-hester-peirce-crypto-firms-united-states\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-embroiled-court-cases-hester-peirce-crypto-firms-united-states/amp\">told Cointelegraph that crypto firms</a> shouldn’t give up on trying to launch in the United States, but added she believed the commission was “far behind” in finding a solution for a regulatory framework.</p><p>Gary Gensler, who chairs the SEC, has often <a href=\"https://cointelegraph.com/news/sec-chair-doubles-down-tells-crypto-firms-come-in-and-talk-to-us\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-chair-doubles-down-tells-crypto-firms-come-in-and-talk-to-us/amp\">called on crypto firms</a> to “come in and talk” to the regulator to avoid potential enforcement actions. To date, the regulator has filed lawsuits against crypto exchanges Binance and Coinbase, and many other firms in the space. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T21:55:09.000Z",
    "title": "GAM3 Awards return to showcase the best in web3 gaming",
    "url": "https://cryptoslate.com/gam3-awards-return-to-showcase-the-best-in-web3-gaming/",
    "description": "<p>The GAM3 Awards, known for its recognition of excellence in web3 gaming, is entering its second year. Set for Dec. 14, the ceremony will celebrate the industry&#8217;s finest across an array of categories. The awards ceremony is organized by GAM3S.GG, a platform that has styled itself as &#8220;the home of web3 gaming&#8221;, and Magic Eden, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gam3-awards-return-to-showcase-the-best-in-web3-gaming/\">GAM3 Awards return to showcase the best in web3 gaming</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T22:00:44.000Z",
    "title": "Binance Founder CZ’s Fortunes Plummet By $12 Billion Amidst Downturn in Crypto Trading",
    "url": "https://www.newsbtc.com/binance/binance-founder-czs-fortunes-plummet-by-12-billion-amidst-downturn-in-crypto-trading/",
    "description": "Changpeng Zhao, widely known as CZ and the founder of Binance, one of the largest cryptocurrency exchanges, has suffered a significant blow to his fortune. According to a recent Bloomberg report, CZ&#8217;s wealth plummeted by $12 billion due to the ongoing slump in crypto-trading activities.  Per the report, this decline was primarily attributed to a sharp drop in trading volumes at Binance throughout the year. CZ&#8217;s Financial Losses The Bloomberg Billionaires Index revised its revenue estimates for Binance, slashing it by 38% after data revealed a decline in trading volumes at the exchange. As a result, CZ&#8217;s net worth now stands at $17.2 billion, marking a significant reduction from his previous valuation. Related Reading: Shiba Inu Team Member Clarifies SHIB Burn As Shibarium Grows According to Bloomberg, CZ&#8217;s involvement in recent events that led to the bankruptcy filing of FTX further impacted his financial situation. In November, CZ announced the liquidation of a token linked to FTX (FTT) after reports emerged that Alameda Research, the hedge fund owned by Sam Bankman-Fried, the founder of FTX, held a large position in it.  The announcement triggered a rush among FTX customers to withdraw funds, overwhelming the exchange&#8217;s infrastructure. As a consequence, FTX declared bankruptcy within a week, erasing Bankman-Fried&#8217;s fortune, which had peaked at $26 billion in March the previous year. To estimate Binance&#8217;s revenue, the Bloomberg Billionaires Index relies on spot and derivatives trading data from crypto-tracking services Coingecko and Coinpaprika.  Binance had witnessed a significant gain in market share earlier this year, reaching 62% of total on-exchange crypto trades during the first quarter. However, after a promotional zero-fee period for popular trading pairs ended, Binance&#8217;s market share slid to 51% by the end of the third quarter, as reported by research firm CCData. Binance Value Plunges As Lawsuits And Allegations Take A Toll Binance has also faced increasing regulatory scrutiny, isolating itself from the traditional financial system. The Securities and Exchange Commission (SEC) filed a lawsuit against Binance in June, accusing the exchange of violating regulations.  Earlier this year, the Commodity Futures Trading Commission (CFTC) also took legal action against Binance for non-compliance with rules that allowed US users to access the platform.  Allegations against Binance include inadequate money-laundering controls, inflated trading volumes, and mishandling of client assets. Binance has strongly disputed these claims and is currently contesting them in court.  Related Reading: Bitcoin Braces For $50 Billion Influx Following ETF Launch, Bitwise CEO Says In June, Bloomberg&#8217;s wealth index reduced the value of Binance&#8217;s US exchange to zero after it announced the discontinuation of dollar transactions, resulting in a significant decline in trading volumes.  Binance.US had previously been valued at $4.7 billion during a funding round in March 2022, while CZ&#8217;s net worth peaked at $96 billion in January. The challenges faced by Binance are not unique, as regulatory uncertainties and rising interest rates have made alternative investments more appealing. Coinbase Global, another leading cryptocurrency exchange, experienced a 52% decline in spot trading volume in the third quarter compared to the previous year, according to Bloomberg.  Despite the personal wealth challenges CZ faces, Binance Coin (BNB) has capitalized on the overall market recovery, showcasing substantial gains across various time frames. Currently, the token is trading at $225.2, maintaining its upward trend with a 2.2% increase over the past 24 hours. Furthermore, BNB has demonstrated significant gains of 5.8%, 9.6%, and 6.1% over the seven, fourteen, and thirty-day time frames, respectively. These positive trends highlight the token&#8217;s strong performance in recent weeks. Featured image from Binance, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-27T22:01:24.000Z",
    "title": "Dogecoin Has a Huge Week As Elon Musk Aims for X Financial Services To Launch by End of 2024: Report",
    "url": "https://dailyhodl.com/2023/10/27/dogecoin-has-a-huge-week-as-elon-musk-aims-for-x-financial-services-to-launch-by-end-of-2024-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The popular meme asset Dogecoin (DOGE) is surging this week as billionaire Elon Musk reportedly aims to launch financial services on the social media platform X by the end of next year. According to a new report by The Verge, the business magnate says he expects X’s comprehensive financial features to roll out by the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/27/dogecoin-has-a-huge-week-as-elon-musk-aims-for-x-financial-services-to-launch-by-end-of-2024-report/\">Dogecoin Has a Huge Week As Elon Musk Aims for X Financial Services To Launch by End of 2024: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]