[
  {
    "source": "Decrypt",
    "date": "2024-01-05T23:02:03.000Z",
    "title": "Bitcoin ETF Takes a Big Step Toward Approval, Analysts Say",
    "url": "https://decrypt.co/211876/bitcoin-etf-takes-a-big-step-toward-approval-analysts-say",
    "description": "A Bloomberg analysts suggests we will see a $100 Billion Bitcoin ETF in five to ten years."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T22:47:13.000Z",
    "title": " Price analysis 1/5: BTC, ETH, BNB, SOL, XRP, ADA, AVAX, DOGE, DOT, MATIC ",
    "url": "https://cointelegraph.com/news/price-analysis-1-5-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjQ5ZjE1OTAtMzg0OS00MmI4LTljYjYtNzE1YjBiODU5OTAzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin is trading just below the $45,000 level as traders await the SEC's final decision on the spot Bitcoin ETF applications.</p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) volatility has increased in the past two days as traders speculate about the fate of the spot Bitcoin exchange-traded funds (ETFs) applications. Some analysts said that the ETFs could be greenlighted as early as Jan. 5, but Bloomberg ETF analyst James Seyffart is standing by his belief that an <a href=\"https://cointelegraph.com/news/rumor-mill-heats-hopes-spot-bitcoin-etf-approval-tomorrow\">approval is most likely to happen</a> between Jan. 8 and 10.</p><p>A few analysts believe that in a classic case of buy the rumor, sell the news, Bitcoin may fall even if one or more Bitcoin ETFs are approved. But John Bollinger, creator of the Bollinger Bands volatility indicator, thinks otherwise. In a post on X (formerly Twitter), <a href=\"https://cointelegraph.com/news/march-banking-crisis-rerun-risks-40-bitcoin-price-crash-arthur-hayes\">Bollinger said he expects</a> Bitcoin to “break higher.”</p><p>What are the important resistance levels to watch out for in Bitcoin and altcoins? Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-1-5-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-matic\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-05T22:49:12.000Z",
    "title": "Bitcoin may see sharp correction upon spot ETF approval, predicts Bitmex founder Arthur Hayes",
    "url": "https://cryptobriefing.com/bitcoin-sharp-correction-spot-etf-approval-predicts-bitmex-founder-arthur-hayes/?utm_source=feed&utm_medium=rss",
    "description": "Hayes predicts a short-term Bitcoin pullback triggered by central bank actions, but his long-term outlook remains bullish."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T23:00:17.000Z",
    "title": "Solana Co-Founder: The Blockchain Doesn’t Need Layer-2s Like Ethereum",
    "url": "https://www.newsbtc.com/news/solana/solana-doesnt-need-layer-2s-like-ethereum/",
    "description": "Solana co-founder Anatoly Yakovenko has expressed confidence that their blockchain can handle the growing demand for decentralized applications (dapps) without needing layer-2 solutions like those employed by Ethereum. Solana Doesn&#8217;t Need Layer-2 Solutions In a post on X, Yakovenko argued that Solana&#8217;s design, which utilizes a hybrid consensus mechanism, enables it to scale efficiently without relying on additional layers. The co-founder explained that their goal is to eventually synchronize a global atomic state machine &#8220;as fast as the laws of physics allow.&#8221; With this stance, Yakovenko appears to be downplaying the role of layer-2 off-chain options like Arbitrum and Base. Related Reading: Maker Market Heats Up: Over 600 Addresses Complete MKR Trades In Single Day &#8220;Solana aims to synchronize a global atomic state machine as fast as the laws of physics allow,&#8221; Yakovenko said on X. &#8220;In this end state, any layer-2, side chain, or zero-knowledge proof Valadium amounts to the same thing. They are external execution environments that cannot ensure atomic composition with the rest of the layer-1 state.&#8221; Despite the position Yakovenko takes, the co-founder said the floor is open for developers to create layer-2 solutions. However, it won&#8217;t be necessary because the network can handle such demand without such workarounds.  Ethereum Is Confident Layer-2s Will Be Key To Scaling This stance contrasts Ethereum&#8217;s approach, which increasingly relies on layer-2 solutions to alleviate congestion and high transaction fees. Layer-2 options such as Optimism and Arbitrum have gained popularity for their ability to offload transactions from the mainnet while maintaining compatibility with existing smart contracts.  To quantify their role in scaling Ethereum, L2Beat data shows that the layer-2 solutions have a combined total value locked (TVL) of over $20 billion. The largest of them is Arbitrum, which manages $10 billion of assets when writing on January 5. Though Yakovenko&#8217;s comments reflect Solana&#8217;s focus on providing a high-performance, low-cost environment for apps, there have been instances when the network froze, calling its reliability into question. To resolve this, the platform plans to upgrade its client, adding the Firedancer for increased node reliability and performance.  Related Reading: Ethereum Mega Whales Continue To Buy: Do They Know Something You Don’t? On the other hand, Ethereum seems to be going the layer-2 route. During their developer call, it was decided that Ethereum&#8217;s gas limit won&#8217;t be increased further from the 30 million gwei level. This, analysts concluded, meant the delay of on-chain scaling ambitions for off-chain methods, specifically off-chain and sidechain rails. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-05T23:01:35.000Z",
    "title": "Phishing Link Posted to Certik’s X Account After Hacker Compromises Blockchain Security Firm’s Social Media",
    "url": "https://dailyhodl.com/2024/01/05/phishing-link-posted-to-certiks-x-account-after-hacker-compromises-blockchain-security-firms-social-media/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/hackers-stole-defi-protocols.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A phishing link was posted on the X account of blockchain-focused cybersecurity firm Certik after a bad actor hacked into the protocol’s social media profile. In a new announcement, the cybersecurity company says that a “verified account associated with well-known media” was able to hack into one of their employee’s X accounts, using it to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/05/phishing-link-posted-to-certiks-x-account-after-hacker-compromises-blockchain-security-firms-social-media/\">Phishing Link Posted to Certik’s X Account After Hacker Compromises Blockchain Security Firm’s Social Media</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]