[
  {
    "source": "Cointelegraph",
    "date": "2023-12-20T08:46:51.000Z",
    "title": " US standards and tech group seeks public input on AI safety, development guidelines ",
    "url": "https://cointelegraph.com/news/us-standards-tech-group-seeks-public-input-ai-safety-development-guidelines",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNDEyZWY3ZmUtZjdjNy00YzI2LWFiNGUtOGUzZTlkNzQ1ODEyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The U.S. National Institute of Standards and Technology’s request for information seeks input from AI companies and the public on generative AI risk management and reducing risks of AI-generated misinformation.</p>\n                    <p><p>The National Institute of Standards and Technology (NIST) within the U.S. Department of Commerce has released a Request for Information (RFI) to support its duties outlined in the latest Executive Order concerning the secure and responsible development and use of artificial intelligence (AI).</p><p>The organization <a href=\"https://www.nist.gov/news-events/news/2023/12/nist-calls-information-support-safe-secure-and-trustworthy-development-and\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it's inviting public input up to Feb. 2 to gather essential feedback for conducting tests to ensure the safety of AI systems.</p><p>Secretary of Commerce Gina Raimondo stated that the initiative is inspired by President Joe Biden’s October Executive directive instructing NIST to create guidelines, including evaluation and red-teaming, foster consensus-based standards, and establish testing environments for AI system assessment. This framework aims to support the AI community in safely, reliably, and responsibly developing AI.</p><p><a href=\"https://cointelegraph.com/news/us-standards-tech-group-seeks-public-input-ai-safety-development-guidelines\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-20T08:43:17.000Z",
    "title": " Ripple gets approval to operate as digital asset service operator in Ireland ",
    "url": "https://cointelegraph.com/news/ripple-vasp-registration-ireland",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvY2VkZDk1NTgtYTExYS00ZGQyLTlmNjYtMjFhMDE4NTA1MTcxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Other companies in the CBI VASP register include Coinbase and Gemini exchanges, the payment processor MoonPay, Zodia Custody and others.</p>\n                    <p><p>Cryptocurrency payment network Ripple has reached another regulatory milestone in Ireland, with the Central Bank of Ireland (CBI) approving the firm as a virtual asset service provider (VASP). </p><p>Announcing the news on Dec. 19, Ripple <a href=\"https://ripple.com/ripple-press/ripple-added-to-central-bank-of-irelands-virtual-asset-service-providers-register\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it has now been added to the CBI’s list of registered VASPs, allowing the firm to provide certain digital asset services in Ireland.</p><p><a href=\"https://registers.centralbank.ie/DownloadsPage.aspx\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from CBI’s VASP register, Ripple can conduct transactions on behalf of another natural or legal person who moves digital assets from one address or account to another. Ripple is also allowed to provide crypto exchange services against fiat currencies, as well as exchange between different cryptocurrencies and provide custody services, according to the data.</p><p><a href=\"https://cointelegraph.com/news/ripple-vasp-registration-ireland\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-20T08:39:50.000Z",
    "title": "Ripple President Monica Long Forecasts a Transformative 2024 for Crypto",
    "url": "https://www.cryptoglobe.com/latest/2023/12/ripple-president-monica-long-forecasts-a-transformative-2024-for-crypto/",
    "description": "On 19 December 2023, Monica Long, the President of Ripple, shared her predictions for the cryptocurrency landscape in 2024 on social media platform X. Her insights reflect a vision of significant evolution and maturation in the crypto industry. Here’s a detailed breakdown of her key predictions and statements: Breaking the Speculative Hype Cycle: Long anticipates […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T08:52:52.000Z",
    "title": "Ripple advances in EU with central bank of Ireland approval",
    "url": "https://www.cryptopolitan.com/ripple-advances-in-eu-with-bank-of-ireland/",
    "description": "In a significant development for the blockchain industry, Ripple Markets Ireland Limited, a subsidiary of Ripple (XRP), has been granted registration by the Central Bank of Ireland as a Virtual Asset Service Provider (VASP). This move marks a crucial step in Ripple&#8217;s expansion strategy in the European market, particularly following the recent implementation of the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-20T09:08:23.000Z",
    "title": "Bitcoin (BTC) and Ethereum (ETH) Down Over 6% This Week, Whales Plunge Into Pullix Presale Ahead of Q1 Launch",
    "url": "https://nulltx.com/bitcoin-btc-and-ethereum-eth-down-over-6-this-week-whales-plunge-into-pullix-presale-ahead-of-q1-launch/",
    "description": "As Bitcoin (BTC) and Ethereum (ETH) went through a tough week, experiencing a dip of over 6%, the cryptocurrency market saw major movements elsewhere. Pullix (PLX) &#8211; a new ICO currently in Stage 2 of its presale, has gained mass appeal with over 4.7M tokens sold and $199,000 raised. Numerous [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-20T09:04:28.000Z",
    "title": "Ethereum Shows Resilience As Market Value Holds Strong Amid Exchange Supply Decline",
    "url": "https://nulltx.com/ethereum-shows-resilience-as-market-value-holds-strong-amid-exchange-supply-decline/",
    "description": "Ethereum (ETH), the world&#8217;s second-largest cryptocurrency, is poised for an upward trajectory after successfully retesting at $2,100. As of the latest update, the price of Ethereum is comfortably trading at $2,220. Insights from the market intelligence platform Santiment, shared on X, indicate a noteworthy trend in Ethereum&#8217;s market dynamics. The [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T08:55:39.000Z",
    "title": "Elastos’ token ELA jumps 100% following Bitcoin layer-2 announcement",
    "url": "https://crypto.news/elastos-token-ela-jumps-100-following-bitcoin-layer-2-announcement/",
    "description": "Blockchain developer Elastos introduced a Bitcoin layer-2 network, aiming to attract liquidity through its staking tools. According to a blog post, Elastos&#8216; new solution called &#8220;Bitcoin Elastos Layer2&#8221; abbreviated as BeL2, intends to leverage SmartWeb technology to enhance the capabilities&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T08:51:08.000Z",
    "title": "Analyzing investment appeal of RBLZ, BONK, and TIA",
    "url": "https://crypto.news/analyzing-investment-appeal-of-rblz-bonk-and-tia/",
    "description": "Celestia and BONK are firm after key announcements. Meanwhile, analysts are bullish on Rebel Satoshi in the ongoing RBLZ presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T08:47:10.000Z",
    "title": "Senator Warren accuses crypto lobbyists of obstructing anti-terrorism efforts",
    "url": "https://crypto.news/senator-warren-accuses-crypto-lobbyists-of-obstructing-anti-terrorism-efforts/",
    "description": "In a pointed letter to prominent crypto lobbying groups, including the Blockchain Association, Coin Center and Coinbase, Warren emphasized the potential negative impact of their lobbying activities. Warren accuses these groups of engaging in efforts that could delay or obstruct&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-20T09:04:45.000Z",
    "title": "Solana’s Tokenized Treasury Soars to $760 Million as Ondo Finance Expands",
    "url": "https://www.crypto-news-flash.com/solanas-tokenized-treasury-soars-to-760-million-as-ondo-finance-expands/?utm_source=rss&utm_medium=rss&utm_campaign=solanas-tokenized-treasury-soars-to-760-million-as-ondo-finance-expands",
    "description": "<img width=\"1043\" height=\"575\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Jito\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-1024x565.jpg 1024w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />Investors can now access Tokenized real-world assets (RWA) on the Solana blockchain.  This makes it the second layer 1 network behind Ethereum where U.S. Dollar Yield (USDY) can be accessed.  Solana is currently one of the most popular and adopted coins in the crypto ecosystem based on its on-chain activities. According to a recent report, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-20T08:48:51.000Z",
    "title": "12 Lessons to Boost Your Portfolio in the Bull Market – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/12-lessons-to-boost-your-portfolio-in-the-bull-market-part-2/",
    "description": "<p>Crypto bull markets are a double-edged sword. If you play it right, you&#8217;ll laugh your way to the bank. But if you play it wrong, you could be missing out on massive gains. In this two-part article series, we&#8217;ll teach you how to boost your portfolio in the bull market.  Before we begin, do note [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/12-lessons-to-boost-your-portfolio-in-the-bull-market-part-2/\">12 Lessons to Boost Your Portfolio in the Bull Market &#8211; Part 2</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]