[
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T13:29:28.000Z",
    "title": "Bitcoin ETF applications: Who is filing and when the SEC may decide ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-sec-deadline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7c84d5e7-8337-43e2-98ca-ae48f9a0019c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite BlackRock’s application for a Bitcoin spot ETF, its approval remains uncertain, with the SEC favoring another futures-based Ether ETF. </p>\n                    <p><p>The race to list the first spot-traded Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) in the United States has seen the entrance of major financial institutions like BlackRock, Fidelity and VanEck. </p><p>While the U.S. Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/proshares-bitcoin-linked-etf-launches-on-nyse-as-btc-price-dips-above-63k\">first approved a Bitcoin-linked Futures ETF</a> in October 2021, the current filings are for spot Bitcoin ETFs. Following <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">Grayscale’s recent legal victory</a> against the SEC’s review of its spot Bitcoin ETF proposal, many now believe approval of the investment funds is more likely.</p><p>The interest of BlackRock — the world’s largest asset manager with over $8 trillion worth of assets under management — prompted several other institutions to refile for a spot Bitcoin ETF. </p><p>Most of these asset managers had to either withdraw their spot Bitcoin ETF filings or face rejection due to the SEC’s reservations concerning a spot-derived ETF. Here are the key Bitcoin ETF applicants:</p><ul><li><strong>BlackRock</strong>: BlackRock <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">filed for a spot Bitcoin ETF on June 15</a>, with Coinbase as the crypto custodian and spot market data provider and BNY Mellon as its cash custodian. The filing shocked the crypto and traditional finance world, and the firm’s CEO, Larry Fink, had previously <a href=\"https://www.cnbc.com/2017/10/13/blackrock-ceo-larry-fink-calls-bitcoin-an-index-of-money-laundering.html\" target=\"_blank\" rel=\"noopener nofollow\">called</a> BTC an index for money laundering. On July 15, the SEC formally <a href=\"https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review\">accepted BlackRock’s spot Bitcoin ETF application</a> for review. </li><li><strong>WisdomTree</strong>: The New York-based asset manager first filed for a spot Bitcoin ETF in the U.S. on Dec. 8, 2021, <a href=\"https://cointelegraph.com/news/sec-rejects-wisdomtree-s-application-for-a-spot-bitcoin-etf-again\">which was rejected by the SEC</a> in 2022. The agency claimed the ETF fell short in terms of investor protection; however, with BlackRock’s entry in the spot Bitcoin ETF race, WisdomTree refiled with the SEC on July 19. </li><li><strong>Valkyrie Investments</strong>: Asset management firm Valkyrie filed its first spot Bitcoin ETF application in January 2021 but faced rejection from the SEC, like many other asset managers. However, with the rejuvenated enthusiasm around a spot Bitcoin ETF, Valkyrie <a href=\"https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs\">refiled its application</a> on June 21. The ETF would refer to the Chicago Mercantile Exchange’s (CME) reference price for Bitcoin and trade on NYSE Arca, with Xapo as the crypto custodian.</li><li><strong>ARK Invest</strong>: ARK filed an application for its <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application\">ARK 21Shares Bitcoin ETF in June 2021</a>. ARK Invest has partnered with Swiss-based ETF provider 21Shares to offer the fund, and it will launch on the Chicago Board Options Exchange (Cboe) BZX Exchange under the ticker symbol ARKB if approved.</li><li><strong>VanEck</strong>: VanEck is one of the earliest Bitcoin ETF applicants, making its first filing in 2018. The asset manager withdrew its application in September 2019 and made a second attempt with the SEC in December 2020, with shares of the trust set to trade on the Cboe BZX Exchange. The firm filed a new application in July 2023.</li><li><strong>Fidelity/Wise Origin:</strong> Fidelity Investments first applied for a spot Bitcoin ETF in 2021 and refiled for its Wise Origin Bitcoin Trust on July 19, 2023. The Wise Origin Bitcoin Trust would see Fidelity Service Company serving as the administrator while Fidelity Digital Assets will act as the BTC custodian.</li><li><strong>Invesco Galaxy Bitcoin ETF: </strong>Invesco first filed an application for its Invesco Galaxy Bitcoin ETF jointly with Galaxy Digital on Sept. 22, 2021. The joint venture refiled its application in July. The joint Bitcoin ETF would be “physically backed” by Bitcoin, with Invesco Capital Management as the sponsor.</li><li><strong>Bitwise</strong>: Bitwise first filed for a spot Bitcoin ETF in October 2021, only to face rejection from the SEC. The asset manager refiled its application in August 2023.</li><li><strong>GlobalX</strong>: Fund manager GlobalX joined the <a href=\"https://cointelegraph.com/news/fund-management-firm-global-x-files-with-sec-for-bitcoin-etf\">ETF race in 2021</a>, along with several other financial giants, when it filed for a spot Bitcoin ETF. The fund manager <a href=\"https://cdn.cboe.com/resources/regulation/rule_filings/pending/2023/SR-CboeBZX-2023-058.pdf\" target=\"_blank\" rel=\"noopener nofollow\">refiled</a> its application in August 2023, becoming the ninth applicant. The firm named Coinbase as its surveillance-sharing partner.</li></ul><p>In light of Grayscale’s recent legal victory and the wave of renewed applications, ETF analysts at Bloomberg have <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-chance-raised-after-grayscale-victory-bloomberg\">raised their expected approval chances</a> for a spot Bitcoin ETF to 75% from 65%.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEW: <a href=\"https://twitter.com/JSeyff?ref_src=twsrc%5Etfw\">@JSeyff</a> &amp; I are upping our odds to 75% of spot bitcoin ETFs launching this yr (95% by end of &#39;24). While we factored Grayscale win into our prev 65% odds, the unanimity &amp; decisiveness of ruling was beyond expectations and leaves SEC w &quot;very little wiggle room&quot; via <a href=\"https://twitter.com/NYCStein?ref_src=twsrc%5Etfw\">@NYCStein</a> <a href=\"https://t.co/IyEGmWjuHa\">pic.twitter.com/IyEGmWjuHa</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1696887691122548798?ref_src=twsrc%5Etfw\">August 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As expected, the SEC has <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-2024\">delayed its decision on all seven applicants</a>. Analysts had predicted that the SEC may not decide on an ETF until early 2024 when the final deadlines approach (listed below). </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b1c3eed3-9059-4ee2-a038-c96e8704fe91.png\"  /><figcaption style=\"text-align: center;\">Spot Bitcoin ETF decision deadlines. Source: Bloomberg/Twitter</figcaption></figure><p>John Glover, chief investment officer at crypto lending platform Ledn, told Cointelegraph that the ARK 21Shares “verdict slated for Jan. 10 will be the first real indicator as to whether the SEC is ready to start approving these types of applications. The final deadline is up at that point, and a decision will need to be made one way or another.”</p><h2>Why has the SEC rejected spot Bitcoin ETFs in the past?</h2><p>In its earlier <a href=\"https://cointelegraph.com/news/sec-rejects-vaneck-s-spot-bitcoin-etf-as-btc-price-falls-below-63k\">rejection of VanEck’s spot Bitcoin ETF</a>, the SEC claimed that the Bitcoin market is not big or mature enough to sustain ETF market demand. The commission also said the price volatility and inadequate level of trading surveillance could potentially leave the market prone to fraud and manipulation. </p><p>However, with the entrance of BlackRock, market pundits have started to believe that the chances of a <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-chances-65\">spot Bitcoin ETF being approved</a> are good. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/ai-human-resources-risks\">AI could revolutionize human resources, but there are risks</a></em></strong></p><p>One of the major factors preventing a spot ETF from getting approved is the nature of the fund. </p><p>A futures ETF is based on futures contracts rather than the digital asset itself, which is an important distinction. The futures markets are already heavily regulated to prevent market manipulation, thus making it easier for the SEC to approve such ETFs.</p><p>At the heart of these spot ETF rejections is the issuer’s requirement to incorporate a “surveillance-sharing agreement” with a sufficiently large and regulated Bitcoin-related market. Such agreements are integral in ensuring that the SEC can conduct exhaustive investigations in the event of any market irregularities. </p><p>A Bitfinex Alpha analyst told Cointelegraph that one of the vital concerns behind the rejection of spot Bitcoin ETFs is the regulator’s ability to track and continuously ensure asset safety and custody. However, for that to happen, the U.S. needs more regulatory and legal infrastructure before the “SEC or other involved parties would be comfortable in allowing an ETF provider to handle it.”</p><p>“If not, then the entire purpose of an ETF (which is to circumvent dealing with digital asset wallets or crypto exchanges) is defeated. Thus, it would not be fair to say that spot Bitcoin ETFs do not propose manipulation concerns in the SEC’s eyes. The ProShares Bitcoin ETF disapproval dated back to 2018 clarifies this very point. Another concern with regard to the document’s literature was the ability of the Bitcoin market to handle the volume that would be brought in via the introduction of a spot ETF,” the analyst added.  </p><p>The SEC is mainly concerned about the robustness of the trading venues. The regulator oversees futures exchanges like the CME and the Cboe, and any futures ETFs will be restricted to only trading on those regulated venues. Whereas there are no SEC-regulated spot exchanges. </p><p>However, not everyone agrees with the SEC’s assumptions about the vulnerabilities of the spot crypto ETF market. James Koutoulas, the founder of a futures-focused hedge fund Typhon, told Cointelegraph:</p><blockquote>“I can attest that the crypto futures are far inferior to the spot in terms of tracking error. The concept that a U.S. regulator can provide adequate ‘surveillance’ against market manipulation on a global 12-figure market is delusional. So, honestly, it probably comes down to passing the buck to the CFTC rather than retaining accountability. Given the SEC has an ‘investor protection’ mandate.”</blockquote><p>He added that by continuing to reject the simplest products like a BTC ETF, the ”SEC keeps pushing demand for crypto offshore and unregulated players. While a BTC ETF may not be perfect, it is much safer than buying BTC with Gensler’s family friend SBF [Sam Bankman-Fried] at FTX.”</p><p>Richard Gardener, CEO of tech infrastructure firm Modulus, believes futures ETFs have long been seen as more palatable for regulators and that the decision over a spot ETF is a matter of when not if.</p><p>He told Cointelegraph that a spot BTC ETF is “coming, sooner rather than later, and the heavy investment from major players like BlackRock and Fidelity signal this. As long as the major players are in the hunt, the industry is seen as viable in the long term, despite any short-term setbacks. If the SEC continues to refuse to act, politicians will be forced to act and develop their own answer to the crypto dilemma.”</p><h2>Ether futures ETF have more chances of approval</h2><p>While crypto enthusiasts would prefer to see spot ETFs, which would legitimize crypto as an asset class, U.S. regulators seem more likely to support futures ETFs.</p><p>Bloomberg analysts have predicted that the chances of approval for an Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures-derived ETF are over 90%, with nearly a dozen institutions lined up for approval.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><p>Reports in financial media <a href=\"https://cointelegraph.com/news/sec-to-approve-ethererum-eth-futures-etf\">suggested a high possibility</a> of the SEC approving an Ether futures-based ETF as soon as October. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This not surprising to us, we had said they would approve Ether Futures early on in race. Nice to be validated. Now what does it mean for spot? Hard to say beyond it shows that their views/policy/tolerance can change. <a href=\"https://t.co/JXCxNUpj2U\">https://t.co/JXCxNUpj2U</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1692314639235735836?ref_src=twsrc%5Etfw\">August 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ken Timsit, managing director at blockchain startup accelerator Cronos Labs, told Cointelegraph that the “thesis in favor of futures is that futures would enable investors to send signals about the price evolutions expected by the market, which in turn would help to dampen the volatility of Bitcoin and Ethereum price and counterbalance the large price swings that we have seen recently.”</p><p>Doug Schwenk, CEO of Digital Asset Research, told Cointelegraph that the “near-term psychological impact would most likely give a boost to crypto markets as another proof point that regulators remain open to evolving the listed space and continued hope for the elusive spot ETF.”</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-04T13:15:18.000Z",
    "title": "$2.8 billion traded in Digital Asset ETPs this week as outflows slow",
    "url": "https://cryptoslate.com/2-8-billion-traded-in-digital-asset-etps-this-week-as-outflows-slow/",
    "description": "<p>The digital asset market has experienced a minor cooling-off phase, with outflows totaling roughly US$11.2 million over the week, according to recent data by digital asset firm CoinShares. Despite this streak of negative sentiment, Bitcoin emerged as a beacon with inflows totaling US$3.8 million. CoinShares&#8217; Digital Asset Fund Flows Weekly report also displayed a notable [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/2-8-billion-traded-in-digital-asset-etps-this-week-as-outflows-slow/\">$2.8 billion traded in Digital Asset ETPs this week as outflows slow</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T13:36:28.000Z",
    "title": "Scientists Turn to AI to Fight Antibiotic-Resistant Bacteria “Superbugs”",
    "url": "https://www.cryptopolitan.com/scientists-turn-to-ai-to-fight-superbugs/",
    "description": "Superbugs, also known as antibiotic-resistant bacteria, are gradually becoming a threat to global health. These uncommon bacteria are so concerning to the extent the World Health Organization remarked that they have the potential to eclipse COVID-19.&#160; Over the years, many scientists have been exploring different strategies to eradicate superbugs, but one promising solution has been ... <a title=\"Scientists Turn to AI to Fight Antibiotic-Resistant Bacteria “Superbugs”\" class=\"read-more\" href=\"https://www.cryptopolitan.com/scientists-turn-to-ai-to-fight-superbugs/\" aria-label=\"More on Scientists Turn to AI to Fight Antibiotic-Resistant Bacteria “Superbugs”\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T13:34:45.000Z",
    "title": "Britain Outlines Objectives for Global AI Safety Summit in November",
    "url": "https://www.cryptopolitan.com/britain-outlines-objectives-for-global/",
    "description": "The United Kingdom has revealed its key priorities for the upcoming global artificial intelligence (AI) safety summit scheduled for November 1-2. With a focus on comprehending the potential risks posed by cutting-edge AI technology, the summit aims to encourage the development of both national and international frameworks to effectively address these challenges. The summit will ... <a title=\"Britain Outlines Objectives for Global AI Safety Summit in November\" class=\"read-more\" href=\"https://www.cryptopolitan.com/britain-outlines-objectives-for-global/\" aria-label=\"More on Britain Outlines Objectives for Global AI Safety Summit in November\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-04T13:38:40.000Z",
    "title": "FTX’s advertising under scrutiny as DOJ questions FTX.US separation",
    "url": "https://crypto.news/ftxs-advertising-under-scrutiny-as-doj-questions-ftx-us-separation/",
    "description": "The US Department of Justice (DOJ) is scrutinizing the advertising strategy of the now-bankrupt crypto exchange, FTX, as it alleges a blurred distinction between the company's US and international operations."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T13:30:55.000Z",
    "title": "Stellar Tough Spot: Will XLM Prices See A Dip Amid Mid-Range Struggles?",
    "url": "https://www.newsbtc.com/news/stellar-tough-spot-will-xlm-prices-see-a-dip-amid-mid-range-struggles/",
    "description": "Stellar (XLM) investors were in for a surprise over the weekend as the cryptocurrency staged a remarkable comeback, defying the prevailing bearish trend across the crypto market.  The token&#8217;s price surged by 7.3% in the past 24 hours and recorded a 2.3% increase over the past week, now resting at $0.122461 according to CoinGecko. While cryptocurrency enthusiasts are rejoicing over the impressive price performance, the question that lingers on everyone&#8217;s mind is: why did Stellar&#8217;s price jump during the weekend? Two plausible explanations have emerged. Related Reading: Pepe Coin September Challenge: Can It Reach $0.000001 Again? XLM Surge Potential Triggers One likely catalyst for the sudden Stellar surge is the tantalizing tease from its developers regarding an important announcement scheduled for next week. This cryptic hint has stirred anticipation and speculation in the crypto community, with investors eagerly awaiting what could be a game-changing revelation for Stellar. Something cool is dropping in 10 days. Get ready to gear up for a change that&#8217;s got us all excited. Stay curious 😎 pic.twitter.com/CgNzfzwqmc — Stellar (@StellarOrg) September 2, 2023 Another factor that might have contributed to the bullish sentiment around Stellar is the upcoming Meridian event set to be hosted by the blockchain platform later this month in Spain.  Meridian, known as Stellar&#8217;s flagship annual event, is expected to bring together a multitude of influential speakers from the blockchain and cryptocurrency space. Their speeches and insights have the potential to significantly influence market dynamics, possibly explaining the increased demand for XLM. 25 days until #Meridian2023! Get ready to dive into over 70 insightful sessions, connect with industry leaders, and unlock endless possibilities. Grab your spot today! https://t.co/lRAGVzFLRl — Stellar (@StellarOrg) September 1, 2023 Technical Analysis Indicates Potential Challenges Ahead Despite the recent surge, some technical indicators suggest potential challenges for Stellar. XLM has consistently closed daily sessions below the mid-range price of $0.1150, signaling increasing seller leverage. A weekly session closure below this level could confirm the sellers&#8217; advancement, potentially pushing XLM toward the range low of approximately $0.1000. However, this range low is not without its silver lining. It coincides with a daily bullish Order Book (OB) ranging from $0.0953 to $0.0986, creating a strong support zone for the cryptocurrency. Investors will be closely monitoring whether XLM can maintain its foothold in this zone or if further bearish pressure awaits. XLM market cap currently at $3.4 billion in the daily chart: TradingView.com In the past few days, funding rates in the crypto market have been predominantly negative, underscoring the prevailing bearish bias. This bearish sentiment is further supported by the declining Open Interest (OI) rates witnessed in August and early September. The decrease in OI reflects reduced demand for XLM during this period, suggesting that investors remain cautious in the face of market uncertainties. Related Reading: Surging Toncoin Price And Telegram Bot Tokens – What’s The Connection? As the crypto community eagerly anticipates the forthcoming news from Stellar&#8217;s developers and the Meridian event, XLM&#8217;s price trajectory remains uncertain. Traders and investors are advised to exercise caution and closely monitor the evolving market dynamics in the coming days, as these developments could play a pivotal role in determining Stellar&#8217;s future price movements. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from MEXC Blog"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-04T13:37:00.000Z",
    "title": "ADA Fundamentals Suggest It Could Reach a New ATH: Analyst",
    "url": "https://coinedition.com/ada-fundamentals-suggest-it-could-reach-a-new-ath-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak.png 730w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/Will_Cardano_Reach_All_Time_High_Again_2_Years_Since_3_10_Peak-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst Dan Gambardello predicted in his latest YouTube video that the “worst is over” for Cardano (ADA), referring to the overwhelming sell pressure that had plagued the altcoin’s charts in the past few months. He did, however, warn that the altcoin may still experience some volatility and sideways trading during the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-fundamentals-suggest-it-could-reach-a-new-ath-analyst/\">ADA Fundamentals Suggest It Could Reach a New ATH: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-04T13:30:47.000Z",
    "title": "BitTorrent (BTT) Price Prediction 2023-2030: Will BTT Price Reach $0.000001 Soon?",
    "url": "https://coinedition.com/bittorrent-btt-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/BitTorrent-BTT-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BitTorrent (BTT) Price Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/BitTorrent-BTT-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/BitTorrent-BTT-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/BitTorrent-BTT-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/BitTorrent-BTT-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/BitTorrent-BTT-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>BitTorrent is a utility project for file storage that is owned by Tron founder Justin Sun. It is a TRC-20 token. Its native token is denoted by BTT. BitTorrent investors are bullish on the token since it has had a return on investment (ROI) of over 6.88 times in the past 2 years. The crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bittorrent-btt-price-prediction/\">BitTorrent (BTT) Price Prediction 2023-2030: Will BTT Price Reach $0.000001 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-04T13:16:26.000Z",
    "title": "Bitrock Completes Blockchain Security Audit by CTDSEC With 100% Score",
    "url": "https://coinedition.com/bitrock-completes-blockchain-security-audit-by-ctdsec-with-100-score/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec.png 730w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/Bitrock-blockchain-audit-is-now-completed-by-CTDsec-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitrock, the Layer 2 EVM-compatible blockchain, has recently announced the successful completion of its security audit by blockchain security auditing firm, CTDSEC. After several weeks of rigorous analysis, testing, and numerous security enhancements to the Bitrock chain, the audit shows that “all the tests executed to the main branch were 100% successful and 0 vulnerabilities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitrock-completes-blockchain-security-audit-by-ctdsec-with-100-score/\">Bitrock Completes Blockchain Security Audit by CTDSEC With 100% Score</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-09-04T13:16:33.000Z",
    "title": "Bitfinex Alpha | Crypto Asset Funds See Withdrawals, but Bitcoin Remains Stable",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-crypto-asset-funds-see-withdrawals-but-bitcoin-remains-stable/",
    "description": "<p>Short-term data points indicate that&#160; Bitcoin and the broader crypto asset sector are seeing a fall in confidence. As delays continue to plague the long-awaited spot Bitcoin ETF approvals, crypto funds, by the second last week of August, had seen outflows of $168 million, the...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-crypto-asset-funds-see-withdrawals-but-bitcoin-remains-stable/\">Bitfinex Alpha | Crypto Asset Funds See Withdrawals, but Bitcoin Remains Stable</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]