[
  {
    "source": "Crypto Briefing",
    "date": "2024-03-21T21:00:26.000Z",
    "title": "Polkadot’s first meme coin set for public launch today",
    "url": "https://cryptobriefing.com/polkadot-pink-coin-launch/",
    "description": "Get ready for the Polkadot $PINK launch on March 21."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-21T20:53:00.000Z",
    "title": "BlackRock’s $100 Million Institutional Fund Wallet Flooded With Memecoins, NFTs",
    "url": "https://www.cryptoglobe.com/latest/2024/03/blackrocks-100-million-institutional-fund-wallet-flooded-with-memecoins-nfts/",
    "description": "The world’s largest asset manager BlackRock has recently launched its first Ethereum-based tokenized fund, the BlackRock USD Institutional Digital Liquidity Fund (BUIDL), which saw the firm fund an Ethereum wallet with $100 million worth of USDC. This initial foray into crypto, however, has taken an unexpected turn. Following the public identification of BlackRock’s wallet address, a […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T21:00:36.000Z",
    "title": "Bitcoin Cash (BCH) Surges 15% As Coinbase Plans Futures Listing",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/bitcoin-cash-bch-15-coinbase-futures-listing/",
    "description": "Bitcoin Cash (BCH) has registered a sharp 15% rally in the past 24 hours after plans of a futures listing on Coinbase have surfaced for the asset. Coinbase Plans To Launch Bitcoin Cash Futures Product On 1 April As an X user has pointed out, the cryptocurrency exchange Coinbase appears to have filed certifications with the Commodity Futures Trading Commission (CFTC) to list futures products for three coins on its platform: Bitcoin Cash (BCH), Dogecoin (DOGE), and Litecoin (LTC). Related Reading: Bitcoin Traders Capitulate: Here’s What Happened Last 2 Times Coinbase Derivatives LLC quietly filed certifications with CFTC to list US regulated futures for Dogecoin, Litecoin and Bitcoin Cash. They filed them on March 7 and surprisingly nobody seemed to notice. Futures are set to start trading on April 1 if there are no objections from… pic.twitter.com/DYbWjuS6G2 — Summers (@SummersThings) March 20, 2024 As per the CFTC filing, all of these products were certified on March 7, and they are set to go live on trading on the first of the month. The BCH, LTC, and DOGE futures contracts were all certified earlier in the month &#124; Source: CFTC Interestingly, all three of these digital assets happen to be based on the original cryptocurrency: Bitcoin. Bloomberg analyst James Seyffart has hinted that this may be why Coinbase has chosen them. This is interesting&#8230; wonder if the SEC objects to these being classified &#8216;commodities futures&#8217; vs &#8216;securities futures&#8217;. These all forked from Bitcoin so &#8220;these are securities&#8221; claims would be hard to make after spot #Bitcoin ETF approvals. Might be why Coinbase chose them🤔 https://t.co/PRCxzQEYbi — James Seyffart (@JSeyff) March 20, 2024 Unlike LTC and DOGE, which are based initially on BTC&#8217;s code, BCH is a direct fork of the cryptocurrency made to fulfill BTC&#8217;s original purpose as a fast and cheap form of currency that may be used for regular purposes (hence the name). The filling made by Coinbase on Bitcoin Cash reads: The market position of Bitcoin Cash reflects its role as an alternative to Bitcoin that prioritizes transaction efficiency. While it has not matched Bitcoin in terms of market capitalization or price, Bitcoin Cash has established itself as a significant player in the cryptocurrency space, with a dedicated user base and ecosystem. BCH Has Enjoyed A 14% Surge During The Last 24 Hours The cryptocurrency sector has been up in the past day, but two coins in particular have stood out among the top 20 assets by market cap: Bitcoin Cash and Dogecoin. Both of these have managed more than 14% returns in this period, notably outperforming their peers. Bitcoin itself has only been able to put together a rally of about 6%. Given that the Coinbase filling has been making the rounds in this window, it would appear likely that it was at least partially responsible for the extraordinary surges of these coins. Even though Litecoin is also planned to see its futures contract launch on the same day as the other two, its price performance has been more or less in line with the rest of the market with its profits sitting at just 4%. Related Reading: Solana Whale Makes Massive 1,000,000 SOL Deposit To Binance, Bearish Sign? Following the sharp rally, Bitcoin Cash has now arrived at the $424 level. The chart below shows how the cryptocurrency&#8217;s trajectory has looked in the last few days. Looks like price of the asset has shot up over the past day &#124; Source: BCHUSD on TradingView Regarding the market cap, Bitcoin Cash is currently the 17th largest asset. While there is some distance to Polygon (MATIC) in 16th place, LTC may be able to catch it if it can keep up this rally. The BCH market cap seems to be $8.3 billion at the moment &#124; Source: CoinMarketCap Featured image from Shutterstock.com, chart from TradingView.com"
  }
]