[
  {
    "source": "CryptoSlate",
    "date": "2024-02-01T03:00:26.000Z",
    "title": "Here’s why Bitcoin perpetual futures market saw high volatility in January",
    "url": "https://cryptoslate.com/heres-why-bitcoin-perpetual-futures-market-saw-high-volatility-in-january/",
    "description": "<p>January 2024 saw notable fluctuations in Bitcoin&#8217;s perpetual futures market, reflected in the funding rate, open interest (OI), and trading volumes. Perpetual futures, unlike traditional futures, do not have an expiration date, allowing traders to hold positions indefinitely. A critical aspect of these instruments is the perpetual futures funding rate, a mechanism designed to anchor [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/heres-why-bitcoin-perpetual-futures-market-saw-high-volatility-in-january/\">Here&#8217;s why Bitcoin perpetual futures market saw high volatility in January</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-01T03:04:25.000Z",
    "title": "Celsius exits bankruptcy, begins distributing over $3 billion to creditors",
    "url": "https://cryptobriefing.com/celsius-exits-bankruptcy-distributing-3-billion-to-creditors/?utm_source=feed&utm_medium=rss",
    "description": "Celsius is now winding down operations and discontinuing its mobile and web platforms to manage crypto loans and savings accounts."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-01T03:00:08.000Z",
    "title": "Binance Sets New Record: Spot Trading Volume Reaches $427 Billion",
    "url": "https://www.newsbtc.com/binance/binance-sets-new-record-spot-trading-volume-reaches-427-billion/",
    "description": "According to a recent CoinGecko report, Binance, the world&#8217;s largest centralized exchange (CEX) by trading volume, has retained its market leadership position in 2023.  Despite facing increased regulatory scrutiny and undergoing significant leadership changes, Binance maintained a market share of 43.7% and saw its spot trading volume rise to $427.1 billion in December 2023, representing a 37.5% month-on-month (MoM) increase. Binance Trading Volume Reached $3.8 Trillion In 2023 According to CoinGecko’s report, Binance started the year with a commanding 63.5% market share but experienced a gradual decline throughout 2023, ending with a 43.7% market share in December.  While Binance still dominated the market with 52.6% of the total spot trading volume in 2023, the exchange&#8217;s relative market share decline was notable. In absolute terms, Binance generated $3.8 trillion in trading volume throughout the year. Related Reading: Analyst Compared Solana To Ethereum ICO Boom, What Does This Mean For SOL Price? As previously reported, Binance faced significant regulatory pressure throughout 2023, culminating in a settlement agreement in November that required the exchange to pay a $4.3 billion fine to the Department of Justice (DOJ) and the Commodity Futures Trading Commission (CTFC) for alleged financial breaches.  As part of the settlement, Binance&#8217;s CEO, Changpeng Zhao (CZ), also agreed to step down. Richard Teng has assumed the role of the company&#8217;s head, while CZ remains restricted from traveling outside the jurisdiction of the United States as the legal battle unfolds.  Upbit And OKX Follow Closely Upbit, South Korea&#8217;s largest cryptocurrency exchange, managed to maintain its position as the second-largest centralized exchange in 2023, with a 9.5% market share and $687.0 billion in spot trading volume for the year. According to the report, Upbit benefited from the Kimchi Premium, which resulted in strong local demand and premium prices for crypto assets.  The exchange&#8217;s monthly spot trading volume hit a yearly high of $90.7 billion in December, with a 93.5% quarter-on-quarter (QoQ) increase. Related Reading: Shiba Inu Prints Rare Bullish Signal, Eyes This Price Target Conversely, OKX secured the third position among centralized exchanges in 2023, with a 6.7% market share and $485.9 billion in trading volume. Throughout the year, OKX experienced a steady increase in market share, starting at 5.1% in January and ending at 8.9% in December. The exchange&#8217;s trading volume in Q4 reached $177.9 billion, reflecting a notable 151.6% QoQ gain. Among the top 10 centralized exchanges, CoinGecko reports that MEXC recorded the highest growth in Q4 2023, with trading volume surging by 203.7% to $90.4 billion.  Bybit followed closely with a growth rate of 162.1% ($107.5 billion), while KuCoin experienced a growth rate of 161.2% ($49.2 billion). KuCoin regained its spot in the Top 10 in Q4 after briefly losing it in Q3, with a market share of 3.3% at the end of December. Binance Coin (BNB) has successfully maintained its position above the $300 threshold, with the current trading price standing at $304. This represents a 1.8% decrease in price over the past 24 hours. Featured image from Shutterstock, chart from TradingView.com "
  }
]