[
  {
    "source": "NewsBTC",
    "date": "2023-11-16T05:06:14.000Z",
    "title": "Ethereum Price Bullish Momentum Reignites – Can Bulls Pust ETH To $2,200?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bullish-momentum-2200/",
    "description": "Ethereum price remained strong and started a fresh increase above $2,000. ETH could continue to rise if it clears the $2,075 resistance zone. Ethereum is again moving higher above the $2,000 support zone. The price is trading above $2,000 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $2,046 on the hourly chart of ETH/USD (data feed via Kraken). The pair could accelerate higher if it clears the $2,075 resistance zone in the near term. Ethereum Price Reclaims $2K After a downside correction, Ethereum price found support near the $1,920 zone. ETH traded as low as $1,933 and recently started a fresh increase like Bitcoin. There was a clear move above the $1,950 and $1,975 resistance levels. There was a close above the 50% Fib retracement level of the downward move from the $2,118 swing high to the $1,933 low. Finally, it settled above the main $2,000 resistance zone. Ethereum is now trading above $2,000 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $2,046 on the hourly chart of ETH/USD. Immediate resistance is near the $2,075 zone. It is close to the 76.4% Fib retracement level of the downward move from the $2,118 swing high to the $1,933 low. Source: ETHUSD on TradingView.com The next major resistance sits at $2,120. A close above the $2,120 resistance could start another strong increase. The first resistance is near $2,150, above which the price could aim for a move toward the $2,200 level. Any more gains could start a wave toward the $2,250 level. More Losses in ETH? If Ethereum fails to clear the $2,075 resistance or the $2,120 pivot level, it could start a fresh decline. Initial support on the downside is near the $2,045 level or the trend line. The next key support is $2,025 or the 100-hourly Simple Moving Average. The main support is $2,000. A downside break below the $2,000 support might start a steady decline. In the stated case, Ether could drop toward the $1,920 support zone in the near term. Any more losses might call for a drop toward the $1,850 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,025 Major Resistance Level – $2,120"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-16T04:40:58.000Z",
    "title": "Public Versus Private Blockchains – Choosing the Right Model for Your Needs",
    "url": "https://dailyhodl.com/2023/11/15/public-versus-private-blockchains-choosing-the-right-model-for-your-needs/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/blockchain-lends-former-insider.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchains are decentralized and distributed ledgers that can record any information including financial transactions across a network of computers. A block is an information system that holds a group of transactions or recordings in chronological order and is connected to other blocks, forming a chain. Hence, the name of the technology is &#8216;blockchain.&#8217; Cryptocurrencies – [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/15/public-versus-private-blockchains-choosing-the-right-model-for-your-needs/\">Public Versus Private Blockchains – Choosing the Right Model for Your Needs</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]