[
  {
    "source": "Crypto Briefing",
    "date": "2024-02-09T23:38:48.000Z",
    "title": "dYdX Foundation secures $30M in funding from community treasury for ecosystem growth",
    "url": "https://cryptobriefing.com/dydx-foundation-30-funding-community-treasury/?utm_source=feed&utm_medium=rss",
    "description": "The dYdX Foundation announced it has successfully secured $30 million in DYDX tokens from the dYdX Chain Community Treasury, following a community vote where 98% supported the Foundation Fundraise proposal."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-09T23:14:10.000Z",
    "title": "Ethereum could end 2024 close to $4,900: Finder survey",
    "url": "https://cryptobriefing.com/ethereum-could-2024-4900-survey/?utm_source=feed&utm_medium=rss",
    "description": "Ethereum's 2024 outlook shines with a peak forecast of $5,300, hinting at nearing its all-time high."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-09T23:28:00.000Z",
    "title": "All-Time Highs Ahead? Bitcoin Price Poised for Major Jump After Supply Cut, Analyst Claims",
    "url": "https://www.cryptoglobe.com/latest/2024/02/all-time-highs-ahead-bitcoin-price-poised-for-major-jump-after-supply-cut-analyst-claims/",
    "description": "A popular cryptocurrency analyst and trader has recently revealed he believes the price of the flagship cryptocurrency Bitcoin ($BTC) could enter a parabolic phase following the upcoming halving event in April, which will reduce the supply on new BTC entering the market in half. In a video he published for his 71,700 subscribers on the […]\n"
  },
  {
    "source": "NullTX",
    "date": "2024-02-09T23:34:13.000Z",
    "title": "Space ID Token Surges 22% Gain Despite Declining Trading Volume Of Over 50%",
    "url": "https://nulltx.com/space-id-token-surges-22-gain-despite-declining-trading-volume-of-over-50/",
    "description": "Space ID, a rising star in the cryptocurrency market, continues to exhibit bullish momentum across all time frames, boasting an impressive 22% gain in the last 24 hours, despite a nearly 50% decline in the 24-hour trading volume. Recent developments shed light on the movements of significant wallets in the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-09T23:28:45.000Z",
    "title": "Litecoin Rebounds Above $70, Potential Bullish Run Ahead",
    "url": "https://nulltx.com/litecoin-rebounds-above-70-potential-bullish-run-ahead/",
    "description": "Litecoin (LTC) has shown signs of resurgence, climbing back above the $70 mark for the first time since January 22nd. Currently trading at $71.22, LTC has recorded a notable 3% gain in the past 24 hours. ⚡️📈 #Litecoin has had a mild emergence, rebounding back above $70 for the first [&#8230;]"
  }
]