[
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T20:30:55.000Z",
    "title": "South Korean regulator outlines steps to enhance digital asset legislation",
    "url": "https://cointelegraph.com/news/south-korean-regulator-enhance-digital-asset-legislation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4b3fd900-92e1-43fd-92a0-8c7683bfdd2a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Virtual Asset Users Protection Act was passed in June without a sufficient regulatory framework, the head of South Korea’s Financial Supervisory Service said. </p>\n                    <p><p>South Korea’s Financial Supervisory Service (FSS) is preparing regulations to supplement the Virtual Asset Users Protection Act passed earlier this year, according to local reports. New regulations should be ready by January, well ahead of the law entering into force, the FSS head said.</p><p>The South Korean National Assembly Political Affairs Committee conducted an audit of the FSS on Oct. 17, at which FSS head Lee Bok-hyeon <a href=\"https://biz.sbs.co.kr/article/20000139678\" target=\"_blank\" rel=\"noopener nofollow\">responded</a> to criticism that South Koreans were losing money on crypto “burger coins,” Korean slang for foreign-issued cryptocurrencies that are traded in South Korea. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Lee Bok-hyun, the governor of South Korea&#39;s Financial Supervisory Service, made an unannounced two-day visit to China last week, marking the first visit there by an FSS head in six years.<a href=\"https://t.co/tK360ZYnOD\">https://t.co/tK360ZYnOD</a></p>&mdash; The Korea Herald 코리아헤럴드 (@TheKoreaHerald) <a href=\"https://twitter.com/TheKoreaHerald/status/1699672177790898282?ref_src=twsrc%5Etfw\">September 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The FSS will <a href=\"https://www.edaily.co.kr/news/read?newsId=02952006635773904&amp;mediaCodeNo=257&amp;OutLnkChk=Y\" target=\"_blank\" rel=\"noopener nofollow\">establish</a> standards for listing procedures, internal controls, and issuance and distribution of virtual assets, as well as a “virtual asset market supervision and inspection system,” according to the South Korean press coverage of the audit. Lee said the coming regulations were being discussed with the Digital Asset eXchange Association (DAXA), which is <a href=\"https://en.yna.co.kr/view/AEN20230704004000320\" target=\"_blank\" rel=\"noopener nofollow\">made</a> up of local crypto exchanges Upbit, Bithumb, Coinone, Korbit and Gopax. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/south-korea-otc-crypto-regulations\">South Korea focuses on OTC crypto regulations as unlawful deals reach $4B</a></em></strong></p><p>Lee said <a href=\"https://cointelegraph.com/news/south-korea-passes-bill-to-tackle-unfair-cryptocurrency-trading\">the legislation passed in June</a> was lacking in regulatory detail. The law established criminal liability for violations, but, according to Lee, it did not give his agency sufficient authority. “If there is truly an act that amounts to manipulation of distribution volume through staking or unfair disclosure, we will consult with DAXA,\" Lee said. He continued: </p><blockquote>“There are related systems in place in the securities sector for various screenings related to the issuance market, but there are no related systems in place at DAXA or individual exchanges.”</blockquote><p>South Korean law enforcement has announced plans to <a href=\"https://cointelegraph.com/news/crypto-south-korea-strengthens-crypto-regulation-with-lei-adoption-and-crime-unit\">establish a joint virtual-asset crime investigation</a> unit called the Joint Investigation Centre for Crypto Crimes. It will have a staff of 30 taken from other government agencies, including the FSS, National Tax Service, Korea Customs Service and others. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/unique-amazing-south-koreas-cryptoverse/\">South Korea’s unique and amazing crypto universe</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T20:22:13.000Z",
    "title": "Why is the crypto market up today?",
    "url": "https://cointelegraph.com/news/why-is-the-crypto-market-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/a633230d-3f9a-4749-8bab-017c4b9435a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto market is up today as crypto market volumes reach October highs.</p>\n                    <p><p>The crypto market is up today as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) and numerous altcoins rallied to restore the bullish momentum commonly associated with “Uptober.”. Crypto and equities continued positive growth, bringing the total crypto market cap up to $1.1 trillion on Oct. 17.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/293d8c97-7115-4549-ba39-66e8b0a217f0.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto total market. Source: </em><a href=\"http://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto: Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><p>Let’s examine three of the major factors influencing today’s crypto market rally.</p><h2>Uptober sees the highest daily volume</h2><p>October has historically been celebrated as “<a href=\"https://cointelegraph.com/news/btc-price-uptober-up-5-things-bitcoin-this-week\">Uptober</a>” due to the positive returns in the crypto market. Bitcoin and crypto market volume rallied from $1 billion to over $2.7 billion on October 15. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d07141fa-dbc1-480e-864d-1e618ac530a1.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market volume. Source: DefiLllama</em></figcaption></figure><p>There is optimism surrounding the increase in volume as the seasonality of Bitcoin’s returns in October has remained positive, only failing to achieve gains 3 times in the month. The volume on Oct. 15 recorded the largest daily trading volume for the entire month. Combined with such a strong history, this makes October statistically one of the strongest months for Bitcoin price gains.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/47522b0f-cddd-4e25-beb0-b74fbb127bf8.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin returns by month. Source: Look Into Bitcoin</em></figcaption></figure><p>A strong October is much needed after the third quarter of 2023 equated to <a href=\"https://cointelegraph.com/news/700-m-loss-crypto-hacks-exploits-scams-q3-certik\">$700 million in losses</a> due to various hacks. Adding to this total, on Oct. 17, <a href=\"https://cointelegraph.com/news/fantom-foundation-hacked-october-17-report\">Fantom Foundation’s</a> hot wallet was hacked for $550,000 worth of crypto. </p><h2>Bitcoin dominance</h2><p>Bitcoin is regaining dominance in the crypto market before the supply halving in April 2024. For the first time since June 28, Bitcoin is above the 50% market when compared to the entire crypto market cap. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/72b6b7e1-8564-4810-b71e-917032c82e2a.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin dominance versus crypto market. Source: Coinglass</em></figcaption></figure><p>Typically, when Bitcoin dominance plateaus, there is a rush to altcoins and other cryptocurrencies. The dominance comes on the heels of Bitcoin models showing BTC’s potential to <a href=\"https://cointelegraph.com/news/btc-price-models-130k-target-024-bitcoin-halving\">reach $130,000</a> after the 2024 BTC halving event. </p><h2>Crypto liquidations rule the day</h2><p>The crypto market rally started on Oct. 16 and fueled a wave of short position liquidations across the market, totaling over $64 million in 24-hours. Bitcoin short liquidations lead the way with the largest single liquidation of $2.53 million in one transaction on the Binance exchange.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/30c2beb0-27a0-4582-85ff-db7cda8283fe.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin liquidations. Source: Coinglass</em></figcaption></figure><p>Despite the short-seller losing streak, 50.9% of the futures market remains short. With the ratio remaining skewed short, a potential opportunity for a short-squeeze could lead to further price upside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ccf99c75-6cb8-4762-99cb-d1dd9ef11f5e.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin short vs. long ratio. Source: Coinglass</em></figcaption></figure><h2>Macro factors could benefit the crypto market </h2><p>Despite the <a href=\"https://cointelegraph.com/search?query=sec\">Securities and Exchange Commission (SEC)</a> refusing to approve a Bitcoin ETF and their continued war on the crypto market, large institutions remain interested in the space.</p><p>Such interest has led VanEck and Bitwise to both launch Ethereum ETFs on Oct. 2. The Bitwise ETF will launch on the <a href=\"https://cointelegraph.com/news/bitwise-announces-ethereum-etf-launch-on-october-2\">Chicago Mercantile Exchange (CME)</a> and the VankEck Ether ETF will launch on the <a href=\"https://cointelegraph.com/news/van-eck-ethereum-strategy-etf-launches-cboe\">Chicago Board Options Exchange (CBOE)</a>. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-price-holds-gains-bitcoin-28k-support\"><strong><em>BTC price holds 6% gains as Bitcoin battles for ‘crucial’ $28K support</em></strong></a></p><p>While Bitcoin and altcoins still have overhanging risk events that could impact the price, the growing institutional interest is improving sentiment across the market. The Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Fear &amp; Greed Index</a> highlights the improved sentiment, noting a 6-point increase over the last month. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f0822955-614c-483b-aed4-0fc496987f81.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Fear &amp; Greed Index. Source: Alternative.me</em></figcaption></figure><p>Overall, crypto markets are likely to continue to experience price volatility. While the positive October price action is providing a nice short-term bump in crypto prices, the market’s reaction to any new enforcement actions or an economic recession will be the true determinant of the direction the market chooses to take. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T20:11:50.000Z",
    "title": "US expands export controls for AI semiconductor chips to China ",
    "url": "https://cointelegraph.com/news/us-expands-export-controls-ai-chips-china",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e5f40b4a-dbc6-4d8a-8167-aa3f1c1b8f27.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The expanded export controls of AI semiconductor chips include a new performance threshold, licensing requirements expansions and a notification requirement, among others. </p>\n                    <p><p>The United States Department of Commerce’s Bureau of Industry and Security (BIS) released a <a href=\"https://www.bis.doc.gov/index.php/documents/about-bis/newsroom/press-releases/3355-2023-10-17-bis-press-release-acs-and-sme-rules-final-js/file\" target=\"_blank\" rel=\"noopener nofollow\">notice</a> on Oct. 17 expanding the already existing export controls of artificial intelligence (AI) chips to China. </p><p>The BIS wrote that the newly released rules “reinforce” those put in place back in October 2022, with the goal of restricting China’s ability to “both purchase and manufacture certain high-end chips critical for military advantage.”</p><p>Under Secretary of Commerce for Industry and Security Alan F. Estevez commented on the new controls sayin</p><blockquote>“Export controls are a powerful national security tool, and the updates released today build on our ongoing assessment of the U.S. national security and foreign policy concerns that the PRC’s military-civil fusion and military modernization present.” </blockquote><p>One of the updated rules includes a new “performance threshold” on chips that can be exported from the U.S. </p><p>Previously, the highest-performing chips of the <a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap#:~:text=Computer%20chip%20manufacturer%20Nvidia%20briefly,intelligence%20tech%20reached%20a%20crescendo.\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap#:~:text=Computer%20chip%20manufacturer%20Nvidia%20briefly,intelligence%20tech%20reached%20a%20crescendo./amp\">leading companies, like Nvidia</a> and AMD, were the main targets of the export rules, allowing the companies to still export other models to China such as Nvidia’s A800 and H800. </p><p>However, the updated rule will now make it so even the A800 and H800 chips will be embargoed from exports to China. China is one of Nvidia’s largest markets along with Taiwan and the U.S.</p><p>The rule also requires the notification of exporting “certain additional chips” just below the performance threshold, after which the government will determine if the transaction can proceed. </p><p>Along with the restrictions the U.S. government said it will introducing a new exemption that will permit the export of chips for consumer applications. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nyc-mayor-releases-plans-responsible-ai-usage-local-government\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nyc-mayor-releases-plans-responsible-ai-usage-local-government/amp\"><strong><em>NYC mayor releases plans for responsible AI usage in local government</em></strong></a></p><p>In addition to the new performance threshold, BIS also released a framework through which it intends <a href=\"https://cointelegraph.com/news/biden-tightening-ai-chip-controls-china-third-parties\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/biden-tightening-ai-chip-controls-china-third-parties/amp\">to prevent circumvention</a> of the rules. </p><p>These include establishing a worldwide licensing requirement for the export of controlled chips to any U.S.-embargoed country, creating new red flags to help identify restricted chips, creating a notification requirement for high-end gaming chip exports and requesting public comment on various related topics. </p><p>The administration also intends to control exports of manufacturing equipment and materials to make high-end chips. </p><p>According to the notice, the rules will be in effect from Nov. 16, 2023, with public comments about the rules having a deadline of 60 days thereafter.</p><p>This update to the export conditions comes as Chinese tech company Baidu announced the release of <a href=\"https://cointelegraph.com/news/baidu-unveils-ernie-4-0-ai-system-overall-performance-par-chat-gpt\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/baidu-unveils-ernie-4-0-ai-system-overall-performance-par-chat-gpt/amp\">version 4.0 of its AI chatbot Ernie</a>, which it claims to be on par with OpenAI’s ChatGPT. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T20:38:16.000Z",
    "title": "Federal Reserve reiterates hatred for stablecoins, CBDC",
    "url": "https://www.cryptopolitan.com/fed-reiterates-hate-for-stablecoins-cbdc/",
    "description": "Amidst the whirlwind of technological advancements, it&#8217;s clear that the digital transformation is not sparing the world of finance. However, the Federal Reserve is not about to embrace every twist and turn of this revolution without a fight. The Fed&#8217;s attitude towards Central Bank Digital Currencies (CBDCs) and stablecoins is getting tougher by the day. ... <a title=\"Federal Reserve reiterates hatred for stablecoins, CBDC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fed-reiterates-hate-for-stablecoins-cbdc/\" aria-label=\"More on Federal Reserve reiterates hatred for stablecoins, CBDC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T20:37:12.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin, capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T20:27:23.000Z",
    "title": "Binance.US halts direct dollar withdrawals amid regulatory scrutiny",
    "url": "https://www.cryptopolitan.com/binance-us-halts-direct-dollar-withdrawals-amid-regulatory-scrutiny/",
    "description": "Binance.US, the American subsidiary of the global cryptocurrency exchange, has updated its terms of service. Consequently, users can no longer withdraw U.S. dollars directly from the platform. Effective immediately, customers wishing to withdraw must first convert U.S. dollar funds to stablecoins or other digital assets. These assets can then be withdrawn, thus introducing an extra ... <a title=\"Binance.US halts direct dollar withdrawals amid regulatory scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-us-halts-direct-dollar-withdrawals-amid-regulatory-scrutiny/\" aria-label=\"More on Binance.US halts direct dollar withdrawals amid regulatory scrutiny\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T20:20:23.000Z",
    "title": "How AI Could Save Women From Maternal Mortality",
    "url": "https://www.cryptopolitan.com/ai-could-save-women-from-maternal-mortality/",
    "description": "Pregnant women often face maternal health complications that end up taking their life. This unfortunate reality seems more common among black women, particularly in the United States.&#160; Data from the Centers for Disease Control and Prevention showed that in 2020, the maternal mortality rate for Black women was 55.3 deaths per 100,000 live births, which ... <a title=\"How AI Could Save Women From Maternal Mortality\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-could-save-women-from-maternal-mortality/\" aria-label=\"More on How AI Could Save Women From Maternal Mortality\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-17T20:30:00.000Z",
    "title": "Is Ripple Labs the Next Amazon? Crypto Expert Draws Similarities",
    "url": "https://coinedition.com/is-ripple-labs-the-next-amazon-crypto-expert-draws-similarities/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple&#039;s Head of Policy Advocates for CBDC Adoption in the UK\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Ripples-Head-of-Policy-Advocates-for-CBDC-Adoption-in-the-UK-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent video, crypto expert Jason Friedman, host of the A Chain of Blocks YouTube Channel, suggested blockchain payment service company Ripple Labs is modeling its business after that of American tech giant Amazon. Friedman referenced a 1999 late-night interview where Jeff Bezos explained why Amazon had not reported profits in previous years. Bezos [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-ripple-labs-the-next-amazon-crypto-expert-draws-similarities/\">Is Ripple Labs the Next Amazon? Crypto Expert Draws Similarities</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]