[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-12T07:57:01.000Z",
    "title": "XRP (XRP/USD) Price Analysis for 12 June 2023: ‘Technical Indicators Suggest a Strong Sell Sentiment’",
    "url": "https://www.cryptoglobe.com/latest/2023/06/xrp-xrp-usd-price-analysis-for-12-june-2023-technical-indicators-suggest-a-strong-sell-sentiment/",
    "description": "Introduction This report provides a comprehensive analysis of XRP (XRP)’s price dynamics on Binance, covering technical indicators, moving averages, pivot points, and more. Price and Volume Snapshot At the time of the report, XRP (XRP) was priced at $0.51780, experiencing an increase of $0.01230 (+2.43%) compared to the previous period. The snapshot was taken at […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T08:05:29.000Z",
    "title": "Crypto Veteran Howard Yuan Joins LBank Labs as Venture Partner",
    "url": "https://cryptodaily.co.uk/2023/06/crypto-veteran-howard-yuan-joins-lbank-labs-as-venture-partner",
    "description": "<p>Road Town, British Virgin Islands, June 12th, 2023, Chainwire</p><p>LBank Labs, the leading venture fund of global crypto exchange LBank, is thrilled to announce the addition of Howard Yuan to its team. Yuan brings a wealth of experience and expertise in the crypto industry, making him a valuable asset to the organization.</p><p>With a background as a crypto OG and extensive experience as a venture capitalist, Yuan has played a pivotal role in the success of numerous projects throughout his career. Prior to joining LBank Labs, Yuan served as the managing partner for Fundamental Labs, and also held significant management positions at prestigious companies such as IBM and E&amp;Y. Yuan&rsquo;s long-term optimistic outlook on the crypto industry has consistently guided his decision-making and investments.&nbsp;</p><p>During his tenure at Fundamental Labs, Howard Yuan made strategic investments in prominent projects such as Coinbase (Coin), Binance (BNB), Polkadot (DOT), Avalanche (AVAX), Conflux (CFX), Stacks (STX), Certik (CTK), NEAR, Mask, and RSS3.</p><p>In Yuan's new role as Venture Partner at LBank Labs, Yuan will leverage his extensive experience and expertise to propel the fund to new heights. Yuan aims to position LBank Labs as the leading global VC fund for blockchain and decentralized finance, facilitating the growth of innovative startups and contributing to the development of a prosperous Web3 future.</p>While acknowledging the inherent volatility of crypto markets, Yuan is confident in the underlying order and innovation within the industry. &ldquo;I will work closely with the LBank Labs team to identify and support the most talented entrepreneurs, overcoming challenges and building a thriving ecosystem,&rdquo; Yuan said. When asked about the most remarkable trends he has witnessed in the industry, he highlighted the exciting mass adoption, maturing infrastructure, and emergence of new protocols. &ldquo;Despite the current bearish sentiment in the crypto market, I believe that this is an opportune time to help early-stage Web3 startups navigate the bear cycle and achieve success,&rdquo; he explained.<p>LBank Labs is delighted to welcome Howard Yuan to the team and is excited to harness his insights and knowledge. With Yuan's addition, LBank Labs reinforces its global commitment to nurturing and empowering the next generation of blockchain and cryptocurrency startups.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrency.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram&nbsp;l&nbsp;Twitter&nbsp;l&nbsp;Facebook&nbsp;l&nbsp;LinkedIn&nbsp;l&nbsp;Instagram&nbsp;l&nbsp;YouTube</p>ContactGlobal PR DirectorJeremy Van der HaegenLBankpress@lbank.info"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T07:57:29.000Z",
    "title": "Polygon Responds to SEC’s Claim of MATIC Being a Security",
    "url": "https://cryptodaily.co.uk/2023/06/polygon-responds-to-secs-claim-of-matic-being-a-security",
    "description": "<p>Polygon Labs has responded to the SEC&rsquo;s claims that its native token MATIC is an unregistered security. </p>\n<p>The US SEC last week labelled Polygon and other popular cryptocurrencies unregistered securities in a lawsuit filed against crypto exchange Binance.</p>\n<p>The SEC named Solana (SOL), Cardano (ADA), Cosmos Hub (ATOM), Filecoin (FIL), Decentraland (MANA), Algorand (ALGO), The Sandbox (SAND), Coti (COTI), and Axie Infinity (AXS) as unregistered securities.</p>\nRobinhood Delists Solana, Cardano and Polygon\n<p>Following the SEC&rsquo;s lawsuits, trading app Robinhood announced it would end support for SOL, ADA, and MATIC on June 27.</p>\n<p>Robinhood limited its delisting to SOL, ADA, and MATIC and said to users that no other coins would be affected and would remain safe on its platform.</p>\nPolygon Responds to SEC Claims\n<p>Polygon Labs responded to the SEC&rsquo;s allegations on Friday.</p>\n\n<p dir=\"ltr\" lang=\"en\">We are proud of the history of the Polygon network &ndash; developed outside the US, deployed outside the US, and focused to this day on the global community that supports the network. MATIC was a necessary part of the Polygon technology from Day 1, ensuring that the network would be&hellip;</p>\n&mdash; Polygon (Labs) (@0xPolygonLabs) June 10, 2023\n<p>\n\n</p>\n<p>They stated that the token was &ldquo;developed outside the U.S., deployed outside the U.S. and focused to this day on the global community that supports the network.&rdquo;</p>\n<p>It further claimed:</p>\n\n<p>MATIC was a necessary part of the Polygon technology from Day 1, ensuring that the network would be secure &mdash; and remains so to this day.</p>\n\n<p>Polygon also noted that its actions did not target the US at any time:</p>\n\n<p>Given our focus on network security, we made sure MATIC was available to a wide group of persons, but only with actions that did not target the US at any time.</p>\n\nMarket Takes a Dive\n<p>In the days following the SEC&rsquo;s claims against Binance and rival exchange Coinbase, the overall crypto market appeared to hold firm.</p>\n<p>However, Saturday was an absolute bloodbath, with ADA, SOL and MATIC seeing double-digit losses.</p>\n<p>Data from CoinMarketCap reveals MATIC&rsquo;s price declined by 33% in the past week. At the time of writing, MATIC changed hands at $0.64.</p>\n<p></p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T07:42:43.000Z",
    "title": "How Crypto and Blockchain Impact Economy, World Economic Forum 2023",
    "url": "https://www.cryptopolitan.com/wef-crypto-and-blockchain-technologies/",
    "description": "In a world constantly shaped by technological advancements, the World Economic Forum (WEF) has pronounced a resounding statement: Crypto and blockchain technologies are set to become an inseparable part of the modern economy. As the global stage for innovative ideas and forward-thinking, the WEF&#8217;s affirmation holds immense significance. With their potential to revolutionize industries and ... <a title=\"How Crypto and Blockchain Impact Economy, World Economic Forum 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wef-crypto-and-blockchain-technologies/\" aria-label=\"More on How Crypto and Blockchain Impact Economy, World Economic Forum 2023\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T08:06:02.000Z",
    "title": "Polygon (MATIC) Price Prediction: Collateral Network (COLT) and Chainlink (LINK) Hold Fast Amidst the Crypto Bear Market",
    "url": "https://www.crypto-news-flash.com/polygon-matic-price-prediction-collateral-network-colt-and-chainlink-link-hold-fast-amidst-the-crypto-bear-market/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-price-prediction-collateral-network-colt-and-chainlink-link-hold-fast-amidst-the-crypto-bear-market",
    "description": "In the midst of a bearish crypto market, certain projects stand out for their resilience and potential for growth. Among these are Polygon (MATIC), Collateral Network (COLT), and Chainlink (LINK), each offering unique solutions that have kept investors interested despite the market downturn. &#62;&#62;BUY COLT TOKENS NOW&#60;&#60; Polygon (MATIC): A Force in the Tokenization Market [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T08:05:34.000Z",
    "title": "Crypto Veteran Howard Yuan Joins LBank Labs as Venture Partner",
    "url": "https://www.crypto-news-flash.com/crypto-veteran-howard-yuan-joins-lbank-labs-as-venture-partner/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-veteran-howard-yuan-joins-lbank-labs-as-venture-partner",
    "description": "Road Town, British Virgin Islands, June 12th, 2023, Chainwire LBank Labs, the leading venture fund of global crypto exchange LBank, is thrilled to announce the addition of Howard Yuan to its team. Yuan brings a wealth of experience and expertise in the crypto industry, making him a valuable asset to the organization. With a background [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T08:01:15.000Z",
    "title": "Art NFT Marketplace and Community HeartX Announced its Open Beta Launch",
    "url": "https://www.crypto-news-flash.com/art-nft-marketplace-and-community-heartx-announced-its-open-beta-launch/?utm_source=rss&utm_medium=rss&utm_campaign=art-nft-marketplace-and-community-heartx-announced-its-open-beta-launch",
    "description": "Central, Singapore, June 12th, 2023, Chainwire HeartX, a Web3 art NFT marketplace and community, is excited to announce the Open Beta launch of its app product. This marks a significant milestone in the development of the platform, bringing the power of blockchain technology and a vibrant art community together. HeartX has been deployed on zkSync [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-12T07:58:41.000Z",
    "title": "Can PEPE Beat Shiba Inu?",
    "url": "https://www.altcoinbuzz.io/reviews/can-pepe-beat-shiba-inu/",
    "description": "<p>Memecoin season was raging recently. However, it seems to slowly come to an end. The biggest new kid on the meme block was most likely PEPE. So, can PEPE beat a longer-standing meme coin, like Shiba Inu? To answer this, we need to look at some facts.  So, the best way is to dive into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/can-pepe-beat-shiba-inu/\">Can PEPE Beat Shiba Inu?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T07:56:22.000Z",
    "title": "Crypto Analyst: Recent Volatility Pushed BTC Into Critical Region",
    "url": "https://coinedition.com/crypto-analyst-recent-volatility-pushed-btc-into-critical-region/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/So-much-going-on-in-crypto-this-week-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/So-much-going-on-in-crypto-this-week-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/So-much-going-on-in-crypto-this-week-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/So-much-going-on-in-crypto-this-week.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The recent Bitcoin price volatility is setting the crypto market up for a potential bull run, according to Dan Gambardello, founder of Crypto Capital Venture. In a video posted to YouTube, Gambardello analyzed Bitcoin’s recent price behavior and compared it with a historical pattern. According to Gambardello, closing below the 20-week moving average on the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-recent-volatility-pushed-btc-into-critical-region/\">Crypto Analyst: Recent Volatility Pushed BTC Into Critical Region</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]