[
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T17:20:25.000Z",
    "title": "Security or not, Ethereum price looks poised to hold the $1.8K level based on 3 key metrics",
    "url": "https://cointelegraph.com/news/security-or-not-ethereum-price-looks-poised-to-hold-the-1-8k-level-based-on-3-key-metrics",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b0c16b9b-63f7-47fa-bdea-9ada0a043e29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum could eventually fall afoul of the SEC, but at the moment, key data points suggest ETH is poised to hold the $1,800 level.</p>\n                    <p><p>Ether’s (<a href=\"https://cointelegraph.com/bitcoin-price\">ETH</a>) price retested $1,780 after the news of the U.S. Securities and Exchange Commission suing cryptocurrency exchanges Binance and Coinbase but it’s not preposterous to suggest that Ether bulls should be more than happy that its price did not break below the 67-day support. </p><p>The SEC actions are actually a double-edged sword for Ethereum and on crypto Twitter, some analysts attributed the bounce in Ether as a result of it <a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today\">not being listed as a security</a> in either of the cases brought against Binance and Coinbase. For instance, the SEC explicitly mentioned <a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>, Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) and Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), which are direct competitors to Ethereum’s smart contract processing capabilities.</p><p>However, as noted by analyst Jevgenijs Kazanins, Ether’s omission does not mean that it has the green light from the SEC.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SEC did not mention <a href=\"https://twitter.com/hashtag/ETH?src=hash&amp;ref_src=twsrc%5Etfw\">#ETH</a> in the list of tokens that it considers to be securities when suing Coinbase and Binance. Could it be that the SEC is working on a separate lawsuit targeting Ethereum Foundation?</p>&mdash; Jevgenijs Kazanins (@jevgenijs) <a href=\"https://twitter.com/jevgenijs/status/1666066370793021440?ref_src=twsrc%5Etfw\">June 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kazanins raises the question of whether the SEC could be targeting the Ethereum Foundation in a separate lawsuit. For now, the idea is a mere unfounded speculation, but it certainly has merit given that SEC chairman Gary Gensler refused <a href=\"https://cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security\">to answer questions about Ethereum’s status</a> before the U.S. House Financial Services Committee in April 2023.</p><p>In the meantime, what we can focus on is Ether’s price action, network data and other data which impacts investor sentiment and price in the short-term.</p><h2>Ethereum Dapps get a slight boost </h2><p>TVL measures the deposits locked in Ethereum's decentralized applications, which have been in a downtrend since mid-March. The indicator reached a 14.35 million ETH bottom on June 3, but bounced back to 14.6 million ETH by June 6, according to DefiLlama.</p><p>The number of active addresses interacting with decentralized applications (DApps) is also in a slump. Over the last 30 days, the top 12 DApps running on the Ethereum network saw a 4% increase in active addresses, even though the average transaction gas fee remained above $6.5.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/701c7fd3-3b05-45aa-ba37-f55a14c81299.png\"  /><figcaption style=\"text-align: center;\"><em>30-day Ethereum DApp activity. Source: DappRadar</em></figcaption></figure><p>If investors fear that Ether has higher odds of breaking below the $1,800 support, it should be reflected in the ETH futures contract premium and increased costs for protective put options.</p><h2>Ether derivatives metrics even as regulations ramped up </h2><p>Ether<a href=\"https://cointelegraph.com/trading-for-beginners/crypto-derivatives\"> quarterly futures</a> are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.</p><p>As a result, ETH futures contracts in healthy markets should trade at a 4 to 8% annualized premium — a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bded5537-d581-47bd-90ae-1986f4872d75.png\"  /><figcaption style=\"text-align: center;\"><em>Ether 2-month futures annualized premium. Source: Laevitas</em></figcaption></figure><p>According to the futures premium, known as the basis indicator, professional traders have been avoiding leveraged longs (bullish bets). Still, not even the retest of the $1,780 level on June 6 was enough to flip those whales and market makers into bearish sentiment.</p><p>To exclude externalities that might have solely impacted the Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/af7a72fb-9656-47b0-b1bd-0f30a8cf0910.png\"  /><figcaption style=\"text-align: center;\"><em>Ether 30-day 25% skew. Source: Laevitas</em></figcaption></figure><p>The skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew. As displayed above, the 25% delta skew moved above the positive 8% threshold on June 5, indicating bearishness. However, the subsequent bounce to $1,880 on June 6 has moved the metric back to a neutral state.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-reminds-world-it-tried-to-embrace-regulation-as-sec-sues-for-violations\"><strong><em>Coinbase reminds world it tried to ‘embrace regulation’ as SEC sues for violations</em></strong></a></p><h2>Ether’s price looks poised to hold above $1,800</h2><p>In short, these three indicators signal resilience — namely, the TVL bounce to 14.6 million ETH, the 4% increase in Dapps active addresses, and a meager impact on Ether derivatives markets despite the retest of the $1,800 level.</p><p>Ethereum network usage data remains healthy and the recent retest of the 67-day support was not enough to scare professional traders, according to derivatives metrics. </p><p>Consequently, bulls seem to have dodged a bullet, greatly reducing the risk of an imminent price crash.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T17:17:32.000Z",
    "title": "Tel Aviv Stock Exchange completes proof of concept to tokenize fiat and bonds",
    "url": "https://cointelegraph.com/news/tel-aviv-stock-exchange-completes-proof-of-concept-to-tokenize-fiat-and-bonds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6a69f56e-937f-4d9d-8317-244c3167cc13.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In its proof of concept, TASE minted the first ERC-1155 security token representing a dummy digital government bond.</p>\n                    <p><p>A new phase in the Tel Aviv Stock Exchange's integration of blockchain technology and traditional assets has been <a href=\"https://www.fireblocks.com/press/the-tel-aviv-stock-exchange-and-the-israeli-ministry-of-finance-successfully-completed-the-project-eden-proof-of-concept/\" target=\"_blank\" rel=\"noopener nofollow\">completed</a> with the minting of the first dummy digital government bond as an ERC-1155 security token. </p><p>The bond mint is part of the proof of concept (PoC) phase of Project Eden, a partnership between the Israeli Ministry of Finance and the stock exchange to explore blockchain infrastructure in issuing and settling government bonds.</p><p>Also included in the proof of concept was the tokenization of an Israeli Shekel — the country's fiat currency — which will serve as a digital payment token to power transactions. As part of the settlement process, a smart contract for bond management is used, which acts as an intermediary to ensure that transactions are verified and do not contain inconsistencies.</p><p><a href=\"https://www.fireblocks.com/press/the-tel-aviv-stock-exchange-and-the-israeli-ministry-of-finance-successfully-completed-the-project-eden-proof-of-concept/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a June 6 blog post, the initiative's go-live event hosted several local and international banks, including Barclays, BNP Paribas, Deutsche Bank, First International Bank, Goldman Sachs, JPMorgan, Merrill Lynch, Bank HaPoalim, Bank Discount, Bank Leumi, and Bank Mizrah.</p><p>“We believe that the Startup Nation can play a leadership role in the digital transformation of the capital markets. [...] We believe that the capital market information will be completely different in a few years, and it is our job to lead the revolution,” said Ittai Ben Zeev, the CEO of Tel Aviv Stock Exchange. </p><p>The PoC was built on an <a href=\"https://cointelegraph.com/news/what-is-an-ethereum-virtual-machine-evm-and-how-does-it-work\">Ethereum Virtual Machine (EVM)-compatible blockchain</a>, allowing future integration with other blockchain solutions. Crypto firms Blockfold and Fireblocks are behind the distributed ledger infrastructure, enabling interaction across wallets and token standards for issuance and trading of treasury bonds, said a Fireblocks spokesperson in a statement to Cointelegraph. </p><p>Using Ethereum's<a href=\"https://ethereum.org/pt/developers/docs/standards/tokens/erc-1155/\" target=\"_blank\" rel=\"noopener nofollow\"> ERC-1155</a> — the standard interface for the dummy bond minted — a single deployed contract can represent and control a combination of fungible and nonfungible tokens in any amount. </p><p>Blockchain-based settlement systems are also under development at the Bank of England and the Bank for International Settlements. Recently, the institutions<a href=\"https://cointelegraph.com/news/bis-bank-of-england-concludes-blockchain-int-l-settlements-pilot\"> completed a joint pilot</a> that successfully purchased houses in Wales and England using distributed ledger technology. The project aims to provide a settlement system for central bank digital currencies. </p><p><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Magazine:</em></strong><strong> </strong><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template><p>As for Israel, the central bank is analyzing stablecoin adoption and<a href=\"https://cointelegraph.com/news/israel-s-central-bank-says-cbdc-could-be-issued-if-stablecoin-use-increases\"> considering issuing a CBDC</a> to prevent private companies from taking over the country's digital payments system in the coming years. </p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T17:23:48.000Z",
    "title": "Binance experiences minor Bitcoin outflows despite SEC lawsuit fears",
    "url": "https://cryptoslate.com/insights/outflows-on-binance-continue-throughout-the-day/",
    "description": "<p>Quick Take Bitcoin outflows on June 7 from Binance seem rather small compared to previous capitulations.  Roughly 12,000 Bitcoin have left Binance on June 7. In the past year, especially during the FTX collapse, Binance saw 40,000 Bitcoin level the exchange in one day. It suggests investors are not fazed by the SEC lawsuit on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/outflows-on-binance-continue-throughout-the-day/\">Binance experiences minor Bitcoin outflows despite SEC lawsuit fears</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T17:20:46.000Z",
    "title": "Janet Yellen claims crypto industry needs ‘additional regulation’ to plug ‘holes’",
    "url": "https://cryptoslate.com/janet-yellen-claims-crypto-industry-needs-additional-regulation-to-plug-holes/",
    "description": "<p>U.S. Treasury Secretary Janet Yellen said there is a need for &#8220;additional regulation&#8221; to ensure consumers and investors are protected from the &#8220;inherent&#8221; risks present in the crypto industry. Yellen made the statement during an appearance on CNBC&#8217;s Squawk Box on June 7. Holes in the system She said the Treasury Department had conducted in-depth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/janet-yellen-claims-crypto-industry-needs-additional-regulation-to-plug-holes/\">Janet Yellen claims crypto industry needs ‘additional regulation’ to plug ‘holes’</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-07T17:30:16.000Z",
    "title": "Janet Yellen Urges Congress to Enact Stricter Regulations for Crypto Industry Amid SEC Shakedown",
    "url": "https://news.bitcoin.com/janet-yellen-urges-congress-to-enact-stricter-regulations-for-crypto-industry-amid-sec-shakedown/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Janet Yellen Urges Congress to Enact Stricter Regulations for Crypto Industry Amid SEC Shakedown\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/yellens.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent statement, former U.S. Federal Reserve chair and current Treasury secretary, Janet Yellen, expressed her desire for Congress to enact more regulatory measures concerning the cryptocurrency industry. Yellen cited Treasury reports on cryptocurrencies that have pinpointed various risks linked to the fast-growing sector. Yellen Sees ‘Holes in the System Where Additional Regulation Would [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T17:37:11.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T17:11:11.000Z",
    "title": "8 beste Kryptowährungen, die man jetzt im Juni 2023 kaufen kann",
    "url": "https://www.cryptopolitan.com/8-beste-kryptowahrungen-die-man-jetzt-im-juni-2023-kaufen-kann/",
    "description": "Fragen Sie sich, welche die beste Kryptowährung ist, die Sie im Juni 2023 erwerben können? Nun, dann sind Sie hier genau richtig. In diesem Artikel werden wir Ihnen die 8 besten Coins vorstellen, die Sie derzeit im Juni 2023 kaufen können. Täglich erscheint im Krypto-Universum ein neuer Coin mit einzigartigen Eigenschaften und Funktionen. Die Auswahl ... <a title=\"8 beste Kryptowährungen, die man jetzt im Juni 2023 kaufen kann\" class=\"read-more\" href=\"https://www.cryptopolitan.com/8-beste-kryptowahrungen-die-man-jetzt-im-juni-2023-kaufen-kann/\" aria-label=\"More on 8 beste Kryptowährungen, die man jetzt im Juni 2023 kaufen kann\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T17:19:32.000Z",
    "title": "US Treasury Secretary Yellen wants more crypto regulation",
    "url": "https://crypto.news/us-treasury-secretary-yellen-wants-more-crypto-regulation/",
    "description": "Amid escalating legal cases against prominent cryptocurrency platforms, Coinbase and Binance, U.S. Treasury Secretary Janet Yellen emphasized the need for stronger regulation to safeguard crypto users and investors."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T17:30:52.000Z",
    "title": "XRP, Filecoin, and Tradecurve Prices on a Bullish Charge: How High Can They Go?",
    "url": "https://www.crypto-news-flash.com/xrp-filecoin-and-tradecurve-prices-on-a-bullish-charge-how-high-can-they-go/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-filecoin-and-tradecurve-prices-on-a-bullish-charge-how-high-can-they-go",
    "description": "<p>Ripple price is set for a breakout given the optimism in the community about the outcome of the SEC case on June 13th. Filecoin is classified as a security by the SEC, and Tradecurve offers self-custodial asset management on a high liquidity exchange. &#62;&#62;BUY TCRV TOKENS NOW&#60;&#60; Ripple community eyes June 13th As many in [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/xrp-filecoin-and-tradecurve-prices-on-a-bullish-charge-how-high-can-they-go/\">XRP, Filecoin, and Tradecurve Prices on a Bullish Charge: How High Can They Go?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]