[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T11:54:23.000Z",
    "title": "Shiba Inu hints at making Shibarium public soon",
    "url": "https://cointelegraph.com/news/shibarium-shiba-inu-hints-at-making-shibarium-public-soon",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/76519c7b-4a28-4798-990f-6b629b8d57a2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Shibarium community known as Shibarmy has taken to X (formerly known as Twitter) to respond enthusiastically to the development.</p>\n                    <p><p>Progress is underway in the field of blockchain technology, with the highly anticipated public launch of the Shibarium (L2) version happening soon. The Shiba Inu team has announced that the platform is running smoothly and just needs to be made public. </p><p>The team behind Shibarium, an Ethereum layer-2 network, has <a href=\"https://twitter.com/LucieSHIB/status/1694599346715517031?s=20\" target=\"_blank\" rel=\"noopener nofollow\">indicated</a> that the platform is currently live and in private mode having functioned smoothly during its two-day test, and is on the verge of becoming available to the public. </p><p>The Shibarium team claimed in recent blog <a href=\"https://blog.shib.io/shibarium-scaling-update-4/\" target=\"_blank\" rel=\"noopener nofollow\">post</a> that funds remain safe, and users can look forward to a fresh experience when the platform becomes accessible to all. Those who have benefited from the update are already celebrating as bridged $BONE tokens make their entry.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Things are going in the right direction ✨ <a href=\"https://t.co/yS8iqbz1ra\">https://t.co/yS8iqbz1ra</a></p>&mdash; Daniel (@Pasaben101) <a href=\"https://twitter.com/Pasaben101/status/1694600298151501911?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Shibarium community known as Shibarmy, are commenting on X (formerly known as Twitter) in <a href=\"https://twitter.com/Pasaben101/status/1694600298151501911\" target=\"_blank\" rel=\"noopener nofollow\">response</a> to the development. The Shibarium team expressed their satisfaction with the progress, stating that the network has achieved a \"ready\" state after thorough testing and parameter adjustments. Although testing is ongoing, the team revealed that blocks are consistently being generated without issues.</p><p>The recent updates include added safety measures and a monitoring system. These enhancements involve implementing rate limiting at the remote procedure call (RPC) level and an automatic server reset mechanism. These improvements are intended to avert potential problems stemming from abrupt traffic surges, guaranteeing users a steady and dependable experience.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/shiba-inu-shibarium-network-resumes-block-production-after-brief-pause\"><strong><em>Shiba Inu’s Shibarium Network resumes block production after brief pause</em></strong></a></p><p>During its testing phase, the network garnered significant attention with millions of wallets engaged in over 22 million transactions spanning four months. However, <a href=\"https://cointelegraph.com/news/shiba-inu-shibarium-network-resumes-block-production-after-brief-pause\">the initial launch encountered challenges</a>. An overwhelming surge of activity overloaded the network, leading to a temporary halt in transactions for several hours. Consequently, millions of dollars were trapped on a bridge tool, <a href=\"https://cointelegraph.com/news/shibarium-bridge-shib-bone-leash-token-price-plummet\">causing a 10% decrease in SHIB pricing</a>.</p><p>Subsequently, developers have addressed the issues and <a href=\"https://cointelegraph.com/news/shibarium-denies-bridge-issues-calls-it-fud\">clarified that the servers were overwhelmed</a> due to an unforeseen surge in transaction volume. The network's team says it is now assured of the reopening's success despite the initial challenges.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-24T11:50:19.000Z",
    "title": "FTX Eyes Novogratz’s Galaxy Digital for Asset Supervision Amid Bankruptcy Process",
    "url": "https://cryptobriefing.com/ftx-eyes-novogratzs-galaxy-digital-asset-supervision/?utm_source=feed&utm_medium=rss",
    "description": "FTX explores appointing Galaxy Digital Holdings to effectively handle its expansive digital assets during bankruptcy proceedings."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T12:00:00.000Z",
    "title": "\n                        Bitcoin is firmly on course in its bull market\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bitcoin-is-firmly-on-course-in-its-bull-market",
    "description": "\n                        <p dir=\"ltr\">Despite much fear and doubt invading the minds of crypto investors, bitcoin is in phase 1 of the bull market and is continuing to build price structure.</p>\nZoom out\n<p dir=\"ltr\">Fear is coursing through the veins of cryptocurrency investors. This fear may lead to irrational trades that many will regret later. The price of bitcoin has been falling steadily for the past two months and there appears to be no end in sight.</p>\n<p dir=\"ltr\">However, when there is doubt - zoom out. Too many investors new to bitcoin and crypto get paralysed with uncertainty by looking at the shorter time frames. It&rsquo;s easy to get riddled with doubt if you are watching the 1-hour or the 4-hour time frames.</p>\n<p dir=\"ltr\">Zooming out to the 2-week time frame, things look so much clearer, and it&rsquo;s easy to see exactly where bitcoin is in relation to past price action. It&rsquo;s only when one does this that it becomes apparent that bitcoin is actually holding nicely above the price structure that it has been building since mid-2022.</p>\nBitcoin is following the same pattern\n<p dir=\"ltr\">In fact this same process has been followed ever since the first phase of the bitcoin bull market in 2012, and the succeeding ones in 2016, 2019, and now 2023.</p>\n<p dir=\"ltr\">The same bottom is made, which in the last two bear markets was a double bottom, and which so far has also been the case for this bear market that bitcoin is currently emerging from.</p>\n<p dir=\"ltr\">All bitcoin has done in the current phase 1 of its bull market is confirm the support on top of the structure it has built at around $23,000 to $25,000. The current drop in price looks as though it might reconfirm this support.&nbsp;</p>\nWorst case scenario\n<p dir=\"ltr\">Of course, looking at the worst case scenario bitcoin could even drop through this support. It could wick down, or it could even go down to revisit the low. However, even this would not negate this phase 1 of the bull market, and would be an amazing opportunity to buy.</p>\n<p dir=\"ltr\">New investors are full of the stories of how bitcoin did crazy percentage gains to the upside in previous bull markets, but this time it looks to be different. The gains are definitely declining for each successive bitcoin bull market, but even so, a rise to $100,000 is not out of the question, and a 4x in the present financial environment would be an amazing return.</p>\nBitcoin is freedom\n<p dir=\"ltr\">Bitcoin is much more though than a 4x gain in wealth. It is monetary freedom. It is a haven from the madness and catastrophic future that fiat currencies will wreak upon the world.</p>\n<p dir=\"ltr\">There are all sorts of doubts in finance. Nothing is ever 100% certain, except one thing - fiat currencies will continue to debase and they will all eventually go to zero.</p>\n<p dir=\"ltr\">If you are able to think back to when you were younger and how prices were so much cheaper, then you are witnessing the debasement of your currency. This is impossible for governments to turn around and prices will only keep rising as more currency is printed into existence.</p>\n<p dir=\"ltr\">Governments and central banks are enslaving their populations, and should central bank digital currencies (CBDCs) be implemented, their control over the citizenry will be total. Bitcoin is the way out.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice</p>\n                    "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T12:02:16.000Z",
    "title": "Dogecoin Millionaire Explains Why He’s Still Bullish On DOGE Despite Taking Heavy Losses",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-millionaire-bullish/",
    "description": "Investing in cryptocurrencies like Dogecoin can be tricky, as the nascent market is known to be the most volatile in terms of price movement. One day, an investor triples his investment, and the next day, all of it is gone. So knowing when to sell and exit a position can sometimes be challenging.  This is the recent case of a once-DOGE millionaire who has seen the worth of his holdings fall from almost $3 million to $50,000. However, despite the ups and downs, this long-time HODLer believes Dogecoin has staying power. Still Bullish On Dogecoin Dogecoin has come a long way since its creation as a joke. The cryptocurrency saw its value spike dramatically in 2021, making early investors sudden millionaires in the process. At the peak of its rally, DOGE rose from a market cap of $1.2 billion to $75.26 billion in less than five months to reach a price all-time high of $0.74. Related Reading: Kenya’s 17-Member Committee Officially Kicks Off Investigation Into Worldcoin One of these investors who became millionaires overnight as a result of this rise was Las Vegas resident Glauber Contessoto, known as SlumDOGE Millionaire on social media platform X. During the rise of DOGE, this investor saw his holdings reach $2.9 million and was popularly known as one of the first Dogecoin millionaires.  The hype bubble has since popped, and the value of Dogecoin has toppled, with the cryptocurrency now trading at $0.06378. This would see Contessoto&#8217;s holdings now worth around $50,000.  Despite his loss, Contessoto continues to have trust in Dogecoin. According to a social media post, he mentioned how dog theme meme coins have a better chance of spiking than other meme coins.  &#8220;I feel like they will rise again,&#8221; he said. He said this while noting the success of frog-themed crypto PEPE.  I honestly don’t think Dog themed meme coins are done. I feel like they will rise again 🤔$PEPE had it’s run, frog was cool 🐸 But dogs are where it’s at foreal 🐶 — SlumDOGE Millionaire (@ProTheDoge) August 23, 2023 Contessoto is not the only one that has witnessed the value of his DOGE holdings fall dramatically. Another investor, Keith Johnson, who suffered losses, made headlines for filing a $258 billion lawsuit against Elon Musk. Known as the Dogefather because of his support for Dogecoin, Musk&#8217;s tweets regarding the crypto have regularly led to price spikes. What’s Next For DOGE? Even though Dogecoin has continued to struggle, the meme coin has had its moments this year. In July, DOGE saw a brief spike in price, leading it to become the 8th-largest cryptocurrency by market cap. But while the Dogecoin ecosystem has gathered a huge community, things seem to be calm at the moment.  Related Reading: Shiba Inu Team Will Start Implementing ShibPaper, What Does This Mean? At the time of writing, DOGE is trading at $0.06366, down by 6% in the past seven days. However, many DOGE investors hope to see a price spike if DOGE is finally accepted as a payment method on social media platform X. DOGE price is down over 90% from ATH &#124; Source: DOGEUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T12:00:34.000Z",
    "title": "The Pomerdoge (POMD) Prediction: Why It’s Surpassing Pepe (PEPE) and Ripple (XRP) in Analyst Picks",
    "url": "https://www.crypto-news-flash.com/the-pomerdoge-pomd-prediction-why-its-surpassing-pepe-pepe-and-ripple-xrp-in-analyst-picks/?utm_source=rss&utm_medium=rss&utm_campaign=the-pomerdoge-pomd-prediction-why-its-surpassing-pepe-pepe-and-ripple-xrp-in-analyst-picks",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-118.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-118.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-118-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-118-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the volatile and exciting world of cryptocurrency, Pomerdoge (POMD) has started to make waves, surpassing stalwarts like Pepe (PEPE) and Ripple (XRP) in the analysts&#8217; picks. Notably, Pomerdoge is still in the presale phase of development, giving investors the opportunity to get in on the ground floor of a promising new idea. Let&#8217;s take [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T11:51:00.000Z",
    "title": "IMX, RNDR, and FXS Prices Rise Along With the Total Market Cap",
    "url": "https://coinedition.com/imx-rndr-and-fxs-prices-rise-along-with-the-total-market-cap/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-5-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Immutable (IMX), Render (RNDR), and Frax Share (FXS) are 3 altcoins that all saw their prices rise along with the total cryptocurrency valuation during the past 24 hours. The market tracking website CoinMarketCap indicated that the total cryptocurrency market cap stood at $1.07 trillion at press time after it increased by 1.51% over the past [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/imx-rndr-and-fxs-prices-rise-along-with-the-total-market-cap/\">IMX, RNDR, and FXS Prices Rise Along With the Total Market Cap</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-24T11:45:36.000Z",
    "title": "Trader Turns Bearish on Dogecoin, Says He Prefers DOGE Rival That’s Exploded Over 1,800% in Four Months",
    "url": "https://dailyhodl.com/2023/08/24/trader-turns-bearish-on-dogecoin-says-he-prefers-doge-rival-thats-exploded-over-1800-in-four-months/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/He-Prefers-One-DOGE.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto trader is expressing bearish sentiment on Dogecoin (DOGE) amid the downturn in the market. Pseudonymous analyst Altcoin Sherpa tells his 11,000 YouTube subscribers that the memecoin Pepe currently looks more promising than Dogecoin. &#8220;I think that PEPE is probably just a better buy than DOGE. I say that as a PEPE bag holder so [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/24/trader-turns-bearish-on-dogecoin-says-he-prefers-doge-rival-thats-exploded-over-1800-in-four-months/\">Trader Turns Bearish on Dogecoin, Says He Prefers DOGE Rival That’s Exploded Over 1,800% in Four Months</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]