[
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T21:47:34.000Z",
    "title": "Cambodian digital currency bakong amps up use case with Alipay agreement",
    "url": "http://cointelegraph.com/news/cambodian-digital-currency-bakong-use-case-alipay-agreement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b600817c-4c58-4efd-8e78-2ebc9cd26752.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The CBDC-like bakong provides digital payment services in riel and the U.S. dollar. It has been steadily extending its regional scope.</p>\n                    <p><p>The bakong, a digital currency operated by the National Bank of Cambodia (NBC), will provide users with access to the Alipay merchant network and enable cross-border transactions on Alipay+ using QR codes under a memorandum of understanding (MoU) signed at the FinTech Expo in Singapore, the local press <a href=\"https://www.phnompenhpost.com/business/bakong-ink-cross-border-payment-mou\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>.</p><p>The bakong service operates by the NBC on a blockchain, but it is not a central bank digital currency (CBDC), as the currency is a liability of the commercial banks that use it. The bakong enables both United States dollar and Cambodian riel accounts. The Cambodian economy is heavily dollarized. </p><p>The MoU means that Cambodians will be able to use riel from their bakong wallets to shop with 83 million merchants worldwide on the Alipay network. In addition, Chinese tourists who have accounts with China’s massive Alipay electronic payment system will be able to shop in Cambodia using the QR codes of the bakong KHQR system. NBC governor Chea Serey said:</p><blockquote>“The simplicity of making payments provides merchants with a revenue boost, helping to stimulate economic activity. I’m confident this collaboration with Alipay+ will be beneficial for all parties.”</blockquote><p>There were 35.4 million transactions worth $12 billion using the bakong in the first half of 2023, the Phnom Penh Post reported on Nov. 17. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/laotian-cbdc-proof-of-concept-project-to-launch-using-system-pioneered-in-cambodia\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/laotian-cbdc-proof-of-concept-project-to-launch-using-system-pioneered-in-cambodia/amp\">Lao CBDC proof-of-concept project to launch using system pioneered in Cambodia</a></em></strong></p><p>The bakong payment was launched in 2020 and <a href=\"https://cointelegraph.com/news/cambodia-explores-cross-border-transactions-of-cbdc-like-bakong\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cambodia-explores-cross-border-transactions-of-cbdc-like-bakong/amp\">was designed for sending remittances</a> an making purchases. Its mobile app was developed in collaboration with Japan’s Soramitsu blockchain. In August, Soramitsu announced plans to use the bakong to develop a cross-border payment system encompassing India, China and Japan. The bakong is already used in Malaysia, Thailand and Vietnam. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Local vendors can now use the KHQR network of the Bakong system, a part of the National Bank of Cambodia (NBC), to make payments to over 80 million Alipay merchants globally.<a href=\"https://t.co/hLagrXU08X\">https://t.co/hLagrXU08X</a></p>— The Phnom Penh Post (@phnompenhpost) <a href=\"https://twitter.com/phnompenhpost/status/1725492732653920499?ref_src=twsrc%5Etfw\">November 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In July, the NBC <a href=\"https://thepaypers.com/payments-general/the-national-bank-of-cambodia-partners-with-ant-international--1265431\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> a MoU with China’s UnionPay International on the use of QR codes for cross-border payments. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/chinas-180m-digital-yuan-airdrop-devastation-in-turkey-laos-cbdc-asia-express/\">China’s 180M digital yuan airdrop, Devastation in Turkey, Laos’ CBDC: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T22:03:21.000Z",
    "title": "Canadian regulator initiates consultation on bank crypto reporting",
    "url": "https://www.cryptopolitan.com/canadian-regulator-initiates-consultation-on-bank-crypto-reporting/",
    "description": "The Office of the Superintendent of Financial Institutions (OSFI), Canada&#8217;s banking regulator, has initiated a consultation process regarding the formulation of guidelines for banks and financial institutions on reporting cryptocurrency exposures. This move marks a significant step in addressing the risks and challenges posed by the burgeoning digital asset industry. Evaluating risks in digital innovation ... <a title=\"Canadian regulator initiates consultation on bank crypto reporting\" class=\"read-more\" href=\"https://www.cryptopolitan.com/canadian-regulator-initiates-consultation-on-bank-crypto-reporting/\" aria-label=\"More on Canadian regulator initiates consultation on bank crypto reporting\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T21:57:23.000Z",
    "title": "Formidable challenges await Javier Milei in Argentina",
    "url": "https://www.cryptopolitan.com/challenges-await-javier-milei-in-argentina/",
    "description": "Javier Milei&#8217;s victory in Argentina&#8217;s presidential election marks a significant political shift, but it also heralds a time of immense challenges for the newly elected leader. Known for his &#8220;anarcho-capitalist&#8221; stance and radical economic proposals, Milei faces a host of obstacles in implementing his vision for Argentina, a country currently grappling with severe economic issues. ... <a title=\"Formidable challenges await Javier Milei in Argentina\" class=\"read-more\" href=\"https://www.cryptopolitan.com/challenges-await-javier-milei-in-argentina/\" aria-label=\"More on Formidable challenges await Javier Milei in Argentina\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T21:48:02.000Z",
    "title": "BRICS leaders call for urgent gathering – Here’s what’s at stake",
    "url": "https://www.cryptopolitan.com/brics-leaders-call-for-urgent-gathering/",
    "description": "In a move underscoring the increasing geopolitical significance of the BRICS alliance, leaders of the member nations have convened an emergency meeting slated for this week. The impromptu gathering, orchestrated against a backdrop of escalating global developments, is particularly focused on the humanitarian crisis in Gaza. This meeting not only highlights the BRICS nations&#8217; growing ... <a title=\"BRICS leaders call for urgent gathering &#8211; Here&#8217;s what&#8217;s at stake\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brics-leaders-call-for-urgent-gathering/\" aria-label=\"More on BRICS leaders call for urgent gathering &#8211; Here&#8217;s what&#8217;s at stake\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T21:42:51.000Z",
    "title": "Why CoinDesk’s acquisition by Bullish is bad for the crypto industry",
    "url": "https://www.cryptopolitan.com/coindesk-bullish-deal-bad-for-industry/",
    "description": "The crypto industry is abuzz with the recent acquisition of CoinDesk by cryptocurrency exchange Bullish, a move that has raised concerns about the future of journalistic integrity within the crypto space. This development, though seemingly beneficial for CoinDesk&#8217;s business expansion, could potentially undermine the impartiality that is crucial for media outlets in the crypto world. ... <a title=\"Why CoinDesk&#8217;s acquisition by Bullish is bad for the crypto industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coindesk-bullish-deal-bad-for-industry/\" aria-label=\"More on Why CoinDesk&#8217;s acquisition by Bullish is bad for the crypto industry\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T22:02:44.000Z",
    "title": "Analyst details potential BEAM price volatility",
    "url": "https://crypto.news/analyst-details-potential-beam-price-volatility/",
    "description": "Crypto analyst reveals an interest price prediction for Beam token in new video, urges traders to short \"like a machine.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T22:00:17.000Z",
    "title": "SOL Price Forecast Takes Bearish Turn, Prepare For Potential Plummet To $30 Or Lower",
    "url": "https://www.newsbtc.com/news/solana/sol-price-forecast-takes-bearish-turn-prepare-for-potential-plummet-to-30-or-lower/",
    "description": "Solana (SOL) has emerged as a prominent player in the dynamic world of cryptocurrency, showcasing a remarkable uptrend and delivering substantial gains. Despite a modest 3.6% correction in SOL price over the past 24 hours, the native token of the blockchain platform has recorded a significant increase of 43% over the past fourteen-day period. However, the sustainability of these gains may be in jeopardy, as the SOL price appears poised for a significant decline and deep correction following an impressive 346% surge over the past year. SOL Price Vulnerable To Significant Drop, $30 In Sight Crypto analyst Ali Martinez has shed light on the potential challenges ahead for SOL. Martinez highlights the TD Sequential indicator, which currently shows a sell signal on the weekly chart of SOL. Related Reading: Bitcoin ETF Hype: Bloomberg Intelligence Envisions $100 Billion Market If Regulatory Approval Granted The TD Sequential indicator, developed by market technician Thomas DeMark, is a technical analysis tool to identify potential trend reversals or exhaustion points in price movements. The indicator consists of consecutive candlesticks that meet specific criteria based on the time and price movements. It looks for specific patterns in the price action, including the arrangement of consecutive highs and lows and the overall trend direction. When the TD sequential indicator generates a sell signal, as seen on the SOL chart above, it indicates that the token is reaching a point of exhaustion in its uptrend, possibly indicating an impending correction or reversal. According to Martinez, if the bearish formation depicted by the TD Sequential indicator is confirmed, market participants may witness a downward swing for SOL price, potentially pushing it towards $45 or even dipping as low as $30.  Solana Defies Correction Worries Despite the potential for a price correction in the coming days or weeks, Solana has demonstrated impressive growth across various fundamental metrics, as revealed by data provided by Token Terminal. When examining market capitalization, SOL&#8217;s circulating supply currently stands at $24.62 billion, denoting a remarkable increase of 138.78%. Furthermore, the fully diluted market cap is estimated at $32.77 billion, reflecting a substantial growth rate of 134.29%. SOL&#8217;s revenue has also grown significantly, with a notable increase of 106.55% over the past 30 days, amounting to $1.26 million. Scaling these figures to an annualized revenue of $15.28 million represents a healthy growth rate of 43.10%. Related Reading: Shiba Inu Burn Rate Crashes 98.79% With Less Than 1 Million tokens Burned Transaction fees have also played a key role in SOL&#8217;s revenue generation. Over the past 30 days, transaction fees increased by 106.55% to $2.51 million. This represents a growth rate of 43.10% when extrapolated to annualized fee revenue of $30.56 million. Solana&#8217;s growing ecosystem is further evidenced by an increase in daily active users, which currently averages 128,180, reflecting a notable growth rate of 53.6% over the past 30 days.  Additionally, the platform has seen an average of 82.83 core developers actively contributing to its development, indicating a growth rate of 13.1%. Currently, SOL is trading at $58, with the next support level at $55, which will be key to the token&#8217;s prospects. Featured image from Shutterstock, chart from TradingView.com"
  }
]