[
  {
    "source": "CoinDesk",
    "date": "2023-09-11T17:51:21.000Z",
    "title": "Bitcoin Drops Below $25K With Altcoins Bracing for Deeper Crash from FTX Crypto Sale",
    "url": "https://www.coindesk.com/markets/2023/09/11/bitcoin-drops-below-25k-with-altcoins-bracing-for-deeper-crash-from-ftx-crypto-sale/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "tk"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T17:52:38.000Z",
    "title": "Dutch Startup Eatch Unveils Revolutionary Robotic Kitchen Producing 5,000 Meals Daily",
    "url": "https://www.cryptopolitan.com/eatch-unveils-robotic-kitchen-producing-5000/",
    "description": "In a groundbreaking development, Dutch startup Eatch has introduced a fully automated robotic kitchen capable of churning out up to 5,000 meals per day. The company&#8217;s innovative creation has been operating successfully in the Amsterdam market for the past four months, serving food service and catering giant ISS. This remarkable robotic kitchen platform is a ... <a title=\"Dutch Startup Eatch Unveils Revolutionary Robotic Kitchen Producing 5,000 Meals Daily\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eatch-unveils-robotic-kitchen-producing-5000/\" aria-label=\"More on Dutch Startup Eatch Unveils Revolutionary Robotic Kitchen Producing 5,000 Meals Daily\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T17:48:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have again lost momentum. BNB prices have dropped by 11.65% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is $206.57 with a 24-hour trading volume of $440,900,782. ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T17:44:39.000Z",
    "title": "Sushiswap announces expansion to layer-1 blockchain Aptos",
    "url": "https://www.cryptopolitan.com/sushiswap-expansion-layer-1-blockchain-aptos/",
    "description": "SushiSwap, one of the pioneers in the decentralized exchange (DEX) space, has recently made a significant move by expanding its services to the Layer-1 blockchain Aptos. This strategic integration represents a milestone for SushiSwap as it marks its first foray into a blockchain ecosystem that is not compatible with the Ethereum Virtual Machine (EVM). Until ... <a title=\"Sushiswap announces expansion to layer-1 blockchain Aptos\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sushiswap-expansion-layer-1-blockchain-aptos/\" aria-label=\"More on Sushiswap announces expansion to layer-1 blockchain Aptos\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T18:01:37.000Z",
    "title": "Bitcoin Weekly TD Sequential Buy Setup Appears, But Warns Of Potential Risk",
    "url": "https://www.newsbtc.com/all/bitcoin-weekly-td-sequential-buy-setup/",
    "description": "Bitcoin price keeps falling, now pushing down against support at $25,000 per coin. The recent sweep of lows has resulted in a perfected TD9 buy setup according to the weekly TD Sequential indicator. Although this sounds positive for crypto, if the signal fails, there is risk of an extreme drop ahead. Here is a closer look at why. Is The TD Sequential Telling Us To Buy The Dip In Bitcoin? Things are improving for Bitcoin price action, but the situation surrounding altcoins and the increasingly negative macro environment has kept upside momentum at bay. The result over the last several weeks has been another BTCUSD downtrend. This series of down weeks has satisfied a specific sequence required to trigger a TD9 buy setup. A perfected TD9 buy setup has appeared &#124; BTCUSD on TradingView.com Even more important, the signal has been &#8220;perfected&#8221; now that price has made a lower low on weekly timeframes. The TD Sequential is a market timing indicator created by Thomas DeMark, which can be used to potentially time reversals. However, when a buy signal fails, the move down can be dramatic. Related Reading: Bitcoin Bullish Uptrend Remains Unbroken, Here&#8217;s Why The last time there was a perfected TD buy setup series in the same timeframe, Bitcoin was priced at $42,000 per coin. There was a short-lived recovery, but a more than 50% collapse followed due to the buy setup failure. If the buy setup doesn&#8217;t fail here, Bitcoin should reverse before the week is over, resuming its prior bullish 2023 uptrend. Bitcoin's uptrend is still intact, but a downtrend is forming &#124; BTCUSD on TradingView.com A Broader Look At The Brewing BTC Trend Upon zooming out, we can also see that Bitcoin&#8217;s uptrend from $3,000 is still intact, according to TDST support located at $10,376. TDST support only moves up when a TD series is perfected to the upside and a sell setup triggered. Instead, the perfected TD9 buy setup has renewed TDST resistance at $30,419. Related Reading: Bitcoin Reaches Most “Oversold” Record Since 2020: What This Means Former TDST resistance was located at $25,250, which is potentially being retested now. Based on what the technical indicator tells us, is that Bitcoin is facing a critical inflection point in terms of timing and price level combined. However the dust settles could determine the future trend for the remainder of the year. Will this TD buy setup lead to a reversal, or further failure for bulls to establish a new bull market? Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T18:00:51.000Z",
    "title": "Terra Classic Game-Changing Proposal: What’s In Store For LUNC’s Future?",
    "url": "https://www.newsbtc.com/news/terra-classic-game-changing-proposal-whats-in-store-for-luncs-future/",
    "description": "Terra Classic (LUNC) has taken a decisive action in a bid to tackle the rising tide of spam proposals flooding its blockchain. The project recently submitted a groundbreaking proposal aimed at altering some fundamental aspects of its ecosystem to mitigate the incessant spam proposals that have been plaguing it. The Terra Classic community hopes that this move will help restore order and efficiency to its blockchain. Related Reading: Boosting Optimism Protocol: Can Incentives Drive OP Prices Higher? One of the most significant changes proposed is the substantial increase in the minimum deposit required for submitting proposals. In response to the dwindling effectiveness of a 1 million LUNC deposit due to the cryptocurrency&#8217;s recent price drop, the proposal suggests elevating the minimum deposit to 5 million LUNC.  This move is expected to serve as a deterrent against frivolous and spammy proposals that have been inundating the platform. Initiative to combat spam proposals by increasing minimum deposit amount to 5M LUNC We currently have seen an increase in &#8220;SPAM&#8221; proposals going up, since the price of LUNC has dropped, 1M LUNC is no longer effective in combatting these types of proposals, this proposal will… — Hexxagon (@hexxagon_io) September 8, 2023 Terra Classic Raises The Bar At the time of writing, the Terra Classic community has shown overwhelming support for this proposal, with more than 90% of votes cast in favor of the change. With such resounding support, it appears highly likely that the proposal will pass. The voting period is set to conclude on September 16, and the Terra Classic community eagerly awaits the final verdict. LUNCUSDT trading at $0.0000572 on the daily chart: TradingView.com While Terra Classic strives to secure its ecosystem against spam, it&#8217;s worth noting that one of the project&#8217;s most promising indicators for the future lies in the steadfast support it has garnered from the world&#8217;s largest cryptocurrency exchange, Binance. This support is not a recent development but serves as a testament to Terra Classic&#8217;s continuous evolution and its efforts to remain at the forefront of innovation in the blockchain space. Binance&#8217;s Backing Fuels Luna Classic&#8217;s Promise In January, Binance officially declared its unwavering support for Terra Classic&#8217;s latest update, known as Proposal 11242. This governance proposal, backed by Binance, addresses crucial facets of Terra Classic&#8217;s evolution. Notably, it introduces measures to prevent the new minting of a portion of the burned LUNC tokens. By resetting the seigniorage reward policy, Proposal 11242 effectively safeguards against the re-coinage of tokens that had previously been burned. Related Reading: Massive PEPE Token Dump: Whale Unloads 762 Billion At Loss As Price Wobbles Seigniorage is essentially a tax collected by governments through their ability to create money, resulting in a net transfer of resources from the real economy (businesses and households) to the government. With Binance&#8217;s support and Terra Classic&#8217;s commitment to enhancing its ecosystem&#8217;s integrity, the project is poised for a bright future, despite recent price fluctuations.  As of the latest data available, the current price of LUNC stands at $0.0000572, with a 3.6% decline in the past 24 hours and a 1.9% loss over the past seven days. Terra Classic (LUNC) remains resolute in its mission to create a more secure and efficient blockchain ecosystem, and these latest developments are sure to further solidify its position in the cryptocurrency landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T18:00:41.000Z",
    "title": "DEX Uniswap and PancakeSwap Price Suffers as New Hybrid Exchange Tradecurve Markets Holder Count Doubles",
    "url": "https://www.crypto-news-flash.com/dex-uniswap-and-pancakeswap-price-suffers-as-new-hybrid-exchange-tradecurve-markets-holder-count-doubles/?utm_source=rss&utm_medium=rss&utm_campaign=dex-uniswap-and-pancakeswap-price-suffers-as-new-hybrid-exchange-tradecurve-markets-holder-count-doubles",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-31-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-31-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-31-1-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />DEX tokens have been a huge point of appeal for many traders, but as of recently, the price of Uniswap (UNI) and PancakeSwap (CAKE) has suffered. As a result, many cryptocurrency analysts and traders are looking at competing projects for high gains. As a result, the Tradecurve Markets (TCRV) holder count has doubled.  Summary Uniswap [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-11T18:05:24.000Z",
    "title": "Bitcoin Could Be ‘Off to the Races’ As Rare Contrarian Indicator Flashes, Says Analyst Jason Pizzino",
    "url": "https://dailyhodl.com/2023/09/11/bitcoin-could-be-off-to-the-races-as-rare-contrarian-indicator-flashes-says-analyst-jason-pizzino/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/Enters-Massive-BTC-Accumulation.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Jason Pizzino says a rare macro indicator is hinting that risk assets including Bitcoin (BTC) could&#8217;ve already bottomed and are getting ready to rally. In a new strategy session, Pizzino tells his 290,000 YouTube subscribers that he&#8217;s watching the consumer confidence index (CCI), which tracks households&#8217; outlook on potential future economic development based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/11/bitcoin-could-be-off-to-the-races-as-rare-contrarian-indicator-flashes-says-analyst-jason-pizzino/\">Bitcoin Could Be ‘Off to the Races’ As Rare Contrarian Indicator Flashes, Says Analyst Jason Pizzino</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]