[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T14:07:28.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T13:52:50.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T13:49:29.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-18T14:00:36.000Z",
    "title": "Where is the crypto market bottom? Avorak suggests August",
    "url": "https://nulltx.com/where-is-the-crypto-market-bottom-avorak-suggests-august/",
    "description": "With the bears firmly in control, there have been many predictions as to when the crypto market will hit bottom. According to a recent analysis by Avorak, this could happen around August. What is a bear market bottom? A bear market bottom refers to the lowest level at which prices stabilize after a prolonged period [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-18T14:00:00.000Z",
    "title": "Crypto revolution: early bitcoin and ethereum investors exploring InQubeta ",
    "url": "https://crypto.news/crypto-revolution-early-bitcoin-and-ethereum-investors-exploring-inqubeta/",
    "description": "InQubeta aims to revolutionize AI and blockchain. Amid the ongoing QUBE presale, early bitcoin and ethereum investors are exploring the project"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-18T13:50:46.000Z",
    "title": "Bitcoin Retailers Buying The Dip As BTC Soars Above $26,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-retailers-buying-the-dip-as-btc-soars-above-26000/",
    "description": "On-chain data shows that Bitcoin retail buyers have been loading up the recent dip, a move that also coincided with price gains above $26,000, relieving traders and holders. Early this week, BTC prices crashed to as low as $24,820 before recovering to spot rates, adding 8% in four days. Retail Investors Are Buying The Dip Following a turbulent week in the crypto space, which involved the United States Securities and Exchange Commission, Binance and “crypto” securities-related drama, the price of Bitcoin dipped below $25,000 after the Federal Reserve paused their rate hikes and keeping the US fund rate within the 5% and 5.25% zone, increasing the uncertainty within the market. Related Reading: Polygon (MATIC) Witnesses High Volatility Amid Positive Developments However, the crypto market has since rebounded, with retail bitcoin investors, characterized by those holding 0.01 to 1 BTC, stepping in to buy up the dip. Interestingly, the dip-buying behavior exhibited by retail investors is similar in level to that observed during the Silicon Valley Bank (SVB) collapse earlier in the year, but less than that of the post FTX collapse crash which saw Bitcoin’s price tank below $16,000. With retailers loading up, it could indicate that traders and holders are confident of what lies ahead despite recent unfavorable fundamentals. Bitcoin Whales On The Move Meanwhile, with active Bitcoin retail buyers ramping up, &#8220;whales&#8221; have also been on the move. Crypto whales are addresses holding large amount of coins. A Twitter user also noted that a user with 50 BTC worth around $1.2 million recently moved his coins after being dormant since 2010. The batch of coins was originally mined in June 2010 and had remained untouched since then before being moved. Following the trend, another previously dormant Bitcoin wallet, that has been dormant for a decade, transferred $7.8 million worth of BTC to a new wallet. Another long-term holder moved $11 million worth of BTC after more than 11 years of inactivity. Related Reading: Bitcoin Recovers Above Critical Level, Why Bulls Could Be Ready To Charge At the pivotal moment of BTC’s price and the crypto space, speculators are raising questions about the motives behind such massive movements of BTC. It is known that the trading activities resulting from the transfers can impact the coin’s supply and demand dynamics of Bitcoin, potentially exerting short-term influence on prices. As of writing on June 18, Bitcoin is firm above $26,500, and has reversed losses of June 14. With retailers appearing to be buying the dip, prices may recover in the days ahead, even rallying to $30,000. Even so, Bitcoin remains under pressure and traders should watch how fundamental events, including the SEC lawsuits against Binance and Coinbase, would shape price action. Featured Image from Canva, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-18T13:40:25.000Z",
    "title": "Haru Invest and Delio Hit by Class Action Lawsuits as Billions in Crypto Remain Frozen – Investors Demand Answers",
    "url": "https://www.crypto-news-flash.com/haru-invest-and-delio-hit-by-class-action-lawsuits-as-billions-in-crypto-remain-frozen-investors-demand-answers/?utm_source=rss&utm_medium=rss&utm_campaign=haru-invest-and-delio-hit-by-class-action-lawsuits-as-billions-in-crypto-remain-frozen-investors-demand-answers",
    "description": "Crypto platforms Haru Invest and Delio are facing potential class-action lawsuits as they suspend customer withdrawals and deposits, causing investors to seek legal recourse. South Korea, one of the largest crypto markets, witnesses billions worth of crypto assets traded daily, making the situation significant in the country&#8217;s crypto landscape. Haru Invest and Delio, two prominent [...]"
  }
]