[
  {
    "source": "CoinDesk",
    "date": "2023-12-18T09:13:39.000Z",
    "title": "Major NFT Indicies Stable After NFT Trader Hack",
    "url": "https://www.coindesk.com/markets/2023/12/18/major-nft-indicies-stable-after-nft-trader-hack/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bored Ape Yacht Club and Mutant Ape Yacht Club NFTs were returned to their owners after Yuga Labs' Greg Solano and Boring Security DAO paid a bounty."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T09:26:36.000Z",
    "title": " Trader gambles $226k on Solana memecoin, gets to $1.69M in five days  ",
    "url": "https://cointelegraph.com/news/trader-gambles-226k-solana-memecoin-1-69m-five-days",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZDVmZjgwOTEtNGVjMy00MGRiLTkyYTgtODQwNzg2ODcyNGM2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Another dog-themed crypto token comes into the limelight as the Solana memecoin frenzy continues. </p>\n                    <p><p>The Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) memecoin frenzy continues as a trader turns $226,000 into well over $1.6 million by gambling on a token with a beanie-wearing dog as its mascot. </p><p>Between Dec. 13 and Dec. 15, a crypto trader bought over 19 million Dogwifhat (WIF) tokens, a dog-themed memecoin, as it debuted on the markets within the Solana network. According to blockchain analytics firm Lookonchain, the trader bought the tokens at an average price of $0.01137. Currently, the tokens’ total value hovers at around $1.69 million, making the trader about $1.47 million in profits within five days. </p><p>As a new wave of interest <a href=\"https://cointelegraph.com/news/solana-sol-price-gains-october-firedancer-testnet-goes-live\">hit the Solana ecosystem</a>, memecoins based on the network have started to show massive gains. On Dec. 8, a dog-themed memecoin called Bonk (BONK) became the third-largest memecoin by market capitalization, joining fellow dog-themed memecoins Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) and Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) in the top three and flipping Pepe (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>), a frog-themed meme token. </p><p><a href=\"https://cointelegraph.com/news/trader-gambles-226k-solana-memecoin-1-69m-five-days\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-18T09:30:16.000Z",
    "title": "Latam Insights: Volcano Bonds Target Q1 2024 Launch, Unblock Global $15 Million Bitcoin Flare Gas Bet",
    "url": "https://news.bitcoin.com/latam-insights-volcano-bonds-target-q1-2024-launch-unblock-global-15-million-bitcoin-flare-gas-bet/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights: Salvadoran Volcano Bonds Target Q1 2024 Launch, Unblock Computing Argentine Flare Gas Mining Project\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/latam-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue: The Salvadoran Volcano Bonds might be launched in Q1 2024, Unblock Global raised $15 million for a flare gas mining project in Vaca Muerta, and Argentine President Javier Milei axes ministries to reduce [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T09:30:13.000Z",
    "title": "Navigating the New Landscape: The Impact of the White House AI Executive Order on Cybersecurity Leadership",
    "url": "https://www.cryptopolitan.com/the-white-house-ai-order-on-cybersecurity/",
    "description": "In an era where artificial intelligence (AI) is rapidly reshaping the technological landscape, the White House has taken a significant step. On October 30, 2023, President Joe Biden issued an executive order focusing on the &#8220;Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence.&#8221; This directive aligns with global efforts, including the G-7&#8217;s support [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T09:28:36.000Z",
    "title": "Analyzing Bitcoin Cash’s Future, Injective’s Consistent Growth, and High ROI Potential of VC Spectra",
    "url": "https://nulltx.com/analyzing-bitcoin-cashs-future-injectives-consistent-growth-and-high-roi-potential-of-vc-spectra/",
    "description": "As Binance announced the integration of Bitcoin Cash (BCH) in the Binance Web3 wallet, Injective’s (INJ) made a rapid surge in social media activity. Analysts boast that one of the new DeFi projects, VC Spectra (SPCT), is under the radar for transforming the crypto landscape. Let’s learn more about BCH, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T09:16:55.000Z",
    "title": "Synthetix (SNX) Drops 18% As Crypto Market Cools Down – Details",
    "url": "https://www.newsbtc.com/news/synthetix-snx-drops-18-as-crypto-market-cools-down-details/",
    "description": "The market is currently experiencing an enormous pullback after nearly a month of continuous gains. According to Coingecko, the broader crypto market is down nearly 3% as major cryptocurrencies like Bitcoin, Ethereum, and XRP drop from year-to-date highs. As the sector cools down, altcoins are pulled downward.  Synthetix is one of the sufferers of the massive bearish pressure engulfing the market. Coingecko data shows that the token is bleeding, with the biggest drop occurring in the weekly timeframe at over 16%.  Related Reading: Internet Computer Loses Grip On $10, But Still Inks 82% Rally – Details Big Things Coming For Synthetix Although SNX isn’t faring well within the market environment, the Synthetix dev team is hot on its tracks to remain competitive within the world of crypto. Last week, Synthetix announced on X that they are nearing the launch of the Andromeda Release on their mainnet and the Ethereum Mainnet.  Andromeda Release is the implementation of the Perps V3 which, according to their recent blog post, is focused on enhancing trading efficiency, usability, and resilience on the network. It will also add new features like Native Cross-Margining, Expanded Collateral Options, MEV-Resistant Liquidation Process, and many more.  Synthetix Perps V3 is set to launch with the Andromeda Release on Base, soon to be followed by an Ethereum Mainnet version for medium to whale traders and protocols like @ethena_labs! 👇https://t.co/72QmySbAfb Check out the TLDR and read the blog post to learn more. &#8211; Perps V3… pic.twitter.com/YbsFjj0Hnt — Synthetix ⚔️ (@synthetix_io) December 15, 2023 The biggest add-on from the update is the deployment of Core V3 and Perps V3 on the Ethereum mainnet.  “The Core V3 + Perps V3 release on Ethereum Mainnet represents a significant evolution for Synthetix, targeting medium to large traders and protocols in need of perps on L1,” the Synthetix team said in their blog post.  SNX market cap currently at $1 billion. Chart: TradingView.com More Pain On The Crypto Front? Disregarding the positive internal news for SNX, the market has other plans for the token. As of writing, the bears are coming out strong, wrestling SNX bulls on the $3.59 price level. If the bears are successful in solidifying their gains, more pain could be in store for traders and investors.  Related Reading: Shiba Inu Just Spiked 12% Overnight – What’s The Next Move? However, the upcoming implementation of Perps V3 might be able to offset this as it focuses on medium to large-scale whales to become active on the platform, thus driving more throughput to the network; but investors and traders shouldn’t disregard the broader market before making a decision.  Right now, the market is entering its cool-down phase with cryptocurrencies reverting to more sustainable price levels. For SNX, that level is around the $3.287 price point. Once the bears hit this level, the bulls will be able to regain some ground, stabilizing the price on this level in preparation for a bigger breakout. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T09:10:21.000Z",
    "title": "Ripple’s Strategic Maneuver: A Game-Changer in the $7.5 Trillion FX Market",
    "url": "https://www.crypto-news-flash.com/ripples-strategic-maneuver-a-game-changer-in-the-7-5-trillion-fx-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-strategic-maneuver-a-game-changer-in-the-7-5-trillion-fx-market",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-85.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-85.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-85-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-85-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple collaborates with the Bank for International Settlements (BIS) in Project Mariana to innovate the $7.5 trillion FX market using tokenized systems. Despite Ripple&#8217;s advancements and a possible IPO, experts suggest these developments may not significantly boost XRP’s price. Ripple&#8217;s Foray into the FX Market with BIS&#8217;s Project Mariana Ripple, a leader in financial technology, [...]"
  }
]