[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T13:14:12.000Z",
    "title": "3 Reasons Why Beauty on the Blockchain Makes Sense",
    "url": "https://www.coindesk.com/web3/2023/06/05/3-reasons-why-beauty-on-the-blockchain-makes-sense/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Through new forms of digital artistry and cutting-edge technological innovation, today’s leading beauty companies hope to reach Web3-native consumers, create meaningful experiences and perhaps even clean up their supply chain."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T13:15:00.000Z",
    "title": "Are Web3 apps under scrutiny?",
    "url": "https://cointelegraph.com/innovation-circle/are-web3-apps-under-scrutiny",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7f5e8fc3-90ad-4b9c-98fb-854bf32a4129.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>One of the biggest challenges Web3 apps are facing is the difficulty of reaching a wider audience.</p>\n                    <p><p>The rise of Web3 apps, or decentralized applications (dApps), has been nothing short of a journey in recent years. From blockchain-based social media platforms to non-fungible tokens (NFTs), the Web3 ecosystem has definitely started moving in a positive direction.</p> <p>However, as great as the positives are, there have been some bumps on the road and they don’t seem to be going away anytime soon. With the recent restrictions imposed by some of the biggest tech companies, the future of Web3 apps has come under scrutiny and is making the process of launching on the app stores more difficult than anticipated. Not to worry, emerging Web3 companies are savvy and quick to adapt feedback. </p> <p>One of the biggest challenges Web3 apps are facing is the difficulty of reaching a wider audience. For example, Apple’s App Store has a strict policy that only allows apps that meet its guidelines to be listed, which is more than fair, but sadly as a result, this has made it difficult for Web3 developers to get their apps in front of iOS users, limiting their growth potential. Let’s not skip past the fact that the App Store also provides added layers of trust just by having the app on there.</p> <p>Furthermore, some of the most innovative and exciting Web3 apps have been banned from app stores altogether due to security reasons. This has caused huge frustration among Web3 developers, who see these restrictions as a roadblock to their growth.</p> <p>MetaMask, one of the most popular Ethereum-based DeFi wallets, is an example. They found themselves <a href=\"https://cointelegraph.com/news/google-suspends-metamask-from-its-play-app-store-citing-deceptive-services\">being removed from the Google Play Store</a> due to concerns that it could be used to access decentralized financial services and is a security risk. This was in 2019 and has since been resolved, but similar issues are still being encountered today.</p> <p>Coinbase also found difficulties in a similar manner in which they were <a href=\"https://www.coindesk.com/markets/2013/11/15/apple-removes-coinbase-from-app-store-less-than-a-month-after-launch/\">denied</a> access to the app store back in 2013, however, that has also changed. Yet, issues still occur with the most recent one being from a change of App Store guidelines on NFTs <a href=\"https://finance.yahoo.com/news/apple-not-allow-nfts-used-065738905.html\">stating</a>, “Apps may allow users to view their own NFTs, provided that NFT ownership does not unlock features or functionality within the app.”</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>As a result, any NFT purchases through the App Store, would see a 30% fee deduction, and on top of this, any NFTs that were not integrated or purchased in-app would also not be eligible to unlock additional incentives or in-app features either. However, it is important to note that due to Apple not being on the blockchain themselves, this is not something they can help solve, and therefore is more of an unfortunate situation for users instead of any malicious intent.</p> <p>Another significant challenge facing Web3 apps are restrictions imposed by social media platforms. Meta, the social media giant, had restricted ads related to cryptocurrency and blockchain technology, including NFTs. This limited the ability of Web3 developers to promote their projects on one of the largest social media platforms in the world — which eliminates a huge potential audience. Now, some of these restrictions have been walked back by Meta and updated rules be found <a href=\"https://www.facebook.com/business/help/438252513416690?id=595195347635322\">here</a>.</p> <p>However, despite the restrictions that Web3 developers are facing, optimism about the future of their technology remains intact, especially with the constant flow of opportunities combined with the adaptations in technology and protocols to bypass them. </p> <p>Moreover, the rise of decentralized app stores such as OpenSea and PancakeSwap has given Web3 developers new avenues to reach users. These app stores operate on blockchain technology, which allows for a more decentralized and transparent approach to app distribution.</p> <p>Furthermore, the Web3 ecosystem is constantly evolving, with new developments and technologies being introduced all the time. This means that Web3 developers are able to adapt and innovate in the face of challenges, ensuring that their technology remains at the forefront of innovation, while also illustrating the bumps along the road as seen above.</p> <p>While the restrictions may make it difficult for Web3 apps to grow, the resilience and innovation of Web3 developers means that they will find ways to overcome these challenges and this is shown by the examples above. Web3 developers could also seek to partner with emerging companies and technologies to reduce these restrictions, while also benefitting and providing a longer-term solution that adds value, especially with integrations as seen with app stores, unfortunately. Education about Web3 is severly lacking. Increasing people’s knowledge around Web3 could significantly benefit the community. Not only will developers and emerging companies feel safer and more confident, but users would also benefit greatly when navigating the more daunting aspects around restrictions too.</p> <p>With the rise of decentralized app stores and the ongoing development of new technologies, the Web3 ecosystem remains a promising and exciting area of innovation. As we move towards a more decentralized and transparent internet, the potential of Web3 apps will continue to be realized, transforming the way we interact with the digital world even with barriers in the way — the only issue is finding the solution.</p> <p><em>Ilias Salvatore is the news correspondent at <a href=\"https://flooz.trade/trade\">Flooz Trade</a> — the easy place to buy, trade and track crypto with real-time data and alerts. </em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T13:20:42.000Z",
    "title": "Crypto Twitter’s weekend filled with scams, hacks, and fake events",
    "url": "https://cryptoslate.com/crypto-twitters-weekend-filled-with-scams-hacks-and-fake-events/",
    "description": "<p>This weekend in crypto saw several peculiar events unfolding, from a thought-provoking fake summit to prominent Twitter account hacks and discussions on potential technological advancements. Uniswap fake event In an extraordinary display of deception, a group in Shenzhen, China, staged an event under the guise of the &#8220;First Uniswap Asian Summit&#8221; and had a so-called [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-twitters-weekend-filled-with-scams-hacks-and-fake-events/\">Crypto Twitter&#8217;s weekend filled with scams, hacks, and fake events</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T13:16:49.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T13:29:59.000Z",
    "title": "Bitcoin Ordinals upgrade addresses ‘cursed inscriptions’ issue",
    "url": "https://crypto.news/bitcoin-ordinals-upgrade-addresses-cursed-inscriptions-issue/",
    "description": "As per the latest reports from an ordinal's code sculptor, ordinals is unveiling an upgrade to resolve the 'Cursed Inscriptions' issue on the bitcoin Protocol."
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T13:32:32.000Z",
    "title": "US Capital Decreases in Digital Asset Space: On-Chain Data",
    "url": "https://coinedition.com/us-capital-decreases-in-digital-asset-space-on-chain-data/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/If_we_look_at_exchange_on_chain_flows_we_also_see_considerably.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The on-chain analysis platform Glassnode shared a few posts on Twitter today to highlight some new trends that can be observed within the crypto space. Glassnode explained in one of the posts that over the past two years, there has been a significant shift in the dominance of Bitcoin’s (BTC) supply. On-chain data indicated that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/us-capital-decreases-in-digital-asset-space-on-chain-data/\">US Capital Decreases in Digital Asset Space: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]