[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T09:56:48.000Z",
    "title": "AI could threaten humanity in 2 years, warns UK AI task force advisor  ",
    "url": "https://cointelegraph.com/news/ai-could-threaten-humanity-in-two-years-says-uk-advisor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/be621ca7-0790-4dc6-b1ab-319a8ce8e4c0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The UK prime minister’s AI task force advisor said large AI models will need regulation and control in the next two years to curb major existential risks.  </p>\n                    <p><p>The AI task force advisor to the prime minister in the United Kingdom said humans have roughly two years to control and regulate artificial intelligence (AI) before it becomes too powerful. </p><p>In an <a href=\"https://www.youtube.com/watch?v=wn4z1WnR6K0\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with a local UK media outlet Matt Clifford, who also serves as the chair of the government’s Advanced Research and Invention Agency (ARIA), stressed that current systems are getting “more and more capable at an ever-increasing rate.”</p><p>He continued to say that if officials don’t start considering safety and regulations now, in two years' time the systems will become“very powerful.”</p><blockquote>“We've got two years to get in place a framework that makes both controlling and regulating these very large models much more possible than it is today.”</blockquote><p>Clifford warned that there are “a lot of different types of risks” when it comes to AI, both near-term and long-term ones, which he called “pretty scary.”</p><p>The interview came following a <a href=\"https://www.safe.ai/statement-on-ai-risk\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> published by the Center for AI Safety the previous week, which was signed by 350 AI experts, including the CEO of OpenAI, that said AI should be treated as an existential threat similar to that posed by nuclear weapons and pandemics. </p><blockquote>“They're talking about what happens once we effectively create a new species, sort of an intelligence that's greater than humans.”</blockquote><p>The AI task force advisor said that these threats posed by AI could be “very dangerous” ones that could “kill many humans, not all humans, simply from where we'd expect models to be in two years' time.”</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ai-related-crypto-returns-rose-up-to-41-after-chatgpt-launched-study\"><strong><em>AI-related crypto returns rose up to 41% after ChatGPT launched: Study</em></strong></a></p><p>According to Clifford, the main focus of regulators and developers should be to focus on understanding how to control the models and then implementing regulations on a global scale.</p><p>For now, he said his greatest fear is the lack of understanding of why AI models behave the way they do. </p><blockquote>“The people who are building the most capable systems freely admit that they don't understand exactly how [AI systems] exhibit the behaviors that they do.”</blockquote><p>Clifford highlighted that many of the leaders of organizations building AI also agree that powerful AI models must undergo some type of audit and evaluation process prior to their deployment. </p><p>Currently, regulators around the world are scrambling to both understand the technology and its ramifications, while trying to create regulations that protect users and still allow for innovation. </p><p>On June 5, officials in the European Union went so far as to suggest mandates that all <a href=\"https://cointelegraph.com/news/eu-officials-want-all-ai-generated-content-labeled\">AI-generated content</a> should be labeled as such in order to prevent disinformation. </p><p>In the UK a minister in the opposition party<a href=\"https://cointelegraph.com/news/ai-regulated-medicine-nuclear-power-uk-minister\"> echoed the sentiments</a> mentioned in the CAIS letter, saying that the technology should be regulated as are medicine and nuclear power</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\"><strong><em>AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T09:55:00.000Z",
    "title": "Cboe Gets Approval For Margin Trades On Crypto Futures Exchange",
    "url": "https://cryptodaily.co.uk/2023/06/cboe-gets-approval-for-margin-trades-on-crypto-futures-exchange",
    "description": "<p>The Commodity Futures Trading Commission has approved an amended order of registration, allowing Cboe Clear Digital to clear additional products as a derivatives clearing organization.&nbsp;</p>\nGreen Signal For Cboe&nbsp;\n<p>The announcement means that traders on Cboe Global Markets&rsquo; digital-asset exchange would be able to enter into margined Ether and Bitcoin contracts. The amended order will allow Cboe Clear Digital to offer clearing services for digital asset futures on a margined basis for futures commission merchants.</p>\n\n<p>&ldquo;The Commodity Futures Trading Commission today approved an amended order of registration for Cboe Clear Digital, LLC (Cboe Clear) to clear additional products, subject to the terms and conditions specified in the order, as a derivatives clearing organization (DCO) under the Commodity Exchange Act.&rdquo;</p>\n\n<p>This will be in addition to the fully collateralized futures and fully collateralized swaps that were previously approved.&nbsp;</p>\n\n<p>&ldquo;The amended order permits Cboe Clear to provide clearing services for digital asset futures on a margined basis for futures commission merchants, in addition to the fully collateralized futures and fully collateralized swaps previously authorized.&rdquo;</p>\n\n<p>Previously, Cboe only offered fully collateralized trading of cryptocurrency futures, which required clients to furnish the entire amount of a particular contract before trading. With margined trading, traders can put up less capital when opening a position. Furthermore, the physical settlement of digital assets will enable traditional financial firms to access Bitcoin and Ether futures without handing over custody to intermediaries. Cboe Digital president John Palmer added,&nbsp;</p>\n\n<p>&ldquo;That&rsquo;s where the concept of us also having a spot market has advantages. We didn&rsquo;t want to have to force participants to custody or touch the physical asset.&rdquo;&nbsp;</p>\n\nPrudent Risk-Mitigation Measures&nbsp;\n<p>Cboe Clear&rsquo;s parent company, Cboe Digital Exchange, is registered with the Commodities Futures Trading Commission as a designated contract market. This gives Cboe the authority to expand its clearing of futures contracts for crypto assets while ensuring that it does so within the traditional US futures intermediated market structure. Christy Goldsmith Romero, the Commodity Futures Trading Commission president, in a separate statement, added,&nbsp;</p>\n\n<p>&ldquo;The Order is accompanied by prudent risk-mitigation measures implemented by Cboe. I have been vocal about the benefits of bringing appropriate crypto activities into the regulated space in order to protect customers, but in a way that supports oversight, accountability, transparency, and risk management.&rdquo;</p>\n\n<p>Romero added that Cboe&rsquo;s application was in stark contrast with another from the now-collapsed cryptocurrency exchange FTX for a &ldquo;bespoke disintermediated direct-to-customer market structure.&rdquo;</p>\n\n<p>&ldquo;Too often in recent years, crypto firms have sought to take a business model or market structure that exists in an unregulated environment and port it over to the regulated environment. &ldquo;Cboe has not done that, instead operating within the parameters of the traditional futures market structure and regulatory framework. It has constructively engaged with the staff and my office to address concerns related to risk and implement risk-mitigating measures.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T09:49:22.000Z",
    "title": "Former NFL co-owner sentenced to 6 years for crypto shadow bank scheme",
    "url": "https://crypto.news/former-nfl-co-owner-sentenced-to-6-years-for-crypto-shadow-bank-scheme/",
    "description": "Reginald Fowler, a former co-owner of the Minnesota Vikings and prominent figure in the NFL, has been handed a six-year prison sentence after being found guilty of running a \"shadow bank\" operation within the crypto industry."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T09:43:56.000Z",
    "title": "Pepe price tumbles 16% amid Binance regulatory saga",
    "url": "https://crypto.news/pepe-price-tumbles-16-amid-binance-regulatory-saga/",
    "description": "Pepe is among the top loosers of the day as the asset recorded a drop of 14%. The drop can be attributed to the recent SEC complaint on Binance that might have caused some investor panic  and FUD."
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-06T10:01:00.000Z",
    "title": "Bitfinex to List GoCrypto’s Native Token, GoC",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-to-list-gocryptos-native-token-goc/",
    "description": "<p>ROAD TOWN, British Virgin Islands – June 6, 2023&#160; Bitfinex (https://www.bitfinex.com/), a state-of-the-art digital asset trading platform, announced today that it will be listing the GoC Token, the native token of the GoCrypto Ecosystem. GoCrypto is a leader in global crypto and card payment infrastructure,...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-to-list-gocryptos-native-token-goc/\">&lt;strong&gt;Bitfinex to List GoCrypto’s Native Token, GoC&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]