[
  {
    "source": "CoinDesk",
    "date": "2023-08-25T20:48:41.000Z",
    "title": "Visa And Mastercard Distancing Themselves From Binance Unlikely to Hurt the Crypto Exchange: Experts",
    "url": "https://www.coindesk.com/business/2023/08/25/visa-and-mastercard-distancing-themselves-from-binance-unlikely-to-hurt-the-crypto-exchange-experts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The decision comes only weeks after Binance has been grappling with multiple legal challenges in the U.S."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-25T19:50:01.000Z",
    "title": "AI Deepfakes Are a Threat to Businesses Too—Here's Why",
    "url": "https://decrypt.co/153794/ai-deepfakes-threat-businesses-too-heres-why",
    "description": "A KPMG report highlights the implications of AI-created deepfake content on businesses, including through scams and reputational attacks."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-25T19:19:03.000Z",
    "title": "Stephen King Isn't Afraid of AI—His Books Have Trained It",
    "url": "https://decrypt.co/153807/stephen-king-isnt-afraid-ai-books-have-trained",
    "description": "Horror master Stephen King believes that opposing AI \"is like trying to stop industrial progress by hammering a steam loom to pieces.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T20:50:00.000Z",
    "title": "Alleged former Worldcoin employee says they're in contact with authorities",
    "url": "https://cointelegraph.com/news/alle-former-worldcoin-employee-says-contacting-authorities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a2663c5f-3dc8-49f8-8e1e-d53ae63c91af.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The individual, whose Worldcoin employment could not be independently verified, claimed they witnessed “sloppy and/or illegal things” while working there prior to the token launch.</p>\n                    <p><p>An individual calling themselves Nadir Hajarabi, who claimed to have previously worked for Worldcoin, has alleged the human identity verification project may have committed illegal acts during their employment.</p><p>In an Aug. 23 YouTube video, Hajarabi <a href=\"https://www.youtube.com/watch?v=IeCq39AuKpc\" target=\"_blank\" rel=\"noopener nofollow\">said</a> they witnessed “very questionable” activities at Worldcoin including “sloppy and/or illegal things” prior to quitting the project <a href=\"https://cointelegraph.com/news/worldcoin-launches-token-to-distinguish-humans-from-bots\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/worldcoin-launches-token-to-distinguish-humans-from-bots/amp\">before its token launch</a> on July 24. They claimed the organization was holding some of their pay, and were speaking with authorities in different jurisdictions as part of probes into Worldcoin.</p><p>According to Hajarabi, the Worldcoin project had a “horrendous execution” which involved cutting corners ahead of the release of its white paper, and they had seen red flags “from day one”. They said they contacted the Worldcoin CEO and the organization’s legal team but did not receive satisfactory answers for the alleged discrepancies in its mission versus execution. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/IeCq39AuKpc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Cointelegraph was unable to independently verify Hajarabi’s claims, though a photo <a href=\"https://twitter.com/NadirHajarabi/status/1695167096815079465\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> to X appeared to show them with one of the project's iris-scanning orbs. Their YouTube channel, created in September 2013, featured only one video with the allegations against Worldcoin. An X account which appeared to be controlled by the same individual posted a photo of an ETHGlobal Paris badge with Hajarabi’s name and affiliation with Worldcoin. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/25a41824-825f-4fac-ac18-f8669ef4943d.png\"><figcaption style=\"text-align: center;\"><em>X posted by Nadir Hajarabi on Aug. 25 of an ETHGlobal Paris badge. Source: X</em></figcaption></figure><p>A LinkedIn page of Hajarabi <a href=\"https://www.linkedin.com/in/nadirhajarabi/\" target=\"_blank\" rel=\"noopener nofollow\">appeared</a> to be connected to the same individual in the YouTube video — a Paris resident with experience in nonfungible tokens, web3 projects, and smart contracts. Cointelegraph reached out to Worldcoin for comment, but did not receive a response at the time of publication.</p><p>The Worldcoin project started with the intention of distinguishing real people from bots by providing retinal scans for identity verification through the orbs. There were more than 2 million sign-ups prior to the launch of the Worldcoin token in July.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai/amp\"><strong><em>Worldcoin launch sparks debate over data privacy and future of AI</em></strong></a></p><p>Ahead of the launch of the Worldcoin token and verification process, many in and out of the crypto space criticized the project, citing privacy concerns over user data. The Bavarian State Office for Data Protection Supervision <a href=\"https://cointelegraph.com/news/german-government-watchdog-launched-worldcoin-probe\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/german-government-watchdog-launched-worldcoin-probe/amp\">reportedly began investigating Worldcoin</a> in November 2022 while the French National Commission on Informatics and Liberty reportedly called its data collection methods “questionable.” The Information Commissioner’s Office in the United Kingdom has also <a href=\"https://cointelegraph.com/news/worldcoin-may-face-uk-data-regulators-enquiry-days-after-launch-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/worldcoin-may-face-uk-data-regulators-enquiry-days-after-launch-report/amp\">raised similar concerns</a> over the project. </p><p>In August, Kenya’s minister of internal security announced it would <a href=\"https://cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin/amp\">suspend Worldcoin’s local operations</a> until authorities had the opportunity to assess any potential risk to residents, which reportedly included a raid and seizure of the organization’s equipment. Argentina’s Agency for Access to Public Information later <a href=\"https://cointelegraph.com/news/argentine-agency-investigation-worldcoin-biometric-data\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/argentine-agency-investigation-worldcoin-biometric-data/amp\">announced a probe</a> into Worldcoin’s collection, storage and use of customer data, citing security and privacy concerns.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>‘Moral responsibility’: Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T20:45:00.000Z",
    "title": "Robinhood accumulated $3B in Bitcoin in 3 months — What does this mean for markets?",
    "url": "https://cointelegraph.com/news/how-significant-is-it-that-robinhood-accumulated-3b-in-bitcoin-over-three-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2c5e0e66-5a15-4f8d-becc-4cdf58630385.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Robinhood’s Bitcoin holdings could reshape the crypto landscape by supercharging the influence of retail investors and possibly creating new market risks. </p>\n                    <p><p>In a swift and intriguing turn of events, a previously enigmatic Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) address managed to catapult itself to the esteemed position of the third-largest holder of BTC. As reported by Cointelegraph on Aug. 22, the address in question accumulated a staggering 118,000 BTC.</p><p>While its identity <a href=\"https://cointelegraph.com/news/bitcoin-whale-wallet-becomes-third-largest-holder-three-months\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-whale-wallet-becomes-third-largest-holder-three-months/amp\">has now been attributed to Robinhood</a>, questions still linger, as the financial giant has neither confirmed nor denied these allegations. Some on-chain analysts posit that the stash actually belongs to MicroStrategy, the U.S. business intelligence and analytics software firm, <a href=\"https://cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin/amp\">which holds 152,800 BTC</a>, as per their recent submission to the U.S. Securities and Exchange Commission.</p><h2>Is TradFi dethroning crypto-focused intermediaries?</h2><p>Should Robinhood's ownership of the 118,000 BTC be validated, the consequences could reverberate across the cryptocurrency landscape. Traditionally, the largest Bitcoin addresses have predominantly been linked to crypto-native exchanges. However, Robinhood's role as a conventional broker focused on equities and options sets an intriguing precedent.</p><p>A glance at Robinhood's latest 10-Q <a href=\"https://www.sec.gov/Archives/edgar/data/1783879/000178387923000175/hood-20230630.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> reveals that they held $4.24 billion in Bitcoin. Given Bitcoin's price neared $30,500 on June 30, this equates to approximately 139,016 BTC – a fact that aligns seamlessly with the on-chain analysts' contentions regarding Robinhood's substantial crypto holdings.</p><p>If Robinhood is the owner of the “mystery” Bitcoin address, this makes one point pretty clear. Bitcoin doesn't rely on big institutions to succeed. Analysts used to argue that for Bitcoin to really take off, more big investment firms or companies like Tesla and Block Inc. needed to get on board. But those hopes fizzled out as recent reports from Apple and Alphabet (Google's parent company) revealed they hadn’t taken the Bitcoin plunge after all.</p><p>RegardingRobinhood, reports say that by June 2023, they had around 23.2 million active users. If just 10% of them owned some Bitcoin, they would need an average of about $1,828 each to reach the reported $4.24 billion in Bitcoin holdings. This goes to show that regular people, like those on Robinhood, can actually play a significant role in shaping the cryptocurrency landscape. </p><h2>The downside of Bitcoin being held by Robinhood</h2><p>While some investors want Bitcoin mass adoption by any means possible, getting there is not without risk. Robinhood's user base is known for their penchant for speculative trading notably in meme stocks like AMC, GameStop and Bed Bath & Beyond. These traders also boast substantial holdings in Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) – amounting to a staggering $2.63 billion. </p><p>Their propensity for short-term investments raises questions about their approach to Bitcoin. If these investors purchased BTC in anticipation of U.S. spot-based ETF approval, the prospect of a prolonged price decline or delayed approval might trigger mass sell-offs.</p><p>Furthermore, a more remote yet conceivable risk emerges from the possibility of U.S. government intervention. Although the probability of a scenario akin to the 1933 Executive Order 6102, which mandated private gold holdings be exchanged for paper currency, seems slim, potential actions by U.S. authorities could potentially jeopardize these holdings.</p><p>Even in the unlikely scenario where the U.S. justice system or the IRS opts to lock down those assets while they investigate users for tax or similar issues, the substantial stash of Bitcoin held by Robinhood only amplifies the potential risks. The expansive pool of assets held by Robinhood heightens the risk of such actions affecting a larger portion of the market.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ark-glassnode-propose-bitcoin-economic-analytics-framework-using-new-metric\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ark-glassnode-propose-bitcoin-economic-analytics-framework-using-new-metric/amp\">ARK, Glassnode propose Bitcoin economic analytics framework using new metric</a></em></strong></p><p>Paradoxically, this vast accumulation of cryptocurrency holdings by Robinhood clients could potentially serve as ammunition for ETF applicants. While offering a comparable service, Robinhood's potential lack of investor protections could incentivize the establishment of more secure and regulated ETFs.</p><p>The newfound prominence of Robinhood in the cryptocurrency sphere underscores the ever-evolving nature of the market. Whether or not spot Bitcoin ETFs materialize, investors will find alternative avenues to enhance their exposure to cryptocurrency, be it through MicroStrategy shares, Robinhood, or other innovative means. This adaptability aptly demonstrates that in the realm of finance, innovation and progress are inevitable – much like nature's unyielding drive to find a way.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T20:23:40.000Z",
    "title": "Spanish central bank official talks about private payment services in era of digital euro",
    "url": "https://cointelegraph.com/news/spanish-central-bank-official-talks-about-private-payment-services-era-digital-euro",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/16c7c07b-e94f-4152-886d-b734bf39ca37.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Banco de España Deputy Gov. Margarita Delgado voiced concern about financial stability issues but painted a rosy picture for nonbank financial service providers. </p>\n                    <p><p>Deputy Governor of the Bank of Spain Margarita Delgado spoke to university students and others about the introduction of the digital euro in Pamplona on Aug. 25. Looking into a future through the lens of the European Commission’s <a href=\"https://cointelegraph.com/news/european-commission-aims-universal-acceptance-digital-euro-proposal\">recently proposed digital euro legislative plan</a>, she spoke at length about how private payment solutions will interact with the digital euro and its infrastructure.</p><p>The digital euro can help the European Union overcome challenges such as cross-border payment barriers, the costs to businesses of using private payment service providers (PSPs) and the general lack of PSPs in Europe. The development of central bank digital currencies and stablecoins elsewhere could make the last problem worse without the introduction of the digital euro. She said:</p><blockquote>“We believe there is enough space for a digital euro and private payment solutions to co-exist. […] In fact, our expectation is that the digital euro enables the development of new pan-European payment and financial services by the private sector, making it easier to compete with non-European solutions.”</blockquote><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ai-spain-launches-ai-regulation-agency-in-bid-to-become-industry-leader\">Spain launches AI regulation agency in bid to become industry leader</a></em></strong></p><p>The digital euro would not be covered by common deposit insurance until a common supervisory and resolution authority is put in place under the European deposit insurance scheme. Financial security has to be considered before the digital euro is launched, Delgado added. </p><blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">Continuamos con la tradicional mesa redonda sobre política monetaria con Margarita Delgado, subgobernadora del Banco de España, <a href=\"https://twitter.com/burkhardbalz?ref_src=twsrc%5Etfw\">@burkhardbalz</a>, miembro del Comité Ejecutivo del BundesBank, Ángel Nigorra, director general de Bizum España, y <a href=\"https://twitter.com/PabloZalba?ref_src=twsrc%5Etfw\">@PabloZalba</a>, comisario de los CEV. <a href=\"https://t.co/Q05tFeaK17\">pic.twitter.com/Q05tFeaK17</a></p>&mdash; Equipo Europa (@Equipo_Europa) <a href=\"https://twitter.com/Equipo_Europa/status/1695001393294152123?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The European Central Bank (ECB) foresees getting the digital euro up and running in the eurozone before expanding its reach. The retail use of the digital euro outside the eurozone will provide new opportunities for private PSPs to serve as intermediaries, Delgado noted.</p><p>The ECB has its own wish list for the regulation of PSPs. Delgado said:</p><blockquote>“It [the ECB Eurosystem] has also called on regulators to act in order to require payment service providers to make the digital euro available to the broad population.” </blockquote><p>The ECB will request that PSPs offer a digital euro physical payment card as well. </p><p>PSPs will be banned from charging fees for basic services or requiring a contractual agreement before providing access to the digital euro under the proposed regulation. They will be required to provide onboarding support for members of vulnerable groups, “including the availability of human interaction to guide users through onboarding and transaction execution.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\">Best and worst countries for crypto taxes — plus crypto tax tips</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T19:48:10.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Nearly three weeks after its launch, PayPal's PYUSD stablecoin has attracted limited adoption. Defunct crypto exchange FTX has announced a cybersecurity breach involving its bankruptcy case claims agent, Kroll, in which limited, non-sensitive customer data of specific claimants was exposed. Meanwhile, the Pepe (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>) memecoin took a sharp dive in price after strange token movements sparked fears of the beginning of a rug pull. </p><h3>PayPal’s stablecoin sees limited uptake post-launch</h3><p>The launch of PayPal’s stablecoin, PYUSD, has been met with <a href=\"https://cointelegraph.com/news/paypal-pyusd-stablecoin-struggles-with-adoption-nansen\">limited adoption so far</a>, according to on-chain data compiled by Nansen.</p><p><a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">Since launching on Aug. 7</a>, roughly 90% of PayPal USD is still held by Paxos Trust, the stablecoin’s issuer. Only 7% of the total supply of PYUSD is held on exchanges like Kraken, Gate.io and Crypto.com. In other words, the coin isn’t circulating on exchanges and has seen limited adoption by crypto users.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/avz4_Msc9aE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Excluding contracts and exchanges, only 10 holders have amassed over $1,000 worth of PYUSD, Nansen said. Adoption among so-called “smart money” investors, a term used to describe institutions and professional traders, is negligible. </p><p>PayPal has over 350 million users and the launch of a stablecoin was supposed to be a seminal moment for crypto adoption. So far, that hasn’t materialized.</p><p>“On the surface there’s a lack of demand from crypto users for PYUSD when other alternatives exist (might be due to Paypal targeting a different demographic),” Nansen said.”</p><h3>FTX crypto exchange reports data breach involving claims agent Kroll</h3><p>Defunct crypto exchange FTX has announced a cybersecurity breach involving its bankruptcy case claims agent, Kroll, in which limited, non-sensitive customer data of specific claimants was exposed. FTX said it is actively overseeing the situation, assuring that account passwords, systems and funds remain unaffected.</p><p>The struggling crypto exchange utilized the X platform on Aug. 25 to notify its customers, creditors and the public about a cybersecurity breach involving its claims agent, Kroll. The breach has resulted in the exposure of non-sensitive customer data from specific claimants linked to the ongoing bankruptcy case.</p><p>FTX has stated that Kroll is presently informing the individuals impacted by the cybersecurity event about the steps they can take for their protection. The crypto exchange in bankruptcy clarified that its account passwords and systems remain secure.</p><blockquote>“The incident occurred at Kroll, and Kroll is notifying affected individuals directly with measures that customers can take to protect themselves. FTX account passwords were not maintained by Kroll, and FTX’s own systems were not affected.”</blockquote><p>Furthermore, the FTX debtors have initiated communication with Kroll and are diligently overseeing the unfolding situation. Kroll has informed the debtors that they have swiftly controlled and addressed the incident. Customers are advised to exercise vigilance against potential fraudulent and scam emails posing as entities involved in bankruptcy proceedings.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A friend just received a phishing email to the email associated with their FTX account. <a href=\"https://t.co/cWy3ykN4B3\">pic.twitter.com/cWy3ykN4B3</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1694938997531738511?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Meanwhile, blockchain investigator ZachXBT <a href=\"https://twitter.com/zachxbt/status/1694938997531738511\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that FTX clients are already receiving fraudulent emails, and the personal information of customers has been compromised.</p><p>Celsius Network, a crypto lending platform facing bankruptcy, experienced a data breach resulting in the exposure of its email records. This breach has had a notable impact on the ongoing bankruptcy reorganization process.In the meantime, FTX has enlisted Galaxy Digital, led by Mike Novogratz, to assist in managing its selling, staking and hedging endeavors. This partnership aims to bolster FTX’s efforts to mitigate risks linked to market volatility and optimize the returns from its Bitcoin holdings.</p><h3>PEPE plunges as strange token movements spark fears of rug pull</h3><p>The price of the frog-themed memecoin Pepe plunged nearly 15% after changes to a multisig wallet and token transfers ignited fears of a “rug pull” by its developers. </p><p>The <a href=\"https://twitter.com/wizardofsoho/status/1694817350741025201\" target=\"_blank\" rel=\"noopener nofollow\">allegations</a> — as well as the negative price action — came as $16 million worth of Pepe tokens were sent from the developers’ multisig wallet to various crypto exchanges on Aug. 24.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24PEPE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PEPE</a> Dev Wallet Sends $15M to Binance, OKX, and Bybit.<br><br>Only hours ago the PEPE Multi-Sig wallet undergoes unusual changes and transactions. Many fear a potential &quot;rug pull.&quot;<br><br>The PEPE multi-sig wallet sent over $15M worth of PEPE to three major centralized exchanges and one… <a href=\"https://t.co/xgGjhROILE\">pic.twitter.com/xgGjhROILE</a></p>&mdash; MANDO CT (@XMaximist) <a href=\"https://twitter.com/XMaximist/status/1694941539896607014?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to <a href=\"https://app.safe.global/transactions/history?safe=eth:0x5BdEA820293689B77FA8e83b1E3D58B27B5ce9BA\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from blockchain custody app Safe Global, the wallet address transferred 16 trillion Pepe tokens — approximately 3.8% of the total supply — to three exchanges and an unverified wallet address.</p><p>Following the transfer of the 16 trillion Pepe tokens to exchanges, the developers made a curious change to the team’s multisig wallet, which at the time of publication still contains $10 million worth of Pepe.</p><p>Data from Etherscan <a href=\"https://etherscan.io/tx/0xdae4224f5290a505aa61aee022f892650c171594bbf347ce1dcf2c86c8879676#eventlog\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that the wallet now only requires two out of eight signatures — formerly five out eight — to sign off on whether or not the wallet should make transfers.</p><blockquote class=\"twitter-tweet\"><p lang=\"fr\" dir=\"ltr\">PEPE le plunge <a href=\"https://t.co/rdwYKgORkP\">pic.twitter.com/rdwYKgORkP</a></p>&mdash; Messari (@MessariCrypto) <a href=\"https://twitter.com/MessariCrypto/status/1694836361533005961?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Notably, the transfer of funds marked the first time that Pepe tokens had ever been sent from the project's multisig wallet to exchanges.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T19:43:32.000Z",
    "title": "Price analysis 8/25: BTC, ETH, BNB, XRP, ADA, SOL, DOGE, DOT, MATIC, TON",
    "url": "https://cointelegraph.com/news/price-analysis-8-25-btc-eth-bnb-xrp-ada-sol-doge-dot-matic-ton",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/680506fd-48db-4e42-8a94-c29643ea10ab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and altcoins lose more ground after comments from the Federal Reserve suggest that the regime of interest rate hikes could continue into 2024.</p>\n                    <p><p>Federal Reserve Chair Jerome Powell spoke on Aug. 25, and in his Jackson Hole speech, he <a href=\"https://www.cnbc.com/2023/08/24/stock-futures-are-little-changed-as-investors-await-powells-jackson-hole-speech-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-cnbc-com.cdn.ampproject.org/c/s/www.cnbc.com/amp/2023/08/24/stock-futures-are-little-changed-as-investors-await-powells-jackson-hole-speech-live-updates.html\">cautioned</a> that inflation remains too high and that the central bank remains open to raising rates further if needed. The remarks by Powell strengthen the narrative that interest rates are likely to remain higher for longer. </p><p>However, a positive sign is that after a brief sell-off, the United States equities markets recovered from their intraday lows. With the event having passed without any major price movement, traders are back to guessing as to what could move the markets next.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/036d7c4f-b88b-4959-957e-cbf017364a38.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><em>Coin360</em></figcaption></figure><p>Pantera Capital believes that Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price action will continue to follow its previous halving cycles. If that happens, <a href=\"https://cointelegraph.com/news/bitcoin-halving-btc-price-148k-july-2025-pantera-capital\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-halving-btc-price-148k-july-2025-pantera-capital/amp\">Bitcoin could rise to $35,000 by April 2024</a>, when the next halving is expected to occur. After that, Bitcoin could rally sharply and climb to $148,000. </p><p>Will bears maintain their selling pressure and pull the price below the respective supports in Bitcoin and altcoins? Let’s study the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin once again turned down from the overhead resistance at $26,833 on Aug. 23, indicating that the bears continue to sell on rallies. That has kept the price stuck inside the range between $26,833 and $24,800.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/232d4217-4d81-476f-9a03-5b17a283243a.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>A tight consolidation near the support of a range is a bearish sign, as it shows a lack of aggressive buying by the bulls. The downsloping 20-day exponential moving average (EMA) at $27,463 and the relative strength index (RSI) in the oversold territory indicate that bears are in command.</p><p>If the price plummets below $24,800, it could hit the stops of several traders. That may trigger long liquidations, which could plunge the BTC/USDT pair to the pivotal support at $20,000.</p><p>The first sign of strength will be a close above the 20-day EMA. That could open the doors for a possible rally to the 50-day simple moving average (SMA) at $29,055.</p><h2>Ether price analysis</h2><p>The bulls nudged Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) above the overhead resistance of $1,700 on Aug. 23 but could not sustain the higher levels. This shows that the bears are guarding the $1,700 level with vigor. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/16c777ef-260e-4ec6-9c46-7a984d5aab45.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The downsloping moving averages and the RSI in the oversold territory indicate that the bears remain in control. Sellers will try to yank the price below the $1,626 to $1,550 zone. If they manage to do that, the ETH/USDT pair could start a downward move toward $1,368.</p><p>Meanwhile, the bulls are likely to have other plans. They will fiercely defend the support zone and try to propel the price above the 20-day EMA ($1,737). If they succeed, it will suggest that the pair may oscillate inside the large range between $1,626 and $2,000 for a few more days.</p><h2>BNB price analysis</h2><p>BNB’s (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) recovery hit a roadblock at the breakdown level of $220. This suggests that the bears are trying to flip the level into resistance. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7337507d-cdb3-4fe4-ad4b-408ea398be32.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The bears will try to pull the price to the psychological support at $200. This is an important level for the bulls to defend because if it cracks, the BNB/USDT pair could plummet to the next major support at $183.</p><p>If buyers want to prevent the decline, they will have to quickly push the price back above the 20-day EMA ($225). That could start a rally to the resistance line. This level may again attract strong selling by the bears.</p><h2>XRP price analysis</h2><p>XRP’s (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) bounce off the $0.50 support could not even reach the overhead resistance at $0.56, indicating that demand dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d08a54f0-bb3f-4798-bd0f-0cb697ff5598.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The bears will try to strengthen their position by pulling the price below the $0.50 support. If they manage to do that, the XRP/USDT pair could start a downhill slide toward the next major support at $0.41. Buyers are expected to aggressively buy the dips to this level.</p><p>On the upside, the bulls will have to drive the price above the 20-day EMA ($0.56) to indicate that the bears may be losing their grip. That could start a relief rally to the 50-day SMA ($0.63).</p><h2>Cardano price analysis</h2><p>The bulls successfully defended the $0.24 support in Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) but are struggling to overcome the obstacle at $0.28. This suggests that the bears are selling on every minor rally. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8d684e07-8acc-425b-b811-c7ce6b2e27ba.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The bears will try to sink the price to the support of the range at $0.24. A strong bounce off this level will suggest that the ADA/USDT pair may extend its stay inside the $0.24 to $0.28 range for some more time.</p><p>If bears tug the price below $0.24, it will signal the resumption of the downtrend. The pair may first descend to $0.22 and thereafter to $0.20. Alternatively, a break and close above the range could start a recovery to $0.32.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) once again turned down from the breakdown level of $22.30 on Aug. 24, suggesting that the bears have flipped the level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/661ae44e-e4c6-4db9-90e1-78c410118d8a.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The sellers will try to build upon their strength by yanking the price below the immediate support at $19.35. If they can pull it off, the SOL/USDT pair could first slump to $18 and subsequently to $16. The downsloping 20-day EMA ($22.33) and the RSI in the negative territory indicate that bears have the edge.</p><p>If bulls want to make a comeback, they will have to quickly kick the price above the overhead resistance at $22.30. The pair may then rise to the 50-day SMA ($23.67).</p><h2>Dogecoin price analysis</h2><p>The long wick on Dogecoin’s (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) Aug. 23 candlestick shows that the bears have not given up and they continue to sell on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b2d4a800-0bcd-4b50-99e0-dbc6879f88c0.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>If the price skids below the critical support at $0.06, it will suggest that the bears remain in command. The DOGE/USDT pair could then dip to the intraday low of $0.055 made on Aug. 17. If this level crumbles, the pair may retest the long-term support near $0.05.</p><p>Contrarily, if the price rebounds off $0.06, it will suggest solid buying at lower levels. The pair may then rise to the 20-day EMA ($0.07). Buyers will have to overcome this barrier to signal the start of a rally to $0.08.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-xrp-price-down-today\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-is-xrp-price-down-today/amp\"><strong><em>Why is XRP price down today?</em></strong></a></p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) has been trading inside a tight range between $4.22 and $4.56 for the past few days. This shows that the bulls successfully defended the support at $4.22 but failed to break above the resistance at $4.56.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d4864f1c-1b3d-45a2-a2c9-b0efb22ed4f6.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>A minor positive in favor of the bulls is that they have not given up much ground from the overhead resistance. That enhances the prospects of a break above it. The DOT/USDT pair could first rise to the 20-day EMA ($4.68) and eventually rally to the breakdown level of $5. This level is likely to witness strong selling by the bears.</p><p>On the downside, the bulls will have to defend the $4.22 level with all their might because if this support cracks, the pair could start the next leg of the downtrend to $4.</p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) has been gradually drifting lower toward the vital support at $0.51, indicating that the bears have kept up the pressure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/332ec56f-def6-485b-8974-8120b042e54f.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>Although the RSI is in the oversold territory, the bulls have failed to start a rebound. This indicates a lack of demand at the current levels. If the $0.51 level gives way, the selling could intensify and the MATIC/USDT pair could dive to $0.45.</p><p>The critical resistance to watch out for on the upside is $0.60. If buyers clear this roadblock, the recovery could reach the 50-day SMA ($0.68). There is a minor resistance at $0.64, but that is likely to be crossed.</p><h2>Toncoin price analysis</h2><p>Toncoin (TON) has been trying to form a base for the past few days. That has resulted in the formation of an inverse head-and-shoulders pattern, which will complete on a break above $1.53.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/cf1e9042-1098-4b24-a426-f29eb9bc935d.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The 20-day EMA ($1.35) has started to turn up and the RSI is in positive territory, indicating that the bulls are on a comeback. If buyers shove the price above $1.53, the TON/USDT pair could pick up momentum and start a new up move toward the pattern target of $1.91.</p><p>Contrary to this assumption, if the price turns down from the current level, it will indicate that the bears are not willing to relent. That could first pull the price to the moving averages, and if this support breaks, the next stop could be $1.25.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T19:25:00.000Z",
    "title": "Multichain $1.5B hack investigation, Shibarium eyes relaunch, Base, Optimism join hands: Finance Redefined ",
    "url": "https://cointelegraph.com/news/multichain-1-5b-hack-investigation-shibarium-eyes-relaunch-base-optimism-join-hands-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8eb9a48f-bf2d-4501-a055-e75ac195c833.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Top-100 DeFi tokens had another mixed week, with most of the tokens trading in a similar range as last week with minor price fluctuation.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in DeFi saw developers behind Base and Optimism protocols join hands to develop a revenue and governance sharing framework. The $1.5-billion Multichain hack has seen some new evidence — read our detailed investigation to learn about every aspect of the exploit and the plight of the victims thereafter.</p><p>Blockchain security provider Quantstamp introduced a new DeFi tool to detect flash loan attack vulnerabilities in several protocols. Shiba Inu’s Ethereum layer 2, Shibarium, is gearing up for a relaunch after its first public launch was met with FUD, technical errors and more.</p><p>The DeFi market had a mixed week as the total value locked in DeFi protocols remained in the same range as last week but saw a minor dip of about $70 million.</p><h2>Base, Optimism unveil shared governance and revenue-sharing framework</h2><p>Developers behind the Base and Optimism networks have jointly announced a revenue-sharing and governance-sharing agreement. Coinbase, the parent company of Base, has also published a list of “principles of neutrality” it will follow to prevent Base from becoming centralized. </p><p>This announcement was made through three separate blog posts on Aug. 24: one from the jointly controlled Optimism Collective, one from Base and one from Coinbase.</p><p><a href=\"https://cointelegraph.com/news/base-optimism-unveil-shared-governance-revenue-sharing-framework\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/base-optimism-unveil-shared-governance-revenue-sharing-framework/amp\"><strong>Continue reading</strong></a></p><h2>Multichain victims search for answers in $1.5B exploit as new evidence emerges</h2><p>On July 14, developers of the $1.5-billion Chinese cross-chain protocol Multichain confirmed users’ worst fears. The protocol’s CEO, identified only as “Zhaojun He,” was arrested by Chinese authorities in Kunming on May 21 after months of repeated denials on official communication channels. Also allegedly arrested was Multichain’s core team, which was operating in Shanghai. </p><p>It was never disclosed why Zhaojun had been arrested or what the charges were. However, evidence suggests that Multichain funds may have been seized as part of an anti-money laundering operation in the context of a greater crackdown on crypto by Chinese authorities. In addition, an alleged fake ID used by the CEO to register Multichain’s operations only draws more questions. </p><p><a href=\"https://cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges/amp\"><strong>Continue reading</strong></a></p><h2>Quantstamp introduces tool to detect protocols’ flash loan attack vulnerability</h2><p>Blockchain security provider Quantstamp has launched an automated service to detect flash loan attack vectors in smart contracts. The new service is being called Economic Exploit Analysis and is based on research done at the University of Toronto.</p><p>Economic Exploit Analysis will be available to protocols, whether they have been deployed or not. It will enhance Quantstamp’s audits by identifying flash loan attack vulnerabilities in a client’s code. The service will be available on any Ethereum Virtual Machine (EVM)-compatible blockchain and is non-exhaustive — that is, it may not detect all attacks.</p><p><a href=\"https://cointelegraph.com/news/quantstamp-introduces-tool-detect-protocol-flash-loan-attack-vulnerability\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/quantstamp-introduces-tool-detect-protocol-flash-loan-attack-vulnerability/amp\"><strong>Continue reading</strong></a></p><h2>Shiba Inu hints at making Shibarium public soon</h2><p>Progress is underway in the field of blockchain technology, with the highly anticipated public launch of the Shibarium L2 happening soon. The Shiba Inu team has announced that the platform is running smoothly and just needs to be made public. </p><p>The team behind Shibarium, an Ethereum L2 network, has indicated that the platform is currently live and in private mode, having functioned smoothly during its two-day test, and is on the verge of becoming available to the public.</p><p><a href=\"https://cointelegraph.com/news/shibarium-shiba-inu-hints-at-making-shibarium-public-soon\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/shibarium-shiba-inu-hints-at-making-shibarium-public-soon/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Despite the late market turmoil, DeFi’s total value locked in DeFi protocols saw a bullish surge in the past week. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week; however, the late Thursday dip washed away the gains, leaving most tokens trading in the red on the weekly charts. The total value locked into DeFi protocols touched $49.1 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b76855a5-3fa6-4985-8532-688b47fd1a4a.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T19:01:01.000Z",
    "title": "Binance P2P removes sanctioned Russian banks from payments list",
    "url": "https://cointelegraph.com/news/binance-p2p-removes-sanctioned-russian-banks-from-payments-list",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6c19452c-c00f-49a7-a9b4-62b69facd617.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto exchange removed its “yellow” and “green” codewords from its list of payment methods, which previously referred to sanctioned Russian banks.</p>\n                    <p><p>Crypto exchange Binance has removed “yellow” and “green” payment options from its peer-to-peer (P2P) service after being criticized for using these code words to represent sanctioned Russian banks, Cointelegraph confirmed on Aug. 25.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/40948984-f52c-426c-9a6f-48f174ac15cd.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Payment method searches for color-themed code words result in no hits. Source: Binance</em></figcaption></figure><p>Binance’s peer-to-peer exchange service is a message board allowing users to offer to buy or sell cryptocurrency. It also functions as a crypto escrow service. However, unlike Binance’s main exchange platform, it leaves fiat payments to be handled by users, and no fiat money passes through Binance’s servers.</p><p>On Aug. 22, The Wall Street Journal reported that Binance was <a href=\"https://www.wsj.com/finance/binance-cryptocurrency-russia-sanctions-ddb948c3\" target=\"_blank\" rel=\"noopener nofollow\">listing</a> sanctioned Russian banks such as Tinkoff and Rosbank as transfer methods. This led to criticism that Binance may be violating sanctions by endorsing these banks as payment methods.</p><p>On Aug. 24, multiple Russian news outlets began reporting that Binance had eliminated these banks from its list of payment methods. However, these banks <a href=\"https://cointelegraph.com/news/binance-dubs-barred-russian-banks-on-its-platform-as-yellow-and-green-cards\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-dubs-barred-russian-banks-on-its-platform-as-yellow-and-green-cards/amp\">had reappeared as code words</a> “yellow” and “green,” with “yellow” representing sanctioned bank Tinkoff and “green” representing sanctioned bank Rosbank.</p><p>On Aug. 25, The Wall Street Journal <a href=\"https://www.wsj.com/finance/currencies/binance-drops-sanctioned-russian-banks-from-peer-to-peer-service-fef93a1d\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the sanctioned banks were removed from the list. The report quoted a Binance spokesperson indicating that the banks were removed after the exchange learned that account holders were using the service to circumvent sanctions. “We regularly update our systems to ensure compliance with local and global regulatory standards,” the spokesperson reportedly said. “When gaps are pointed out to us, we seek to address and remediate them as soon as possible.”</p><p>On the same day, Cointelegraph confirmed that the “yellow” and “green” payment methods were removed. Sixteen payment methods are still available for Russian ruble conversions to crypto, including Raiffeisenbank, Russian Standard Bank, Payeer, AdvCash and others. But Tinkoff and Rosbank are no longer on the list, nor are their code word equivalents.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/russia-cbdc-digital-ruble-trials-banks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/russia-cbdc-digital-ruble-trials-banks/amp\"><strong>Russia to begin CBDC trials with 13 banks</strong></a></em></p><p>Despite their official removal, Cointelegraph found that Binance P2P users are still advertising sales with “the green bank” as their payment method. These users list other methods of payment, such as Russian Standard Bank or Ak Bars Bank, in the “payment method” field but then state explicitly within the “advertiser’s terms” that they will only accept transfers using “the green bank.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2dafbc63-8cc3-4923-adbc-a17c9b670305.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>User posting a Binance P2P sale demanding payments to \"only green bank.\" Source: Binance</em></figcaption></figure><p>In this way, users have been able to continue using Binance P2P to sell cryptocurrency through sanctioned payment methods.</p><p>Peer-to-peer crypto marketplaces have been controversial since their inception. Supporters argue these marketplaces are necessary to prevent government payment censorship, while detractors say they are used by criminals to move illicit funds. </p><p>Before 2023, one of the most popular peer-to-peer marketplaces was LocalBitcoins. However, it <a href=\"https://cointelegraph.com/news/localbitcoins-closes-down-the-p2p-crypto-exchange-service\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/localbitcoins-closes-down-the-p2p-crypto-exchange-service/amp\">was shut down</a> earlier this year, and some users moved to Binance P2P in response. </p><p>Paxful co-founder Ray Youssef argued on Aug. 25 that P2P marketplaces are still too centralized and too vulnerable to shutdown by governments. He is working on a new marketplace called “Civ Kit” that he <a href=\"https://cointelegraph.com/news/p2p-marketplaces-need-to-be-unstoppable-permissionless-paxful-co-founder\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/p2p-marketplaces-need-to-be-unstoppable-permissionless-paxful-co-founder/amp\">claims will be much more difficult</a> for governments to shut down.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T17:45:00.000Z",
    "title": "Judge denies stakeholders’ request for representation in Celsius bankruptcy case",
    "url": "https://cointelegraph.com/news/judge-denies-stakeholders-request-for-representation-in-celsius-bankruptcy-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4a438c13-3d58-4ea8-a038-f17aed251021.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The judge also declined to declare the CEL token “not a security,” despite related rulings in the SEC v. Ripple case. </p>\n                    <p><p>Judge Martin Glenn shot down efforts to have a special shareholders class declared in the Celsius Network bankruptcy case in a court document <a href=\"https://cases.stretto.com/public/x191/11749/PLEADINGS/1174908252380000000045.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on Aug. 25. The judge also declined to settle whether or not the Celsius (<a href=\"https://cointelegraph.com/celsius-cel-price-index\">CEL</a>) token was a security. </p><p>In a motion <a href=\"https://cases.stretto.com/public/x191/11749/PLEADINGS/1174907252380000000097.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on July 25 and heard before the United States Bankruptcy Court for the Southern District of New York on Aug. 14, investor Otis Davis asked the court to create a legal class for investors to be considered separate from Celsius Network employees and customers.</p><p>Davis also requested that the court sanction the legal team representing the Unsecured Creditors Committee (UCC) over the alleged failure to disclose required information.</p><p>The filing further asked the court to declare CEL “not a security” in light of the recent findings in the U.S. Securities and Exchange Commission (SEC) v. Ripple case, where, according to Davis, Judge Analisa Torres determined that XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) was not a security. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\"><strong><em>Breaking: Judge rules XRP is not a security in SEC's case against Ripple</em></strong></a></p><p>It’s worth mentioning that, in the XRP case, Torres ruled that XRP was not a security in regard to programmatic sales on digital asset exchanges. In the same ruling, however, Torres said that XRP was a security when sold to institutional investors.</p><p>In the Celsius bankruptcy case, Glenn’s response was relatively swift, denying all three motions set forth just 11 days after the motion was argued in an Aug. 14 hearing. </p><p>Glenn shot down all of the motion’s requests and further added:</p><blockquote>“[N]othing in the Motions, this Order, or announced at the Hearing constitutes a finding under the federal securities laws as to whether crypto tokens or transactions involving crypto tokens are securities, and the right of the United States Securities and Exchange Commission and the Committee to challenge transactions involving crypto tokens on any basis is expressly reserved.”</blockquote><p>As Cointelegraph reported, <a href=\"https://cointelegraph.com/news/breaking-celsius-is-reportedly-filing-for-bankruptcy-imminently\">the Celsius Network bankruptcy</a> occurred on July 14, 2022. Just a year later, the company’s former CEO, Alex Mashinsky, was <a href=\"https://cointelegraph.com/news/celsius-ceo-alex-mashinsky-arrested\">arrested and charged with fraud</a>. </p><p>In the time since, Celsius has agreed to numerous settlements meant to provide relief to customers and investor groups, with <a href=\"https://cointelegraph.com/news/celsius-customers-vote-settlement-plan-with-fahrenheit-after-judge-gives-okay\">the latest round set for a hearing in October</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yesterday, the Court approved the Disclosure Statement, allowing us to begin the process of soliciting votes on the Plan. You can read our official announcement here: <a href=\"https://t.co/8Kzq2HfH04\">https://t.co/8Kzq2HfH04</a></p>&mdash; Celsius (@CelsiusNetwork) <a href=\"https://twitter.com/CelsiusNetwork/status/1692550990824603657?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T20:50:28.000Z",
    "title": "Binance removes five sanctioned Russian banks from P2P trading: WSJ",
    "url": "https://cryptoslate.com/binance-removes-five-sanctioned-russian-banks-from-p2p-trading-wsj/",
    "description": "<p>Binance has removed several sanctioned Russian banks from its peer-to-peer (P2P) trading service, The Wall Street Journal reported on Aug. 25. The news outlet cited a quote from Binance, which stated: &#8220;We regularly update our systems to ensure compliance with local and global regulatory standards. When gaps are pointed out to us, we seek to address [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-removes-five-sanctioned-russian-banks-from-p2p-trading-wsj/\">Binance removes five sanctioned Russian banks from P2P trading: WSJ</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T19:20:24.000Z",
    "title": "Rep. Patrick McHenry calls proposed crypto tax rules an ‘attack on the digital asset ecosystem’",
    "url": "https://cryptoslate.com/rep-patrick-mchenry-calls-proposed-crypto-tax-rules-an-attack-on-the-digital-asset-ecosystem/",
    "description": "<p>Patrick McHenry, Chairman of the House Financial Services Committee, commented on newly proposed crypto taxation rules on Aug. 25. The IRS, along with the U.S. Treasury, proposed those taxation rules earlier in the day. The new rules would broadly require crypto brokers to report the same tax information that brokers for securities and other financial [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/rep-patrick-mchenry-calls-proposed-crypto-tax-rules-an-attack-on-the-digital-asset-ecosystem/\">Rep. Patrick McHenry calls proposed crypto tax rules an &#8216;attack on the digital asset ecosystem&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T19:00:26.000Z",
    "title": "Record surge in Bank Term Funding Program hints at underlying instability in U.S. Treasuries",
    "url": "https://cryptoslate.com/insights/record-surge-in-bank-term-funding-program-hints-at-underlying-instability-in-u-s-treasuries/",
    "description": "<p>Quick Take Based on the data analysis from analyst Joe Consorti, the Bank Term Funding Program (BTFP) has surged to a record $107.39 billion. This significant increase in the BTFP, a program instituted following the collapse of Silicon Valley Bank in March 2023, underscores the critical financial environment that led to the creation of this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/record-surge-in-bank-term-funding-program-hints-at-underlying-instability-in-u-s-treasuries/\">Record surge in Bank Term Funding Program hints at underlying instability in U.S. Treasuries</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T18:01:19.000Z",
    "title": "Fed Chair Jerome Powell discusses target interest and inflation rates at Jackson Hole summit",
    "url": "https://cryptoslate.com/fed-chair-jerome-powell-discusses-target-interest-and-inflation-rates-at-jackson-hole-summit/",
    "description": "<p>The robust growth of the U.S. economy may necessitate additional interest rate increases to mitigate inflationary pressures, according to Federal Reserve Chair Jerome Powell. Speaking at the Jackson Hole Economic Symposium, an annual conference of central bankers in Jackson Hole, Wyo., Powell outlined the uncertainties surrounding the economic outlook while indicating the possible need for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fed-chair-jerome-powell-discusses-target-interest-and-inflation-rates-at-jackson-hole-summit/\">Fed Chair Jerome Powell discusses target interest and inflation rates at Jackson Hole summit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-25T19:39:38.000Z",
    "title": "DEA Duped by Common Crypto Scam, Sends $55K to Wrong Address",
    "url": "https://cryptobriefing.com/dea-duped-by-common-crypto-scam-sends-55k-to-wrong-address/?utm_source=feed&utm_medium=rss",
    "description": "The DEA fell prey to an address poisoning scam, leading them to transfer $55,000 to scammers."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T20:30:18.000Z",
    "title": "Polymarket Wagers Favor Trump for Nomination; Ramaswamy’s Bid Gains Momentum",
    "url": "https://news.bitcoin.com/polymarket-wagers-favor-trump-for-nomination-ramaswamys-bid-gains-momentum/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Polymarket Wagers Favor Trump for Nomination; Ramaswamy&#039;s Bid Gains Momentum\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/toot666d8.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the initial Republican debate and an exclusive interview between Donald Trump and Tucker Carlson on the social media platform X, wagers on the decentralized prediction marketplace Polymarket suggest Trump is leading, with presidential hopeful Vivek Ramaswamy trailing the former president. Trump Leads in Both Decentralized, Traditional Prediction Markets Fox hosted the first Republican debate [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T18:30:33.000Z",
    "title": "Powell: More Rate Hikes May Be Needed to Curb Inflation",
    "url": "https://news.bitcoin.com/powell-more-rate-hikes-may-be-needed-to-curb-inflation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Powell: More Rate Hikes May Be Needed to Curb Inflation\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/powssslld.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The chairman of the U.S. Federal Reserve, Jerome Powell, warned on Friday that inflation remains too high and signaled the central bank may continue raising interest rates to get it under control. In remarks at the Jackson Hole symposium, Powell acknowledged recent progress in lowering inflation but said there’s &#8220;substantial further ground to cover&#8221; before [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T20:43:02.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T20:27:09.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T20:04:10.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T19:50:39.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T19:35:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T19:21:00.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T18:57:10.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T18:50:22.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T18:43:55.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T18:43:47.000Z",
    "title": "NEO Price Prediction 2023-2032: Is it Good to Invest in NEO now?",
    "url": "https://www.cryptopolitan.com/neo-price-prediction/",
    "description": "NEO Price Prediction 2023-2032 In the crypto market, new projects appear every day. On average, only one project out of ten becomes a complete working ecosystem, and only a few of those have an application to the problems of the modern world. One successful start-up is NEO, open-source crypto with the extended functionality to develop ... <a title=\"NEO Price Prediction 2023-2032: Is it Good to Invest in NEO now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/neo-price-prediction/\" aria-label=\"More on NEO Price Prediction 2023-2032: Is it Good to Invest in NEO now?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T19:34:25.000Z",
    "title": "JPMorgan Shares Prediction On Bitcoin’s Next Move: What You Need To Know",
    "url": "https://www.newsbtc.com/bitcoin-news/jpmorgan-shares-prediction-on-bitcoin-next-move/",
    "description": "In the latest research report, financial giant JPMorgan Chase &#38; Co. has recently shared its belief in Bitcoin and the crypto market. Bloomberg reported, citing data from the financial services firm, that the current downtrend phase in the crypto market might just be nearing its conclusion. Notably, the deceleration in the market momentum, primarily attributed to a series of positive legal and regulatory developments that eventually lost steam, is in its last stretch, according to the banking institution. Related Reading: Bitcoin Price Prediction for 2023, 2024, 2025, 2030 and Beyond Market Dynamics And Future Predictions JPMorgan&#8217;s analyst, Nikolaos Panigirtzoglou, analyzed the situation and highlighted the diminishing open interest in the Chicago Mercantile Exchange (CME) Bitcoin futures contracts. In the financial realm, when open interest, which reflects the cumulative unsettled and active futures contracts on exchanges, plunges, it often signals a weakening price trend. Consequently, the report suggests, “We see limited downside for crypto markets over the near term.” The crypto domain witnessed an uplift in recent months. This surge can be attributed to multiple applications, led predominantly by BlackRock Inc., aiming to roll out the first US spot BTC exchange-traded funds. A favorable courtroom verdict for Ripple Labs in its legal confrontation with the Securities and Exchange Commission (SEC) also contributed to the further uplift in the market sentiment. However, the initial exuberance has been waning, according to the report. Market participants are now in anticipation mode, awaiting resolve on spot Bitcoin ETF approvals. Meanwhile, the US Securities and Exchange Commission&#8217;s (SEC) impending appeal against the Ripple decision, which is yet to be disclosed, amplifies a &#8220;new round of legal uncertainty,&#8221; heightening the market&#8217;s responsiveness to subsequent legal developments, according to the report. Bitcoin (BTC) Latest Price Action So far, Bitcoin is still struggling to break above a notable resistance. The asset has ranged between the $25,000 and $26,000 zone in the past 7 days and currently trades for $25,890, at the time of writing. Bitcoin has seen a decline of more than 10% in the past two weeks, and it is currently in red, down by nearly 1% over the past 24 hours. Alongside its price, Bitcoin&#8217;s daily trading volume has also plunged in the past week, indicating less trading activity. The asset&#8217;s daily trading volume has fallen from a high of over $30 billion recorded last Friday to $12.1 billion in the previous 24 hours. Related Reading: Powell Speaks At Jackson Hole, Bitcoin Volatility Comes Back With A Vengeance? Notably, the recent pullback in crypto isn&#8217;t isolated. It mirrors a larger recalibration across risk assets, like equities. According to JPMorgan&#8217;s report: &#8220;Frothy positioning in tech, elevated US real yields, and apprehensions regarding China&#8217;s economic trajectory,&#8221; were key contributing factors. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T17:58:59.000Z",
    "title": "Economic Reset Alert: Bloomberg Analyst Predicts Bitcoin Crash Below $10,000",
    "url": "https://www.newsbtc.com/bitcoin-news/economic-reset-alert-bloomberg-analyst-predicts-bitcoin-crash-below-10000/",
    "description": "Bitcoin (BTC), the world&#8217;s largest cryptocurrency, has experienced a period of stability around the $26,000 mark following the recent speech by Federal Reserve Chair Jerome Powell.  Powell reiterated the central bank&#8217;s commitment to maintaining a 2% inflation target in his speech. As economists discuss the implications of this goal, market observers, including Bloomberg&#8217;s Senior Macro Strategist Mike McGlone, have weighed in on the potential impact of an impending recession on BTC’s price. Bitcoin Faces Bearish Outlook? During his speech, Chair Powell stressed the importance of implementing a &#8220;sufficiently restrictive&#8221; policy to address inflation-related concerns. While economists continue to debate the merits of this approach, Powell&#8217;s emphasis on controlling inflation has sparked speculation within the financial landscape. Related Reading: Shiba Inu Whale Buys 708 Billion SHIB, Sparks Speculation Of Price Recovery Mike McGlone, a respected senior macro strategist at Bloomberg, remains bullish on Bitcoin, often called &#8220;digital gold.&#8221; However, McGlone predicts a potential decline in Bitcoin&#8217;s price, stating that a &#8220;normal reversion&#8221; during an economic recession could see Bitcoin trading at around $10,000, or even as low as $7,500.  McGlone acknowledges Bitcoin&#8217;s volatility but highlights its historical performance as an asset class, even in the face of a significant drop. Furthermore, McGlone points out that Bitcoin&#8217;s 100-week moving average (MA) is currently trending downward, indicating a negative market trend. The recent decline from its 2022 and 2023 bottom further supports this observation.  Additionally, Powell&#8217;s mention of ongoing Federal Reserve interest rate hikes adds to the concerns surrounding Bitcoin&#8217;s macro outlook. Nevertheless, comparing Bitcoin to the stock market in 1921 and 1929, he views the cryptocurrency as a revolutionary technology with the potential for long-term growth. In addition to concerns surrounding Bitcoin&#8217;s short-term growth, the U.S. Dollar Index (DXY) has been trending upward, thereby losing its previous correlation with BTC, which raises concerns for the leading cryptocurrency in the market. As reported by NewsBTC, the DXY is approaching significant resistance levels in the near term. However, it is worth noting that favorable conditions, increased trading volume, and renewed liquidity entering the emerging cryptocurrency industry could potentially provide an opportunity for BTC to recover and reach higher price levels. Currently, the DXY is trading at 104.169 points and is approaching two crucial resistance lines. The first resistance lies at the 104.716 mark, and the second is at the 106 level. These levels have not been surpassed since May and March, respectively. Related Reading: PEPE Token Tumbles 20% Amid Suspicious Activity – Details Nevertheless, if the DXY surpasses these resistance levels, it could propel the index to even higher levels, possibly reaching 112 points. Such a scenario could pressure BTC and disrupt its ongoing bullish trend, especially if favorable conditions and a positive correlation between the two assets are absent. Bitcoin is being traded at $25,900, showing a minor decrease of 0.7% within the last 24 hours. However, Bitcoin bulls must reclaim the $26,000 threshold to prevent potential downward movement and further declines as the market approaches the conclusion of a new monthly closing period. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T19:03:20.000Z",
    "title": "Ripple’s Legal Battle: SEC Attorneys Step Down, New Lawyers Enter the Arena",
    "url": "https://www.crypto-news-flash.com/ripples-legal-battle-sec-attorneys-step-down-new-lawyers-enter-the-arena/",
    "description": "<img width=\"1280\" height=\"783\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-300x184.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-1024x626.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-768x470.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The US SEC has been seeing an exodus of its lawyers in its case with Ripple Labs. The exit has been given many interpretations by the XRP community. In a new turn of events, three lawyers identified as Pascale Guerrier, Richard Best, and Robert MacDonald Moye representing the United States Securities and Exchange Commission (SEC) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T18:30:34.000Z",
    "title": "Pepe Token Dives 15% Amid Concerns Over Unusual Transactions and ‘Rug Pull’ Fears",
    "url": "https://www.crypto-news-flash.com/pepe-token-dives-15-amid-concerns-over-unusual-transactions-and-rug-pull-fears/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"As of Tuesday, Pepe 2.0, which appears to be the most favored among the imitations, witnessed a trading volume of nearly $7 million in the last 24 hours.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Pepe (PEPE) token developers sent nearly $18 million worth of the meme coins to different exchanges raising selling or rug pull pressure. Despite the notable drop, some crypto analysts argue it could be a good buy for Pepe as the price is currently sitting on a strong support level. The third largest meme coin, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T18:00:32.000Z",
    "title": "Bitcoin Spark: The Cryptocurrency Revolution Surpassing Bitcoin and Dogecoin",
    "url": "https://www.crypto-news-flash.com/bitcoin-spark-the-cryptocurrency-revolution-surpassing-bitcoin-and-dogecoin/",
    "description": "<img width=\"446\" height=\"250\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/88.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/88.png 446w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/88-300x168.png 300w\" sizes=\"(max-width: 446px) 100vw, 446px\" />A new project, Bitcoin Spark, has ignited a wave in the crypto arena, surpassing the giants of the digital currency world, Bitcoin and Dogecoin. Bitcoin Spark presents itself as more than a cryptocurrency through its decentralization approach, likely to reshape the future digital world. Bitcoin Spark (BTCS) Bitcoin Spark forked out of Bitcoin when BTC [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T20:00:26.000Z",
    "title": "BRICS Member India Ditches US Dollar, Purchases 1,000,000,000 Barrels of Oil With Rupees for First Time Ever: Report",
    "url": "https://dailyhodl.com/2023/08/25/brics-member-india-ditches-us-dollar-purchases-1000000000-barrels-of-oil-with-rupees-for-first-time-ever-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Altcoins-To-Plunge-Lower-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BRICS member India has reportedly purchased oil from the United Arab Emirates using its national currency for the first time ever. In July, reports surfaced that India and the UAE have inked an agreement that allowed the BRICS member to use rupees instead of the US dollar when trading with the Middle Eastern nation. Last [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/brics-member-india-ditches-us-dollar-purchases-1000000000-barrels-of-oil-with-rupees-for-first-time-ever-report/\">BRICS Member India Ditches US Dollar, Purchases 1,000,000,000 Barrels of Oil With Rupees for First Time Ever: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T19:55:52.000Z",
    "title": "Trader Reiterates Warning on Altcoins As Dogecoin Rival Crashes Over 25% in Hours, Updates Outlook on Bitcoin",
    "url": "https://dailyhodl.com/2023/08/25/trader-reiterates-warning-on-altcoins-as-dogecoin-rival-crashes-over-25-in-hours-updates-outlook-on-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Dogecoin-shiba-in-rival-elon.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is issuing another dire warning about altcoins as one Dogecoin (DOGE) rival abruptly plummets. Pseudonymous analyst Credible Crypto tells his 346,000 followers on the social media platform X that Pepe collapsed against Bitcoin (BTC) in just days and other altcoins may soon see similar price action. &#8220;PEPE leading the way [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/trader-reiterates-warning-on-altcoins-as-dogecoin-rival-crashes-over-25-in-hours-updates-outlook-on-bitcoin/\">Trader Reiterates Warning on Altcoins As Dogecoin Rival Crashes Over 25% in Hours, Updates Outlook on Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T19:55:18.000Z",
    "title": "Shiba Inu Ecosystem Altcoin Bounces As Shibarium Recovers From Technical Issues",
    "url": "https://dailyhodl.com/2023/08/25/shiba-inu-ecosystem-altcoin-defies-crypto-market-doldrums-as-shibarium-continues-to-recover-from-technical-issues/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/shiba-market-issues-recover.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Shiba Inu (SHIB) ecosystem altcoin ignored the wider crypto market downtick and surged by nearly 15% on Thursday. Bone ShibaSwap (BONE) is trading at $1.41 at time of writing, up from $1.23 a day ago. The 104th-ranked crypto asset by market cap is also up nearly 26% in the past week. BONE is used [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/shiba-inu-ecosystem-altcoin-defies-crypto-market-doldrums-as-shibarium-continues-to-recover-from-technical-issues/\">Shiba Inu Ecosystem Altcoin Bounces As Shibarium Recovers From Technical Issues</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T18:45:31.000Z",
    "title": "Binance Discontinues Mastercard-Backed Crypto Card in Latin America and Middle East As Legal Challenges Mount",
    "url": "https://dailyhodl.com/2023/08/25/binance-discontinues-mastercard-backed-crypto-card-in-latin-america-and-middle-east-as-legal-challenges-mount/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/binance-discontinues-backed-latin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world’s largest crypto exchange is terminating its crypto card services in Latin America and the Middle East. In January, crypto titan Binance and payments giant Mastercard teamed up to launch Binance Card, which enabled users to fund their purchases and bill payments using their crypto assets. In a statement issued on Tuesday, the exchange [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/binance-discontinues-mastercard-backed-crypto-card-in-latin-america-and-middle-east-as-legal-challenges-mount/\">Binance Discontinues Mastercard-Backed Crypto Card in Latin America and Middle East As Legal Challenges Mount</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T18:41:42.000Z",
    "title": "Shiba Inu (SHIB) Layer-2 Protocol Shibarium Relaunch Reaches 50,000 Wallets, Spurs BONE Rally",
    "url": "https://dailyhodl.com/2023/08/25/shiba-inu-shib-layer-2-protocol-shibarium-relaunch-reaches-50000-wallets-spurs-bone-rally/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/shib-army-bone.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The relaunch of memecoin Shiba Inu’s (SHIB) layer-2 scaling solution Shibarium has reached over 50,000 wallets, sparking a rally for Bone ShibaSwap (BONE), the token associated with paying the protocol&#8217;s gas fees. Shibarium, which launched earlier this month, experienced technical difficulties last week associated with the rush of new users and transactions taking place over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/shiba-inu-shib-layer-2-protocol-shibarium-relaunch-reaches-50000-wallets-spurs-bone-rally/\">Shiba Inu (SHIB) Layer-2 Protocol Shibarium Relaunch Reaches 50,000 Wallets, Spurs BONE Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T18:05:46.000Z",
    "title": "Crypto Analyst Unpacks Important Question for Bitcoin Traders – Could BTC Drop to $22,000 Next Month?",
    "url": "https://dailyhodl.com/2023/08/25/crypto-analyst-unpacks-important-question-for-bitcoin-traders-could-btc-drop-to-22000-next-month/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/BTC-Could-Crash-to-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is diving deep into Bitcoin&#8217;s (BTC) latest market tumble, trying to discern just how low it can go. In a post shared with his 350,200 followers on the social media platform X, pseudonymous crypto trader Rekt Capital attempts to answer a simple question – could BTC hit $22,000 in September? &#8220;Could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/crypto-analyst-unpacks-important-question-for-bitcoin-traders-could-btc-drop-to-22000-next-month/\">Crypto Analyst Unpacks Important Question for Bitcoin Traders – Could BTC Drop to $22,000 Next Month?</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]