[
  {
    "source": "Cointelegraph",
    "date": "2024-04-09T02:04:30.000Z",
    "title": " Solana devs target April 15 for failed TX fix — it’s ‘not a design flaw’ ",
    "url": "https://cointelegraph.com/news/solana-devs-target-mid-april-to-fix-failed-transaction-dilemma",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvZWJmYmFjNTctOTBmZS00NDdkLTkyZDYtNjIxMTIwNTk5Njc1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Solana’s percentage of failed non-vote transactions went over 75% last week, and developers are now targeting a fix to be implemented on April 15.</p>\n                    <p><p>Solana developers are targeting April 15 to implement a fix for an “implementation bug\" that recently caused the transaction failure rate on Solana to skyrocket.</p><p>“Solana’s current issue is not a design flaw, it’s an implementation bug,” stressed Mert Mumtaz, the CEO of Helius Labs, a blockchain infrastructure firm that provides back-end support exclusively to the Solana network.</p><p>“It is important to make this distinction because implementation errors are usually trivial [while] design errors are generally serious and more fundamental,” Mumtaz <a href=\"https://x.com/0xMert_/status/1777400489488900102\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> to his 108,000 X followers on April 8.</p><p><a href=\"https://cointelegraph.com/news/solana-devs-target-mid-april-to-fix-failed-transaction-dilemma\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-09T01:51:34.000Z",
    "title": "Ethereum Price Prediction 2024-2033: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2024-2033 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-09T02:00:56.000Z",
    "title": "Bitcoin 40% Of Way Through Bull Run If This Metric Is To Go By",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-40-way-through-bull-run-metric/",
    "description": "A pattern in the holdings of the Bitcoin long-term holders may suggest that the current bull run is 40% of the way to completion. Bitcoin Long-Term Holders Have Been Distributing Recently In a new post on X, Glassnode lead analyst Checkmate discussed the recent behavior of the long-term Bitcoin holders. The &#8220;long-term holders&#8221; (LTHs) here refer to the BTC investors who have been holding onto their coins for over six months. Statistically, the longer an investor holds onto their coins, the less likely they become to sell them at any point. Since the LTHs hold for significant periods, they are considered quite resolute. Related Reading: Dogecoin Whale Takes $52.3 Million In DOGE Off Binance, Sign Of Buying? And indeed, they display this resilience in their behavior, rarely selling despite whatever is happening in the broader market. As such, the times they sell are all the more noteworthy. Historically, the LTHs have taken to distribution during bull runs when the asset has broken its previous all-time high (ATH) price. Due to their long holding times, these investors amass large profits, which they start to spend when a high amount of demand comes in during bull rallies that happily take coins off their hands at high prices. Checkmate explained that the recent ATH break of the cryptocurrency has looked similar to any other past one, with the LTHs already having started spending for this round. The chart below shows the trend in the supply of Bitcoin LTHs over the past few years. The value of the metric seems to have been going down in recent weeks &#124; Source: @_Checkmatey_ on X As displayed in the above graph, the Bitcoin LTHs have recently observed their supply heading down. Remember that when it comes to increases in this metric, there is a delay associated with when buying is happening and when this supply is going up. This is natural because the newly bought coins must age for six months before they can be considered a part of the cohort&#8217;s holdings. When it comes to drawdowns, though, the same delay doesn&#8217;t emerge, as the age of the coins instantly resets back to zero, and they exit the group. Thus, the latest distribution from the LTHs is indeed happening. &#8220;In the prior two cycles, new demand for Bitcoin was able to absorb this LTH sell-side for around 6-8 months while pushing prices multiples higher,&#8221; explains the Glassnode lead. Related Reading: Polygon (MATIC) In Buy Zone That Earlier Led To 112% &#38; 87% Surges The chart below shows that the LTH supply has typically gone through a drawdown of around 14% during these bull run selloffs. The data for the drawdown in the LTH supply over the various cycles &#124; Source: @_Checkmatey_ on X Checkmate notes that, based on this historical average drawdown in the LTH supply, the current Bitcoin cycle would be around 40% completion for this process. BTC Price Bitcoin has surged during the past 24 hours as its price has now returned to $71,800. Looks like the price of the asset has been going up over the last few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, Glassnode.com, checkonchain.com, chart from TradingView.com"
  }
]