[
  {
    "source": "CoinDesk",
    "date": "2024-01-29T14:30:00.000Z",
    "title": "OKX Starts Inscription Support Atomicals, Stamps, Runes and Doginals",
    "url": "https://www.coindesk.com/tech/2024/01/29/okx-starts-inscription-support-atomicals-stamps-runes-and-doginals/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "OKX says wallet support is coming first, with a marketplace to follow"
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-29T14:30:00.000Z",
    "title": " ‘No such thing as spam’ — OKX exec on Bitcoin Ordinals ",
    "url": "https://cointelegraph.com/news/okx-nft-bitcoin-ordinals-not-spam-atomicals-runes-doginals-stamps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTdlNGZkYzYtMmY3Mi00ZDU3LTk3NmItZWIxODE4NDA4Nzg5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>OKX chief innovation officer Jason Lau argued that in open and permissionless networks like Bitcoin, all transactions are valid as long as they pay fees and conform to consensus. </p>\n                    <p><p data-ct-non-breakable=\"true\">While some consider the Ordinals protocol a <a href=\"https://cointelegraph.com/news/trump-cashes-out-ethereum-ordinals-debate-elon-musk-inscription\">nuisance to Bitcoin</a>, others double down on its bet on the place of nonfungible tokens (NFTs) in the Bitcoin ecosystem. </p><p>On Dec. 18, OKX’s NFT marketplace <a href=\"https://cointelegraph.com/news/okx-nft-trading-volume-opensea-magiceden-blur\">surpassed its competitors</a> in daily trading volume as traders became more interested in Bitcoin-based NFTs. Doubling down on the move to support Bitcoin NFTs, the company announced on Jan. 29 that it will add Atomicals and Runes to its marketplace. In addition, it will also add Dogecoin’s Doginals, venturing into supporting Ordinals in other chains.</p><p>Apart from its marketplace, OKX also announced that it would support the token standards from Atomicals, Stamps, Runes and Doginals on its Web3 Wallet.</p><p><a href=\"https://cointelegraph.com/news/okx-nft-bitcoin-ordinals-not-spam-atomicals-runes-doginals-stamps\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-29T14:30:36.000Z",
    "title": "The pivotal role of stablecoins in Bitcoin’s recent surge",
    "url": "https://cryptoslate.com/insights/the-pivotal-role-of-stablecoins-in-bitcoins-recent-surge/",
    "description": "<p>Quick Take Over the past three months, there has been a significant rise in the aggregate market cap of the top five stablecoins: USDT, USDC, BUSD, DAI, and TUSD. This value has jumped by a remarkable 10 billion from its previous low of 119 billion in October 2023, in addition to a 3.2% increase in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/the-pivotal-role-of-stablecoins-in-bitcoins-recent-surge/\">The pivotal role of stablecoins in Bitcoin&#8217;s recent surge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-29T14:30:57.000Z",
    "title": "Ethereum Technical Analysis: ETH Trade Volume Remains Low Amid Selling Pressure",
    "url": "https://news.bitcoin.com/ethereum-technical-analysis-eth-trade-volume-remains-low-amid-selling-pressure/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum Technical Analysis: ETH Trade Volume Remains Low Amid Selling Pressure\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ethers.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Jan. 29, 2024, ethereum&#x2019;s price dynamics display a nuanced interplay of market elements. The current price of ether stands at $2,247, with a 24-hour range fluctuating between $2,246 and $2,284. Despite its substantial market capitalization of $270 billion, ether trading volume remains modest, hinting at possible investor wariness. Ethereum The hourly chart of ethereum [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T14:38:48.000Z",
    "title": "Smart Buildings Transformation Unleashed Using AI Technologies",
    "url": "https://www.cryptopolitan.com/smart-buildings-transformation-using-ai/",
    "description": "Unlock the potential of AI in smart buildings as it revolutionizes workplaces, offering enhanced comfort, efficiency, and sustainability."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T14:23:50.000Z",
    "title": "Lost Call of Duty Game Developed by Neversoft Surfaces Online",
    "url": "https://www.cryptopolitan.com/lost-call-of-duty-game-developed-by-neversof/",
    "description": "In a surprising turn of events, previously unreleased footage of a canceled Call of Duty game has emerged online. The game codenamed &#8220;NX1&#8221; or &#8220;Call of Duty: Future Warfare&#8221; was developed at Neversoft, the studio best known for the Tony Hawk&#8217;s Pro Skater series.&#160; Twitter user @mangafigurines shared gameplay footage from one of its missions, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T14:17:53.000Z",
    "title": "Exciting Nintendo Switch Game Releases in February 2024",
    "url": "https://www.cryptopolitan.com/exciting-nintendo-switch-game-releases/",
    "description": "Nintendo Switch enthusiasts can anticipate a thrilling addition to their gaming libraries with the upcoming release of Jujutsu Kaisen Cursed Clash. Set in the captivating world of the Jujutsu Kaisen series, this 2-on-2 fighting game offers action-packed, co-op gameplay. Players have the opportunity to team up with their favorite characters, sharpen their combat skills, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T14:11:47.000Z",
    "title": "PlayStation Plus Subscribers Have One Last Chance to Play Fan-Favorite Action Game",
    "url": "https://www.cryptopolitan.com/playstation-plus-last-chance-to-play-game/",
    "description": "PlayStation Plus subscribers have one last opportunity to immerse themselves in the captivating world of Tacoma, a popular sci-fi action RPG that has garnered &#8220;very positive&#8221; reviews since its release in 2017. As the PlayStation Plus lineup evolves to introduce new free titles, fan-favorite games like Tacoma often bid farewell to make room for fresh [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-29T14:35:05.000Z",
    "title": "As Litecoin (LTC) Suffers Investors Jump to Toncoin (TON) and Pushd (PUSHD) in Response",
    "url": "https://nulltx.com/as-litecoin-ltc-suffers-investors-jump-to-toncoin-ton-and-pushd-pushd-in-response/",
    "description": "The expected improvement in crypto market conditions ahead of the scheduled Bitcoin (BTC) halving and potential bull run hasn’t seen favorable price movements from all crypto coins. For instance Litecoin (LTC) has hit the buffers in 2024 with its investors flocking to Toncoin (TON) and the brand-new Pushd (PUSHD) e-commerce [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-29T14:33:05.000Z",
    "title": "Ethereum (ETH) and Solana (SOL) Succumb to Market Sentiment as Pushd (PUSHD) Displays Bullish Trend",
    "url": "https://nulltx.com/ethereum-eth-and-solana-sol-succumb-to-market-sentiment-as-pushd-pushd-displays-bullish-trend/",
    "description": "Investors of some of the best-established cryptos expected renewed momentum in 2024 with the promise of a scheduled Bitcoin (BTC) halving event and likely return to bull market conditions. However, Ethereum (ETH) and Solana (SOL) have succumbed to the continuing bearish sentiment, while new e-commerce crypto Pushd (PUSHD) has hit [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-29T14:31:07.000Z",
    "title": "Polkadot (DOT) investors cut losses and dive into Kelexo (KLXO) presale which looks to save their 2024; Ripple (XRP) investors already scramble to buy",
    "url": "https://nulltx.com/polkadot-dot-investors-cut-losses-and-dive-into-kelexo-klxo-presale-which-looks-to-save-their-2024-ripple-xrp-investors-already-scramble-to-buy/",
    "description": "The downward trend, in 2023 had an impact on all cryptocurrency applications across blockchains. Ethereum (ETH) is currently experiencing below-average performance following the crisis and the decline in crypto markets. Like Ethereum (ETH), several web3 projects operating on parallel blockchains with the proof of stake consensus model, have also suffered [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-29T14:29:21.000Z",
    "title": "Future looks bleak for Cardano (ADA) as UNUS SED LEO (LEO) investors buy Pushd (PUSHD) presale",
    "url": "https://nulltx.com/future-looks-bleak-for-cardano-ada-as-unus-sed-leo-leo-investors-buy-pushd-pushd-presale/",
    "description": "Cardano (ADA) increased today by 2.56%, but it’s not enough to impact the token’s market chart. As of today, Cardano (ADA) is trading at $0.4804 and has a 24-hour trading volume of $296,261,952.42. While the future looks unpalatable for Cardano (ADA) despite the minor market increase, UNUS SED LEO (LEO), [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T14:30:57.000Z",
    "title": "XRP Predicted To Rally 250% After Final Price Dip: Crypto Analyst",
    "url": "https://www.newsbtc.com/xrp-news/xrp-rally-250-after-final-price-dip-crypto-analyst/",
    "description": "In his latest technical outlook, crypto analyst Dark Defender has highlighted the key takeaways for XRP amid recent price action. Since hitting a yearly high of $0.64 on January 3, the XRP price has dropped -18.8%, leaving it at risk of further downside before the bulls could take over. XRP Price Set For Final Dip? According to the provided daily XRP/USD chart, the price closed below the significant level of $0.5286. As a result, the RSI has been &#8220;forced to stay below the Resistance Trend Line,&#8221; implying that bears are currently in control, exerting downward pressure on the price. Remarkably, the price has been in a symmetrical triangle formation since November last year, which is considered a bullish continuation pattern. The XRP price has already been rejected three times at the descending resistance line. In tandem, the RSI on the 1-day chart has also formed a descending trend line. Each time the price was rejected at the resistance line, there was also a rejection of the RSI at the trend line. Related Reading: XRP Price Will See 1,000% Rally When ‘Black Cloud’ Dissolves, What This Means Yesterday, Sunday, it looked as if XRP could break above the rising trend line of the RSI, and the price could follow suit and start another attempt to break out of the symmetrical triangle. Dark Defender wrote: XRP moved towards $0.52-$0.53 as we expected. The target area was $0.5286 and XRP closed just above that level yesterday and had a break on the RSI. This is a great sign for XRP shortly to try the $0.60 Resistance [&#8230;] But of course, will be more than happy to see XRP breaking $0.6649 first &#38; proceed with the initial Fibonacci Target of Wave 3 at $1.88. However, this game plan was invalidated as XRP closed below $0.5286 and the RSI trend line. Now, the analyst identifies two key support levels, the trend support at $0.5085 and the Fibonacci support at $0.4623. These levels are now considered pivotal as XRP trades under the $0.53 threshold. Dark Defender emphasizes the importance of these supports: &#8220;So, $0.5085 &#38; $0.4623 supports become more important now.&#8221; Related Reading: Key Requirements For Spot XRP ETF Approval Revealed Amidst 4500% Price Surge Target The daily RSI indicator also suggests that XRP is in the oversold region, which typically indicates that the asset may be undervalued and could possibly reverse to the upside. However, the analyst cautions that the &#8220;weekly frame trumps the daily,&#8221; suggesting that longer time frames may influence the asset&#8217;s price more significantly. &#8220;The more XRP stays below $0.52, the more support becomes prominent,&#8221; he added. Looking forward, Dark Defender anticipates a potential &#8220;wick below these levels to complete this exasperating correction&#8221; and hints at an eventual recovery, with expectations set towards &#8220;Wave 3 in the end.&#8221; This reference to Elliott Wave Theory suggests that following the correction, a strong upward trend could emerge. The final price target would then be $1.88. Despite the current market conditions, Dark Defender advises the community to maintain a positive outlook: &#8220;Be positive and be strong since this will be over.&#8221; The statement conveys a sense of resilience and long-term perspective amid short-term market fluctuations. At press time, XRP traded at $0.52297. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-29T14:24:18.000Z",
    "title": "MANTA Network’s Native Token, MANTA, Skyrockets 62% in Price After Successful Launch",
    "url": "https://www.crypto-news-flash.com/manta-networks-native-token-manta-skyrockets-62-in-price-after-successful-launch/?utm_source=rss&utm_medium=rss&utm_campaign=manta-networks-native-token-manta-skyrockets-62-in-price-after-successful-launch",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/MANTA.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/MANTA.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/MANTA-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/MANTA-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/MANTA-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/MANTA-450x253.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The MANTA token plays a crucial role in activities such as staking, transaction fees, and liquidity provision within the Manta Network ecosystem. As Manta Network gains momentum, the introduction of MANTA aims to enhance user engagement across various decentralized applications and services. While the broader cryptocurrency market has been experiencing some consolidation, MANTA, the native [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-29T14:16:00.000Z",
    "title": "USDT’s Circulating Supply Jumps: Is (BTC) Set for Another Rally",
    "url": "https://coinedition.com/usdts-circulating-supply-jumps-is-btc-set-for-another-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/usdt-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"USDT’s Circulating Supply Jumps: Is (BTC) Set for Another Rally\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/usdt-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Simona_APC, a CryptoQuant author, Bitcoin’s (BTC) price could be positively affected by the rise in USDT’s circulation supply. To back up her point, the on-chain analyst referred to historical data. Simona used an example in 2022, citing how USDT’s supply has increased by 30 billion since 2022. She also noted that each increase [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/usdts-circulating-supply-jumps-is-btc-set-for-another-rally/\">USDT’s Circulating Supply Jumps: Is (BTC) Set for Another Rally</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]