[
  {
    "source": "CryptoSlate",
    "date": "2024-03-14T22:00:26.000Z",
    "title": "From shrimps to whales: Who’s buying and selling during this rally?",
    "url": "https://cryptoslate.com/from-shrimps-to-whales-whos-buying-and-selling-during-this-rally/",
    "description": "<p>The distribution of Bitcoin&#8217;s supply across various cohorts — shrimps, crabs, fish, sharks, and whales — can help us understand how each market segment behaves. Shifts in Bitcoin&#8217;s supply among these groups are heavily correlated with price movements and broader market trends, which is why understanding them is essential when analyzing the market. Shrimps represent [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/from-shrimps-to-whales-whos-buying-and-selling-during-this-rally/\">From shrimps to whales: Who&#8217;s buying and selling during this rally?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-14T21:56:03.000Z",
    "title": "US leads in enthusiasm for AI tokens, reveals CoinGecko report",
    "url": "https://cryptobriefing.com/ai-crypto-leaders-2024/",
    "description": "The top 15 countries leading the AI tokens narrative in 2024 also include the UK and Trkiye, with the favorite tokens being TAO and RNDR."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T22:00:31.000Z",
    "title": "Dogecoin Open Interest Maintains Record Highs, Is A Crash Coming?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-open-interest-record-2/",
    "description": "The Dogecoin open interest rose to a new all-time high earlier in March, and while there has been a small retracement, the open interest has continued to maintain very high record levels since then. Given this continuous high level, it could point to where the price of the meme coin is headed next using historical data. Dogecoin Open Interest Maintains High Level Open interest is a measure of the total number of futures or options contracts of a particular coin in the market at a give time. It can help to tell how much money is flowing into that particular asset, thereby revealing if there a high or love interest in the asset. Related Reading: Bitcoin Whales Are Cashing Out Amid Push To New All-Time High On Dogecoin’s part, its total open interest has been rising over the last few months, especially as the crypto market recovered, as shown by data from Coinglass. A natural consequence of this was that the price was also climbing at the same time as the open interest and thus, there is a high correlation between open interest and price. The DOGE open interest hit a new all-time high of $1.47 billion on March 5, and the meme coin has not looked back since. Despite a small decline in the following days, the open interest is rising once again, reaching $.144 billion on March 14 and taking the price with it. While the rise in open interest does point to a lot of bullishness in the market, historical performance during times like these also calls for caution. Taking a look at what happened the previous times that the Dogecoin open interest hit new all-time highs could give an idea of where the price is headed next. Where Can DOGE Go From Here? Over the years, there have been various points at which the Dogecoin open interest has reached new all-time highs and a trend has emerged, in a manner of speaking. Looking as far back as 2021 when the open interest hit ATHs multiple time, this trend plays out similarly. A sustained rise until a new all-time high is reached, with the price rising along, and then followed by a crash in open interest, as well as price. This was the case in September 2021 when the open interest reached a new all-time high and then again in November 2021 when it clocked another ATH. Related Reading: Samson Mow Gives Reasons Why Bitcoin Price Could Reach $1 Million This Year Moving forward, the same trend is seen in October 2021 when the DOGE open rose close to its previous all-time high, but ended the same way as the previous ones &#8211; with a crash. These crashes almost always affect the DOGE price as well, causing it to drop to the levels before the surge in open interest. If this pattern holds this time around, then a crash might be ahead for the Dogecoin open interest and the DOGE price by extension. A likely scenario is a 20% drop that could send the DOGE price back toward $0.15 before the crypto market picks up steam once again. DOGE bulls hold up price &#124; Source: DOGEUSDT on Tradingview.com Featured image from Decrypt, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-14T22:01:35.000Z",
    "title": "Dogecoin Leaps Hours After Elon Musk Hints at Tesla Accepting DOGE Payments in the Future",
    "url": "https://dailyhodl.com/2024/03/14/dogecoin-leaps-hours-after-elon-musk-hints-at-tesla-accepting-doge-payments-in-the-future/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Musk-Tweets-New-Dog-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Popular meme asset Dogecoin (DOGE) is rising after Tesla CEO Elon Musk hints that the electric car company may accept DOGE payments in the future. Speaking at Giga Berlin, a manufacturing plant for Tesla in Germany, the longtime Dogecoin proponent and billionaire was asked when Tesla would be accepting the dog-themed digital asset as payment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/14/dogecoin-leaps-hours-after-elon-musk-hints-at-tesla-accepting-doge-payments-in-the-future/\">Dogecoin Leaps Hours After Elon Musk Hints at Tesla Accepting DOGE Payments in the Future</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]