[
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T10:48:51.000Z",
    "title": "Ugandan Bitcoiner dreams of the secular economy: BTC Prague 2023",
    "url": "https://cointelegraph.com/news/btc-prague-uganda-bitcoin-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/410de973-2709-45f8-935a-9f0065b8662a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bitcoin community helped Uganda’s Brindon Mwiine travel to BTC Prague after winning tickets for his adoption efforts in East Africa. </p>\n                    <p><p>An Uganda Bitcoiner embarked on a community-funded trip from East Africa to Prague after winning tickets to BTC Prague for his adoption-driving efforts in the country.</p><p>Brindon Mwiine, the founder of Ugandan-based Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) platform Gorilla Sats, set off on a whirlwind journey from Kampala to the heart of Europe on the back of a Twitter competition he never thought he would win.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> I still don’t believe it<br><br>Thank you to everyone who voted and contributed to my Fundraising.<br><br>I made it to <a href=\"https://twitter.com/BtcPrague?ref_src=twsrc%5Etfw\">@BtcPrague</a> <br><br>Special Thanks to <a href=\"https://twitter.com/BitcoinEkasi?ref_src=twsrc%5Etfw\">@BitcoinEkasi</a> and <a href=\"https://twitter.com/BitcoinBeachBR?ref_src=twsrc%5Etfw\">@BitcoinBeachBR</a> <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/k951Pgajhc\">https://t.co/k951Pgajhc</a> <a href=\"https://t.co/k0aBQFwDNo\">pic.twitter.com/k0aBQFwDNo</a></p>&mdash; Brindon⚡ (@BrindonMwiine) <a href=\"https://twitter.com/BrindonMwiine/status/1666792056151318528?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The official @Bitcoin Twitter profile called for individuals to share their stories of building circular economies in their respective countries with tickets to BTC Prague, the prize for the would-be winner.</p><p>Mwiine, who hopes to build a budding Bitcoin community among Uganda’s student population, quickly found his individual pitch garnering plenty of attention from Bitcoin Twitter users across East Africa.</p><p><strong><em><a href=\"https://cointelegraph.com/news/how-bitcoin-mining-saved-africa-s-oldest-national-park-from-bankruptcy\">Related: How Bitcoin mining saved Africa's oldest national park from bankruptcy</a></em></strong></p><p>Speaking to Cointelegraph journalist Joe Hall at BTC Prague, Mwiine explained how his short Twitter pitch paved the road for a trip across the world.</p><blockquote>“I saw all my community members come together, not just from Uganda. People from Kenya were voting, people from Tanzania were voting, it was overwhelming.”</blockquote><p>Mwiine ended up winning the competition, which is where the real work began. What would follow was a series of firsts for the Ugandan, who managed to secure flights, visas and other logistics in the short space of three weeks.</p><blockquote>“I had to figure out a way to get from Uganda to Prague and this is where the fun began. I had to create a pitch and a budget, I’d never flown before, never been on a plane, never been in Europe.”</blockquote><p>The wider Bitcoin community also came to the party, donating sats to help fund Mwiine’s travels through BTC-based crowdfunding platform Geyser Fund:</p><blockquote>“It’s one of the most interesting implementations of Lightning whereby people can crowdfund for you to do something. Ideally you make a pitch to the public and if they find that your project is worth it, they'll send you some sats.”</blockquote><p>With flights and costs checked off the list, Mwiine finally made his way to Europe for what would also be his first ever Bitcoin conference. His first ever airport experience added some stress to the experience, nearly missing a connecting flight in Dubai if not for the help of a fellow Ugandan airport worker.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If all <a href=\"https://twitter.com/hashtag/bitcion?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcion</a> conferences end like this, I will be fundraising to attend all of them<br><br>Thank you <a href=\"https://twitter.com/BtcPrague?ref_src=twsrc%5Etfw\">@BtcPrague</a> - The idea alone changed my life <a href=\"https://t.co/iX7erwgytK\">pic.twitter.com/iX7erwgytK</a></p>&mdash; Brindon⚡ (@BrindonMwiine) <a href=\"https://twitter.com/BrindonMwiine/status/1667663647395512320?ref_src=twsrc%5Etfw\">June 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Attending BTC Prague allowed Mwiine to rub shoulders with Bitcoin community members he’s looked up to in recent years, including the likes of BTC proponent Michael Saylor. Perhaps more importantly, Mwiine took some valuable lessons away from his interactions and experiences at different booths at the conference:</p><blockquote>“What I'm trying to do back at home is create a circular economy. I've learned a lot just by being at the booth of circular economies. What they’re saying is exactly what I need. It's surreal.”</blockquote><p>Uganda's central bank <a href=\"https://cointelegraph.com/news/ugandan-central-bank-u-turns-on-crypto-welcoming-firms-to-regulatory-sandbox\">recently welcomed</a> cryptocurrency businesses operating in the country to participate in its regulatory sandbox. This is set to include consultation with the Blockchain Association of Uganda to help create a framework for the industry in the East African nation.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T10:55:41.000Z",
    "title": "Bitcoin illiquid supply hits all-time high, rate of change is remarkable",
    "url": "https://cryptoslate.com/insights/bitcoin-illiquid-supply-hits-all-time-high-rate-of-change-is-remarkable/",
    "description": "<p>Quick Take Bitcoin&#8217;s illiquid supply has hit an all-time high of 15.17 million as the dominant behavior continues of hodling.  ‘Illiquid supply’ refers to the amount of Bitcoin held by entities and is not readily available for trading or selling. Currently, 72% of the circulating supply is illiquid, but what is fascinating is the rate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-illiquid-supply-hits-all-time-high-rate-of-change-is-remarkable/\">Bitcoin illiquid supply hits all-time high, rate of change is remarkable</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T10:49:56.000Z",
    "title": "Apple threatens to remove Damus from App Store over Bitcoin Lightning payments",
    "url": "https://cryptoslate.com/apple-threatens-to-remove-damus-from-app-store-over-bitcoin-lightning-payments/",
    "description": "<p>Decentralized social media platform Damus has been threatened with App Store removal over its zaps feature. Zaps refer to a Bitcoin Lightning-backed payment mechanism, enabling people to tip content creators on Nostr clients, such as Damus. &#8220;Nostr is a protocol; an open standard upon which anyone can build. Nostr itself is not an app or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/apple-threatens-to-remove-damus-from-app-store-over-bitcoin-lightning-payments/\">Apple threatens to remove Damus from App Store over Bitcoin Lightning payments</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-13T11:03:34.000Z",
    "title": "Cardano (ADA/USD) Price Analysis – 13 June 2023: ‘STRONG BUY’ Suggested by Technical Indicators",
    "url": "https://www.cryptoglobe.com/latest/2023/06/cardano-ada-usd-price-analysis-13-june-2023-strong-buy-suggested-by-technical-indicators/",
    "description": "Introduction This report provides a comprehensive analysis of Cardano’s (ADA) price dynamics on Binance, covering technical indicators, moving averages, and pivot points. Price and Volume Overview As of 9:21 a.m. UTC on 13 June 2023, on Binance, the price of ADA is $0.2817, which is a decrease of $0.0012 (-0.42%) from the previous close. The […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T10:56:37.000Z",
    "title": "Sturdy Finance Extends Olive Branch: $100,000 Bounty for Attacker",
    "url": "https://cryptodaily.co.uk/2023/06/sturdy-finance-extends-olive-branch-100-000-bounty-for-attacker",
    "description": "<p>Sturdy Finance, has taken an unconventional approach to reclaiming stolen funds. Following an exploit that captured around $800,000 in Ether, the project offered a $100,000 bounty to the attacker.</p>\n<p>Sam Forman, founder of Sturdy Finance, confirmed that his team had offered the generous $100,000 bounty. The message asks that the attacker return the stolen funds to an address owned by Sturdy Finance, emphasising that the team will refrain from pursuing legal action if the funds are returned promptly.</p>\nAddressing the exploit\n<p>The security incident occurred when an attacker exploited a reentrancy vulnerability in one of Sturdy Finance's liquidity pools. Through this vulnerability, the hacker manipulated a price oracle, ultimately stealing a substantial amount of funds from the platform.&nbsp;</p>\n<p>As soon as Sturdy Finance was aware of the breach it suspended all of its markets as a precautionary measure. The team assured users that no other funds were compromised and pledged to conduct a wide-ranging investigation into the platform's security.</p>\n\n<p dir=\"ltr\" lang=\"en\">We've sent the following message to the Sturdy hacker on-chain:\"To the exploiter: as we have seen with recent hacks, exploits are not as easy to escape from as they used to be. That said, we are willing to offer you $100k as a bounty, and will not pursue you further if you send&hellip;</p>\n&mdash; Sam Forman (@pgpsam) June 12, 2023\n<p>\n\n</p>\nA risky approach?\n<p>Sturdy Finance's decision to offer a bounty to the attacker raises eyebrows in the crypto community. While unconventional, this approach demonstrates the project's commitment to recovering the stolen funds and mitigating the potential fallout.&nbsp;</p>\n<p>By choosing not to pursue criminal charges and instead incentivising the return of the funds, Sturdy Finance seeks to resolve the situation amicably while sending a strong message about its dedication to the principles of decentralisation and forgiveness.</p>\nThe way forward\n<p>As the crypto world awaits the outcome of this unexpected offer, the incident serves as a reminder of the ongoing challenges faced by decentralised platforms. Sturdy Finance's swift response and commitment to securing its users' funds demonstrate its determination to uphold the highest standards of safety and integrity.&nbsp;</p>\n<p>The community will be closely monitoring the outcome, which may set a precedent for how future security breaches are handled within the DeFi ecosystem.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-13T11:00:22.000Z",
    "title": "CryptoGames Unveils an Enhanced VIP Program and High Stakes Wagering Contest",
    "url": "https://news.bitcoin.com/cryptogames-unveils-an-enhanced-vip-program-and-high-stakes-wagering-contest/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/37becc17-ddf0-4e5a-9609-00d8bb9a4ac1.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />CryptoGames, a well-known online crypto casino, is making waves in the online gambling industry with the launch of its revitalized VIP program and a high stakes wagering competition. These new initiatives promise cryptocurrency gambling enthusiasts a new era of exhilarating challenges and rewarding experiences, raising the bar in online casino gameplay. Challenging Monthly Wagering Contest [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T10:43:59.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-13T11:00:13.000Z",
    "title": "AI Investing Has Never Been Easier, Explore InQubeta To Know How",
    "url": "https://nulltx.com/ai-investing-has-never-been-easier-explore-inqubeta-to-know-how/",
    "description": "Artificial intelligence (AI) has emerged as one of the most promising and transformative technologies of our time. Its potential to revolutionize industries, drive innovation, and generate significant returns has attracted the attention of investors worldwide. However, investing in AI projects and startups can be complex and challenging, requiring deep industry knowledge and access to exclusive [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T11:05:37.000Z",
    "title": "Sygnum Singapore gets approval to offer crypto services",
    "url": "https://crypto.news/sygnum-singapore-gets-approval-to-offer-crypto-services/",
    "description": "Sygnum Singapore has successfully secured in-principle approval of its Major Payment Institution License (MPIL) application from the Monetary Authority of Singapore (MAS). The license enables the bank to offer its clients regulated crypto brokerage services. Sygnum Singapore, the Southeast Asian&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T11:00:00.000Z",
    "title": "DigiToads use cases demonstrated amidst SEC crackdown on tokens without utility",
    "url": "https://crypto.news/digitoads-use-cases-demonstrated-amidst-sec-crackdown-on-tokens-without-utility/",
    "description": "DigiToads, a meme coin project, is proving that it has utility and TOADS an on-demand token as the SEC files a lawsuit against Binance"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T11:02:12.000Z",
    "title": "While Bitcoin (BTC) shows bearish signals, InQubeta (QUBE) Bursts Onto the AI Scene",
    "url": "https://www.crypto-news-flash.com/while-bitcoin-btc-shows-bearish-signals-inqubeta-qube-bursts-onto-the-ai-scene/?utm_source=rss&utm_medium=rss&utm_campaign=while-bitcoin-btc-shows-bearish-signals-inqubeta-qube-bursts-onto-the-ai-scene",
    "description": "Bitcoin, often regarded as a bellwether for the entire crypto market, has recently experienced a period of uncertainty and volatility. The cryptocurrency, which reached new heights in previous years, has been exhibiting bearish signals, including price corrections and market fluctuations. Such conditions have prompted investors to explore alternative investment options that may offer greater potential [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T10:58:08.000Z",
    "title": "‘Dogecoin Millionaire’ Sets Condition for Buying More DOGE: Details Revealed",
    "url": "https://www.crypto-news-flash.com/dogecoin-millionaire-sets-condition-for-buying-more-doge-details-revealed/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-millionaire-sets-condition-for-buying-more-doge-details-revealed",
    "description": "Glauber Contessotto, a crypto influencer, says for him to consider buying more Dogecoin, the price would have to fall below $0.06. With a current market cap of $8.66 billion at the time of writing, this token is the eighth most valuable globally. On Twitter, cryptocurrency influencer Glauber Contessoto, well-known for being a billionaire thanks to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-13T10:59:00.000Z",
    "title": "Ripple’s Brad Garlinghouse Shares Thoughts on the Hinman Doc Release",
    "url": "https://coinedition.com/ripples-brad-garlinghouse-shares-thoughts-on-the-hinman-doc-release/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Wish-I-could-go-in-depth-now-but-weve-waited-this-long-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Wish-I-could-go-in-depth-now-but-weve-waited-this-long-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Wish-I-could-go-in-depth-now-but-weve-waited-this-long-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Wish-I-could-go-in-depth-now-but-weve-waited-this-long.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent tweet, Brad Garlinghouse, the CEO of Ripple, expressed his perspective on the eagerly awaited release of the so-called &#8220;Hinman documents.&#8221; The Hinman documents refer to a speech made by former Securities and Exchange Commission (SEC) official William Hinman in 2018, which many anticipate could provide crucial insights into the regulatory classification of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripples-brad-garlinghouse-shares-thoughts-on-the-hinman-doc-release/\">Ripple’s Brad Garlinghouse Shares Thoughts on the Hinman Doc Release</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]