[
  {
    "source": "Decrypt",
    "date": "2023-09-06T04:01:02.000Z",
    "title": "Story Protocol Launches IP Ownership Network with $54 Million in Funding",
    "url": "https://decrypt.co/155052/story-protocol-launches-ip-ownership-network-with-54-million-in-funding",
    "description": "Andreessen Horowitz invested in a startup that uses blockchain tech to address problems heightened by artificial intelligence."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T03:47:00.000Z",
    "title": "Colombian Bitcoiner aims to orange-pill coffee lovers one bean at a time",
    "url": "https://cointelegraph.com/news/colombian-bitcoiner-orange-pills-coffee-lovers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/25c7db40-a68a-4f10-b066-aaea7cab60d0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The CEO of Lightning Koffee launched the coffee startup in October with the aim of onboarding Medellín's businesses to Bitcoin.</p>\n                    <p><p>José Luis Garcia is a coffee-lover and entrepreneur trying to make his mark in the city of Medellín — the birthplace of Colombia’s modern coffee industry. </p><p>Since the October launch of his start-up Lightning Koffee, Garcia has two goals in mind: Make a decent cup of joe and spread the word about Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). </p><p>His coffee beans — which he's called “The Bitcoiners Coffee” — are sourced and processed locally and are known for having a sweet after-taste.</p><p>Garcia believes his Colombian coffee can serve as a bridge for his fellow Paisas (Medellín locals) to lessen their reliance on the <a href=\"https://cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/colombia-central-bank-recommends-limiting-cbdc-holdings-and-spending/amp\">unpredictable Colombian peso</a> and lean more toward adopting Bitcoin.</p><p>“We have the best coffee in the world and I want my coffee brand to spread the word about Bitcoin so that other businesses will begin to receive it too,” Garcia said in an interview with Cointelegraph.</p><p>He added it would “help drive the Bitcoin circular economy” — where only Bitcoin is traded in exchange for goods and services.</p><blockquote class=\"twitter-tweet\"><p lang=\"qme\" dir=\"ltr\"><a href=\"https://twitter.com/LightningKoffee?ref_src=twsrc%5Etfw\">@LightningKoffee</a> ⚡️☕️ <a href=\"https://twitter.com/hashtag/LightningNetwork?src=hash&ref_src=twsrc%5Etfw\">#LightningNetwork</a> <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&ref_src=twsrc%5Etfw\">#bitcoin</a> <a href=\"https://t.co/VP6nb235RE\">pic.twitter.com/VP6nb235RE</a></p>— José⚡️☕️ (@josebitcoiner) <a href=\"https://twitter.com/josebitcoiner/status/1586514156592799751?ref_src=twsrc%5Etfw\">October 30, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Lightning Koffee currently doesn’t accept fiat but does accept other cryptocurrencies besides Bitcoin. However, Garcia said he’s a self-confessed maxi and wastes no time converting other tokens to Bitcoin.</p><blockquote>“If a person is going to pay me in shitcoins I will accept it because, at the end of the day, it is money. Then I convert it immediately into Bitcoin which is what I'm interested in.”</blockquote><p>Garcia said he’ll soon start taking fiat payments through the likes of Mastercard and Visa at which time he plans to stop taking cryptocurrencies that aren't Bitcoin.</p><p>Lightning Koffee joins other Medellín businesses bringing together crypto and consumables. In June 2022, Mind Cafe, or “Crypto Cafe,” was one of the first cryptocurrency-focused restaurants in El Poblado, the tourist area of Medellín.</p><p>In addition to accepting Bitcoin and Lightning payments, the cafe offers its customers the opportunity to immerse themselves in a metaverse-themed environment where they can build their own avatars and buy a coffee or some traditional Colombian food with Bitcoin.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You walk in and they have a BTC machine to purchase and sell <a href=\"https://twitter.com/hashtag/BTC?src=hash&ref_src=twsrc%5Etfw\">#BTC</a> <br><br>They also have some merch, shoes, tshirts, hoodies, etc. <br><br>Yes probably not great for OPSEC, but man are we EARLY. <br><br>We got there and were basically the ONLY table . 3/9 <a href=\"https://t.co/IboBfVQMwv\">pic.twitter.com/IboBfVQMwv</a></p>— Camila Campton  (@camilacampton) <a href=\"https://twitter.com/camilacampton/status/1548305766909497344?ref_src=twsrc%5Etfw\">July 16, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Garcia is part of a group of local Bitcoiners that have come together to help promote <a href=\"https://cointelegraph.com/news/how-to-build-a-bitcoin-beach-advice-from-the-pros\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-build-a-bitcoin-beach-advice-from-the-pros/amp\">Bitcoin’s circular economy</a> in the city — and more newcomers are popping up every month.</p><p>“The crafty things we're doing are meetups with other Bitcoiners and people in the city of Medellín,” Garcia said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Buying some delicious coffee with <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> in Colombia  ☕️ <a href=\"https://t.co/K9FfCQqe8w\">pic.twitter.com/K9FfCQqe8w</a></p>— Luke Mikic⚡️ 9-5 Escape Artist (@LukeMikic21) <a href=\"https://twitter.com/LukeMikic21/status/1651317842657042432?ref_src=twsrc%5Etfw\">April 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bram Kumuly, an independent Lightning developer who once lived in Medellín, told Cointelegraph he felt a “new energy” amongst the Bitcoin community on his last visit to the city — making him optimistic that Bitcoin's presence there will remain long-term.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/dcad6535-6102-4beb-a636-4bb8fa8d01b0.jpg\"><figcaption style=\"text-align: center;\"><em>A Bitcoiner meetup in Medellin in June. Source: José Luis Garcia</em></figcaption></figure><p>However, Kumuly acknowledged that a wider crypto, nonfungible token (NFT) and blockchain culture exists in Medellín whose values aren’t necessarily aligned with traditional Bitcoiners.</p><h3>Some Colombians yet to see the orange light</h3><p>Unfortunately for Medellín's Bitcoiners, it’s been a tough time convincing everyone of Bitcoin's merits. </p><p>Kumuly mostly attributed this to Colombians not understanding how money works, how the Colombian peso is failing them and how Bitcoin offers an alternate solution.</p><p>“Most people there still think Bitcoin is about trading and getting rich quick,” Kumuly said, adding many don’t realize Bitcoin could be a financial tool that can take power and control away from the politicians that many Colombians have little faith in.</p><p>This knowledge gap is reflected in <a href=\"https://cointelegraph.com/news/btc-prague-uganda-bitcoin-interview\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/btc-prague-uganda-bitcoin-interview/amp\">Bitcoin’s staggered circular economy</a> in Medellín which is still confined to Bitcoiners and isn't \"very strongly or visibly expanding,\" says Kumuly.</p><blockquote>\"There might be more places accepting it, but currently, only six places that accept Bitcoin are marked on BTC Map and it has been like this for a long time already with no growth.”</blockquote><p>There are currently 106 stores in Colombia that accept Bitcoin as payment which lags behind the most Bitcoin-friendly country in the region of El Salvador with its 451 stores, <a href=\"https://btcmap.org/map#5/9.46948/-74.04785\" target=\"_blank\" rel=\"noopener nofollow\">according </a>to BTC Map.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/3240a074-b18c-4053-a875-a16e7efdeaac.jpg\"><figcaption style=\"text-align: center;\"><em>106 stores accept Bitcoin in Colombia. Source: <a href=\"https://btcmap.org/map#6/4.88502/-73.30078\" target=\"_blank\" rel=\"noopener nofollow\">BTC Map</a> </em></figcaption></figure><p>Kumuly said the lion’s share of Bitcoin spending has come from digital nomads and foreigners with little ongoing local presence. Meanwhile, on the merchant side, Kumuly said businesses are still reluctant to accept Bitcoin because of its price volatility.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cheap-micro-bitcoin-miners-fight-btc-mining-concentration-inventors-argue\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cheap-micro-bitcoin-miners-fight-btc-mining-concentration-inventors-argue/amp\"><strong><em>Micro $3 Bitcoin miners won’t make bank, but that’s not the point: Inventors</em></strong></a></p><p>There are signs of life on the technical side of Bitcoin and Lightning development in Medellín which could increase Bitcoin spending in the area, says Kumuly.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I asked some rappers in Medellin about <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&ref_src=twsrc%5Etfw\">#bitcoin</a>. Here’s what happened… <br><br>And yes, I tipped them with<br>lightning ⚡️ <a href=\"https://t.co/2rS5Ocozzb\">pic.twitter.com/2rS5Ocozzb</a></p>— Plan Marcus ⚡️☣️ (@plan_marcus) <a href=\"https://twitter.com/plan_marcus/status/1643784572239265792?ref_src=twsrc%5Etfw\">April 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He said Medellín-based Bitcoiners need to push momentum by building on Bitcoin culture to potentially win over customers and merchants.</p><p>He believes what Medellín needs as a next step are \"local Bitcoin-only tech companies who build Bitcoin products for the people and merchants of Medellín/Colombia, and that are up-to-date on a technological level.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  }
]