[
  {
    "source": "Decrypt",
    "date": "2023-06-13T09:25:06.000Z",
    "title": "SUI Leads Crypto Market Recovery With 8% Rise Overnight",
    "url": "https://decrypt.co/144347/sui-leads-crypto-market-recovery-rise-overnight",
    "description": "Thanks to a recent project update and a few contrarian bets in the futures market, the token powering Sui has led the latest rally."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T09:19:51.000Z",
    "title": "Developer Uncle Rockstar shares the key to Bitcoin adoption: BTC Prague 2023",
    "url": "https://cointelegraph.com/news/btc-prague-uncle-rockstar-bitcoin-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d3721e98-65ce-4aa3-af1a-2ff2937efb68.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Rockstar believes that as more quality Bitcoiners join, support, communicate, and collaborate with each other, Bitcoin will continue to rise.</p>\n                    <p><p>The BTC Prague event has recently highlighted that while there remain places in the world where Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) adoption <a href=\"https://cointelegraph.com/news/bitcoin-payments-exec-philippines-adoption-interview\">is still in its early stages</a>, many continue to be positive about how the community can onboard more BTC supporters despite the new challenges that come in. </p><p>In an interview with Cointelegraph reporter Joseph Hall, pseudonymous Bitcoin developer Uncle Rockstar, the head of Bitcoin at payment platform Strike, shared his thoughts on Bitcoin adoption and his most pressing concerns within the Bitcoin ecosystem in 2023. </p><p>According to the developer, the BTC Prague event allowed him to talk about his story. He said that while he had less time, he was able to allow people to catch “tiny bits” that he believes would let people “do the same for themselves.” He explained that: </p><blockquote>“At the end of the day, that's what it's all about. Like, how can we have more people that individually are uplifted by Bitcoin, and then, can contribute to Bitcoin? And then, we increase Bitcoin adoption.”</blockquote><p>The developer encouraged people to explore Bitcoin and reach out to him or their company Strike to see how they can collaborate. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0da2c08a-f0ee-4168-9083-f5f009efdc74.jpg\"  /><figcaption style=\"text-align: center;\"><em>Uncle Rockstar speaks with Cointelegraph reporter Joseph Hall at BTC Prague. Source: Cointelegraph</em></figcaption></figure><p>When asked about his most pressing concerns in the Bitcoin ecosystem in 2023, the developer spoke about what he describes as the “Bitcoin Derangement Syndrome” and distractions with “shitcoins and the SEC” that could cause some infighting. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-prague-2023-students-for-liberty-interview\"><strong><em>BTC Prague 2023: ‘Anyone can produce value in the Bitcoin ecosystem’</em></strong></a></p><p>He further explained that community members with the syndrome have started to make things all about themselves. Rockstar said: </p><blockquote>“It's like ‘me, me I have done this. I have done that.’ Even if you look at block size wars, it was like ‘I know what should be done!’ And then you have a number of people who are more simply better suited and know more.”</blockquote><p>According to Rockstar, these issues reduce the focus on what should be done within the ecosystem. The developer also said that he’s grateful to those who continue to fight against these bad actors within the space. </p><p>He added that everyone has a role to play in the space, and if more people join the community, Bitcoin can stay on its course. </p><p>“As long as we keep getting more quality Bitcoiners in Bitcoin, and they create a network, they're all individual nodes. And they support each other and they communicate with each other and they collaborate. Bitcoin will keep rising,” Rockstar explained. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T09:33:53.000Z",
    "title": "Binance sees largest Bitcoin inflow since SEC lawsuit",
    "url": "https://cryptoslate.com/insights/binance-sees-largest-bitcoin-inflow-since-sec-lawsuit/",
    "description": "<p>Quick Take Binance saw its largest inflow into the exchange yesterday since the SEC lawsuit, driven by a large whale, almost 3,500 Bitcoin ($66 million). This event raises questions as to why a large whale would deposit such a significant amount of Bitcoin while the exchange is currently facing a lawsuit with the SEC. Since [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-sees-largest-bitcoin-inflow-since-sec-lawsuit/\">Binance sees largest Bitcoin inflow since SEC lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T09:38:25.000Z",
    "title": "Binance lawyers fire back at SEC’s restraining order, citing customer risk and business consequences",
    "url": "https://www.cryptopolitan.com/binance-lawyers-fire-back-at-secs-restraining-order-citing-customer-risk-and-business-consequences/",
    "description": "Lawyers representing Binance and its associated firms have vehemently opposed the restraining order sought by the U.S. Securities Exchange Commission (SEC) in a recent court filing on June 12. The SEC had charged Binance and related companies with various allegations on June 5 and subsequently requested a restraining order against Binance.US—the order aimed to freeze ... <a title=\"Binance lawyers fire back at SEC&#8217;s restraining order, citing customer risk and business consequences\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-lawyers-fire-back-at-secs-restraining-order-citing-customer-risk-and-business-consequences/\" aria-label=\"More on Binance lawyers fire back at SEC&#8217;s restraining order, citing customer risk and business consequences\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T09:14:31.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda&#8217;s research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T09:10:56.000Z",
    "title": "XRP Could Be Set For A Breakout As Investment Inflows Continue",
    "url": "https://www.newsbtc.com/news/xrp-could-be-set-for-a-breakout/",
    "description": "XRP, Ripple&#8217;s native cryptocurrency, is now experiencing a surge of optimism as funds continue to flow, even in the face of a recession-hit industry. Despite the challenges and uncertainties that have plagued the crypto market, XRP has managed to stand out, capturing the attention of investors and enthusiasts alike.  But what exactly is fueling this impressive growth? Why is XRP able to maintain its momentum while others struggle? And, perhaps most importantly, what does the future hold for this resilient cryptocurrency? Related Reading: Coinbase Receives Hong Kong Legislator’s Support Amid Regulatory Storm XRP Secures Promising Investment Inflows In a notable development, XRP has successfully attracted a surge of promising investment inflows, as evidenced by the latest report from CoinShares.  Investment products focused on XRP have seen a significant milestone being reached, with an astonishing half a million dollars invested in the past week alone, continuing the positive trend observed in the previous week. This brings the cumulative inflow since the beginning of 2023 to an impressive total of $4 million. XRP investment inflows. Source: Bloomberg and CoinShares. The positive investment inflows have had a tangible impact on the price of XRP, which has responded with remarkable upward momentum. CoinMarketCap reports XRP&#8217;s price at $0.53, indicating a noteworthy 2.9% rally in the past 24 hours. This price surge showcases XRP&#8217;s resilience amidst the challenging landscape of the cryptocurrency market.  Source: CoinMarketCap Furthermore, over the course of the last seven days, XRP has experienced an impressive climb of 3.3%, solidifying its position as a promising digital asset during these turbulent times. Exclusion From Recent Court Filings By SEC Meanwhile, the recent court filings by the US Securities and Exchange Commission (SEC) have noticeably omitted XRP, as well as ETH and BTC, which highlights the SEC&#8217;s deliberate decision to treat XRP differently from other cryptocurrencies. This exclusion signifies a clear acknowledgment and distinction by the SEC regarding the unique nature of XRP within the cryptocurrency landscape. Related Reading: FLOKI Recovers From A Bad Fall, Climbs Back Up To The Green Zone Eleanor Terrett, a well-known journalist at Fox Business, took to Twitter to express her perspective, revealing that legal sources have furnished her with potential elucidations. As per the information provided by her sources, there are several factors that could plausibly explain this noteworthy lack. Some questions as to why the @SECGov did not name $XRP as a security token in the @binance lawsuit. According to some of my legal sources it could be one or all of a couple of reasons: 1. The SEC wants to stay away from risking inconsistent decisions. 2. It&#8217;s already being… — Eleanor Terrett (@EleanorTerrett) June 5, 2023 As US regulators intensify their crackdown on the crypto industry, altcoin investors concerned about regulatory uncertainties are turning their attention to the XRP ledger (XRPL) network. The faith in XRP&#8217;s potential is further reinforced by the substantial growth observed in the XRPL network. In the first 10 days of June alone, the XRPL network has experienced a considerable surge in growth. Specifically, between June 2 and June 12, the number of new wallet addresses created on the XRPL network surged by an impressive 70%, rising from 1,435 to 2,443. XRP market cap currently at $27 billion. Chart: TradingView.com Investors Maintain Faith In Crypto&#8217;s Potential Investors&#8217; continued faith in XRP can be attributed to Ripple&#8217;s ongoing developments and partnerships. The strides made by Ripple in expanding the use cases of XRP and forging collaborations with financial institutions have instilled confidence in its long-term value proposition. Featured image from InvestingHaven"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T09:34:22.000Z",
    "title": "Is Elon Musk Pumping Meme Coins? Twitter CEO hit with DOGE lawsuit",
    "url": "https://www.crypto-news-flash.com/is-elon-musk-pumping-meme-coins-twitter-ceo-hit-with-doge-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=is-elon-musk-pumping-meme-coins-twitter-ceo-hit-with-doge-lawsuit",
    "description": "In a potentially significant twist in the crypto industry, Tesla CEO Elon Musk faces allegations of insider trading and manipulating the cryptocurrency Dogecoin, leading to colossal financial losses for investors. This occurrence brings to light the importance of carefully considering which altcoins to watch and invest in.  Filed on Wednesday in a Manhattan federal court, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T09:15:51.000Z",
    "title": "Senator Promises Crypto Regulation Overhaul as Businesses Exit US Market Amid SEC Lawsuits and Gary Gensler’s Leadership",
    "url": "https://www.crypto-news-flash.com/senator-promises-crypto-regulation-overhaul-as-businesses-exit-us-market-amid-sec-lawsuits-and-gary-genslers-leadership/?utm_source=rss&utm_medium=rss&utm_campaign=senator-promises-crypto-regulation-overhaul-as-businesses-exit-us-market-amid-sec-lawsuits-and-gary-genslers-leadership",
    "description": "The U.S. bipartisan debt-raise agreement saw the 30 percent digital asset mining tax scrapped. Nonetheless, crypto firms in the United States remain under siege following SEC’s regulatory enforcement actions. The recent escalation of the crypto crackdown in the United States by the Biden administration through the Securities and Exchange Commission (SEC) has caused more digital [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T09:15:12.000Z",
    "title": "Former SEC Official Says Coinbase Is Committing ‘Criminal Offense’ in Its Defense Against SEC",
    "url": "https://dailyhodl.com/2023/06/13/former-sec-official-says-coinbase-is-committing-criminal-offense-in-its-defense-against-sec/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Criminal-Offense-coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A former high-ranking official at the U.S. Securities and Exchange Commission (SEC) says Coinbase can&#8217;t use their initial public offering (IPO) approval as any credible defense in regard to their recent legal issues. The SEC sued Coinbase last week, alleging the top US crypto exchange operated as an unregistered securities exchange, broker and clearing agency. Coinbase [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/former-sec-official-says-coinbase-is-committing-criminal-offense-in-its-defense-against-sec/\">Former SEC Official Says Coinbase Is Committing ‘Criminal Offense’ in Its Defense Against SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]