[
  {
    "source": "CoinDesk",
    "date": "2023-08-25T12:53:29.000Z",
    "title": "Default of Tokenized Loans on Centrifuge Puts MakerDAO’s Investment at Risk",
    "url": "https://www.coindesk.com/markets/2023/08/25/default-of-tokenized-loans-on-centrifuge-puts-makerdaos-investment-at-risk/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "DeFi giant MakerDAO has lent $1.8 million of DAI stablecoin to the tokenized credit pool under distress."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-25T12:45:00.000Z",
    "title": "U.S. Crypto Tax Proposal Lets Miners off the Hook, Snares ‘Some’ Decentralized Exchanges",
    "url": "https://www.coindesk.com/policy/2023/08/25/us-crypto-tax-proposal-lets-miners-off-hook-snares-some-decentralized-exchanges/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Treasury Department has finally unveiled its definition of a \"broker\" for the crypto industry, defining how crypto companies and investors will need to meet tax reporting obligations and answering a years-old question over whether decentralized finance platforms and miners will need to gather their users' personal data."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T13:03:37.000Z",
    "title": "Magnate Finance on Base rug pulls users of $6.5M, as predicted by on-chain sleuth",
    "url": "https://cointelegraph.com/news/magnate-finance-on-base-rug-pulls-users-of-6-5m-as-predicted-by-on-chain-sleuth",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f7810a86-70d2-42da-940e-0a3cce1048c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Magnate Finance first deleted its Telegram channel and X account followed by taking down the website before pulling the plug on its TVL.</p>\n                    <p><p>Magnate Finance, a lending/borrowing platform on Coinbase’s layer 2 protocol Base, has rug-pulled its users of $6.5 million, hours after on-chain sleuths like ZachXBT warned about the possibility of an exit scam due to several actions of the founders of the project.</p><p>Earlier on Aug. 25, the Magnate Finance protocol deleted its Telegram group and took its website offline, raising concerns among users of a possible exit scam. </p><p>Magnate Finance also deleted their X account and removed all possible social media presence. ZachXBT had notified that the Magnate Finance deployer address is directly linked to the Solfire $4.8M exit scam.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Community Alert: Magnate Finance on Base will likely exit scam in the near future currently with over $6.4M TVL. <br><br>The deployers address is directly linked to the Solfire $4.8M exit scam. <a href=\"https://t.co/mBDUy3D66j\">pic.twitter.com/mBDUy3D66j</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1694914871165345997?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Just hours after deleting the Telegram group and taking their website down, the project developers manipulated the price oracle of the protocol and removed all the assets, leading to the collapse of the $6.4 million total value locked in the protocol.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2c2e801e-6f53-4f8c-9571-b17f8487281e.jpg\"  /><figcaption style=\"text-align: center;\"><em>Magnate Finance TVL collapse. Source: DeFi Lama</em></figcaption></figure><p>Blockchain analytic firm Peckshield notified that the scammers behind the project transferred $1.34 million worth of DAI tokens to a new address starting from 0x0664 and later bridged $1 million of the stolen funds to the BNB chain. Peckshield also tracked five different wallets linked to the Magnate Finance scammers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2684c734-3d4f-4c0e-a3a4-3a8e210ad7d4.jpg\"  /><figcaption style=\"text-align: center;\"><em>Magnate Finance stolen fund movement. Source: Peckshield</em></figcaption></figure><p>The scammer behind the rugpull has bridged the majority of the profits to Ethereum L2 platforms, Arbitrum, and Optimism, along with the Binance chain through Stargate. Currently, around 295 ETH and 1.3M DAI are still held on the Base Chain. </p><p>Exit scams and rug pulls have become a very common tactic of scammers, especially in the decentralized finance ecosystem due to the added convenience of decentralization. This is evident from the fact that the total value of cryptocurrencies lost in exit scams and hacks <a href=\"https://twitter.com/Beosin_com/status/1676066280347172865?s=20\" target=\"_blank\" rel=\"noopener nofollow\">amounted </a>to $656 million during the first half of 2023.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T13:00:28.000Z",
    "title": "Binance urges low cap projects to commit tokens to its savings product",
    "url": "https://cryptoslate.com/binance-urges-low-cap-projects-to-commit-tokens-to-its-savings-product/",
    "description": "<p>Binance confirmed to CryptoSlate, in an email dated Aug. 25, that it recently engaged with several low-liquidity tokens, offering recommendations on how they can improve their liquidity. The exchange said the outreach was part of an &#8220;ongoing risk management initiative&#8221; geared towards &#8220;ensuring digital assets [on its platform] continue to meet the high standard level.&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-urges-low-cap-projects-to-commit-tokens-to-its-savings-product/\">Binance urges low cap projects to commit tokens to its savings product</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T12:55:11.000Z",
    "title": "\n                        LYOTECH LABS Celebrates the First 150 Recipients of the LFi ONE Smartphone\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/lyotech-labs-celebrates-the-first-150-recipients-of-the-lfi-one-smartphone",
    "description": "\n                        <p dir=\"ltr\">In a monumental moment that marks a new chapter in the world of mobile technology, LYOTECH LABS is thrilled to announce the delivery of the first units of the LFi ONE Smartphone to the initial 150 recipients worldwide. This exclusive group of tech enthusiasts, influencers, and loyal customers represents the beginning of a new era, as they become the first to experience the groundbreaking LFi ONE.</p>\nA New Player in Technology\n<p dir=\"ltr\">The LFi ONE Smartphone is more than just a device; it's a symbol of LYOTECH LABS' commitment to innovation, quality, and excellence. With cutting-edge features, sleek design, and robust performance, the LFi ONE is poised to redefine the smartphone experience.</p>\nThe First 150: A Global Celebration\n<p dir=\"ltr\">The first 150 recipients of the LFi ONE are spread across various continents, reflecting the global reach and appeal of LYOTECH LABS. From tech bloggers in Silicon Valley to business leaders in Europe, the initial owners of the LFi ONE are united by their passion for technology and innovation.</p>\n<p dir=\"ltr\">This diverse group was carefully selected to represent different demographics, professions, and interests, ensuring that the LFi ONE is tested and appreciated by a wide spectrum of users.</p>\nUnboxing the Future\n<p dir=\"ltr\">The excitement surrounding the unboxing of the LFi ONE is palpable. Social media is abuzz with unboxing videos, first impressions, and reviews from the first 150 recipients. The world is watching as these pioneers explore the features, design, and capabilities of the LFi ONE.</p>\n<p dir=\"ltr\">LYOTECH LABS has also partnered with several influencers and tech experts to provide in-depth analysis and insights into the LFi ONE, offering potential customers a comprehensive understanding of what sets this device apart.</p>\nQuality Meets Innovation\n<p dir=\"ltr\">The LFi ONE has been meticulously crafted to meet the highest standards of quality. From its stunning display to its advanced camera system, every aspect of the LFi ONE has been designed with the user in mind.</p>\n<p dir=\"ltr\">The actual product may slightly vary in design, color, and size, but the essence of innovation and excellence remains consistent across all units.</p>\nA Milestone for LYOTECH LABS\n<p dir=\"ltr\">The delivery of the first units of the LFi ONE to the initial 150 recipients is more than just a product launch; it's a milestone for LYOTECH LABS. It signifies the company's dedication to pushing the boundaries of technology and its commitment to delivering unparalleled experiences to its customers.</p>\n<p dir=\"ltr\">The LFi ONE Smartphone is here, and the first 150 recipients are leading the way in exploring this remarkable device. LYOTECH LABS invites the world to join in this celebration of innovation, quality, and technology.</p>\n<p dir=\"ltr\">As the LFi ONE makes its way into the hands of more customers, LYOTECH LABS continues to stand at the forefront of technological advancement, setting new standards, and shaping the future of the mobile industry.</p>\nAbout LFi\n<p dir=\"ltr\">LFi is a technology company that aims to empower the global fintech movement with new and innovative offerings that combine cutting-edge hardware with next-generation software. Leveraging the power of advanced computing and blockchain technology, LFi seeks to realize a future of financial independence through integrated products and solutions.</p>\n<p dir=\"ltr\">Discover More Dive deeper into LFi's groundbreaking journey. Watch the video now to gain a comprehensive understanding of the project and its far-reaching implications.&nbsp;</p>\n<p></p>\n<p dir=\"ltr\">Telegram - &nbsp;Twitter - Instagram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T12:50:30.000Z",
    "title": "\n                        Shopify Integrates Solana Pay\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/shopify-integrates-solana-pay",
    "description": "\n                        <p dir=\"ltr\">Leading e-commerce platform Shopify will now allow users to make USDC payments thanks to its recent integration of the Solana Pay app.&nbsp;</p>\nSeamless Integration with Shopify\n<p dir=\"ltr\">Shopify, a cornerstone of global e-commerce facilitating transactions worth a staggering $444 billion worldwide, has opened its doors to Solana Pay. This collaboration enables millions of businesses operating on the Shopify platform to offer their customers Solana Pay as a secure payment option. Notably, Solana Pay's initial integration will leverage USDC, the second-largest stablecoin boasting a substantial market capitalization of $25.9 billion, according to CoinGecko.</p>\nThe Power of Crypto Payments\n<p dir=\"ltr\">Josh Fried, overseeing business development and partnerships at Solana Foundation, underscored the significance of crypto payments, saying,&nbsp;</p>\n\n<p dir=\"ltr\">\"Some people argue the killer app for crypto hasn't arrived, but it has: it's payments&hellip;[Everyone] should be doubling down on this.\"&nbsp;</p>\n\n<p dir=\"ltr\">Solana Pay, launched in February 2022 and built on the foundation of the layer-1 blockchain Solana, focuses on facilitating transactions involving dollar-pegged stablecoins. This application seamlessly serves both online and point-of-sale transactions and can handle any volume of digital dollar transfers on the Solana blockchain.&nbsp;</p>\n<p dir=\"ltr\">Noteworthy entities such as USDC issuer Circle, Phantom Solana wallet, and payment processor Checkout.com have already embraced Solana Pay, contributing to the thriving Solana ecosystem encompassing over 11.5 million active accounts.</p>\nA &ldquo;Fee-Free&rdquo; Alternative\n<p dir=\"ltr\">Compared to the standard credit card processing fees that can soar up to 3.5% per transaction, Solana Pay presents an appealing alternative.&nbsp;</p>\n<p dir=\"ltr\">As Fried emphasizes,&nbsp;</p>\n\n<p dir=\"ltr\">\"Solana Pay is effectively 'fee-free.'\"&nbsp;</p>\n\n<p dir=\"ltr\">Transactions conducted on this platform incur minimal costs, with a transaction fee of approximately 0.000005 SOL at the time of writing, translating to mere fractions of a penny.</p>\n<p dir=\"ltr\">Despite facing network outages in the past, Solana has evolved into a faster and more cost-efficient layer-1 blockchain compared to giants like Bitcoin and Ethereum. Significantly, the network has remained operational without a single instance of downtime since February.</p>\nWhere Does The Road Lead?&nbsp;\n<p dir=\"ltr\">Solana Pay's partnership with Shopify is not the platform's first crypto-related endeavor. Shopify had previously integrated Bitcoin lightning network payments via Strike and embraced platforms like Coinbase Commerce and Bitpay.</p>\n<p dir=\"ltr\">While the initial integration features USDC, Solana Pay is exploring the inclusion of additional cryptocurrencies like the native SOL token and BONK, a meme coin, in the future.&nbsp;</p>\n<p dir=\"ltr\">Furthermore, this integration empowers merchants to design creative loyalty programs, potentially incorporating systems like NFT loyalty tokens. This means customers using Solana Pay for repeat purchases could be rewarded with discounts and other incentives.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T13:09:09.000Z",
    "title": "AI-Chip Underdogs Take On Nvidia’s Reign in an Evolving Arena",
    "url": "https://www.cryptopolitan.com/ai-chip-underdogs-nvidias-evolving-arena/",
    "description": "Investors&#8217; attention is squarely fixed on the impending financial success of chip designer Nvidia Corp., as the company anticipates a significant surge in sales and earnings attributed to its AI-focused chips tailored for data centers. Despite the current spotlight on Nvidia, some astute investors are beginning to cast their gaze beyond the tech giant, searching ... <a title=\"AI-Chip Underdogs Take On Nvidia&#8217;s Reign in an Evolving Arena\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-chip-underdogs-nvidias-evolving-arena/\" aria-label=\"More on AI-Chip Underdogs Take On Nvidia&#8217;s Reign in an Evolving Arena\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T12:42:04.000Z",
    "title": "Bitfinex partners with Vakıfbank to offer zero-cost deposits in Turkish Lira",
    "url": "https://www.cryptopolitan.com/bitfinex-partners-vakifbank-zero-cost-deposits-in-turkish-lira/",
    "description": "Bitfinex, a leading crypto trading platform, has announced a partnership with Vakıfbank, Turkey&#8217;s second-largest bank, to offer zero-cost deposits for customers in Turkey. This integration allows Turkish customers to deposit Turkish Lira (TRY) directly into their Bitfinex accounts without any fees, marking a significant step in Bitfinex&#8217;s expansion in the Turkish market. A strategic partnership ... <a title=\"Bitfinex partners with Vakıfbank to offer zero-cost deposits in Turkish Lira\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitfinex-partners-vakifbank-zero-cost-deposits-in-turkish-lira/\" aria-label=\"More on Bitfinex partners with Vakıfbank to offer zero-cost deposits in Turkish Lira\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T12:50:29.000Z",
    "title": "XRP Price At Make-Or-Break Moment, Key Levels To Watch",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-at-make-or-break-moment-key-levels/",
    "description": "The XRP price is facing an extremely crucial juncture, which could become a make-or-break moment for the cryptocurrency. After the XRP token managed to rally almost 100% after the summary judgment in the case between Ripple Labs and the US Securities and Exchange Commission (SEC), there is almost nothing left of the gains just 43 days after the ruling, NewsBTC reported. However, this is far from the worst. The recent price decline has brought XRP to key support levels that must be held at all costs to avoid another deep fall. At the same time, there is hope due to the formation of an extremely rare golden cross on the 1-week chart. Golden Cross: A Beacon For XRP Bulls? As of August 25, 2023, XRP stands at $0.5115. The weekly chart reveals the much-discussed golden cross, a phenomenon where a short-term moving average surpasses a long-term one, often hinting at a shift from a bearish to a bullish trend. In XRP&#8217;s case, the 50-week EMA has moved above the 200-week EMA. Related Reading: XRP Bears Reverse All SEC Ruling Gains, What’s Next? This movement is typically seen as a harbinger of an impending upward trajectory. However, the tokens price is teetering just above the 200-week EMA, pegged at $0.5083. A weekly close below this figure could spell trouble. Not only would it undermine this crucial indicator, but it might also negate the golden cross&#8217;s significance. Moreover, the uptrend line (black), which has been intact since early January, could be jeopardized if XRP dips below the $0.50 mark on a weekly basis. Given this backdrop, the golden cross on the weekly chart is a beacon of hope. Yet, the risks are palpable. Should the token breach the $0.50 threshold on a weekly timeframe, a sharper decline seems imminent, potentially plummeting to the 78.6 Fibonacci level at $0.4350. Related Reading: Rumors Of Robinhood Listing XRP Take Center Stage On Crypto Twitter Before potentially hitting the year&#8217;s low of just under $0.30, XRP might find support at $0.41 and $0.36. As in previous weeks, news of the legal battle between Ripple and the SEC are the most potent catalysts for an XRP price rally. While the SEC&#8217;s interlocutory appeal is currently under review by Judge Torres, the trial is not scheduled until mid-April next year. A Historical Perspective Remarkably, XRP has only seen one golden cross on a weekly basis in its history. This was at the end of November 2020. XRP saw an increase of 196% in three weeks. However, as we all know, XRP&#8217;s rally was prematurely thwarted by the US Securities and Exchange Commission&#8217;s lawsuit against Ripple Labs and the declaration of the XRP token as a security. Therefore, the golden cross failed to materialize, while the price crashed. Probably, the next week or two will tell if the golden cross chart pattern will play out this time. Featured image from Medium, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T13:00:53.000Z",
    "title": "Analyst Picks Cosmos, Hedera, and Everlodge as Must-Have Tokens for 20x Growth",
    "url": "https://www.crypto-news-flash.com/analyst-picks-cosmos-hedera-and-everlodge-as-must-have-tokens-for-20x-growth/",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-132.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-132.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-132-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-132-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cosmos (ATOM) and Hedera (HBAR) are solid performers that analysts project can make a fine addition to anyone&#8217;s portfolio. But they&#8217;re not the only projects that have gotten attention. With the global hospitality industry being worth $4.548 trillion and the real estate market reaching $280 trillion, there&#8217;s a lot of interest to get into these [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T12:46:32.000Z",
    "title": "BREAKING: Former SEC Official Who Filed Ripple (XRP) Lawsuit Joins Billion-Dollar Hedge Fund That Made Significant Bets on Bitcoin, Ethereum, and Another Altcoin",
    "url": "https://www.crypto-news-flash.com/breaking-former-sec-official-who-filed-ripple-xrp-lawsuit-joins-billion-dollar-hedge-fund-that-made-significant-bets-on-bitcoin-ethereum-and-another-altcoin/",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Legal experts have raised questions about gross corruption deals in the United States SEC in regard to cryptocurrency market regulations. The conflict of interest has been the top issue that has been pointed to impact the ability of the SEC to deliver impartial regulatory scrutiny. The cryptocurrency market grew to a trillion-dollar industry within its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T13:07:56.000Z",
    "title": "Musk Faces Discrimination Charges: Will DOGE Suffer the Effects?",
    "url": "https://coinedition.com/musk-faces-discrimination-charges-will-doge-suffer-the-effects/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/0113.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/0113.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/0113-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/0113-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/0113-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/0113-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/0113-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/0113-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/0113-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/0113-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/0113-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/0113-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/0113-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/0113-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/0113-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/0113-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/0113-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to the latest reports, the U.S. Justice Department (DOJ) has filed a lawsuit against Elon Musk’s spacecraft company SpaceX for discrimination against refugees. As per the case, SpaceX discouraged refugees from applying to roles in the company. And even if they did apply, the firm refused to consider them because of their citizenship status. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/musk-faces-discrimination-charges-will-doge-suffer-the-effects/\">Musk Faces Discrimination Charges: Will DOGE Suffer the Effects?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T12:54:00.000Z",
    "title": "DeFiChain Up 16% as Cake Group Announces ETH Staking Rewards Burn",
    "url": "https://coinedition.com/defichain-up-16-as-cake-group-announces-eth-staking-rewards-burn/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Julian Hosp, CEO of Cake Group and Bake, took to X to make a significant announcement for the DeFi community. In particular, Hosp announced its team has received the first Ethereum staking rewards from DeFiChain, a decentralized finance platform on the Bitcoin blockchain. According to the CEO, the team will swap the reward into DeFiChain&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/defichain-up-16-as-cake-group-announces-eth-staking-rewards-burn/\">DeFiChain Up 16% as Cake Group Announces ETH Staking Rewards Burn</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]