[
  {
    "source": "Crypto Briefing",
    "date": "2023-09-18T20:59:54.000Z",
    "title": "Coinbase’s Base Beats Ethereum in Daily Transactions",
    "url": "https://cryptobriefing.com/coinbases-base-beats-ethereum-daily-transactions/?utm_source=feed&utm_medium=rss",
    "description": "Social app Friend.Tech usage sends Base's transaction count above Ethereum's."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T20:50:17.000Z",
    "title": "Canto blockchain migrates to Ethereum’s Layer 2, leveraging Polygon’s technology to revolutionize ‘neofinance’",
    "url": "https://www.cryptopolitan.com/canto-blockchain-migrates-to-ethereums-layer-2/",
    "description": "In a significant development for the blockchain community, Canto, a Layer 1 blockchain initially launched in 2022, announced its migration to Ethereum&#8217;s Layer 2 (L2). The migration is facilitated by Polygon&#8217;s Chain Development Kit (CDK), a technology that enables the creation of zero-knowledge (ZK) chains. This move aims to focus on real-world assets and is ... <a title=\"Canto blockchain migrates to Ethereum&#8217;s Layer 2, leveraging Polygon&#8217;s technology to revolutionize ‘neofinance’\" class=\"read-more\" href=\"https://www.cryptopolitan.com/canto-blockchain-migrates-to-ethereums-layer-2/\" aria-label=\"More on Canto blockchain migrates to Ethereum&#8217;s Layer 2, leveraging Polygon&#8217;s technology to revolutionize ‘neofinance’\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-18T21:05:35.000Z",
    "title": "Ethereum ICO Whale Deposits 6,000 ETH Into Kraken, Sparks Selling Pressure Speculations",
    "url": "https://nulltx.com/ethereum-ico-whale-deposits-6000-eth-into-kraken-sparks-selling-pressure-speculations/",
    "description": "In a significant move in the world of cryptocurrency, an Ethereum whale recently deposited a substantial amount of 6,000 ETH (Ethereum) into the Kraken exchange, with a current valuation of approximately $9.96 million. This transaction, occurring just 50 minutes ago, has piqued the interest of the crypto community due to the whale&#8217;s unique history as [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T21:00:39.000Z",
    "title": "Crypto Fund Flows: Millions Exit Bitcoin, But These Three Coins Hold Their Ground",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-fund-flows-millions-exit-bitcoin-but-these-three-coins/",
    "description": "Last week marked a significant trend as crypto funds, including those holding Bitcoin, faced significant outflows, amplifying investor concerns. While the market&#8217;s momentum has wavered for several crypto, a few resilient assets stood firm. Digital asset investment products witnessed a decline for the fifth straight week. Last week alone saw outflows amounting to $53.5 million, accumulating to nearly half a billion in aggregate outflows over the past nine weeks. Market Leaders &#8211; Bitcoin And Ethereum Feel The Brunt Bitcoin (BTC), often dubbed the &#8220;king of cryptocurrency,&#8221; bore the brunt of these outflows. Roughly 85% of the outflows stemmed from Bitcoin funds, translating to a decrease of $45 million last week. Related Reading: Bitcoin’s Next Move: Crypto Analyst Predicts $45,000 Price Ahead Of Halving This happened amid Bitcoin&#8217;s grappling to recoup some of its prior losses. The cryptocurrency rose from a little over $25,000 at the start of last Monday to end the week above $26,000 by Saturday. As of this writing, Bitcoin is trading at $27,117, marking an 8.3% increase over the past 7 days Furthermore, the outflow scenario wasn&#8217;t particularly rosy for Ethereum (ETH) either. Despite its traditionally appealing investment fundamentals, according to the report, and a booming demand for its staking yield, ETH also, saw outflows to $4.8 million. Other notable assets like BNB and MATIC also experienced minor outflows. As James Butterfill, the head of research at asset manager CoinShares, highlighted in their recent report, the last two months have been especially challenging, with eight out of the previous nine weeks reporting outflows. Yet, according to the report, the U.S. seemed to be the primary catalyst behind this negative sentiment, accounting for 77% of the outflows. Other regions, such as Germany, Canada, and Sweden, weren&#8217;t immune, registering significant outflows over the last week. Year-to-date net inflows have plummeted to a meager $51 million post this outflow spree, a startling revelation given the optimistic start to 2023. Solana, Cardano, And XRP: The Silver Lining Solana, Cardano, and XRP emerged as beacons of hope in this seemingly gloomy backdrop. Unlike their counterparts, these assets saw inflows: Solana led the pack with $700,000, followed by Cardano and XRP with inflows of $400,000 and $100,000, respectively. Their performance offers a glimmer of optimism in an otherwise challenging digital asset market, indicating that pockets of resilience and investor confidence remain. Additionally, trading volume surged by a significant 42% on the brighter side, rising from the previous week&#8217;s $754 million to $1 billion. While blockchain equities, too, felt the sting with their sixth consecutive week of outflows, the increased trading volume indicates the active participation and engagement of traders in the crypto sphere. Related Reading: Solana Seeing Dark Clouds? Trader Predicts Steady Bottom Formation Notably, Solana and Cardano have seen more profits than XRP in the past 24 hours, with the former up by 5.5% and the latter by 2.8%; XRP has only recorded a mere 1% profit over the same period. Featured image from iStock, Chart from TradingView"
  }
]