[
  {
    "source": "Decrypt",
    "date": "2024-01-15T22:15:29.000Z",
    "title": "Assassin's Creed Maker Ubisoft Backs Yet Another Crypto Gaming Network",
    "url": "https://decrypt.co/212928/assassins-creed-maker-ubisoft-backs-yet-another-crypto-gaming-network",
    "description": "Major video game publisher Ubisoft is among Wemix's 40 \"node council partners\" that will validate its blockchain."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-15T22:24:15.000Z",
    "title": "South Korea targets crypto mixers for anti-money laundering efforts",
    "url": "https://cryptobriefing.com/south-korea-targets-crypto-mixers-anti-money-laundering/?utm_source=feed&utm_medium=rss",
    "description": "South Korea authorities is set to regulate crypto mixing services, following global trends to combat money laundering."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T22:29:12.000Z",
    "title": "Chainlink shows resilience with LINK’s remarkable rebound in cryptocurrency market",
    "url": "https://www.cryptopolitan.com/chainlink-resilience-links-rebound/",
    "description": "Chainlink&#8217;s native cryptocurrency, LINK, has significantly recovered after facing a sharp downturn. The token recently experienced a drop below the pivotal $13 support level, a movement partly attributed to market uncertainty fueled by speculation about the US SEC&#8217;s stance on a Bitcoin ETF. Despite these challenges, LINK has demonstrated a strong rebound, an indication of [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-15T22:30:23.000Z",
    "title": "Chainlink (LINK) Shows Signs Of Revival With Recent Surge",
    "url": "https://nulltx.com/chainlink-link-shows-signs-of-revival-with-recent-surge/",
    "description": "Chainlink (LINK) is demonstrating potential signs of a revival, overcoming recent challenges in the market. Over the weekend, LINK experienced a noteworthy breakthrough, reaching $15.82 for the first time in two weeks.  A particularly significant aspect of this resurgence is the fact that exchanges now hold less than 15% of [&#8230;]"
  }
]