[
  {
    "source": "Decrypt",
    "date": "2023-07-03T19:02:29.000Z",
    "title": "BlackRock Refiles for Bitcoin ETF After SEC Flags Flaws",
    "url": "https://decrypt.co/147177/blackrock-spot-bitcoin-etf-filing-sec-coinbase-surveillance",
    "description": "After reports that the SEC found flaws in its initial filing, BlackRock submitted a fresh application for a Bitcoin spot market ETF. If successful, it would be the first Bitcoin spot ETF to win approval."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-03T18:58:12.000Z",
    "title": "Researchers Are Breaking Ancient Language Barriers With AI",
    "url": "https://decrypt.co/147176/ai-ancient-language-translation-cuneiform-akkadian",
    "description": "Data scientists are using artificial intelligence to translate Cuneiform and Akkadian into English."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-03T18:48:40.000Z",
    "title": "Crypto ATM Company Bitcoin Depot Launches on Nasdaq",
    "url": "https://decrypt.co/147168/bitcoin-depot-atm-company-launch-nasdaq-listing",
    "description": "The Bitcoin ATM provider is the first publicly listed company of its kind in the U.S. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-03T18:45:47.000Z",
    "title": "'A lot of the bad actors have been shaken out of the market' — Bitvo CEO",
    "url": "https://cointelegraph.com/news/bad-actors-shaken-out-canadian-market-bitvo-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/deafebf2-df1c-41fe-aef3-c75aa5b086c4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitvo president and CEO Pamela Draper spoke with Cointelegraph at the Collision Conference in Toronto on the firm almost being acquired by FTX and Canada's regulatory environment.</p>\n                    <p><p>Pamela Draper, president and CEO of crypto platform Bitvo, has weighed in on firms escaping the Canadian market amid the regulatory environment.</p><p>Speaking to Cointelegraph at the Collision Conference in Toronto on June 29, Draper said despite crypto companies like Binance, dYdX, and Bybit announcing their departure from Canada in 2023, the country was “one of the few jurisdictions where there’s actually a regulatory regime in place that you can follow.” She cited cases in the United States, where Binance and Coinbase both face lawsuits from the country’s Securities and Exchange Commission.</p><p>“At least in Canada you have a framework you can follow where you know the guidelines,” said Draper. “You may not necessarily agree with every single aspect of it, but you know the sandbox.”</p><p>She added that certain firms with operations in other countries may not be willing to “make the investment” in Canada amid the regulatory framework. Canadian regulators <a href=\"https://cointelegraph.com/news/canada-crypto-regulation-bitcoin-etfs-strict-licensing-and-a-digital-dollar\">imposed requirements in 2021</a> giving crypto firms two years to register as an “investment dealer” or “regulated marketplace”, with the expectation they would be in compliance in 2023. </p><blockquote>“It’s a lot of work and money to comply with the regime in terms of the staff that you need to set up, the infrastructure that you need to set up, the legal fees that you need to work through the process to to get your license with the securities commission.”</blockquote><p>In June 2022, now-defunct crypto exchange FTX <a href=\"https://cointelegraph.com/news/ftx-plans-to-acquire-crypto-exchange-bitvo-as-part-of-move-into-canadian-market\">announced plans to purchase Bitvo</a> as part of its move into Canada. The deal fell apart in November when FTX declared bankruptcy and former CEO Sam Bankman-Fried was subsequently arrested in the Bahamas. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-security-education-and-regulation-can-mitigate-rising-crypto-scams\"><strong><em>How security, education and regulation can mitigate rising crypto scams</em></strong></a></p><p>According to Draper, she initially wasn’t concerned about the reports involving FTX’s liquidity in early November 2022 because many saw the exchange as the “poster child for pushing regulation forward”. She cited a <a href=\"https://cointelegraph.com/news/crypto-exchange-ftx-us-closes-400m-funding-round-to-reach-8b-valuation\">$400-million funding round for FTX</a>, maintaining the firm’s multi-billion dollar valuation at the time.</p><p>“The fact they [FTX] were doing something untoward seemed really inconsistent with what Sam was saying publicly and the whole narrative around our merger acquisition,” said Draper. “If we had been acquired, absolutely we would have been wrapped up in the bankruptcy proceedings [...] I don’t think anyone on the planet expected FTX to fall from grace the way that they did.” </p><blockquote>“A lot of the bad actors have been shaken out of the market, and I believe the ones that are remaining are on balance more good than bad.”</blockquote><p>Bybit, Binance, dYdX, OKX, and Paxos are among the firms which have <a href=\"https://cointelegraph.com/news/okx-to-cease-operations-in-canada-by-june-22-2023\">announced a scaling back</a> or exit of operations in Canada. Amid the Collision Conference, which ran from June 26 to June 29, Canadian lawmakers in the country’s House of Commons also <a href=\"https://cointelegraph.com/news/canadian-committee-proposes-measures-support-blockchain-crypto\">released a report</a> highlighting the advantages and potential of blockchain technology in various sectors.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cleaning-crypto-how-much-enforcement-needed/\"><strong><em>Cleaning up crypto: How much enforcement is too much?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-03T18:42:27.000Z",
    "title": "Nasdaq refiles BlackRock’s spot-Bitcoin ETF application, names Coinbase as surveillance-sharing partner",
    "url": "https://cryptoslate.com/nasdaq-refiles-blackrocks-spot-bitcoin-etf-application-names-coinbase-as-surveillance-sharing-partner/",
    "description": "<p>Nasdaq has resubmitted BlackRock&#8217;s spot-Bitcoin exchange-traded fund (ETF) filing on July 3 after clarifying that it intends to enter a surveillance-sharing agreement (SSA) with Coinbase — which will serve as the spot-Bitcoin exchange required by the SEC. The move mirrors the other applications filed by Cboe Global Markets on behalf of global asset manager Fidelity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nasdaq-refiles-blackrocks-spot-bitcoin-etf-application-names-coinbase-as-surveillance-sharing-partner/\">Nasdaq refiles BlackRock’s spot-Bitcoin ETF application, names Coinbase as surveillance-sharing partner</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T19:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Weaker After 30799 - 4 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-weaker-after-30799-4-july-2023",
    "description": "<p>BTC/USD Hovering Around 30716:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 4 July 2023</p>\n<p>Bitcoin (BTC/USD) continued to consolidate recent gains early in the Asian session as the pair traded as high as the 30799 area before yielding some advances, a move that represented a test of the 76.4% retracement of the depreciating range from 31277 to 29417.14.&nbsp; The recent sell-off to the 29417.14 area represented a test of the 38.2% retracement of the appreciating range from 26165.98 to 31443.67.&nbsp; This decline occurred after BTC/USD spiked higher to the 30277 area, its strongest print in several trading sessions, and increased the possibility of a test of the 28604.83 area.&nbsp; The pair&rsquo;s recent print around the 31443.67 area was a twelve-month high and test of an upside price objective associated with buying pressure that strengthened around the 26637.41 area.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.</p>\n<p>Following recent selling pressure, areas of potential technical support and buying pressure include the 29863, 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Stops were also recently triggered above additional upside price objectives around the 29068, 29159, 29458, 30088, 30200, 30292, and 30477 levels.&nbsp; &nbsp;&nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30486.99 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30547.43.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T18:47:27.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T18:43:17.000Z",
    "title": "Apple’s Vision Pro headset faces production challenges, revised targets ahead",
    "url": "https://www.cryptopolitan.com/apples-vision-pro-headset-faces-production-challenges-revised-targets-ahead/",
    "description": "Apple Inc., the technology giant known for its innovative products, is facing significant hurdles in the production of its highly anticipated mixed-reality Vision Pro headset. According to sources close to the matter, manufacturers are struggling with the device&#8217;s complex design, leading to a revision of production targets. The Financial Times reported that Apple is now ... <a title=\"Apple&#8217;s Vision Pro headset faces production challenges, revised targets ahead\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apples-vision-pro-headset-faces-production-challenges-revised-targets-ahead/\" aria-label=\"More on Apple&#8217;s Vision Pro headset faces production challenges, revised targets ahead\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T19:00:16.000Z",
    "title": "Crypto Analyst Sheds Light On Litecoin Next Possible Price Move",
    "url": "https://www.newsbtc.com/news/litecoin/crypto-analyst-sheds-light-on-litecoin-next-possible-price-move/",
    "description": "In a market of ever-changing dynamics, Litecoin (LTC), one of the top-performing cryptocurrencies, is caught in an interesting situation. The digital asset&#8217;s price direction has recently been the subject of analysis by a renowned crypto expert, Ali, who is well-known for his crypto predictions and insights. His analysis, drawn from a key market indicator, the Market Value to Realized Value (MVRV) ratio, may shed light on Litecoin&#8217;s immediate future. Ali’s forecast derives from the 30-day MVRV for Litecoin, which presently stands at around 35%. This metric serves as an instrument for tracking the disparity between the market value and realized the value of the digital asset. Related Reading: Litecoin Up 18% In Past 24 Hours, Is Halving Rally Here? Ali&#8217;s recent observation adds a significant dimension to the market&#8217;s perception of Litecoin, suggesting that history might be gearing up to repeat itself. The History Of Litecoin MVRV And Price Corrections As Ali highlighted in a recent tweet, Litecoin’s history since 2018 shows a distinctive pattern. Whenever the 30-day MVRV exceeds the 30% threshold, a sharp price correction ensues. Such corrections have typically led to a decline in LTC&#8217;s price ranging from 30% to 40%. This pattern has persisted over the years and lends credence to Ali&#8217;s prediction about a possible downturn. Currently, #Litecoin MVRV 30D hovers around 35%. Historically, each time $LTC MVRV 30D exceeds the 30% mark since 2018, a sharp price correction typically follows! This usually translates to a #LTC price drop ranging from 30% to 40%. pic.twitter.com/R5oMMaKWGc — Ali (@ali_charts) July 2, 2023 The rationale behind this is straightforward. When the MVRV ratio is high, it indicates that holders have accrued significant profits and may decide to sell, resulting in a price drop. However, it’s important to remember that while historical trends provide an indication, they are not a guaranteed predictor of future events. LTC Latest Price Action On June 30, Litecoin experienced a significant price hike, recording a sizeable green candlestick. This surge propelled LTC to the high of $109 at the time of writing, reflecting a nearly 24% increase over the last seven days. In addition, Litecoin has exhibited a minor decrease of 1.8% within the last 24 hours. The asset&#8217;s market capitalization has also seen a 22.5% surge in the past week, moving from a low of $6.4 billion last Monday to as high as $8 billion as of today. This has ranked the altcoin as 8th among the largest crypto by market capitalization. Litecoin&#8217;s daily trading volume has also recorded a significant surge from the $462 million volume seen late last month to stand above $1 billion in the past 24 hours. LTC currently has a 24-hour low of $108 and a 24-hour high of $114. Related Reading: Litecoin Surging Adds 20% Ahead of Halving Event, DigiToads Gains 370% In Presale It is worth noting that LTC&#8217;s recent surge can be attributed to the upcoming halving which is to take place in the next few weeks. This has served as a catalyst for investors to accumulate the altcoin. However, despite the LTC surge, the asset is still 72% down from its peak of $412. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T19:03:08.000Z",
    "title": "LTC Skyrockets 30% in Three Days: The Investment Opportunity of a Lifetime as Litecoin Halving Countdown Begins",
    "url": "https://www.crypto-news-flash.com/ltc-skyrockets-30-in-three-days-the-investment-opportunity-of-a-lifetime-as-litecoin-halving-countdown-begins/?utm_source=rss&utm_medium=rss&utm_campaign=ltc-skyrockets-30-in-three-days-the-investment-opportunity-of-a-lifetime-as-litecoin-halving-countdown-begins",
    "description": "Litecoin has recorded a 30 percent increase over the last couple of days, cementing its position above $100. The Bitcoin-inspired altcoin has now climbed to become the 9th largest crypto by market ahead of its halving. Litecoin (LTC) has in the last 7 days added nearly 30 percent to its value. Following this, the altcoin [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T19:00:54.000Z",
    "title": "Pepecoin Update: Discover the Secrets to Making Easy 7 Figures and How Early PEPE Investors Mastered the Art",
    "url": "https://www.crypto-news-flash.com/pepecoin-update-discover-the-secrets-to-making-easy-7-figures-and-how-early-pepe-investors-mastered-the-art/?utm_source=rss&utm_medium=rss&utm_campaign=pepecoin-update-discover-the-secrets-to-making-easy-7-figures-and-how-early-pepe-investors-mastered-the-art",
    "description": "Pepecoin stormed the crypto market with its affiliation with the legendary, controversial meme character Pepe the Frog. Upon entering the market, this gave it broad acceptance and an edge over other memecoins. But PEPE’s investors are now flocking to invest in a new memecoin after making jaw dropping profit from PEPE. They want to replicate [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-03T18:45:01.000Z",
    "title": "IRS Forces Kraken To Produce Records of Users With Total Crypto Transactions Worth $20,000 or More",
    "url": "https://dailyhodl.com/2023/07/03/irs-forces-kraken-to-produce-records-of-users-with-total-crypto-transactions-worth-20000-or-more/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/crypto-bump-bull-trap.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new court order is forcing crypto exchange Kraken to give the Internal Revenue Service (IRS) some of its users&#8217; data for the purpose of investigating potential tax violations. In March 2021, the IRS filed a petition to identify Kraken accounts that engaged in crypto transactions worth at least $20,000 in any single year from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/03/irs-forces-kraken-to-produce-records-of-users-with-total-crypto-transactions-worth-20000-or-more/\">IRS Forces Kraken To Produce Records of Users With Total Crypto Transactions Worth $20,000 or More</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-03T18:41:13.000Z",
    "title": "Institutions Pour Capital Into Bitcoin and Altcoins, Creating Positive Net Flows for 2023: CoinShares",
    "url": "https://dailyhodl.com/2023/07/03/institutions-pour-capital-into-bitcoin-and-altcoins-creating-positive-net-flows-for-2023-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Fund-Says-Bitcoin-Has.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are bullish on Bitcoin (BTC) and altcoins as crypto sees over $120 million in inflows last week. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that institutional investors poured $125 million into the crypto markets last week, the second week of significant inflows in a row. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/03/institutions-pour-capital-into-bitcoin-and-altcoins-creating-positive-net-flows-for-2023-coinshares/\">Institutions Pour Capital Into Bitcoin and Altcoins, Creating Positive Net Flows for 2023: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]