[
  {
    "source": "Decrypt",
    "date": "2023-12-02T02:05:38.000Z",
    "title": "Israel Taps AI for Airstrike Targeting, Doubling the Number of Potential Sites",
    "url": "https://decrypt.co/208388/israel-idf-ai-targeting",
    "description": "The Israeli Defense Force showcased its AI-powered 'Gospels' targeting system, running around the clock since the Hamas attack."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-02T01:44:18.000Z",
    "title": "Nvidia-Backed Startup Together AI Raises $102.5 Million",
    "url": "https://decrypt.co/208382/nvidia-backed-startup-together-ai-raises-102-5-million",
    "description": "The startup stressed the importance of the open-source approach in building generative AI models."
  },
  {
    "source": "NullTX",
    "date": "2023-12-02T02:06:24.000Z",
    "title": "Ethereum ($ETH) Marks Noteworthy Surge Towards Yearly High Amidst Positive Whale Activity",
    "url": "https://nulltx.com/ethereum-eth-marks-noteworthy-surge-towards-yearly-high-amidst-positive-whale-activity/",
    "description": "In a surprising turn of events, Ethereum ($ETH) has experienced a substantial surge today, delighting the Ethereum community with a notable 4% increase (currently at $2,104). As the cryptocurrency inches closer to its previous yearly high at $2,137, speculations are rife among market analysts, enthusiasts, and investors regarding the driving [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-02T01:54:20.000Z",
    "title": "DYDX Faces Market Headwinds Amidst Token Unlock Event and Whale Movements",
    "url": "https://nulltx.com/dydx-faces-market-headwinds-amidst-token-unlock-event-and-whale-movements/",
    "description": "The past week has witnessed a downward trend for DYDX, with a decline exceeding 10%, and recent whale activity has contributed to this negative sentiment, especially following the token unlock event today. A substantial amount of 150 million $DYDX ($505.5 million), constituting 81.63% of the circulating supply, was unlocked just [&#8230;]"
  }
]