[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T18:29:35.000Z",
    "title": "Jack Dorsey-Backed Bitcoin Wallet Bitkey To Integrate With Coinbase and Cash App",
    "url": "https://www.coindesk.com/tech/2023/06/15/jack-dorsey-backed-bitcoin-wallet-bitkey-to-integrate-with-coinbase-and-cash-app/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Public beta testing will begin in a few weeks according to parent company Block."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-15T18:16:37.000Z",
    "title": "Ripple, SEC Seem to Agree About Not Taking Hinman Speech Seriously",
    "url": "https://www.coindesk.com/policy/2023/06/15/ripple-sec-seem-to-agree-about-not-taking-hinman-speech-seriously/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ripple Labs and the U.S. Securities and Exchange Commission (SEC) seem to be on the same page about the documents known as the Hinman Emails: The former official’s past remarks shouldn’t govern current policy."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T18:26:27.000Z",
    "title": "Former FTX Ventures Head Amy Wu Turns to AI",
    "url": "https://decrypt.co/144795/former-ftx-ventures-head-amy-wu-turns-to-ai",
    "description": "Despite a dark episode at FTX Ventures, Wu has now joined Menlo Ventures to help spearhead its investments in AI and consumer tech."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T18:15:54.000Z",
    "title": "Colombia’s Central Bank Taps Ripple to Pilot CBDC",
    "url": "https://decrypt.co/144799/colombia-central-bank-ripple-cbdc",
    "description": "Colombia already makes use of Ripple's technology for land distribution efforts in the country."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T17:54:36.000Z",
    "title": "Ethereum Devs Cry Foul on Uniswap v4 'Open Source' Promises",
    "url": "https://decrypt.co/144802/ethereum-devs-cry-foul-on-uniswap-v4-open-source-promises",
    "description": "There's a few licenses that Ethereum devs consider the mark of a truly open source project. The one Uniswap chose for its v4 isn't one of them."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T17:29:05.000Z",
    "title": "AMD Debuts AI Chip to Challenge Nvidia",
    "url": "https://decrypt.co/144788/amd-debuts-ai-chip-to-challenge-nvidia",
    "description": "The company's new MI300X AI Chip will be a direct competitor to the dominance of Nvidia's H100."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T17:25:34.000Z",
    "title": "Crypto Heads East as Huobi HK Launches Trading Service in Hong Kong",
    "url": "https://decrypt.co/142955/crypto-heads-east-as-huobi-hk-launches-trading-service-in-hong-kong",
    "description": "Huobi has joined the Hong Kong Virtual Assets Consortium (HKVAC), while its Hong Kong arm now offers crypto spot trading and virtual asset custody."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T16:53:50.000Z",
    "title": "Bitcoin Whale Moves $1.2 Million After 13 Years of Inactivity",
    "url": "https://decrypt.co/144786/bitcoin-whale-moves-million-after-13-years",
    "description": "Some long-term investors are moving their stashes after years of remaining dormant."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T18:00:00.000Z",
    "title": "Ripple partners with Colombia’s central bank to explore blockchain technology",
    "url": "https://cointelegraph.com/news/ripple-partners-colombia-central-bank-explore-blockchain-technology",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/10baf9c4-db84-4caf-bc07-7e438d186a6d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The pilot program will run through 2023 with the intent of demonstrating blockchain utility to the general public. </p>\n                    <p><p>Banco de la República, Colombia’s central bank, is partnering with Peersyst and Ripple to pilot blockchain technology on the XRP ledger. </p><p>The Ministry of Information and Communications Technologies (MinTIC) in Colombia will oversee the project, which will use Ripple’s recently <a href=\"https://ripple.com/ripple-press/ripple-launches-cbdc-platform-for-the-development-of-cbdcs-and-stablecoins/\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> central bank digital currency (CBDC) platform. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ripple and <a href=\"https://twitter.com/Peersyst?ref_src=twsrc%5Etfw\">@Peersyst</a> are partnering with Colombia’s <a href=\"https://twitter.com/BancoRepublica?ref_src=twsrc%5Etfw\">@BancoRepublica</a> in conjunction with <a href=\"https://twitter.com/Ministerio_TIC?ref_src=twsrc%5Etfw\">@Ministerio_TIC</a> to pilot use cases that will enhance Colombia’s high-value payment system.<br><br>Learn more about the partnership: <a href=\"https://t.co/X9jyJ3pvDa\">https://t.co/X9jyJ3pvDa</a></p>&mdash; Ripple (@Ripple) <a href=\"https://twitter.com/Ripple/status/1669317477971505152?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>An announcement <a href=\"https://ripple.com/ripple-press/ripple-and-peersyst-partner-with-colombias-banco-de-la-republica-in-advancing-the-implementation-and-utilization-of-blockchain-technology/\" target=\"_blank\" rel=\"noopener nofollow\">published </a>on June 15 says the pilot will run through 2023 and states that its purpose is to demonstrate the technology’s utility to the public:</p><blockquote>“The goal of the third phase of MinTIC’s experimentation of blockchain will be to educate national and territorial public entities through interactive and collaborative real-world application experiments of how blockchain technology’s unparalleled speed, scalability, and transparency can revolutionize payment systems and data management.”</blockquote><p>The XRP ledger CBDC platform also serves as the basis for similar pilot projects in Hong Kong, Bhutan, Palau and Montenegro.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CBDC team making significant progress with the launch of the new <a href=\"https://twitter.com/hashtag/cbdc?src=hash&amp;ref_src=twsrc%5Etfw\">#cbdc</a> platform  Four countries now announced  Grateful to the team at <a href=\"https://twitter.com/Ripple?ref_src=twsrc%5Etfw\">@Ripple</a> who are developing the best platform for the future of Digital Currencies  Palau  Bhutan  Montenegro  Hong Kong …</p>&mdash; Antony Welfare (@AntonyWelfare) <a href=\"https://twitter.com/AntonyWelfare/status/1659436081358462976?ref_src=twsrc%5Etfw\">May 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple’s continued growth comes amid ongoing legal challenges stemming from a Securities and Exchange Commission (SEC) suit against the company filed in 2020. </p><p>The SEC alleges that Ripple sold $1.3 billion worth of unregistered securities in the form of its XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token. Ripple claims that XRP isn’t a security and that the SEC never gave it any notice or warning.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\"><strong><em>The SEC vs. Ripple lawsuit: Everything you need to know</em></strong></a></p><p>As Cointelegraph recently reported, the company also claims <a href=\"https://cointelegraph.com/news/defending-against-sec-to-cost-ripple-200m-ceo-brad-garlinghouse-says\">it spent $200 million defending itself</a> from the suit. While there’s currently no definitive answer to the question of when the trial will end, it’s widely believed that the release of the so-called “Hinman documents” could affect the remaining legal proceedings. </p><p><a href=\"https://cointelegraph.com/news/hinman-docs-unsealed-sec-concerned-over-ether-not-security-statement\">The Hinman documents</a> reference internal SEC communications related to a 2018 speech given by William Hinman, the former director of the SEC’s corporate finance division. During the speech, Hinman commented that cryptocurrencies such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) might start out as securities but could become commodities later once they become sufficiently decentralized. </p><p>At the time, <a href=\"https://cointelegraph.com/news/hinman-docs-unsealed-sec-concerned-over-ether-not-security-statement\">internal SEC notes indicated</a> that the commission was concerned Hinman’s comments could make it “difficult for the agency to take a different position on Ether in the future.” </p><p>While Himan’s speech was given before the SEC’s suit against Ripple and didn’t directly reference XRP, experts argue that it shows that even <a href=\"https://cointelegraph.com/news/hinman-documents-suggest-sec-is-the-wrong-agency-to-govern-digital-assets-crypto-lawyer-says\">the SEC understood there was confusion</a> surrounding the agency’s treatment of cryptocurrencies. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T17:26:42.000Z",
    "title": "Buying Bitcoin is preferable to BTC mining in most circumstances — Analysis",
    "url": "https://cointelegraph.com/news/buying-bitcoin-is-preferable-to-btc-mining-in-most-circumstances-analysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a14097af-f141-4f35-aab1-e9c41b2c5da0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Data suggests that investors are better off buying spot Bitcoin than attempting to mine it unless the market is in a mega bull run.</p>\n                    <p><p>While, intuitively, mining Bitcoin may appear like a highly profitable endeavor, research suggests otherwise. </p><p>After discovering Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), most users go down the rabbit hole and consider whether it is better to mine or buy Bitcoin directly. They usually give up on mining due to the cost and rigor of running ASIC miners, regulatory uncertainty and the lack of technical expertise. </p><p>Hypothetically, if people overcome the above challenges, they could enjoy advantages such as full autonomy over their operations and diversification of their crypto investment via physical hardware instead of directly purchasing Bitcoin, but the entire venture can be risky and labor intensive. </p><h2>To mine, or not to mine BTC?</h2><p>An analysis by Bitcoin mining data firm Hashrate Index <a href=\"https://hashrateindex.com/blog/mining-or-buying-bitcoin-what-is-the-most-profitable/\" target=\"_blank\" rel=\"noopener nofollow\">suggests</a> that “buying bitcoin is preferable to mining it in most circumstances.”</p><p>Jaran Mellerud, a Bitcoin mining analyst at Hashrate Index, calculated the projected earnings of miners in the next five years under various bullish and bearish scenarios. Mellerud found that miners will likely incur a loss even in optimistic Bitcoin price projections.</p><p>Mining is a dynamic business where hardware usually gets outdated within five years due to the introduction of more efficient machines in the market. </p><p>For instance, in the 2016-2017 bull market, the Bitmain S9 models were the most efficient miners. However, as more models entered the market, the S9s were phased out completely by the end of 2022, <a href=\"https://twitter.com/karimhelpme/status/1668592291962056704\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a recent finding by Coin Metrics analyst Karim Helmy.</p><p>Two Bitmain models in the S19j Pro and S19 XP class have dominated the mining sector in 2023. Mellerud calculated the returns assuming that the current batch of miners will be scrapped five years from now, around the 2028 <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter/amp\">Bitcoin halving</a>.</p><p>The analysis used a constant cost of electricity of $0.07 per kWh and varied the price of Bitcoin and the network’s hash rate to estimate the profit margins of the machines. </p><p>In his report, Mellerud wrote, “Hashrate tends to follow the <a href=\"https://data.hashrateindex.com/chart/bitcoin-hashprice-index?ref=hashrateindex.com\" target=\"_blank\" rel=\"noopener nofollow\">hashprice</a>, albeit with a lag during rapid bitcoin price increases.”</p><p>Notably, the electricity cost varies worldwide, and miners can also establish exclusive deals with energy generation companies that lock their costs for months, which may also entail a discount. Figures from a New York Times investigation <a href=\"https://www.nytimes.com/2023/04/09/business/bitcoin-mining-electricity-pollution.html\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> that Riot Platforms, a public Bitcoin miner, paid around $0.03 per kWh in Texas, while other industries paid around $0.07. </p><p>Mellerud said, “Mining is a no-brainer if you have access to electricity prices below $0.04 per kWh.”</p><h2>Five-year projections for Bitcoin miner returns</h2><p>Bitcoin miners are profitable only if they can recoup 100% of their capital spent in buying the machines, excluding operational costs. Any additional BTC that hardware brings to its owner is an additional gain.</p><p>For instance, if a Bitcoin-denominated investment of 1 BTC in mining rigs returns 0.9 BTC at the end of five years, buying BTC is preferable to mining. </p><p>Hashrate Index’s analysts found that miners will return north of 1 BTC only in the most bullish scenarios, where the Bitcoin price goes on to $500,000 per token by 2028 while the network’s hash rate grows 10% slower than its price.</p><p>Even in situations where Bitcoin reaches $250,000 by 2028 with a modest increase in its hash rate, the miners would only recoup 83% of the initial cost at best.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/cecdfbae-4a97-4e8d-8c19-1d22405a6d35.JPG\"><figcaption style=\"text-align: center;\"><em>Return on investment from Bitcoin miners denominated in BTC over the next five years. Source: Hashrate Index</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/160k-halving-btc-price-prediction-model-count-down-new-bitcoin-all-time-high\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/160k-halving-btc-price-prediction-model-count-down-new-bitcoin-all-time-high/amp\"><strong><em>$160K at next halving? Model counts down to new Bitcoin all-time high</em></strong></a></p><p>While Hashrate Index’s analysis relied on future projections, River Financial, a financial services firm specializing in Bitcoin mining research, <a href=\"https://river.com/learn/should-you-buy-miners-or-bitcoin/\" target=\"_blank\" rel=\"noopener nofollow\">looked</a> at historical data to find out whether mining was a better option than directly purchasing BTC. River Financial’s analysts found that in the last five years, owning miners was preferred 53.6% of the time. </p><p>The basis of the River Financial analysis is similar to that of Hashrate Index’s report — miners make a profit if Bitcoin’s price increases faster than the network’s hash rate over time or if the price decreases at a slower rate than the network’s hash rate.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b7273f74-d899-4b0f-9ea7-05a3b017f43a.jpg\"><figcaption style=\"text-align: center;\"><em>Times when Bitcoin mining was preferred (in gray) over direct BTC purchases (in white). Source: River Financial</em></figcaption></figure><p>However, one caveat of this analysis is that even during times when Bitcoin’s price is rising faster than the hash rate, the miners may still incur a loss due to the actual price being low. </p><p>Bearish periods have been <a href=\"https://cointelegraph.com/news/how-hard-has-this-bear-market-been-for-bitcoin-mining-watch-market-talks-on-cointelegraph\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-hard-has-this-bear-market-been-for-bitcoin-mining-watch-market-talks-on-cointelegraph/amp\">particularly tough on Bitcoin miners</a>. For instance, the period toward the end of 2022 is marked as preferable, while Bitcoin miners <a href=\"https://cointelegraph.com/news/bitcoin-mining-revenue-lowest-in-two-years-hash-rate-on-the-decline\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-mining-revenue-lowest-in-two-years-hash-rate-on-the-decline/amp\">recorded the lowest revenue levels</a> in two years with a <a href=\"https://cointelegraph.com/news/bitcoin-capitulations-abound-data-shows-realized-and-unrealized-losses-at-record-highs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-capitulations-abound-data-shows-realized-and-unrealized-losses-at-record-highs/amp\">significant wave of miner capitulations</a> during that time. </p><p>Both reports appear to agree that mining Bitcoin only makes the most sense right before parabolic bullish periods, with direct Bitcoin purchases being more profitable at all other times.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T17:00:00.000Z",
    "title": "Dubai's VARA approves OKX 'preparatory' license as part of exchange's expansion plans",
    "url": "https://cointelegraph.com/news/dubai-s-vara-approves-okx-preparatory-license-as-part-of-exchange-s-expansion-plans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ebd6bfee-96d7-442a-9fa7-5c373e03db0b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The middle eastern arm of the exchange said it had opened an office in the Dubai World Trade Center and planned to increase its staff to 30 people.</p>\n                    <p><p>The middle eastern arm of cryptocurrency exchange OKX reported Dubai’s Virtual Asset Regulatory Authority had granted the firm a minimal viable product preparatory license as part of its plans to expand into the region.</p><p>In a June 15 notice, OKX <a href=\"https://www.okx.com/learn/okx-receives-mvp-preparatory-license-from-vara\" target=\"_blank\" rel=\"noopener nofollow\">said</a> amid the regulator’s licensing approval, the exchange planned to increase its staff to 30 people in Dubai and had already opened an office in the city’s World Trade Center building. VARA <a href=\"https://cointelegraph.com/news/okx-to-extend-offers-in-dubai-after-securing-a-provisional-license\">granted OKX a provisional operating license</a> in July 2022 allowing the firm to offer products and services in the region.</p><p>“Licensing in Dubai is a critical element of OKX’s global regulatory compliance strategy,” said Tim Byun, OKX’s global head of government relations. “In today’s uncertain market environment, it's of the utmost importance for VASPs to be highly secure, transparent, compliant and backed by strong, clear regulation.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">OKX has received an MVP Preparatory License from Dubai&#39;s VARA, marking a pivotal step in our strategic UAE expansion. <br><br>New hires, new office &amp; extended partnerships—we&#39;re proud to shape the Web3 &amp; crypto landscape in the Middle East. <br><br>Learn more: <a href=\"https://t.co/9Akhh88JP4\">https://t.co/9Akhh88JP4</a> <a href=\"https://t.co/HmHd8CMq4y\">pic.twitter.com/HmHd8CMq4y</a></p>&mdash; OKX (@okx) <a href=\"https://twitter.com/okx/status/1669284887646420992?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to OKX, the preparatory license gave the exchange the regulatory leeway to fulfill certain requirements before becoming operational. The firm said it planned to provide spot, derivatives, and fiat services as well as U.S. dollar and United Arab Emirates dirham deposits, withdrawals, and spot-pairs.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/war-of-words-okx-takes-a-subtle-jab-at-coinbase-in-new-ad-campaign\"><strong><em>War of words: OKX takes a subtle jab at Coinbase in new ad campaign</em></strong></a></p><p>Global crypto firms including Coinbase have <a href=\"https://cointelegraph.com/news/coinbase-execs-visit-uae-to-test-potential-of-strategic-hub-for-international-operations\">made efforts to explore the UAE</a> as a potential new market amid U.S. regulators and lawmakers cracking down on digital assets. In June, the U.S. Securities and Exchange Commission filed separate lawsuits against both Coinbase and Binance, and New York Attorney General Letitia James <a href=\"https://cointelegraph.com/news/new-york-bans-coin-ex-exchange-seizes-1-7m-crypto-assets\">announced a ban</a> on CoinEx from operating in the state.</p><p>The move into the middle east followed OKX announcing in March it <a href=\"https://cointelegraph.com/news/okx-to-cease-operations-in-canada-by-june-22-2023\">planned to cease operations</a> in Canada by June 22, but added the withdrawal was “temporary”. Other crypto exchanges including Binance and Paxos have <a href=\"https://cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules\">announced similar departures</a> from Canada, citing guidelines from the country’s regulators.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-dubai/\"><strong><em>Crypto City: Guide to Dubai</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T16:47:00.000Z",
    "title": "Ripple verdict could spark a new bull market — Or more malaise",
    "url": "https://cointelegraph.com/news/ripple-verdict-bull-market-more-malaise",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3abe182d-cd3b-4e34-896b-5cc4317584c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SEC v. Ripple is a landmark legal battle that is going to shape how courts treat cryptocurrencies — and a ruling is due soon.</p>\n                    <p><p>The final quarter of 2020 saw the launch of a <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-us-cz-put-funds-at-risk\">precedent-setting lawsuit</a> by the United States Securities and Exchange Commission against Ripple Labs, CEO Bradley Garlinghouse and co-founder Christian A. Larsen. The allegation: raising north of $1 billion in 2013 through the unregistered sale of a purported security, XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>).</p><p>The implications of Ripple’s bold choice to challenge the lawsuit in court radiate far beyond the company. The judgment could become the Rosetta Stone for determining whether other cryptocurrencies are deemed securities. A Ripple victory could fuel a new era of acceptance, investment and confidence in digital assets.</p><p>Defeat, on the other hand, could hinder mainstream adoption, prompt the SEC to pursue similar cases, increase market volatility, and drain talent from the United States.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-charges-binance-coinbase-terrible-defi\"><strong><em>SEC charges against Binance and Coinbase are terrible for DeFi</em></strong></a></p><p>The timing of this potential landmark decision dovetails with a season of <a href=\"https://cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security\">intense scrutiny by the SEC</a> under the leadership of Chairman Gary Gensler. </p><h2>Ripple and XRP in the eye of the storm</h2><p>Ripple, the payment company behind XRP, introduced the cryptocurrency token in 2013. Designed to facilitate fast, low-cost cross-border transactions, XRP stands as a potential replacement for the existing SWIFT system.</p><p>Ripple has entrenched its value in the financial landscape by establishing partnerships with top-tier institutions, such as American Express, Santander and MoneyGram, and processed transactions exceeding<a href=\"https://ripple.com/insights/q4-2021-xrp-markets-report/\" target=\"_blank\" rel=\"noopener nofollow\"> $10 billion</a> in 2021 alone. </p><p>The SEC’s <a href=\"https://cointelegraph.com/news/sec-unveils-1-3b-suit-against-ripple-over-xrp\">allegation revolves around Ripple’s purported unregistered sale</a> of XRP, an investment contract or “security” by their definition. Ripple’s defense, however, asserts that XRP doesn’t pass the<a href=\"https://www.sec.gov/corpfin/framework-investment-contract-analysis-digital-assets\" target=\"_blank\" rel=\"noopener nofollow\"> Howey test</a> — the measure of an investment contract — and, therefore, cannot be considered a security. </p><p>The court case, then, hinges on this perennial question: Is XRP a security? </p><h2>All eyes on the Hinman documents</h2><p>The turbulent dispute between the SEC and Ripple is expected to <a href=\"https://cointelegraph.com/news/ripple-xrp-lawyer-outright-sec-victory-three-percent\">conclude in September</a>. Before then, the Ripple community’s attention will be on June 13, when the <a href=\"https://cointelegraph.com/news/sec-seeks-to-keep-hinman-documents-hidden-in-ripple-case\">Hinman materials are unsealed</a>, which could have a significant implication on the verdict.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The emails wont change the Howey analysis but they will likely show the difficulty in applying 1930s/40s precedent to modern day technology. The emails will likely help <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> and <a href=\"https://twitter.com/Ripple?ref_src=twsrc%5Etfw\">@ripple</a> in the Court of Public Opinion and hopefully drive bipartisan efforts in Congress. <a href=\"https://t.co/DfpZaLgw4O\">https://t.co/DfpZaLgw4O</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1667906707102523395?ref_src=twsrc%5Etfw\">June 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>These documents refer to a 2018 speech by SEC Director William Hinman, during which he provided guidance on how the SEC might analyze whether a particular cryptocurrency should be considered a security. This guidance became significant in the Ripple case, as Ripple’s defense argued that Hinman’s statements bred confusion, leading market participants, including Ripple, to believe that XRP was not a security. </p><p>Cue a desperate scramble by the SEC in December 2022 to<a href=\"https://www.dropbox.com/s/0uullf9dlvxz3lm/SEC%20Motion%20to%20Seal%20Summary%20Judgment%20Documents.pdf?dl=0\" target=\"_blank\" rel=\"noopener nofollow\"> seal</a> said documents and shield them from public scrutiny — documents that Ripple believes are pivotal to its victory against the regulator. </p><h2>Implications of the verdict</h2><p>This face-off between Ripple and SEC transcends the future of XRP. It’s a high-stakes drama that could very well be the defining moment for the cryptocurrency industry. In 2022, the SEC’s Gensler<a href=\"https://cointelegraph.com/news/crypto-lawyers-flame-gensler-over-claims-that-all-crypto-are-securities\"> stated</a> that “many [cryptocurrencies] are securities,” signaling the regulator’s intent to scrutinize more digital assets. </p><p>The implications fall into four main categories.</p><ul><li><strong>Adoption and Innovation: </strong>A Ripple win could foster increased consumer and institutional trust in digital assets. It could spur investment in the space, emboldening enterprises to create groundbreaking products and services within a clarified regulatory framework. A loss could hinder mainstream acceptance as regulatory uncertainties continue to deter potential participants. </li></ul><ul><li><strong>Legal</strong> <strong>Precedent:</strong> If Ripple wins, it could strengthen the argument against categorizing cryptocurrencies as securities, providing the industry with greater legal clarity and a solid footing for future growth. If Ripple loses, it may prompt further SEC investigations into potential securities violations. We’re already witnessing this trend with the case against Coinbase, Binance and Tron founder Justin Sun. </li></ul><ul><li><strong>Market Volatility:</strong> A Ripple victory could boost investor confidence, potentially inflating the value of digital assets, whereas a loss might spark market volatility, leading to a sell-off of XRP and other digital assets perceived as securities. </li></ul><ul><li><strong>Talent Migration:</strong> Should the SEC emerge victorious, it may spur a talent exodus out of the U.S. toward countries with greater regulatory clarity; a <a href=\"https://cointelegraph.com/news/us-has-left-a-vacuum-that-other-countries-are-eager-to-fill-coinbase\">trend that’s already noticeable</a>, with Ripple themselves actively looking to make the leap.</li></ul><h2>The end is near</h2><p>Attorney John Deaton, founder of CryptoLaw, has been a staunch advocate for Ripple against the SEC. In a June 3 <a href=\"https://www.youtube.com/watch?v=Wc5nbPb4-cw\" target=\"_blank\" rel=\"noopener nofollow\">interview</a>, he predicted a 25% chance of District Judge Analisa Torres ruling in favor of Ripple and a 50% chance of a “middle ground” verdict. But with <a href=\"https://cointelegraph.com/news/sec-gensler-parallels-binance-ftx-sued\">Binance</a> and <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase</a> now on the SEC guillotine, these predictions might need to be reconsidered.</p><p>Garlinghouse remains optimistic about the verdict but, ultimately, “betrayed” by a regulator who’s given them conflicting guidance. A sentiment that’s been echoed across the crypto landscape in the United States. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elizabeth-warren-wants-the-police-at-your-door-in-2024\"><strong><em>Elizabeth Warren wants the police at your door in 2024</em></strong></a></p><p>The U.S. has long been the go-to destination for ambitious startups, the home of breakthrough innovations — a global leader across multiple industries. But the U.S.’ approach toward progressing the crypto industry goes against these historical precedents of providing supportive regulatory environments and promoting growth. </p><p>With such high stakes for investor confidence, legal clarity and global talent migration, the SEC v. Ripple case is a landmark battle that could shape the future of the cryptocurrency landscape in the United States. </p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Hamilton Keats</strong> is CEO and co-founder of Krayon Digital, a provider of MPC-based digital asset wallets. Prior to building Web3 infrastructure with Krayon, Hamilton co-founded Platform One, a London-based wealth management platform, and worked at HSBC and DVB Bank. He holds a B.Sc. in physics from the Imperial College London.</div></div><p>Its outcome could either foster a new era of innovation and mainstream acceptance of digital assets or unleash a wave of market turbulence and an exodus of U.S.-based crypto firms seeking more favorable jurisdictions with clearer guidelines. </p><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T18:23:05.000Z",
    "title": "DeBridge launches DLN Trade, enabling secure cross-chain trading without liquidity pools",
    "url": "https://cryptoslate.com/debridge-launch-dln-trade-enabling-secure-cross-chain-trading-without-liquidity-pools/",
    "description": "<p>Cross-chain infrastructure developer deBridge has launched DLN Trade, according to a press statement shared with CryptoSlate. DLN is an advanced non-custodial cross-chain exchange that enables fast and secure native trading across chains without liquidity pools. According to the press statement, DLN revolutionizes cryptocurrency trading by harnessing a global liquidity engine that creates a decentralized order [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/debridge-launch-dln-trade-enabling-secure-cross-chain-trading-without-liquidity-pools/\">DeBridge launches DLN Trade, enabling secure cross-chain trading without liquidity pools</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T17:34:42.000Z",
    "title": "Prometheum, a SEC-registered broker-dealer, sets Twitter ablaze with speculation: here’s what you need to know",
    "url": "https://cryptoslate.com/prometheum-a-sec-registered-broker-dealer-sets-twitter-ablaze-with-speculation-heres-what-you-need-to-know/",
    "description": "<p>Crypto firm Prometheum&#8217;s co-founder and co-CEO Aaron Kaplan testified before the U.S. Financial Services House Committee on June 13 The &#8220;full-service market&#8221; crypto brokerage gained the spotlight after Kaplan took a pro-SEC stance in his testimony, in stark contrast to the majority of industry leaders. Kaplan&#8217;s testimony set the Twitter space ablaze with curiosity about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/prometheum-a-sec-registered-broker-dealer-sets-twitter-ablaze-with-speculation-heres-what-you-need-to-know/\">Prometheum, a SEC-registered broker-dealer, sets Twitter ablaze with speculation: here&#8217;s what you need to know</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T16:52:57.000Z",
    "title": "CoinEx agrees to pay over $600k fine to New York",
    "url": "https://cryptoslate.com/coinex-agrees-to-pay-over-600k-fine-to-new-york/",
    "description": "<p>Hong Kong-based crypto exchange CoinEx has agreed to pay over $600,000 in penalties and refund $1.17 million to New York investors, according to a June 15 statement. CoinEx would make the refund to its 4,691 New York investors in cryptocurrencies over the next 90 days. Additionally, the exchange has been banned from offering, selling, or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinex-agrees-to-pay-over-600k-fine-to-new-york/\">CoinEx agrees to pay over $600k fine to New York</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T18:15:00.000Z",
    "title": "LEVEL : The Omnichain Liquidity Marketplace Launches on Arbitrum",
    "url": "https://cryptodaily.co.uk/2023/06/level-the-omnichain-liquidity-marketplace-launches-on-arbitrum",
    "description": "<p>Since inception, LEVEL has designed a protocol to serve as a functional alternative to centralized counterparty risk. After half a year of product testing, it&rsquo;s finally time to expand, and the LEVEL DAO has determined that Arbitrum will be the next ecosystem where Level will be deployed on.</p>\n<p>LEVEL&rsquo;s Success Story</p>\n<p>LEVEL has experienced phenomenal growth. In just the first month, LEVEL witnessed a notable $320 million in volume traded, generating over $400k in fees and bringing in more than 1000 community members.</p>\n<p>As a testament to the product-market fit they found, it took just 55 days for the ecosystem to hit $1 billion in trading volume, leading to collecting $8.3 million in fees during that time &ndash; going from strength to strength with over $20 billion traded in the first half of 2023 alone!&nbsp;</p>\n<p>&nbsp;</p>\n<p>Impressively, the most significant daily trading volume was $339 million on April 14, 2023, accounting for around a third of the total volume across Perp DEXs (Delphi Digital).</p>\n<p>A Quick Look On-Chain</p>\n<p>Total Volume: $17.4 billion, of which leverage trading volume accounts for $14.5 billion</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Total Collected Fees: &gt;$22 million&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Interestingly, these collected fees are distributed to:</p>\n<ul>\n<li>LLPs (supply-side revenue) = 45%</li>\n<li>LVL Stakers (protocol revenue) = 10%</li>\n<li>LGO Stakers (protocol revenue) = 10%</li>\n<li>DAO Treasury (protocol revenue - redeemable against LGO) = 30%</li>\n<li>Reserved for Protocol Development (5%)</li>\n</ul>\nAssets Under Management (AUM): $30 million\n<p></p>\n<p>During this time, LEVEL has established itself as the leading perpetual decentralized exchange (DEX) on BNB Chain, rivaling even the likes of GMX &ndash; a significant achievement considering the difference in total value locked (TVL) and market cap.&nbsp;</p>\n<p>&nbsp;</p>\n<p></p>\n<p>Setting itself apart from competitors, LEVEL wrote its own codebase from scratch and pioneered the tranche system in DeFi. By leveraging its innovative dual tokenomics model (LVL and LGO), which perfectly fits a perpetual DEX platform, LEVEL has created a strong protocol growth flywheel, reflected in the simultaneous growth of platform volume and Treasury assets. This has resulted in achieving close to $10M in treasury liquid assets.</p>\n<p></p>\n<p>Last but not least, LEVEL is taking DeFi on-chain governance to the next level, with more than 19 DAO Proposals submitted.</p>\n<p>Truly decentralized governance, driving rapid iteration in product and incentive models for a fast-paced marketplace.</p>\nWhy Arbitrum?&nbsp;\n<p>Even at a glance, Arbitrum looked like the most immediate choice for LEVEL, and this sentiment resonated with the majority of their community.</p>\n<p>All new possible chains were evaluated according to their:</p>\n<ul>\n<li>Liquidity</li>\n<li>User profile</li>\n<li>Daily active users</li>\n<li>Daily number of TXs</li>\n</ul>\n<p>Arbitrum crushes all of these criteria, securing itself as the fourth chain by TVL, thanks to its deep liquidity and a DeFi-native user base. An equally important factor included the sustained growth of unique addresses in the network, even after the ARB Airdrop.</p>\n<p>&nbsp;</p>\n<p>Many critics speculated that activity on Arbitrum would sink after the airdrop. Nonetheless, the daily transactions on the network are steadily increasing, averaging around 1m per day &mdash; close to ATH if one does not take into account the days of the airdrop.</p>\n<p>&nbsp;</p>\n<p>Considering these factors, it is understandable why the DAO voted for Arbitrum, securing 53% of the total votes across 4 options.</p>\n<p>&nbsp;</p>\n<p>Arbitrum is the home of DeFi, and a place full of open collaboration. The composable nature of DeFi on Arbitrum offers endless possibilities for new products and partnerships with other protocols. Some remarkable examples include:</p>\n<ul>\n<li>Yield Aggregators</li>\n<li>Money Markets</li>\n<li>Other Derivatives (e.g., hedging, structured products)</li>\n</ul>\n<p>Furthermore, this Layer 2 protocol is a fantastic fit for LEVEL as it houses a native niche of perp DEX traders who can benefit from the ecosystem&rsquo;s incentivized program for traders, shrewdly configured to drive protocol and treasury growth.</p>\n<p>While the expansion to Arbitrum is the project&rsquo;s main priority, LEVEL is not stopping there. LEVEL will continue to expand in its goal to become a key piece of the wider omnichain infrastructure.</p>\nPractical Developments\n<p>Cross-chain infrastructure is being built to cement the marketplace as an omnichain protocol.&nbsp;</p>\n<p>As part of these developments, LEVEL is migrating the LVL and LGO tokens to the &lsquo;Omnichain Fungible Token&rsquo; (OFT) standard.</p>\n<p>The ultimate goal is to enable the cross-chain aggregation of fees distributed to its stakeholders so that LEVEL users can earn yield anywhere in the ecosystem.</p>\n<p>The DAO treasury will also be united across the entire ecosystem, meaning LGO redemptions against the treasury will occur on all chains.</p>\n<p>Following the recently approved proposal, LEVEL is utilizing LayerZero&rsquo;s technology to bridge 5M LVL to Arbitrum, to bootstrap liquidity and trader activity through auctions and other incentive programs.</p>\nThey have also begun migrating:\n<ul>\n<li>LVL/USDT Liquidity &mdash; to make LVL tokens more accessible to users on Arbitrum, LEVEL migrating the entire LVL/USDT pool (currently ~ $713,214) to Trader Joe Arbitrum ensures that new users trading for the first time will have the liquidity to access LVL tokens.&nbsp;</li>\n<li>LEVEL Trading Pool Liquidity &mdash; enabling access to all trading features, migrating 3,555,192 Senior LLP (currently ~ $4,061,500) from the BNB Chain to seed trading liquidity on Arbitrum (50% of the protocol-owned Senior LLP supply).</li>\n</ul>\n<p>Future Plans</p>\n<p>When it comes to future footprints, a key priority for Level Protocol is for the DAO to steer Level&rsquo;s journey towards exceptional growth.</p>\n<p>LEVEL also remains committed to delivering an exceptional user experience, ensuring that their customers receive premium service and can trade using a top-notch UX.</p>\n<p>Further solidifying its position in the DeFi space, LEVEL is actively seeking, discussing, and moving forward with several partnerships with additional Tier-1 projects, enabling them to expand its reach and utility across the industry.</p>\n<p>LEVEL's success to date was achievable through the tremendous support from its community of users. Expanding to a cross-chain liquidity marketplace, the marketplace will release a first-in-kind utility-based NFT in just 60 days. All of these unique items will be exclusively for LEVEL's community of users, with allocation retroactively determined based on interactions with the protocol on both Arbitrum and BNB Chain.</p>\n<p>Three categories will correspond to the three main facets of LEVEL:</p>\n<ul>\n<li>Stock Broker's Vest, Earned through proving yourself as a trader. The life blood of any financial hub, a Trader needs to look the part at his desk.</li>\n<li>Auctioneer's Hammer &ndash;A key group of mechanisms at LEVEL, Auctions serve to widen the reach of the ecosystem as a whole. Embody the power of the Auctioneer with their Hammer.</li>\n<li>Tattered Farmer's Hat &ndash; LEVEL wouldn&rsquo;t we be anywhere without liquidity. LPs take on risk enabling the entire marketplace to function. It ain&rsquo;t much, but it&rsquo;s honest work.</li>\n</ul>\n<p>LEVEL's vision is to become a leading omnichain trading platform, and their recent expansion to Arbitrum marks the first step towards realizing this goal.</p>\n<p>Expanding their services into other DeFi sectors is another avenue they are exploring. The goal is to become a multi-chain liquidity aggregator where fragmented liquidity across different ecosystems can be unified in a single pool, allowing users to trade, swap, and borrow seamlessly.</p>\n<p>LEVEL is excited to embark on this omnichain journey, transforming the way people engage with DeFi and revolutionizing their trading experience.</p>\nStep into the LEVEL Ecosystem!\n<ul>\n<li>Trade a range of blue chip assets on LEVEL now!</li>\n<li>Buy LVL and begin participating in our ecosystem</li>\n</ul>\n\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T17:00:43.000Z",
    "title": "Blk DNM Introduces Intelligence Into Clothing With Blockchain, In First Use Of ‘Connected Fashion’",
    "url": "https://cryptodaily.co.uk/2023/06/blk-dnm-introduces-intelligence-into-clothing-with-blockchain-in-first-use-of-connected-fashion",
    "description": "<p>Stockholm, Sweden, June 15th, 2023, Chainwire</p><p class=\"ql-align-justify\">BLK DNM bridging the Physical and Virtual Worlds of Fashion through Blockchain Innovation</p><p class=\"ql-align-justify\">Swedish-American fashion brand BLK DNM today unveils the first-ever example of connected fashion (garments that exist both physically and virtually, each aspect &lsquo;twinned&rsquo; via technology) with the launch of BLK DNM Society and integration of blockchain-powered hardware and software into its products.</p><p class=\"ql-align-justify\">BLK DNM Society, built on tech designed by blockchain innovator and BLK DNM owner ChromaWay, will grant each garment a unique and recordable identity in both the physical and virtual worlds, while also rewarding ethical behaviour and granting brand influence to owners.</p><ul><li class=\"ql-align-justify\">Blockchain-powered &lsquo;digital garment ID&rsquo; microchips will give each item a unique identity and record of its history</li><li class=\"ql-align-justify\">Chips form the hardware element of BLK DNM Society, which launches in tandem and rewards responsible behavior and ownership</li><li class=\"ql-align-justify\">Tech will first appear in BLK DNM&rsquo;s FW 2023 collection</li></ul><p class=\"ql-align-justify\">The Hardware: Digital Garment IDs</p><p class=\"ql-align-justify\">Future BLK DNM clothing will be fitted with a &lsquo;digital garment ID&rsquo; - an undetectable chip that gives each physical item a unique and recordable identity. Some of the first features of the digital garment IDs will include:</p><ul><li class=\"ql-align-justify\">Authentication of the garment as genuine, eliminating fakes and counterfeiting</li><li class=\"ql-align-justify\">Rewarding responsible behaviours of treasuring and caring for clothing long-term, such as refurbs and second-hand purchases</li><li class=\"ql-align-justify\">Recording each individual garment's unique history - owners, events and places worn, repairs and alterations - enabling the item to accrue emotional and monetary value over time</li><li class=\"ql-align-justify\">Acting as a digital ticket for entry to events</li><li class=\"ql-align-justify\">Access to and voting rights within BLK DNM Society</li></ul><p class=\"ql-align-justify\">BLK DNM Society</p><p class=\"ql-align-justify\">The digital garment IDs are the first hardware elements of BLK DNM Society, which launches in tandem. The first example of connected fashion, BLK DNM Society is a community of BLK DNM owners, connected virtually by their physical items, who are rewarded for responsible behaviours and are granted voting rights on key brand decisions based on item ownership - thereby beginning the first ever process of decentralising a fashion brand&rsquo;s stewardship.</p><p class=\"ql-align-justify\">Each digital garment ID will create a &lsquo;digital reflection&rsquo; of the physical garment: a twin in the virtual world where the physical item&rsquo;s history and place within BLK DNM Society is recorded. The digital reflection can also be worn in the metaverses, catering especially to younger generations whose identities in virtual worlds are equally as important as in the physical.</p><p class=\"ql-align-justify\">FW 2023</p><p class=\"ql-align-justify\">Digital garment IDs will be revealed at BLK DNM&rsquo;s FW event in Paris on June 21st. For this first collection, the chips will be embedded in only leather items, with subsequent collections introducing more items to BLK DNM Society through embedded blockchain-enabled hardware.</p>Henrik Hjelte, CEO and Co-founder of ChromaWay, comments: &ldquo;This is totally futuristic. Nothing like this has been attempted in fashion before. It&rsquo;s very exciting for us, after much hard work, to see our technology elevating one of fashion&rsquo;s iconic brands into something completely unique. This has the potential to transform people&rsquo;s relationships with the clothes they wear and the brands they buy. No longer does the relationship with the customer end at the checkout. And each beautiful garment now becomes its own living, evolving piece of history.&rdquo;<p class=\"ql-align-justify\"></p><p>Toni Collin, CEO of BLK DNM, and Henrik Hjelte, CEO and Co-founder of ChromaWay</p>Toni Collin, CEO of BLK DNM, comments: &ldquo;BLK DNM&rsquo;s philosophy is one of community, and our clothing is designed, through both its craftsmanship and timeless aesthetic, to be treasured and passed down through generations - the antithesis of irresponsible fast fashion. Now, with the introduction of BLK DNM Society and the first embedded hardware in our garments, we take those two pillars to a revolutionary new level. By embedding intelligence in every item, we hope we can inspire our industry to join us in using connected fashion to do better.&rdquo;<p>About BLK DNM</p><p class=\"ql-align-justify\">BLK DNM is a Swedish-American fashion brand that specialises in timeless tailoring, leather, and denim of extraordinary quality. Following its 2023 relaunch as an entry-luxury fashion house under the stewardship of new Creative Director Jessy Heuvelink, BLK DNM&rsquo;s focus on both enduring craftsmanship and aesthetic timelessness encourages customers to love and treasure each item for decades and across generations.</p><p>About ChromaWay</p><p>ChromaWay is an industry leader in blockchain technology and specializes in creating and deploying cutting-edge, scalable blockchain solutions for both businesses and governments. The company, which was established in 2014 and has its headquarters in Stockholm, Sweden, has been at the forefront of driving the widespread adoption of blockchain technology. Its flagship product, relational blockchain Chromia, enables developers to build decentralized applications (dApps) with a relational database model that offers unprecedented scalability and flexibility.</p>ContactFati HakimFati.Hakim@ChromaWay.com"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-15T17:30:10.000Z",
    "title": "50 Dormant Bitcoins Worth $1.25 Million Wake Up After 12-Year Slumber",
    "url": "https://news.bitcoin.com/50-dormant-bitcoins-worth-1-25-million-wake-up-after-12-year-slumber/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"50 Dormant Bitcoins Worth $1.25 Million Wake Up After 12-Year Slumber\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sleep.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A dormant Bitcoin address holding 50 Bitcoin, valued at approximately $1.25 million, suddenly sprang to life on June 15 after being inactive since June 21, 2010. This month has seen only one 2010 block reward transfer, with the previous two taking place on May 22, 2023. $1.25 Million in Bitcoin Moves After a Decade of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T18:31:05.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T18:20:50.000Z",
    "title": "Mayor Francis Suarez signals intent to run for US presidency in 2024",
    "url": "https://www.cryptopolitan.com/mayor-francis-suarez-signals-run-presidency/",
    "description": "Miami Mayor Francis Suarez, a prominent advocate for cryptocurrencies, has officially declared his candidacy for the United States presidency in 2024. By filing the necessary paperwork with the U.S. Federal Election Commission on June 14, Suarez has joined a growing list of contenders seeking the Republican nomination, including former President Donald Trump and Florida Governor ... <a title=\"Mayor Francis Suarez signals intent to run for US presidency in 2024\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mayor-francis-suarez-signals-run-presidency/\" aria-label=\"More on Mayor Francis Suarez signals intent to run for US presidency in 2024\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T18:14:09.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T17:22:46.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T17:19:14.000Z",
    "title": "Ripple and Colombia’s central bank collaborate to enhance payment system",
    "url": "https://www.cryptopolitan.com/ripple-and-colombias-central-bank-collaborate-to-enhance-payment-system/",
    "description": "Ripple, a global leader in blockchain solutions, has teamed up with Banco de la República, Colombia&#8217;s central bank, to explore the potential use cases of blockchain technology in the country&#8217;s high-value payment system. This collaboration aims to drive innovation and efficiency in Colombia&#8217;s financial landscape, leveraging Ripple&#8217;s Central Bank Digital Currency (CBDC) platform to revolutionize ... <a title=\"Ripple and Colombia&#8217;s central bank collaborate to enhance payment system\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-and-colombias-central-bank-collaborate-to-enhance-payment-system/\" aria-label=\"More on Ripple and Colombia&#8217;s central bank collaborate to enhance payment system\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T17:14:19.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T17:06:24.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T17:01:22.000Z",
    "title": "Breaking: 20 countries now vying for BRICS membership",
    "url": "https://www.cryptopolitan.com/20-countries-now-vying-for-brics-membership/",
    "description": "BRICS, the economic bloc comprising Brazil, Russia, India, China, and South Africa, has sparked international interest, becoming a central player on the world stage. Ahead of the upcoming BRICS Summit, a significant development has come to the fore: nearly two dozen nations have expressed their keen interest in joining this influential alliance. This unprecedented surge ... <a title=\"Breaking: 20 countries now vying for BRICS membership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/20-countries-now-vying-for-brics-membership/\" aria-label=\"More on Breaking: 20 countries now vying for BRICS membership\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T16:51:08.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 If you are the coin you buy, what would you be? With this WRX Price Prediction, is there a chance you can be this crypto? In this continued effort to provide transparency to users &#38; safeguard their assets, they have launched another edition of their Transparency Report. Developments covered in the ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T16:50:54.000Z",
    "title": "BlackRock set to file Bitcoin ETF application in partnership with Coinbase",
    "url": "https://www.cryptopolitan.com/blackrock-set-to-file-bitcoin-etf-application-in-partnership-with-coinbase/",
    "description": "BlackRock, the world&#8217;s largest asset manager with $9 trillion in assets under its control, is on the verge of submitting an application for a Bitcoin exchange-traded fund (ETF), according to reports. However, this move by BlackRock marks a potential breakthrough in the cryptocurrency industry, as the company aims to provide institutional investors with a regulated ... <a title=\"BlackRock set to file Bitcoin ETF application in partnership with Coinbase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-set-to-file-bitcoin-etf-application-in-partnership-with-coinbase/\" aria-label=\"More on BlackRock set to file Bitcoin ETF application in partnership with Coinbase\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T18:30:00.000Z",
    "title": "Polygon price in red, PEPE surges, and tradecurve shows bullish patterns",
    "url": "https://crypto.news/polygon-price-in-red-pepe-surges-and-tradecurve-shows-bullish-patterns/",
    "description": "While polygon is under pressure, PEPE is gaining momentum, and Tradecurve is showing promising bullish patterns"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T17:44:03.000Z",
    "title": "CoinEx faces New York ban, ordered to pay $1.7m in penalties",
    "url": "https://crypto.news/coinex-faces-new-york-ban-ordered-to-pay-1-7m-in-penalties/",
    "description": "Following a lawsuit, CoinEx, a cryptocurrency platform, has been prohibited from conducting operations in both New York and the US. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T17:14:57.000Z",
    "title": "Mark Cuban calls for simplified SEC crypto regulations",
    "url": "https://crypto.news/mark-cuban-calls-for-simplified-sec-crypto-regulations/",
    "description": "Mark Cuban has recently aired his concerns over the complex and ambiguous nature of current SEC regulations concerning cryptocurrencies and related startups."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T16:56:04.000Z",
    "title": "Ripple CTO says large XRP holdings does not make it centralized",
    "url": "https://crypto.news/ripple-cto-says-large-xrp-holdings-does-not-make-it-centralized/",
    "description": "Recently, a tweet from David Schwartz, the chief technology officer at Ripple, sparked a debate about the decentralization of XRP and Ripple's influence over it."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T16:44:27.000Z",
    "title": "South Korea’s largest commercial banks exploring security token platforms",
    "url": "https://crypto.news/south-koreas-largest-commercial-banks-exploring-security-token-platforms/",
    "description": "NongHyup Bank revealed that the leading banks in South Korea, including Industrial Bank of Korea, Shinhan Bank, and Woori Bank, have joined its consortium for security token offerings."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T18:00:47.000Z",
    "title": "Bitcoin Headed for Another Crash? Over $100 Billion in Liquidations Suggests Trouble Ahead",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-headed-for-another-crash-over-100-billion-in-liquidations-suggests-trouble-ahead/",
    "description": "Bitcoin (BTC), the largest cryptocurrency in the market, was expected to continue its bull run after consolidating its gains. However, on June 14th, just before its daily close, Bitcoin suffered a 3% decline, dropping below $25,000 and reaching as low as $24,700, a price level not seen since mid-March. In light of these developments and the mounting regulatory pressure from the US Securities and Exchange Commission (SEC) on the nascent industry, many are starting to believe that the recent bull run for BTC was nothing more than a fakeout. Related Reading: XRP Exhibits Bearish Chart Pattern – Where Could The Price Head Next? Bitcoin On The Brink With Massive Amount Of Liquidations Looming Bitcoin has been facing a lot of turbulence recently, and the troubles don&#8217;t seem to be stopping anytime soon.  The latest data shows that Bitcoin is facing trouble as over $100 billion in liquidations loom, signaling the potential for another crash in the cryptocurrency market. Despite attempting to surpass its nearest resistance levels, Bitcoin has been struggling, with the potential for further downside movements and increased selling pressure. According to the latest data provided by the trader and crypto analyst under the pseudonym “Bleeding Crypto”, there is a total of $63.9 billion worth of liquidations at the $24,200 price level and $52.3 billion worth of liquidations at the $21,800 mark. The increased selling pressure in Bitcoin could potentially result in further liquidations and a subsequent crash in the cryptocurrency&#8217;s price, delaying any further uptrends and causing a return to the lower price levels seen at the beginning of the year. This could induce fear among investors, further fueling short positions and potentially leading to a vicious cycle. However, if that&#8217;s the case, it&#8217;s important to note that there&#8217;s also a possibility of a contrary situation, where institutional investors hunt for short position liquidations, leading to a surge in buying pressure and propelling the price of Bitcoin to the upside. BTC’s Open Interest Skyrockets Crypto analyst and Crypto Quant author Maartun has recently warned that volatility is incoming in the world of Bitcoin. According to him, although BTC’s price has been going sideways, the open interest in the cryptocurrency has increased by $439 million. Maartun’s analysis suggests that a significant amount of money is being poured into the market, which could lead to a significant increase in volatility. Maartun notes that this situation differs from previous occasions, as the funding rates for Bitcoin are trending down and are close to neutral. This means that longs and shorts are in almost perfect balance, creating a situation where any significant move in either direction could trigger a cascade of buying or selling. Open interest refers to the total number of outstanding contracts in a particular market yet to be settled. In the case of Bitcoin, an increase in open interest typically indicates that more traders are entering the market, which could lead to increased volatility.  The impact of the increase in open interest on Bitcoin&#8217;s price and market direction is unclear. While an increase in open interest can suggest a growing interest in Bitcoin and potentially lead to upward price movements, it can also lead to greater volatility and downward price movements if the market sentiment turns negative. Alternately, according to the latest data from Glassnode, the amount of illiquid Bitcoin supply continues to grow at a rate of 119,000 BTC per month. This suggests that Bitcoin holders are becoming increasingly reluctant to sell or move their coins, leading to a concentration of coins in wallets with a sparse spending history.  Related Reading: Ethereum Plunges Below $1,700, Here’s The Metric That Signaled This In Advance This is an important trend to watch, as it suggests that Bitcoin holders remain confident in the long-term potential of the cryptocurrency. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T17:00:44.000Z",
    "title": "BlackRock Inches Closer To Launching Bitcoin ETF: Potential Impact On BTC Price",
    "url": "https://www.newsbtc.com/bitcoin-news/blackrock-inches-closer-to-launching-bitcoin-etf-impact-on-btc-price/",
    "description": "Financial circles are buzzing with the news that BlackRock, the world&#8217;s largest asset manager, is considering applying for a Bitcoin Exchange Traded Fund (ETF). This development signifies a substantial move by one of the most influential financial institutions into the world of cryptocurrencies. The anticipation is growing amid revelations that BlackRock plans to use Coinbase Custody for the ETF, alongside the crypto exchange&#8217;s spot market data for pricing. This alliance represents a significant step in legitimizing cryptocurrencies in traditional finance. Notably, Bitcoin (BTC) and Coinbase (COIN) have not reacted to the news but have only continued to dwell in red, with both assets down 3.9% and 2.81%, respectively, in the past 24 hours. Related Reading: Data Reveals Short-Term Bitcoin Holders Refuse To Sell Despite SEC Crackdown BlackRock’s Foray Into Crypto The move marks a continuation of the collaboration that started last year when BlackRock partnered with Coinbase to offer crypto directly to institutional investors. As of yet, the specifics about the nature of the ETF – whether it will be spot or futures – remain undisclosed. Notably, The Securities and Exchange Commission (SEC), responsible for regulating ETFs in the U.S., has previously turned down every application for a spot Bitcoin ETF. However, several Bitcoin futures ETFs have gained the regulatory body&#8217;s approval for trading, indicating a gradually warming stance towards cryptocurrencies. Potential Impact On Bitcoin Price The news of BlackRock&#8217;s potential Bitcoin ETF could significantly affect BTC&#8217;s price. Creating such an ETF would allow a broader spectrum of investors to gain exposure to Bitcoin, possibly driving up demand and its price. ETFs make it easy for institutional investors to gain exposure to Bitcoin, opening up a substantial new demand avenue. Analyst crypto Daan Crypto reported that Bitcoin had recorded a strong spot bid on Binance in the past few hours – a move that has not been seen for the past few days. According to the trader, Bitcoin&#8217;s local bottom is more likely in if the asset continues to the downside in the coming days. At the time of writing, BTC currently trades at $24,977, down by nearly 4%. Its trading volume has also spiked over the past 7 days indicating massive trading activity. Notably, from a technical perspective, BTC could still be prone to a continuous downtrend, given that the asset hasn&#8217;t hit major support, which can be found in the order block at $24,500. Related Reading: Bitcoin Price On Shaky Ground: Market Analysts Warn Of Potential Fall To $20,000 Level Furthermore, the association with BlackRock, a globally recognized asset management name, could lend credibility and legitimacy to Bitcoin. This increased trust could lead to greater adoption rates and an upward price trajectory for Bitcoin in the long run. As observed in the past, any positive development or news about BTC ETFs has often led to a spike in Bitcoin&#8217;s price due to increased demand from retail and institutional investors. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T18:30:19.000Z",
    "title": "Crypto Surprise: Arbitrum (ARB) Airdrop Boosts Ethereum (ETH) L2, Ignites Metrics Surge",
    "url": "https://www.crypto-news-flash.com/crypto-surprise-arbitrum-arb-airdrop-boosts-ethereum-eth-l2-ignites-metrics-surge/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-surprise-arbitrum-arb-airdrop-boosts-ethereum-eth-l2-ignites-metrics-surge",
    "description": "Artibrum records booming activities after airdrops. Its new wallets hit a daily peak after the airdrop.  Most projects record an incredible number of positive activities after airdrops, however, only a few can sustain the traction. Interestingly, Arbitrum has joined this list. After the airdrop on March 23, 2023, the Arbitrum network recorded a high number [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T18:26:40.000Z",
    "title": "Monero, ZCash, and Dash: Unlocking Complete Privacy in the Digital Age, Exposing the Stealth Mode Fallacy of a US CBDC",
    "url": "https://www.crypto-news-flash.com/monero-zcash-and-dash-unlocking-complete-privacy-in-the-digital-age-exposing-the-stealth-mode-fallacy-of-a-us-cbdc/?utm_source=rss&utm_medium=rss&utm_campaign=monero-zcash-and-dash-unlocking-complete-privacy-in-the-digital-age-exposing-the-stealth-mode-fallacy-of-a-us-cbdc",
    "description": "A majority of countries including first-world countries such as the U.S. are working on CBDCs. Monero, ZCash, and Dash offer financial privacy in this digital age and are already attracting mass adoption. It&#8217;s no secret for anyone who has been paying attention to the development of CBDCs, that it has great shortcomings. In the new [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T17:00:07.000Z",
    "title": "Cosmos Hub (ATOM) Price Prediction 2023: Uwerx (WERX) Blows ATOM Away As SEC Calls ATOM a Security?",
    "url": "https://www.crypto-news-flash.com/cosmos-hub-atom-price-prediction-2023-uwerx-werx-blows-atom-away-as-sec-calls-atom-a-security/?utm_source=rss&utm_medium=rss&utm_campaign=cosmos-hub-atom-price-prediction-2023-uwerx-werx-blows-atom-away-as-sec-calls-atom-a-security",
    "description": "Explore the exciting world of cryptocurrency as we delve into the 2023 price prediction for Cosmos Hub (ATOM) and examine the rising star, Uwerx. While Cosmos (ATOM) faces uncertainty due to the SEC labeling it as a security, Uwerx emerges as a promising contender, capturing attention with its innovative approach. Keep reading to learn more [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T16:55:07.000Z",
    "title": "Blk DNM Introduces Intelligence Into Clothing With Blockchain, In First Use Of ‘Connected Fashion’",
    "url": "https://www.crypto-news-flash.com/blk-dnm-introduces-intelligence-into-clothing-with-blockchain-in-first-use-of-connected-fashion/?utm_source=rss&utm_medium=rss&utm_campaign=blk-dnm-introduces-intelligence-into-clothing-with-blockchain-in-first-use-of-connected-fashion",
    "description": "Stockholm, Sweden, June 15th, 2023, Chainwire BLK DNM bridging the Physical and Virtual Worlds of Fashion through Blockchain Innovation Swedish-American fashion brand BLK DNM today unveils the first-ever example of connected fashion (garments that exist both physically and virtually, each aspect ‘twinned’ via technology) with the launch of BLK DNM Society and integration of blockchain-powered [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T16:54:25.000Z",
    "title": "Federal Reserve Holds Interest Rates Steady, Bitcoin Takes a Tumble – Will BTC Price Plummet to $20,000 or Rise to $30,000?",
    "url": "https://www.crypto-news-flash.com/federal-reserve-holds-interest-rates-steady-bitcoin-takes-a-tumble-will-btc-price-plummet-to-20000-or-rise-to-30000/?utm_source=rss&utm_medium=rss&utm_campaign=federal-reserve-holds-interest-rates-steady-bitcoin-takes-a-tumble-will-btc-price-plummet-to-20000-or-rise-to-30000",
    "description": "Bitcoin dominance continued to rally upward despite the heightened bearish sentiments. On-chain analysis data provided by Glassnode shows Bitcoin investors have increased accumulation of freshly minted coins. After hiking interest rates for 10 consecutive times, the United States Federal Reserve announced a pause at 5.25 percent on Wednesday. The Fed Chair Jerome Powell announced during [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T17:50:00.000Z",
    "title": "Altcoins May Decline if Bitcoin Dominance Climbs Above 50%",
    "url": "https://coinedition.com/altcoins-may-decline-if-bitcoin-dominance-climbs-above-50/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bitcoin dominance in the crypto market is nearing the 50% ratio, and experts think it could have significant implications for altcoins. If the historical, alternating trend between Bitcoin and altcoins upholds, an upsurge in Bitcoin dominance would imply a downward trend for the altcoin market. According to a crypto trader identified on Twitter as Evca [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/altcoins-may-decline-if-bitcoin-dominance-climbs-above-50/\">Altcoins May Decline if Bitcoin Dominance Climbs Above 50%</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T17:20:00.000Z",
    "title": "UNI, ALGO, and LUNC Defy Odds as Fed Triggers Crypto Chaos",
    "url": "https://coinedition.com/uni-algo-and-lunc-defy-odds-as-fed-triggers-crypto-chaos/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The cryptocurrency market declined in response to the US Federal Reserve&#8217;s indication of upcoming interest rate hikes. However, amidst the chaos, three standout altcoins, Uniswap (UNI), Algorand (ALGO), and Terra Classic (LUNC), managed to buck the trend and soar to new heights. The Federal Open Market Committee (FOMC), led by Jerome Powell, paused its aggressive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uni-algo-and-lunc-defy-odds-as-fed-triggers-crypto-chaos/\">UNI, ALGO, and LUNC Defy Odds as Fed Triggers Crypto Chaos</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T16:55:00.000Z",
    "title": "Analyst Identifies DOGE As Safe Bet For Altcoin Investors",
    "url": "https://coinedition.com/analyst-identifies-doge-as-safe-bet-for-altcoin-investors/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/doge1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/doge1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/doge1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/doge1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The crypto trading and analysis YouTube channel, DataDash, shared its latest technical analysis for Dogecoin (DOGE) yesterday. In the video, the analyst named DOGE as a safe bet for any trader or investor looking to stock up on altcoins. Despite this, he did warn that the meme coin’s price may drop another 5-7% in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-identifies-doge-as-safe-bet-for-altcoin-investors/\">Analyst Identifies DOGE As Safe Bet For Altcoin Investors</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T18:05:50.000Z",
    "title": "Veteran Trader Peter Brandt Issues Bitcoin Warning, Says BTC Now ‘Hinged’ to the Downside",
    "url": "https://dailyhodl.com/2023/06/15/veteran-trader-peter-brandt-issues-bitcoin-warning-says-btc-now-hinged-to-the-downside/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Warns-BTC-Will-Continue-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Long-time trader Peter Brandt is warning that Bitcoin (BTC) is losing support and may make a sharp move to the downside. Brandt tells his 697,000 Twitter followers that Bitcoin’s steady price action in the $25,000 range is now starting to collapse. “Hinged to downside for now.” According to Brandt, Bitcoin’s price action created a critical [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/veteran-trader-peter-brandt-issues-bitcoin-warning-says-btc-now-hinged-to-the-downside/\">Veteran Trader Peter Brandt Issues Bitcoin Warning, Says BTC Now ‘Hinged’ to the Downside</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T17:47:07.000Z",
    "title": "Blk DNM Introduces Intelligence Into Clothing With Blockchain, In First Use Of ‘Connected Fashion’",
    "url": "https://dailyhodl.com/2023/06/15/blk-dnm-introduces-intelligence-into-clothing-with-blockchain-in-first-use-of-connected-fashion/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/blkdnm.png?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/blkdnm.png 500w, https://dailyhodl.com/wp-content/uploads/2023/06/blkdnm.png?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/blkdnm.png?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/blkdnm.png?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/blkdnm.png?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 15th, 2023 – Stockholm, Sweden BLK DNM bridging the Physical and Virtual Worlds of Fashion through Blockchain Innovation Swedish-American fashion brand BLK DNM today unveils the first-ever example of connected fashion (garments that exist both physically and virtually, each aspect ‘twinned’ via technology) with the launch of BLK DNM Society and integration of blockchain-powered [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/blk-dnm-introduces-intelligence-into-clothing-with-blockchain-in-first-use-of-connected-fashion/\">Blk DNM Introduces Intelligence Into Clothing With Blockchain, In First Use Of ‘Connected Fashion’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T16:55:03.000Z",
    "title": "SEC Delays Answering Coinbase’s Request for Crypto Clarity, Chief Legal Officer Responds",
    "url": "https://dailyhodl.com/2023/06/15/sec-delays-answering-coinbases-request-for-crypto-clarity-chief-legal-officer-responds/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-launches-voter.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) says it needs more time before deciding whether to respond to Coinbase&#8217;s request for regulatory clarity regarding the crypto industry. Coinbase filed a motion in court in April to compel the SEC to respond to a July petition from the company requesting guidance for the digital asset industry. Last [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/sec-delays-answering-coinbases-request-for-crypto-clarity-chief-legal-officer-responds/\">SEC Delays Answering Coinbase’s Request for Crypto Clarity, Chief Legal Officer Responds</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T16:41:55.000Z",
    "title": "Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston",
    "url": "https://dailyhodl.com/2023/06/15/parcl-expands-its-real-estate-frontier-launches-additional-tradable-indexes-for-major-us-cities-including-austin-chicago-seattle-and-boston/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/parcl.png?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/parcl.png 500w, https://dailyhodl.com/wp-content/uploads/2023/06/parcl.png?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/parcl.png?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/parcl.png?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/parcl.png?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 15th, 2023 – New York, New York Parcl’s market expansion increases access to investors seeking exposure to real estate prices via Real World Asset (RWA) Indexes. Parcl, the leading blockchain-powered real estate trading platform, announced today the launch of Austin, Texas, to its ever-growing list of tradable city indexes. In addition to Austin, Parcl [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/parcl-expands-its-real-estate-frontier-launches-additional-tradable-indexes-for-major-us-cities-including-austin-chicago-seattle-and-boston/\">Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]