[
  {
    "source": "Cointelegraph",
    "date": "2024-04-09T03:03:34.000Z",
    "title": " Ethereum boosts 8% amid ‘ultra-strong’ social and market activity  ",
    "url": "https://cointelegraph.com/news/ethereum-eth-price-gains-8-percent-social-market-activity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvMDFhYzUyZTMtNTk5NS00NDk1LWE3ZWUtNWVlOTEwODQ4OWM0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Derivatives traders are targeting higher strike prices for Ethereum by the end of April.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) accelerated 8% in spot crypto markets on Monday amid an uptick in social sentiment and optimism among derivatives traders.</p><p>Ether prices have gained around 8% over the past 24 hours, with the asset hitting an intraday high of $3,722 on April 9, outpacing Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and most of its closest peers, according to CoinGecko.</p><p>It is the highest price ETH has reached since March 16, just over three weeks ago. The asset is now 9% away from its 2024 high of $4,070 and 24% down from its 2021 all-time high of $4,878.</p><p><a href=\"https://cointelegraph.com/news/ethereum-eth-price-gains-8-percent-social-market-activity\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-09T02:41:09.000Z",
    "title": " BTC halving to fuel ‘raging firesale of crypto assets’ — Arthur Hayes ",
    "url": "https://cointelegraph.com/news/bitcoin-halving-crypto-firesale-arthur-hayes-heatwave",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYWUxY2I2ODktMzIzYi00NGExLWFiZmItNDEyOTRiMzY2NDM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cryptocurrencies are headed for intense turbulence in the second half of April, spurred by the Bitcoin halving and a Fed “bag of tricks,” says the BitMEX co-founder. </p>\n                    <p><p>The Bitcoin halving this month, combined with a “bag of tricks” from the Federal Reserve and Treasury, will “add propellant to a raging firesale of crypto assets” and depress the crypto market for weeks, says BitMEX co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/arthur-hayes\">Arthur Hayes</a>.</p><p>In an April 8 blog <a href=\"https://cryptohayes.medium.com/heatwave-68dc6ccb3d21\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, Hayes wrote he believed the <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">Bitcoin halving</a> would “pump prices in the medium term” but warned crypto prices “directly before and after could be negative.”</p><p>“The narrative of the halving being positive for crypto prices is well entrenched. When most market participants agree on a certain outcome, the opposite usually occurs,” he wrote.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-halving-crypto-firesale-arthur-hayes-heatwave\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-09T03:11:00.000Z",
    "title": "Bitcoin Price Resumes Upside, Why BTC Could Soon Hit New ATH",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-resumes-upside-why-btc-could-soon-hit-new-ath/",
    "description": "Bitcoin price is moving higher above the $71,200 resistance. BTC is showing positive signs and might soon extend gains above $72,500. Bitcoin climbed higher above $69,500 and $70,000 resistance levels. The price is trading above $70,000 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $70,750 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could accelerate higher if it clears the $72,500 resistance zone. Bitcoin Price Regains Momentum Bitcoin price started a decent increase above the $68,500 resistance zone. BTC cleared the $69,500 and $70,000 resistance levels to move into a positive zone. The price even cleared the $71,200 resistance zone. A high was formed near the $72,609 level and the price is now correcting gains. There was a move below the $72,000 level. The price corrected lower below the 23.6% Fib retracement level of the upward wave from the $68,954 swing low to the $72,609 high. Bitcoin is now trading above $70,000 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $70,750 on the hourly chart of the BTC/USD pair. The trend line is close to the 50% Fib retracement level of the upward wave from the $68,954 swing low to the $72,609 high. Immediate resistance is near the $72,000 level. The first major resistance could be $72,500. The next resistance now sits at $72,800. If there is a clear move above the $72,800 resistance zone, the price could start a fresh increase. Source: BTCUSD on TradingView.com In the stated case, the price could rise toward $73,500. The next major resistance is near the $74,000 zone. Any more gains might send Bitcoin toward the $75,000 resistance zone in the near term. Are Dips Supported In BTC? If Bitcoin fails to rise above the $72,000 resistance zone, it could continue to move down. Immediate support on the downside is near the $70,7500 level or the trend line. The first major support is $70,350. The next support sits at $70,000. If there is a close below $70,000, the price could start a drop toward the $68,500 level. Any more losses might send the price toward the $67,500 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $70,750, followed by $70,000. Major Resistance Levels – $72,000, $72,500, and $73,500."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-09T03:00:16.000Z",
    "title": "Bitcoin Q1 Performance Digest: 70% Price Surge, Inflows Into ETFs, And Expansion Of Layer TVL Revealed",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-q1-performance-digest-69-price-surge-12b-etfs-inflows-and-127-growth-in-layer-tvl/",
    "description": "Bitcoin (BTC) has shown an impressive performance in the first quarter (Q1) of 2024, as highlighted in a recent report by market intelligence data research firm Messari. The research firm finds key factors contributing to Bitcoin&#8217;s price increase, market cap dominance, and the emergence of new trends in the cryptocurrency ecosystem. Inscription Activities Drive Bitcoin Fees Up Analyzing the key figures detailed in the report, Bitcoin&#8217;s price experienced a significant increase in Q1 2024, rising 68.78% quarter-over-quarter (QoQ) to reach an all-time high (ATH) of $73,100.  This price increase propelled Bitcoin&#8217;s market cap dominance to 49.7% in March 2024. Interestingly, the research firm notes that such dominance is a typical feature at the start of a new halving cycle, with Bitcoin often leading the way for other cryptocurrencies. Related Reading: XRP Price Drops After Massive Whale Dump, Casting Doubt On $1 Target In April Another relevant figure is the inscription activity in Q4 2023, which drove fees up by 699.4% QoQ. However, in Q1 2024, subscription-related fees decreased by 41.9%. Despite declining total fees, inscription-related transactions still accounted for 18.4% of Bitcoin&#8217;s total fees, demonstrating their continued relevance. Average daily transactions and daily active addresses also experienced a decline of 15.3% and 4.7% QoQ, respectively. The report suggests that the decline in transaction activity may be attributed to decreased activity from bots or &#8220;super users.&#8221; This shift aligns with the decrease in inscription-related activities and fees.  Inscription-related activity initially surged in February 2023, leading to a considerable transaction increase. Although Q1 2024 witnessed a decline in inscription-related activity QoQ, it remained significantly higher year-over-year (YoY), indicating its continued impact on the network.  ETFs Amassed 212,000 BTC In Q1 Messari highlights that Q1 2024 showed the growth of programmable layers in the cryptocurrency ecosystem. Established layers such as Rootstock and Stacks led the way regarding total value locked (TVL), while newer layers such as BOB and Merlin experienced rapid growth.  TVL&#8217;s 127% QoQ growth was primarily in non-BTC assets, as Bitcoin-locked amounts lagged behind the Lightning Network and alt-L1 networks, which host significant amounts of BTC. Ultimately, the approval and launch of nine spot ETFs and one ETF conversion marked a significant milestone for Bitcoin&#8217;s legitimization by the US government and traditional finance (TradFi).  The report notes that these ETFs garnered over $12 billion in inflows within the first month. Notably, BTC ETFs surpassed silver ETFs in assets under management (AUM) but still lagged behind gold ETFs.  Institutional BTC holdings were also surpassed by MicroStrategy, the largest institutional holder, with 215,000 BTC. The ETFs accumulated 212,000 BTC in inflows during Q1, further establishing Bitcoin&#8217;s prominence in the financial markets. Related Reading: Ripple CEO Makes Bold Prediction For Crypto Market – $5 Trillion In 2024 Bitcoin&#8217;s exceptional performance in Q1 2024, marked by a significant price increase and market cap dominance, has solidified its position as the leading cryptocurrency.  Anticipation for the supply halving, along with the success of BTC ETFs and institutional inflows, has contributed to Bitcoin&#8217;s growth and recognition in traditional finance.  Featured image from Shutterstock, chart from TradingView.com "
  }
]