[
  {
    "source": "CoinDesk",
    "date": "2024-02-09T20:25:24.000Z",
    "title": "Ethereum Has Gatekeepers (for Good Reason)",
    "url": "https://www.coindesk.com/consensus-magazine/2024/02/09/ethereum-has-gatekeepers-for-good-reason/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A new, non-standard token standard called ERC-404 circumvented the usual token approval process and is capitalizing on a term with an actual definition."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-09T20:23:23.000Z",
    "title": "You’re Never Going to Beat Twitter by Just Copying It, Says Farcaster Co-Founder",
    "url": "https://decrypt.co/216826/never-beat-twitter-copying-it-farcaster-co-founder",
    "description": "Dan Romero thinks Farcaster has a secret weapon no other upstart Twitter rival does. He and Base creator Jesse Pollak spoke with Decrypt."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T20:31:25.000Z",
    "title": " Ethereum network strength, macroeconomic factors back ETH’s rally to $2.5K ",
    "url": "https://cointelegraph.com/news/ethereum-network-strength-macroeconomic-factors-back-eth-s-rally-to-2-5k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTBjYmViMTAtYjI1Ny00MDJkLWI5MGQtMDljMmFlYzJiMTQ3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A variety of bullish factors back Ethereum’s recent rally to $2,500.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price witnessed a 10% price increase in the first 9 days of February, breaking above $2,450 for the first time in three weeks. This movement was aligned with the broader cryptocurrency market's bullish momentum and significantly influenced by the macroeconomic environment. </p><p>Despite the reasons behind Ether's rally, investors are growing more bullish as the deposits on the Ethereum network increase. However, is this momentum sufficient for a sustainable rise above $2,800?</p><p>On Feb. 4, United States Federal Reserve (Fed) Chairman Jerome Powell emphasized the need for a more sustainable public debt path in an interview. In 2023, U.S. debt service costs represented 2.4% of the economy's gross domestic product (GDP), and projections indicate a potential increase to 3.9% in 2034, as reported by the Congressional Budget Office. These projections <a href=\"https://www.axios.com/2024/02/08/us-government-debt-gdp-interest-costs\" target=\"_blank\" rel=\"noopener nofollow\">prompt</a> the Fed's policy interest rate to decrease, according to Neil Irwin, author of Axios Macro.</p><p><a href=\"https://cointelegraph.com/news/ethereum-network-strength-macroeconomic-factors-back-eth-s-rally-to-2-5k\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T20:12:16.000Z",
    "title": " Filings shake up NY Attorney General case against Genesis, Gemini   ",
    "url": "https://cointelegraph.com/news/new-ny-attorney-general-filings-case-genesis-gemini",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTBjNmJhNjItMTgwMS00NzcwLTlkNmMtN2MyMGY2M2JjYzIxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The NYAG reached a settlement with Genesis Holdco in a Feb. 8 filing and named it in an amended complaint on Feb. 9.</p>\n                    <p><p>The New York State Office of the Attorney General (NYAG) settled with Genesis Global Holdco in a proposed motion in its case surrounding the Gemini Earn program on Feb. 8. The following day, the NYAG filed a new, expanded complaint in the case, naming Genesis Global Holdco and all its codefendants, however.</p><p>The Genesis holding company filed a motion for the New York Southern District Bankruptcy Court to approve a settlement agreement between it and the NYAG on Feb. 8. The settlement is the “product of extensive negotiation,” the filing said.</p><p>The Genesis settlement stipulated that the NYAG would receive payment on its claims on equal footing with the United States Securities and Exchange Commission (SEC) and only after payments to creditors. Genesis settled with the SEC for $21 million on Jan. 31. The court will consider both settlements on Feb. 14.</p><p><a href=\"https://cointelegraph.com/news/new-ny-attorney-general-filings-case-genesis-gemini\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-09T20:16:07.000Z",
    "title": "Hong Kong authorities issue public alert about fraudulent crypto exchange masquerading as MEXC Global",
    "url": "https://cryptoslate.com/hong-kong-authorities-issue-public-alert-about-fraudulent-crypto-exchange-masquerading-as-mexc-global/",
    "description": "<p>Hong Kong&#8217;s Securities and Futures Commission (SFC) and local law enforcement have jointly issued a public warning against an entity masquerading as crypto exchange MEXC Global. The scammers are reportedly pretending to be a legitimate virtual asset trading platform (VATP) and luring unsuspecting victims into participating in what appears to be a crypto investment scam. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/hong-kong-authorities-issue-public-alert-about-fraudulent-crypto-exchange-masquerading-as-mexc-global/\">Hong Kong authorities issue public alert about fraudulent crypto exchange masquerading as MEXC Global</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T20:32:48.000Z",
    "title": "New York extends lawsuit against DCG to $3b after Genesis settlement ",
    "url": "https://crypto.news/new-york-ag-lawsuit-dcg-3-billion-genesis-settlement/",
    "description": "New York Attorney General Letitia James has revised a lawsuit against DCG and its affiliate Gemini Trust Co., escalating the demand for restitution to $3 billion. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-09T20:30:25.000Z",
    "title": "A Comeback Story: Here’s How The XRP Trading Volume Fared In Q4 2023",
    "url": "https://www.newsbtc.com/analysis/xrp/heres-how-xrp-trading-volume-fared-in-q4-2023/",
    "description": "A recent report released by Ripple in its Q4 2023 XRP Markets Report unveiled that XRP experienced a substantial increase in daily trading volume, hitting roughly $600 million this quarter. According to the report, this surge represented a 75-100% growth compared to the lower trading volumes observed in Q3. Notably, the Ripple report suggests a rejuvenation in investor interest and market activity for the altcoin, marking a notable shift from the previous quarter&#8217;s performance. Related Reading: Ex-Ripple Director Heralds ‘Big News’ For XRP, Can Price Respond? Ripple&#8217;s XRP Holdings And Other Crypto Volume In Q4 2023 Ripple&#8217;s Q4 report also provided insights into the company&#8217;s XRP holdings. As of September 30, 2023, Ripple&#8217;s total XRP holdings were more than 5.25 billion, stored in its wallets, plus another 41.3 billion XRP secured in on-ledger escrow. However, by the close of December 2023, Ripple&#8217;s wallet holdings had slightly reduced to about 5.08 billion of this token, and the XRP in on-ledger escrow had also decreased to approximately 40.7 billion. According to the report, Ripple’s access to the escrowed XRP is restricted until scheduled monthly releases occur, a mechanism that ensures the controlled release of tokens into the market. Meanwhile, in addition to the surge in XRP&#8217;s trading volume, the Ripple markets report also revealed that other major cryptocurrencies, such as Bitcoin (BTC) and Ethereum (ETH), saw considerable increases in their trading volumes. BTC volumes rose by 88% quarter-on-quarter (QoQ), while ETH recorded a 140% increase over the same period. These trends indicate a broader recovery and bullish sentiment across the crypto market during the quarter. XRP&#8217;s Market Performance And Future Outlook Despite the recent surge in trading volume, XRP&#8217;s market price has shown varying trends. In the last quarter of 2023, the altcoin traded above $0.60, but as of the latest price action, it hovers just above $0.5, indicating a decline. Although there has been a 3.7% increase in the past week and a 2.2% rise in the past day, the asset is currently trading around $0.52. Nevertheless, the community and analysts remain optimistic about its future potential. Crypto analyst Jaydee recently pointed out a historical pattern suggesting an imminent parabolic move for XRP. According to Jaydee, the altcoin is currently testing a 10-year trendline, similar to previous instances that led to significant price increases. #XRP &#8211; Last two times we tested the 10-year trendline, $XRP 39x &#8211; 650x in price w/in a year! We are now testing multi-year trendline! Can we bounce off trendline to finally break structure?! Do NOT &#8220;KNOW WHAT YOU HOLD&#8221;, 🤦‍♂️🤣we taking &#8220;calculated profits!&#8221; RT/Like for updates!… pic.twitter.com/flIQcDh4Ls — JD 🇵🇭 (@jaydee_757) February 3, 2024 Additionally, Crypto Patel, another analyst, shared his forecast, emphasizing XRP&#8217;s potential to shine and go parabolic, drawing parallels to past market trends. Patel also referred to the legal developments involving Ripple and the US Securities and Exchange Commission (SEC), suggesting that the recent legal victory for Ripple could open doors for XRP&#8217;s breakout in the next bull run. Related Reading: XRP Bulls Looming: Analyst Predicts 400X With Historical Trend The analyst drew attention to a specific chart pattern from 2017 that preceded a massive rally for altcoin. If this trend repeats, Patel posits, the asset could witness an &#8216;extraordinary&#8217; surge, potentially reaching over $10. 🔥 Is This Finally XRP&#8217;s Time To SHINE, WIll hit $10 ? 🔹Last bull #XRP seriously underperformed while stuck fighting the #SEC 🔹 BTC hit new highs while XRP failed to pass 2017&#8217;s $3.30 ATH But with the SEC case now won &#8211; the floodgates may finally BE OPEN! 🔹 Similar… pic.twitter.com/joWLvBnadp — Crypto Patel (@CryptoPatel) February 7, 2024 Featured image from Unsplash, Chart from TradingView"
  }
]