[
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T21:44:42.000Z",
    "title": "OpenAI partners with G42 in Dubai eyeing Middle East expansion ",
    "url": "https://cointelegraph.com/news/openai-g42-dubai-middle-east-expansion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/920f1f04-0497-4f6e-8384-d36a4ef6bc53.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The two companies said they plan to use OpenAI’s models in industries in which G42 has connections and experience, such as energy, finance, healthcare and public services. </p>\n                    <p><p>OpenAI, the maker of popular artificial intelligence (AI) chatbot ChatGPT, and Dubai-based technology holding group G42 <a href=\"https://www.prnewswire.com/news-releases/g42-and-openai-launch-partnership-to-deploy-advanced-ai-capabilities-optimized-for-the-uae-and-broader-region-301960623.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> a new partnership on Oct. 18 to expand AI capabilities in the Middle East region. </p><p>The two companies plan to leverage OpenAI’s generative AI models in sectors of G42’s expertise, including financial services, energy, healthcare and public services. </p><p>G42 said that organizations in the United Arab Emirates (UAE) and other regions using its business solutions should now have a more simplified process of integrating advanced AI capabilities into existing businesses.</p><p>It said it plans to “prioritize its substantial AI infrastructure capacity to support OpenAI's local and regional inferencing on Microsoft Azure data centers.”</p><p>Sam Altman, co-founder and CEO of OpenAI, said that G42’s connections in the industry can help bring AI solutions that “resonate with the nuances of the region.” He said the collaboration will help advance generative AI across the globe.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/middle-east-regulatory-clarity-drives-crypto-industry-growth-binance-fze-head\"><strong><em>Middle East regulatory clarity drives crypto industry growth — Binance FZE head</em></strong></a></p><p>This development follows another from neighboring Middle Eastern country Saudi Arabia, which recently announced a collaboration between a local university and universities in China around developing an <a href=\"https://cointelegraph.com/news/saudi-arabia-china-arabic-ai-system\">Arabic-based AI system</a>. </p><p>The large language model (LLM), called AceGPT, is built on Meta’s Llama 2. According to the project’s GitHub page, it is designed to be an AI assistant for Arabic speakers and answer queries in Arabic. </p><p>Both of these developments come as regulators in the United States grow increasingly weary over the destination of AI semiconductor chip exports, including the Middle East. </p><p>In August, U.S. officials reportedly added “some Middle Eastern countries” to its list of areas where AI chip maker Nvidia and its rival AMD<a href=\"https://cointelegraph.com/news/us-curbs-export-nvidia-ai-chip-to-some-middle-eastern-countries\"> need to curb exports</a> of their high-level semiconductor chips. </p><p>A few weeks later, U.S. <a href=\"https://cointelegraph.com/news/us-regulators-deny-blocking-ai-chip-exports-to-middle-east\">regulators denied blocking</a> said exports to the Middle East. However, in its most recent <a href=\"https://cointelegraph.com/news/us-expands-export-controls-ai-chips-china\">expansion of export controls of AI</a> semiconductor chips, one new rule was to expand licensing requirements for the export of advanced chips to “all 22 countries to which the United States maintains an arms embargo.” Aside from its main target being China, this includes Middle Eastern countries of Iraq, Iran and Lebanon. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-18T22:00:22.000Z",
    "title": "Tesla maintains Bitcoin holdings while directing resources toward AI",
    "url": "https://cryptoslate.com/tesla-maintains-bitcoin-holdings-while-directing-resources-toward-ai/",
    "description": "<p>Tesla published its Q3 2023 shareholder deck on Oct. 18, indicating that it continues to hold its Bitcoin balance as it directs resources to AI efforts. The company reported $184 million in digital assets, known to be composed largely or entirely of Bitcoin (BTC), for the quarter ending Sept. 30, 2023. That amount is equal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tesla-maintains-bitcoin-holdings-while-directing-resources-toward-ai/\">Tesla maintains Bitcoin holdings while directing resources toward AI</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T22:07:34.000Z",
    "title": "Doctor caught red-handed: How the FBI cracked a Bitcoin murder plot",
    "url": "https://www.cryptopolitan.com/doctor-caught-red-handed-how-the-fbi-cracked-a-bitcoin-murder-plot/",
    "description": "Dr. James Wan, a Georgia-based physician, pled guilty to charges of orchestrating a murder-for-hire plot via the dark web. Using Bitcoin to conduct transactions, Wan believed he was operating under the shield of anonymity that the cryptocurrency often provides. This grim plot aimed to assassinate his girlfriend through a contrived carjacking scenario. However, the operation ... <a title=\"Doctor caught red-handed: How the FBI cracked a Bitcoin murder plot\" class=\"read-more\" href=\"https://www.cryptopolitan.com/doctor-caught-red-handed-how-the-fbi-cracked-a-bitcoin-murder-plot/\" aria-label=\"More on Doctor caught red-handed: How the FBI cracked a Bitcoin murder plot\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:47:58.000Z",
    "title": "Coinbase rolls out perpetual futures trading outside U.S>",
    "url": "https://www.cryptopolitan.com/coinbase-perpetual-futures-trading-non-us/",
    "description": "The digital currency marketplace just got a bit more intricate. Coinbase, a significant player in the crypto world, is stepping its game up, venturing into the realm of perpetual futures trading on a global scale, excluding the United States. With this bold move, the company aims to leverage the power of derivatives, capturing a slice ... <a title=\"Coinbase rolls out perpetual futures trading outside U.S&#62;\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-perpetual-futures-trading-non-us/\" aria-label=\"More on Coinbase rolls out perpetual futures trading outside U.S&#62;\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:41:19.000Z",
    "title": "Tesla maintains Bitcoin holdings amid mixed Q3 financials",
    "url": "https://www.cryptopolitan.com/tesla-maintains-bitcoin-holdings-amid-mixed-q3-financials/",
    "description": "Tesla, led by entrepreneur Elon Musk, revealed that it didn&#8217;t part ways with any of its $312 million worth of Bitcoin (BTC) in the third quarter of 2023. Moreover, the company&#8217;s pile of Bitcoin lost approximately $9 million in value compared to the second quarter of this year.  The last significant move Tesla made with ... <a title=\"Tesla maintains Bitcoin holdings amid mixed Q3 financials\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tesla-maintains-bitcoin-holdings-amid-mixed-q3-financials/\" aria-label=\"More on Tesla maintains Bitcoin holdings amid mixed Q3 financials\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T22:00:09.000Z",
    "title": "Crypto-Terrorism Concerns? Senator Warren And 100 Lawmakers Push Biden For Swift Response",
    "url": "https://www.newsbtc.com/news/crypto-terrorism-concerns-senator-warren-and-100-lawmakers-push-biden-for-swift-response/",
    "description": "In the middle of escalating tensions between Israel and Hamas, over 100 legislators, led by Senators Elizabeth Warren and Roger Marshall and Representative Sean Casten, have issued a bipartisan note urging the Biden administration to address alleged close relations between crypto and terrorism.  The lawmakers express alarm over reported evidence suggesting that Hamas successfully evaded US sanctions, acquiring millions of dollars through crypto assets. They are now pressing the administration to clarify its strategy for tackling this critical national security threat. Lawmakers Sound Alarm On Crypto-Financed Terrorism The bipartisan letter, addressed to National Security Advisor Jake Sullivan and Brian Nelson, Under Secretary for Terrorism and Financial Intelligence at the Department of the Treasury, highlights the concerns surrounding Hamas and Palestinian use of crypto funding.  The letter states that between August 2021 and June of the following year, these organizations allegedly raised over $130 million in digital assets, with millions being transferred between them.  Related Reading: Binance Traders Go Bearish On Bitcoin, But Here’s Why They Might Regret It The lawmakers stress the urgency of the situation, given the danger posed by the financing of militant organizations, and call on the Biden administration to provide details about its plan to prevent the use of crypto for terrorism financing. In their letter, the lawmakers cite an article from the Wall Street Journal, which reports that researchers studying Hamas&#8217;s financing allegedly confirm that crypto remains one of several tools employed by the group to raise funds.  While it has not been determined whether the crypto received by Hamas directly financed the October 7th terrorist attack on Israel, the group&#8217;s explicit solicitations for crypto have left no doubt about their intentions.  Furthermore, the lawmakers highlight that both the Israeli and US governments have previously warned about the threat posed by crypto in the fight against terrorism. Israel has even seized crypto assets from terrorist organizations like Hamas and Hezbollah.  However, experts believe that only a fraction of the digital asset funds flowing through Hamas have been successfully captured.  Urgent Call To Curtail Alleged Illicit Activity  In light of this, the lawmakers call for decisive action to address the risks associated with illicit crypto activity to prevent further tragedies.  As Congress considers legislative proposals to mitigate alleged money laundering and illicit finance risks, they urge the Biden administration to swiftly and comprehensively act to curtail such activities and safeguard national security, as well as the security of US allies. Related Reading: When Will Bitcoin Price Reach $1,000,000? Pundit Lays Out A Timeline The lawmakers have set a deadline of October 31, 2023, for the Treasury and the Biden administration to respond to questions about their plans to address the serious national security threats arising from using crypto to finance terrorism. As the debate surrounding the regulation of digital assets continues to intensify, the alleged crypto-financed terrorism adds another layer of complexity.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-18T22:01:33.000Z",
    "title": "Fed Governor Says a CBDC in the US Has ‘Unclear’ Use Case and Presents Significant Risks",
    "url": "https://dailyhodl.com/2023/10/18/fed-governor-says-a-cbdc-in-the-us-has-unclear-use-case-and-presents-significant-risks/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Cruz-Warns-a-CBDC.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Federal Reserve Bank governor Michelle Bowman says that the use case for a central bank digital currency (CBDC) in the US remains unclear. In a new roundtable speech at Harvard, Bowman says that there may be alternatives to CBDCs that already solve the same issues that a digital dollar purports to address. “It is quite [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/18/fed-governor-says-a-cbdc-in-the-us-has-unclear-use-case-and-presents-significant-risks/\">Fed Governor Says a CBDC in the US Has ‘Unclear’ Use Case and Presents Significant Risks</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]