[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-19T22:17:00.000Z",
    "title": "Shiba Inu ($SHIB) Price Recovery Pushes 18.58 Trillion Tokens into Profitability",
    "url": "https://www.cryptoglobe.com/latest/2023/06/shiba-inu-shib-price-recovery-pushes-18-58-trillion-tokens-into-profitability/",
    "description": "The meme-inspired cryptocurrency Shiba Inu ($SHIB) has recently started charting an impressive rally that has seen its price outperform that of most other major digital assets, and lifted over a trillion of its tokens out of the red and back into profitability. According to available cryptocurrency market data, the price of the meme-inspired cryptocurrency jumped […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T22:25:39.000Z",
    "title": "Pro-XRP Lawyer Challenges SEC’s Justification for Treating Secondary XRP Sales as Securities",
    "url": "https://www.cryptopolitan.com/pro-xrp-lawyer-challenges-secs-justification/",
    "description": "In a recent development surrounding the ongoing legal battle between Ripple and the United States Securities and Exchange Commission (SEC), John Deaton, a prominent lawyer and founder of CryptoLaw, has boldly challenged the SEC&#8217;s stance on the classification of secondary XRP sales as securities. Deaton argues that the SEC fails to provide sufficient justification for ... <a title=\"Pro-XRP Lawyer Challenges SEC&#8217;s Justification for Treating Secondary XRP Sales as Securities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pro-xrp-lawyer-challenges-secs-justification/\" aria-label=\"More on Pro-XRP Lawyer Challenges SEC&#8217;s Justification for Treating Secondary XRP Sales as Securities\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T22:18:22.000Z",
    "title": "Is It Lights Out For Litecoin As A Daily Death Cross Approaches?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-daily-death-cross-crypto-halving/",
    "description": "Litecoin price has sank recently along with the greater crypto market, despite not being named a security by the US SEC. The downward pressure has the altcoin at risk of forming a death cross on the daily timeframe. Although the signal sounds ominous and often indicates a downtrend is coming, it might not be lights out for LTC after all. Let&#8217;s take a look. Lackluster Litecoin Performance Ahead of Halving Attributed to SEC With Litecoin&#8217;s halving just weeks away, the currently eleventh-ranked cryptocurrency by market cap was expected to perform better than it has. Fundamental and technical signals both point to LTC being undervalued, yet the coin has suffered alongside other altcoins from SEC-related sell pressure. Related Reading: Why Litecoin Could Be Gearing Up For Its Greatest Rally Since 2017 The US SEC is trying to kill the crypto industry, and its causing LTCUSD daily charts to inch closer to an ominous death cross. Its this a valid breakout of the downtrend line? &#124; LTCUSD on TradingView.com Doing A Double-Take On The Daily LTCUSD Death Cross A death cross occurs when the 50-day moving average crosses below the 200-day moving average from above. This is considered a sell signal in a moving average-based trading system, and often precedes a negative trend change. But not always. A closer look at the 2020 death cross into golden cross &#124; LTCUSD on TradingView.com The chart above shows an example of a previous death cross from late 2020, which immediately rolled into a golden cross as soon as Litecoin found some support and started rising again. LTCUSD went on a massive rally lasting several weeks of upside. For this situation to repeat, Litecoin absolutely has to recover from current levels and resume its formerly bullish momentum. Otherwise, a death cross could lead to renewed selling from investors who expected more out of the halving. Related Reading: Litecoin Attempts To Revitalize The Crypto Market With Bullish Breakout Death cross and golden crosses can sometimes trigger back and forth in a choppy market, which is a drawback of using moving averages as trading signals. This is due to volatile price action pulling the faster moving average back and forth through the slower moving average. Furthermore, as an average of price action, moving averages are lagging indicators in general. A golden cross must be left on the chart when the all the consolidation ends, otherwise the looming death cross signal could have truly deadly implications. With Litecoin&#8217;s halving scheduled for under 45 days from now, anything is possible. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]