[
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T08:24:30.000Z",
    "title": "Robinhood to roll out US-stock trading to the British market",
    "url": "http://cointelegraph.com/news/robinhood-united-kingdom-launch-stock-trading",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c2af667b-3fcf-42d6-8a4e-81966eaa77a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Robinhood CEO Vladimir Tenev said in an interview with Bloomberg that the company is still focused on its global aspirations, and the UK expansion is one step toward that. </p>\n                    <p><p>In another attempt to expand its business internationally, online trading platform Robinhood has announced its plans to launch its stock-exchange application in the United Kingdom. </p><p>In an interview with Bloomberg, Robinhood co-founder and CEO Vladimir Tenev <a href=\"https://www.bloomberg.com/news/videos/2023-11-30/robinhood-ceo-tenev-on-uk-launch-market-opportunities\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that the app has already opened a waitlist for those who want to get early access. The executive added that the company is set to gradually open its platform to everyone in the U.K. in early 2024. Tenev explained.</p><blockquote>“The intention is, for the U.K. market, Robinhood to be the best place to invest U.S. stocks, U.S. dollars, and we believe we can fill that need better than anyone else.” </blockquote><p>The launch will allow the British market to trade 6,000 U.S. stocks. According to Tenev, Robinhood will also roll out its 24-hour trading feature in the U.K. The feature was recently implemented in the U.S., according to Tenev. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cathie-wood-ark-buys-9-5-million-robinhood\"><strong><em>Cathie Wood’s ARK bags 1.1M Robinhood shares in one day</em></strong></a></p><p>The move restarts Robinhood’s attempt to reach a more global market. “I aspire for Robinhood to be a global company. That’s been the plan from the very beginning,” Tenev said. </p><p>“Baiju and I started this company as immigrants and children of immigrants, and so, the idea of making our services [...] available to anyone in the world is just the vision that I had in mind from the very beginning,” Tenev explained in the interview.</p><p>This is not the first time that Robinhood has attempted to penetrate the U.K. market. In 2019, the company <a href=\"https://cointelegraph.com/news/crypto-trading-app-robinhood-launching-in-uk-following-fca-approval\">tried to launch its trading app in the U.K.</a> after receiving approval from the Financial Conduct Authority (FCA), a major British regulator. However, in 2020, the company announced that it was <a href=\"https://cointelegraph.com/news/robinhood-postpones-uk-launch-indefinitely-freezes-global-expansion-plans\">postponing its U.K. launch</a> and freezing its global expansion plans indefinitely. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\"><strong><em>AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-30T08:18:44.000Z",
    "title": "Decentralized mining pool OCEAN by Jack Dorsey joins Bitcoin hash rate surge",
    "url": "https://cryptoslate.com/insights/decentralized-mining-pool-ocean-by-jack-dorsey-joins-bitcoin-hash-rate-surge/",
    "description": "<p>Quick Take The Bitcoin mining hash rate continues to experience a significant upturn. The decentralized Bitcoin mining pool, OCEAN, spearheaded by Jack Dorsey, is noteworthy. It has recently commenced operations, reaching an impressive 126 ph/s, or approximately 0.024% of the total hash rate network, estimated at 550 eh/s. Given its decentralized nature, projections indicate a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/decentralized-mining-pool-ocean-by-jack-dorsey-joins-bitcoin-hash-rate-surge/\">Decentralized mining pool OCEAN by Jack Dorsey joins Bitcoin hash rate surge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-30T08:30:32.000Z",
    "title": "Paxos Secures In Principle Approvals for Stablecoin Issuance and Crypto Services in Abu Dhabi",
    "url": "https://news.bitcoin.com/paxos-secures-in-principle-approvals-for-stablecoin-issuance-and-crypto-services-in-abu-dhabi/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Paxos Secures In Principle Approvals for Stablecoin Issuance and Crypto Services in Abu Dhabi\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/abi.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Paxos, a provider of blockchain and tokenization infrastructure, has recently received preliminary approvals from the Financial Services Regulatory Authority (FSRA) of Abu Dhabi. The company stated that these endorsements are crucial steps for Paxos, enabling it to issue stablecoins pegged to the U.S. dollar and introduce crypto brokerage and custodial services in the Abu Dhabi [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T08:36:29.000Z",
    "title": "AI Model Enhances Detection of Postpartum Hemorrhage",
    "url": "https://www.cryptopolitan.com/ai-model-detect-postpartum-hemorrhage/",
    "description": "Postpartum hemorrhage, a significant and often understudied complication of pregnancy, poses a global health challenge, being the leading cause of maternal mortality and morbidity. Researchers at Brigham and Women&#8217;s Hospital have taken a groundbreaking step in addressing this issue by leveraging the capabilities of the large language model Flan-T5 to extract vital medical insights from ... <a title=\"AI Model Enhances Detection of Postpartum Hemorrhage\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-model-detect-postpartum-hemorrhage/\" aria-label=\"More on AI Model Enhances Detection of Postpartum Hemorrhage\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T08:30:00.000Z",
    "title": "Dogecoin and Tron holders jumping ship, consider new coin: here’s why",
    "url": "https://crypto.news/dogecoin-and-tron-holders-jumping-ship-consider-new-coin-heres-why/",
    "description": "Investors are exploring BorroeFinance amid declines in Dogecoin and Tron"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T08:19:01.000Z",
    "title": "IOTA reaches 10-month highs following $100m foundation launch",
    "url": "https://crypto.news/iota-reaches-10-month-highs-following-100m-foundation-launch/",
    "description": "The native token of the IOTA distributed ledger ecosystem, also called IOTA, witnessed a sudden rally following the announcement of the new IOTA Foundation in the United Arab Emirates (UAE). IOTA is up by 35% in the past 24 hours&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T08:35:30.000Z",
    "title": "Bitcoin Price Stalls Below $38,000 Amid BlackRock-SEC Talks",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-stalls-blackrock-sec-talks/",
    "description": "The Bitcoin price rose to $38.475 yesterday, marking a marginally higher high for the year. Nevertheless, the price did not manage to close the day above the important $38,000 mark. Shortly before the end of the day, the bears managed to push the price down again. As crypto analyst Daan Crypto Trades remarked, “Market does its best to shake out everyone trying to pre-position for a possible Bitcoin ETF approval. It&#8217;s just free liquidity for the MMs/Whales. Sweep highs, trap longs, squeeze out longs, bait shorts, front run lows and repeat the whole process.” BlackRock Argues With SEC Over Details Of Spot Bitcoin ETF In a notable development, BlackRock, the world&#8217;s largest asset manager, has been again actively engaged in discussions with the US Securities and Exchange Commission (SEC) concerning the structure of its spot ETF yesterday. Eric Balchunas, senior ETF analyst at Bloomberg, revealed, &#8220;BlackRock met with the SEC&#8217;s Trading &#38; Markets division again yesterday and presented them with a &#8216;revised&#8217; in-kind model design based on Staff&#8217;s comments at their 11/20 meeting.&#8221; This revised model includes a notable change in the process, specifically at ‘Step 4’, which is the offshore entity market maker acquiring Bitcoin from Coinbase and then pre-paying in cash to the US registered broker dealer who is not allowed to touch BTC. Related Reading: Bitcoin Eyes New Highs As Bloomberg Analyst Reiterates 90% Chance Of January ETF Approval James Seyffart, another Bloomberg analyst, highlighted the ongoing negotiations, adding, &#8220;More confirmation that Issuers are still meeting with the SEC. BlackRock/Nasdaq still pushing for In-Kind creation &#38; redemption. Seems like SEC hasn&#8217;t budged on cash creates demands if this was the primary focus of the meeting. At least not before yesterday, Interesting days ahead!&#8221; The original &#8220;In-Kind Redemption&#8221; flow had Market Maker&#8217;s Broker/Dealer entity (MM-BD) placing an order for redemption through the Authorized Participant (AP), who approves the order, allowing MM-crypto to borrow Bitcoin (or cash) to sell short. This redemption flow had potential balance sheet impacts and risks that the SEC was concerned about. BlackRock has now proposed a &#8220;Revised In-Kind (&#8216;Prepay Model&#8217;)&#8221; Redemption flow. This new model involves MM-crypto delivering cash to MM-BD instead of Bitcoin, and MM-BD then delivers ETF shares to the Transfer Agent via API. The Bitcoin custodian is instructed by the issuer to transfer Bitcoin to MM-crypto, who then closes the short position in BTC. Related Reading: The Other Side Of The Bitcoin: Analyst Highlights What Happens If Bulls Fail The benefits of this revised model are manifold. It aims to lower transaction costs and shifts the execution risks from investors to crypto market makers. It also claims to provide superior resistance to market manipulation and remove the need for issuers to finance or pre-fund sell trades. The reduction in risks of operating events and the simplification across the ecosystem could mean lower variance on how In-kind models can be executed versus cash models. 90% Odds Of Approval Remain Should the SEC approve this revised model, it could herald the introduction of the first US-based spot Bitcoin ETF, a significant milestone that would allow investors to gain direct exposure to Bitcoin rather than through derivative instruments like futures. Despite these developments, there remains a level of uncertainty surrounding the SEC&#8217;s stance on the matter, particularly regarding the implications of spot Bitcoin exposure for retail investors through an ETF. Recent leaks suggested the SEC might prefer cash creation processes over in-kind Bitcoin transfers, a move that could significantly alter the landscape for ETF issuers and broker-dealers dealing with Bitcoin. Nonetheless, Bloomberg&#8217;s ETF analysts have reiterated their 90% odds for a spot ETF approval by January 10 yesterday. At press time, BTC traded at $37,728. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-30T08:11:48.000Z",
    "title": "Top 20 Free Crypto Tools — Part 2",
    "url": "https://www.altcoinbuzz.io/reviews/top-20-free-crypto-tools-part-2-2/",
    "description": "<p>Crypto tools are a must if you&#8217;re investing in crypto. These tools help you to navigate the tricky crypto landscape. Today, we&#8217;re going to discuss 4 out of a list of 20 free tools. Tools that can help stretch your gains and reduce your losses. Without further ado, let us dive straight into these below! 1) [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/reviews/top-20-free-crypto-tools-part-2-2/\">Top 20 Free Crypto Tools — Part 2</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-30T08:34:30.000Z",
    "title": "Judge Allows Secrecy for Jump Crypto in Terra Case",
    "url": "https://coinedition.com/judge-allows-secrecy-for-jump-crypto-in-terra-case/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Promote_Chain_Utility_via_Establishment_of_the_Terra_Classic_Grants-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Promote_Chain_Utility_via_Establishment_of_the_Terra_Classic_Grants-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Promote_Chain_Utility_via_Establishment_of_the_Terra_Classic_Grants-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Promote_Chain_Utility_via_Establishment_of_the_Terra_Classic_Grants-4-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A federal judge overseeing the U.S. Securities and Exchange Commission&#8216;s legal battle against Terraform Labs issued a mixed ruling permitting sealed document filings by crypto investment firm Jump Trading. Jump Trading subsidiary Jump Crypto Holdings was granted confidential treatment of unspecified materials based on arguments by counsel. However, Judge Jed Rakoff emphasized that the court [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/judge-allows-secrecy-for-jump-crypto-in-terra-case/\">Judge Allows Secrecy for Jump Crypto in Terra Case</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]