[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T07:03:40.000Z",
    "title": "Bitcoin ETF issuers set fees as approval hopes rise",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-issuers-set-fees/",
    "description": "The issuers of two proposed Bitcoin exchange-traded funds (ETFs), Fidelity Investments and Galaxy/Invesco, have unveiled the fees they intend to charge should their ETFs receive approval. These revelations come as Bitcoin enthusiasts anticipate the possibility of a US-based Bitcoin ETF, which some believe could have a transformative impact on the cryptocurrency market. Fidelity Investments has [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T07:03:37.000Z",
    "title": "Legal Tech Startup Secures $26 Million in Series B Funding to Propel AI Contract Automation",
    "url": "https://www.cryptopolitan.com/legal-tech-startup-secures-26m-funding/",
    "description": "Robin AI, a legal tech startup founded in 2019 by Richard Robinson, a lawyer at Clifford Chance, and James Clough, a machine learning research scientist at Imperial College, has successfully raised $26 million in Series B funding, with Temasek, a prominent Singaporean global investment company, taking the lead in this latest investment drive. Robin AI [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T06:59:41.000Z",
    "title": "Why Cardano (ADA) Pepe (PEPE) And Dogecoin (DOGE) Holders Are Rushing To Buy Into The Pushd (Pushd) Presale",
    "url": "https://nulltx.com/why-cardano-ada-pepe-pepe-and-dogecoin-doge-holders-are-rushing-to-buy-into-the-pushd-pushd-presale/",
    "description": "Investors from Cardano (ADA), Pepe (PEPE), and Dogecoin (DOGE) are showing a keen interest in the Pushd (PUSHD) presale. This trend highlights a shift in the crypto market, with investors exploring new ventures with real-world utility and growth potential. Cardano (ADA)&#8217;s devolution Cardano (ADA), with its thriving decentralized finance (DeFi) [&#8230;]"
  }
]