[
  {
    "source": "Cointelegraph",
    "date": "2023-12-22T05:47:34.000Z",
    "title": " SIM-swappers hit Manifold Trading, Rug Radio founders ahead of holidays ",
    "url": "https://cointelegraph.com/news/sim-swap-hack-manifold-trading-rug-radio-founders-crypto-exploits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNWZhOWNkZjctNDZmYS00NzRmLThjZTktZGEwODc2MGE3MDUyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Founders behind Manifold Trading and Rug Radio have confirmed they were among those recently targeted in SIM-swap attacks.</p>\n                    <p><p>SIM-swapping attacks have ramped up in the week leading to Christmas, with the founders of Manifold Trading, Rug Radio, and other crypto influencers being hit with attacks in the last 48 hours — some of whom lost control of their </p><p>On Dec. 22, a SIM-swap hacker managed to take control of the official X (formerly Twitter) account of Manifold Trading, along with its founding partner Jae Chung, posting a series of malicious links to crypto drainers. </p><p>Chung confirmed with Cointelegraph that the hack was due to a SIM swap attack despite the account being protected by an email address and password. Chung said that only his and Manifold’s Twitter was compromised and assured anything “fund-sensitive” was safe. He added that steps were being taken to rescue the accounts and restore normal functionality. </p><p><a href=\"https://cointelegraph.com/news/sim-swap-hack-manifold-trading-rug-radio-founders-crypto-exploits\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T05:57:46.000Z",
    "title": "UCLA Receives $3 Million Grant to Develop AI for Prostate Cancer Detection",
    "url": "https://www.cryptopolitan.com/ucla-receives-3-million-grant-to-develop-ai/",
    "description": "The UCLA Health Jonsson Comprehensive Cancer Center has been awarded a substantial five-year, $3 million grant from the National Cancer Institute. The funding is set to catalyze the development of advanced AI-driven technology for the early detection and prediction of aggressive prostate cancer, ultimately aiming to reduce unnecessary treatments and their associated adverse effects. Aiming [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T05:41:58.000Z",
    "title": "AI-Powered Lost and Found Revolutionizes Item Recovery at Dallas Airport",
    "url": "https://www.cryptopolitan.com/ai-powered-item-recovery-at-dallas-airport/",
    "description": "In a groundbreaking development at Dallas-Fort Worth International Airport, the implementation of artificial intelligence (AI) has dramatically improved the efficiency of their lost and found department, successfully reuniting passengers with their misplaced belongings. With approximately 18,000 items reported lost by travelers annually, this innovative approach, operated by Hallmark Aviation Services, has achieved a remarkable 90% [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T06:08:00.000Z",
    "title": "Crypto Analyst Says This AI Altcoin Will Hit A Fresh ATH After 300% Rally",
    "url": "https://www.newsbtc.com/news/crypto-analyst-says-this-ai-altcoin-will-hit-a-fresh-ath-after-300-rally/",
    "description": "The anonymous crypto analyst Rekt Capital&#8217;s observations point to a promising future for the artificial intelligence (AI) cryptocurrency project, with a focus on Fetch.ai (FET). Along with with a sizable 377,500 followers on the social media network X, the analyst offers a bullish prediction, stating that Fetch.ai is about to reach a new all-time high (ATH). Rekt Capital&#8217;s investigation shows that the machine learning platform is presently experiencing a notable upswing following a successful retesting of a critical price level. Related Reading: Injective (INJ) Hits New ATH At $44 – Is $50 Next This Christmas? Technical Analysis Illuminates Fetch.ai Momentum The spotlight placed on Fetch.ai&#8217;s retest points to a technical analysis viewpoint in which the price behavior of the project at this crucial level acts as a key predictor of potential future profits. FET has increased over 300% since the cryptocurrency watchlist, claims Rekt. In terms of fluctuation in price, the AI cryptocurrency went up from $0.53 on December 9 to $0.67 on December 16. $FET Up almost +300% since the Altcoin Watchlist Now trying to breach one of the final resistances before new All Time Highs Weekly Close above the red resistance would be bullish#FET #Fetchai #Crypto https://t.co/kNZBSTw7Nw pic.twitter.com/KUlU5ovkzH — Rekt Capital (@rektcapital) December 15, 2023 Additionally, the technical analysis presents a positive picture for the cryptocurrency Fetch.ai, which has seen 60% of &#8220;green&#8221; trading days. Additionally, Fetch.ai is showing bullish indications from almost 30 technical indicators. The rise in cryptocurrencies with an AI focus indicates a rising awareness of the possibilities at the nexus of blockchain technology and artificial intelligence. An illustrative case in point is the significant increase in the value of Fetch.ai (FET) that followed its partnership with SingularityNET (AGIX). FETUSD currently trading at $0.77175 on the daily chart: TradingView.com The collaboration between Fetch.ai and SingularityNET most likely represents a strategic relationship with the goal of maximizing the technological synergies between the two enterprises. SingularityNET is a platform that facilitates the production and trading of AI services. Fetch.ai could gain from SingularityNET&#8217;s experience and skills. Earlier this week we announced we&#8217;ve strategically partnered with @SingularityNET to tackle some of #AI&#8216;s biggest challenges! 🤖 This partnership focuses on overcoming #LLM hallucinations and enhancing multi-step reasoning 💡 Read all of the details 👇https://t.co/2WWukiqqH0 — Fetch.ai (@Fetch_ai) December 17, 2023 Crypto And AI Synergy: Catalyst For Innovation This partnership is proof of the expanding fusion of blockchain and artificial intelligence (AI), which many investors think has the potential to usher in a new wave of innovation in the cryptocurrency space. At the time of writing, FET was trading $0.76, up 7.5% in the last 24 hours, and sustaining a weekly gain of 10% in the last week, data from Coingecko shows. $FET FET performed a picture-perfect retest of the purple level as support this week Trying again to break beyond the red resistance Very close to challenging for new All Time Highs Just needs to break this red resistance and flip it to support#FET #Fetchai #Crypto https://t.co/oCKhEegMyV pic.twitter.com/UptI8o74B1 — Rekt Capital (@rektcapital) December 19, 2023 Related Reading: NEAR Hits New High Since 2022 – Will The Bears Get In The Way? There is a chance that FET would reach new all-time highs, which would be a challenge. According to Rekt, the crucial next step in realizing this potential is to successfully break through the red resistance and turn it into a level of support, which would represent a turning point in the price trend of FET. All of this information was considered by industry experts when developing their Fetch.ai price forecasts. They anticipate that Fetch.ai&#8217;s value will reach $0.77 by the end of 2023, making it an intriguing DeFi coin to monitor. Featured image from Shutterstock"
  }
]