[
  {
    "source": "Decrypt",
    "date": "2023-07-14T16:19:53.000Z",
    "title": "You Can Buy 'The Flash' as an NFT Just Weeks After Hitting Theaters",
    "url": "https://decrypt.co/148597/you-can-buy-flash-nft-just-weeks-after-hitting-theaters",
    "description": "DC Comics superhero movie \"The Flash\" will be released via NFT on July 18, the very same day it hits traditional digital platforms."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T16:30:00.000Z",
    "title": "Crypto will transcend international currencies — BlackRock CEO ",
    "url": "https://cointelegraph.com/news/blackrock-larry-fink-crypto-will-transcend-international-currencies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c2f9f782-e1ff-4cb1-97a3-d84872410268.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Larry Fink states that global investors are increasingly eager to add crypto assets to their portfolios.  </p>\n                    <p><p>BlackRock CEO Larry Fink has delivered fresh remarks supporting cryptocurrencies' role in democratizing investing worldwide, pointing to growing interest among the company's clients in digital assets.</p><p>\"More and more of our global investors are asking us about crypto,” Fink <a href=\"https://www.cnbc.com/2023/07/14/blackrock-has-a-responsibility-to-democratize-investing-including-in-crypto-larry-fink-says.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> during an interview with CNBC's 'Squawk on the Street' on July 14. BlackRock is the world's largest asset manager, with over $8 trillion in assets spanning all types of investment products.</p><p>In Fink's view, cryptocurrencies have a \"differentiating value versus other asset classes\" in helping diversify portfolios. \"[...] It’s so international it’s going to transcend any one currency,” noted the executive.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/78165e3e-1903-43bb-879e-6dbccfd8f0f5.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BlackRock's Larry Fink on the 'Squawk on the Street'. Source: CNBC</em></figcaption></figure><p>Despite Fink's pro-crypto remarks during the interview, he declined to comment on BlackRock's <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">application for a spot Bitcoin exchange-traded fund (ETF)</a> in the United States, as the filing is still pending with the Securities and Exchange Commission (SEC).</p><p>“We are working with our regulators because, as in any new market, if BlackRock’s name is going to be on it, we’re going to make sure that it’s safe and sound and protected,” Fink added.</p><p>Several applications to list a BTC ETF on the spot market have been rejected by the SEC in past years. However, BlackRock's filing has sparked renewed hopes of imminent approval, given the asset manager's overwhelming success in getting ETFs approved. According to Bloomberg Intelligence's Eric Balchunas and James Seyffart, BlackRock has <a href=\"https://www.bloomberg.com/news/articles/2023-07-06/blackrock-s-nearly-perfect-etf-track-record-spurs-hope-of-bitcoin-fund\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> for 550 ETF applications and has only been rejected once.</p><p>“We believe we have a responsibility to democratize investing. We’ve done a great job, and the role of ETFs in the world is transforming investing. And we’re only at the beginning of that,” Fink stated in the interview. </p><p>BlackRock's application has been followed by several refilings for similar ETF products in the United States. Asset managers in line for a green light include Fidelity, Bitwise, 21Shares, WisdomTree and Investco, among others. </p><p>While American money managers wait for the SEC's decision, Europe's first spot Bitcoin ETF<a href=\"https://cointelegraph.com/news/bitcoin-etf-europe-s-first-spot-bitcoin-etf-eyes-2023-debut-after-a-year-long-delay\"> is set to debut later this year</a> by London-based firm Jacobi Asset Management. The product was scheduled to launch in 2022 but was postponed due to the bear market. According to Jacobi, the demand has been gradually shifting since last year. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/bitcoin-etf-europe-s-first-spot-bitcoin-etf-eyes-2023-debut-after-a-year-long-delay&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T16:28:35.000Z",
    "title": "Solana price hits a 2023 high, but do strong fundamentals back the SOL rally?",
    "url": "https://cointelegraph.com/news/solana-price-hits-a-2023-high-but-do-strong-fundamentals-back-the-sol-rally",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4722e856-10e0-4b1e-a46e-616af35a07ab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SOL price rallied to a year-to-date high above $30, but Solana’s struggle with increasing its user stats call the current bullish momentum into question. </p>\n                    <p><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) price briefly surged to a new year-to-date peak on June 14 after <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">Ripple’s partial win</a> against the U.S. Securities Exchange and Commission in the case contesting XRP’s position as a security. </p><p>The token recorded gains of 48.09%, reaching a peak of $32.40 as news of the court ruling spread, before retracing below the $30.00 level.</p><p>The positive gains following the verdict not only eliminated the losses from June 2023 when the SEC considered SOL a security in its lawsuit <a href=\"https://cointelegraph.com/news/sec-targeting-coinbase-binance-proxies-crypto\">against Binance and Coinbase</a>, but also reclaimed levels not seen since the <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment#:~:text=Eric%20Chen%2C%20CEO%20and%20co,liabilities%20far%20exceeded%20their%20assets.\">FTX collapse</a> in November 2022.</p><p>However, the network's usage and market charts suggest that a long-term bullish price trend is unlikely, with the $30 level forming a crucial resistance level.</p><h2>Solana ecosystem growth stalls</h2><p>The total fees paid on Solana are still ranging below Q3 2022 levels, per Token Terminal data, referring to a time before the FTX collapse, suggesting that the network’s activity has failed to revive completely.</p><p>The blockchain’s ecosystem had <a href=\"https://cointelegraph.com/news/not-just-ftx-token-solana-price-nukes-40-along-with-other-sam-coins\">close ties to Sam Bankman-Fried</a>, the infamous founder of FTX exchange and multiple projects in the ecosystem secured investment from Alameda Research. Hence, its ecosystem suffered severely after the FTX collapse.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c24708f9-5010-4d33-b762-1b5488225907.JPG\"  /><figcaption style=\"text-align: center;\"><em>Total fees paid on Solana. Source: token terminal</em></figcaption></figure><p>Solana’s active user data paints a similar picture with active addresses trending near yearly low levels.</p><p>The project continues to show signs of difficulty in securing a product market fit in DeFi despite the traders’ early optimism in it. The total deposits on Solana, representing its DeFi liquidity, is $317 million, down 97% from its peak of over $10 billion in November 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f1f59309-0480-449c-b4b4-9584ff50924e.JPG\"  /><figcaption style=\"text-align: center;\"><em>The number of active wallets on Solana. Source: Nansen</em></figcaption></figure><p>Nevertheless, the NFT ecosystem on Solana has thrived as it maintained the third position in monthly NFT trading volume since June 15. </p><p>Its trading volumes witnessed a small spike in June, however, has fallen toward yearly low levels in July, suggesting that not much has changed since FTX’s collapse. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/db55a76b-3427-4b84-8b6a-2ac2ad856801.JPG\"  /><figcaption style=\"text-align: center;\"><em>The top blockchain by NFT trading volumes in 30 days since June 14. Source: CryptoSlam</em></figcaption></figure><p>Moreover, in the gaming sector, the most popular games on Solana Genopets, Tap Fantasy, and Aurory have less than 10,000 monthly users, according to DappRadar. The numbers are far less than competing networks like Near, Polygon, Ronin Network and Arbitrum, which have more than double the monthly players for specific games.</p><p>The stagnant growth in the gaming sector once again suggests that the fundamentals have remained unchanged over the past few weeks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6cd2bb23-c50a-472c-9f11-adf2f8dd8dc9.JPG\"  /><figcaption style=\"text-align: center;\"><em>The top games by number of unique active users on Solana. Source: DappRadar</em></figcaption></figure><p>Still, Solana’s team has continued to roll upgrades to improve the speed and scalability of the blockchain and has an <a href=\"https://cointelegraph.com/news/solana-plans-to-improve-its-blockchain-here-s-how\">ambitious roadmap ahead</a>.</p><p>The Firedancer upgrade being developed by Web3 infrastructure development and investment firm Jump Crypto will increase Solana’s speed to over 1 million transactions per second, by introducing a next-generation validator client. The upgrade is expected to arrive some time in late 2023 according to Jump Crypto website.</p><p>The performance of the blockchain post Firedancer implementation will likely help in shaping its price trend. The blockchain’s use especially in high-frequency applications like trading or gaming and its ability in <a href=\"https://cointelegraph.com/news/solana-outage-triggers-ballistic-reaction-from-the-crypto-community\">mitigating network downtime risks</a> will be crucial in determining its success.</p><p>However, until then, the project’s fundamentals do not support the arrival of a new bullish trend.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-founder-says-he-hopes-solana-gets-a-chance-to-thrive\"><strong><em>Ethereum founder says he hopes Solana gets a ‘chance to thrive’</em></strong></a></p><h2>SOL price analysis</h2><p>The SOL/USD pair moved above the resistance from the long-term descending trendline since the 2021 peak, technically indicating an end to the long-term bearish trend.</p><p>However, buyers face considerable hurdles at $30.00, which has formed a long-term support and resistance level. A confirmation of a long-term bullish trend will come only after buyers build support above this level.</p><p>Given the swift rise after Ripple’s news on June 13, there’s a likelihood that SOL can retest the trendline around $18.00 before making a substantial move higher. The yearly lows and long-term horizontal level at $12.76 will provide support to buyers in case of a downside.</p><p>Nevertheless, the weekly Relative Strength Indicator (RSI), a momentum indicator, suggests that there’s more room for upside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/043e9c88-e2a4-4a9f-a788-f8c0549620ac.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USD daily price chart. Source: TradingView</em></figcaption></figure><p>The SOL/BTC pair faces resistance from the yearly peak level around 0.00114 BTC. The 50-day weekly moving average at 0.00104 BTC level also appears to be acting as a crucial resistance as its price peaked exactly at this point on June 14.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5742d80b-a703-47c4-b58d-4cff80f9c6d1.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/BTC weekly price chart. Source: TradingView</em></figcaption></figure><p>The perpetual swap market suggests a probable pullback due to the significant increase in long interest, which raises the possibility of a contrarian trade to the downside.</p><p>The funding rate for SOL perpetual swap contracts, which reflects the sentiment of perpetual traders towards an asset, surged to a two-month high. This indicates that many traders opened long positions following the positive breakout on June 14, driven by fear of missing out (FOMO) sentiments.</p><p>The accumulation of long orders has the potential to trigger a long squeeze in the opposite direction, as more sophisticated traders target the stop losses of long players.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/32b49a0b-a084-4e14-a0be-67cc4247784c.JPG\"  /><figcaption style=\"text-align: center;\"><em>Funding rate for SOL perpetual swaps. Source: Coinglass</em></figcaption></figure><p>While Ripple’s favorable court ruling in their case against the SEC revived hopes around SOL’s position as a security in the U.S. The financial regulator is expected to meet the same fate in its fresh lawsuits against Coinbase and Binance. </p><p>However, the network’s growth and technical levels suggest that many hurdles exist and medium to long term bullish price is unlikely. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-14T16:11:57.000Z",
    "title": "BlackRock CEO’s Increasingly Bullish Stance on Crypto",
    "url": "https://www.cryptoglobe.com/latest/2023/07/blackrock-ceos-increasingly-bullish-stance-on-crypto/",
    "description": "On Wednesday (5 July 2023), Larry Fink, Chairman and Chief Executive Officer of BlackRock, the world’s largest asset manager by AUM, shared his thoughts on Bitcoin during an interview with Carl Quintanilla, a co-host of CNBCs “Squawk on the Street.” Since Fink felt that he could not mention Bitcoin (due to his firm’s recent filing of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T16:30:00.000Z",
    "title": "Tradecurve Hybrid Exchange Challenges OKB For Global Expansion",
    "url": "https://cryptodaily.co.uk/2023/07/tradecurve-hybrid-exchange-challenges-okb-for-global-expansion",
    "description": "<p class=\"s5\">OKX, with its OKB token, has been one of the dominant crypto exchanges out there. Now, this dominance is in question, thanks to newcomers like Tradecurve.</p>\n<p class=\"s5\">Tradecurve is an upcoming hybrid crypto exchange on a path toward becoming a challenger to established platforms. Its innovative features could change the way people access crypto and derivative markets globally.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\n<p class=\"s9\">The Recent Performance of OKB</p>\n<p class=\"s5\">The OKB cryptocurrency runs on the Ethereum blockchain. It is used as a utility token that offers various perks for those that use the exchange. OKX traders can get discounts and access to token offerings or earn interest on their savings.</p>\n<p class=\"s5\">As of July 6, 2023, OKB trades at $42.76. During the past week, OKB saw its low point at $42.79, with its high point of value at $45.95.</p>\n<p class=\"s5\">Within the past 30 days, however, OKB has been down in value by 4.9%. In the past week, it's been down by 1.2%. Since the past year, however, OKB is still up in value by 242.1%, indicating that this short-term decline might just be temporary.</p>\n<p class=\"s5\">Investors and traders that are looking for better returns than those seen with OKB, and are now moving towards Tradecurve.</p>\n<p></p>\n<p class=\"s9\">Tradecurve and Its Price Outlook Compared to OKB</p>\n<p class=\"s5\">Tradecurve is a platform that combines the best elements of CEXs and DEXs to bring a truly innovative and open experience. For one, anyone globally can deposit with crypto and use that crypto as collateral when trading any derivative. This way, it opens markets that might have been otherwise restricted.</p>\n<p class=\"s5\">Moreover, users will</p>\n<p>This is why TRCV has seen a surge in value by 80% during the past month.</p>\n<p class=\"s5\">TCRV, the utility token used for governance, getting passive income through staking, and discounts on subscription fees,Users can also engage in algorithmic trading, where they can subscribe to AI-trading bots that will enable them to make quick automated trades based on predefined strategies, where market conditions are analyzed swiftly and efficiently to create the best and most optimized portfolio.</p>\n<p class=\"s5\">In addition to all of this, newcomers can get access to a dedicated Trading Academy and negative balance protection, and the exchange will implement a VIP account system. TCRV trades at just $0.018 during Stage 4, and at its next stage, a 40% jump is anticipated.</p>\n<p class=\"s5\">The team will also list TCRV on Tier-1 exchanges and on the Uniswap DEX, alongside CoinMarketCap and CoinGecko, for better price tracking. In addition, they will foster transparency by implementing Proof of Reserves (PoR).</p>\n<p class=\"s5\">With all of these aspects in mind, analysts are predicting that Tradecurve (TCRV) can surge in value by 100x at launch, and it has already captured the attention of a lot of traders, as 12,500 users signed up, and the team has raised $2.8 million so far.</p>\n<p class=\"s5\">For more information about the Tradecurvepresale:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T16:22:01.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T16:20:06.000Z",
    "title": "Donald Trump’s NFT company reveals shockingly low bank balance, but massive Ethereum fortune: Details",
    "url": "https://www.cryptopolitan.com/donald-trumps-nft-company-reveals-low-bank-balance-massive-ethereum-fortune-details/",
    "description": "Former President Donald Trump has disclosed new details about CIC Digital LLC, a company that receives licensing fees for using his likeness on non-fungible tokens (NFTs). According to a revised financial filing submitted by Trump on July 13, CIC Digital LLC holds an Ethereum wallet with an estimated value ranging from $250,000 to $500,000, while ... <a title=\"Donald Trump&#8217;s NFT company reveals shockingly low bank balance, but massive Ethereum fortune: Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/donald-trumps-nft-company-reveals-low-bank-balance-massive-ethereum-fortune-details/\" aria-label=\"More on Donald Trump&#8217;s NFT company reveals shockingly low bank balance, but massive Ethereum fortune: Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T16:20:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T16:13:37.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T16:20:48.000Z",
    "title": "Bitcoin Integration: BRICS Nations Plan Gold-Backed Currency to Challenge the US Dollar",
    "url": "https://www.crypto-news-flash.com/bitcoin-integration-brics-nations-plan-gold-backed-currency-to-challenge-the-us-dollar/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-integration-brics-nations-plan-gold-backed-currency-to-challenge-the-us-dollar",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock (BLK) recently submitted an application for a bitcoin exchange-traded fund (ETF).\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The BRICS nations have been buying more gold YTD thus raising speculation of a new currency on the horizon. However, the BRICS movement could end up creating another greenback that is not convertible to Gold, thus making a Bitcoin-backed currency more efficient. Global geopolitics have significantly changed post Covid-19 pandemic as countries strive to improve [...]"
  }
]