[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T18:20:32.000Z",
    "title": "For Financial Advisors, Real World Assets Could Be a Safe(r) Path to Crypto",
    "url": "https://www.coindesk.com/markets/2023/06/01/for-financial-advisors-real-world-assets-could-be-a-safer-path-to-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Financial Advisors should consider Real World Assets (RWA) as a way to approach the digital asset sector, minus most of the volatility."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T18:14:42.000Z",
    "title": "Crypto.com secures Major Payment Institution license in Singapore",
    "url": "https://cryptoslate.com/crypto-com-secures-major-payment-institution-license-in-singapore/",
    "description": "<p>Crypto.com said June 1 that it has secured a Major Payment Institution (MPI) license for Digital Payment Token (DPT) services from the Monetary Authority of Singapore (MAS), the country&#8217;s chief financial regulatory body. This regulatory approval follows an &#8220;in-principle&#8221; approval granted to the firm by MAS in June 2022. The new license permits Crypto.com to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-com-secures-major-payment-institution-license-in-singapore/\">Crypto.com secures Major Payment Institution license in Singapore</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T18:14:45.000Z",
    "title": "TD Cowen shuts down its crypto unit",
    "url": "https://www.cryptopolitan.com/td-cowen-shuts-down-its-crypto-unit/",
    "description": "TD Cowen, the American independent investment bank, has announced the shutdown of its crypto unit, Cowen Digital, just over a year after its launch. The closure, effective June 1, comes without a clear explanation from the bank. Cowen Digital was established in March 2022 to offer institutional clients exposure to the cryptocurrency market, featuring 16 ... <a title=\"TD Cowen shuts down its crypto unit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/td-cowen-shuts-down-its-crypto-unit/\" aria-label=\"More on TD Cowen shuts down its crypto unit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T18:10:21.000Z",
    "title": "NVIDIA COMPUTEX 2023. keynote: Everything you need to know",
    "url": "https://www.cryptopolitan.com/nvidia-computex-2023-keynote-everything-you-need-to-know/",
    "description": "Jensen Huang, CEO of NVIDIA, took the stage at COMPUTEX 2023, captivating the audience with a highly anticipated keynote speech introducing a series of groundbreaking technologies to reshape the computing landscape. With a focus on accelerated computing and generative AI, Huang showcased NVIDIA&#8217;s latest innovations, demonstrating the company&#8217;s immense potential across various industries. AI&#8217;s transformative ... <a title=\"NVIDIA COMPUTEX 2023. keynote: Everything you need to know\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nvidia-computex-2023-keynote-everything-you-need-to-know/\" aria-label=\"More on NVIDIA COMPUTEX 2023. keynote: Everything you need to know\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T18:36:14.000Z",
    "title": "OKX introduces BRC-30 token standard for bitcoin and BRC-20 token staking",
    "url": "https://crypto.news/okx-introduces-brc-30-token-standard-for-bitcoin-and-brc-20-token-staking/",
    "description": "OKX, a leading web3 company, has proposed the industry-first BRC-30 token standard, which enables users to stake BRC-20 tokens and bitcoin, allowing them to earn BRC-30 tokens. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T18:28:23.000Z",
    "title": "Tether’s market cap surges to new all-time high, reaching record levels",
    "url": "https://crypto.news/tethers-market-cap-surges-to-new-all-time-high-reaching-record-levels/",
    "description": "Tether (USDT), the stablecoin pegged to the U.S. dollar, has reached an all-time high (ATH) market capitalization exceeding $83 billion, demonstrating its continued market dominance."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T18:13:21.000Z",
    "title": "EBA emphasizes the need for crypto oversight",
    "url": "https://crypto.news/eba-emphasizes-the-need-for-crypto-oversight/",
    "description": "The European banking authority is pushing for an expansion of its guidelines on money laundering and terrorist financing risk factors to encompass \"crypto-asset service providers.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T18:38:09.000Z",
    "title": "Litecoin Attempts To Revitalize The Crypto Market With Bullish Breakout",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-attempts-revitalize-crypto-market-bullish-breakout/",
    "description": "Litecoin could be single-handedly be saving the crypto market from further catastrophe. If an ongoing bullish breakout attempt is successful, it could revitalize cryptocurrency bulls across all assets. Why LTCUSD Is Poised To Lift The Crypto Market Back in early 2019, LTCUSD would often lead Bitcoin rallies. If Litecoin was pumping, you could be sure that BTC was about to follow. At no point was this more obvious than ahead of Litecoin&#8217;s halving, which was nearly a year ahead of its bigger brother&#8217;s. LTC outperformed BTC by a ratio of roughly two to one. However, the coin has since fallen out of favor, and out of the top ten cryptocurrencies by market cap. It was labeled a huge failure during the 2020 and 2021 bull market, lacking a significant new all-time high. At the time, it offered little when compared to layers 2s which were buzzing with NFTs and DeFi built on their backs. Related Reading: Why Litecoin Could Be Gearing Up For Its Greatest Rally Since 2017 Fast forward to today, and Litecoin&#8217;s halving is just ahead, and this time the cryptocurrency has interesting fundamental support developing it didn&#8217;t have in the past. For one, LTC-20 allows smart contracts and NFTs on Litecoin. Additionally, it being a faster, cheaper alternative to BTC and ETH have prompted it to see a substantial increase in network transactions. All that appears to be left for a massive move in the silver to Bitcoin as digital gold, is a technical breakout in confluence of the fundamental strength. And that could be merely moments away. Its this a valid breakout of the downtrend line? &#124; LTCUSD on TradingView.com Will Litecoin Confirm A Bullish Breakout Ahead Of The Halving? LTCUSD is up more than 5% intraday, as it brushes up against a long-term term downtrend line extending from the mid-2021 high. It is possible because Litecoin didn&#8217;t see such an extended move in 2020 and 2021, that is has once again found itself slightly ahead of Bitcoin and Ethereum as its halving approaches. The LTCBTC and LTCETH charts also appear to support a change in the tides between these top crypto titans. Once Litecoin breaks out from a lengthy downtrend line, it doesn&#8217;t usually stop climbing for months at a time. Related Reading: Why Litecoin Is The Most Undervalued Asset in Crypto Past breakouts saw a 9,000% rally and a 600% rally – what might this trend line break bring for results? If the once-forgotten cryptocurrency starts climbing, it could pull the entire crypto market higher and reignite the bull run. Furthermore, it could restore LTC&#8217;s place in the top ten cryptocurrencies by market cap. Take a good hard look 👀 It is the last time you will ever see #Litecoin outside its rightful throne of the top ten cryptocurrencies by market ca pic.twitter.com/1QZYVidQDT — Tony &#8220;The Bull&#8221; (@tonythebullBTC) June 1, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for exclusive daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]