[
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T06:55:55.000Z",
    "title": "Standard Chartered-owned crypto platform Zodia launches in Hong Kong",
    "url": "http://cointelegraph.com/news/standard-chartered-zodia-hong-kong",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9fc61506-a7f7-4a26-bc46-8c4ab3c42798.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Demand for crypto in Hong Kong is mainly driven by institutional investors rather than retail customers, Zodia CEO said.</p>\n                    <p><p>Zodia, the institutional cryptocurrency custody platform co-owned by British banking giant Standard Chartered, Japanese SBI Holdings and the financial firm Northern Trust, is expanding its services to Hong Kong.</p><p>Zodia Custody is launching services in Hong Kong in response to growing demand for crypto from institutions, Zodia CEO Julian Sawyer <a href=\"https://www.cnbc.com/2023/10/30/standard-chartered-owned-crypto-firm-zodia-launches-in-hong-kong.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a>, according to a CNBC report on Oct. 29.</p><p>According to Sawyer, the crypto demand in Hong Kong is mainly driven by institutional investors rather than retail customers, ideally matching Zodia’s crypto custody offering. He also mentioned that <a href=\"https://cointelegraph.com/news/hong-kong-s-regulatory-lead-sets-it-up-to-be-major-crypto-hub\">Hong Kong’s stance on crypto</a> aligns with Zodia’s ambitions as the local government “sees digital assets as the future and also wants Hong Kong to be a hub.”</p><p>Zodia’s launch in Hong Kong comes as the firm aggressively scales operations in Asia, opening services in Japan, Singapore and Australia in recent months.</p><p>“What we’re seeing is there are absolutely clients in all of those four markets who want to do things,” Zodia CEO said, adding:</p><blockquote>“We also see a lot of other clients and prospects outside those four jurisdictions that want to come in on the institutional side.”</blockquote><p>According to the report, Zodia will gradually roll out its services in Hong Kong, initially offering support for a limited number of cryptocurrency assets. The firm is reportedly in discussions with Hong Kong’s Securities and Futures Commission and Hong Kong Monetary Authority about becoming regulated in the financial district, the report notes.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-regulator-changes-crypto-policies\"><strong><em>Hong Kong securities regulator updates crypto policies, citing market developments</em></strong></a></p><p>Zodia did not immediately respond to Cointelegraph’s request for comment.</p><p>As previously reported, <a href=\"https://cointelegraph.com/news/standard-chartered-to-launch-institutional-grade-crypto-custody-in-2021\">Standard Chartered originally announced plans</a> to launch an institutional custodial platform for cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in late 2020. Launched in 2021, Zodia <a href=\"https://cointelegraph.com/news/banks-bullish-on-crypto-standard-chartered-s-zodia-raises-36m\">raised $36 million in a Series A funding round</a> led by SBI Holdings in April 2023. The platform <a href=\"https://zodia.io/supported-coins/%5C\" target=\"_blank\" rel=\"noopener nofollow\">supports</a> 38 cryptocurrencies, including BTC, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) as well as stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and USDC (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>).</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/?doing_wp_cron=1691052881.1558809280395507812500\"><strong><em>Chinese police vs. Web3, blockchain centralization continues: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T07:00:50.000Z",
    "title": "November Outlook For Bitcoin Price: Another Pump Or Retrace?",
    "url": "https://www.newsbtc.com/bitcoin-news/november-outlook-for-bitcoin-price-another-pump-or-retrace/",
    "description": "November has often been a standout month for Bitcoin, with historical data indicating an impressive average price jump of 43%. This would propel Bitcoin to around $48,000. But with October already showing a significant price increase, the question arises: Will Bitcoin continue its bullish trend, or is a retrace on the horizon? November Monthly Returns November has been particularly bullish for Bitcoin over time, with an average of 43% of price increases over the years. If this trend holds true for this year, we might see Bitcoin touching $48,000. Related Reading: Bitcoin Price To Reach $170,000 in 2025 – Mathematical Model Predicts However, it&#8217;s worth noting that this very high average is significantly influenced by the extreme 453% surge in 2013. If we exclude this outlier, the average settles around 11.54% This leads to a more conservative forecast, pointing to a potential rise to around $38,000. Bitcoin monthly returns over the years. Source: intothecryptoverse Diving deeper into historical data, 8 of the past 13 years have shown price increases in November, making another increase this month seem plausible. Yet, a closer look reveals that 4 of the last 5 times in November there was a price dip. In 2022, the FTX collapse played a pivotal role and 2021 marked the peak for Bitcoin, suggesting that these decreases might be outliers rather than indicative of a changing trend. For a closer comparison, 2019 stands out as it too was a pre-halving year, just like 2023. That year, after a promising October, Bitcoin saw a 17% dip in November, which would equate to a value of $28,000 if repeated this year. Bitcoin Price Action In 2023 Through 2023, Bitcoin has demonstrated a recurring behavior following significant price increases of more than 20%. Typically, these surges have been followed by consolidation periods, and subsequently, a retrace to at least half of the initial increase. Related Reading: Bitcoin Season: Leading The Charge In The Crypto Market Take January, for instance. Bitcoin&#8217;s price increased from $16,500 to $24,000, only to decline to $20,000 by March &#8211; a retrace of 60% from the initial increase. One particularly extreme example was in August when Bitcoin retraced the entirety of a prior 20% rise. Bitcoin price action in 2023. Source: BTCUSD from TradingView It&#8217;s noteworthy that these retraces haven&#8217;t always been immediate. After the rise in March, it wasn&#8217;t until June &#8211; a span of three months &#8211; that the price saw a 50% retrace. On average, this year&#8217;s price retraces have taken between 1 to 3 months to manifest post-rise. Furthermore, before any retrace occurs, there&#8217;s still room for additional upside. To illustrate, after the aforementioned March rise, Bitcoin experienced an additional 10% increase before eventually retracing the initial surge. Potential Scenarios For November Using the above, potential scenarios for November are listed below: Very bullish scenario: Bitcoin rises by 10-20%, potentially reaching up to $42,000. Bullish scenario: Bitcoin rises by 1-10%, potentially reaching up to $38,000. Bearish scenario: Bitcoin decreases by 10%, dropping to around $31,000. This would mean a 50% retrace of the surge in October. Very bearish scenario: Bitcoin decreases by 20%, dropping to around $28,000. This would mean a 100% retrace of the surge in October. In conclusion, given past trends and current market behavior, November promises to be a pivotal month for Bitcoin. Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involve substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell securities or cryptocurrencies. Featured image from Shutterstock, Charts from TradingView.com Predycto is the author of a cryptocurrency newsletter. Sign up for free. Follow @Predycto on Twitter."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T06:59:14.000Z",
    "title": "Cardano’s Price Surge: Could ADA Hit a New All-Time High in 2024 of $3?",
    "url": "https://www.crypto-news-flash.com/cardanos-price-surge-could-ada-hit-a-new-all-time-high-in-2024-of-3/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-price-surge-could-ada-hit-a-new-all-time-high-in-2024-of-3",
    "description": "<img width=\"1000\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Cardano&#8217;s ADA faces a pivotal moment, with technical indicators showing a bullish trend and potential for a $0.35 breakout. Recent price performance has been positive, breaking a long-term downtrend and surpassing the $0.30 mark. Cardano (ADA), one of the prominent cryptocurrencies in the market, is currently at a critical juncture as it faces the potential [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-30T07:04:59.000Z",
    "title": "Bitcoin (BTC) Just About Ready for Parabolic Leg Up, According to Crypto Strategist – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/10/30/bitcoin-btc-just-about-ready-for-parabolic-leg-up-according-to-crypto-strategist-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Rally-As-BTC-Mirrors.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who continues to build a following with his timely Bitcoin (BTC) calls as of late thinks that the crypto king is gearing up for a parabolic surge. Pseudonymous analyst Credible Crypto tells his 349,100 followers on the social media platform X that BTC appears to have printed a local bottom after touching the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/30/bitcoin-btc-just-about-ready-for-parabolic-leg-up-according-to-crypto-strategist-here-are-his-targets/\">Bitcoin (BTC) Just About Ready for Parabolic Leg Up, According to Crypto Strategist – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]