[
  {
    "source": "Cointelegraph",
    "date": "2024-03-25T21:53:42.000Z",
    "title": " SWIFT declares second sandbox connector tests a success for CBDC and more  ",
    "url": "https://cointelegraph.com/news/swift-declares-second-sandbox-connector-tests-success-cbdc-more",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNDVlMzMwZDAtNzQ3Zi00M2JhLWE2Y2UtMWE3NzFmMDQwODJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Having shown the application of its connector in complex use cases, SWIFT will continue to increase the connector’s functions.</p>\n                    <p><p>The Society for Worldwide Interbank Financial Telecommunication (SWIFT) messaging network has released the results of the second phase of sandbox testing for its central bank digital currency (CBDC) interlinking solution, which it calls a connector. </p><p>The project looked at four use cases, not all of which involved CBDC, according to the report it <a href=\"https://www.swift.com/news-events/press-releases/swift-advances-cbdc-innovation-interlinking-solution-begins-beta-testing\" target=\"_blank\" rel=\"noopener nofollow\">released</a> on the test results. It experimented with digital trading with atomic (instantaneous) settlement using smart contracts. It <a href=\"https://cointelegraph.com/news/swift-blockchain-integration-cbdcs\">connected tokenization platforms</a> to facilitate atomic delivery versus payment and worked with financial infrastructure firm CLS Group to show the connector’s capability of connecting existing foreign exchange infrastructures using CBDC.</p><p>The fourth use case, involving using its Liquidity Saving Mechanism algorithms to reduce fragmentation of liquidity across platforms, was described as a “paper exercise, accompanied by bilateral discussions.”</p><p><a href=\"https://cointelegraph.com/news/swift-declares-second-sandbox-connector-tests-success-cbdc-more\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-25T21:45:00.000Z",
    "title": " Solana takes the lead in weekly stablecoin transfer volume ",
    "url": "https://cointelegraph.com/news/solana-takes-the-lead-in-weekly-stablecoin-transfer-volume",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOWEzNGZjNTctYTYzNS00MmJhLWE2MGUtZjBkMjBjY2NmNzViLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Solana flipped Ethereum in weekly stablecoin transfer volume as investors chase after yield, airdrops and high returns from the memecoin frenzy. </p>\n                    <p><p>Solana has flipped Ethereum to become the number one blockchain in weekly stablecoin transfer volume. </p><p><a href=\"https://app.artemis.xyz/stablecoins?stablecoinBreakdown=chain&amp;granularity=monthly\" target=\"_blank\" rel=\"noopener nofollow\">Data</a> from blockchain analytics platform Artemis reveals that Solana’s weekly transfer volume for stablecoins reached $364.7 billion, overtaking the <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency#:~:text=Ethereum%20is%20a%20decentralized%20blockchain,media%20and%20so%20much%20more.\">Ethereum</a> network, which reported $152.99 billion. Other top chains like Tron and BNB Chain saw volumes of $101.57 billion and $22.75 billion, respectively​​​.</p><p>The figure adds to the total stablecoin transfer volume for March, which currently stands at $804 billion, almost eclipsing the $960 billion in <a href=\"https://cointelegraph.com/news/what-is-solana-and-how-does-it-work\">Solana</a> stablecoin transfer volume for February.</p><p><a href=\"https://cointelegraph.com/news/solana-takes-the-lead-in-weekly-stablecoin-transfer-volume\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-25T22:00:30.000Z",
    "title": "DeFi Education Fund files lawsuit to exempt airdrops from SEC’s securities classification",
    "url": "https://cryptoslate.com/defi-education-fund-files-lawsuit-to-exempt-airdrops-from-secs-securities-classification/",
    "description": "<p>The DeFi Education Fund, a crypto advocacy group, and Texas-based apparel company Beba LLC have jointly initiated legal proceedings against the US SEC to clarify the status of airdrops as non-securities offerings. The March 25 court filing emphasized the need to halt the SEC&#8217;s regulatory actions, which the two entities perceive as an overreach into [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/defi-education-fund-files-lawsuit-to-exempt-airdrops-from-secs-securities-classification/\">DeFi Education Fund files lawsuit to exempt airdrops from SEC’s securities classification</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-25T22:00:30.000Z",
    "title": "Telegram Banned in Spain for Not Cooperating in Unauthorized Content Probe",
    "url": "https://news.bitcoin.com/telegram-banned-in-spain-for-not-cooperating-in-unauthorized-content-probe/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Telegram Banned in Spain for Not Cooperating in Unauthorized Content Probe\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/38da6c50-5c2d-4954-9b4e-7eb0f5dfcc52.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Telegram, the messaging powerhouse, has been banned in Spain on a case investigating the hosting of unauthorized content owned by media companies in Spain. The Audiencia Nacional (National Court), one of the highest courts in Spain, has authorized this ban until Telegram cooperates by sending the required info to the court. Audiencia Nacional Bans Telegram [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T21:56:36.000Z",
    "title": "Binance phases out Tron USDC amidst regulatory backlash",
    "url": "https://www.cryptopolitan.com/binance-out-tron-usdc-amidregulatory-hurdles/",
    "description": "In response to escalating regulatory pressures and an impending blockade by the Philippines Securities and Exchange Commission (SEC), Binance, a prominent cryptocurrency exchange, has announced the cessation of support for Tron network-based USD Coin (USDC) stablecoins. This strategic move comes on the heels of Circle&#8217;s withdrawal from the Tron blockchain, as regulatory scrutiny intensifies across [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T21:51:54.000Z",
    "title": "Unlocking Smarter Crypto Trading with AI Power",
    "url": "https://www.cryptopolitan.com/crypto-trading-with-ai-power/",
    "description": "In the fast-paced world of cryptocurrency, staying ahead of market trends is essential for maximizing profits in crypto trading with AI. Artificial intelligence (AI) tools offer a compelling solution, employing complex machine learning algorithms to analyze vast amounts of data with unprecedented speed and accuracy. By leveraging AI for trend analysis in crypto market, traders [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T21:44:03.000Z",
    "title": "SEC proposes $2B fine against Ripple",
    "url": "https://www.cryptopolitan.com/sec-proposes-2b-fine-against-ripple/",
    "description": "The U.S. Securities and Exchange Commission (SEC) is reportedly seeking a $2 billion penalty against blockchain firm Ripple Labs, according to statements from Ripple&#8217;s Chief Legal Officer Stuart Alderoty.&#160; The request to impose fines and penalties is part of a legal filing that remains under seal, with public disclosure expected imminently. This development escalates the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-25T22:00:43.000Z",
    "title": "Bitcoin To $50,000 Or $80,000? Crypto Expert Predicts Where Price Is Headed Next",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-50000-or-80000/",
    "description": "Crypto expert popularly known as KSI has shared his thoughts on how the Bitcoin price could progress until the peak of this bull cycle. Based on his prediction, the flagship crypto could experience significant dips on its way to a new all-time high of $100,000.  $80,000 Could Be Next For Bitcoin KSI mentioned in an X (formerly Twitter) post that Bitcoin could rise to between $73,000 and $80,000 from here. However, a correction could quickly follow, as the crypto analyst remarked that Bitcoin would drop to between $50,000 and $60,000 afterwards. KSI added that it would be a “boring red summer,” suggesting that BTC&#8217;s price won’t be encouraging during that period.  Related Reading: Ethereum Sees Notable Rise In Daily Activity, But Why Is Price Down? KSI claimed that things would then pick up again in the winter. He also stated that Bitcoin could hit $100,000 by the beginning of 2025 or even before the end of this year. With his prediction, KSI joins a list of analysts who have predicted that Bitcoin could hit the $100,000 mark before the year runs out.  Tom Dunleavy, Partner and Chief Investment Officer (CIO) at MV Capital, previously stated that BTC would rise to that price level this year. Meanwhile, Standard Chartered initially predicted that Bitcoin would hit $100,000 by year-end before taking a more bullish stance and predicting that the flagship crypto would hit $150,000 by the end of 2024.  What To Expect From BTC&#8217;s Price KSI’s prediction also echoes the sentiments of crypto analyst Rekt Capital. In a recent analysis, Rekt Capital mentioned that Bitcoin would enter a “multi-month re-accumulation” after the Bitcoin Halving, which could last up to five months. The crypto analyst noted that this period is usually characterized by Bitcoin’s tepid price movement.  Related Reading: Dogecoin Whales Go On Massive Buying Spree, Here’s How Much They’ve Bought Once that phase was over, Rekt Capital revealed that Bitcoin would break out from the re-accumulation area and make a parabolic move. This is said to be when BTC experiences “accelerated growth into a parabolic uptrend.” This phase lasts over a year, but Rekt Capital believes it may be cut in half in this market cycle with a “potential accelerated cycle occurring right now.” The accelerated cycle he refers to includes the fact that BTC hit a new all-time high (ATH) before the Bitcoin Halving. That has never happened in previous market cycles, raising the possibility of this bull market being largely different from past ones.  At the time of writing, Bitcoin is trading at around $67,400, up over 4% in the last 24 hours according to data from CoinMarketCap.  BTC bulls struggle to hold price above $67,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Forkast News, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-25T22:01:37.000Z",
    "title": "Grayscale Leads Institutional Offloading of Crypto Products As $942,000,000 Leaves Markets: CoinShares",
    "url": "https://dailyhodl.com/2024/03/25/grayscale-leads-institutional-offloading-of-crypto-products-as-942000000-leaves-markets-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutions dumped a new weekly record of $942 million in crypto products last week. In its latest Digital Asset Fund Flows report, CoinShares says the new record outflow breaks a seven-week run of record-setting inflows. &#8220;Digital asset investment products saw record weekly outflows totaling US $942 million, the first outflow following [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/25/grayscale-leads-institutional-offloading-of-crypto-products-as-942000000-leaves-markets-coinshares/\">Grayscale Leads Institutional Offloading of Crypto Products As $942,000,000 Leaves Markets: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]