[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T11:50:03.000Z",
    "title": "Team Behind Offshore Yuan, Hong Kong Dollar Stablecoins Detained by Chinese Police: Report",
    "url": "https://www.coindesk.com/policy/2023/05/31/team-behind-offshore-yuan-hong-kong-dollar-stablecoins-detained-by-chinese-police-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Earlier this year KuCoin closed a $10 million funding round into CNHC."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T11:53:28.000Z",
    "title": "AML rules for digital assets to come into effect in UAE ",
    "url": "https://cointelegraph.com/news/aml-rules-for-digital-assets-to-come-into-effect-in-uae",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/76c4fb51-3ca8-4e65-89c0-bc2a129cb427.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The licensed financial institutions would be required to identify and verify the identities of all customers.</p>\n                    <p><p>Under the new rules from the Central Bank of the UAE (CBUAE), the licensed financial institutions (LFIs) would be required to identify and verify the identities of all customers. The update will come into effect “within a month,” that is, by the end of June. </p><p>On May 31, CBUAE published a guidance for LFIs on risks, “related to virtual assets and virtual assets service providers.” A 44-page <a href=\"https://www.centralbank.ae/media/avwlktgy/cbuae-guidance-for-lfis-on-risks-related-to-virtual-assets-and-virtual-assets-providers_final-clean-version1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">document</a> specifies the news rules on Anti-Money Laundering and Combating the Financing of Terrorism (AML/CFT) for banking institutions, dealing with crypto in the Emirates. It takes into account Financial Action Task Force (FATF) global standards. </p><p>LFIs, in the Central Bank definition, are essentially all the non-crypto financial institutions, establishing a relationship with virtual asset providers (VASPs): banks, finance companies, exchange houses, payment service providers, registered hawala providers and insurance companies. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/uae-crypto-landscape-more-business-friendly-than-the-us-says-exec\"><strong><em>UAE infrastructure for crypto is more ‘business-friendly’ than the US, says exec</em></strong></a></p><p>According to the guidance, LFIs should submit a request to the central bank for non-objection to open accounts for each VASP on a case-by-case basis. Any collaboration with VASPs without national license is prohibited. </p><p>Apart from the general verification process of customers prior to any relationship, LFIs would also be required to “understand the nature of the customer’s business.” This step suggests creating a profile of the customer, including the types and volumes of transactions the customer is expected to engage in. </p><p>The LFIs would also have an obligation to monitor the volumes of non-institutional, individual customers' crypto transactions with the VASPs from “high-risk jurisdictions.” In these cases, for example, one could only transfer the virtual assets to his own account outside the UAE-licensed VASP ecosystem. </p><p>Meanwhile, CBUAE representatives met with their counterparts from the Hong Kong Monetary Authority to discuss their <a href=\"https://cointelegraph.com/news/hong-kong-uae-central-banks-collab-crypto-rules\">cooperation on virtual asset regulations</a>. The two central banks also pledged to facilitate discussions on “joint fintech development initiatives and knowledge-sharing efforts” with each region’s respective innovation hubs.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-osaka-japan/\"><strong><em>Guide to Osaka, Japan’s second-biggest city</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T11:45:00.000Z",
    "title": "Nansen Lays Off 30% Of Workforce",
    "url": "https://cryptodaily.co.uk/2023/05/nansen-lays-off-30-percent-of-workforce",
    "description": "<p>In a move to streamline operations and reduce expenses, blockchain analytics firm Nansen has announced a significant reduction in its workforce.</p>\nCEO Announces Layoffs\n<p>Blockchain analytics platform Nansen has been the latest to lay off approximately 30% of its employees, seeking to navigate the challenging economic landscape and ensure long-term sustainability.</p>\n<p>The decision, which the CEO confirmed in a public statement on Monday, comes as the firm aims to cut costs and optimize its operations, especially with the crypto markets running on a continuous slump.&nbsp;</p>\n<p>Nansen CEO, Alex Svanevik tweeted,&nbsp;</p>\n\n<p>&ldquo;This week we announced the extremely difficult decision to reduce the size of the Nansen team. I&rsquo;m endlessly grateful to the incredible people we are parting ways with. They will go on to achieve great things, and we'll ensure they get a soft landing, with severance and support.&rdquo;</p>\n\nNansen To Focus On Core Strategy\n<p>The announcement statement, penned by Svenavik, claimed that one of the reasons behind the decision was the avalanche effect of the company growing too fast, too soon. Svenavik took responsibility as CEO of the company taking on challenges that was not part of Nansen&rsquo;s core strategy and promised that the restructuring of the firm would focus on accomplishing less things but to a higher degree of quality.&nbsp;</p>\n<p>Secondly, the company also cited the less-than-ideal market conditions, claiming that their cost-base was too high relative to the company&rsquo;s status.&nbsp;</p>\nNansen Not Immune To Market Challenges\n<p>According to LinkedIn data, before the reduction, the company used to employ a 50-100 strong workforce. Major crypto-focused media publications like The Block and Bloomberg have worked with Nansen across major blockchain networks like Polygon and Ethereum. In addition, the firm has been a prominent player in the blockchain analytics industry, specializing in providing insights and intelligence for decentralized finance (DeFi) and non-fungible token (NFT) ecosystems across over 100 million crypto wallets.</p>\n<p>The layoffs, however, indicate that Nansen has been impacted by the challenges faced by the broader cryptocurrency market. Despite the rapid growth and innovation in the blockchain industry, the volatility and uncertainty inherent in the market can pose substantial risks to businesses. As such, cost-cutting measures have become necessary for many companies to maintain their financial stability.</p>\nMass Layoffs Plague Industry\n<p>The restructuring efforts at Nansen align with the broader trend of companies in the cryptocurrency and blockchain industry taking steps to ensure sustainability. The market's maturity has necessitated a more strategic approach, resulting in mass layoffs and restructuring efforts across the industry. Crypto companies like Polygon, WazirX, and Genesis have been some of the big names that have let go of significant portions of their workforce due to the unfavorable conditions in the market right now. Even entertainment giant Disney had to let go of its entire metaverse team as a part of its efforts to streamline its operations.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T11:41:57.000Z",
    "title": "Green Real Estate Project Qlindo Debuts on MEXC",
    "url": "https://cryptodaily.co.uk/2023/05/green-real-estate-project-qlindo-debuts-on-mexc",
    "description": "<p>Dubai, United Arab Emirates, May 31st, 2023, Chainwire</p><p>In a defining moment for green real estate investment accessibility, Qlindo, the innovative project making waves in sustainable investing, announces its listing on the MEXC Exchange on May 31, 2023.</p><p>Prior to this exciting development, Qlindo carved a niche of reliability and impact in the green real estate and energy sector. From successfully completing an audit by CERTIK, one of the most respected auditing firms in the crypto industry, to forging a strong alliance with TechWoodHomes, Qlindo has consistently demonstrated commitment to its mission. As a result, the first green real estate projects have been funded, bolstering Qlindo&rsquo;s impact in the market.</p><p>Moreover, despite the prevailing bear market conditions, Qlindo has maintained an impressive uptrend, appreciating by over 100% over the past year. This remarkable performance is attributed to early investors' steadfast faith in Qlindo&rsquo;s long-term vision.</p><p>The listing on MEXC will broaden Qlindo's reach, enabling a wider audience to engage with the project and fostering potential growth and interest</p><p>In the spirit of celebration, MEXC Exchange will be hosting a grand Kickstarter Token Raffle. The event features an astounding prize pool of 10,000 USDT and 890,000 QLINDO tokens to be won. Users can participate in the raffle and stand a chance to win rewards. Users can find more details and join, by visiting the MEXC Kickstarter platform.</p>Michael Marczell, COO of Qlindo, expressed his enthusiasm about the development: \"We are very pleased that the listing on MEXC makes it even easier to invest in QLINDO and, therefore, green real estate and green energy. QLINDO stands for accessible impact investing, and we are just getting started. Many thanks to MEXC.\"<p></p><p>But the exciting news doesn't end there. Qlindo is planning to announce another utility for its token in the upcoming weeks, adding even more value for its holders. While details remain under wraps, the update is set to further Qlindo's mission of making real estate investments more accessible for retail investors. #QLINDOX</p><p>Users can be part of Qlindo's groundbreaking moment by exploring the opportunities with QLINDO token. Embrace the future of green real estate and green energy investing, contributing to environmental sustainability and potential financial growth. To participate, users can create an account on the MEXC Exchange, where trading will begin on May 31, 2023.</p><p></p><p>About Qlindo</p><p>Qlindo is a project focused on bridging the gap between Blockchain Technology, and Green Real Estate and Renewable Energy Investment Opportunities. Through the QLINDO token, users are now able to invest in a diversified portfolio of green projects, led by an industry-leading expert team. The technology also allows investors to participate with their preferred amount, skipping the traditional interference of a middleman. Qlindo also collaborates with well-reputed and hand-picked real estate organizations such as TechWoodHomes to allow access to up-to-the-minute niche investments.</p><p>For more information: Official website | Twitter | Instagram | Telegram | LinkedIn</p>ContactMichael MarczellQlindom.marczell@qlindo.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T11:54:02.000Z",
    "title": "SUI caught copying Aptos’ code – Details",
    "url": "https://www.cryptopolitan.com/sui-caught-copying-aptos-code-details/",
    "description": "A recent storm has erupted in the crypto community, surrounding a curious case of alleged intellectual property theft involving SuiSwap, the rising DeFi platform. Noted for a striking similarity in its software metadata to the established AptosSwap, concerns have been raised about the originality of SUI&#8217;s software, with suggestions of copy-and-pasting rampant. Puzzling parallels between ... <a title=\"SUI caught copying Aptos&#8217; code &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-caught-copying-aptos-code-details/\" aria-label=\"More on SUI caught copying Aptos&#8217; code &#8211; Details\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T12:07:40.000Z",
    "title": "CNHC stablecoin issuer reportedly detained in China",
    "url": "https://crypto.news/cnhc-stablecoin-issuer-reportedly-detained-in-china/",
    "description": "Mystery surrounds the disappearance of the CNHC stablecoin issuance team, with speculation of police involvement and a sealed office in Shanghai. "
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T11:59:20.000Z",
    "title": "IOTA is down by over 10% as bitcoin and altcoins struggle ",
    "url": "https://crypto.news/iota-is-down-by-over-10-as-bitcoin-and-altcoins-struggle/",
    "description": "The price of MIOTA, IOTA’s native cryptocurrency, has decreased by more than 10% in the last 24 hours, making it one of the top losers of the day. Major cryptocurrencies, including bitcoin (BTC) and ether (ETH), have also witnessed corrections.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T11:49:19.000Z",
    "title": "DAVE token skyrockets 4,400% in 24 hours",
    "url": "https://crypto.news/dave-token-skyrockets-but-theres-no-one-to-verify/",
    "description": "Another meme coin DAVE has entered the arena. According to data provided by CoinMarketCap, the asset&#8217;s price has skyrocketed since its launch on May 30 at 05:00 UTC. Meme coins have amassed many holders worldwide, with the category starting in&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T11:44:25.000Z",
    "title": "Nansen slashes workforce by 30% in cost-cutting move",
    "url": "https://crypto.news/nansen-slashes-workforce-by-30-in-cost-cutting-move/",
    "description": "Blockchain analytics platform Nansen has revealed plans for a significant reduction in its workforce by 30%. The latest development comes as the company aims to streamline operations and reduce costs amidst a prolonged downturn in the crypto markets."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T11:51:35.000Z",
    "title": "Lama Technology: Bridging the Gap Between Modern and Traditional Finance Via Simplified and Regulated Platform",
    "url": "https://www.crypto-news-flash.com/lama-technology-bridges-the-gap-between-modern-and-traditional-finance-via-simplified-and-regulated-platform/?utm_source=rss&utm_medium=rss&utm_campaign=lama-technology-bridges-the-gap-between-modern-and-traditional-finance-via-simplified-and-regulated-platform",
    "description": "<p>Lama provides crypto wallets and euro accounts for individuals and companies across the European market with the help of Lama Visa Cards. Lama Technology has partnered with Ledger Hardware Wallet to provide safe custody of customers’ crypto assets. The global financial industry is experiencing a phase of intense changes through emerging technologies including Artificial Intelligence [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/lama-technology-bridges-the-gap-between-modern-and-traditional-finance-via-simplified-and-regulated-platform/\">Lama Technology: Bridging the Gap Between Modern and Traditional Finance Via Simplified and Regulated Platform</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T11:40:31.000Z",
    "title": "Green Real Estate Project Qlindo Debuts on MEXC",
    "url": "https://www.crypto-news-flash.com/green-real-estate-project-qlindo-debuts-on-mexc/?utm_source=rss&utm_medium=rss&utm_campaign=green-real-estate-project-qlindo-debuts-on-mexc",
    "description": "<p>Dubai, United Arab Emirates, May 31st, 2023, Chainwire In a defining moment for green real estate investment accessibility, Qlindo, the innovative project making waves in sustainable investing, announces its listing on the MEXC Exchange on May 31, 2023. Prior to this exciting development, Qlindo carved a niche of reliability and impact in the green real [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/green-real-estate-project-qlindo-debuts-on-mexc/\">Green Real Estate Project Qlindo Debuts on MEXC</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T12:03:17.000Z",
    "title": "Synopsis Summit Comes to Istanbul on October 5-6, 2023",
    "url": "https://coinedition.com/synopsis-summit-comes-to-istanbul-on-october-5-6-2023/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/synopsis-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/synopsis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/synopsis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/synopsis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/synopsis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/synopsis-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/synopsis.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The international web3 summit Synopsis announced that its 6th edition will be held offline in Istanbul on October 5–6, 2023. Synopsis Istanbul is devoted to all things digital economy and web3. It suits seasoned industry professionals, newcomers, projects willing to broaden their reach, and individuals eager to know where the industry is heading next. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/synopsis-summit-comes-to-istanbul-on-october-5-6-2023/\">Synopsis Summit Comes to Istanbul on October 5-6, 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T12:00:00.000Z",
    "title": "Bitcoin (BTC) Traders May Be Gearing Up for a Move to Above $30K",
    "url": "https://coinedition.com/bitcoin-btc-traders-may-be-gearing-up-for-a-move-to-above-30k/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-Price-Sellers-Shorting-BTC-Before-a-Big-Move.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The total crypto market cap dropped 1.89% over the past 24 hours according to CoinMarketCap &#8211; taking the collective total to around $1.14 trillion. During this time period, Bitcoin (BTC) had also fallen victim to the market-wide selloff, as its price dropped by 2.35%. As a result, the market leader was changing hands at $27,148.11. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-btc-traders-may-be-gearing-up-for-a-move-to-above-30k/\">Bitcoin (BTC) Traders May Be Gearing Up for a Move to Above $30K</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T11:57:05.000Z",
    "title": "Bitcoin (BTC) and Cardano (ADA) Could Drop More Over Options Expiry, Sparklo (SPRK) Builds Massive Momentum",
    "url": "https://coinedition.com/bitcoin-btc-and-cardano-ada-could-drop-more-over-options-expiry-sparklo-sprk-builds-massive-momentum/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/sparklo1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/sparklo1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/sparklo1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/sparklo1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/sparklo1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/sparklo1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/sparklo1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Cryptocurrencies have suffered a significant price drop this week as bears regained control over the market. However, things could get worse for Bitcoin (BTC) and Cardano (ADA) as options are set to expire on Friday. On the other hand, Sparklo (SPRK) continues to defy the bearish sentiment of the crypto market, building massive momentum from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-btc-and-cardano-ada-could-drop-more-over-options-expiry-sparklo-sprk-builds-massive-momentum/\">Bitcoin (BTC) and Cardano (ADA) Could Drop More Over Options Expiry, Sparklo (SPRK) Builds Massive Momentum</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T11:40:00.000Z",
    "title": "Liquidation Blocks Crucial to DeFi Risk Evaluation: Intelligence Firm",
    "url": "https://coinedition.com/liquidation-blocks-crucial-to-defi-risk-evaluation-intelligence-firm/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Defi\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Evaluating-risk-in-DeFi-protocols.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent report, market intelligence platform IntoTheBlock underscores the crucial role of liquidation blocks when evaluating risk in decentralized finance (DeFi) protocols. It highlighted that overlooking this metric could expose investors to the risk of insufficient collateral for loan repayment, especially if a liquidation remains open for an extended period. Liquidation blocks refer to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/liquidation-blocks-crucial-to-defi-risk-evaluation-intelligence-firm/\">Liquidation Blocks Crucial to DeFi Risk Evaluation: Intelligence Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-31T11:45:59.000Z",
    "title": "Solana Has Potential To Be the ‘Apple’ of Crypto, According to SOL Co-Founder Raj Gokal",
    "url": "https://dailyhodl.com/2023/05/31/solana-has-potential-to-be-the-apple-of-crypto-according-to-sol-co-founder-raj-gokal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Solana (SOL) co-founder Raj Gokal is bullish on the prospects of the layer-1 Ethereum (ETH)-rival over the long term. Gokal tells TechCrunch+ that Solana could become as dominant in the crypto space as Apple is in the consumer electronics industry. “Solana has the potential to be the Apple of crypto. I think about Apple, having [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/31/solana-has-potential-to-be-the-apple-of-crypto-according-to-sol-co-founder-raj-gokal/\">Solana Has Potential To Be the ‘Apple’ of Crypto, According to SOL Co-Founder Raj Gokal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]