[
  {
    "source": "CryptoSlate",
    "date": "2024-02-19T21:55:37.000Z",
    "title": "Ethereum price approaches $3k amidst spot ETF anticipation, Dencun upgrade",
    "url": "https://cryptoslate.com/ethereum-price-approaches-3k-amidst-spot-etf-anticipation-dencun-upgrade/",
    "description": "<p>The price of Ethereum (ETH) approached $3,000 on Feb. 19 amidst anticipation concerning developments that are expected to occur in the coming months. As of 8:35 pm UTC, ETH was priced at $2,937 with a market capitalization of $352.96 billion. That change represents 4.12% growth over 24 hours — significantly greater than Bitcoin&#8217;s 0.4% gains [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-price-approaches-3k-amidst-spot-etf-anticipation-dencun-upgrade/\">Ethereum price approaches $3k amidst spot ETF anticipation, Dencun upgrade</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-19T21:47:20.000Z",
    "title": "Bitcoin, Ethereum lead crypto in $145m liquidation day",
    "url": "https://crypto.news/bitcoin-ethereum-crypto-liquidation/",
    "description": "Bitcoin and Ethereum led cryptocurrencies in liquidations as over 54,000 traders saw leveraged positions wiped out, and the total market cap neared $2.1 trillion."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T22:00:32.000Z",
    "title": "Hedera (HBAR) Soars 50% To Mark New 20-Month High, Fuels Bullish Price Targets",
    "url": "https://www.newsbtc.com/news/hedera-hbar-soars-50-to-mark-new-20-month-high-fuels-bullish-price-targets/",
    "description": "Hedera (HBAR), a decentralized public network known for its near real-time consensus and developer-friendly environment, has emerged as one of the top-performing altcoins in the cryptocurrency market.  As the overall market experiences a resurgence of bullish sentiment, HBAR has demonstrated impressive growth, positioning itself as one of the leaders among the top 100 cryptocurrencies by market capitalization. Trading Volume For HBAR Spikes 200% Over the past fourteen days, HBAR has recorded substantial gains, surging by nearly 50%. This upward momentum extends to the thirty-day and year-to-date time frames, with gains of 36.8% and 15%, respectively.  In the past seven and twenty-four hours alone, HBAR&#8217;s price has continued its bullish trajectory, skyrocketing by 33.5% and 17%, respectively. These price movements have propelled HBAR beyond its previous 19-month high of $0.1015, reaching a new 20-month high of $0.1060.  Related Reading: Bitcoin On Steroids: Key Technical Factors Fueling The Rally To $70,000 The surge in trading volume, which currently stands at $218,438,657 in the last 24 hours, reflects the increased market activity surrounding HBAR, representing a 204.90% increase from one day ago, according to CoinGecko data.  Despite HBAR&#8217;s impressive performance, the road to its all-time high (ATH) of $0.5759, achieved in September 2021, presents a formidable challenge. Currently facing an almost two-year downtrend structure, HBAR would require a staggering 443% uptrend to reclaim its previous milestone. In the near term, HBAR faces a crucial hurdle at the $0.110 level, which must be defended to prevent further gains. A breach of this level would open the door for testing the $0.1148 and $0.1285 resistance walls.  Should bullish momentum persist, attention will then shift to the resistance at $0.1506, followed by $0.1690 and $0.1822. These levels represent the final obstacles before potentially reaching the $0.2000 mark, a threshold not surpassed since April 2022.  On the downside, the $0.0855 level is expected to act as a support, preventing HBAR from establishing a lower low within the current market uptrend structure. Hedera Network Welcomes Mondelēz International As the adoption of cryptocurrencies gains momentum among major companies worldwide, the Hedera Council, responsible for overseeing the Hedera public network, has recently announced a series of significant partnerships.  One notable addition to the Council is Mondelēz International (Nasdaq: MDLZ), a prominent multinational food company renowned for its global brands, including Oreo, Ritz, LU, Clif Bar, Cadbury Dairy Milk, Milka, and Toblerone. On February 14, the Hedera Council revealed that Mondelēz International had joined its ranks. This collaboration marks a significant milestone as Mondelēz International, with its mission to empower people to “snack right”, sets its sights on leveraging distributed ledger technology (DLT)-based solutions on the Hedera network.  Per the announcement, the initial focus of the partnership will revolve around digital transformation initiatives, supply chain management, and enhancing core business processes to deliver elevated customer experiences. With an emphasis on digital transformation, Mondelēz International seeks to streamline processes, enhance transparency, and optimize supply chain management using the Hedera infrastructure. Related Reading: Bitcoin Spot ETFs: Issuers Set New Record As Weekly Inflows Cross $2.2 Billion All around, the Hedera protocol and its native token HBAR have experienced substantial growth in market capitalization, trading volume, and partnerships, reflecting the increasing interest from investors in the protocol&#8217;s offerings. This positive environment sets the stage for future growth and development of the protocol. However, it remains to be seen whether HBAR can sustain investor attention and continue to achieve price gains, considering the possibility of market corrections following the significant gains recorded in the past 30 days. Nonetheless, HBAR appears well-positioned to emerge as one of the top-performing altcoins in the current bull run. Featured image from Shutterstock, chart from TradingView.com"
  }
]