[
  {
    "source": "Decrypt",
    "date": "2023-10-18T23:03:32.000Z",
    "title": "Can a Shiba Inu Break a Video Game Speedrun Record?",
    "url": "https://decrypt.co/202268/can-shiba-inu-break-video-game-speedrun-record",
    "description": "Peanut Butter aims to be top dog at Gyromite, as the Shiba Inu will show off his skills at January’s AGDQ speedrunning event."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-18T22:56:31.000Z",
    "title": "CZ, Shaq and ‘Unethical Shit’: Twitter DMs Examined in Sam Bankman-Fried Trial",
    "url": "https://decrypt.co/202241/cz-shaq-unethical-shit-sam-bankman-fried-trial-twitter-dms",
    "description": "The disgraced crypto mogul's Twitter DMs were examined in court today. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T23:00:55.000Z",
    "title": "Cardano (ADA) Getting Ready To Explode: Analyst Presents 16,500% Blowout",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-16500-blowout/",
    "description": "Cardano (ADA) has been stuck in an accumulation zone for a couple of months now and has not seen the kind of run-up other large cryptocurrencies have experienced. This continued accumulation as well as trading in a very tight range could mean a very significant breakout when it finally happens and one crypto analyst has predicted an incredible surge along these lines. Cardano Could See A 16,500% Surge Tim Warren, one of the hosts of the Investing Broz show on Discord, took to X (formerly Twitter) to share a rather bullish Cardano chart. In the chart, Warren points out Cardano’s previous price performance which has been nothing short of phenomenal. Related Reading: Cardano Whale Addresses Continue To Fall, What Does This Mean For ADA Price? As the chart shows, the ADA price had fallen around 98% from its prior all-time high which it had hit in 2018. By 2020, ADA’s price was sitting as low as $0.018, but the imminent turnaround would take the entire market by surprise. ADA would go on to rally a total of 16,500% by the time it hit its new all-time high of $3.10 in 2021. Chart shows 16,500% ADA rally &#124; Source: X Applying this historical performance to the current price level of ADA could suggest another such rally. Cardano’s price is currently sitting around 92% below its all-time high, which puts it close to the same level it was back in 2020. If ADA sticks to this historical performance and does a repeat, a 16,500% surge from the current price level would put the digital asset’s price at $40 at its peak. ADA continues to trade in a tight range &#124; Source: ADAUSD on Tradingview.com The Value Proposition Of ADA Responding to Warren’s post, another X user, Chris O chimes in with the value proposition of the digital asset. Chris, who is the founder of Ghost Fund DAO, a protocol on Cardano, explained that ADA’s previous 16,500% surge had happened without having support for smart contracts and decentralized finance (DeFi), among others. But now that the network supports this, the founder believes this could trigger a large rise. Chris points to the presence of DeFi, a rising Total Value Locked (TVL), non-fungible tokens (NFTs), and sidechains which are now prominent on the network. He also points out the various protocols which have been launched on the network across these different sectors. #Cardano fam, simple chart showing FUTURE opportunity. Without SC, CNT’s, Defi, $ADA did 165x from bear bottom. Now with SC, Defi/booming TVL, NFT’s, Projects such as @book_io, @CornucopiasGame, @Indigo_protocol, @IagonOfficial, etc…, along with Hydra, Marlowe, Mithril,… https://t.co/EChPO0SSLH — Chris O (@TheOCcryptobro) October 14, 2023 As Chris points out, ADA had done a “165x from bear bottom” without Cardano having support for all of the sectors listed above. So he believes that “A 25x &#8211; 40x is a very reasonable expectation. Drown out the noise.” Related Reading: Meme Coins That Are Ripe For The Picking Following $3.2 Billion Crash Chris referred to Warren’s chart as a “simple chart showing FUTURE opportunity.” However, if ADA were to make a repeat of its 2020-2021 rally, a 40x would only be the beginning for the digital asset. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from CoinMarketCap, chart from TradingView.com"
  }
]