[
  {
    "source": "Cointelegraph",
    "date": "2023-06-24T06:03:22.000Z",
    "title": "Mainstream media challenge decision to protect FTX customers: Report",
    "url": "https://cointelegraph.com/news/media-outlets-challenge-privacy-ftx-customers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e1832635-6bb8-465b-9c14-b7001e51b2b0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Legal representatives for the media outlets argued that FTX is not entitled to a “novel and sweeping exception” because it deals in crypto.</p>\n                    <p><p>The four major media outlets advocating for the release of FTX customer names have opposed the decision to seal them. Meanwhile, a crypto lawyer told Cointelegraph that “there is clear evidence” of potential harm if the names were to be disclosed.</p><p>According to a Reuters <a href=\"https://www.reuters.com/legal/news-organizations-challenge-court-decision-ftx-customer-privacy-2023-06-23/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> published on June 23, Bloomberg, Dow Jones &amp; Company, The New York Times Company, and the Financial Times appealed Judge Dorsey’s June 9 ruling, <a href=\"https://cointelegraph.com/news/ftx-permission-permanently-redact-customer-names\">which granted FTX to</a>“permanently redact” the names of individual customers from all filings for their safety.</p><p>However, legal representatives for the media organizations reportedly argued that FTX is not entitled to a “novel and sweeping exception” to bankruptcy disclosure requirements simply because its “customers used cryptocurrency.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Media group appeals decision to permanently redact the names of a million FTX customers.<br><br>We believe keeping the customer list a trade secret is vital to improve recovery for all in bankruptcy reorganisation.<br><br>Seeking to further harm people who are already down is unfortunate. <a href=\"https://t.co/0fbpvIE9We\">pic.twitter.com/0fbpvIE9We</a></p>&mdash; FTX 2.0 Coalition (@AFTXcreditor) <a href=\"https://twitter.com/AFTXcreditor/status/1672142097330184192?ref_src=twsrc%5Etfw\">June 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The media outlets have stood by the fact that bankrupt companies are usually obligated to disclose the names and amounts owed to their creditors.</p><p>Despite this, Dorsey made the decision on June 9 to keep the names sealed stating that he wants to ensure the customers “are protected and they don’t fall victim to any scams.”</p><p>This is in line with the exception in U.S. bankruptcy law that addresses the potential risk of identity theft or other harm.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-claw-700-million-sam-bankman-fried-friend-investment-firm\"><strong><em>FTX seeks to claw $700M from Bankman-Fried friends and affiliated funds</em></strong></a></p><p>Speaking to Cointelegraph, Dubai-based crypto lawyer Irina Heaver said she applauds the wisdom behind the Judge’s ruling “in allowing FTX to keep customer names confidential.”</p><p>“This appeal by media organizations seems to completely overlook the unique risks faced by the individuals if their identities are revealed” Heaver stated.</p><blockquote>“This is not a hypothetical concern, there is clear evidence of the harm that can be caused by such disclosure. With 9 million users, the potential for widespread financial and personal damage is colossal.”</blockquote><p>Heaver pointed at the “Celsius case,\" as an example, which led to “a surge in phishing attacks” in July 2022.</p><p>Celsius depositors received a <a href=\"https://cointelegraph.com/news/phishing-risks-escalate-as-celsius-confirms-client-emails-leaked\"></a><a href=\"https://cointelegraph.com/news/phishing-risks-escalate-as-celsius-confirms-client-emails-leaked\">warning email after</a> the company disclosed that certain customer data had been compromised.</p><p>The breach occurred due to an internal employee leaking a list of emails to a third-party bad actor.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]