[
  {
    "source": "CryptoGlobe",
    "date": "2024-02-01T06:18:34.000Z",
    "title": "Heroes of Mavia Launches Its Anticipated Game on iOS and Android with Exclusive Mavia Airdrop Program",
    "url": "https://www.cryptoglobe.com/latest/2024/02/heroes-of-mavia-launches-its-anticipated-game-on-ios-and-android-with-exclusive-mavia-airdrop-program/",
    "description": "Hanoi, Vietnam, January 31st, 2024, Chainwire Heroes of Mavia, a groundbreaking Web3 AAA mobile base builder strategy game, is now available in the iOS and Android app stores. This launch marks a new era in gaming, merging the thrill of strategy gameplay with the innovative aspects of Web3 technology. After a successful private beta period of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T06:26:03.000Z",
    "title": "African Development Bank Visionary Approach to Multilateral Development",
    "url": "https://www.cryptopolitan.com/african-development-bank-visionary-approach-to-multilateral-development/",
    "description": "TL ; DR The African Development Bank (AfDB) has successfully issued a $750 million perpetual hybrid capital note, marking a historic moment for multilateral development banks. This financial approach, a first for institutions facing mounting pressures to enhance lending capabilities, comes as the G20 group urges such entities to explore innovative financing structures. The aim [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T06:19:37.000Z",
    "title": "Central Banks Warned of Risks in Embracing AI Tools",
    "url": "https://www.cryptopolitan.com/central-banks-warned-of-risks-in-ai-tools/",
    "description": "In a recent report by the Bank for International Settlements (BIS), central banks worldwide have been cautioned about the inherent risks associated with their growing reliance on artificial intelligence (AI) tools. This nine-page report titled &#8220;Artificial Intelligence in Central Banking&#8221; sheds light on the use cases and potential pitfalls of integrating large language models (LLMs) [&#8230;]"
  }
]