[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T21:59:13.000Z",
    "title": "Crypto Detective ZachXBT Faces Defamation Lawsuit",
    "url": "https://www.coindesk.com/business/2023/06/16/crypto-detective-zachxbt-faces-defamation-lawsuit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "MachiBigBrother has sued ZachXBT for an investigation the latter published in June 2022 alleging the trader stole tens of millions of dollars worth of crypto."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-16T22:02:56.000Z",
    "title": "BlackRock Bitcoin ETF Is the ‘Real Deal’—Is This Finally the One?",
    "url": "https://decrypt.co/145000/blackrock-bitcoin-etf-real-deal",
    "description": "For 10 years, crypto startup after crypto startup has tried its luck with the SEC. Now Wall Street’s heaviest hitter is lending its weight."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T21:39:50.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $3.70 with a 24-hour trading volume of $91,126,116.  Filecoin is up 2.77% in the last 24 hours. The current CoinMarketCap ranking is #31, with a live market cap of $1,593,641,398. It has a circulating supply of 430,698,921 FIL coins and the max. supply is ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T22:00:52.000Z",
    "title": "XRP Allegedly Attacked By SEC’s Hinman For Ethereum’s Benefit",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-allegedly-attacked-by-secs-hinman-for-ethereums-benefit/",
    "description": "The legal battle between Ripple and the Securities and Exchange Commission (SEC) has taken a new twist as top lawyers accuse former SEC Director William Hinman of being paid to attack XRP in favor of Ethereum (ETH).  Following the release of Hinman&#8217;s emails and drafts of his June 2018 speech, pro-XRP attorney John Deaton expressed his frustration with the intent of the released documents on a recent live CryptoLaw podcast.  Related Reading: Bitcoin Bullish Momentum Building: Expert Predicts Rise To $27,200 Payments To Disparage XRP In Favor Of Ethereum? Jeremy Hogan, lawyer and cryptocurrency expert, also weighed in on the matter alleging that former SEC Director of Corporate Finance, Bill Hinman, was paid to give a speech in which he declared that Ethereum was not a security.  According to Hogan, Ripple, a leading cryptocurrency company, has suggested that Hinman was paid by the Ethereum Foundation or someone related to Ethereum to give the speech and give Ethereum a free pass. Hogan&#8217;s claims are based on email exchanges between Hinman and his colleagues, which reportedly show that Hinman had already named his first email &#8220;the Ether speech&#8221; before he began crafting the speech.  This, according to Hogan, suggests that &#8220;right from the get-go&#8221;, Hinman is saying that ETH is not a security, and that was the point of him making the speech. Hinman&#8217;s speech, which was delivered in 2018, was seen by many in the cryptocurrency industry as a landmark moment in which the SEC effectively declared that Ethereum was not a security.  This was seen as a significant victory for Ethereum and the wider cryptocurrency industry, as it provided clarity on how the SEC would regulate cryptocurrencies. However, Hogan has suggested that the speech was not only a free pass for Ethereum but also an attack on XRP, which was at the time Ethereum&#8217;s biggest competition. Hogan&#8217;s claims are based on Ripple&#8217;s ongoing legal battle with the SEC, in which Ripple has argued that XRP is not a security and should not be regulated as such. Related Reading: Percentage Of ETH Addresses In Profit Reaches 5-Month Low Hogan&#8217;s allegations are likely to fuel speculation about the relationship between the SEC and the cryptocurrency industry, and the extent to which the SEC&#8217;s decisions are influenced by external factors. However, it is important to note that Hogan&#8217;s claims are based on speculation and have not been proven. At present, the value of XRP stands at $0.4731, indicating a marginal recovery of 0.6% over the past day. This comes after a dip to $0.4564 on Wednesday. Despite the recent drop, XRP enthusiasts remain optimistic and are looking forward to a positive outcome that could potentially boost the cryptocurrency&#8217;s price to a new yearly high, surpassing the $0.5833 mark hit in May.  This could position XRP, the sixth largest cryptocurrency on the market, in a favorable position to reach the $1 milestone. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-16T22:01:57.000Z",
    "title": "Billionaire Mike Novogratz Says BlackRock Filing for a Bitcoin ETF Is the Best Thing That Could Happen to BTC",
    "url": "https://dailyhodl.com/2023/06/16/billionaire-mike-novogratz-says-blackrock-filing-for-a-bitcoin-etf-is-the-best-thing-that-could-happen-to-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/blackrock-launches-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire Mike Novogratz says that BlackRock filing for a Bitcoin (BTC) exchange-traded fund (ETF) is the best thing that could happen to the king crypto. In a new interview on The Claman Countdown, the Galaxy Digital chief executive says that he’s hoping for BlackRock, an investment firm with over $10 trillion in assets under management, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/16/billionaire-mike-novogratz-says-blackrock-filing-for-a-bitcoin-etf-is-the-best-thing-that-could-happen-to-btc/\">Billionaire Mike Novogratz Says BlackRock Filing for a Bitcoin ETF Is the Best Thing That Could Happen to BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]