[
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T22:40:22.000Z",
    "title": "Exchanges freeze $2M in crypto stolen from Atomic Wallet in June",
    "url": "https://cryptoslate.com/exchanges-freeze-2m-stolen-during-atomic-wallet-thefts-in-june/",
    "description": "<p>On Oct. 19, Atomic Wallet announced that several cryptocurrency exchanges have frozen funds suspected to be stolen from user wallets during an unauthorized transaction activity reported this summer. Atomic Wallet acknowledged that it began to receive reports on June 3 from users who reported unauthorized transactions. Among other measures, Atomic Wallet began to work with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/exchanges-freeze-2m-stolen-during-atomic-wallet-thefts-in-june/\">Exchanges freeze $2M in crypto stolen from Atomic Wallet in June</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T23:00:30.000Z",
    "title": "FBI Busts Indian Citizen Group For $15 Million Crypto-To-Cash Money Laundering Scheme",
    "url": "https://www.newsbtc.com/news/fbi-busts-indian-citizen-group-for-15-million-crypto-to-cash-money-laundering-scheme/",
    "description": "In a recent crypto investigation, the US FBI successfully infiltrated a group of Indian citizens suspected of engaging in illicit activities involving the exchange of cryptocurrency for over $15 million in cash.  The alleged transactions took place at various locations in Westchester County, with the group catering to customers seeking anonymity for their activities. Crypto Crime Unveiled According to recent reports, five out of the six suspects were apprehended on October 17 and subsequently charged in US District Court, White Plains.  The charges primarily revolve around operating an unlicensed money-transmitting business. The investigation unfolded with the assistance of law enforcement agents who monitored 80 “cash hand-offs”.  Related Reading: xDay 2023: Elon Musk’s X Competitor? xPortal Unveils Rival Features The FBI&#8217;s scrutiny began in April 2021 when they identified a suspect operating within the &#8220;dark web&#8221; criminal marketplaces.  Although the individual remains unnamed in the criminal complaint, they are believed to be a co-conspirator of the arrested local suspects. Notably, the suspect offered to ship cash to customers in exchange for cryptocurrency. According to the complaint, the unidentified co-conspirator disclosed to an undercover officer in January that some of their customers were involved in drug sales, while their wealthier clients were hackers.  The co-conspirator claimed to have amassed approximately $30 million over three years by exchanging cash for cryptocurrency. In February, an individual responsible for mailing packages of cash on behalf of the co-conspirator was arrested. The complaint reveals that this individual had been receiving sacks of cash from various individuals, three times a week for 18 months, at a Westchester County post office. The cash bundles ranged from $100,000 to $300,000. In a bid to receive leniency during sentencing, the aforementioned individual agreed to assist the FBI with their investigation. Over several months (from February 10 to September 27), they allegedly participated in 80 controlled cash pick-ups amounting to $15,067,000. One of the arrested individuals, Raju &#8220;Jay&#8221; Patel from Flushing Queens, played a significant role in the operation. The complaint alleges his involvement in 58 cash transfers totaling $10.8 million.  Raju would collect cash from various locations in George, Massachusetts, North Carolina, Pennsylvania, and South Carolina. Subsequently, Raju allegedly coordinated the transfers with the co-conspirator and the FBI&#8217;s confidential source. On March 6, Raju allegedly arranged an exchange of $250,000 at a Tarrytown supermarket parking lot. Surveillance conducted by law enforcement agents captured Raju leaving his Queens apartment with an orange cloth bag, which he handed over to the FBI&#8217;s confidential source upon arrival in Tarrytown. The bag reportedly contained $249,715. Illicit Cash Exchange Similar exchanges took place at a parking lot in Port Chester, further implicating the suspects involved. On August 6, Shaileshkumar Goyani allegedly handed over a bag containing $114,000 to the FBI&#8217;s confidential source. Apart from Goyani, the complaint identifies Brijeshkumar &#8220;Samir&#8221; Patel, Hirenkkumar Patel, Naineshkumar Patel, and Nileshkumar Patel as additional suspects in the case.  All the suspects are charged with operating an unlicensed money-transmitting business under New York and federal laws. Related Reading: Bulls Thrust Solana To $25 – What Traders Should Expect Next According to an affidavit by FBI agent Lawrence Lonergan, such unlicensed money-transmitting businesses operate as shadow banks, enabling funds to pass through without undergoing the scrutiny imposed by Congress on the United States financial system. While the allegations against Goyani&#8217;s crypto fraud remain unproven, his defense attorney, Daniel A. Hochheiser, emphasizes that his client has not been indicted by a grand jury. Hochheiser further stated that if and when an indictment is issued, Goyani intends to enter a plea of not guilty. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T22:41:09.000Z",
    "title": "JP Morgan Predicts Christmas Gift for Crypto: SEC Approval of Bitcoin ETF",
    "url": "https://www.crypto-news-flash.com/jp-morgan-predicts-christmas-gift-for-crypto-sec-approval-of-bitcoin-etf/?utm_source=rss&utm_medium=rss&utm_campaign=jp-morgan-predicts-christmas-gift-for-crypto-sec-approval-of-bitcoin-etf",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JpMorgan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />JPMorgan analysts suggest that a spot Bitcoin ETF could be approved and available on the market by Christmas, while Bloomberg Intelligence analysts also predict a 90% likelihood of approval in January. Coinbase&#8217;s chief legal officer, Paul Grewal, expresses confidence that the SEC will grant approval soon. Amid all the current developments surrounding the spot Bitcoin [...]"
  }
]