[
  {
    "source": "Decrypt",
    "date": "2023-10-12T21:20:36.000Z",
    "title": "SBF Trial Live Updates: Did Alameda 'YOLO' FTX Customer Funds?",
    "url": "https://decrypt.co/199892/trial-sam-bankman-fried-live-blog-latest-news-insights",
    "description": "FTX founder Sam Bankman-Fried faces seven criminal charges related to the dramatic collapse of his crypto empire. Here's the latest on his trial."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T21:30:00.000Z",
    "title": "Trader Joe’s grocery store files trademark lawsuit against Trader Joe DEX",
    "url": "https://cointelegraph.com/news/trader-joe-trademark-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ebe35309-2d62-43f6-b68c-3dcc89903d41.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Among the claims included allegations of federal trademark infringement and dilution, with Trader Joe allegedly capitalizing on the store's \"name, goodwill, and brand recognition\".</p>\n                    <p><p>Lawyers representing United States supermarket chain Trader Joe’s have filed a complaint in California against decentralized exchange Trader Joe.</p><p>In an Oct. 5 filing in U.S. District Court for the Central District of California, Trader Joe’s sued Trader Joe and its co-founder Cheng Chieh Liu over federal trademark infringement and dilution claims. According to the lawsuit, Trader Joe and Liu used many of the supermarket’s ideas from “donning a red cap” — red features prominently in the store’s branding — as well as its narrative for one of the platform’s fictionalized characters.</p><p>“Defendants committed fraud to obscure that origin story and to prevail in international legal proceedings with Trader Joe’s over the domain name, recognizing that the true story would doom their case and any plausible claim of right to use the traderjoexyz.com domain,” said the lawsuit.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e2e58bc9-820a-4350-9bda-e47ebfcdb233.jpeg\"><figcaption style=\"text-align: center;\"><em>Trader Joe's location in Austin, Texas. Photo by Cointelegraph.</em></figcaption></figure><p>“Trader Joe’s sent Defendants cease-and-desist letters demanding that they stop using the ‘Trader Joe’ name,” said the lawsuit. “Well after Trader Joe’s demanded that they stop, Defendants continued capitalizing on Trader Joe’s name, goodwill, and brand recognition — built up through Trader Joe’s investment across more than half a century — to peddle their own goods and services.”</p><p>The store’s lawyers pointed to Trader Joe using “confusingly similar” names on the exchange’s website, YouTube page, Reddit, Github, LinkedIn, Substack, CoinMarketCap, Telegram, and Discord. Within the content of some of these accounts, according to the lawsuit, Trader Joe using the possessive form of its name — i.e. “Trader Joe’s” — matched the supermarket chain’s “exact word mark” registered as a trademark.</p><p>“Most courts use like 7 or 8 different factors to assess and make a determination as to whether there’s infringement in a given case,” trademark and copyright lawyer Michael Keyes told Cointelegraph. “The relatedness of the goods is just one of the factors [...] one is the similarity of the marks. Here you’ve got Trader Joe’s and Trader Joe. For all intents and purposes, they’re identical at least in terms of how they sound.”</p><p>Keyes added that he believed Trader Joe’s had a stronger case as the business had a recognizable brand in the U.S., which could result in an injunction against Trader Joe forcing the platform to stop using its name. According to the attorney, the dilution claim in the case could also be something to watch out for, as it tends to focus on protecting famous recognizable brands.</p><blockquote>“I think both claims are pretty strong. I think dilution is probably stronger [...] for dilution you don’t have to show that the goods are related. The caveat being, in order to have a claim for dilution, you need to show that your trademark is truly famous, which means widespread recognition among U.S. consumers.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/trader-joe-joins-top-5-dex-list-as-liquidity-book-model-thrives-on-arbitrum\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/trader-joe-joins-top-5-dex-list-as-liquidity-book-model-thrives-on-arbitrum/amp\"><strong><em>Trader Joe joins top 5 DEX list as Liquidity Book model thrives on Arbitrum</em></strong></a></p><p>Lawsuits involving trademark infringement between crypto firms and companies operating in a completely different sector do arise from time to time. In 2021, major U.S. fast food chain Jack in the Box <a href=\"https://cointelegraph.com/news/jack-in-the-box-claims-in-court-ftx-us-ripped-off-its-character-to-create-moon-man\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/jack-in-the-box-claims-in-court-ftx-us-ripped-off-its-character-to-create-moon-man/amp\">sued crypto exchange FTX US</a> — currently in the middle of bankruptcy proceedings — over alleged similarities between its ‘Moon Man’ character and the firm’s ‘Jack’ mascot.</p><p>Trader Joe's opened its first store in California in 1967 and has more than 500 locations around the United States. In contrast, Trader Joe is <a href=\"https://cointelegraph.com/news/trader-joe-takes-its-first-step-into-the-ethereum-ecosystem\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/trader-joe-takes-its-first-step-into-the-ethereum-ecosystem/amp\">one of the top-ranked decentralized exchanges</a> in the crypto space, allowing liquidity providers to add liquidity in designated “price bins” to improve capital efficiency. Cointelegraph reached out to Trader Joe for comment, but did not receive a response at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\"><strong><em>Get your money back: The weird world of crypto litigation</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-12T21:10:37.000Z",
    "title": "Google rolls out in-search AI text-to-image generator for select users",
    "url": "https://cryptoslate.com/google-rolls-out-in-search-ai-text-to-image-generator-for-select-users/",
    "description": "<p>Google announced in an Oct. 12 announcement that it is allowing some users to create AI-generated images through its main search bar. The new feature allows users to submit a prompt and receive up to four image results that users can later refine with additional information. The company said that the feature is available to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/google-rolls-out-in-search-ai-text-to-image-generator-for-select-users/\">Google rolls out in-search AI text-to-image generator for select users</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-12T21:36:39.000Z",
    "title": "Top 6 Crypto AI Projects in 2023",
    "url": "https://cryptodaily.co.uk/2023/10/top-6-crypto-ai-projects-in-2023",
    "description": "The current landscape of digital assets is seeing a significant shift as the convergence of artificial intelligence (AI) and blockchain technology takes place"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-12T21:30:03.000Z",
    "title": "Arbitrum Sale On Binance: How This Investment Firm Lost $465,000 In An ARB Trade",
    "url": "https://www.newsbtc.com/analysis/arb/arbitrum-sale-on-binance-how-this-investment-firm/",
    "description": "Recent transactions by Arca, a prominent investment firm, involving Arbitrum native token ARB, have again put them under the spotlight. According to on-chain tracking platform Lookonchain, the firm has suffered a substantial loss nearing half a million recently. Arca&#8217;s Arbitrum Shipment to Binance Lookonchain reported earlier today that Arca transferred roughly 1.49 million ARB tokens to Binance. With a value of around $1.21 million, this transaction indicates a possible liquidation of Arca&#8217;s holdings in Arbitrum (ARB). Related Reading: Arbitrum: What’s In Store For ARB Token After Unlock? If this were the case, according to Lookonchain, it would translate into a significant loss of $465,000 for the investment firm. Notably, as significant as it seems, the ARB token transaction isn&#8217;t an isolated case of Arca&#8217;s investments not panning out as anticipated. Loononchain noted: &#8220;Arca&#8217;s investment this year appears to be terrible.&#8221; An analytical dive into the firm&#8217;s past decisions has shown similar patterns. For instance, Arca&#8217;s foray into GMX and DYDX left them with losses of $231,000 and $304,000, respectively. Their stakes in DPX and SYN further compounded their negative streak, resulting in losses of $142,000 and $107,000. Arca (@arca) deposited 1.49M $ARB ($1.21M) to #Binance at a price of $0.815 5 hours ago and is expected to lose $465K. Arca&#8217;s investment this year appears to be terrible. Lost $213K on $GMX, $304K on $DYDX, $142K on $DPX, $107K on $SYN; Only made a profit of $294K on $RDNT. pic.twitter.com/qPSuZc4MSA — Lookonchain (@lookonchain) October 12, 2023 Silver Linings Amid Investment Storms However, it&#8217;s crucial to note that not all is gloomy for Arca. Investment is as much about strategy as it is about timing, and while the firm has faced setbacks, they&#8217;ve also had its share of victories. An example is their investment in RDNT, which proved profitable, netting them a profit of $294,000, according to the on-chain tracking platform. Furthermore, Arca is not alone in its recent losses with Arbitrum. The ARB token has seen a decline of nearly 10% over the past week and 1.2% in just the last day, ensnaring numerous traders in its bearish trajectory. Data from Coinglass indicates that Arbitrum has witnessed total liquidations amounting to approximately $376,160 in the past 24 hours alone. A significant portion of these liquidations were long positions, valued at $282,120, compared to short positions at a mere $93,840. This data suggests that many traders were optimistic about ARB&#8217;s potential to follow a bullish trend. However, starkly contrasting their expectations, they faced significant losses. Related Reading: Arbitrum Price Sinks To A New All-Time Low – What Is Behind This Decline? When writing, the ARB token is trading at $0.72, marking a significant drop of roughly 90% from its all-time high of $8.67 recorded just seven months ago in March. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-12T21:10:00.000Z",
    "title": "Celsius (CEL) Move 653 Million Tokens to a New Wallet: To What End?",
    "url": "https://coinedition.com/celsius-cel-move-653-million-tokens-to-a-new-wallet-to-what-end/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Celsius Debtors Seek to Merge CNL, LLC Amid Record-keeping Deficiency\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Celsius-Debtors-Seek-to-Merge-CNL-LLC-Amid-Record-keeping-Deficiency-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Decentralized lending project Celsius (CEL) has transferred a substantial amount of its holdings to a new wallet. Cam Crews, who is a developer, made it known that CEL tokens were not the only cryptocurrencies involved in the movement. According to Crews, Celsius transferred about $30 million worth of Ethereum (ETH) and other stablecoins alongside $84.33 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/celsius-cel-move-653-million-tokens-to-a-new-wallet-to-what-end/\">Celsius (CEL) Move 653 Million Tokens to a New Wallet: To What End?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]