[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T16:51:08.000Z",
    "title": "StepStone VC Raises $97M for Two Blockchain Funds",
    "url": "https://www.coindesk.com/business/2023/05/31/stepstone-vc-raises-97m-for-two-blockchain-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "SEC filings show pooled investment figures for the two private equity funds."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T16:42:58.000Z",
    "title": "Binance plans new round of layoffs amid increased regulatory scrutiny ",
    "url": "https://cointelegraph.com/news/binance-plans-new-round-of-layoffs-to-address-increased-regulatory-scrutiny",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/629a93ea-6d43-414a-9b58-3c41c57d826a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance's chief strategy officer Patrick Hillmann hinted on Twitter the resource reorganization is meant to address growing regulatory pressures targeting the crypto space.</p>\n                    <p><p>A fresh headcount reduction is coming to crypto exchange Binance, which is<a href=\"https://twitter.com/WuBlockchain/status/1663890209526927373\" target=\"_blank\" rel=\"noopener nofollow\"> reportedly</a> planning to lay off 20% of its workforce in June. The job cuts come after the company said earlier this year it would not lay off any employees.</p><p>According to the exchange, the decision is not a downsizing but rather a resource reallocation. \"As we prepare for the next major bull cycle, it has become clear that we need to focus on talent density across the organization to ensure we remain nimble and dynamic,\" a spokesperson told Cointelegraph. </p><p>On Twitter, Binance's chief strategy officer Patrick Hillmann <a href=\"https://twitter.com/PRHillmann/status/1663925648182607872\" target=\"_blank\" rel=\"noopener nofollow\">hinted</a> the reorganization is meant to address growing regulatory pressures targeting the crypto space:</p><blockquote>\"Regulators in almost every major market are also working overtime to provide greater clarity for their expectations of the industry and the asset class more broadly, which is putting even more pressure on orgs to adapt or fall by the wayside.”</blockquote><p>Also, according to Hillmann, a precise number of layoffs has yet to be determined. \"Like previous exercises, this will be done after several teams (including HR, Risk, and Operations) finalize that talent density audit,\" he continued. </p><p>At the time of writing, Binance's career page <a href=\"https://www.binance.com/en/careers/job-openings\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> 326 open positions spanning several departments and locations. During the latest bull market, Binance's headcount grew from approximately 3,000 to nearly 8,000, with staff located across Europe, the Americas, the Middle East, Africa and Asia.</p><p>In March, a Binance spokesperson told Cointelegraph that the company was seeking to fill over 500 roles by the end of June: “As of today, we are actively hiring for more than 500 roles with the goal of filling them by the end of H1 [...] We are not planning any layoffs.” Moreover, in January Binance CEO Changpeng Zhao <a href=\"https://www.cnbc.com/2023/01/11/binance-plans-15-30percent-hiring-spree-in-2023-even-as-rivals-cut-jobs.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the firm was planning for a hiring spree in 2023, increasing its headcount between 15% and 30%. </p><p>Crypto community members quickly <a href=\"https://twitter.com/cobie/status/1663895367279099905\" target=\"_blank\" rel=\"noopener nofollow\">reacted</a> to the news, reviving Zhao's previous tweets about crypto exchange layoffs.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/55799cbc-d128-4ec1-b782-5a1000232b30.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Screenshot: Changpeng Zhao, CEO of Binance, warns users on Twitter on Nov. 30, 2022.</em></figcaption></figure><p>Binance <a href=\"https://cointelegraph.com/news/binance-concealed-ties-to-china-for-years-even-after-2017-crypto-crackdown-report\">has been facing an unprecedented</a> regulatory landscape. The U.S. arm of the crypto exchange <a href=\"https://cointelegraph.com/news/binance-us-unable-to-find-bank-partners-in-the-united-states-report\">was reportedly struggling to find a new bank partner</a> to serve as a fiat on-ramp and off-ramp for clients after the closure of Silvergate and Signature Bank. </p><p>To keep its global status in this environment, the exchange has been acquiring locally regulated entities, including deals in Singapore, Thailand, and <a href=\"https://cointelegraph.com/news/binance-kicks-off-transition-to-new-platform-in-japan\">Japan most recently</a>. </p><p><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Magazine: Cryptocurrency trading addiction — What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T16:53:11.000Z",
    "title": "Binance’s CZ opens up on the exchange’s Canada exit; hopes to return one day",
    "url": "https://cryptoslate.com/binances-cz-opens-up-on-the-exchanges-canada-exit-hopes-to-return-one-day/",
    "description": "<p>Changpeng Zhao (CZ) explained the circumstances surrounding Binance leaving the Canadian market &#8211; saying the regulatory requirements meant it was unfeasible to continue operating in the country. Exit from Canada On May 12, Binance announced it would be &#8220;proactively withdrawing from the Canadian marketplace.&#8221; The firm stated that new crypto exchange regulatory guidance on stablecoins [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binances-cz-opens-up-on-the-exchanges-canada-exit-hopes-to-return-one-day/\">Binance&#8217;s CZ opens up on the exchange&#8217;s Canada exit; hopes to return one day</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T17:01:41.000Z",
    "title": "SEC cracks down on crypto influencers for manipulating token prices",
    "url": "https://www.cryptopolitan.com/sec-cracks-down-on-crypto-influencers-for-manipulating-token-prices/",
    "description": "The United States Securities and Exchange Commission (SEC) is intensifying its efforts to hold crypto influencers accountable for promoting fraudulent projects and manipulating token prices through social media channels. Former SEC chief John Reed Stark took to Twitter to warn crypto influencers sternly, indicating that their days of operating without consequences are numbered. Stark highlighted ... <a title=\"SEC cracks down on crypto influencers for manipulating token prices\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-cracks-down-on-crypto-influencers-for-manipulating-token-prices/\" aria-label=\"More on SEC cracks down on crypto influencers for manipulating token prices\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T16:41:47.000Z",
    "title": "Bitcoin price analysis: BTC stumbles below $27,000, with a bearish bias",
    "url": "https://www.cryptopolitan.com/bitcoin-price-analysis-2023-05-31/",
    "description": "Bitcoin price analysis for today reveals that the bears are dominating the market. The cryptocurrency has dropped below $27,000 and is currently trading at a low of $26,853. The sellers have been able to push prices down by 2.76%, and it doesn&#8217;t look like buyers have the strength to reverse this trend anytime soon. Looking ... <a title=\"Bitcoin price analysis: BTC stumbles below $27,000, with a bearish bias\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-analysis-2023-05-31/\" aria-label=\"More on Bitcoin price analysis: BTC stumbles below $27,000, with a bearish bias\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T16:41:05.000Z",
    "title": "Avalanche price analysis: Avax succumbs to bearish pressure, leading to a price drop to $14",
    "url": "https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-31/",
    "description": "Avalanche price analysis shows bearish price action after the elongated bearish slide. Bears are covering a downwards range today, which has further deteriorated the circumstances for the token. The bears have been quite aggressive for the past two days, but today, the downfall has sped up as the decrease in price is steep, and the ... <a title=\"Avalanche price analysis: Avax succumbs to bearish pressure, leading to a price drop to $14\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-31/\" aria-label=\"More on Avalanche price analysis: Avax succumbs to bearish pressure, leading to a price drop to $14\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T16:52:11.000Z",
    "title": "Alien communication may find a home on the blockchain",
    "url": "https://crypto.news/alien-communication-may-find-a-home-on-the-blockchain/",
    "description": "In a collaboration aimed at preserving simulated alien communication, the Search for Extraterrestrial Intelligence Institute (SETI) has joined forces with Filecoin."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T17:00:14.000Z",
    "title": "Coinbase CEO Drops Bombshell Prediction – Is China Set To Dominate Crypto?",
    "url": "https://www.newsbtc.com/crypto/coinbase-ceo-prediction-is-china-set-to-dominate/",
    "description": "Coinbase CEO Brian Armstrong has warned that the US risks ceding its global financial leadership and innovation hub status if it fails to recognize the transformative potential of blockchain technology and cryptocurrency.  In a recent interview with Market Watch, Armstrong urged policymakers and regulators to provide regulatory clarity to ensure consumer protection and realize the promise of crypto. Armstrong further claimed:  By enforcing restrictive policies, the U.S. is inadvertently driving crypto-innovation offshore. That shift will compromise America’s legacy of pioneering technological advancements, and weaken our national security posture. Brian Armstrong Warns U.S. Could Lose To China The Coinbase CEO emphasized that currency has always embodied innovation, from the earliest coins as physical stores of value that transitioned the human race from bartering to commerce to the advent of portable paper currency that bolstered lending and investments.  Related Reading: Indian Banks Urged To Embrace AI And Blockchain For Future Readiness Armstrong also notes that the technologically driven financial system of the 20th century, which was characterized by innovations such as credit cards, electronic transfers, and online banking, helped to make it the &#8220;American Century&#8221; &#8211; a period of US economic and political dominance. This highlights the importance of technological innovation in driving economic progress and global influence and suggests that the US must continue to lead in this area to maintain its position as a global economic leader. However, Coinbase CEO suggests that now the US and other democratic nations are up against digital systems promoted by an ambitious adversary, China. Armstrong revealed that China is promoting two Chinese tech behemoths, Alipay and Tencent, which offer integrated payment systems with direct, instant access to an array of services.  With the recent launch of its digital yuan, China aims to directly challenge the US dollar and its role in global commerce. Given these moves and China&#8217;s strategy to leverage financial technology to protect its national interests, Hong Kong is positioning itself as a global crypto hub. Coinbase CEO Urges US Congress To Seize Historic Opportunity Armstrong put forward that smart and bespoke regulation in the 1990s and early 2000s enabled the US to define the Internet Age. And just like then, now is the time for Congress to seize the historic opportunity presented by crypto, pass comprehensive legislation that safeguards consumers, and fosters innovation.  Moreover, he stressed that crypto has the potential to play a significant part in stimulating the American economy and promoting democratic values worldwide. &#8220;If the US falls short today, the next generation of Americans will pay the price,&#8221; the CEO said. Furthermore, Armstrong warned that if the US fails to recognize the transformative potential of blockchain technology and cryptocurrency, it risks ceding its global financial leadership and innovation hub status to other countries.  Bringing crypto and blockchain innovation back to the US a decade from now will require a colossal and sustained effort that may not succeed. Therefore, Armstrong urged policymakers and regulators to work together to modernize the financial system and reaffirm the country&#8217;s role as a global technology leader rather than abdicating it. Related Reading: Optimism Crashes 33% Following Token Unlocks, Why There Could Be More Pain To Come He also acknowledged that traditional financial capitals, including the UK, United Arab Emirates, Brazil, Japan, the European Union, Australia, and Singapore, are also vying to become crypto hubs. He argued that the nexus between financial technologies and democratic values is integral to America&#8217;s identity. It&#8217;s why he decided to base Coinbase in the US. Overall, Armstrong highlights the potential of blockchain technology and cryptocurrency to revolutionize the financial system and other sectors, and the importance of the US in fostering innovation in this space. By providing regulatory clarity, he believes the US can safeguard consumers, stimulate the economy, and maintain its position as a global financial leader and innovation hub. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T17:05:14.000Z",
    "title": "XRP Price and Network Activity Skyrocket 2,600% as Hinman Documents Release Nears and SEC Victory Nears – Is $1 Next? Report",
    "url": "https://www.crypto-news-flash.com/xrp-price-and-network-activity-skyrocket-2600-as-hinman-documents-release-nears-and-sec-victory-nears-is-1-next-report/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-price-and-network-activity-skyrocket-2600-as-hinman-documents-release-nears-and-sec-victory-nears-is-1-next-report",
    "description": "<p>Ripple-backed XRP is the only top ten digital assets by market capitalization to post a double digital percentage in profits. The SEC continues to hold its ground that most of the digital assets with, exceptions for Bitcoinz, are unregistered securities. The XRP market has been gaining more global traction despite the increased headwinds due to [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/xrp-price-and-network-activity-skyrocket-2600-as-hinman-documents-release-nears-and-sec-victory-nears-is-1-next-report/\">XRP Price and Network Activity Skyrocket 2,600% as Hinman Documents Release Nears and SEC Victory Nears &#8211; Is $1 Next? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T17:00:16.000Z",
    "title": "Binance Coin (BNB) and Dogecoin (DOGE) Charts Show Red; Investors Looking To Buy into Uwerx (WERX) Early",
    "url": "https://www.crypto-news-flash.com/binance-coin-bnb-and-dogecoin-doge-charts-show-red-investors-looking-to-buy-into-uwerx-werx-early/?utm_source=rss&utm_medium=rss&utm_campaign=binance-coin-bnb-and-dogecoin-doge-charts-show-red-investors-looking-to-buy-into-uwerx-werx-early",
    "description": "<p>Binance Coin (BNB) and Dogecoin (DOGE) coin are two very popular cryptocurrencies that have given investors huge gains in the past. Sadly, in recent times, the price performance of these two coins has shown red in the charts. But, a new alternative investment, Uwerx, is drawing attention from holders of Binance Coin (BNB) and Dogecoin [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/binance-coin-bnb-and-dogecoin-doge-charts-show-red-investors-looking-to-buy-into-uwerx-werx-early/\">Binance Coin (BNB) and Dogecoin (DOGE) Charts Show Red; Investors Looking To Buy into Uwerx (WERX) Early</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T16:40:10.000Z",
    "title": "A Historic Milestone for Bitcoin: El Salvador’s President Appoints Bitcoin Standard Author as Economic Advisor, Offering Guidance for Joe Biden and Olaf Scholz”",
    "url": "https://www.crypto-news-flash.com/a-historic-milestone-for-bitcoin-el-salvadors-president-appoints-bitcoin-standard-author-as-economic-advisor-offering-guidance-for-joe-biden-and-olaf-scholz/?utm_source=rss&utm_medium=rss&utm_campaign=a-historic-milestone-for-bitcoin-el-salvadors-president-appoints-bitcoin-standard-author-as-economic-advisor-offering-guidance-for-joe-biden-and-olaf-scholz",
    "description": "<p> El Salvador’s president Nayib Bukele has added a new Bitcoin proponent to his Bitcoin team.  Author Saifedean Ammous has now been appointed as the Economic Advisor to the Nation Bitcoin Office of El Salvador. According to new reports, El Salvador’s Nayib Bukele is strengthening the country’s commitment to Bitcoin with its latest move. The national [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/a-historic-milestone-for-bitcoin-el-salvadors-president-appoints-bitcoin-standard-author-as-economic-advisor-offering-guidance-for-joe-biden-and-olaf-scholz/\">A Historic Milestone for Bitcoin: El Salvador&#8217;s President Appoints Bitcoin Standard Author as Economic Advisor, Offering Guidance for Joe Biden and Olaf Scholz&#8221;</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-31T16:55:10.000Z",
    "title": "Plans for 30% Tax on Bitcoin Mining Shut Down in New Debt Deal: Senator Warren Davidson",
    "url": "https://dailyhodl.com/2023/05/31/plans-for-30-tax-on-bitcoin-mining-shut-down-in-new-debt-deal-senator-warren-davidson/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/plans-bitcoin-mining-shut.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Negotiations over the new debt deal squashed the Biden Administration&#8217;s plan to phase in a 30% tax on the electricity used in Bitcoin (BTC) and crypto mining. Congressman Warren Davidson (R-Ohio), a vocal supporter of digital assets, says on Twitter that &#8220;one of the victories&#8221; of the negotiating process was blocking proposed taxes, including the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/31/plans-for-30-tax-on-bitcoin-mining-shut-down-in-new-debt-deal-senator-warren-davidson/\">Plans for 30% Tax on Bitcoin Mining Shut Down in New Debt Deal: Senator Warren Davidson</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]