[
  {
    "source": "Cointelegraph",
    "date": "2024-03-05T05:38:40.000Z",
    "title": " Stanford’s Blyth Fund allocates 7% of its portfolio to Bitcoin ",
    "url": "https://cointelegraph.com/news/stanford-university-blyth-fund-allocates-7-percent-portfolio-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTIyNjFlOTktZWQwOS00NWExLTgwZTktZmFlZjMwMzY1NWQxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Kole Lee, the leader of Stanford’s Blockchain Club pitched the student-run fund to invest in BlackRock's spot Bitcoin ETF as early as February. </p>\n                    <p><p>An investment fund that manages a portion of Stanford University’s endowment has as much as 7% of its portfolio dedicated to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) investments.</p><p>On March 5, Computer Science Major and leader at the Stanford Blockchain Club, Kole Lee, <a href=\"https://twitter.com/kolelee_/status/1764745867435921745\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that the University’s student-run  Blyth Fund allocated around 7% of the portfolio to Bitcoin following his pitch to the fund in February. </p><p>“Stanford Endowment has bought Bitcoin at $45,000,” he said before adding that he pitched BlackRock’s IBIT ETF to the Blyth Fund. </p><p><a href=\"https://cointelegraph.com/news/stanford-university-blyth-fund-allocates-7-percent-portfolio-bitcoin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-05T05:30:05.000Z",
    "title": "Russian Digital Ruble Pilot ‘on Track,’ Registers About 25K Transactions",
    "url": "https://news.bitcoin.com/russian-digital-ruble-pilot-on-track-registers-about-25k-transactions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russian Digital Ruble Pilot &#039;on Track,&#039; Registers Over 25K Transactions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/6f447666-57ac-434c-bc95-80e690b0c875.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Elvira Nabiullina, Governor of the Bank of Russia, stated that the current pilot test of the Russian digital ruble was &#8220;on track,&#8221; with several operations being tested, including opening wallets, and interactions with smart contracts. Nabiullina revealed that over 25,000 transactions were registered, and confirmed the pilot expansion later this year. Russian Digital Ruble Pilot [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-05T05:28:43.000Z",
    "title": "Bitcoin On The Brink, Price Soars Above $68,000 – Will BTC Break Its 2021 Record?",
    "url": "https://www.newsbtc.com/news/bitcoin-on-the-brink-price-soars-above-68000-will-btc-break-its-2021-record/",
    "description": "On Monday, a flood of capital brought Bitcoin within striking distance of record values, sending it soaring to a two-year high and breaching past $68,000. At its peak, the price was $68,800. At the time of writing, Bitcoin was trading at $67,980, up 6.6% and 20.6% in the daily and weekly timeframes, data from Coingecko shows. Related Reading: FLOKI Grows Over 300% As Memecoin Breaches $400 Million TVL – Details In recent weeks, as investment in bitcoin funds listed in the United States has increased dramatically, the value of the biggest cryptocurrency by market cap has increased by half this year. Bitcoin Heating Up As more and more people get interested in and optimistic about the market, Bitcoin&#8217;s incredible upward trajectory becomes clear in a thorough examination of the weekly chart. The bitcoin price has recently surged, helped along in part by the adoption of spot Bitcoin ETFs, and is already approaching the all-time high of $69K, which the cryptocurrency attained in November 2021. It has already surpassed numerous important resistance levels. Bitcoin 24-hour price ascent. Source: Coingecko Antoni Trenchev, co-founder of crypto exchange Nexo, stated that after the launch of these nine new ETFs, major market movements no longer occur on weekends but rather during the regular trading week. Trenchev also pointed out that today&#8217;s events could be a repeat of last week&#8217;s, when bitcoin&#8217;s value increased by $10,000 in a matter of days. The price of bitcoin has soared this year, and its market capitalization has already topped $1.3 trillion, making it one of the biggest assets in the world. BTCUSD trading at $66,887 on the 24-hour chart: TradingView.com The most valuable cryptocurrency in the world, Bitcoin, has surpassed Meta Platforms (META), the parent company of Facebook, and is currently approaching silver&#8217;s market value of $1.4 trillion, according to figures provided by CompaniesMarketCap. More than half of the $2.17 billion net flows into the top ten US spot bitcoin funds in the week leading up to March 1 went into BlackRock&#8217;s iShares Bitcoin Trust (IBIT.O), opens new tab, according to statistics from LSEG. Ethereum, a smaller competitor, has capitalised on rumors that it, too, could soon offer exchange-traded funds that stimulate inflows. It is up 50% year-to-date and reached two-year highs on Tuesday, rising 2.5% to $3,517. Bitcoin Leads The Way Simultaneously, Bitcoin boosted many cryptocurrency tokens, particularly meme currencies. Dogecoin saw a 30% increase, and Shiba Inu had a 90% surge. People who have been sitting on their hands during the current crypto rise are finally getting back into it, according to analysts. According to crypto data source Kaiko, the weekly transaction volume of meme tokens climbed to its highest level since late 2021 last week. #Bitcoin is about to enter price discovery (again) and people are somehow bearish? couldn&#8217;t be me. — Caleb Franzen (@CalebFranzen) March 4, 2024 Meanwhile, Cubic Analytics CEO Caleb Franzen made the observation in a Sunday report that Bitcoin is beating the tech-heavy Nasdaq 100 Index (NDX). Breaking over a critical level connecting the first quarter and end quarter of 2021 highs, he characterized bitcoin&#8217;s breakout versus NDX as &#8220;very encouraging.&#8221; Related Reading: Solana Meme Coin Dogwifhat (WIF) Hits New ATH, Market Cap Breaks $1.6 Billion &#8220;Bitcoin is about to enter price discovery (again) and people are somehow bearish? Couldn&#8217;t be me,&#8221; he said in an X post Monday. Joel Kruger, a market strategist at digital currency exchange LMAX Group, told CBS MoneyWatch that investors are seeing the benefits of treating bitcoin as an uncorrelated asset, which makes it very appealing for portfolio diversification. Featured image from P2E Crypto Media, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-05T05:30:14.000Z",
    "title": "Tether Rolls Out Blockchain Recovery Tool Amid Historic $100 Billion Stablecoin Circulation",
    "url": "https://www.crypto-news-flash.com/tether-rolls-out-blockchain-recovery-tool-amid-historic-100-billion-stablecoin-circulation/?utm_source=rss&utm_medium=rss&utm_campaign=tether-rolls-out-blockchain-recovery-tool-amid-historic-100-billion-stablecoin-circulation",
    "description": "Tether&#8217;s USDT becomes the first stablecoin to surpass $100 billion in market cap, dominating the stablecoin market. Tether is innovating with a blockchain recovery tool to ensure USDT&#8217;s security and accessibility across multiple platforms. Tether Holdings&#8217; USDT stablecoin has briefly soared past the $100 billion threshold in both circulation and market capitalization, a new record [...]"
  }
]