[
  {
    "source": "Decrypt",
    "date": "2024-01-25T22:23:24.000Z",
    "title": "How to Farm the Drift Protocol Airdrop on Solana",
    "url": "https://decrypt.co/214157/how-farm-drift-protocol-airdrop-solana",
    "description": "Drift Protocol, the largest perpetual swap futures exchange on Solana, just launched a points program ahead of an airdrop. Here's what you need to know."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-25T22:32:27.000Z",
    "title": "Bitcoin developer Luke Dashjr raises concerns over centralization in Bitcoin mining",
    "url": "https://cryptoslate.com/bitcoin-developer-luke-dashjr-raises-concerns-over-centralization-in-bitcoin-mining/",
    "description": "<p>In an in-depth interview with Bitcoin Magazine on Jan. 24, Bitcoin Core developer Luke Dashjr voiced significant concerns about the increasing centralization of Bitcoin mining. Dashjr believes that the dominance of a few large mining pools poses a serious threat to the decentralized nature of Bitcoin, potentially leading to censorship and control issues within the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-developer-luke-dashjr-raises-concerns-over-centralization-in-bitcoin-mining/\">Bitcoin developer Luke Dashjr raises concerns over centralization in Bitcoin mining</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-25T22:30:36.000Z",
    "title": "Avalanche Announces Eligibility Criteria for Meme Coin Purchasing Program",
    "url": "https://news.bitcoin.com/avalanche-announces-eligibility-criteria-for-meme-coin-purchasing-program/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Avalanche Announces Eligibility Criteria for Meme Coin Purchasing Program\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/c3dff63d-d411-4a4d-97ce-6d49559351fd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Avalanche Foundation, a non-profit organization seeking to support the avalanche ecosystem, has announced the rules covering its already active meme coin purchasing program. The institution has defined the holder count, concentration, liquidity, liquidity providers, lifespan, and market cap requirements that these projects need to fulfill to get selected and informed more projects are being [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-25T22:30:15.000Z",
    "title": "Rising Stars: Report Highlights 5 Solana Projects Set For Success In 2024",
    "url": "https://www.newsbtc.com/news/solana/rising-stars-report-highlights-5-solana-projects-set-for-success-in-2024/",
    "description": "Solana has been on a downward trend over the past week, following a surge from multi-year low levels. The token suffered when its biggest promoter, crypto exchange FTX, fell, but the ecosystem continued to thrive, leading to the high timeframe recovery.  Related Reading: Solana Price Soars By 11% – Here’s Why As of this writing, Solana&#8217;s native token SOL trades at $87 with a 2% profit over the past 24 hours. Over the previous seven days, the cryptocurrency records a 12% correction. Rising Stars In The Solana Landscape According to a report from Coingecko, the Solana network is witnessing a resurgence fueled by its recovery in the cryptocurrency market, notable reductions in network outages, and a series of positive developments. This rejuvenation has drawn the attention of investors and developers and led to a surge in the adoption of existing projects within its ecosystem. Specific projects stand out among these, poised to shape the future of decentralized finance (DeFi) and non-fungible tokens (NFTs) on Solana, Coingecko claims. Decentralized exchanges (DEXs) such as Jupiter, Orca, and Drift are at the forefront of Solana’s innovation. Jupiter is &#8220;transforming&#8221; the landscape with its limit-order decentralized swap services, offering a DEX aggregator to ensure users get the optimal price offers. The chart below shows that its daily trading volume, involving around 90,000 unique wallets, has reached an average of $400 million. Orca, another DEX, has a concentrated liquidity feature, Whirlpools, which enhances returns for liquidity providers and reduces slippage for traders. With a total value of approximately $185 million, Orca’s community-driven governance model is another selling point to attract new users in the coming months. Drift is a decentralized perpetual trading platform, allowing traders to engage with up to 20x leverage. It integrates a series of features, including a money market for decentralized lending, offering additional passive income opportunities through staking and market maker rewards. Furthermore, Solend, Marginfi, and Kamino are making strides on the lending front. Solend, a prominent money market, enables users to lend and borrow crypto assets, with over $165 million locked in its smart contracts. Marginfi, boasting over $345 million in tokens locked, enhances the lending experience with advanced risk management technologies. Kamino, another lending platform, manages over $242 million in assets. It offers liquidity through CLMM-based lending vaults, allowing users to deploy tokens in yield-bearing programs. Emerging Projects: Helium And Render Network In addition to these platforms, the report identified projects that could benefit from the surge of interest in Solana over the long run. These include Marinade Finance and Jito. Marinade Finance, with over $1 billion in assets, offers maximized returns through liquid staking and immediate unstaking options. Jito, enhancing staking yields via MEV rewards, boasts about 6.7 million SOL staked across its platform. In the world of NFTs, collections like Mad Lads and Tensorians are gaining popularity. Mad Lads, a unique collection of 10,000 artworks, reached a new all-time high in floor price, reflecting the increasing interest in Solana-based NFTs. According to the report, Helium and Render Network are two emerging projects within the Solana ecosystem worth watching. Helium, a decentralized connectivity service provider, utilizes Solana’s blockchain to remit and administer its internet services. Its multi-token system incentivizes hotspot owners and fosters the expansion of decentralized internet facilities. Render Network, expanding to Solana in 2023, offers GPU rendering services for creators. By renting out excess GPU power, artists can produce high-resolution graphics with the Render token (RNDR) as the network&#8217;s remittance token. Related Reading: SOL Price Recovery Could Soon Fade If Solana Fails To Clear This Hurdle The Solana ecosystem, marked by innovation and rapid growth, solidifies its position in the smart contract blockchain space. Its diverse projects, from DEXs and lending protocols to staking solutions and NFT collections, showcase the network&#8217;s dynamic and burgeoning landscape. With the SOL token climbing the ranks, Solana&#8217;s ecosystem is poised for continued expansion and success in the years ahead. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-25T22:30:00.000Z",
    "title": "China’s Sinking Economy Leads Investors to Buy Crypto: Report",
    "url": "https://coinedition.com/chinas-sinking-economy-leads-investors-to-buy-crypto-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"China’s Sinking Economy Leads Investors to Buy Crypto: Report\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/China-Communist-Party-Launches-Crypto-War-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The downturn in the Chinese economy and the plummeting of the Chinese stock markets are leading investors to move their money into cryptocurrencies, according to Reuters.&#160; A recent report highlighted Finance Senior Executive Dylan Run, who started to add more cryptocurrencies to his investment portfolio in early 2023 upon realizing that the Chinese economy was [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/chinas-sinking-economy-leads-investors-to-buy-crypto-report/\">China’s Sinking Economy Leads Investors to Buy Crypto: Report</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]