[
  {
    "source": "CoinDesk",
    "date": "2023-11-21T13:01:00.000Z",
    "title": "First Mover Americas: SEC Sues Kraken; Binance Faces $4B Settlement",
    "url": "https://www.coindesk.com/markets/2023/11/21/first-mover-americas-sec-sues-kraken-binance-faces-4b-settlement/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Nov. 21, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T13:00:00.000Z",
    "title": "Centralized vs. decentralized orders matching on DEXs",
    "url": "http://cointelegraph.com/innovation-circle/centralized-vs-decentralized-orders-matching-on-dexs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/a0a3c040-73ef-4f9f-8590-fd4a02c7c87f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Centralized and decentralized order batchers are central to this discussion, each representing a different approach to order matching.</p>\n                    <p><p>In the rapidly evolving realm of DeFi, decentralized exchanges (DEXs) stand as a cornerstone, enabling seamless transactions in a trustless environment. </p> <p>At the heart of these exchanges lies the mechanism of order matching, a crucial process that pairs buyers with sellers, facilitating the exchange of assets. Traditionally (on order book-based exchanges), order matching has been centralized, with a single entity overseeing the process to ensure efficiency and accuracy. </p> <p>However, the advent of blockchain technology has paved the way for decentralized order-matching systems, promising to align DEXs with the ethos of decentralization further. </p> <p>Centralized and decentralized order batchers are central to this discussion, each representing a different approach to order matching.</p> <h2><strong>Understanding centralized order matching</strong></h2> <p>Centralized order matching operates under the aegis of a central authority that oversees the matching of buy and sell orders. This setup collects orders within a defined time frame and batches them together. Once the batch is complete, a centralized matching engine sifts through the orders, pairing buyers with sellers based on predefined criteria such as price and time of order placement.</p> <h3><strong>Advantages</strong></h3> <ul><li><strong>Efficiency:</strong> The centralized nature of batchers ensures a streamlined process, often resulting in faster order matching and execution. This is particularly beneficial in high-frequency trading environments where speed is of the essence.</li><li><strong>Accuracy:</strong> With a single entity overseeing the process, the likelihood of errors is significantly reduced, ensuring accurate order matching.</li><li><strong>Ease of management:</strong> Centralized systems often come with a well-defined administrative structure, making it easier to manage, monitor and rectify issues should they arise.</li></ul> <h3><strong>Disadvantages</strong></h3> <ul><li><strong>Centralization risk:</strong> The central authority becomes a single point of failure. In the event of a system breakdown or malicious activity, the integrity of the entire order-matching process is compromised.</li><li><strong>Privacy concerns:</strong> Centralized systems require participants to entrust their data to the central authority, which could deter privacy-conscious users.</li><li><strong>Lack of control:</strong> Traders have to relinquish control over the order-matching process, which could be at odds with the decentralized ethos that DEXs aim to uphold.</li></ul> <p>Centralized order matching through batchers presents a tried-and-tested mechanism, providing a level of efficiency and accuracy crucial for a seamless trading experience. However, the inherent centralization poses risks and challenges that may not align with the decentralization narrative prevailing in the DeFi space. </p> <p>As DEXs evolve, the quest for alternative, decentralized order matching systems gathers pace, with smart order routers (SORs) emerging as a potential contender in this decentralized narrative.</p> <h2><strong>Delving into decentralized order matching</strong></h2> <p>Decentralized order matching, symbolized by smart order routers, embodies the essence of decentralization, where the process is distributed among participants within the network rather than being controlled by a singular entity. </p> <p>In this setup, SORs autonomously match bids and ask order from the onchain order book and make profits on the spread</p> <h3><strong>Advantages</strong></h3> <ul><li><strong>Decentralization:</strong> With no central authority, SORs epitomize the core ethos of decentralization, minimizing the risks associated with significant points of failure.</li><li><strong>Transparency:</strong> The decentralized nature of smart order routers ensures a higher degree of transparency as all transactions are recorded on the blockchain and visible to all participants.</li><li><strong>Self-Custody: </strong>Traders retain control over their orders, aligning with the tenets of user sovereignty central to DEXs.</li></ul> <h3><strong>Disadvantages</strong></h3> <ul><li><strong>Complexity:</strong> The decentralized setup can introduce a level of complexity that might be daunting for less tech-savvy individuals.</li><li><strong>Potential latency:</strong> Decentralized systems might experience a slight delay in order execution compared to their centralized counterparts, especially in networks with high congestion.</li><li><strong>Resource intensity:</strong> The continual search for optimal order routing across diverse liquidity pools can be resource-intensive.</li></ul> <p>Smart order routers highlight the potential of decentralization in order matching, aligning with the broader goals of transparency and user control within DEXs. </p> <p>However, complexity and potential latency challenges underline the need for robust decentralized infrastructures to support seamless order execution.</p> <h2><strong>Comparing options</strong></h2> <p>The juxtaposition of centralized and decentralized order-matching systems through the lens of batchers and smart order routers unveils a spectrum of considerations. </p> <p>On one end, the efficiency, accuracy and administrative ease offered by centralized systems like batchers is alluring, especially in a high-frequency trading landscape. However, the centralization risks and privacy concerns would be considered drawbacks to some.</p> <p>Conversely, smart order routers pave the way for a decentralized order-matching paradigm, resonating with the core tenets of transparency and user control inherent in DEXs. Yet, the hurdles of complexity and potential latency cannot be overlooked.</p> <p><strong>Efficiency vs. decentralization</strong>: Batchers provide a streamlined and efficient process at the cost of centralization. Smart order routers, while decentralized, may introduce additional latency and complexity.</p> <p><strong>Security and transparency:</strong> The decentralized nature of SORs offers enhanced security and transparency, minimizing central points of failure, unlike centralized systems that may pose data privacy concerns.</p> <p><strong>User experience:</strong> Centralized systems may offer a more straightforward user experience, while decentralized systems offer user control but with added complexity.</p> <p><strong>Impact of blockchain technology:</strong> Blockchain technology is the linchpin that enables decentralized order matching, with smart contracts playing a pivotal role in automating and securing the process.</p> <p>The discourse between centralized and decentralized order-matching systems symbolizes the broader dialogue within the DeFi space, encapsulating the trade-offs between efficiency, user control and decentralization. </p> <p>As DEXs mature, exploring hybrid models that encapsulate the merits of both worlds might emerge as a pathway toward optimizing order matching in decentralized landscapes.</p> <h2><strong>Conclusion</strong></h2> <p>The discourse surrounding centralized and decentralized order matching, epitomized by batchers and smart order routers, underscores a pivotal juncture in the evolution of DEXs. </p> <p>The trade-offs between efficiency, transparency, user control and complexity are emblematic of the broader challenges and opportunities within the DeFi space. As DEXs strive to balance the core ethos of decentralization with the pragmatic need for efficiency and user-friendly interfaces, exploring these order-matching systems becomes instrumental. </p> <p>As DEXs evolve, hybrid models that encapsulate the merits of centralized and decentralized order-matching systems may emerge, potentially heralding a new era of optimized, user-centric and resilient decentralized trading platforms.</p> <p><em>The information provided here is not investment, tax or financial advice. You should consult with a licensed professional for advice concerning your specific situation.</em></p> <p><em>CSO at <a href=\"https://www.geniusyield.co/\">Genius Yield</a>, a next-generation DEX & CEO at gomaestro.org a Web3 infrastructure provider</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-21T12:40:07.000Z",
    "title": "Blast Layer-2 network launch draws both interest and criticism over potential yield model",
    "url": "https://cryptoslate.com/blast-layer-2-network-launch-draws-both-interest-and-criticism-over-potential-yield-model/",
    "description": "<p>Blur (BLUR) NFT marketplace founder Pacman has launched a new Ethereum (ETH) layer-2 network, Blast, designed to enable its users to earn &#8220;native yields.&#8221; In a Nov. 20 statement, the protocol explained how its novel approach differentiates it from other layer-2 networks. According to the team, Blast is an Ethereum Virtual Machine (EVM)-compatible, optimistic rollup [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blast-layer-2-network-launch-draws-both-interest-and-criticism-over-potential-yield-model/\">Blast Layer-2 network launch draws both interest and criticism over potential yield model</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-21T13:07:01.000Z",
    "title": "Top Blockchains To Build Web3 More Efficiently",
    "url": "https://cryptodaily.co.uk/2023/11/top-blockchains-to-build-web3-more-efficiently",
    "description": "The global blockchain ecosystem is expanding as demand grows. As established networks continuously improve, fresh platforms with Web3-focused features are introduced. Here are the top blockchains to build for developers."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T13:00:45.000Z",
    "title": "Shiba Inu Sees A Whopping 48,000% Increase In The SHIB Burn Rate, What’s Next?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-sees-a-whopping-48000-increase-in-the-shib-burn-rate-whats-next/",
    "description": "The Shiba Inu community has again ramped up its SHIB burning efforts, causing a massive burn rate spike. Despite SHIB’s tumbling price in the past seven days, Shiba Inu&#8217;s burn rate has recorded a nearly 48,000% increase. The SHIB community is determined to cut down the Shiba Inu circulating supply, a feat that many believe will positively impact the token’s price.  SHIB Community Intensify Token Burn Efforts Following  Slight Decline According to data from the Shiba Inu burn tracker, Shibburn, the SHIB burn rate has spiked 47,908% in the last 24 hours. The SHIB ecosystem swept 28.129 million SHIB tokens off circulation into the dead wallet on November 21. Over the past seven days, the SHIB burn rate has increased by 26.29%, with over 290 million tokens wiped off circulation. Related Reading: Solana Captures Institutional Investors’ Attention, Inflows Rise To $135 Million According to Shibburn&#8217;s data, the most notable burn transaction was a whopping 28.15 million SHIB tokens transferred by an unknown address. The large number of SHIB tokens burned by the anonymous wallet attracted the attention of SHIB enthusiasts. Information on the SHIB burn tracking website shows that the burn transaction occurred 15 hours ago.  In all these, the SHIB community has removed 410.66 trillion tokens from the initial SHIB token supply. As of writing, approximately 589.34 trillion coins remain as the total Shiba Inu token supply. Also, Shiba Inu&#8217;s circulating supply stands at ~580.4 million tokens. The Shiba Inu community has long been working to reduce the meme coin’s enormous supply and introduce scarcity. Shiba Inu token burns are often sporadic, and some days may witness more token burns than others. Today’s massive increase comes after a 98.79% decline in the SHIB burn rate observed on November 20.  According to Shibburn’s November 20 report, only 983,884 Shiba Inu tokens were burnt in three transactions. The highest burn transaction was one involving 42,850 SHIB tokens. This figure represented a significant decline from what was observed in the previous days. Shiba Inu Price Outlook  While members of the Shiba Inu community believe the token burn spree will positively impact SHIB’s price, the meme coin has followed an opposite trajectory. Its price has been in a downturn in the past week, with a seven-day decline of over 1%. As of the time of writing, Shiba Inu trades at $0.000008345, with a 4% 24-hour decline.  SHIB candles in the past week are below the median band of the Donchian Channel (DC), suggesting a possible decline ahead for the asset. If it drops to the lower band, then the bears may take full control of its price action and could facilitate more downturns.  Related Reading: Bitcoin About To Smash The $38,000 Barrier – Decoding the Next Moves But the good news is that SHIB still holds nearly 20% of its past month&#8217;s gains. This could mean there is hope for a rebound since the market shows some bullish activity. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-21T12:49:40.000Z",
    "title": "VeChain and BCG Forge a Green Future with Blockchain Biospheres in Billion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/vechain-and-bcg-forge-a-green-future-with-blockchain-biospheres-in-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-and-bcg-forge-a-green-future-with-blockchain-biospheres-in-billion-dollar-market",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain Reebonz\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />VeChain and BCG collaborate to integrate blockchain into sustainability initiatives, focusing on Environmental, Social, and Governance (ESG) principles. The partnership&#8217;s goal is to develop Blockchain Biospheres, a series of modular ecosystems targeting specific sustainability challenges. In the evolving world of blockchain technology, the recent partnership between VeChain and Boston Consulting Group (BCG) stands out as [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T13:00:00.000Z",
    "title": "KuCoin Lists Vertex’s DEX Token ‘VRTX’ on Its Spot Trading Platform",
    "url": "https://coinedition.com/kucoin-lists-vertexs-dex-token-vrtx-on-its-spot-trading-platform/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/KuCoin_Lists_Vertexs_DEX_Token_‘VRTX_on_Its_Spot_Trading_Platform-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The centralized cryptocurrency exchange KuCoin has endorsed VRTX, the native token of Vertex, a crypto project catering to the decentralized exchange market. KuCoin expressed its enthusiasm for broadening the range of tradable assets by introducing the VRTX token to its Spot trading platform. This listing was announced on KuCoin&#8217;s official blog on Monday, November 20, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/kucoin-lists-vertexs-dex-token-vrtx-on-its-spot-trading-platform/\">KuCoin Lists Vertex’s DEX Token ‘VRTX’ on Its Spot Trading Platform</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T12:48:00.000Z",
    "title": "Binance Faces $4B Settlement With DOJ to End Criminal Case: Bloomberg",
    "url": "https://coinedition.com/binance-faces-4b-settlement-with-doj-to-end-criminal-case-bloomberg/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Puts Withdrawals On Hold after Potential Ankr &amp; Hay Hack\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Binance-Research-Finds-Possible-Concerns-in-Current-L2-Space-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance Holding Ltd. is reportedly asked to pay $4 billion as part of a proposed resolution with the United States Department of Justice, as per Bloomberg. The report said that the settlement proposal between the DOJ and Binance comprises the probability that the cryptocurrency exchange’s founder, Changpeng “CZ” Zhao, would face criminal charges in the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-faces-4b-settlement-with-doj-to-end-criminal-case-bloomberg/\">Binance Faces $4B Settlement With DOJ to End Criminal Case: Bloomberg</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T12:40:54.000Z",
    "title": "KuCoin Unveils KuCard, A Visa Crypto Card Empowering the Future of Payment",
    "url": "https://coinedition.com/kucoin-unveils-kucard-a-visa-crypto-card-empowering-the-future-of-payment/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/PR-1-137.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/PR-1-137.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-137-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>KuCoin, a top 5 cryptocurrency exchange platform, is empowering the future of payment with the launch of KuCard. This groundbreaking cryptocurrency debit card seamlessly merges digital assets with traditional banking, giving users the freedom to spend their cryptocurrency anywhere that accepts regular debit cards. The launch of KuCard represents a significant milestone for both KuCoin [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/kucoin-unveils-kucard-a-visa-crypto-card-empowering-the-future-of-payment/\">KuCoin Unveils KuCard, A Visa Crypto Card Empowering the Future of Payment</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T12:45:23.000Z",
    "title": "Billionaire Ray Dalio Warns US at Inflection Point Where Enormous Debt Could Witness Acceleration – Here’s Why",
    "url": "https://dailyhodl.com/2023/11/21/billionaire-ray-dalio-warns-us-at-inflection-point-where-enormous-debt-could-witness-acceleration-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Point-Where-Enormous-Debt.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Investing legend Ray Dalio is warning that the United States is at a point where its enormous debt could become out of control. In a new CNBC interview, the billionaire says that the country is not generating enough revenue to meet financial obligations. &#8220;The longer term is that we are at a point in which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/billionaire-ray-dalio-warns-us-at-inflection-point-where-enormous-debt-could-witness-acceleration-heres-why/\">Billionaire Ray Dalio Warns US at Inflection Point Where Enormous Debt Could Witness Acceleration – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]