[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T20:41:55.000Z",
    "title": "BlackRock CEO Larry Fink Says Bitcoin Could ‘Revolutionize Finance’",
    "url": "https://www.coindesk.com/business/2023/07/05/blackrock-ceo-larry-fink-says-bitcoin-could-revolutionize-finance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock (BLK) CEO Larry Fink said crypto, specifically bitcoin (BTC), could revolutionize the financial system in an interview with Fox Business on Wednesday."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-05T20:47:14.000Z",
    "title": "BlackRock Boss Larry Fink Praises Bitcoin for ‘Digitizing Gold’",
    "url": "https://decrypt.co/147409/larry-fink-blackrock-ceo-bitcoin-digitizing-gold-international-asset",
    "description": "Once dismissing the top cryptocurrency as a money laundering tool, he’s now singing a different tune."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-05T20:40:33.000Z",
    "title": "Are We Back? Crypto Analysts Split on Bitcoin’s Bull Run",
    "url": "https://decrypt.co/147399/are-we-back-analysts-split-on-bitcoins-bull-run",
    "description": "There's no easy answer on how long Bitcoin will rally, but investors were split on their forecasts."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T21:06:46.000Z",
    "title": "What Abandoned NFTs Mean to the Crypto Industry and Broader Implications",
    "url": "https://www.cryptopolitan.com/abandoned-nfts-mean-to-crypto/",
    "description": "Non-Fungible Tokens (NFTs), powered by blockchain technology, have captivated the world with their ability to represent ownership of digital content such as artwork, collectibles, and even tweets. However, the landscape of NFTs is not immune to challenges and setbacks. Some companies have faced issues or made the difficult decision and abandoned NFTs, raising essential questions ... <a title=\"What Abandoned NFTs Mean to the Crypto Industry and Broader Implications\" class=\"read-more\" href=\"https://www.cryptopolitan.com/abandoned-nfts-mean-to-crypto/\" aria-label=\"More on What Abandoned NFTs Mean to the Crypto Industry and Broader Implications\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T20:59:12.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T20:47:41.000Z",
    "title": "Top 15 Crypto and Web3 Twitter Accounts to Follow in 2023 and Beyond",
    "url": "https://www.cryptopolitan.com/top-15-crypto-and-web3-twitter-accounts/",
    "description": "In the dynamic and ever-evolving world of cryptocurrencies and Web3 technologies, staying informed is not just an option—it&#8217;s a necessity. The rapid pace of innovation and the sheer volume of information can be overwhelming. That’s why Twitter has become the go-to platform for industry experts, thought leaders, and innovators to share insights, news, and predictions. ... <a title=\"Top 15 Crypto and Web3 Twitter Accounts to Follow in 2023 and Beyond\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-15-crypto-and-web3-twitter-accounts/\" aria-label=\"More on Top 15 Crypto and Web3 Twitter Accounts to Follow in 2023 and Beyond\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T20:44:59.000Z",
    "title": "US set to block China’s access to powerful cloud computing services",
    "url": "https://www.cryptopolitan.com/us-set-to-block-china-access-to-services/",
    "description": "According to a recent report in The Wall Street Journal, US officials are contemplating imposing restrictions on China&#8217;s access to cloud computing services as a measure to safeguard advanced technology in the country. The proposal put forth by the Biden Administration suggests implementing controls on the level of access granted to Chinese companies for U.S.-based ... <a title=\"US set to block China&#8217;s access to powerful cloud computing services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-set-to-block-china-access-to-services/\" aria-label=\"More on US set to block China&#8217;s access to powerful cloud computing services\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T20:45:00.000Z",
    "title": "Crypto whales choosing Alex The Doge, Maker’s future uncertain",
    "url": "https://crypto.news/crypto-whales-choosing-alex-the-doge-makers-future-uncertain/",
    "description": "This article will explore the price trends of maker (MKR), the emergence of Alex The Doge, and why ALEX is becoming a popular choice among meme coins"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T21:00:34.000Z",
    "title": "Ethereum Starknet Launches Testnet For ‘Quantum Leap’ Upgrade",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-starknet-launches-testnet-for-quantum-leap-upgrade/",
    "description": "StarkWare, an Israeli-based company working to scale Ethereum (ETH), has released the testnet for its latest layer-2 solution, Starknet v12.0. The new version focuses on improving performance and user experience, with a significant 10x increase in throughput achieved through the implementation of the Sequencer in Rust.  Starknet Upgrade Signals Boost for Ethereum&#8217;s Scalability According to the company’s blog post, the Sequencer has been optimized with the help of LambdaClass, resulting in a smoother user experience by removing the PENDING status for transactions. A new syscall has also been introduced to retrieve past block hashes easily.  Related Reading: Analyst Says XRP Will Reach $100, Here’s Why Furthermore, the new version of Starknet supports a new Cairo syntax that focuses on safety. This means that the new syntax is designed to make it easier for developers to write secure smart contracts that are less prone to errors and vulnerabilities. The network upgrade to Starknet v12.0 will undergo a community vote, ensuring widespread participation and input. The community will have the opportunity to shape the future of Starknet, and the upgrade protocol for breaking changes includes a six-month window in which contracts compiled with the older compiler version (v1.1.0) will still be accepted. Starknet’s vision is to achieve substantial scalability in scale and cost, with the next priority being reducing transaction costs. The long-term goal is to provide a scalable, flexible, cost-effective infrastructure for decentralized applications. The upcoming vote for Starknet Alpha V0.12.0 will allow the community to examine and test the upgraded version before approving it for Mainnet deployment. Everyone is invited to participate in the proposal and vote on whether to upgrade Starknet Mainnet accordingly. Starknet empowers developers to code solutions that make a difference, and the new version allows developers to start their Cairo development journey. With the Cairo docs, Cairo Basecamp, and tutorials, developers can stay up to date with all version updates by signing up for the Starknet Developers Newsletter. The release of Starknet Alpha V0.12.0 represents a significant milestone for StarkWare and Ethereum, with the layer-2 solution&#8217;s focus on performance and user experience promising to enhance scalability and reduce transaction costs for decentralized applications. Ethereum Prices Surge, But Network Activity Shows No Significant Boost According to recent data from Glassnode, despite the recent rise in Ethereum prices, network activity has not experienced a significant boost, with gas prices remaining relatively low. This contrasts the situation during the Shanghai upgrade in April, which preceded a similar rally in ETH markets, where gas prices rose by 78%. Gas prices on the Ethereum network measure the cost of executing smart contracts and transactions. When demand for transaction processing exceeds the available network capacity, gas prices rise as users compete to process their transactions more quickly. This often happens during high network activity periods, such as upgrades and market rallies. Related Reading: Valkyrie Follows In BlackRock’s Footsteps, Refiles For Spot Bitcoin ETF However, the recent rally in Ethereum prices does not seem to have led to a significant increase in network activity, as gas prices have remained relatively stable.  This could be due to several factors, such as that the current rally is driven more by institutional investors and DeFi protocols rather than individual users. Additionally, there may be more network capacity available now than during the Shanghai upgrade, which could be helping to keep gas prices in check. Despite the low gas prices, there are still signs of growth and development within the Ethereum ecosystem. The recent release of the Starknet v12.0 testnet by StarkWare, for example, is a significant milestone for Ethereum, as it promises to enhance scalability and reduce transaction costs for decentralized applications built on the network. ETH is trading at $1,900, following the steps of Bitcoin, and has decreased by 1.8% in the last 24 hours. "
  }
]