[
  {
    "source": "Decrypt",
    "date": "2023-09-28T19:59:14.000Z",
    "title": "Epic Games Is Jacking Up the Price of Fortnite V-Bucks",
    "url": "https://decrypt.co/199236/epic-games-jacking-up-price-fortnite-v-bucks",
    "description": "Alongside layoffs, Epic Games is also raising the price of Fortnite’s in-game currency, citing inflation and currency shifts."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-28T20:00:55.000Z",
    "title": "Public miners contribute only 28% to Bitcoin’s global hash rate, fueling decentralization debate",
    "url": "https://cryptoslate.com/insights/public-miners-contribute-only-28-to-bitcoins-global-hash-rate-fueling-decentralization-debate/",
    "description": "<p>Quick Take Hash Index data, presented by Jamie Coutts, reveals that public miners constitute 28% of Bitcoin&#8217;s global hashrate. This data point offers a fresh perspective to the centralization versus decentralization debate surrounding Bitcoin mining. While it is a misconception that miners have central control over the network – an actuality vested in nodes – [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/public-miners-contribute-only-28-to-bitcoins-global-hash-rate-fueling-decentralization-debate/\">Public miners contribute only 28% to Bitcoin&#8217;s global hash rate, fueling decentralization debate</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T19:51:27.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T19:49:45.000Z",
    "title": "Senser Emerges from Stealth with $9.5 Million Seed Round to Revolutionize AIOps",
    "url": "https://www.cryptopolitan.com/senser-emerges-from-stealth-with-9-5m/",
    "description": "Tel Aviv-based Senser, an AIOps platform leveraging eBPF technology, has announced its emergence from stealth, backed by a $9.5 million seed round led by Eclipse and featuring participation from Amdocs and private investors. Revolutionizing AIOps with eBPF Technology Senser, a Tel Aviv-based company, has unveiled its AIOps platform designed to empower developers and operations teams ... <a title=\"Senser Emerges from Stealth with $9.5 Million Seed Round to Revolutionize AIOps\" class=\"read-more\" href=\"https://www.cryptopolitan.com/senser-emerges-from-stealth-with-9-5m/\" aria-label=\"More on Senser Emerges from Stealth with $9.5 Million Seed Round to Revolutionize AIOps\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T19:47:27.000Z",
    "title": "ChatGPT in Real Estate: 5 Game-Changing Strategies for Agents in the Digital Age",
    "url": "https://www.cryptopolitan.com/chatgpt-in-real-estate/",
    "description": "In the ever-evolving landscape of real estate, technology continues to play a pivotal role in shaping the industry. Among these technological advancements, ChatGPT stands out as a versatile tool that can provide agents with next-level business results. The five innovative strategies to harness the power of ChatGPT effectively are: 1. Personalize ChatGPT for enhanced interaction ... <a title=\"ChatGPT in Real Estate: 5 Game-Changing Strategies for Agents in the Digital Age\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-in-real-estate/\" aria-label=\"More on ChatGPT in Real Estate: 5 Game-Changing Strategies for Agents in the Digital Age\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T20:03:33.000Z",
    "title": "BREAKING: Valkyrie Secures Green Light For Ethereum Futures ETF, Trading Launching Tomorrow",
    "url": "https://www.newsbtc.com/breaking-news-ticker/breaking-valkyrie-secures-green-light-for-ethereum-futures-etf-trading-launching-tomorrow/",
    "description": "According to a recent FOX Business report, Valkyrie Investments has secured approval from the Securities and Exchange Commission (SEC) to launch the first exchange-traded fund (ETF) featuring Ethereum (ETH) futures.  This achievement positions Valkyrie as the frontrunner among nine issuers seeking to provide investors with an opportunity to speculate on the future price of the world&#8217;s second-largest digital asset through an ETF. Related Reading: Research Firm Reveals Its “Altcoin Trading Playbook” Valkyrie Emerges As First Mover In Ethereum Futures ETF Race Ether, the native token of the Ethereum blockchain, currently holds a value of approximately $1,659 per token. Valkyrie aims to enhance retail participation in the crypto market by introducing an ETF that tracks Ether futures.  According to FOX, Valkyrie Investments plans to merge its existing Bitcoin (BTC) futures ETF with the newly introduced Ether futures ETF, creating a combined fund named “the Valkyrie Bitcoin and Ether Strategy ETF”.  Notably, the ETF&#8217;s Nasdaq ticker, BTF, will remain unchanged. The fund&#8217;s strategy includes opportunistically purchasing Ethereum futures, reflecting the growing interest in this digital asset over the past year. Related Reading: Bitcoin’s Hidden Threat? Miner Revenue Sent To Exchanges Surges Over 300% Originally scheduled to commence trading on October 3, Valkyrie expedited its launch in response to the possibility of a government shutdown on Friday, a development that would limit SEC operations.  With nearly two million federal workers facing layoffs without a funding agreement, Gensler has urged companies planning to go public to expedite their offerings before the shutdown occurs.  The fate of the Ether futures applicants remains uncertain, as the SEC has requested that they update their filings with any additional information by Friday afternoon. Lastly, Steven McClurg, Chief Investment Officer at Valkyrie, expressed enthusiasm about being at the forefront of offering Ethereum futures to investors, recognizing the exponential growth in interest surrounding this asset class.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T20:00:36.000Z",
    "title": "Ripple CTO Addresses Bitcoin Adviser’s Claims That XRP Is Centralized",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-cto-xrp-centralized/",
    "description": "Ripple CTO David Schwartz has addressed claims made by El Salvador Advisor Max Keiser that the XRP token is a “centralized” cryptocurrency. Schwartz took to X (formerly Twitter) to clear the air, stating that the Bitcoin Adviser’s opinion of XRP was too ignorant to warrant a proper reciprocation.  Ripple CTO Criticizes Centralization Claims On September 24, Co-founder of Volcano Energy and Bitcoin Advisor to El Salvador’s President, Max Keiser made a controversial statement about the XRP token. In an X (formerly Twitter) post, Keiser stated that Ripple’s native token, XRP was “centralized”, which was negatively received by the community and triggered a response from the Ripple CTO. Related Reading: Major Milestones Shows XRP Ledger Is Becoming A DeFi Force To Be Reckoned With Responding to Keiser’s controversial claim about the XRP, Schwartz expressed his indignation and stated that he found the statement laughable. “This is such an incredibly stupid argument I have no idea how I could possibly respond to it other than to laugh,” Schwartz said. In addition to Schwartz, the Product Head of Visa Installment and former employee of Ripple, Josh Gierscha, also jumped on the bandwagon to debunk Keiser’s claims. Initially, Giersch had believed that Keiser’s centralization claims were made from an X account impersonating the Bitcoin Advisor or from a fan account. However, Schwartz revealed that the comment was made by the real Max Keiser. He responded by quoting the original post from Keiser&#8217;s real account. Of course the real Max Keiser would never say anything this dumb.https://t.co/dd9JQUPvIYhttps://t.co/mOkN3v0vFU — David &#8220;JoelKatz&#8221; Schwartz (@JoelKatz) September 27, 2023 Giersch then topped off the conversation, saying, “Keiser’s an industrial-grade crank, I shouldn’t have expected any better from him” Keiser’s view on the XRP token was based on the cryptocurrency’s US patent created by Schwartz in 1992 which illustrated a cooperative system involving several interconnected computers.  This is not the first time that Keiser has said something to draw the ire of the XRP community. The Bitcoin advisor has had a poor view of the token for some time now and occasionally criticizes XRP while idolizing Bitcoin. Back in May, the Bitcoin advisor had come under fire following a statement labeling the XRP token a “shitcoin.” XRP Twitter Community Reacts To Centralization Argument The XRP community also poured out to criticize Keiser’s claims about the token. One community member attributed the statements to Bitcoin maxis being scared of the token’s abilities, saying; “Bitcoin maxis are terrified of XRP.” Related Reading: Is $10,000 Possible For XRP Price? Crypto Analysts Weigh In Another X user jumped in to add their own two cents saying that Keiser was being intentionally misleading to his over 500,000 followers. Pointing to the patent which Keiser used as the basis for his statement, the user said “There’s no way he believes you filed a patent for the XRPL in 1988. Not a chance. Yet this is what he asserts. Seems he’s just an “ends justify the means” type of guy.” Keiser’s remark on XRP’s decentralization contradicts the inherent nature of the token which is seen in its value as a digital payment currency and an open-source ledger blockchain. Token price dragged below $0.5 &#124; Source: XRPUSD on Tradingview.com Featured image from VOI, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T19:46:45.000Z",
    "title": "Gary Gensler Hearing: SEC Chair Poised to Dodge Ripple (XRP) Lawsuit Questions",
    "url": "https://www.crypto-news-flash.com/gary-gensler-hearing-sec-chair-poised-to-dodge-ripple-xrp-lawsuit-questions/?utm_source=rss&utm_medium=rss&utm_campaign=gary-gensler-hearing-sec-chair-poised-to-dodge-ripple-xrp-lawsuit-questions",
    "description": "<img width=\"510\" height=\"340\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/securities-and-exchange-7232757__340.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC sues Binance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/securities-and-exchange-7232757__340.jpg 510w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/securities-and-exchange-7232757__340-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/securities-and-exchange-7232757__340-104x69.jpg 104w\" sizes=\"(max-width: 510px) 100vw, 510px\" />Ahead of the US SEC Chair&#8217;s hearing before Congress, permutations points to potential evasion of Ripple lawsuit. The SEC&#8217;s favoritism as it concerns Prometheum is now largely pronounced. As the United States Securities and Exchange Commission (SEC) Chair Gary Gensler prepares to appear before the House of Representatives Committee on Financial Services, analysts are predicting [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-28T20:00:20.000Z",
    "title": "BitGo CEO Warns Bitcoin (BTC) Could One Day Be Replaced by Something ‘Materially Better’ – Here’s Why",
    "url": "https://dailyhodl.com/2023/09/28/bitgo-ceo-warns-bitcoin-btc-could-one-day-be-replaced-by-something-materially-better-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-materially-better.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bitcoin (BTC) will eventually be replaced as the top digital asset, according to Mike Belshe, the chief executive of crypto custodian BitGo. Belshe says in a new interview on Kitco News that digital assets are &#8220;here to stay,&#8221; but he acknowledges that Bitcoin might not always be the flagship asset for the sector. &#8220;Bitcoin is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/28/bitgo-ceo-warns-bitcoin-btc-could-one-day-be-replaced-by-something-materially-better-heres-why/\">BitGo CEO Warns Bitcoin (BTC) Could One Day Be Replaced by Something ‘Materially Better’ – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-28T19:55:50.000Z",
    "title": "Crypto Analyst Offers Update on Bitcoin (BTC), Says Chainlink (LINK) Has Broken Through a Downtrend",
    "url": "https://dailyhodl.com/2023/09/28/crypto-analyst-offers-update-on-bitcoin-btc-says-chainlink-link-has-broken-through-a-downtrend/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is updating his outlook on Bitcoin (BTC) while looking ahead for Chainlink (LINK). Pseudonymous crypto trader Rekt Capital tells his 354,500 followers on the social media platform X that he&#8217;s looking for BTC to form a lower high in the coming weeks. &#8220;BTC  At this same point in the cycle in 2019, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/28/crypto-analyst-offers-update-on-bitcoin-btc-says-chainlink-link-has-broken-through-a-downtrend/\">Crypto Analyst Offers Update on Bitcoin (BTC), Says Chainlink (LINK) Has Broken Through a Downtrend</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]