[
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T13:51:11.000Z",
    "title": "Genesis seeks court's approval to reduce 3AC claim from $1B to $33M",
    "url": "http://cointelegraph.com/news/genesis-court-cut-3ac-claim-33-million",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/38a5ebdf-23d3-46b6-a559-2857cc900b8b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bankrupt lender Genesis has asked the court to approve its proposed settlement agreement with the imploded crypto hedge fund 3AC.</p>\n                    <p><p>Bankrupt cryptocurrency lender Genesis has asked the court to approve its proposed settlement agreement with the imploded crypto hedge fund Three Arrows Capital (3AC).</p><p>According to a court filing on Nov. 9, Genesis argued that the 3AC debtor should receive an allowed general unsecured claim against Genesis in the amount of $33 million. The amount accounts for 3.3% of $1 billion in claims originally asserted against Genesis debtors.</p><p>“Agreement provides that the 3AC debtor shall receive an allowed general unsecured claim against GGC in the amount of $33 million in full and complete satisfaction of the more than $1 billion dollars in claims asserted against each of the Genesis debtors,” the document reads.</p><p>According to Genesis, 3AC’s $1 billion claims against Genesis were the largest asserted claims in Chapter 11 cases associated with the collapse of the FTX exchange. Genesis stressed that 3AC Debtor was one of Genesis’s largest borrowers from 2020 to 2022, up until the time of its collapse.</p><p>Additionally, Genesis wants to relinquish all of its claims and entitlements to Avalanche (AVAX) tokens and Near Protocol (NEAR) tokens in favor of the 3AC debtor. The bankrupt firms should drop any remaining liabilities, the proposed settlement reads, stating: </p><blockquote>“The Genesis debtors and 3AC mutually release each other from liability as set forth in more detail in the Settlement Agreement; and the Genesis debtors expressly retain, and do not otherwise release, any and all claims that they may have against DCG.”</blockquote><p>The lender said that the settlement was necessary to provide a smooth path for its Chapter 11 reorganization plans and to reduce potential risks and expenses from litigation.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/court-confirms-celsius-bankruptcy-exit-plan-2-billion-crypto-creditors\"><strong><em>Court confirms Celsius bankruptcy exit plan, $2B in crypto to go to creditors</em></strong></a></p><p>“The proposed settlement will, among other benefits to the Genesis debtors’ estates, significantly smooth the path to confirmation of the Genesis debtors’ Chapter 11 plan of reorganization, prompt distributions thereunder, and eliminate the risks, expenses, and uncertainty associated with protracted litigation among the parties,” the document reads.</p><p>The proposed settlement agreement was filed at the United States Bankruptcy Court for the Southern District of New York and requires Judge Sean Lane’s approval. Creditors can object to the settlement by Nov. 24, with a hearing scheduled for Nov. 30.</p><p>The news comes around the anniversary of the FTX exchange collapse <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">a year ago</a>, pulling the cryptocurrency industry into a massive bear market. Genesis and 3AC are just a few of the many companies affected by FTX failure due to exposure to the collapsed platform, with Genesis derivatives business losing access to $175 million locked on FTX.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-lawyer-irina-hall-of-flame/\"><strong><em>Hall of Flame: Crypto lawyer Irina Heaver on death threats, lawsuit predictions</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T13:43:30.000Z",
    "title": "JPMorgan rolls out programmable payments for institutional blockchain platform JPM Coin  ",
    "url": "http://cointelegraph.com/news/jp-morgan-launches-programmable-payments-for-jpmcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b0657306-792f-40c8-9ecf-f6f7bc37c151.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>JPMorgan’s blockchain platform JPM Coin has introduced programmable payment functionality for its institutional users. </p>\n                    <p><p>Multinational banking firm JPMorgan has rolled out a programmable payment feature for institutional users of its private blockchain platform JPM Coin.</p><p>Naveen Mallela, who heads up JP Morgan’s bank-led blockchain platform Onyx, <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7128680428038750208/\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> details of the new functionality on LinkedIn via an initial <a href=\"http://onyx\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg. According to Mallela, the programmable payments feature is now available to all its institutional clients.</p><p>The capability is said to enable real-time, programmable treasury functionality and new digital business models. Mallela hailed the launch as a significant milestone in the evolution of JPM Coin and described the newly introduced programmability as the ‘holy grail’ for its blockchain platform. </p><p>The Onyx team shared further details of the programmable payments feature in correspondence with Cointelegraph. Onyx and JPM Coin note that this feature has been a goal for the payments industry for several years and touts its offering as a “first-of-its-kind” by a global commercial bank.</p><p><a href=\"https://cointelegraph.com/news/jp-morgans-jpm-coin-introduces-euro-denominated-payments\"><strong><em>Related: JPMorgan bank deploys JPM Coin for euro-denominated payments</em></strong></a></p><p>The solution caters to blockchain-based accounts on the JPM Coin System, allowing users to program payments using a “If-This-Then-That” interface.</p><p>German tech firm Siemens AG is the first institutional client to make use of the programmable payments feature, proving its use as recently as Nov. 6. FedEx and Cargill are also expected to make use of the solution before the end of 2023.</p><p>According to Onyx, users can use programmable payments to manage several automated functions. This includes dynamic funding, which allows the specification of a range of rules for dynamically funding a bank account in case of shortfalls.</p><p>Event-based payouts are another use case, where users can execute payments based on events including margin calls, delivery of assets, goods and services or fulfillment of contractual obligations.</p><p>A statement from Mallela highlights the offering as the catalyst to enable dynamic and event-driven functionality powered by blockchain technology:</p><blockquote>“Programmability has been a key objective for digital currencies and tokenized money since the beginning.”</blockquote><p>Siemens AG group treasurer Peter Rathgeb adds that the introduction of programmability taps into the “advantages and features from the crypto world” in combination with JPMorgan’s blockchain-based bank accounts.</p><blockquote>“This will take Siemens to the next level of automation to not only optimize the use of working capital but also enable data-driven digital business models and support the scalability of our Siemens business from the treasury side.”</blockquote><p>JPMorgan is also understood to be developing a new blockchain-based solution for cross-border transactions. As per a Sep. 7 <a href=\"https://cointelegraph.com/news/jp-morgan-moves-deposit-tokens-settlements\">report </a>The new deposit token solution is a separate offering from its JPM Coin platform and will have to await the regulatory green light in the United States.</p><p><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Magazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T13:52:19.000Z",
    "title": "Genesis strikes key settlement in bankruptcy proceedings with 3AC",
    "url": "https://www.cryptopolitan.com/genesis-strikes-key-settlement-in-bankruptcy-proceedings-with-3ac/",
    "description": "Genesis, a bankrupt crypto lender, has recently taken a decisive step in its Chapter 11 reorganization efforts. The company has approached the court with a proposal to settle its ongoing dispute with Three Arrows Capital (3AC), a collapsed crypto hedge fund, according to a November 9 court filing. The proposed settlement marks a significant shift ... <a title=\"Genesis strikes key settlement in bankruptcy proceedings with 3AC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/genesis-strikes-key-settlement-in-bankruptcy-proceedings-with-3ac/\" aria-label=\"More on Genesis strikes key settlement in bankruptcy proceedings with 3AC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T13:51:30.000Z",
    "title": "Uniswap Founder Hayden Adams dismisses $2 Million phishing scam as a hoax",
    "url": "https://www.cryptopolitan.com/uniswap-hayden-adams-phishing-scam-as-a-hoax/",
    "description": "In a recent turn of events, Uniswap founder Hayden Adams has come forward to address the crypto community about a widely circulated news piece regarding a supposed $2 million phishing scam associated with Uniswap. Adams categorically stated that the news is nothing but a hoax, aiming to debunk the misinformation and alert the public about ... <a title=\"Uniswap Founder Hayden Adams dismisses $2 Million phishing scam as a hoax\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-hayden-adams-phishing-scam-as-a-hoax/\" aria-label=\"More on Uniswap Founder Hayden Adams dismisses $2 Million phishing scam as a hoax\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T14:00:39.000Z",
    "title": "Ethereum At $2,100: Why Path To $2,500 Is Now All Clear",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-2100-why-path-2500-now-all-clear/",
    "description": "On-chain data suggests the path to $2,500 could be open for Ethereum now that the asset has managed to cross the $2,100 mark. Ethereum Has No Major Resistance Levels Until $2,500 In a new post on X, the market intelligence platform IntoTheBlock has provided an update on how the Ethereum levels are looking in terms of on-chain support and resistance. In on-chain analysis, ranges are defined as support or resistance based on how many investors acquired their coins inside them. The below chart shows the density of addresses at various levels above and below the current spot price of the cryptocurrency: The amount of holders that acquired their coins at each of the different ETH price ranges &#124; Source: IntoTheBlock on X Generally, whenever the Ethereum price retests the cost basis of an investor, they may be more likely to show some kind of move. When this retest happens from above, the holder may be inclined to believe the price will go up again soon so they may see the retest as a &#8220;dip&#8221; and thus, might decide to buy more. Related Reading: Polygon (MATIC) Jumps Another 6% As Whales Show High Activity On the other hand, the investor may want to exit the market if the retest is from below, as they might fear the price would go down again in the future, and by selling at the break-even mark, they would at least avoid incurring any losses. A few investors showing such behavior is obviously not enough to cause any visible effects on the market, but if a large number of investors share the same cost basis, the asset could very well feel a sizeable reaction. From the chart, it&#8217;s visible that there are some large cost basis centers below the current Ethereum levels, suggesting the presence of strong potential support ranges. Earlier, when the asset had still been below $2,000, the $2,000 to $2,100 range posed as the last major resistance boundary to break. Since the coin has now risen above these prices, it&#8217;s possible that the range would be switching its role towards being support instead. Following this latest rally, about 75% of the holders are now in profit (that is, their cost basis is in the levels below). As is visible in the graph, there are no price ranges with a high density of investors in the upcoming price levels, until the $2,500 mark. &#8220;Does this mean it&#8217;s a clean run to a new ATH? Not necessarily,&#8221; explains IntoTheBlock. &#8220;Historically, profit-taking at these levels is common and leads to pullbacks. However, this is unlikely to significantly impact Ethereum&#8217;s long-term trajectory.&#8221; Related Reading: Bitcoin Bulls Gear Up: 200-Day SMA Rise And Historical Trend Signal $50,000 Price Target Analyst Ali Martinez has also pointed out something interesting in an X post today. He revealed that the latest rally in ETH has occurred without the support of the largest of the Ethereum whales (carrying a balance greater than 10,000 ETH), the so-called &#8220;mega whales.&#8221; Looks like the value of the metric has been moving sideways recently &#124; Source: @ali_charts on X As highlighted in the graph, the total number of addresses owned by the Ethereum mega whales has been flat recently. &#8220;Ethereum has reclaimed the $2,000 threshold, and intriguingly, this is all happening before whales have even started buying ETH!&#8221; notes Ali. ETH Price After a surge of more than 9% in the past 24 hours, Ethereum has arrived at the $2,100 level for the first time since April. The asset's price appears to have exploded during the past day &#124; Source: ETHUSD on TradingView Featured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, Glassnode.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T13:57:21.000Z",
    "title": "Polygon (MATIC) Soars Over 50% with Billion-Dollar Partnerships: NEAR, Immutable, and Ubisoft",
    "url": "https://www.crypto-news-flash.com/polygon-matic-soars-over-50-with-billion-dollar-partnerships-near-immutable-and-ubisoft/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-soars-over-50-with-billion-dollar-partnerships-near-immutable-and-ubisoft",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Polygon&#8217;s MATIC has recently recorded remarkable gains after a billion-dollar partnership deal with NEAR. Interest in MATIC has surged with whales going on a buying spree in recent weeks. Polygon&#8217;s native cryptocurrency MATIC has joined the crypto market party with its price soaring more than 50 percent in the last three weeks. As of press [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T13:43:59.000Z",
    "title": "TON Blockchain Breaks Speed Records, Outperforming Ripple (XRP), Bitcoin and Ethereum",
    "url": "https://www.crypto-news-flash.com/ton-blockchain-breaks-speed-records-outperforming-ripple-xrp-bitcoin-and-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=ton-blockchain-breaks-speed-records-outperforming-ripple-xrp-bitcoin-and-ethereum",
    "description": "<img width=\"1920\" height=\"1307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ton\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-300x204.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-1024x697.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-768x523.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-1536x1046.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Toncoin&#8217;s value surged to $2.61, hitting a high not seen since February 2022, which moved it into the top ten cryptocurrencies by market cap. The TON blockchain showcased a transaction speed surpassing traditional payment networks, with integrations like a new wallet on Telegram bolstering its utility. Toncoin (TON) has reclaimed its position as one of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T13:42:44.000Z",
    "title": "ApeMax the Next Pepe Coin? Guide to ApeMax the Trending New Meme Coin and Hot Crypto Presale",
    "url": "https://www.crypto-news-flash.com/apemax-the-next-pepe-coin-guide-to-apemax-the-trending-new-meme-coin-and-hot-crypto-presale/?utm_source=rss&utm_medium=rss&utm_campaign=apemax-the-next-pepe-coin-guide-to-apemax-the-trending-new-meme-coin-and-hot-crypto-presale",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-22.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-22.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-22-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-expanding universe of cryptocurrencies, meme coins have carved out a unique niche, capturing the imaginations of digital asset enthusiasts worldwide. Pepe Coin previously caught the crypto community&#8217;s attention with its blend of humor and utility, and now, a new player enters the arena. ApeMax, with its eye-catching features and compelling presale, is making [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T14:06:00.000Z",
    "title": "Turkey’s Crypto Adoption Surges After Earthquake; 40% Now Own Crypto",
    "url": "https://coinedition.com/turkeys-crypto-adoption-surges-after-earthquake-40-now-own-crypto/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Turkey Crypto Adoption Surges\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/PRICE-ANALYSIS-5-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The largest crypto exchange, Binance, has presented research on cryptocurrency adoption in the Republic of Turkey as part of its Binance Blockchain Week in Istanbul, Turkey. According to the research, the country exhibits a robust rate of cryptocurrency adoption, with two out of every five citizens holding various crypto assets. Emphatically, it mentioned that approximately [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/turkeys-crypto-adoption-surges-after-earthquake-40-now-own-crypto/\">Turkey&#8217;s Crypto Adoption Surges After Earthquake; 40% Now Own Crypto</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T13:57:42.000Z",
    "title": "CryptoRank Presents: Crypto Fundraising Recap, October 2023",
    "url": "https://coinedition.com/cryptorank-presents-crypto-fundraising-recap-october-2023/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/PR-5-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/PR-5-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/PR-5-3-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Fundraising activity has reached its lowest level in the past three years. This can be attributed to the tightening monetary policy and the lack of new disruptive protocols. The limited variety of existing solutions has resulted in the emergence of numerous similar protocols. Consequently, the size of funding rounds has decreased as money has become [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cryptorank-presents-crypto-fundraising-recap-october-2023/\">CryptoRank Presents: Crypto Fundraising Recap, October 2023</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T13:48:22.000Z",
    "title": "Hon’ble MoS Rajeev Chandrasekhar Joins India’s Most Impactful Tech Event",
    "url": "https://coinedition.com/honble-mos-rajeev-chandrasekhar-joins-indias-most-impactful-tech-event/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/pr-7-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/pr-7-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/pr-7-2-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>There has been growing anticipation surrounding Trescon&#8217;s Digital Acceleration &#38; Transformation Expo (DATE) as Shri Rajeev Chandrashekhar, Hon’ble Minister of State for Electronics and Information Technology, has confirmed his participation at the event. Set against the backdrop of India&#8217;s thriving tech revolution, the event will take place on 23-24 November 2023 at the newly inaugurated [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/honble-mos-rajeev-chandrasekhar-joins-indias-most-impactful-tech-event/\">Hon’ble MoS Rajeev Chandrasekhar Joins India’s Most Impactful Tech Event</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T13:40:43.000Z",
    "title": "XRP Price Prediction 2023-2030: Will XRP Price Hit $1 Soon?",
    "url": "https://coinedition.com/ripple-xrp-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish XRP’s price prediction ranges from $0.6158 to $0.6634. Analysis suggests that the XRP price might reach $1 soon. XRP’s bearish market price prediction for 2023 is $0.3431. As the “crypto solution for business,” Ripple promises to create a business impact by taking advantage of blockchain technology. Ripple promises that its solution is faster, more [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ripple-xrp-price-prediction/\">XRP Price Prediction 2023-2030: Will XRP Price Hit $1 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]