[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T08:26:54.000Z",
    "title": "XRP, ADA Lead Declines in Major Cryptocurrencies as Bitcoin Drops Below $25K",
    "url": "https://www.coindesk.com/markets/2023/06/15/xrp-ada-lead-declines-in-major-cryptocurrencies-as-bitcoin-drops-below-25k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Losses on major tokens extended to over 7.4% in the past 24 hours, data shows."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-15T08:24:16.000Z",
    "title": "Crypto Lender Celsius Updates Bankruptcy Plan After Fahrenheit Deal",
    "url": "https://www.coindesk.com/policy/2023/06/15/crypto-lender-celsius-updates-bankruptcy-plan-after-fahrenheit-deal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new filing is set to face legal opposition from borrowers."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T08:28:05.000Z",
    "title": "Voyager Digital bankruptcy administrators rubber stamp 36% partial withdrawals",
    "url": "https://cryptoslate.com/voyager-digital-bankruptcy-administrators-rubber-stamp-36-partial-withdrawals/",
    "description": "<p>Voyager Digital will open partial withdrawals as early as June 20, according to Voyager Digital&#8217;s bankruptcy plan administrator, Paul Hage. Hage&#8217;s timeline showed the Voyager app would be updated on June 15 so users can view amounts due in this initial distribution of funds. He estimated that withdrawals would go live between June 20 and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/voyager-digital-bankruptcy-administrators-rubber-stamp-36-partial-withdrawals/\">Voyager Digital bankruptcy administrators rubber stamp 36% partial withdrawals</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T08:18:46.000Z",
    "title": "Huobi Launches Mars Program Becoming the First Cryptocurrency Exchange to Enter Space Exploration",
    "url": "https://cryptodaily.co.uk/2023/06/huobi-launches-mars-program-becoming-the-first-cryptocurrency-exchange-to-enter-space-exploration",
    "description": "<p>Singapore, Singapore, June 15th, 2023, Chainwire</p><p>Huobi, the virtual asset trading platform, announces Phase I of the Huobi Mars Program to kick off its ambitious plan to explore the universe.</p><p>Get Huobi on Mars! By investing big in the space program, Huobi has shown its dedication as the leading cryptocurrency exchange for space exploration. &ldquo;Huobi's aspirations are to reach out far into the universe,&rdquo; said Justin Sun, a member of Huobi Advisory Board. He also mentioned that, &ldquo;Huobi will join hands with its users in embarking on this special journey throughout space and to explore the unknown. Huobi users will become the first in the Web3 field to enter space.&rdquo;</p><p>According to Huobi's announcement, the first phase of the Huobi Mars Program spans from June 2023 to June 2024 and consists of 12 rounds. Each round will include a themed activity under which the participating users need to complete the specified tasks and mint the space NFTs. For each round, one lucky user will be selected to win a monthly reward and the winner will be shortlisted as a candidate space passenger. In the second phase, the 12 candidates will be evaluated based on their physical fitness, training and preparation, community contribution, etc., to determine the eventual passenger for space travel with Justin Sun. The space flight is scheduled at a suitable time after July 2024.</p><p>The first round of the Huobi Mars Program will last from 12:00 (UTC) on June 14 to 15:59 (UTC) on July 5, 2023. Participating users will need to complete the required one-time, revolving, or monthly settlement of spot trading, P2P transactions, futures trading, and Huobi Earn transactions in order to win space NFT rewards. A user will be offered one chance to mint a space NFT for each task completed, without upper limits.</p><p>The space NFTs will be issued on the TRON Network and marketable on various NFT trading platforms. Users will need to link their TRON addresses on the event page in order to receive the minted NFTs. Users are advised to mint the NFTs as soon as possible, as the daily allocated NFT mints are capped and the minting qualification does not carry over to the next round. The first round of NFT minting time lasts from 12:00 (UTC) on June 14 to 15:59 (UTC) on July 15, 2023. The result for the first round will be released at 12:00 (UTC) on July 20, 2023.</p><p>One lucky user will be drawn to win the generous monthly award and shortlisted as a candidate space passenger each month. The space flight will be broadcasted to the world via a livestream. The candidate space passenger shall be the holder of the NFT number that has been drawn. Huobi will also check the lucky NFT holder's TRON address, UID, KYC verification, etc., to verify the winner's identity. Please note that snapshots will be taken at the time of the result release to determine the winner. The winning space NFTs are not transferable. Any such transfer is deemed as a waiver of the reward.</p><p>The lucky users shortlisted during the first round of Huobi Mars Program will not only qualify as a space passenger candidate but also enjoy the privilege of a 180-day exemption from spot trading fees on Huobi.</p><p>Ancient astronomers observed the movement of stars to make calendars. In the contemporary time, Elon Musk's SpaceX has been blasting off next-generation rockets. Huobi is contributing its own share to this great cause. With this Mars Program, Huobi hopes to introduce space travel to more people, inspire more interest and passion, and promote the development of commercial spaceflight. This move demonstrates Huobi's commitment to innovation and exploration, as well as its financial strength.</p><p>Get Huobi on Mars! Huobi will always be on the road and never stop.</p><p>About Huobi</p><p>Founded in 2013, Huobi has evolved from a crypto exchange into a comprehensive ecosystem of blockchain businesses that span digital asset trading, financial derivatives, wallets, research, investment, incubation and other areas. Huobi serves millions of users worldwide, with a business presence covering over 160 countries and regions across five continents. Its three development strategies - \"global development, technology drives development, and technology for good\" - underpin its commitment to providing comprehensive services and values to global cryptocurrency enthusiasts.</p><p></p>ContactMichael Wangglo-media@huobi.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T08:26:27.000Z",
    "title": "How to Find the Most Trustworthy Crypto Casino Sites",
    "url": "https://www.cryptopolitan.com/how-to-find-the-most-trustworthy-crypto-casino-sites/",
    "description": "The number of online crypto casino sites is expanding in tandem with the popularity of cryptocurrencies. You shouldn&#8217;t put all of your money and personal information on these networks, though. Finding reputable crypto casino sites that emphasize security, fairness, and dependability, such as the&#160;Trustly casinos, is essential when using cryptocurrency for gaming. This post will ... <a title=\"How to Find the Most Trustworthy Crypto Casino Sites\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-find-the-most-trustworthy-crypto-casino-sites/\" aria-label=\"More on How to Find the Most Trustworthy Crypto Casino Sites\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-15T08:22:40.000Z",
    "title": "Differences Between From Meta and Apple AR Glasses",
    "url": "https://www.altcoinbuzz.io/product-release/differences-between-from-meta-and-apple-ar-glasses/",
    "description": "<p>Augmented Reality (AR), Virtual Reality (VR), and Metaverse. Nowadays, these buzzwords seem to be springing up more often. This is for good reason. It&#8217;s the next big thing for the entire world. Indeed, the world&#8217;s top tech companies are well aware of the AR/VR trend. In fact, they&#8217;ve sprung into action already. Apple and Meta [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/differences-between-from-meta-and-apple-ar-glasses/\">Differences Between From Meta and Apple AR Glasses</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T08:23:17.000Z",
    "title": "Crypto Market Cap Falls Despite Positive FED Announcement",
    "url": "https://coinedition.com/crypto-market-cap-falls-despite-positive-fed-announcement/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>For the first time in a year, the U.S. Federal Reserve (FED) recently confirmed that it would not be raising interest rate levels. According to the blockchain intelligence firm Santiment, crypto prices had surprisingly dropped following the announcement. In the post, they also noted that Ethereum (ETH) looked as though institutions were expecting the move. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-market-cap-falls-despite-positive-fed-announcement/\">Crypto Market Cap Falls Despite Positive FED Announcement</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]