[
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T07:43:37.000Z",
    "title": "FTX wants court to allow up to $200M weekly crypto sale, restart ‘hedging’ BTC",
    "url": "https://cryptoslate.com/ftx-wants-court-to-allow-up-to-200m-weekly-crypto-sale-restart-hedging-btc/",
    "description": "<p>FTX has filed a motion in bankruptcy court seeking approval to hire Galaxy Digital Capital Management LP (&#8220;Galaxy&#8221;) as an investment manager, according to a court filing uploaded to FTX&#8217;s claims agent website on Aug. 23. Galaxy investment manager for FTX. As the filing outlines, FTX is proposing to engage Galaxy to provide investment management [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-wants-court-to-allow-up-to-200m-weekly-crypto-sale-restart-hedging-btc/\">FTX wants court to allow up to $200M weekly crypto sale, restart &#8216;hedging&#8217; BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T08:03:59.000Z",
    "title": "\n                        Dymension Builds On Early Devnet Success With Incentivized Testnet Launch\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/dymension-builds-on-early-devnet-success-with-incentivized-testnet-launch",
    "description": "\n                        <p dir=\"ltr\">Dymension, the startup building out an interconnected network of modular blockchains called RollApps, will launch its incentivized testnet by the end of this month, enabling developers to interact with its IBC-compatible rollups for the first time and start building more scalable dApps.&nbsp;</p>\n<p dir=\"ltr\">Using the testnet, developers will be able to deploy RollApps easily using Dymension&rsquo;s command line tool Roller. The startup said the deployment of its testnet was made possible by a collaboration with the data-focused networks Avail and Celestia, and enables builders to create their first RollApps using customizable virtual machines including the Ethereum Virtual Machine.&nbsp;</p>\n<p dir=\"ltr\">Dymension is all about bringing scalability to the Web3 world through the use of application-specific rollups, which are based on the same scaling technology that&rsquo;s used by so-called Layer-2 networks like Polygon, Avalanche, Fuel and Boba Network. What&rsquo;s different about Dymension&rsquo;s RollApps is that they&rsquo;re the only one of their kind that provide full compatibility with IBC and the Cosmos ecosystem out of the box. They&rsquo;re also data-agnostic thanks to their ability to connect to any data availability network.&nbsp;</p>\n<p dir=\"ltr\">Although Dymension is competing in a very competitive niche, the potential of its technology is widely regarded. Earlier this year, the startup was able to raise $6.7 million in a funding round led by Big Brain Holdings and Stratos, with participation from DraftKings&rsquo; Shalom Meckenzie and DAO matchbox. Dymension has ambitions to accelerate Web3&rsquo;s growth by helping developers to shift away from Ethereum and its scaling constraints.&nbsp;</p>\n<p dir=\"ltr\">Dymension&rsquo;s incentivized testnet follows the successful implementation of its devnet in June, where more than 500 RollApps were deployed by early adopters. Each of those RollApps is connected to the Dymension Hub to provide a secure and reliable bridge to the IBC ecosystem. With RollApps, the task of achieving consensus is delegated to Dymension Hub, paving the way for highly secure and super-fast blockchains with a sub 0.2 seconds transaction finality. The Dymension Hub handles all aspects of interoperability, vastly simplifying the process of interacting with RollApps to enable more cost-effective and scalable dApps. Its biggest impact comes in terms of reducing the infrastructure costs associated with the deployment of dApps, Dymension said.&nbsp;</p>\n<p dir=\"ltr\">Following the success of the devnet, Dymension says it&rsquo;s confident that it can attract even more interest in its RollApps from the wider Cosmos and Ethereum ecosystems due to its unique status as the only rollup provider that offers IBC as a bridge.&nbsp;</p>\n<p dir=\"ltr\">When the testnet launches, users will be able to interact with RollApps through the Dymension Portal, which is its primary web interface. From the portal, users can view various ecosystem statistics and bridge over IBC using the MetaMask wallet.&nbsp;</p>\n<p dir=\"ltr\">Dymension said all RollApps deployed on the testnet will publish their data to Avail and Celestia, with Cosmos and Ethereum to be added in a future update. In addition, Dymension supports a choice of VMs, including EVM, CosmWasm and others. This overcomes another key limitation for developers, who have traditionally always had no choice but to use the standard VM of the ecosystem they&rsquo;re building in.&nbsp;</p>\n<p dir=\"ltr\">&nbsp;</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T07:44:06.000Z",
    "title": "\n                        DYdX Issues Guidelines For Chain Validators To Secure Ecosystem\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/dydx-issues-guidelines-for-chain-validators-to-secure-ecosystem",
    "description": "\n                        <p dir=\"ltr\">The dYdX foundation, the non-profit organization behind the dYdX decentralized exchange, has published a list of guidelines and requirements that validators and stakers must comply with.&nbsp;</p>\n<p dir=\"ltr\">According to dYdX, these guidelines have been issued to ensure maximum user protection.&nbsp;</p>\nGood Practices For dYdX Chain Validators&nbsp;\n<p dir=\"ltr\">dYdX stated that it was releasing the list of good practices for prospective validators of the dYdX chain. The list has been released to further the foundation&rsquo;s mission to foster, support, and promote the dYdX ecosystem by enabling communities, developers, and decentralized governance. According to the post, the list would help token holders make informed decisions regarding the selection of validators to stake to. It would also increase the likelihood of dYdX Chain L1 token holders to stake to them.&nbsp;</p>\n<p dir=\"ltr\">The blog post organizes the list of good practices into six distinct categories. These are MEV, Performance, Operations and Security, Transparency, Governance participation, and dYdX ecosystem considerations. The post states that validators must maintain high uptime and ensure that their node is online at most times. They should also keep mempools across the network more consistent and ensure a better experience for traders. It also stated that chain validators must minimize the slashing risk by monitoring the performance of their nodes. The team added in the post,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;It&rsquo;s inadvisable to use &ldquo;sentries&rdquo; given increased latency, but instead opt for a threshold signer.&rdquo;</p>\n\n<p dir=\"ltr\">Other good security practices highlighted in the post include the proper storage of keys, which should be backed up in a separate, secure location. Validators must also implement a system to issue alerts for critical issues and participate in dYdX chain testnets and operating nodes through a legal organization. It also laid emphasis on transparency, urging chain validators and stakers to engage with the dYdX community and keep them informed regarding current developments.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Validators may choose to be transparent about their operations and provide regular updates to their delegations. This includes publishing information about geographic location, redundancy, physical security, node performance, uptime, and rewards distribution, among other things, and full disclosure of the total number of validators operated and the total stake controlled by them.&rdquo;</p>\n\nStrong Stand Against MEV&nbsp;\n<p dir=\"ltr\">The post has taken a particularly strong stand against Maximal Extractable Value (MEV), stating that validators must not engage in any activity that is related to MEV. According to the post, those engaging in MEV-related activities would be subject to punishment, and delegates would also face repercussions should they support any validator indulging in MEV practices.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;We expect that the dYdX community will take steps to disincentivize and punish bad actors who engage in MEV activities. As such, a delegator should consider that they may be impacted if they are delegating to a validator engaging in MEV.&rdquo;</p>\n\n<p dir=\"ltr\">The team further noted,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Aligning on potential good practices for validators could be important in guiding responsible participation and decision-making within the dYdX Chain ecosystem.&rdquo;</p>\n\n<p dir=\"ltr\">Maximal Extractable Value or MEV refers to the practice of using arbitrage techniques to extract profit by reordering transactions that ordinary Web3 users execute. According to Flashbots, Ethereum users have lost a staggering $450 million to MEV since the Merge and over $600 million in the two years prior to it.&nbsp;</p>\nThe dYdX Chain&nbsp;\n<p dir=\"ltr\">The notice from the dYdX foundation comes as dYdX prepares to move from the Ethereum network to a Cosmos-based dedicated appchain. The second public testnet for the dYdX chain was launched on the 10th of August and introduced over 30 markets to the platform. dYdX is a leader in the perpetual DEX markets, with the protocol hosting over $400 million worth of trades on the 21st of August, according to Token Terminal.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T08:07:06.000Z",
    "title": "Generative AI Service Pricing and Erosion: A Closer Look",
    "url": "https://www.cryptopolitan.com/generative-ai-service-pricing-and-erosion/",
    "description": "A pricing paradigm has emerged in the realm of generative artificial intelligence (AI) services, setting the stage for potential challenges and market shifts. OpenAI, Midjourney, and Microsoft have marked their positions, charging $20 monthly for ChatGPT (GPT-4) and Copilot offerings.&#160; This pricing benchmark has garnered attention and spurred a valuation frenzy among investors, driven by ... <a title=\"Generative AI Service Pricing and Erosion: A Closer Look\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-service-pricing-and-erosion/\" aria-label=\"More on Generative AI Service Pricing and Erosion: A Closer Look\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T07:53:09.000Z",
    "title": "Rising Concerns: AI-Powered Chatbots Exploited for Cyberattacks",
    "url": "https://www.cryptopolitan.com/rising-concern-ai-powered-chatbots-exploited/",
    "description": "The buzz surrounding ChatGPT, the AI-powered chatbot developed by OpenAI renowned for its prowess in producing eloquent prose and functional code, is palpable in the tech realm. However, a looming predicament arises as malicious cyber attackers leverage similar generative AI tools like ChatGPT to concoct persuasive narratives and deploy operational code. An issue that has ... <a title=\"Rising Concerns: AI-Powered Chatbots Exploited for Cyberattacks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rising-concern-ai-powered-chatbots-exploited/\" aria-label=\"More on Rising Concerns: AI-Powered Chatbots Exploited for Cyberattacks\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T07:47:56.000Z",
    "title": "Headlines Accusing Binance of Selling Bitcoin to Support BNB Price Amid Regulatory Pressure Seen as FUD",
    "url": "https://www.crypto-news-flash.com/headlines-accusing-binance-of-selling-bitcoin-to-support-bnb-price-amid-regulatory-pressure-seen-as-fud/?utm_source=rss&utm_medium=rss&utm_campaign=headlines-accusing-binance-of-selling-bitcoin-to-support-bnb-price-amid-regulatory-pressure-seen-as-fud",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-104x69.jpg 104w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Binance has been accused of offloading its Bitcoin bag to prop up the BNB price to ostensibly avoid a forced liquidation. Binance founder and CEO Changpeng Zhao (CZ) clarified through an interview that the exchange is liquid and does not have debts or take VC funds. As the largest cryptocurrency exchange by Bitcoin liquidity and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T07:42:43.000Z",
    "title": "LBank to List Five New Tokens This Week",
    "url": "https://www.crypto-news-flash.com/lbank-to-list-five-new-tokens-this-week/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-to-list-five-new-tokens-this-week",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/this_week_20230821_1_1692766523rqpmftn88K.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/this_week_20230821_1_1692766523rqpmftn88K.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/this_week_20230821_1_1692766523rqpmftn88K-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/this_week_20230821_1_1692766523rqpmftn88K-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/this_week_20230821_1_1692766523rqpmftn88K-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, August 24th, 2023, Chainwire LBank exchange continues to focus on providing its users with access to quality tokenized projects. For the week starting August 21, a total of five new tokens will be made available for trading on LBank including a number of memecoins. On August 21, LBank listed ROA, the token [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T07:46:44.000Z",
    "title": "Warner Music Singapore, ONE Championship & PwC Leaders Join Affyn for Web 3.0 Event during F1 Week",
    "url": "https://coinedition.com/warner-music-singapore-one-championship-pwc-leaders-join-affyn-for-web-3-0-event-during-f1-week/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PR-1-105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PR-1-105.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PR-1-105-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Affyn is delighted to announce that Warner Music Singapore, ONE Championship and PwC will be joining the lineup of speakers at the event titled “Web 3.0 &#124; Art Meets Metaverse”, which also features an exhibition from NFT Asia’s community of artists and WeAreSG NFT Collection by GERMS Digital. The event is part of the Grand [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/warner-music-singapore-one-championship-pwc-leaders-join-affyn-for-web-3-0-event-during-f1-week/\">Warner Music Singapore, ONE Championship &amp; PwC Leaders Join Affyn for Web 3.0 Event during F1 Week</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]