[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T12:22:58.000Z",
    "title": "Crypto Exchange bitFlyer Aligns Itself With FATF 'Travel Rule' With New Restrictions",
    "url": "https://www.coindesk.com/policy/2023/05/30/crypto-exchange-bitflyer-aligns-itself-with-fatf-travel-rule-with-new-restrictions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company is only allowing crypto and transfers to platforms that comply with Coinbase-led Travel Rule Universal Solution Technology (TRUST)."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-30T12:17:04.000Z",
    "title": "First Mover Americas: Bitcoin on Track for First Monthly Loss of the Year ",
    "url": "https://www.coindesk.com/markets/2023/05/30/first-mover-americas-bitcoin-on-track-for-first-monthly-loss-of-the-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for May 30, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T12:24:47.000Z",
    "title": "Two key security practices for Web3 startups from Israel Crypto Conference ",
    "url": "https://cointelegraph.com/news/security-practices-for-web3-startups-israel-crypto-conference",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/15bcde62-7f2f-41c0-8059-83b9f184ff6b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Shahar Madar, the head of security products at Fireblocks, says Web3 startups need to think from the “attacker’s perspective” when planning security protocols.</p>\n                    <p><p>Security continues to be one of the Web3 space’s most important and relevant matters, as protocols and enterprises <a href=\"https://cointelegraph.com/news/jump-crypto-finds-double-voting-vulnerability-in-celer-s-sgn\">continue to face exploits</a>.</p><p>Cointelegraph spoke with Shahar Madar, the head of security products at Fireblocks, at the Israel Crypto Conference about what necessary steps Web3 startups should take to secure their platforms and users. </p><p>In his experience, Madar told Cointelegraph that many young startups usually put off developing a security protocol, for a focus on growth. </p><p>However, Web2 models for enterprise security don’t work in a Web3 world that has such an emphasis on finance. He said from the “attacker's perspective,” they’re always looking for a return on their hack of a project. </p><blockquote>“This is the thing that people miss. Everyone sees what they're doing - the code is usually open source. Everyone can interact with their project and they are not prepared for that.”</blockquote><p>Madar stressed that companies need to talk about a security framework asking important questions like, “How do you vet your team,” “How do you place access control,” and “How do you test your infrastructure map and prepare for the incident.”</p><blockquote>“[Companies] need frameworks and products that help them hit the ground running in terms of security.”</blockquote><p>According to the Fireblocks security head, for any young startup in the Web3 space, two basic things are needed, the first being “access control.”</p><p>Access control means that not everyone at the company has the same access to various aspects of a project. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/monero-community-lashes-out-against-mordinals-amid-privacy-concerns\"><strong><em>Monero community lashes out against ‘Mordinals’ amid privacy concerns</em></strong></a></p><p>Madar gave the example of a business developer not being able to deploy smart contracts. “Not because they are a bad person,” he said. “Rather from a security perspective with boundaries.”</p><p>The second thing is a game plan - to sit down and map out the project from the security perspective. He said developers should “imagine how you would hack yourself.”</p><blockquote>“Start small but don’t hold off until later. The attacker is watching you, the attacker is waiting for you.”</blockquote><p>He said all it takes to start making a game plan is simple “tabletop exercises” and set team meetings. </p><p>This warning to Web3 startups comes as the space faced multiple compromises over the last week alone. On May 28, the Arbitrum-based <a href=\"https://cointelegraph.com/news/arbitrum-based-jimbos-protocol-hacked-losing-7m-in-ethereum\">Jimbos Protocol lost $7.5 million</a> in Ether in a hack, while on May 19, the DeFi protocol<a href=\"https://cointelegraph.com/news/defi-protocol-wdzd-swap-exploited-for-1-1m-certik\"> WDZD Swap faced a $1.1 million</a> exploit. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin: The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T12:20:34.000Z",
    "title": "Security firm discovers $500M vulnerability in Tron multisig accounts",
    "url": "https://cointelegraph.com/news/tron-multisig-accounts-vulnerability-discovered-by-security-team",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/2b5101a9-8ab3-4e6b-bba3-9e2f03e17751.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After reporting the vulnerability to Tron in February, the researchers highlighted that the issue was promptly addressed and resolved within a few days.</p>\n                    <p><p>A research team at dWallet Labs has discovered a zero-day vulnerability in Tron multisig accounts, allowing an attacker to bypass the multi-signature mechanism and sign transactions with a single signature. </p><p>In a technical breakdown post, the research team said the vulnerability could have impacted $500 million in assets held within Tron multisig accounts. This is because it allows any signer to “completely overcome the multisig security offered by TRON.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">0d, our superstar cybersecurity research team, discovered a vulnerability in TRON multisig accounts putting over $500M of digital assets at risk - it was disclosed and fixed so there are no user assets at risk now.<br><br>A technical breakdown:<a href=\"https://t.co/nMj6kV6Oc3\">https://t.co/nMj6kV6Oc3</a></p>&mdash; dWallet Labs (@dWalletLabs) <a href=\"https://twitter.com/dWalletLabs/status/1663492997005074433?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As its name suggests, multisignature wallets require multiple signers defined in an account to approve transactions and move funds, allowing the creation of joint accounts in crypto. Each signer of the account holds their own keys and the account requires a certain threshold for approving transactions. </p><p>According to the research team, the vulnerability with Tron’s multisig allows generating many valid signatures. They wrote: </p><blockquote>“We can bypass the multisig verification process by signing the same message with non-deterministic nonces of our choice. By doing so, we will be able to generate many valid different signatures for the same message by the same private key.” </blockquote><p>According to the cybersecurity team, Tron makes sure that the signatures are unique instead of checking if the signers are unique. Because of this, signers can potentially \"double vote\" or sign twice. Omer Sadika, who works with dWallets, said that the fix was simple — verify the address instead of the number of signatures.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/f4c14852-f897-4e0c-83cf-b6bdd1e10fbc.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Omer Sadika discussed the vulnerability in a thread. Source: Twitter</em></figcaption></figure><p>The researchers noted that the vulnerability was reported to Tron back in February and was already fixed days after being reported. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/justin-sun-issues-apology-after-sui-launchpool-clash-with-binance-ceo\"><strong><em>Justin Sun issues apology after Sui LaunchPool clashes with Binance CEO</em></strong></a></p><p>Cointelegraph reached out to Tron for comments but did not receive a response. </p><p>In other news, another <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocol recently suffered a $7.5 million exploit. On May 28, blockchain security firm PeckShield reported that Arbitrum-based Jimbos Protocol was hacked, resulting in the loss of 4,000 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-and-china-try-to-crush-binance-sbfs-40m-bribe-claim-asia-express/\"><strong><em>US and China try to crush Binance, SBF’s $40M bribe claim</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T12:15:16.000Z",
    "title": "El Dorado Exchange attacker returns over $400k after team admits code vulnerabilities",
    "url": "https://cryptoslate.com/ede-finance-attacker-returns-over-400k-after-team-admits-price-manipulation/",
    "description": "<p>An attacker targeting DeFi protocol El Dorado Exchange (EDE Finance) has returned over $400,000 worth of USDC and USDT after the project admitted that it made an &#8220;ill-advised decision to manipulate the price.&#8221; Earlier today, the decentralized exchange (DEX) protocol was exploited for around $580,000, according to security firm Peckshield, which specializes in monitoring and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ede-finance-attacker-returns-over-400k-after-team-admits-price-manipulation/\">El Dorado Exchange attacker returns over $400k after team admits code vulnerabilities</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T12:14:46.000Z",
    "title": "Crypto miners rejoice as threatening energy tax withdrawn",
    "url": "https://www.cryptopolitan.com/crypto-miners-rejoice-as-threatening-energy-tax-withdrawn/",
    "description": "Cryptocurrency miners nationwide found their spirits uplifted this Sunday as a dark cloud threatening their industry parted, revealing a silver lining. The potential storm, a 30% energy excise tax looming over them under the proposed “Digital Asset Mining Energy excise tax,” had been withdrawn from the Fiscal Responsibility Act of 2023. The unexpected reprieve brought ... <a title=\"Crypto miners rejoice as threatening energy tax withdrawn\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-miners-rejoice-as-threatening-energy-tax-withdrawn/\" aria-label=\"More on Crypto miners rejoice as threatening energy tax withdrawn\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T12:38:37.000Z",
    "title": "Binance Australia users in panic selling their coins ",
    "url": "https://crypto.news/binance-australia-users-in-panic-selling-their-coins/",
    "description": "A panic selling frenzy on Binance Australia has sent the price of bitcoin (BTC) on the exchange nearly AUD 9,000 ($5,900) lower than competitors&#8217; prices. Per sources close to the matter, the price of bitcoin has cratered to AUD 34,000&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T12:16:45.000Z",
    "title": "Shiba Inu Price Faces Dilemma As New Addresses Take Conflicting Positions",
    "url": "https://www.newsbtc.com/news/shiba-inu-price-faces-dilemma-as-new-addresses-take-conflicting-positions/",
    "description": "Shiba Inu (SHIB) finds itself amidst a contrasting scenario. Holders of the meme coin and newly emerging addresses are taking conflicting positions, leading to a state of uncertainty. Some long-standing holders remain steadfast in their belief in the token&#8217;s potential, having weathered its volatile journey thus far. On the other hand, fresh addresses, intrigued by the recent buzz surrounding SHIB, bring with them a mix of skepticism and curiosity. This contrasting sentiment within the community creates a dynamic landscape, ripe with possibilities. However, there remains a glimmer of hope as the trust of whales and the potential for wider adoption may play crucial roles in shaping the future of the token. Related Reading: Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score New Addresses Up, Signaling Growing Interest In SHIB The Shiba Inu ecosystem recently witnessed a notable development as the number of new addresses on the SHIB network reached 2,538 on May 26, according to Glassnode. This figure represents the highest influx of new participants or investors into the SHIB ecosystem since February.  Such a surge in new addresses indicates a growing interest in the SHIB token and potentially impacts the market dynamics. Furthermore, it serves as evidence of increased demand for the token within the crypto community. Source: Glassnode Long-Term Shiba Inu Holders Face Challenges While the entry of new participants is a positive sign for the SHIB ecosystem, the same cannot be said for long-term holders of the token. IntoTheBlock data reveals that approximately 78% of SHIB holders currently find themselves in a position of loss.  Source: IntoTheBlock This indicates that the majority of long-term SHIB holders have seen a decline in the value of their investments, which can be disheartening for those who have been holding onto the token for an extended period. Source: Coingecko At present, the price of SHIB stands at $0.00000877, as per CoinGecko. However, recent market movements have caused some fluctuations in its value. Over a span of 24 hours, SHIB experienced a subtle decline of 0.8%, followed by a week-long decline of 3.0%.  SHIB total market cap at $5.07 billion on the daily chart at TradingView.com Long-Term Value In The Meme Coin The current surge in new addresses and sustained interest from Ethereum whales in SHIB reflects a contrasting narrative to its abysmal performance over the past year and in the preceding months.  Despite this historical underperformance, insights from a crypto market analysis platform revealed that a staggering 80% of SHIB holders possess significant amounts of tokens in their portfolios. Additionally, data from WhaleStats demonstrated that SHIB remained the most frequently traded token by Ethereum whales within the past 24 hours. Related Reading: Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot? These findings suggest that despite SHIB&#8217;s lackluster performance, there remains considerable interest and confidence among influential market players, such as Ethereum whales. This sustained interest from these cohorts implies that they view SHIB as a potentially valuable asset to hold in the long term.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) -Featured image from MIT Sloan Management Review"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T12:30:00.000Z",
    "title": "Acclaimed Crypto Researcher Says Bitcoin is “Fools Gold”",
    "url": "https://coinedition.com/acclaimed-crypto-researcher-says-bitcoin-is-fools-gold/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/BTC-is-fools-gold.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Justin Bons, founder and CIO of Cyber Capital, has described Bitcoin as “fools&#8217; gold”. According to Bons, the pioneer cryptocurrency has a broken long-term security model and lacks capacity, programmability, and composability. He further criticized the flagship crypto for having comparatively weak token economics, noting he abandoned BTC in 2017. Bons continued with his BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/acclaimed-crypto-researcher-says-bitcoin-is-fools-gold/\">Acclaimed Crypto Researcher Says Bitcoin is “Fools Gold”</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T12:10:00.000Z",
    "title": "Company Sends $12.9 Million Worth of SAND To Binance Exchange",
    "url": "https://coinedition.com/company-sends-12-9-million-worth-of-sand-to-binance-exchange/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SAND\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Sand-News-comes-with-a-price-analysis.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Analysis platform Lookonchain shared in a Twitter post earlier this morning that the blockchain building company Hashed recently transferred millions of The Sandbox (SAND) tokens to an exchange. According to the post, the company sent a deposit of 23.13 million SAND, equivalent to $12.9 million to Binance. Meanwhile, SAND was worth about $0.5506 at press [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/company-sends-12-9-million-worth-of-sand-to-binance-exchange/\">Company Sends $12.9 Million Worth of SAND To Binance Exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]