[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T13:00:00.000Z",
    "title": "EU ‘Crypto Security’ Debate Turns New MiCA Law on Its Head",
    "url": "https://www.coindesk.com/policy/2023/06/06/eu-crypto-security-debate-turns-new-mica-law-on-its-head/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "An EU study published last week has reopened a debate over whether digital assets should be regulated as securities – though lawmakers appear to favor a tailored approach."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T13:01:10.000Z",
    "title": "Twitch Co-Founder's Fractal Launches Tools to Help Devs Build NFT Games",
    "url": "https://decrypt.co/143528/twitch-co-founder-fractal-launches-tools-help-devs-build-nft-games",
    "description": "Justin Kan's Fractal has created a code-free way for game developers to \"go crypto\"—will it pull Web2 developers into the space?"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T12:41:24.000Z",
    "title": "SEC Sues Coinbase Over Staking Services, Failing to Register",
    "url": "https://decrypt.co/143570/sec-sues-coinbase-over-staking-services-failing-register",
    "description": "The SEC alleges Coinbase should have registered as an exchange, clearing house, and broker and that it sold unregistered securities through its staking service."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T12:52:18.000Z",
    "title": "Grinding out a living: Can blockchain games really offer a sustainable income?",
    "url": "https://cointelegraph.com/news/grinding-out-a-living-can-blockchain-games-really-offer-a-sustainable-income",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a74dd48a-6eeb-4ecd-9dab-31d6f10c1d90.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain gaming executives believe the law has not yet caught up with the concept of earning a living through gaming.  </p>\n                    <p><p>Blockchain games are mostly played for entertainment, but some developers within the industry think the games could eventually evolve into a form of employment where players can grind out a living wage. </p><p>Video games using blockchain tech allow players to earn native crypto or <a href=\"https://cointelegraph.com/news/popular-nft-investments-take-a-massive-hit-in-2023\">nonfungible tokens (NFTs)</a> by playing and participating in activities within the virtual world. Users can then trade or sell their rewards to others and convert them to fiat currency or other crypto, such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). </p><p>Known as <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-gamefi-ecosystem\">GameFi</a> and <a href=\"https://cointelegraph.com/explained/play-to-earn-vs-move-to-earn-explained\">play-to-earn (P2E)</a>, these gaming mechanics have seen some places, like a small <a href=\"https://www.youtube.com/watch?v=Lg5C2EbYueo\" target=\"_blank\" rel=\"noopener nofollow\">community</a> in the Philippines, <a href=\"https://cointelegraph.com/news/gamefi-could-be-the-answer-to-unemployment-for-some-aussie-game-studio\">turn playing blockchain games into employment</a>; however, it’s unclear how existing worker protections and labor laws would apply. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d8d0bc3a-cdb6-4049-b260-bd05a25f98c2.png\"  /></figure><p>Many countries have laws entitling employees to certain rights, such as minimum wages, a safe workplace, compensation, a pension fund and other protections. </p><h2>A whole new unregulated frontier</h2><p>Gip Cutrino, an entrepreneur and chief operating officer of Web3 platform Runiverse, told Cointelegraph that the concept of using blockchain games to grind out a living has already made an impact, especially in countries with lower wages.</p><p>According to Cutrino, because of the relatively new technology, the laws around the concept have not yet been made clear, but he expects regulations will be on the horizon as <a href=\"https://cointelegraph.com/news/casual-gamers-a-critical-audience-for-blockchain-games-gamefi-execs\">more mainstream audiences join the space</a>. </p><p>“We’re building products and creating solutions that haven’t been accounted for by existing laws, which can become particularly complicated when we consider the global and connected nature of blockchain gaming spread across different countries and legal jurisdictions,” Cutrino said. </p><p>“There aren’t global labor laws addressing this specific situation, but we can expect increased regulation as GameFi evolves further,” he added. </p><p><strong><em>Recent: </em></strong><a href=\"https://cointelegraph.com/news/minecraft-gta-may-change-their-tune-on-blockchain-yet-gamefi-execs\"><strong><em>Minecraft, GTA may yet change their tune on blockchain: GameFi execs</em></strong></a></p><p>He notes that, from his perspective, there is more concern around blockchain games and income law implications, specifically how regulators might decide to define this category of income for gamers. </p><p>“Some countries have begun drafting laws that would classify any token invested with an expectation of profit and any project stimulating liquidity pools as securities,” Cutrino said. </p><p>The United States Securities and Exchange Commission has sent shockwaves through the crypto space with <a href=\"https://cointelegraph.com/news/coinbase-could-face-sec-enforcement-action-for-potential-violations-of-securities-law\">multiple enforcement actions</a> against crypto projects and companies over the last few years, <a href=\"https://cointelegraph.com/news/sec-charges-bittrex-with-unregistered-operations-calls-six-tokens-securities\">arguing in many cases</a> that the tokens being used are unregistered securities. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Today Coinbase received a Wells notice from the SEC focused on staking and asset listings. A Wells notice typically precedes an enforcement action.</p>&mdash; Brian Armstrong ️ (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1638654192138199041?ref_src=twsrc%5Etfw\">March 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Arguably the most infamous instance has been the SEC’s long legal <a href=\"https://cointelegraph.com/news/ripple-vs-sec-could-newly-released-documents-tip-the-balance\">war of attrition with Ripple</a> over its <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a> token. </p><p>However, Cutrino still has faith that somewhere down the line, blockchain games will have a part to play in helping people find work. </p><p>“The potential for genuine, impactful employment opportunities in GameFi is massive and only poised to grow from here,” Cutrino said. </p><blockquote>“The real value in terms of employment opportunities in the GameFi space heavily relies on its tokenomics and circulation for it to generate income streams that replace traditional wages while ensuring the sustainability of the game’s growth.”</blockquote><h2>The industry still has a long way to go</h2><p>Speaking to Cointelegraph, Adam Bendjemil, head of business development at <a href=\"https://cointelegraph.com/news/bnb-chain-issues-list-of-191-high-risk-untrustworthy-dapps-and-fake-tokens\">BNB Smart Chain</a>, believes that using blockchain games to earn a wage could be a viable option and business model, provided demand meets supply and workers are well protected. </p><p>“If workers are well-protected, there shouldn’t be too many issues for most countries; earning by playing games full time is already a job for pro players,” Bendjemil said.</p><p>“Game farmers that spend time playing to sell back precious items is also very common but not legal — true ownership through Web3 games will change that into a viable legal job,” Bendjemil added.</p><p><strong><em>Recent: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-tech-still-far-from-hitting-the-esport-big-leagues-says-investor\"><strong><em>Blockchain tech still far from hitting the esport big leagues, says investor</em></strong></a></p><p>Esports, or electronic sports, is a form of organized competition via video games, with some pro players earning millions in prize money. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dd589aab-04b3-4ce2-a1eb-09b62c571442.JPG\"  /><figcaption style=\"text-align: center;\">Many gamers already make a decent living through playing games in the Web2 space. Source: Statista</figcaption></figure><p>According to data gathering platform Statista, The International, an annual Defense of the Ancients (Dota 2) esport tournament, <a href=\"https://www.statista.com/statistics/517940/leading-esports-tournamets-worldwide-by-prize-pool/\" target=\"_blank\" rel=\"noopener nofollow\">offered</a> just under $19 million in prize money last year, but in previous years, it has offered far more, tipping $40 million in 2021. </p><p>Bendjemil said that while he does hope and foresee that making a living through playing Web3 games will become a viable option at some point, he doesn’t think it’s possible to sustainably earn a living playing at the moment. </p><p>He believes that, for it to be viable, it will require a <a href=\"https://cointelegraph.com/news/wef-panel-discusses-the-coming-tokenized-economy\">well-designed token economy</a> that can adapt accordingly to market conditions and the number of regular players, which he says is a significant pitfall to overcome.</p><p>In his opinion, fixing these two issues could help avoid the “brutal pump-and-dumps we have witnessed in the past.”</p><p>“The key aspect of a viable Web3 game economy is likely to be ownership, and the key component of a viable economy is likely to be when people playing long hours to farm precious items will sell it to other players that are willing to pay for it,” Bendjemil said.</p><p>Ultimately, Bendjemil said video games are meant to be fun, and ownership for players is the primary added value with Web3 games rather than earning wages. </p><p><strong><em>Recent: </em></strong><a href=\"https://cointelegraph.com/news/gamefi-investors-should-get-ready-for-a-big-us-crackdown\"><strong><em>GameFi developers could be facing big fines and hard time</em></strong></a></p><p>“It’s likely that it will evolve a lot before we reach a viable, long-term job opportunity,” he said.</p><p>“A lot of Web2 games have been successful in establishing a sustainable economy in their game in the past, and I believe that we will see similar viable models emerging in the near future for Web3,” Bendjemil added. </p><h2>Still too early to know</h2><p>Karl Blomsterwall, CEO of Nibiru Software — the Web3 developer behind the strategy game Planet IX — shared similar sentiments about it being the early days for blockchain games and where they stand legally.</p><p>Blomsterwall told Cointelegraph that the Web3 gaming space is still very much in its infancy, which makes a separation between gaming and labor hard to define.</p><p>“As the adoption increases, and especially if or when users prioritize GameFi over traditional labor, regulations will be adapted to encompass GameFi and play-to-earn,” he said. </p><blockquote>“This is especially true for free-to-play models where users don’t need any significant buy-in to start playing the game.”</blockquote><p>Blomsterwall said blockchain games are already starting to evolve past the initial stages into something that could be more sustainable as an employment opportunity. </p><p><strong><em>Recent: </em></strong><a href=\"https://cointelegraph.com/news/future-of-gamefi-beyond-the-hype-and-toward-accessibility-through-identity\"><strong><em>Future of GameFi: Beyond the hype and toward accessibility through identity</em></strong></a></p><p>However, he noted that this is like everything in the world: The first wave of something new rarely breaks the mold and succeeds. But the <a href=\"https://cointelegraph.com/news/2023-will-see-the-death-of-play-to-earn-gaming\">industry still has a way to go</a> both in terms of regulation and development.</p><p>“You need first-movers, then the key is for projects that come after to learn from previous experiences,” he said. </p><blockquote>“GameFi and its value in terms of potential employment might be a contested topic at the time being, but thinking that it’s not going to evolve and become a very relevant means of employment almost feels like agreeing with the skeptics when Amazon first launched their online book store.”</blockquote><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-06T12:51:15.000Z",
    "title": "BREAKING: Coinbase Faces SEC Lawsuit for Allegedly Violating Securities Laws, Stock Tumbles",
    "url": "https://www.cryptoglobe.com/latest/2023/06/coinbase-faces-sec-lawsuit-for-violating-securities-laws-stock-tumbles/",
    "description": "In a bold move, the U.S. Securities and Exchange Commission (SEC) filed a lawsuit against popular cryptocurrency exchange Coinbase (NASDAQ: COIN) in a New York court, with charges leveled against the firm including operating as an unregistered broker and exchange, with the SEC demanding the company cease these actions permanently. According to CNBC, the price […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T13:00:00.000Z",
    "title": "Unigrid Secures $25M Investment Commitment from GEM Digital, Partners WeSendit, Targets Cloud Giants",
    "url": "https://cryptodaily.co.uk/2023/06/unigrid-secures-25m-investment-commitment-from-gem-digital-partners-wesendit-targets-cloud-giants",
    "description": "<p>Unigrid, a pioneering force in the development of a decentralized and anonymous Internet, is excited to announce a significant milestone, a new strategic partnership, and an ambitious market positioning. Unigrid has recently secured a $25 million investment commitment from GEM Digital Limited. Additionally, Unigrid has partnered with WeSendit, the world's first file transfer service specializing in anonymous data transfer and decentralized storage solutions.</p>\n<p>Unigrid is poised to become a formidable European alternative to dominant providers such as Amazon AWS and Google Cloud. Unigrid's CTO, Adam Waldenberg, emphasizes the transformative power of blockchain technology in guaranteeing the permanence of information, thereby fundamentally reshaping the cloud industry. Businesses will be able to leverage Unigrid to deliver and store data at significantly lower costs compared to traditional cloud providers like Amazon AWS, resulting in substantial savings.</p>\n<p>Unigrid's innovation stems from the underutilized storage capacities found in numerous European data centers. By harnessing their blockchain node technology, Unigrid taps into this vast reservoir, which was previously seen as almost inexhaustible. Their intelligent blockchain application ensures secure data encryption and organization. Unigrid's groundbreaking \"plug-and-switch\" approach allows businesses to effortlessly monetize their available storage capacity, particularly during non-peak hours. This approach not only optimizes the use of idle server capacity but also provides an additional revenue stream for businesses. Customers benefit from cost-effective cloud services, and Unigrid envisions significant growth opportunities ahead. Even with a modest 0.1% market share in the global cloud business, CEO Evan Green envisions a turnover potential in the hundreds of millions.</p>\n<p>The substantial commitment from GEM Digital Limited is a testament to Unigrid's potential and the unwavering dedication of its team. It also signifies a strong vote of confidence from a group with a profound understanding of the digital asset space and a global reach.</p>\n<p>Unigrid's partnership with WeSendit marks a significant stride in its mission to revolutionize the Internet. WeSendit has been offering its file transfer service since 2014 and has since convinced more than 3 million customers, including global brands such as Nike, Facebook, Dreamworks, and Red Bull. The new platform WeSendit 3.0 and its central component, the $WSI token, mark the company&rsquo;s transition from Web2 to Web3. WeSendit&rsquo;s interdisciplinary team is developing a new generation of decentralized data processing tools that will encourage users to explore the benefits of the decentralized Internet. WeSendit's decision to leverage Unigrid's decentralized storage offering for its Web3 storage solution underscores the transformative power of Unigrid's technology.</p>\n<p>This commitment ensures a broad market launch for Unigrid this year, propelling its growth and market development. Unigrid remains open to additional seed commitments and private sales, with strategic guidance and expertise provided by Valuex AG, renowned specialists in strategy and blockchain technology.</p>\n<p>Unigrid is at the forefront of the next Internet revolution, providing a truly decentralized global network that is free from geographical limitations and centralized control. Unigrid's innovative solution is a game-changer in the cloud infrastructure landscape, offering a network that is completely anonymous and resistant to attacks.</p>\n<p>For more information about Unigrid, please visit https://www.unigrid.org/. For more information about GEM Digital Limited, please visit https://www.gemny.com/. For more information about WeSendit, please visit https://linktr.ee/wesendit.</p>\n<p>About Unigrid</p>\n<p>Unigrid is creating a decentralized and anonymous cloud service, free from centralized control and resistant to attacks. Unigrid is committed to delivering a network that changes everything, forever. For more information, visit https://www.unigrid.org/.</p>\n<p>About GEM Digital Limited</p>\n<p>GEM Digital Limited is a digital asset investment firm. Based in The Bahamas, the firm actively sources, structures, and invests in utility tokens listed on over 30 CEXs and DEXs globally. Global Emerging Markets (&ldquo;GEM&rdquo;) is a $3.4 billion alternative investment group with offices in Paris, New York, and the Bahamas. GEM manages a diverse set of investment vehicles focused on emerging markets and has completed over 530 transactions in seventy-two countries. https://www.gemny.com/.</p>\n<p>About WeSendit</p>\n<p>WeSendit is a Swiss file transfer service specializing in anonymous data transfer and decentralized storage solutions. The company has been a successful Web2 file transfer provider for almost 10 years and has now entered the Web3 era. Powered by the $WSI token, the new platform WeSendit 3.0 will help the world transition to the decentralized Internet of the future. For more information, visit https://linktr.ee/wesendit.</p>\n<p>Press Contact</p>\n<p>info@unigrid.org</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p></p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T13:00:00.000Z",
    "title": "Circle to launch USDC Stablecoin on Arbitrum, Tradecurve exchange to implement AI",
    "url": "https://cryptodaily.co.uk/2023/06/circle-to-launch-usdc-stablecoin-on-arbitrum-tradecurve-exchange-to-implement-ai",
    "description": "<p>Prominent stablecoin issuer Circle announced that they would launch USDC natively on top of Arbitrum starting on June 8, 2023, and they will be replacing the abridged version of the stablecoin. A competing project, Tradecurve, will allow users the ability to create AI-powered trading bots with the ability to optimize the performance of their portfolios, leading to better efficiency.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p>Circle to launch USDC Stablecoin on top of Arbitrum</p>\n<p>\"USDC issued by Circle will be native to Arbitrum and will be considered the official version of USDC for the Arbitrum ecosystem. Over time, native USDC liquidity will grow and replace the currently circulating 'bridged USDC' liquidity that comes from Ethereum.\" announced Circle in their statement.&nbsp;</p>\n<p>Arbitrum will be renaming the Ethereum-bridged version of USDC on block explorers, and it will now be known as USDC.e. The firm also announced that there would be an outreach to ecosystem applications that will make the same change within their in-application user interfaces and other documentation.</p>\n<p>Moreover, Circle noted numerous benefits of the native USDC launch on Arbitrum, such as the upcoming support by the Cross-Chain Transfer Protocol (CCTP), which will eliminate bridge withdrawal delays. There will be an upgradable smart contract for any future improvements by the company and the possibility for institutional on and off-ramps, with other perks.&nbsp;</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p>Anyone Can Access AI Trading Bots to Optimize Their Portfolio with Tradecurve</p>\n<p>Circle isn't the only firm that is innovating with the launch of USDC on top of Arbitrum, and competing projects like Tradecurve are also implementing new ideas and innovations that can change DeFi for traders and investors.&nbsp;</p>\n<p>The Tradecurve ecosystem is powered by the TCRV utility token and offers users access to features like automated trading and artificial intelligence. Users can access hundreds of algorithmic and AI trading systems through which they can enhance and optimize the performance of their portfolio.&nbsp;</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p>Alongside that, traders are able to build their own communities, and members can automatically copy their trades through a subscription model. Tradecurve's team will implement Proof of Reserves (PoR) to bolster transparency.&nbsp;</p>\n<p>There's also high leverage starting at 500:1, a VIP account service, a dedicated Trading Academy, and negative balance protection. Users are not required to complete KYC, making it a truly borderless platform accessible from anywhere.</p>\n<p>TCRV is now at Stage 3 of its presale, where one token is worth $0.015. A total of 23,637,981 TCRV tokens have already been sold, and its next price increase will be by 20% at $0.018 at Stage 4. Analysts predict that the price of TCRV can climb by 100x at launch, especially as it will get listed on Tier-1 exchanges and on Uniswap&rsquo;s DEX.</p>\n<p>Learn more about Tradecurve and the TCRV token below:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T12:59:00.000Z",
    "title": "Rosbank Launches Crypto Solution For Cross-Border Settlements",
    "url": "https://cryptodaily.co.uk/2023/06/rosbank-launches-crypto-payment-solution-for-cross-border-settlements",
    "description": "<p>Russia&rsquo;s Rosbank, one of the most important banks in the country, has announced the launch of a crypto payments solution to facilitate cross-border settlements.</p>\n<p>Rosbank has been conducting a pilot for transactions using cryptocurrencies despite being sanctioned by the United States Treasury Department.</p>\nRosbank Makes Its Foray Into Crypto\n<p>According to a representative from Rosbank, the financial institution is now conducting pilot transactions with private and corporate clients. According to Rosbank, the service is the first of its kind in the sector and is compliant with all Russian legislation and the requirements of the Central Bank of Russia (CBR). While the Central Bank of Russia has steadfastly opposed the free circulation of cryptocurrencies within the country, it is far more welcoming to allowing their use in cross-border transactions. However, the central bank has stated that they must be carried out outside of the Russian financial infrastructure.</p>\n<p>The move comes after Rosbank&rsquo;s owner, Vladimir Olegovich Potanin, stated that tokenized assets and a central bank digital currency (CBDC) could play a critical role in driving the country&rsquo;s digital economy.</p>\nRussia&rsquo;s Stance On Crypto\n<p>Russia&rsquo;s law on digital financial assets prohibits residents in Russia from accepting digital currencies as payments for goods and services. However, lawmakers in the State Duma are weighing their options and considering specific amendments. These amendments would allow the expansion of the legal framework and include cryptocurrencies, legalizing crypto transactions under an &ldquo;experimental legal regime.&rdquo;</p>\n<p>However, with Russia under severe pressure thanks to unprecedented Western sanctions following the invasion of Ukraine, the government and businesses in the country have been looking at ways to circumvent the sanctions. One of the options includes increasing the use of cryptocurrencies and national currencies. Officials in Moscow have admitted to several companies using crypto to complete cross-border payments despite a lack of regulation. President Vladimir Putin has also suggested that Russia could become a Bitcoin mining hub. The Russian government also curtailed plans to create a state-run cryptocurrency exchange, opting instead for the regulation of private operators.</p>\nPartnership With B-Crypto\n<p>Rosbank has entered into a partnership with B-crypto to support the new service. B-crypto specializes in processing cross-border transactions and settlements using digital currencies. Whenever a company initiates a cross-border transaction using cryptocurrency, the payment made in crypto to the foreign counterpart must be reflected in the contract. Furthermore, the invoice issued by the supplier must also indicate a wallet address and the amount of crypto that has been sent. Under the partnership, Rosbank will accept fiat deposits, while B-crypto will be responsible for processing the payment and crypto conversion.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T12:43:22.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Falls Below $26,000, as SEC Sues Binance",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-falls-below-26000-as-sec-sues-binance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Falls Below $26,000, as SEC Sues Binance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2226781375.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin plunged to its lowest point in over two months, as markets continue to react to the SEC versus Binance lawsuit. The Securities and Exchange Commission (SEC) is suing the crypto exchange for violation of U.S securities laws. Ethereum was also in the red, dropping below $1,800 in the process. Bitcoin Bitcoin (BTC) sank to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T12:59:51.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T12:42:54.000Z",
    "title": "UK labour party calls for licensing and regulation of AI developers",
    "url": "https://www.cryptopolitan.com/uk-calls-for-regulation-of-ai-developers/",
    "description": "Lucy Powell, a digital spokesperson for the UK Labour Party, has proposed that developers working on artificial intelligence (AI) should be licensed and regulated similarly to industries such as pharmaceuticals, medicine, or nuclear energy. She believes that companies like OpenAI or Google, which have created AI models, should be required to obtain licenses in order ... <a title=\"UK labour party calls for licensing and regulation of AI developers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-calls-for-regulation-of-ai-developers/\" aria-label=\"More on UK labour party calls for licensing and regulation of AI developers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T12:41:26.000Z",
    "title": "Ethereum co-founder’s massive ETH transfer raises questions amid crypto bear market",
    "url": "https://www.cryptopolitan.com/ethereum-co-founders-massive-eth-transfer-raises-questions-amid-crypto-bear-market/",
    "description": "In a surprising turn of events, the crypto community was thrown into speculation as Jeffrey Wilcke, one of the co-founders of Ethereum (ETH), made a substantial transfer of 22,000 ETH to a Kraken address on Monday. The move has sent shockwaves through the industry, with investors questioning the motivations behind such a significant transfer during ... <a title=\"Ethereum co-founder&#8217;s massive ETH transfer raises questions amid crypto bear market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-co-founders-massive-eth-transfer-raises-questions-amid-crypto-bear-market/\" aria-label=\"More on Ethereum co-founder&#8217;s massive ETH transfer raises questions amid crypto bear market\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T13:06:16.000Z",
    "title": "6 Profitable Ways to Make Money with NFTs for Beginners in 2023 – Ultimate Guide",
    "url": "https://www.crypto-news-flash.com/6-profitable-ways-to-make-money-with-nfts-for-beginners-in-2023-ultimate-guide/?utm_source=rss&utm_medium=rss&utm_campaign=6-profitable-ways-to-make-money-with-nfts-for-beginners-in-2023-ultimate-guide",
    "description": "<p>Non-fungible tokens, or NFTs, have swept the globe. The way we think about value and ownership in the digital world is being entirely transformed by these distinctive digital assets. Anyone can now invest in NFTs and possibly gain money thanks to the growth of NFTs. But for beginners, the world of NFTs can be overwhelming. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/6-profitable-ways-to-make-money-with-nfts-for-beginners-in-2023-ultimate-guide/\">6 Profitable Ways to Make Money with NFTs for Beginners in 2023 &#8211; Ultimate Guide</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T13:00:36.000Z",
    "title": "Meme Coins Have Shown High Risk – Dogecoin (DOGE) And Shiba Inu (SHIB) Investors Looking Towards Tradecurve",
    "url": "https://www.crypto-news-flash.com/meme-coins-have-shown-high-risk-dogecoin-doge-and-shiba-inu-shib-investors-looking-towards-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=meme-coins-have-shown-high-risk-dogecoin-doge-and-shiba-inu-shib-investors-looking-towards-tradecurve",
    "description": "<p>If you are looking for massive and stable profits, Tradecurve is a project you must not miss out on. According to experts, presale investors of this project can get 100x profit by the end of 2023 because it has multiple real-world utilities that make it sustainable for long-term growth. Meanwhile, fading mania and increasing risk [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/meme-coins-have-shown-high-risk-dogecoin-doge-and-shiba-inu-shib-investors-looking-towards-tradecurve/\">Meme Coins Have Shown High Risk &#8211; Dogecoin (DOGE) And Shiba Inu (SHIB) Investors Looking Towards Tradecurve</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T12:58:04.000Z",
    "title": "IOTA Declared Non-Security, Transitioning from Quantum-Proof to SEC-Proof – A Bright Future Ahead",
    "url": "https://www.crypto-news-flash.com/iota-declared-non-security-transitioning-from-quantum-proof-to-sec-proof-a-bright-future-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=iota-declared-non-security-transitioning-from-quantum-proof-to-sec-proof-a-bright-future-ahead",
    "description": "<p>The US SEC&#8217;s lawsuit against Binance has named several top altcoins, including Cardano&#8217;s ADA, Solana&#8217;s SOL, Polygon&#8217;s MATIC, Filecoin&#8217;s FIL, and Algorand&#8217;s ALGO, but there was no mention of IOTA&#8217;s native cryptocurrency, MIOTA. The IOTA Foundation has been actively engaging with government institutions, particularly in Europe, to develop frameworks for cryptocurrencies and decentralized finance (DeFi). [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/iota-declared-non-security-transitioning-from-quantum-proof-to-sec-proof-a-bright-future-ahead/\">IOTA Declared Non-Security, Transitioning from Quantum-Proof to SEC-Proof &#8211; A Bright Future Ahead</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T12:52:33.000Z",
    "title": "SOL’s Price May Be at Risk of Gradually Dwindling to Sub $10",
    "url": "https://coinedition.com/sols-price-may-be-at-risk-of-gradually-dwindling-to-sub-10/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Solana_SOL_is_down_50_from_last_year_today_and_95_from_its_year.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The price of the once-trending altcoin Solana (SOL) is down around 50% in a year and 95% from the highs it had reached last year. Furthermore, CoinMarketCap indicated at press time that the altcoin’s price fell victim to the market-wide sell-off over the past 24 hours, resulting in a daily loss of just over 8%. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sols-price-may-be-at-risk-of-gradually-dwindling-to-sub-10/\">SOL’s Price May Be at Risk of Gradually Dwindling to Sub $10</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]