[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T05:14:52.000Z",
    "title": "Coinbase, Robinhood, CFTC to testify in Congress over draft crypto bill",
    "url": "https://cointelegraph.com/news/coinbase-robinhood-cftc-testify-congress-draft-crypto-bill",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7dbac6d3-485c-4f86-95b8-95967622d8c8.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Paul Grewal reiterated that the “U.S. is falling behind” and is at risk of driving jobs, innovation and investment overseas. </p>\n                    <p><p>Coinbase, Robinhood, and representatives from the United States commodities regulator are set to testify before Congress on June 6 to discuss a newly proposed crypto bill. </p><p>The trio will be sharing their firm's, or agency’s views on a proposed bill that could see certain crypto tokens classified as digital commodities, among other things.</p><p>“Tomorrow I have the honor of testifying on Capitol Hill before the House Committee on Agriculture to share Coinbase’s views on the Digital Asset Market Structure Discussion Draft [...] released last week,” said Coinbase Chief Legal Office Paul Grewal in a statement on June 5. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I will be testifying tomorrow in front of the House Committee on Agriculture on the issues related to <a href=\"https://twitter.com/hashtag/digitalcommodityassets?src=hash&amp;ref_src=twsrc%5Etfw\">#digitalcommodityassets</a>. Watch the hearing here: <a href=\"https://t.co/PAKpCuavpr\">https://t.co/PAKpCuavpr</a></p>&mdash; Rostin Behnam (@CFTCbehnam) <a href=\"https://twitter.com/CFTCbehnam/status/1665781056606289920?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other witnesses called to testify include former CFTC chair Chris Giancarlo, former CFTC commissioner Dan Berkvitz and FIAconnect founder Walt Lukken.</p><p>In a June 5 Twitter thread, Grewal gave a rundown of what his own testimony will focus on. </p><p>“The U.S. is falling behind. We cannot afford to ignore crypto while other markets take advantage of our absence, developing rules and regulations that enable the industry to thrive and risk sending jobs, investment, and technological leadership overseas,” Grewal noted adding that: </p><blockquote>“We need a clear rulebook in the US to achieve the full promise of crypto. Until rules and laws are developed that reflect the realities of this new economic system, we cannot realize the full potential of making our financial system faster, fairer, and more affordable.”</blockquote><p>Grewal will also make apparent his support for the proposed crypto bill, which he said is “a strong step forward in providing overdue regulatory clarity.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Tomorrow I will be testifying on Capitol Hill before the House Committee on Agriculture on the need for clear crypto rules and the Digital Asset Market Structure Discussion Draft. Read a summary of my testimony here/below:<a href=\"https://t.co/V4vTo0OT6L\">https://t.co/V4vTo0OT6L</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1665859395358474240?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The <a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\">Digital Asset Market Structure Discussion Draft</a> was <a href=\"https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=408838\" target=\"_blank\" rel=\"noopener nofollow\">released</a> on June 2, and is part of a push from Republican congressmen Patrick McHenry and Glenn Thompson to provide a “statutory framework for digital asset regulation intended to provide clarity, fill regulatory gaps, and foster innovation, while providing adequate consumer protections.”</p><p>Commenting on the draft, Grewal described it as a “thoughtful effort” that represents “a major step forward,” as he called on “lawmakers from both sides of the aisle to work together and act as soon as possible.”</p><blockquote>“In addressing both CFTC and SEC authority, the Discussion Draft builds on existing regulatory frameworks, while also recognizing the unique properties and opportunities of digital assets. It would also provide much-needed Congressional authority and guidance to allow our financial system to evolve.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-derivatives-exchange-set-to-roll-out-btc-and-eth-futures\"><strong><em>Coinbase Derivatives Exchange set to roll out BTC and ETH futures</em></strong></a></p><p>The moves appear to align with <a href=\"https://cointelegraph.com/news/coinbase-continues-effort-to-get-mandamus-for-sec-response-to-rulemaking-petition\">Coinbase’s long-running push</a> for more precise regulatory guidelines for the crypto sector and would come just a day after rival crypto exchange Binance was slapped with 13 charges by the U.S. SEC.</p><p>Cointelegraph reached out to Grewal to see if he will make any comment on the recent action during the hearing, and will update the article if he responds. </p><p>In his testimony summary, he argues that “digital assets do not collectively fit into any single existing regulatory box: some are commodities, some are securities, some are neither, and some simply don’t map onto existing categories.”</p><p>“With more than 20 percent of Americans owning and using crypto, we need  a regulatory framework that will protect consumers and enable the critical uses of this new technology to continue and grow,” Grewal stated.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T05:30:01.000Z",
    "title": "Report: Binance Controlled Bank Accounts Belonging to Its US Affiliate Between 2019 and 2020",
    "url": "https://news.bitcoin.com/report-binance-controlled-bank-accounts-belonging-to-its-us-affiliate-between-2019-and-2020/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Binance Controlled Bank Accounts Belonging to Its US Affiliate Between 2019 and 2020\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/toots.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Between 2019 and 2020, crypto exchange Binance controlled bank accounts belonging to its U.S. affiliate including one holding funds of American clients, a new Reuters report has said. According to the report, employees of the crypto exchange&#8217;s U.S. affiliate had to get Binance executive Guangying Chen to sign off on payments including payroll. Binance U.S. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T05:38:18.000Z",
    "title": "Avalanche Price Analysis & Prediction (June 5th) – AVAX Forms Double-Bottom Pattern Above Two-Week Support, Potential Bullish?",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-june-5th-avax-forms-double-bottom-pattern-above-two-week-support-potential-bullish/",
    "description": "Avax&#8217;s price increased by 2% overnight after failing to sustain negative actions below the previous low. It held as support and formed a double-bottom pattern. A potential bullish reversal is in play. Following the last 24 hours&#8217; gains across the crypto space, Avax appeared to have suspended selling pressure and now gearing up for positive [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T05:14:38.000Z",
    "title": "Could Tradecurve Win Ethereum Classic (ETC) And Bitcoin Cash (BCH) Investors In 2023",
    "url": "https://nulltx.com/could-tradecurve-win-ethereum-classic-etc-and-bitcoin-cash-bch-investors-in-2023/",
    "description": "The launch of Tradecurve’s presale has boosted the confidence of crypto enthusiasts who have long been waiting for the next market bull run. The project has showcased an immense potential for sustained prosperity, and significant market recognition. Therefore, it is considered the most profitable cryptocurrency in 2023, leaving Ethereum Classic (ETC) and Bitcoin Cash (BCH) [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T05:20:52.000Z",
    "title": "Pepecoin Frenzy Fades: How Meme Token’s Price, Market Cap Were Cut In Half",
    "url": "https://www.newsbtc.com/news/pepecoin-frenzy-fades-how-meme-tokens-price-market-cap-were-cut-in-half/",
    "description": "Pepecoin (PEPE), a once-promising meme token, has recently faced a significant setback, witnessing a staggering decline in both its price and market capitalization. The fervent frenzy that once surrounded this meme-inspired digital asset has faded, leaving investors questioning the future of Pepecoin. Pepecoin initially captured the attention of crypto enthusiasts and meme lovers alike, leveraging the popularity of the iconic Pepe the Frog character. Riding the wave of meme-driven mania, the token experienced an exhilarating surge in value, captivating headlines and attracting a considerable influx of investors seeking quick profits.  However, this euphoric ascent was short-lived, and Pepecoin&#8217;s once unstoppable rise abruptly came to a halt. Related Reading: Shiba Inu (SHIB) Poised For Significant Breakout: Here’s What To Watch Out For PEPE Suffers Sharp Decline In Value In a sudden turn of events, Pepecoin (PEPE) has experienced a significant downturn, as evidenced by its price on CoinGecko plummeting to an astonishingly low value of $0.00000102. The token has suffered a substantial 14.4% slump within the past 24 hours, and its decline over the course of the last seven days has been even more alarming, reaching a staggering 28.4%. Source: Coingecko At its peak, Pepecoin boasted a market capitalization exceeding a billion dollars. However, the recent downturn has seen the token&#8217;s market cap dwindle to below $500 million as of press time. This equates to a drastic erosion of over 50% of its value on the price charts. Crypto total market cap weakens to $1.05 trillion on the daily chart at TradingView.com Meme Coin Struggles To Recover: Possible Explanations Pepecoin&#8217;s failure to reach a corrective bounce raises questions about the underlying factors contributing to its downfall. While numerous elements could be at play, one possible explanation lies in the shifting market sentiment towards meme tokens. These tokens, which often gain popularity through viral memes and social media trends, have faced increased scrutiny and skepticism as investors become more discerning about their investment choices. As Pepecoin continues to grapple with its current predicament, market participants are left wondering whether the token can regain its lost value or if its decline will be a turning point for meme tokens as a whole. Related Reading: Bedrock Upgrade: How Optimism Game-Changer Could Impact OP Price SEC Lawsuit Vs. Binance Adds To Pepecoin&#8217;s Woes The already beleaguered Pepecoin faces further challenges as the Securities and Exchange Commission (SEC) sues Binance, sending shockwaves through the cryptocurrency markets. The fallout from the lawsuit has caused a sea of red, with Bitcoin and other major cryptocurrencies experiencing bearish pressure.  Consequently, Pepecoin finds itself caught in the crossfire, as the weakening Bitcoin exerts additional downward pressure on the meme token. This bearish move has amplified the selling pressure on Pepecoin, pushing it to retest its bullish order book (OB) at press time. The bearish sentiment surrounding Bitcoin has cast a shadow on the broader crypto market, including meme tokens like Pepecoin, and raised concerns about the token&#8217;s ability to sustain its value. As Bitcoin&#8217;s weakness persists, Pepecoin remains vulnerable to further selling pressure. Analysts predict that a drop to $0.0000008579 or even lower is feasible if the bearish momentum continues.  -Featured image from PictureCorrect"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T05:17:36.000Z",
    "title": "Gate Wealth Launches Shark Fin Boost, An Investment Product with a Guaranteed APR of 7%",
    "url": "https://coinedition.com/gate-wealth-launches-shark-fin-boost-an-investment-product-with-a-guaranteed-apr-of-7/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PR-36-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PR-36-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PR-36-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PR-36-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/PR-36-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/PR-36-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PR-36.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Gate.io, a leading cryptocurrency exchange, is launching Shark Fin Boost and Shark Fin Plus, two new principal-protected investment products with an APR of up to 14%. These innovative products offer stable and guaranteed returns for BTC, ETH, and USDT investments, making them a safe and accessible option for users. They will be available on Gate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/gate-wealth-launches-shark-fin-boost-an-investment-product-with-a-guaranteed-apr-of-7/\">Gate Wealth Launches Shark Fin Boost, An Investment Product with a Guaranteed APR of 7%</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]