[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T16:35:57.000Z",
    "title": "Popular Twitter AI Bot Suspension Causes BOB Slide By 45% on Sunday; Bobbing Up Today?",
    "url": "https://www.cryptopolitan.com/popular-twitter-ai-bot-suspension-causes-bob-slide-by-45-on-sunday-bobbing-up-today/",
    "description": "Prices of memecoin bob (BOB) slid as much as 45% on Sunday as its popular automated Twitter bot was suspended after the social media giant&#8217;s owner Elon Musk called the account a “scam.&#8221; Twitter also suspended another automated bot called @AskTheWassie, a comic frog that operated similarly to @ExplainThisBob on Sunday. “Promotion of scams under ... <a title=\"Popular Twitter AI Bot Suspension Causes BOB Slide By 45% on Sunday; Bobbing Up Today?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/popular-twitter-ai-bot-suspension-causes-bob-slide-by-45-on-sunday-bobbing-up-today/\" aria-label=\"More on Popular Twitter AI Bot Suspension Causes BOB Slide By 45% on Sunday; Bobbing Up Today?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T16:36:10.000Z",
    "title": "Robinhood’s crypto trading volume falls in May, this hybrid exchange can take over",
    "url": "https://crypto.news/robinhoods-crypto-trading-volume-falls-in-may-this-hybrid-exchange-can-take-over/",
    "description": "Tradecurve, a hybrid exchange, can take over as a dominant crypto trading exchange as Robinhood's trading volumes shrink"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T16:34:03.000Z",
    "title": "Fidelity, Schwab, and Citadel launch new institutional crypto exchange",
    "url": "https://crypto.news/fidelity-schwab-and-citadel-launch-new-institutional-crypto-exchange/",
    "description": "EDX Markets, a crypto exchange with backing from prominent financial entities, including Charles Schwab, Fidelity Digital Assets, and Citadel Securities, has officially commenced trading in four cryptocurrencies."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T16:30:37.000Z",
    "title": "Ethereum Sets Sights On Key Levels As It Rises From Recovery Point",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-sets-sights-on-key-levels-as-it-rises-from-recovery-point/",
    "description": "After a period of correction, the Ethereum price has started to show signs of appreciation on its chart. The altcoin has managed to break past a crucial recovery region, indicating that the bulls are making an attempt to regain control. Over the last 24 hours, Ethereum has experienced a modest 0.2% increase in price. But on the weekly chart, it has successfully reversed most of its previous losses. However, it is important to note that Ethereum is still trading near a vital support line, and another push from the bears can make the altcoin potentially drop below its immediate support level. The volatility of Bitcoin has had a similar impact on most altcoins, causing them to exhibit comparable price movements on their respective charts. Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels While Ethereum is currently showing positive momentum, it is crucial for buying strength to increase in order to sustain the upward trend over the next trading sessions. From a technical perspective, the bears still maintain some control, while the bulls continue to face challenges. Demand and accumulation levels have remained relatively low on the chart. Furthermore, the market capitalization of Ethereum has declined, indicating a decrease in buying strength based on the one-day chart. Ethereum Price Analysis: One-Day Chart At the time of writing, Ethereum (ETH) was trading at $1,730, showing signs of recovery over the past few days. The altcoin remained in proximity to a significant support line at $1,717. On the upside, there was an overhead resistance at $1,770. If buying strength strengthens, Ethereum may aim for the $1,740 level. However, for the bulls to regain control, a move above $1,770 would be beneficial. Conversely, if the current price level experiences a decline, ETH could drop below the $1,717 support and potentially trade around $1,710. Unfortunately, the trading volume of ETH in the last session was in the red, indicating more selling pressure in the market. Technical Analysis Following a visit to the oversold zone, Ethereum has made attempts to reverse the situation. However, the demand for ETH has remained low. The Relative Strength Index (RSI) indicates increased selling strength as it remains below the half-line. Furthermore, the price of ETH has moved below the 20-Simple Moving Average (SMA) line, suggesting that sellers have been driving the price momentum in the market. In line with other technical indicators, Ethereum showed sell signals on the chart. The Moving Average Convergence Divergence (MACD) displayed a red signal, indicating a bearish price momentum. Although, it&#8217;s worth noting that the signals were declining, suggesting a potential turnaround in the price in the upcoming trading sessions. Related Reading: Ethereum Price Indicators Suggest Strengthening Case For More Upsides On the other hand, the Chaikin Money Flow (CMF) indicated a decrease in capital inflows as it remained below the half-line. This decrease in buying interest for ETH may further contribute to the bearish sentiment. Featured Image From Unsplash, Charts From TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-20T16:23:00.000Z",
    "title": "AVAX Price Surges as Bull Reign Prevails: Eyes Set on $12 Resistance?",
    "url": "https://coinedition.com/avax-price-surges-as-bull-reign-prevails-eyes-set-on-12-resistance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/avax6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/avax6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/avax6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/avax6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/avax6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/avax6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/avax6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/avax6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/avax6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/avax6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/avax6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/avax6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/avax6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/avax6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/avax6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/avax6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/avax6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Avalance (AVAX) market bullish momentum has been strong over the previous 24 hours despite negative attempts to lower prices. During this upward price movement for AVAX, the price found support around $11.21 and resistance at $11.57. As of this writing, bullish dominance had pushed the price up 0.70 % from the previous close, valuing it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/avax-price-surges-as-bull-reign-prevails-eyes-set-on-12-resistance/\">AVAX Price Surges as Bull Reign Prevails: Eyes Set on $12 Resistance?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]