[
  {
    "source": "CoinDesk",
    "date": "2024-02-08T22:17:43.000Z",
    "title": "Ether’s Prometheum Test",
    "url": "https://www.coindesk.com/consensus-magazine/2024/02/08/ethers-prometheum-test/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The “only U.S.-registered crypto securities platform\" is listing ETH in a bold test of the U.S. Securities and Exchange Commission's thesis that most cryptocurrencies are securities."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-08T22:10:05.000Z",
    "title": "Welcome to the ‘Bitcoin Era’ on Wall Street",
    "url": "https://www.coindesk.com/consensus-magazine/2024/02/08/welcome-to-the-bitcoin-era-on-wall-street/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With a roster of bitcoin ETFs already trading, companies will need to figure out how to differentiate their products."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-08T22:27:47.000Z",
    "title": "Girl Scout Cookies for Crypto: 7 Things Farcaster Frames Can Do That Twitter Can't",
    "url": "https://decrypt.co/216329/farcaster-frames-7-best-crypto-integrations",
    "description": "Farcaster's immense growth has come after the launch of Frames, enabling a variety of fun and practical integrations. Here are some to check out."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-08T22:30:02.000Z",
    "title": "Bitcoin’s Hashrate Hits Record 609 EH/s, Powering Through to New Peaks Amid Price Surge",
    "url": "https://news.bitcoin.com/bitcoins-hashrate-hits-record-609-eh-s-powering-through-to-new-peaks-amid-price-surge/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin&#039;s Hashrate Hits Record 609 EH/s, Powering Through to New Peaks Amid Price Surge\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bcoinss.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin&#x2019;s computational power soared to unprecedented heights this week, climbing to 609 exahash per second (EH/s) on Thursday, as per the seven-day simple moving average (SMA). Over the last year, figures reveal a staggering increase in Bitcoin&#x2019;s hashrate, surging by 332 quintillion hashes per second. Bitcoin&#x2019;s Computational Power Skyrockets On Feb. 8, 2024, the hashrate [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-08T22:33:57.000Z",
    "title": "Bitcoin Surges Above $45.3K: Insights Into Recent Market Dynamics",
    "url": "https://nulltx.com/bitcoin-surges-above-45-3k-insights-into-recent-market-dynamics/",
    "description": "Bitcoin has surged above $45.3K for the first time since the &#8216;ETF hangover&#8217; retracement began on January 12. 🐳📈 #Bitcoin is back above $44.5K for the first time since the &#39;#ETF hangover&#39; retrace began back on Jan. 12. This bounce is partially attributed to the rise in 1K+ $BTC wallet [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-08T22:26:09.000Z",
    "title": "Solana Network Regains Momentum After Network Outage, Price Continues Upward Movement ",
    "url": "https://nulltx.com/solana-network-regains-momentum-after-network-outage-price-continues-upward-movement/",
    "description": "Solana stands out as one of the few altcoins surpassing Bitcoin&#8217;s performance this week, reclaiming a position above $102 despite Bitcoin&#8217;s 3% surge in value. Notably, $SOL / $BTC has seen a 4.5% increase in the last 36 hours alone.  Earlier this week, on Tuesday, February 6, the Solana blockchain [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T22:30:44.000Z",
    "title": "Ethereum Staking Reaches Historic Milestone As ETH Price Barrels Past $2,400",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-staking-eth-price/",
    "description": "Ethereum staking has been ramping up despite the poor performance of the ETH price over the past year. Liquid staking protocols such as Lido Finance have continued to see the amount of ETH being staked rise, and as a result of this continued interest in staking ETH, the total amount of supply that has been locked so far has reached a new all-time high. 25% Of All ETH Are Now Staked In an interesting turn of events, the total percentage of ETH supply that is being staked has crossed the 25% mark. This was made public by Lido Finance, which shared a screenshot of a Dune Analytics dashboard showing that it has touched the 25% mark. Related Reading: Bitcoin Miner Reserves Drop To June 2021 Levels, What This Means For Price Looking at the Dune Analytics dashboard, it shows that this figure continues to climb following this, with 25.08% of the total ETH supply now staked. This figure is facilitated by a total of 924,023 Ethereum validators that are currently running on the network. Net flows have also gone against expectations and have been positive since the Shanghai upgrade. This upgrade allowed stakers to be able to finally withdraw their staked ETH. But rather than withdrawals happening en masse, more ETH has flowed into staking contracts. Dune’s data shows that over 10 million ETH have flowed into staking contracts since the Shanghai upgrade. Currently, there are over 30.14 million ETH in total staked so far, and this figure seems to be rising fast. Lido Dominates Ethereum Staking Of the total 30.14 million ETH figure that has been staked so far, a large percentage are currently being staked through the Lido platform, as the Dune Analytics platform accounts for 31.52% of all staked ETH. This solidifies Lido’s position as the largest Ethereum staking platform, with over 297,000 validators on the protocol. Coinbase follows behind Lido, accounting for 14.4% of the total ETH staked with more than 136,000 validators. This means that together, Coinbase and Lido Finance currently control 45% of the staked ETH market, giving them a head start over others. Related Reading: Bitcoin Price Jumps Above $44,000, Here Are The Factors Driving It Binance, another crypto exchange, is in third place, with 4.3% of all staked ETH and 41,000 validates. Kiln, Figment, and Rocket Pool control the 4th, 5th, and 6th positions, respectively, controlling between 2.8% and 3.3% of the total staked ETH. Looking at the rewards so far, Ethereum stakers have made quite a lot since the initiative began. The total ETH earned so far by Lido stakers has crossed 467,000 ETH, with 259,000 ETH earned on Coinbase, and 139,000 ETH earned by Binance stakers. The ETH price has also turned bullish during this time, beating the resistance at $2,400. It is up 2.22% in the last day, with 7% gains in the last week, according to data from CoinMarketCap. ETH price at $2,400 &#124; Source: ETHUSD on Tradingview.com Featured image from Dall.E, chart from Tradingview.com"
  }
]