[
  {
    "source": "CoinDesk",
    "date": "2024-02-05T14:00:00.000Z",
    "title": "Web Registry GoDaddy, Ethereum Name Service Connect Domain Names With Crypto Wallets",
    "url": "https://www.coindesk.com/tech/2024/02/05/web-registry-godaddy-ethereum-name-service-connect-domain-names-with-crypto-wallets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The deal will allow users to link their internet domain names to their ENS addresses."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-05T14:00:00.000Z",
    "title": "Hashnote's U.S. Treasuries Token Now Available Through Crypto Custodian Copper",
    "url": "https://www.coindesk.com/tech/2024/02/05/hashnotes-us-treasuries-token-now-available-through-crypto-custodian-copper/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Not all the so-called “on-chain treasuries” in the market are created equal, warns Hashnote CEO Leo Mizuhara."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-05T14:00:00.000Z",
    "title": "Crypto Payments App Oobit Raises $25M in Series A Funding Round Led by Tether",
    "url": "https://www.coindesk.com/business/2024/02/05/crypto-payments-app-oobit-raises-25m-in-series-a-funding-round-led-by-tether/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The round also included participation from Anatoly Yakovenko, the co-founder of Solana."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-05T13:49:58.000Z",
    "title": "Terraform Labs Former CFO Extradited From Montenegro to South Korea",
    "url": "https://decrypt.co/215744/terraform-labs-cfo-extradited-south-korea",
    "description": "Former Terraform Labs CFO Han Chang-joon faces charges in South Korea including fraud that could carry a life sentence."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T14:01:00.000Z",
    "title": " A combination of AI and DeFi could benefit both industries ",
    "url": "https://cointelegraph.com/news/ai-defi-benefits-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYjMyZmVkNGQtMTQ3Ni00ZDM4LThjYzAtYjU0MjdmNWY1OWNkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Combining AI and DeFi could benefit both industries if certain challenges are first overcome.  </p>\n                    <p><p data-ct-non-breakable=\"true\">Artificial intelligence (AI) and decentralized finance (DeFi) have been marketed as technologies that could change the world, and according to experts, combining the two would likely create unparalleled opportunities in both industries.</p><p>DeFi is financial services built on blockchain tech that primarily involves peer-to-peer transactions using smart contracts, removing intermediaries such as banks and giving individuals direct control over financial assets. </p><p>AI, on the other hand, is a technology that can simulate human intelligence and perform tasks such as decision-making, problem-solving and data analysis at high speeds. </p><p><a href=\"https://cointelegraph.com/news/ai-defi-benefits-adoption\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T14:00:00.000Z",
    "title": " OPNX to shut down with mysterious new exchange as replacement ",
    "url": "https://cointelegraph.com/news/opnx-to-shut-down-with-new-exchange-as-replacement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZGZjNWU3NjYtZWJiNS00OTFhLWI3MGItNmM0YmExYjAzNmE1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A new exchange with unknown operators is marketing itself to OPNX users as the old exchange shuts down.</p>\n                    <p><p data-ct-non-breakable=\"true\">Kyle Davies’ and Su Zhu’s Open Exchange (OPNX) will close on Feb. 14, according to an email sent to users on Feb. 1 and seen by Cointelegraph. The firm’s trading will halt on Feb. 7, but withdrawals will remain open until Feb. 14.</p><p>Meanwhile, a mysterious new exchange called OX.Fun appears to have been created to replace OPNX. OX.Fun uses OPNX’s native Open Exchange Token (OX) as collateral for derivatives trading and has been heavily promoted within the official OPNX Telegram channel. However, details on who is running the exchange and their relationship with OPNX remain scarce.</p><p>OPNX <a href=\"https://cointelegraph.com/news/crypto-exchange-backed-by-3ac-founders-launches-with-claims-trading-plans\">was launched in April</a> 2023 by Davies and Zhu, co-founders of the failed cryptocurrency hedge fund Three Arrows Capital (3AC). Mark Lamb and Sudhu Arumugam, co-founders of bankrupt crypto exchange CoinFLEX, were also among OPNX’s creators. It was initially marketed as a reboot of CoinFLEX. However, after the OPNX founders <a href=\"https://cointelegraph.com/news/coin-flex-creditors-unsatisfied-with-restructuring-process-to-opnx\">became embroiled in a legal dispute</a> with CoinFLEX creditors, the OPNX team claimed the two exchanges were entirely separate entities.</p><p><a href=\"https://cointelegraph.com/news/opnx-to-shut-down-with-new-exchange-as-replacement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T14:00:00.000Z",
    "title": " GoDaddy to charge $0 for ENS .eth name pairing ",
    "url": "https://cointelegraph.com/news/godaddy-ens-dns-eth-free-pairing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzAyMDIzMDAtMGE0MS00MDYyLTk2NDUtODQ5ZTU3MDU5NjZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Domain registrars GoDaddy and Ethereum Name Service signed a partnership that will allow users to link Web3-based .eth domains to DNS top-level domains at no cost.</p>\n                    <p><p data-ct-non-breakable=\"true\">A partnership between Ethereum Name Service (ENS) and domain registrar GoDaddy will allow the Web3 community to link their <a href=\"https://cointelegraph.com/explained/the-concept-and-future-of-decentralized-web3-domain-names\">.eth names</a> (domains) to traditional Web2 domains at no extra cost.</p><p>As a decentralized domain name system (DNS), ENS .eth domains allow users to register domain names on Web3, simplifying complex wallet addresses into human-readable names, among other features. With GoDaddy onboard, Web3 users can now link their .eth domains with traditional URLs at no extra cost. </p><p>The GoDaddy-ENS partnership eliminates the barrier of high gas fees that previously demotivated users from bringing domain names over to ENS. Paul Nicks, president of domains at GoDaddy, highlighted the development as “the fusion of domain names and blockchain technologies,” which benefits the Web2 and Web3 ecosystems.</p><p><a href=\"https://cointelegraph.com/news/godaddy-ens-dns-eth-free-pairing\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-05T13:52:28.000Z",
    "title": "Montenegro deports former Terraform Labs CFO to South Korea amid fraud allegations",
    "url": "https://cryptoslate.com/montenegro-deports-former-terraform-labs-cfo-to-south-korea-amid-fraud-allegations/",
    "description": "<p>Montenegro has reportedly deported the former financial officer of Terraform Labs, Han Chang-Joon, back to South Korea to face criminal proceedings. According to reports, law enforcement agencies referred to him as J.C.H. He was &#8220;handed over to the competent judicial and police authorities in South Korea today in order to conduct criminal proceedings for more [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/montenegro-deports-former-terraform-labs-cfo-to-south-korea-amid-fraud-allegations/\">Montenegro deports former Terraform Labs CFO to South Korea amid fraud allegations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-05T14:07:37.000Z",
    "title": "Sui’s Astounding DeFi Growth Continues into 2024 as TVL Breaks the $500M Barrier",
    "url": "https://cryptodaily.co.uk/2024/02/suis-astounding-defi-growth-continues-into-2024-as-tvl-breaks-the-500m-barrier",
    "description": "Sui’s Astounding DeFi Growth Continues into 2024 as TVL Breaks the $500M Barrier"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:09:20.000Z",
    "title": "Floki Inu Price Prediction 2024-2033: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2024-2033 In case you&#8217;re wondering, here&#8217;s a bit of trivia: &#8220;Floki&#8221; means &#8220;heroic Viking,&#8221; and is said to be the name of the Viking who discovered, and named Iceland. In June 2021, Elon Musk tweeted that he would be naming his pet Shiba Inu “Floki.” This led to the birth of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:05:50.000Z",
    "title": "Unveiling the Significance of AI-Based Satellite Technology in Upcoming Webinar",
    "url": "https://www.cryptopolitan.com/ai-satellite-technology-in-upcoming-webinar/",
    "description": "NASHUA, N.H. &#8211; Military + Aerospace Electronics extends a warm invitation to its forthcoming webinar scheduled for February 21, 2024. The focus of this webinar is to explore the pivotal role of artificial intelligence (AI)-based onboard processing in the realm of edge computing satellites. Proudly sponsored by Infineon Technologies, located in El Segundo, Calif., this [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:01:50.000Z",
    "title": "Sui’s Astounding DeFi Growth Continues into 2024 as TVL Breaks the $500M Barrier",
    "url": "https://www.cryptopolitan.com/suis-astounding-defi-growth-continues-into-2024-as-tvl-breaks-the-500m-barrier/",
    "description": "Grand Cayman, Cayman Islands, February 5th, 2024, Chainwire After Sui’s TVL surged more than 1500% over the last five months of 2023, its TVL has more than doubled since the start of 2024 Sui, one of the fastest-growing Layer 1 blockchains, continued its impressive DeFi growth, surpassing $500M in Total Value Locked (TVL) and solidifying [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T13:51:18.000Z",
    "title": "Scammers Exploit Deepfake Technology to Defraud Hong Kong Financial Institution of $25.6 Million",
    "url": "https://www.cryptopolitan.com/scammers-exploit-deepfake-technology/",
    "description": "In a startling incident that sent shockwaves through the financial sector, scammers used deepfake technology to defraud an unnamed Hong Kong-based financial institution of a staggering $25.6 million. Hong Kong police have revealed that the perpetrators employed publicly available video clips of the company&#8217;s executives to create convincing deepfake versions, ultimately deceiving an unsuspecting finance [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T14:00:46.000Z",
    "title": "Ethereum Rally: Crypto Analysts Outline 3 Key Drivers For Price",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-rally-crypto-analysts-outline-3-key-drivers-for-price/",
    "description": "Ethereum (ETH), the second largest cryptocurrency asset, is anticipated by several well-known analysts in the crypto industry to undergo a price surge in the upcoming months as the market is seeing a wave of bullish momentum. Ethereum Poised To Go Parabolic In The Upcoming Months Altcoin Daily crypto analysts have revealed three major factors that could propel the price of Ethereum in the coming months. The analysts shared their optimistic insights for ETH in a recent episode &#8211; &#8220;Ethereum price is still ready to explode&#8221; on YouTube. Related Reading: Ethereum to $20,000: Analyst Sees Spot Ethereum ETFs Fueling Bull Run According to the Altcoin Daily analysts, Ethereum is expected to reach $4,000 in the next three to six months from now. One of the major drivers noted by the analysts to take the price to this level is the impending &#8220;Ethereum Beacon Upgrade.&#8221; In the video, they highlighted that the upgrade is the last big update for ETH, which is scheduled to go live in Q1 of 2024. Its primary goals are to lower transaction fees and improve layer 2 solution efficiency. Additionally, the Ethereum Beacon upgrade promises a refined user experience. This is an important step forward toward creating a blockchain network that is more accessible and scalable. They pointed out that the update&#8217;s final test net is set to take place on Wednesday, February 7. Meanwhile, its overall mainnet roll-out is just one month away from going live. For the second key factor, the experts have identified the hype surrounding the approval of Ethereum Spot Exchange-Traded Funds (ETFs). &#8220;I do want to be clear here the catalyst we are talking about is the anticipation of the ETH spot ETFs,&#8221; one analyst stated. Although Ethereum futures have already garnered global permission, the analysts point out that the approval of the ETFs might signal a significant trigger for Ethereum&#8217;s long-term price growth. Notable Shift From Bitcoin To ETH  According to the experts, the anticipation surrounding its potential approval is expected to drive ETH&#8217;s price to $4,000, akin to the excitement surrounding Bitcoin ETFs in 2023. In addition, they underscored that the BTC ETFs approval is one reason why the US Securities and Exchange Commission (SEC) can not disapprove the ETH ETFs.  Related Reading: Ethereum ETFs Approval Date Set For May 23, Forecasts Suggest ETH Could Reach $4,000 If this is right, then ETH is very close to reaching the aforementioned price level. This is because the final date for ETFs approval is only 112 days from now.  Meanwhile, the last key factor highlighted by Altcoin Daily is the &#8220;Bitcoin rotations after halving towards the rest of the ecosystem.&#8221; After the upcoming Bitcoin halving event, there might be a possible fund rotation from BTC to ETH. Altcoin Daily also mentioned a possible sell-the-news scenario post-halving that could lead to a cooldown. As a result, Ethereum might take advantage of it and become the dominant player in the crypto market. Ethereum is currently trading a little above $2,300, indicating a 1.23% rise in the past 24 hours. Its market cap is demonstrating the same increase, while its trading volume is up by over 41% in the past day. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-05T14:00:37.000Z",
    "title": "Celsius Commences Return of Over $3B to Creditors as it Exits Bankruptcy; Chainlink (LINK) Prepares for a Breakout; InQubeta (QUBE) Becomes Top ICO",
    "url": "https://www.crypto-news-flash.com/celsius-commences-return-of-over-3b-to-creditors-as-it-exits-bankruptcy-chainlink-link-prepares-for-a-breakout-inqubeta-qube-becomes-top-ico/?utm_source=rss&utm_medium=rss&utm_campaign=celsius-commences-return-of-over-3b-to-creditors-as-it-exits-bankruptcy-chainlink-link-prepares-for-a-breakout-inqubeta-qube-becomes-top-ico",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132505.039.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132505.039.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132505.039-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132505.039-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132505.039-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132505.039-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Celsius was one of the major crypto companies to collapse following the implosion of TerraUSD, Terraform Lab’s stablecoin. It paused withdrawal and filed for Chapter 11 bankruptcy in July 2022, with the native token, CEL, experiencing a big drop. In exciting news—to creditors—the crypto lender announced its exit from Chapter 11 bankruptcy in the United [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-05T14:05:00.000Z",
    "title": "Can Bitcoin Weather the Storm? China’s Economic Woes Put Crypto to Test",
    "url": "https://coinedition.com/can-bitcoin-weather-the-storm-chinas-economic-woes-put-crypto-to-test/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/btc3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Can Bitcoin Weather the Storm? China’s Economic Woes Put Crypto to Test\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/btc3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/btc3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/btc3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/btc3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/btc3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/btc3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/btc3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/btc3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/btc3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/btc3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/btc3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/btc3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/btc3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/btc3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/btc3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/btc3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>China&#8217;s financial indices plunged, with 30% of stocks reportedly suspended. The severity of the situation triggers speculation about its impact on crypto markets. Adam Cochran attributes China’s woes to its longstanding strategy of constructing empty urban facades. News of China&#8217;s economic turmoil has sparked speculation about its potential impact on the cryptocurrency markets. Adam Cochran, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/can-bitcoin-weather-the-storm-chinas-economic-woes-put-crypto-to-test/\">Can Bitcoin Weather the Storm? China’s Economic Woes Put Crypto to Test</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-05T14:01:10.000Z",
    "title": "Sui’s Astounding DeFi Growth Continues into 2024 as TVL Breaks the $500M Barrier",
    "url": "https://coinedition.com/suis-astounding-defi-growth-continues-into-2024-as-tvl-breaks-the-500m-barrier/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/02/TVL_500m_1200x700_1707140067KWjI6chEmT-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Grand Cayman, Cayman Islands, February 5th, 2024, Chainwire After Sui’s TVL surged more than 1500% over the last five months of 2023, its TVL has more than doubled since the start of 2024 Sui, one of the fastest-growing Layer 1 blockchains, continued its impressive DeFi growth, surpassing $500M in Total Value Locked (TVL) and solidifying [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/suis-astounding-defi-growth-continues-into-2024-as-tvl-breaks-the-500m-barrier/\">Sui’s Astounding DeFi Growth Continues into 2024 as TVL Breaks the $500M Barrier</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]