[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:34:09.000Z",
    "title": "Ether.fi unveiling ETHFI: A New Era in Decentralized Governance",
    "url": "https://www.cryptopolitan.com/ether-fi-ethfi-decentralized-governance/",
    "description": "The digital finance landscape is on the brink of a transformation with the introduction of ETHFI, the governance token by ether.fi. This development marks a significant milestone in the journey towards a more decentralized and user-empowered ecosystem. Let&#8217;s delve into the details of this exciting announcement, the mechanics of the airdrop, and the profound implications [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:29:41.000Z",
    "title": "The global economy has a brand new threat",
    "url": "https://www.cryptopolitan.com/the-global-economy-has-a-brand-new-threat/",
    "description": "The world is dancing on the edge of a financial knife. It&#8217;s not just the big dogs in the U.S. with their wallets bulging near to bursting &#8211; this is a worldwide phenomenon. Big companies across the globe are raking in profits like they&#8217;re going out of style. Thanks to a little birdie at JPMorgan, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:23:50.000Z",
    "title": "U.S. wants to keep Sam Bankman-Fried in jail until he is 80",
    "url": "https://www.cryptopolitan.com/us-to-keep-bankman-fried-jail-until-hes-80/",
    "description": "The United States government has its sights set on making sure Sam Bankman-Fried, the once-celebrated CEO of the now-defunct crypto empire FTX, might only taste freedom again when he&#8217;s pushing 80. That&#8217;s if he&#8217;s lucky. In a move that&#8217;s about as subtle as a sledgehammer to the kneecaps, prosecutors are gunning for a 40-50 year [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:20:26.000Z",
    "title": "What Does OpenAI’s Move Mean for the AI Hardware Industry?",
    "url": "https://www.cryptopolitan.com/openais-move-mean-for-ai-hardware-industry/",
    "description": "In a bold move that could potentially reshape the landscape of AI hardware, OpenAI has initiated discussions to develop its own line of AI processors. This strategic maneuver seeks to reduce dependency on existing hardware providers, particularly Nvidia, which currently holds a dominant position in the market. As the artificial intelligence industry continues to evolve [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:17:31.000Z",
    "title": "Marathon Digital buys 200MW Bitcoin mining hub for $87m",
    "url": "https://www.cryptopolitan.com/marathon-digital-200mw-bitcoin-mining-hub/",
    "description": "Marathon Digital Holdings, stepping up its game in a big way, has shelled out a cool $87.3 million in cash for a Texas-based Bitcoin mining powerhouse with a capacity of 200 megawatts. Yep, you read that right. They&#8217;re not playing around, paying straight from their deep pockets, waiting for no man (or price adjustment) to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:13:04.000Z",
    "title": "Paris Hilton’s metaverse generates $60m in media adverts",
    "url": "https://www.cryptopolitan.com/paris-hilton-metaverse-60m-in-media-adverts/",
    "description": "Boom, just like that, media dynamo Paris Hilton has set the digital world on fire again, but this time, she&#8217;s cashing in big time without the usual billboard or TV spot. Hilton&#8217;s recent venture into Roblox with her &#8220;Slivingland&#8221; experience has pulled in a staggering equivalent of $60 million in traditional ad bucks. That&#8217;s right, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-17T02:09:33.000Z",
    "title": "Bitcoin Fog’s legacy becomes a faint memory",
    "url": "https://www.cryptopolitan.com/bitcoin-fogs-legacy-becomes-a-faint-memory/",
    "description": "If you&#8217;ve been paying attention, you&#8217;ll know that Bitcoin has been basking in the limelight, smashing records with an all-time high of $73,803. Following closely, the U.S. warmly welcomed a shiny new fleet of spot Bitcoin exchange-traded funds, with the heavyweight BlackRock leading the charge. This extravaganza pulled in more than a cool $10 billion, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-17T02:23:27.000Z",
    "title": "Bitcoin Crashes: Dip To $65,000 Triggers Over $400 Million Liquidation Avalanche",
    "url": "https://www.newsbtc.com/news/bitcoin-crashes-dip-to-65000-triggers-over-400-million-liquidation-avalanche/",
    "description": "In a tumultuous turn of events, the cryptocurrency market has been rattled by a sharp decline in Bitcoin prices. After a sustained period of remarkable gains and record highs, Bitcoin has plunged to a weekly low of $65,000, marking a significant setback for investors. At the time of writing, Bitcoin numbers were all painted in red, and trading at $65,710, losing value in the 24-hour and weekly timeframes by 5.6% and 4.5%, respectively, according to data from Coingecko. A few days after its previous low of $68,000, Bitcoin plummeted to its present level, a figure not seen in a week, as bears persisted in their downward pressure. Related Reading: Bitcoin Miners Brace For Impact As Difficulty Reaches Unprecedented Levels Bitcoin plunging in the last 24 hours. Source: Coingecko. Altcoins Also Take A Beating While Bitcoin bears the brunt of the downturn, altcoins are not spared from the fallout. Ethereum (ETH) and Binance Coin (BNB) have also witnessed substantial losses, shedding 10% of their value or more. Dogecoin and Shiba Inu, two popular meme coins, have experienced even steeper declines, plunging by 20% and nearly 30%, respectively. The broader altcoin market mirrors Bitcoin&#8217;s downward trajectory, amplifying the sense of unease among investors. BTC market cap currently at $1.29 trillion. Chart: TradingView.com Bitcoin: Impact On Market Dynamics The recent price correction in Bitcoin has reverberated across the cryptocurrency landscape, reshaping market dynamics and investor sentiment. The surge in liquidations, with over 151,000 traders facing margin calls in the past 24 hours, underscores the magnitude of the market upheaval. Bitcoin&#8217;s dominance in the market is evident as it accounts for the lion&#8217;s share of the total liquidations, highlighting its pivotal role in shaping overall market trends. As a result of the decline in value, the total market liquidations have reached $426 million, with Bitcoin taking the worst hit. Liquidation Spree The amount that the price of Bitcoin has liquidated over the last 24 hours has exceeded $104 million, with long traders losing the most money—they lost $86 million compared to $18 million for short sellers. Ethereum saw a $48 million overall liquidation, with $33 million going to long traders and $15 million going to short traders, as a result of the losing run. Analyst Sounds Alarm Siren Meanwhile, market analysts such as Markus Thielen, CEO of 10x Research, have sounded the alarm bells, warning of further downside risks for Bitcoin. Thielen&#8217;s prediction of a potential drop to $63,000 sends a sobering message to investors, urging caution and prudence in navigating the current market environment. His insights shed light on underlying concerns about Bitcoin&#8217;s market structure, including low trading volumes and liquidity, which exacerbate the risk of sharp price corrections. Amidst the market turbulence, investors are grappling with the implications of Thielen&#8217;s analysis and adjusting their strategies accordingly. The era of meme coin mania appears to be waning, prompting investors to reassess their positions and secure profits while they still can. Related Reading: Crypto Carnage: Over $800 Million Wiped Out In Market Plunge Featured image from Kinesis Money, chart from TradingView"
  }
]