[
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T14:20:45.000Z",
    "title": "BTS: Revisiting the ‘buy $1 worth of Bitcoin’ video 10 years later",
    "url": "https://cointelegraph.com/news/story-behind-buy-1-worth-of-bitcoin-video-10-years-later",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/50128274-7589-43c1-99c5-f9fd89ff48f7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Davinci Jeremie believes that while many people missed out on the opportunity to buy Bitcoin 10 years ago, it’s not too late to get into crypto. </p>\n                    <p><p>While crypto advocate Davinci Jeremie expected to become a hero to his community after talking about Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and why they should buy at least $1 worth of it 10 years ago, things did not turn out as he expected. </p><p>In an interview with Cointelegraph, Jeremie shared the story of how he found Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), what his community thought about it back then, and what he thinks would help onboard more people into Bitcoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e270c6fd-c2a2-44c7-bed8-69da85befd95.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto influencer Davinci Jeremie in a call with Cointelegraph reporter Ezra Reguerra. Source: Cointelegraph</em></figcaption></figure><p>According to the crypto influencer, it all started over 10 years ago, when a member of his community told him about BTC and asked him to have a look at it. At first glance, Jeremie, who is also a software developer, believed that it was a scam since the double spending problem was “considered to be not solvable.” He explained: </p><blockquote>“I said: ‘Okay, I'm gonna read the source code since I'm a software developer, and tell you how it's a big scam.’ Read the source code, read the white paper and realized: Oh, no. This is not a scam.”</blockquote><p>After learning about it and realizing that BTC may be the solution to a huge problem in the monetary system, he <a href=\"https://www.youtube.com/watch?v=Cw29h7LhEuE\" target=\"_blank\" rel=\"noopener nofollow\">made</a> the trending video, asking his community to purchase at least $1 worth of BTC. However, his expectations were a bit different from what happened. While he expected his community to be grateful for the information he shared, they did not respond the way he thought they would.</p><p>“Once in a while, something comes along that makes poor people rich because they got it really really cheap. This was one of them. I thought I was gonna be the hero to my community, but no, they thought I was crazy. They actually thought I was losing my mind,” he said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rising-institutional-interest-is-a-bullish-sign-for-crypto-seba-bank-exec\"><strong><em>Rising institutional interest is a ‘bullish’ sign for crypto: SEBA Bank exec</em></strong></a></p><p>While people missed out a lot on that opportunity to buy BTC at that price, Jeremie believes that it’s not too late to get into crypto. According to the influencer, only 2% of the population currently hold Bitcoin and Ether (ETH). However, the problem is that people want to have the whole thing. He explained: </p><blockquote>“Everybody wants to have a whole Bitcoin. Nobody wants to go into a store and say: ‘Can I get 1/100,000,000th of an apple?’ They want the whole thing. So, although Bitcoin is divisible, the visibility is part of its Achilles heel.” </blockquote><p>The developer suggested that it may be optimal to have a Satoshi-based Bitcoin wallet that shows the balances differently. The software developer believes that showing people that “for a whole dollar you could get a few 100,000 Bitcoin Satoshis” could potentially attract more people. “It’s not as appealing to have that decimal spaces than a whole Bitcoin,” he added. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T14:23:46.000Z",
    "title": "Algorand partners with DWF Labs in $50M deal",
    "url": "https://cryptoslate.com/algorand-partners-with-dwf-labs-in-50m-deal/",
    "description": "<p>Algorand (ALGO) and web3 investment firm DWF Labs have teamed up in a $50 million deal, per Chainwire. The partnership aims to help support and grow the blockchain through liquidity provision and project development funding, particularly those related to DeFi, art and music, gaming, oracles and bridges, and infrastructure. DWF Labs invited parties interested in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/algorand-partners-with-dwf-labs-in-50m-deal/\">Algorand partners with DWF Labs in $50M deal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T14:30:00.000Z",
    "title": "Ethereum Rival Polkadot Updates Governance System, This New Hybrid Exchange To Introduce AI",
    "url": "https://cryptodaily.co.uk/2023/06/ethereum-rival-polkadot-updates-governance-system-this-new-hybrid-exchange-to-introduce-ai",
    "description": "<p class=\"s5\">Polkadot (DOT), one of Ethereum&rsquo;s biggest rivals, has announced an update to its governance system, removing the voting group formerly referred to as &lsquo;First Class Citizen&rsquo; from the network. As artificial intelligence (AI) becomes a part of our everyday lives, Tradecurve, a new hybrid exchange will become the first crypto trading platform to integrate the technology into its system allowing for AI-assisted trading.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n▪ Polkadot (DOT) has entered into a new era after a major update to its governance system\n▪ The update has made the Polkadot network more decentralized by eliminating &lsquo;First Class Citizen&rsquo; groups\n▪ A new hybrid exchange, Tradecurve (TCRV) will integrate AI into its trading platform to allow for AI-assisted trading.\nPolkadot Makes Update to its Governance System\n<p class=\"s5\">Polkadot (DOT), a major Ethereum challenger, has announced a major update to its governance system to take the network into a new era of decentralization. As part of the network update, Polkadot launched OpenGov to give the Polkadot community full control of the network by allowing holders of the DOT token to vote and propose referenda to make changes to the network.</p>\n<p class=\"s5\">Polkadot hopes to transform its network into a fully autonomous, transparent, &amp; efficient decision-making network by giving users equal rights to vote. As a result, OpenGov has removed the so-called first-class voters like the Polkadot Council and the Technical Committee from the voting. Now, the amount of DOT tokens a holder has determines their voting strength.</p>\n<p class=\"s5\">In addition, this new governance infrastructure will allow for multiple governance proposals to be simultaneously voted on by the Polkadot community. With OpenGove in place, Polkadot has been transformed into a fully decentralized Web 3 project where all the governance processes are directly controlled by its community members.</p>\n<p></p>\nTradecurve to Integrate AI Support Into Its Hybrid Exchange\n<p class=\"s5\">Since the launch of OpenAI&rsquo;s ChatGPT in November 2022, many projects have been exploring the potential of artificial intelligence (AI) in the cryptocurrency and blockchain space.</p>\n<p class=\"s5\">Tradecurve is a new hybrid exchange that is building the first crypto-exchange platform with AI integration to support algorithmic or automated trading.</p>\n<p class=\"s5\">With the inclusion of AI-assisted trading, Tradecurve users will be able to leverage the advanced mathematical models of the platform to make trading decisions. The AI trading feature of the platform will support several variables, including price, timing, and volume, for users to place trades automatically.</p>\n<p class=\"s5\">To add to AI trading, Tradecurve will also support copy trading. With this feature, traders can directly copy the trading positions of other more successful traders on Tradecurve.</p>\n<p class=\"s5\">As a hybrid exchange, Tradecurve combines the best features known to centralized exchanges (CEXs) and decentralized exchanges (DEXs) to create a well-rounded platform. Tradecurve is currently in the fourth stage of its presale, where its native utility token currently retails for $0.018 apiece, but is expected to rise by up to 40% in the upcoming week.</p>\n<p class=\"s14\">Visit the links below to get more information about Tradecurve and the TCRV token:</p>\n<p>Click Here For the Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-26T14:30:28.000Z",
    "title": "Dormant Bitcoin Wallets From 2010 Resurface: 100 Bitcoins Transferred After More Than 12 Years",
    "url": "https://news.bitcoin.com/dormant-bitcoin-wallets-from-2010-resurface-100-bitcoins-transferred-after-more-than-12-years/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Dormant Bitcoin Wallets From 2010 Resurface: 100 Bitcoins Transferred After More Than 12 Years\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/201010102010.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the spending of 50 bitcoins from 2010 on June 15, after more than 12 years of dormancy, approximately 11 days later, another group of dormant wallets created in 2010 transferred 100 bitcoins worth just over $3 million for the first time in well over a decade. 2023 Records 8 Block Rewards From 2010 Spent, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T14:36:23.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T14:31:19.000Z",
    "title": "ProShares records the large inflows amid ETF fever",
    "url": "https://www.cryptopolitan.com/proshares-record-large-inflow-amid-etf-fever/",
    "description": "In recent developments, the excitement surrounding Bitcoin exchange-traded funds (ETFs) has resurfaced, accompanied by a wave of new applications and increased capital inflows from institutional investors. Notably, the ProShares Bitcoin Strategy ETF (BITO), a Bitcoin futures fund, witnessed a surge of inflows on June 26, attracting significant attention from Bloomberg senior ETF analyst Eric Balchunas. ... <a title=\"ProShares records the large inflows amid ETF fever\" class=\"read-more\" href=\"https://www.cryptopolitan.com/proshares-record-large-inflow-amid-etf-fever/\" aria-label=\"More on ProShares records the large inflows amid ETF fever\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T14:17:40.000Z",
    "title": "American banks face $9b dilemma with China’s mega IPO",
    "url": "https://www.cryptopolitan.com/american-banks-face-9b-dilemma-china-ipo/",
    "description": "In an era of mounting geopolitical tension, American banks find themselves entwined in a $9 billion conundrum connected to Syngenta&#8217;s imminent initial public offering (IPO) in China. This record-breaking Shanghai IPO, once seen as a golden ticket for institutions like Goldman Sachs and JPMorgan, has now turned into an intricate puzzle, with geopolitical complexities threatening ... <a title=\"American banks face $9b dilemma with China&#8217;s mega IPO\" class=\"read-more\" href=\"https://www.cryptopolitan.com/american-banks-face-9b-dilemma-china-ipo/\" aria-label=\"More on American banks face $9b dilemma with China&#8217;s mega IPO\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T14:10:22.000Z",
    "title": "BlackRock’s Bitcoin ETF hype cools amid rate hike fears",
    "url": "https://www.cryptopolitan.com/blackrock-bitcoin-etf-hype-rate-hike-fears/",
    "description": "BlackRock&#8217;s ambitious plans to launch a Bitcoin Exchange Traded Fund (ETF) fueled an impressive resurgence of Bitcoin&#8217;s value, pushing the premier cryptocurrency past the $30,000 mark for the first time since April. However, amidst an uncertain economic climate punctuated by concerns over potential rate hikes and intensified regulatory scrutiny, BlackRock&#8217;s Bitcoin ETF hype seems to ... <a title=\"BlackRock&#8217;s Bitcoin ETF hype cools amid rate hike fears\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-bitcoin-etf-hype-rate-hike-fears/\" aria-label=\"More on BlackRock&#8217;s Bitcoin ETF hype cools amid rate hike fears\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T14:30:15.000Z",
    "title": "Binance Rescinds Decision To Remove Privacy Coins From European Market",
    "url": "https://www.newsbtc.com/binance/binance-rescinds-decision-to-remove-privacy-coins-from-european-market/",
    "description": "Binance has made a decision to reverse its initial plan of delisting certain privacy coins in Europe. This change in course comes after the exchange revised its operations to align with the local regulatory requirements. According to the developers of Verge (XVG) and Secret (SCRT) cryptocurrencies, a significant outcome was achieved. Seven privacy-focused tokens were stopped from being de-listed. These tokens, which were at risk of being removed from the listings, have been successfully retained. A comment received from the cryptocurrency exchange on June 26 states: After carefully considering feedback from our community and several projects, we have revised how we classify privacy coins on our platform to comply with EU-wide regulatory requirements. The crypto exchange also mentioned that due to its status as a registered exchange in multiple European Union jurisdictions, it is obligated to comply with local regulations. These regulations mandate that exchanges have the capability to monitor transactions involving the coins listed on their platform. In May, Binance communicated via email to its customers in France, Italy, Spain, and Poland regarding changes to its services. The message outlined the discontinuation of trading services for 12 cryptocurrencies known for enabling anonymous transactions. Related Reading: Avalanche (AVAX) Rumbles With 18% Gain – Is A Trend Reversal On The Horizon? Prominent privacy coins such as Monero, Dash, and Zcash were among those affected. Additionally, lesser-known tokens like XVG and SCRT were also scheduled for delisting from the exchange&#8217;s offerings. Following the retraction of the decision to delist privacy-focused tokens, several projects have utilized Twitter as a platform to provide reassurance to their community members. Binance Complies As EU Sets Standards For Digital Assets The decision to delist privacy-focused tokens came as a response to the European Union&#8217;s implementation of the Markets in Crypto Assets (MiCA) regulation. This regulation includes the &#8220;travel rule&#8221; for crypto transactions, which requires enhanced transparency and information sharing. Consequently, there is a potential risk for firms facilitating the trading of privacy coins to be non-compliant with EU law. EU policymakers have established clear regulations with the goal of positioning Europe as a leading hub for cryptocurrencies and digital assets. In July, the European Securities and Markets Authority (ESMA) is set to initiate a consultation process for MiCA. These laws have an implementation timeline of 18 months to ensure full compliance and effective implementation of the regulatory framework. Cryptocurrency companies, including Ripple, have expressed their appreciation for the regulatory clarity provided by the MiCA (Markets in Crypto Assets) regulations. Binance&#8217;s decision to cease support for privacy coins dealt a major blow to advocates of these cryptocurrencies in Europe. Earlier, leading exchanges such as Kraken, Huobi, and Bittrex had already delisted popular privacy coins like Monero and Dash. Related Reading: MATIC Price Recovery Hits Roadblock, When Will Bulls Break Through? In other jurisdictions such as Dubai, Japan, and South Korea, authorities have taken a firm stance regarding anonymity-enhancing cryptocurrencies. These governments have adopted a clear-cut approach by implementing strict measures to crack down on these privacy coins. Outright bans have been imposed in some cases where there has been an explicit prohibition of the trading and issuance of privacy coins. Featured image from UnSplash, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T14:35:17.000Z",
    "title": "Emerging Strong: Golteum (GLTM) Poised To Rise Among Crypto Titans Solana (SOL) and Near Protocol (NEAR)",
    "url": "https://www.crypto-news-flash.com/emerging-strong-golteum-gltm-poised-to-rise-among-crypto-titans-solana-sol-and-near-protocol-near/?utm_source=rss&utm_medium=rss&utm_campaign=emerging-strong-golteum-gltm-poised-to-rise-among-crypto-titans-solana-sol-and-near-protocol-near",
    "description": "Golteum (GLTM), an innovative multi-assets Web3 platform that offers precious metals-backed NFTs, is positioned to soar alongside established cryptocurrency heavyweights such as Solana (SOL) and Near Protocol (NEAR). As Golteum expands its vision to revolutionize the precious metals industry through Web3 accessibility and asset-backed NFTs, it aims to cement its place among the top players [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T14:34:54.000Z",
    "title": "Terra Luna Classic (LUNC) Engineers Unleash ‘Six Samurai’ Proposal for Ecosystem Revival – Can it Drive Price to $1? Report",
    "url": "https://www.crypto-news-flash.com/terra-luna-classic-lunc-engineers-unleash-six-samurai-proposal-for-ecosystem-revival-can-it-drive-price-to-1-report/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-classic-lunc-engineers-unleash-six-samurai-proposal-for-ecosystem-revival-can-it-drive-price-to-1-report",
    "description": "Chosen from the Terra LUNC community, the &#8220;samurai six&#8221; team is intended to help the Terra blockchain achieve significant milestones in the coming quarters. The proposal highlights that the team of developers will focus on establishing a USTC Testnet that recently passed community governance. The full-blown adoption of Terra Luna Classic (LUNC) is highly pegged [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T14:30:56.000Z",
    "title": "Bakkt Delists Solana, This Hybrid Exchange Will Allow Users To Trade A Large Range Of Assets",
    "url": "https://www.crypto-news-flash.com/bakkt-delists-solana-this-hybrid-exchange-will-allow-users-to-trade-a-large-range-of-assets/?utm_source=rss&utm_medium=rss&utm_campaign=bakkt-delists-solana-this-hybrid-exchange-will-allow-users-to-trade-a-large-range-of-assets",
    "description": "In response to the U.S. Securities and Exchange Commission&#8217;s (SEC) recent deeming of Solana (SOL) as a security, Bakkt, the one-stop solution to crypto, has delisted the token from its trading platform. Meanwhile, Tradecurve, a new hybrid exchange will allow users to trade Solana along with a variety of financial instruments not found on Bakkt [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T14:23:00.000Z",
    "title": "AAVE Dips from 30-Day High as Whale Transaction Sparks Concern",
    "url": "https://coinedition.com/aave-dips-from-30-day-high-as-whale-transaction-sparks-concern/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/aave-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/aave-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/aave-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency industry is buzzing with the news of a massive AAVE whale completing a $2.46 million transaction. The renowned whale, &#8220;0x5a80,&#8221; recently sent shockwaves across the market by moving 38,000 AAVE tokens out. This whale, which has amassed a whopping $17.2 million in AAVE during the last 24 hours, now has a $31.8 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/aave-dips-from-30-day-high-as-whale-transaction-sparks-concern/\">AAVE Dips from 30-Day High as Whale Transaction Sparks Concern</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T14:30:14.000Z",
    "title": "Benjamin Cowen Warns of Major Bitcoin Fakeout As BTC Flies Past $30,000 Level – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/06/26/benjamin-cowen-warns-of-major-bitcoin-fakeout-as-btc-flies-past-30000-level-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Bottom.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Benjamin Cowen is warning that the odds are majorly in favor of Bitcoin (BTC) and crypto markets going for another leg down before new highs. In a new strategy session, Cowen argues that the recent bounce in Bitcoin was most likely due to capital shifting from altcoins and into the safer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/benjamin-cowen-warns-of-major-bitcoin-fakeout-as-btc-flies-past-30000-level-heres-his-outlook/\">Benjamin Cowen Warns of Major Bitcoin Fakeout As BTC Flies Past $30,000 Level – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]