[
  {
    "source": "CoinDesk",
    "date": "2023-10-17T10:00:00.000Z",
    "title": "SBF Trial: FTX Exec Felt ‘Suicidal’ in Crypto Exchange’s Final Days",
    "url": "https://www.coindesk.com/policy/2023/10/17/sbf-trial-ftx-exec-felt-suicidal-in-crypto-exchanges-final-days/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Nishad Singh told a jury on Monday that his September meeting with Bankman-Fired was the first time he realized that Alameda, FTX’s sister trading firm, had spent billions of dollars of FTX user deposits, and had left a gaping hole in both companies’ balance sheets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-17T10:00:00.000Z",
    "title": "EU Regulator Warns of ‘Opaque’ Crypto Firms as It Seeks to Close MiCA Loopholes",
    "url": "https://www.coindesk.com/policy/2023/10/17/eu-regulator-warns-of-opaque-crypto-firms-as-it-seeks-to-close-mica-loopholes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The European Securities and Markets Authority doesn’t want foreign companies operating via EU “letterbox” entities"
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-17T10:00:00.000Z",
    "title": "Protocol Village: Taurus to Integrate Elliptic's Wallet Screening Tool",
    "url": "https://www.coindesk.com/tech/2023/10/16/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 16-22, with live updates throughout."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T10:06:35.000Z",
    "title": "Coinbase suspends 80 non-USD trading pairs to improve liquidity",
    "url": "https://cointelegraph.com/news/coinbase-suspends-80-trading-pairs-improve-liquidity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7bd684ba-c2c9-4530-a18a-7465ddd9935e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coinbase crypto exchange has been removing dozens of trading pairs in an effort to improve liquidity on its platforms.</p>\n                    <p><p>The United States-based cryptocurrency exchange Coinbase is removing dozens of trading pairs in order to improve liquidity on its platform.</p><p>Coinbase has suspended 80 non-USD trading pairs including the pairs with cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and fiat currencies like the euro.</p><p>Announcing the news on Oct. 16, Coinbase <a href=\"https://status.exchange.coinbase.com/incidents/fy48n7b802m1\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that the trading pairs’ removals aim to improve “overall market health and consolidate liquidity.” The trading pairs were removed from the Coinbase exchange and other platforms like Advanced Trade and Coinbase Prime at 19:30 UTC on Oct. 16.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d046d7e6-be5e-4f87-bca5-0be2c4ece080.png\"  /><figcaption style=\"text-align: center;\"><em>80 non-USD trading pairs that were removed from Coinbase on Oct. 16. Source: Coinbase Status</em></figcaption></figure><p>The latest trading pairs’ removals on Coinbase come in line with the exchange’s plans to suspend the markets announced in early October. Coinbase <a href=\"https://x.com/CoinbaseExch/status/1708922841817551295?s=20\" target=\"_blank\" rel=\"noopener nofollow\">emphasized</a> that users of the affected platforms can still trade the markets in its “more liquid USD order books” by using the exchange’s USDC (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) balances.</p><p>“Please note these markets make up an immaterial amount of Coinbase Exchange’s total trading volume,” the exchange noted.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/CoinbaseExch?ref_src=twsrc%5Etfw\">@CoinbaseExch</a> regularly monitors the markets on our exchange. In an effort to improve overall market health and consolidate liquidity, we will be removing a number of non-USD trading pairs for certain supported assets.</p>&mdash; Coinbase Exchange ️ (@CoinbaseExch) <a href=\"https://twitter.com/CoinbaseExch/status/1708922836281151857?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase has been suspending trading pairs on its platforms to improve liquidity for a while. The exchange <a href=\"https://status.pro.coinbase.com/incidents/xfvp7yzrlmx3\" target=\"_blank\" rel=\"noopener nofollow\">removed</a> another 41 non-USD markets in mid-September, citing the same reasons. While Coinbase removed multiple USDT-containing trading pairs, none of the suspended markets included USDC, a stablecoin co-developed by Coinbase and Circle.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/securities-regulators-back-sec-in-coinbase-suit\"><strong><em>Securities regulators oppose special treatment of crypto in Coinbase case</em></strong></a></p><p>Coinbase’s ongoing measures to improve liquidity come amid the exchange’s trading volumes tanking this year. According to the cryptocurrency market data provider CCData, Coinbase’s <a href=\"https://cointelegraph.com/news/coinbase-trading-volume-declines\">spot trading volumes for the third quarter plummeted 52%</a> since last year.</p><p>Other major cryptocurrency exchanges like Binance have also seen their spot market share dominance falling this year. According to CCData, Binance’s spot market share <a href=\"https://cointelegraph.com/news/crypto-binance-spot-market-share-drops-7th-month\">fell for a seventh consecutive month</a> in September 2023, tumbling from 55% in early 2023 to 34% in September 2023.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T09:50:31.000Z",
    "title": "UK’s ‘Help with Fees’ scheme won’t define crypto as disposable income",
    "url": "https://cointelegraph.com/news/uk-help-with-fees-scheme-crypto-not-disposable-income",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/aee5a681-f19e-4e8a-b514-1232b1336539.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Ministry of Justice’s proposed “Help with Fees” scheme will not classify cryptocurrencies as disposable income following a public consultation. </p>\n                    <p><p>British citizens who hope to access legal assistance through the proposed “Help with Fees” (HwF) scheme will not have cryptocurrency holdings classified as disposable income.</p><p>The United Kingdom’s Ministry of Justice <a href=\"https://assets.publishing.service.gov.uk/media/65291d80697260000dccf79f/help-with-fees-remission_scheme-consultation-response.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> its response following public consultation over its proposed legal aid scheme to provide equal access to the justice system. HwF aims to provide financial support for court or tribunal fees to individuals with low income and minimal savings.</p><p>The scheme intends to ensure that individuals are not prevented from accessing courts and tribunals due to an inability to afford the fees associated. Its primary objectives look to ensure access to justice for low-income individuals, provide money to taxpayers who ultimately bear the cost of fee remissions, and ensure the scheme is accessible and eligibility criteria are clear.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-law-united-kingdom-law-commission-recommends-crypto-law-reforms\">UK Law Commission recommends ‘distinct’ legal category for crypto</a></em></strong></p><p>The public consultation process drew questions relating to the Ministry of Justice’s proposal to amend the definition of disposable capital to include savings and investments with a “non-exhaustive list” of examples that included cryptocurrencies.</p><p>According to the ministry, most respondents support the proposal, highlighting that it helps capture investments that are not available as liquid assets.</p><p>Meanwhile, other respondents who disagreed with the proposal commented that applicants should not be penalized for having savings and investments, especially pensioners and self-employed individuals:</p><blockquote>“There was also a comment that the non-exhaustive list is too vague and there should be more clarity, for example, that cryptocurrency should be included.”</blockquote><p>The government’s response stressed that it would not propose an exhaustive list of the types of capital that would constitute ‘savings and investments’ as it would create “unnecessary risk” for all types of capital omitted or not yet developed.</p><blockquote>“Furthermore, we confirm that cryptocurrencies are already covered by the current definition of capital under the Fees Orders, and they will continue to be covered by the proposed definition.”</blockquote><p>The ministry plans to review its list in the public guidance accompanying HwF applications to assist applicants in figuring out whether certain types of capital are covered in its current definition. </p><p>The public response also notes that individuals that have savings or investments above a threshold of £16,000 will be expected to use these resources to pay legal fees before receiving assistance from the HwF scheme.</p><p>The UK has been <a href=\"https://cointelegraph.com/news/uk-crypto-bill-reaches-final-stage-on-track-for-passage\">inching closer</a> to passing legislation that will bring cryptocurrencies under similar laws that govern traditional assets in the country. The Financial Services and Markets Bill is expected to give the Treasury, Financial Conduct Authority (FCA), Bank of England and Payments Systems Regulator the ability to proposed and enforce rules for cryptocurrency-related businesses.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\">The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T09:49:14.000Z",
    "title": "Canada central bank assesses innovations and challenges of DeFi ",
    "url": "https://cointelegraph.com/news/defi-canada-central-bank-assesses-innovations-challenges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b9850a22-ba97-477d-bc71-7114a572d17e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The staff note suggested that, although the DeFi ecosystem brings a ton of innovations in the financial sector, the regulatory challenges and vulnerability limit its potential use in traditional finance. </p>\n                    <p><p>The Bank of Canada <a href=\"https://www.bankofcanada.ca/2023/10/staff-analytical-note-2023-15/#chart1\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a staff note on decentralized finance (DeFi) on Oct. 17, assessing the innovations that made it popular and the challenges and risks associated with its use.</p><p>The staff note described DeFi as a multi-layered structure, with the Ethereum blockchain serving as the bottom layer (or settlement layer). Developers construct a variety of tools and services on top of the main blockchain, including tokenization, lending and borrowing services, and much more.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/5ba92c82-41eb-437b-9645-ee570c812a65.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>DeFi architecture. Source: Bank of Canada</em></figcaption></figure><p>The staff note shed light on the rise in popularity of the DeFi ecosystem starting in 2020 and how it became an integral part of the crypto economy, with billions in volume over the next few years. The popularity of the ecosystem took a dip starting in 2022 with the collapse of multiple key crypto platforms with significant DeFi exposure, including Terra.</p><p>Talking about the key features of the decentralized ecosystem, the staff note lauded DeFi’s “composability,” which allows the apps and services in the ecosystem to interconnect. The Bank of Canada note highlighted three of the key areas where DeFi can transform the financial system:</p><ul><li><strong>Frictionless financial service offering</strong>: A decentralized ledger-based system reduces frictions experienced in the legacy system and expands the scope of financial services currently being offered.</li><li><strong>Open competition</strong>: The DeFi ecosystem is open to everyone to build and access, given its open-source nature; thus, it makes way for increased competition, offering better options for the end user.</li><li><strong>Transparency</strong>: The use of programmable smart contracts eliminates intermediaries and increases transparency in the system, as everything is accessible to people analyzing it.</li></ul><p>Apart from the key DeFi innovations that can transform the traditional financial system, the staff note also talked about the challenges and risks associated with the DeFi ecosystem, claiming that “despite its innovations and possibilities, the overall economic benefits of DeFi remain limited.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bank-of-canada-emphasizes-need-for-stablecoin-regulation-as-legislation-is-tabled\"><strong><em>Bank of Canada emphasizes need for stablecoin regulation as legislation is tabled</em></strong></a></p><p>The note lists three key challenges that the DeFi system faces today: the lack of real-world tokenization, the higher concentration of interconnection within, and its dependence on the unregulated centralized finance ecosystem.</p><p>The note also highlighted the regulatory challenges posed by the DeFi ecosystem and the rise in vulnerabilities in the ecosystem, leading to several hacks and exploits. The note claimed that “the anonymous and borderless nature of public blockchains complicates regulatory oversight.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-17T10:00:31.000Z",
    "title": "FTX eyes return of $9 billion in customer funds through settlement proposal",
    "url": "https://cryptoslate.com/ftx-eyes-return-of-9-billion-in-customer-funds-through-settlement-proposal/",
    "description": "<p>Bankrupt FTX might claw back 15% from customers with claims over $250,000 from the platform nine days before its bankruptcy by requiring them to reduce claims, per an Oct. 16 statement. FTX is proposing a settlement to customers who withdrew more money from their accounts than they deposited in the 9 days before FTX filed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-eyes-return-of-9-billion-in-customer-funds-through-settlement-proposal/\">FTX eyes return of $9 billion in customer funds through settlement proposal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-17T09:46:33.000Z",
    "title": "Traditional Finance Firms Fueling Growth in Blockchain-Based Real-World Assets",
    "url": "https://www.cryptoglobe.com/latest/2023/10/traditional-finance-firms-fueling-growth-in-blockchain-based-real-world-assets/",
    "description": "Traditional Finance Enters the Blockchain Arena On 16 October 2023, Jamie Coutts, a crypto market analyst at Bloomberg Intelligence, highlighted the increasing role of traditional finance (TradFi) in the expansion of real-world assets on public blockchains. According to Coutts, more traditional financial firms are expected to join this trend soon. The growth, although starting from […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T10:07:13.000Z",
    "title": "Monopoly Go Unveils Creative Accounting Event: Tasks, Rewards, and More",
    "url": "https://www.cryptopolitan.com/monopoly-go-unveils-creative-accounting-event-tasks-rewards-and-more/",
    "description": "Monopoly Go, the popular mobile adaptation of the classic tabletop board game, is back with a new event, &#8220;Creative Accounting,&#8221; following the conclusion of its Pumpkin Prowl event. This two-day event offers players a chance to earn rewards and progress through milestones by strategically landing on specific classic tiles. Event dates: October 16th– October 18th ... <a title=\"Monopoly Go Unveils Creative Accounting Event: Tasks, Rewards, and More\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monopoly-go-unveils-creative-accounting-event-tasks-rewards-and-more/\" aria-label=\"More on Monopoly Go Unveils Creative Accounting Event: Tasks, Rewards, and More\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T09:57:10.000Z",
    "title": "Riot Grapples with the Diminishing Value of Blue Essence Amid Player Concerns",
    "url": "https://www.cryptopolitan.com/riot-diminishing-value-of-blue-essence/",
    "description": "In the dynamic world of League of Legends riot grapples, the value of Blue Essence, one of the game&#8217;s primary currencies, is undergoing scrutiny as players express growing concerns over its diminishing significance. This digital currency, primarily utilized for unlocking champions, has been losing its charm as seasoned players amass a surplus, leaving them with ... <a title=\"Riot Grapples with the Diminishing Value of Blue Essence Amid Player Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/riot-diminishing-value-of-blue-essence/\" aria-label=\"More on Riot Grapples with the Diminishing Value of Blue Essence Amid Player Concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T09:44:27.000Z",
    "title": "SEC warns investors after false Bitcoin ETF approval reports",
    "url": "https://www.cryptopolitan.com/sec-warns-investors-after-false-bitcoin-etf-approval-reports/",
    "description": "Amid a chaotic trading day intensified by misinformation, the U.S. Securities and Exchange Commission (SEC) issued a clear caution on social media. “Careful what you read on the internet. The best source of information about the SEC is the SEC,” the agency advised, following false reports that it had greenlit a Bitcoin ETF from BlackRock&#8217;s ... <a title=\"SEC warns investors after false Bitcoin ETF approval reports\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-warns-investors-after-false-bitcoin-etf-approval-reports/\" aria-label=\"More on SEC warns investors after false Bitcoin ETF approval reports\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T09:51:24.000Z",
    "title": "Binance reportedly blocked over 100 Hamas-related accounts",
    "url": "https://crypto.news/binance-reportedly-blocked-over-100-hamas-related-accounts/",
    "description": "Israeli authorities have reportedly requested information on over 100 crypto accounts in addition to the ones already blocked by Binance. Crypto exchange Binance is said to have blocked 100 more accounts related to Hamas, a militant group supported by a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T09:45:34.000Z",
    "title": "Crypto Research Firm Predicts 200% XRP Price Rally To $1.5",
    "url": "https://www.newsbtc.com/analysis/xrp/200-xrp-price-rally-to-1-5/",
    "description": "As the XRP price and its future trajectory continue to be a hot topic for debate, crypto research firm Sistine Research has weighed in on this debate using technical analysis. XRP holders are set to love this one, as their prediction is bullish.  Where Is XRP Price Headed? In a post shared on the X (formerly Twitter) platform, Sistine Research stated that, despite the current market outlook, XRP is one of the tokens with a bullish chart in the crypto market as of now.  Related Reading: How Ripple’s Rumored Token Burn Could Affect The XRP Price Their bullish sentiment was projected in their post, which contained a weekly chart that suggested an accumulated pattern since May 2022, with the XRP price having the potential to rally to as high as $1.5, an over 200% increase from its current price of $0.49. Source: X The research firm also used the XRP/Bitcoin chart to further drive home their bullish sentiment. The chart showed XRP’s potential to outperform the flagship cryptocurrency with its projected rally to $1.5. However, it seems that the XRP price could decline to the $0.40 support level before any massive rally. Source: X Clarification On The Charts Sensing that there was some form of skepticism from many in the crypto community, Sistine Research released a subsequent post where it further elaborated on its technical analysis. It explained that from the charts, it was evident that there is a long-term accumulation that is trending upwards.  According to them, during this period, buyers are willing to dive into the market and provide support to the token at higher and higher prices, likely suggesting that a potential retracement or dump by the bears doesn’t faze the bulls.  Sistine alluded to the fact that the most recent pump on the chart was larger than the previous pump. This supposedly shows that buyers are active as they are still accumulating at higher prices rather than waiting for a decline before going in. While all this is happening, sellers are still holding their tokens as they anticipate higher prices before selling.  Related Reading: What To Expect This Month For XRP Price According To Historical Data They compared this XRP chart to the BTC chart in 2018, when buyers got weaker, and sellers had control of the market, selling every pump at lower prices.  The research firm also suggested that DOGE’s chart is currently experiencing something similar (to the 2018 BTC chart) as they stated that the XRP price chart is “objectively bullish” in comparison to the meme coin, which is “exhibiting major signs of buyer exhaustion.” As of the time of writing, the XRP price is trading at $0.49, around 0.30% in the last 24 hours, according to data from CoinMarketCap.  XRP holding at $0.49 &#124; Source: XRPUSD On Tradingview.com Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T09:52:04.000Z",
    "title": "Spot Bitcoin ETF: Everything You Need to Know as a Crypto Investor",
    "url": "https://www.crypto-news-flash.com/spot-bitcoin-etf-everything-you-need-to-know-as-a-crypto-investor/?utm_source=rss&utm_medium=rss&utm_campaign=spot-bitcoin-etf-everything-you-need-to-know-as-a-crypto-investor",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-77.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-77.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-77-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-77-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Currently, the word in every crypto enthusiast&#8217;s mouth is “Bitcoin ETF”. Even those that have not been paying attention were forced to do so today when a now-deleted Twitter post made by a reputable crypto firm, Cointelegraph, appeared to confirm approval of IShares&#8217; Bitcoin ETF by the SEC. This sent a wave across the crypto [...]"
  }
]