[
  {
    "source": "Crypto Daily",
    "date": "2023-11-26T17:36:18.000Z",
    "title": "Is Shiba Inu (SHIB) Poised for an All-Time High Next Year?",
    "url": "https://cryptodaily.co.uk/2023/11/is-shiba-inu-shib-poised-for-an-all-time-high-next-year",
    "description": "Explore the potential of Shiba Inu (SHIB) cryptocurrency reaching a new all-time high in the upcoming year. Analyze market trends, expert predictions, and factors influencing SHIB's value growth"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-26T17:30:40.000Z",
    "title": "7-Day Crypto Snapshot: BLUR, APE, KLAY, and MINA Lead This Week’s Market Rallies",
    "url": "https://news.bitcoin.com/7-day-crypto-snapshot-blur-ape-klay-and-mina-lead-this-weeks-market-rallies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"7-Day Crypto Snapshot: BLUR, APE, KLAY, and MINA Lead This Week&#039;s Market Rallies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/upsdowns.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the last week, bitcoin experienced a modest increase of 2.7% against the U.S. dollar, while ethereum saw a rise of 6.5%. Concurrently, a range of other cryptocurrencies registered significant double-digit advances, notably the non-fungible token (NFT) marketplace Blur&#x2019;s token BLUR, which soared by a significant 72% this past week. 17 Crypto Assets Record Double-Digit [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-26T17:15:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-26T17:10:07.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-26T17:37:39.000Z",
    "title": "Optimism’s weekly trading volume soars 1687%, TVL hits $769m",
    "url": "https://crypto.news/optimism-weekly-trading-volume-soars-1687-tvl-hits-769m/",
    "description": "Optimism’s weekly trading volume has soared by a whopping 1,800% month-on-month to surpass $12 billion in the past week, even overtaking Ethereum."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-26T17:16:17.000Z",
    "title": "How Indexed Finance Foiled Two Treasury Hijack Attempts – Details",
    "url": "https://www.newsbtc.com/analysis/defi-coins/how-indexed-finance-foiled-two-treasury-hijack-attempts-details/",
    "description": "In an interesting line of events, Ethereum-based DeFi project Indexed Finance recently faced and triumphed over a dual hijack attempt of the protocol DAO’s treasury. Following this development, the project’s founders will now re-assume control from the DAO. In a thread on X on Saturday, Laurence Day, a former executive at Indexed Finance, shared two failed hijack attempts targeted at the treasury of the project’s DAO, which is currently valued at  $120,000. According to Day, both attackers purchased a high amount of Indexed’s native token &#8211; NDX and attempted to assume control of the protocol’s treasury via malicious proposals. The first proposal, identified as Proposal 24, was without a heading or description. Being virtually unnoticeable, this proposal almost gained approval within an hour of voting.  However, upon detection, Day, alongside other community members, publicly rallied others to vote against the proposal and eventually thwarted the first hijack attempt. Related Reading: HTX Recommence Operations After Temporary Halt Due to Hack Indexed Finance Anticipates Second Attack, Emerges Victorious Again Considering the publicity and attention surrounding the incident, the Indexed DAO suspected another attacker might attempt to replicate the same tactics to gain access to its treasury. Therefore, the DAO passed proposal 26, identified as the poison pill, which granted them the authority to burn the assets in the treasury if considered as the only means of halting such an attack. As suspected, another hijacker attempted to take control of the treasury and even succeeded in getting the proposal passed &#8211; proposal 27. However, proposals on the Indexed Finance platform have to be queued for 48 hours before execution. During this time, the hijacker approached the DAO to cancel the poison pill proposals, and in return, he would take only a 50% bounty of the funds in the Treasury. However, he soon received a counter-offer from Indexed Co-founder Dillon Kellar, who offered him $10,000 DAI in exchange for canceling his proposal 27 or risk the DAO burning all the assets in the treasury. The hijacker eventually accepted Kellar’s proposal with 4 hours remaining for the execution of the poison pill proposal, marking the successful foiling of the second hijack attempt. Related Reading: Time For Self-Custody? Crypto Exchange Reveals Hackers Tried To Gain Access 159,000 Times Indexed Finance DAO Hands Over Treasury Control To Founders Following the multiple hijack attempts,  the Indexed Finance DAO has now ceded treasury control to Laurence Day as well as Kellar and an individual with the pseudonym PR0. Together, these three persons will manage the Treasury using a ⅔ multi-sig system.  At the time of writing, NDX trades at $0.00823, with a 24.15% decline on the last day. In tandem, the token’s daily trading volume is also down by 44.35% and valued at $2,347. Total crypto market valued at $1.398 trillion on the daily chart &#124; Source: TOTAL chart on Tradingview.com Featured image from  Hacked.com,  chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-26T17:18:48.000Z",
    "title": "Slayboy Token, Pepe, Dogecoin: 100x Cryptocurrencies You Can’t Miss",
    "url": "https://www.crypto-news-flash.com/slayboy-token-pepe-dogecoin-100x-cryptocurrencies-you-cant-miss/?utm_source=rss&utm_medium=rss&utm_campaign=slayboy-token-pepe-dogecoin-100x-cryptocurrencies-you-cant-miss",
    "description": "<img width=\"2048\" height=\"1152\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SLAU-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SLAU-1.png 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SLAU-1-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SLAU-1-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SLAU-1-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/SLAU-1-1536x864.png 1536w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />Have you ever tried explaining cryptocurrency to a friend and watched their eyes glaze over? Yeah, it can get complex. However, here&#8217;s a fun twist: the meme coin market. Imagine a world where internet jokes and finance collide, and the result? Some of the juiciest returns in the crypto universe. Dogecoin started as a playful [...]"
  }
]