[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T22:47:27.000Z",
    "title": "Solana Pay integrates with Shopify, enabling USDC payments for millions of businesses",
    "url": "https://www.cryptopolitan.com/solana-pay-shopify-enabling-usdc-payments-millions-of-businesses/",
    "description": "Solana Pay, a decentralized payment protocol developed by Solana Labs, has made a significant stride by integrating its plug-in with Shopify. This integration allows millions of businesses on Shopify&#8217;s platform to accept payments in USDC, the second-largest stablecoin with a market capitalization of $25.9 billion. The decision to start with USDC was strategic, as merchants ... <a title=\"Solana Pay integrates with Shopify, enabling USDC payments for millions of businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-pay-shopify-enabling-usdc-payments-millions-of-businesses/\" aria-label=\"More on Solana Pay integrates with Shopify, enabling USDC payments for millions of businesses\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T23:00:54.000Z",
    "title": "Which Top Meme Coins Have Held Their Value Best Amid The Crypto Market Crash?",
    "url": "https://www.newsbtc.com/meme-coin/meme-coins-crypto-crash/",
    "description": "The performance of the top meme coins in the space has mostly mirrored the broader market crash triggered by Bitcoin’s decline toward the $25,000 level. However, while all of these digital assets have suffered losses during this time, some have held up better than others, leading to fewer losses on their part compared to their competitors. Baby Doge Coin (BABYDOGE) Leads Meme Coins This meme coin has surprisingly seen the best performance following the crash compared to its counterparts. While most top meme tokens have recorded double-digit losses, Baby Doge Coin (BABYDOGE)  managed to keep below the 10% loss level, coming in with only single-digit losses. Related Reading: SHIB Burn Rate Jump 1,100% Amid Expectations Of Shibarium Relaunch As data from the coin tracking website Coinmarketcap shows, BABYDOGE’s price decline over the last weeks came in 5.97%. This is in stark contrast to others that have come in above 10%, making BABYDOGE the meme token that has held its value best through the crash. Dogelon Mars (ELON) Performs Well Dogelon Mars (ELON) is another meme coin that has put up a tremendous fight against the bears in the last week. Just like BABYDOGE, the token came in with 10% losses in the last week, although by a much narrower margin. The meme token is down 7.85% on the weekly chart, showing impressive resistance. And unlike BABYDOGE which is up 0.63% in the last day, Dogelon Mars (ELON) is seeing losses of 3.35% during this time period, putting it on par with other meme tokens struggling on Wednesday. DOGE price sitting at $0.0629 &#124; Source: DOGEUSD on Tradingview.com Dogecoin (DOGE) Holding Firm While Dogecoin saw significant losses following the crypto crash last week, the leading meme coin has held its own, with its losses currently falling below 10%. DOGE’s losses on the weekly chart came out to 9.76%, ranking it third when it comes to meme tokens that have held their value. Following in the same step as BABYDOGE, Dogecoin is starting to see gains on the daily chart. The cryptocurrency is seeing small gains of 0.61% at the time of this writing. Nevertheless, with a market cap of $8.9 billion, it remains the largest meme coin in the industry. How Other Meme Coins Are Doing The three meme coins listed above are the only meme tokens that have seen losses below 10%. Others such as  Pepe (PEPE), Shiba Inu (SHIB), FLOKI (FLOKI), and Bone ShibaSwap (BONE) have all performed way worse with losses of 15.71%, 16.23%, 19.12%, and 21.18%, respectively. Related Reading: AVAX Price Bucks Under The Pressure Of Upcoming $102 Million Token Unlock However, some of these tokens are beginning to see a light at the end of the tunnel. Out of these, BONE and SHIB seem to be on a reversal trend, recording 2.36% and 3.51% gains, respectively, on the 24-hour chart. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Binance Academy, chart from TradingView.com"
  }
]