[
  {
    "source": "CoinDesk",
    "date": "2023-10-18T17:28:09.000Z",
    "title": "Cracks Appear as Ethereum Staking Demand Wanes",
    "url": "https://www.coindesk.com/tech/2023/10/18/cracks-appear-as-ethereum-staking-demand-wanes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Earlier this year, Ethereum staking was popular, particularly with Lido Finance's rise to prominence in the DeFi space, but it is now facing challenges, suspicions, and resentment."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-18T17:20:34.000Z",
    "title": "Bitcoin Holds $28K as Stocks Buckle Under Interest Rate Concerns",
    "url": "https://www.coindesk.com/markets/2023/10/18/bitcoin-holds-28k-as-stocks-buckle-under-interest-rate-concerns/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. 30-year Treasury bond is on pace to close above 5% for the first time in more than 16 years."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-18T17:12:02.000Z",
    "title": "Bitcoin ETF Hopes Stay Alive as Investment Giant Fidelity Revises Bid",
    "url": "https://decrypt.co/202182/bitcoin-etf-hopes-fidelity-sec",
    "description": "Who will be the first to bring a Bitcoin ETF to U.S. investors?"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-18T17:29:06.000Z",
    "title": "Euro CBDC Advances Into ‘Preparation Phase’: European Central Bank",
    "url": "https://cryptobriefing.com/euro-cbdc-advances-preparation-phase/?utm_source=feed&utm_medium=rss",
    "description": "The ECB is advancing the development of a digital euro CBDC, though no decision made yet on an actual issuance."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T17:39:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T17:15:27.000Z",
    "title": "Promising Osteoporosis Treatment Unveiled",
    "url": "https://www.cryptopolitan.com/promising-osteoporosis-treatment-unveiled/",
    "description": "Researchers at Peking University International Cancer Center and Peking University School and Hospital for Stomatology have made a groundbreaking discovery in the quest to combat osteoporosis. Utilizing a deep learning algorithm, they pinpointed the antimalarial drug dihydroartemisinin (DHA) as a potential remedy for the debilitating bone condition.&#160; DHA has been shown to effectively reverse bone ... <a title=\"Promising Osteoporosis Treatment Unveiled\" class=\"read-more\" href=\"https://www.cryptopolitan.com/promising-osteoporosis-treatment-unveiled/\" aria-label=\"More on Promising Osteoporosis Treatment Unveiled\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T17:14:04.000Z",
    "title": "How much will Spot Bitcoin ETF approval add to the crypto market cap? $1 trillion, perhaps?",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-to-add-1t-to-the-crypto-market/",
    "description": "According to CryptoQuant,&#160; an additional $155 billion is to be added to the crypto&#8217;s market cap if the Bitcoin ETFs are approved by the United States Securities Exchange Commission. Additionally,&#160; the crypto market could grow over $900 billion, peaking at $1 trillion in the long run, if the approval goes through.&#160;&#160; The crypto market has ... <a title=\"How much will Spot Bitcoin ETF approval add to the crypto market cap? $1 trillion, perhaps?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etf-to-add-1t-to-the-crypto-market/\" aria-label=\"More on How much will Spot Bitcoin ETF approval add to the crypto market cap? $1 trillion, perhaps?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T17:30:44.000Z",
    "title": "Binance Traders Go Bearish On Bitcoin, But Here’s Why They Might Regret It",
    "url": "https://www.newsbtc.com/bitcoin-news/binance-traders-go-bearish-on-bitcoin-but-heres-why/",
    "description": "Observing traders&#8217; decisions about crypto, such as Bitcoin, especially on prominent exchanges like Binance, often holds the key to understanding the underlying currents in the market. Two critical events today, highlighted by renowned crypto analyst Ali Martinez, paint a curious picture of BTC&#8217;s current standing. Majority Of Binance Traders Shorting BTC Ali Martinez, a respected figure in the crypto analysis world, revealed some interesting data concerning Bitcoin earlier today. According to Martinez&#8217;s X (formerly known as Twitter) post, most traders on Binance with open Bitcoin futures seem to expect a downturn. Related Reading: Bitcoin Takes The Lead As Crypto Funds See Third Straight Week Of Inflows Specifically, about 51% of these traders are shorting BTC. For clarity, shorting is essentially betting that the price of an asset will decrease. This data indicates that, at least on Binance, traders have a prevailing sentiment that Bitcoin&#8217;s price might be due for a dip. As #Bitcoin nears $29,000, roughly 51% of all accounts on #Binance with an open $BTC futures position are going short! pic.twitter.com/o7SUMfHEyX — Ali (@ali_charts) October 18, 2023 Yet, it&#8217;s important to note that shorting doesn&#8217;t necessarily always translate to a lack of confidence in the asset. Traders might be hedging their bets, capitalizing on short-term fluctuations, or employing a range of trading strategies that best suit their financial objectives and risk tolerance. Bitcoin Notable Price Achievement On the same day, in another tweet, Martinez shared that Bitcoin has achieved a notable milestone. The top cryptocurrency surged past the $27,900 mark, which Martinez identifies as the &#8220;short-term holder cost basis.&#8221; This means that those who have held BTC for a shorter duration and previously saw minimal profits could potentially be realizing gains. Related Reading: Bitcoin Path To $70,000? Analyst Shows What This ‘Head And Shoulders’ Pattern Reveals If Bitcoin maintains its position above this crucial price point, it may suggest a shift in market sentiment, swinging more towards the bullish side, according to the analyst. #Bitcoin has crossed the short-term holder cost basis of around $27,900, which is a crucial psychological benchmark. If $BTC maintains above this level, those short-term holders previously underwater may be back in profit. This could signal a shift to a bullish market sentiment! pic.twitter.com/WilZ6CB67P — Ali (@ali_charts) October 18, 2023 This development starkly contrasts the aforementioned shorting trend on Binance, emphasizing the multifaceted and complex dynamics at play in the crypto market. Meanwhile, the global crypto market has slipped by 0.4% in the past 24 hours following BTC&#8217;s drop of nearly 1%. Bitcoin trades for $28,348 after retracing from its recent spike earlier this week to above $30,000 due to a false report of the US Securities and Exchange Commission (SEC) approval of spot Bitcoin ETF. Featured image from Unsplash, Chart from TradingView"
  }
]