[
  {
    "source": "Decrypt",
    "date": "2023-12-13T18:51:36.000Z",
    "title": "Ubisoft Reveals Mint Date for Free 'Champions Tactics' Ethereum NFTs",
    "url": "https://decrypt.co/209641/ubisoft-reveals-mint-date-free-champions-tactics-ethereum-nfts",
    "description": "A free mint is coming soon for Ubisoft’s first original NFT game. Here's a look at Champions Tactics: Grimoria Chronicles and its NFT plans."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T18:58:53.000Z",
    "title": " US accounting standards board rules will reflect institutional crypto assets&#039; fair value ",
    "url": "https://cointelegraph.com/news/us-accounting-standards-board-rules-will-reflect-institutional-cryptocurrency-assets-fair-value",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMzFjYmJmZTEtZGI0MS00NzcxLWIyNzItNzQ2NGU4YjY3YzBhLmpwZWc=.jpeg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The U.S. FASB has decided that crypto assets will be represented at their fair value in accounting beginning late next year.</p>\n                    <p><p>Crypto companies and institutions holding crypto assets have gotten some good news about accounting practices. They will be able to record the value of their crypto more realistically under rule changes in the United States. </p><p>The Financial Accounting Standards Board (FASB) finalized the new rules on Dec. 13. The FASB is the organization that sets accounting and reporting standards for the U.S. Generally Accepted Accounting Principles (GAAP). GAAP-standard financial reports are required from companies that trade on public markets in the United States.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/fasb-guidelines-will-smooth-the-way-for-broader-crypto-adoption\">New crypto accounting guidelines could ‘smooth the way’ for adoption</a></em></strong></p><p><a href=\"https://cointelegraph.com/news/us-accounting-standards-board-rules-will-reflect-institutional-cryptocurrency-assets-fair-value\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-13T19:00:58.000Z",
    "title": "Corporate adoption in sight as FASB moves toward Bitcoin fair value accounting",
    "url": "https://cryptoslate.com/insights/corporate-adoption-in-sight-as-fasb-moves-toward-bitcoin-fair-value-accounting/",
    "description": "<p>Quick Take As 2023 winds down, Bitcoin has cemented its position as a formidable digital asset, registering an impressive 150% surge and maintaining stability above the $40,000 mark. This performance sets the stage for what could be another exciting year for the digital asset. With multiple influential events on the horizon for 2024, the market [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/corporate-adoption-in-sight-as-fasb-moves-toward-bitcoin-fair-value-accounting/\">Corporate adoption in sight as FASB moves toward Bitcoin fair value accounting</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-13T18:40:00.000Z",
    "title": "Bitcoin Startup Lab debuts BRC-20 LABB token to nurture BTC startup community",
    "url": "https://cryptoslate.com/bitcoin-startup-lab-debuts-brc-20-labb-token-to-nurture-btc-startup-community/",
    "description": "<p>San Francisco-based Bitcoin Startup Lab, a Bitcoin pre-accelerator firm, has introduced LABB, a community-centric BRC-20 token designed to empower BTC entrepreneurs, per a Dec. 13 statement shared with CryptoSlate. The LABB token aims to foster a community of visionaries intending to launch Bitcoin-focused startups. The token acts as a supportive gateway, providing utility for entrepreneurs [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-startup-lab-debuts-brc-20-labb-token-to-nurture-btc-startup-community/\">Bitcoin Startup Lab debuts BRC-20 LABB token to nurture BTC startup community</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-13T18:49:25.000Z",
    "title": "The Metaverse Is Here. And Your Marketing Should Be Ready to Embrace It",
    "url": "https://cryptodaily.co.uk/2023/12/the-metaverse-is-here-and-your-marketing-should-be-ready-to-embrace-it",
    "description": "The rapid emergence of the metaverse has unleashed an unprecedented shift in the digital landscape."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T19:04:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T19:00:32.000Z",
    "title": "Bitcoin Sees Surge In Whale Activity, Will This Affect Price?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-sees-surge-in-whale-activity-will-this-affect-price/",
    "description": "Recent reports have revealed that Bitcoin (BTC) is experiencing a significant surge in whale activity, which has since caused quite a stir in the entire crypto community. Bitcoin Experiences Surge In Whale Transactions  According to Whale Alert, Bitcoin has been displaying a surge in whale transactions over the past 24 hours.  The crypto tracker recently revealed several whale transfers from unknown wallets to crypto exchanges such as Binance and Coinbase.  The report shows that Binance amassed a whale inflow of over $67 million from the transfers. Meanwhile, Coinbase amassed a whale inflow valued at over $310 million from the transfers. Related Reading: Sleeping Bitcoin Giants Wake Up: Pattern Mirrors 2021 Bull Run A recent transaction of 781 BTC was reported by Whale Alert, which came from four distinct cryptocurrency wallets. However, about 658 BTC were seen transferred directly to Binance. In addition, early on Wednesday morning, a different unknown wallet sent 499 BTC to Binance. This move is worth almost $20.6 million as of the time of the transaction. The most recent whale activity reported by the crypto tracker shows that about 500 BTCs were transferred into Binance. As of the time of the report, the transaction was valued at $20.5 million. For Coinbase, the tracker revealed a whopping 7,515 Bitcoin that was transferred by unknown wallets to the crypto exchange. The first transaction saw about 2,510 BTC, valued at $104.2 million sent from an unknown wallet 1xkfCoJyCZ&#8230;Ur7bZJWuXJ to Coinbase. The second whale transaction witnessed 2,494 BTC transferred by another different wallet to the crypto platform.  Meanwhile, the last whale transaction from the anonymous wallet 15LhEQYPdK&#8230;88T9kLM55m transferred 2,511 BTC to Coinbase. Nonetheless, the crypto tracker has reported that these BTCs have been moved from the exchange to several wallets. So far there is no solid evidence that these whale transactions have had any effect on the price of Bitcoin.  Support Levels To Watch Out Says Analyst Cryptocurrency analyst Ali Martinez has recently shared key levels to watch out for concerning the crypto asset. The analyst took to X (formerly Twitter) to share these crucial support levels for the crypto community and investors. Related Reading: Crypto Analyst Predicts Bitcoin 400% Surge To $200,000, Here’s When Ali asserted that BTC will find solid support between $37,150 and $38,360 should in case a deep correction occurs. He further added that the zone is backed by 1.52 million addresses holding about 534,000 BTC. Furthermore, he highlighted two resistance walls that could oppose the crypto asset&#8217;s upward rally. The first resistance wall is $43,850, while the second wall is $46,400. Currently, BTC is sitting at $41,380, indicating a 1% decline in the last 24 hours as of the time of writing. Its market capitalization is currently valued at approximately $809 billion, indicating the same percentage decline, according to CoinMarketCap. Featured image by iStock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-13T19:05:10.000Z",
    "title": "Raoul Pal’s Timely Entry into XRP: The ‘Opportunity of a Lifetime",
    "url": "https://www.crypto-news-flash.com/raoul-pals-timely-entry-into-xrp-the-opportunity-of-a-lifetime/?utm_source=rss&utm_medium=rss&utm_campaign=raoul-pals-timely-entry-into-xrp-the-opportunity-of-a-lifetime",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Raoul Pal, in a discussion with pro-XRP attorney John Deaton, revealed his strategic entry into the XRP market. Pal also discussed the potential decoupling of XRP and other altcoins from Bitcoin&#8217;s market cycles. He expressed skepticism about such decoupling. In a recent live podcast discussion with pro-XRP attorney John Deaton, financial expert Raoul Pal unveiled [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-13T18:42:57.000Z",
    "title": "Worldcoin’s World ID 2.0: Revolutionizing User Verification Across Minecraft, Reddit, and Shopify",
    "url": "https://www.crypto-news-flash.com/worldcoins-world-id-2-0-revolutionizing-user-verification-across-minecraft-reddit-and-shopify/?utm_source=rss&utm_medium=rss&utm_campaign=worldcoins-world-id-2-0-revolutionizing-user-verification-across-minecraft-reddit-and-shopify",
    "description": "<img width=\"640\" height=\"424\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/arteum-ro-7H41oiADqqg-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Worldcoin Orb\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/arteum-ro-7H41oiADqqg-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/arteum-ro-7H41oiADqqg-unsplash-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/arteum-ro-7H41oiADqqg-unsplash-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Worldcoin announces World ID 2.0 integration with platforms such as Minecraft, Reddit and Shopify, improving authentication and fraud prevention. Expanding its reach, Worldcoin launches eye verification services in Mexico and Singapore, with nearly 5 million registered users globally. Worldcoin, the cryptocurrency project co-founded by Sam Altman, has announced a significant and exciting expansion with its [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-13T19:05:21.000Z",
    "title": "Binance’s Changpeng Zhao Will Be Going to Jail, Says CFTC Chair Rostin Behnam",
    "url": "https://dailyhodl.com/2023/12/13/binances-changpeng-zhao-will-be-going-to-jail-says-cftc-chair-rostin-behnam/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Binance-Exploring-Benefits-of-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Chair of the Commodities Futures Trading Commission (CFTC) says that former Binance CEO Changpeng Zhao will face prison in relation to recent charges. Speaking in a new CNBC interview, CFTC Chair Rostin Behnam says that he expects Zhao to spend time in prison after pleading guilty to failing to keep adequate anti-money laundering protocols [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/13/binances-changpeng-zhao-will-be-going-to-jail-says-cftc-chair-rostin-behnam/\">Binance’s Changpeng Zhao Will Be Going to Jail, Says CFTC Chair Rostin Behnam</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]