[
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T09:21:17.000Z",
    "title": " Generative AI teacher lands job in Indian high school ",
    "url": "https://cointelegraph.com/news/ai-teacher-job-high-school-india",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZTRkM2ZiMjYtNDUzMS00ZjdmLTk5ZDMtMDkxMzk5MTk1MTRlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The new-age high school humanoid teacher is equipped with an Intel processor and a dedicated coprocessor to provide personalized learning experiences to students. </p>\n                    <p><p data-ct-non-breakable=\"true\">A high school in Kerala, India, has appointed an artificial intelligence (AI) teacher that uses generative AI to provide personalized education to the students. </p><p>Fears of AI taking over have grown as the technology develops, with industries like coding, videography and writing under threat. However, KTCT Higher Secondary School in Thiruvananthapuram, Kerala, added teaching to the list after becoming the first to hire an AI humanoid.</p><p>The new-age high school teacher is equipped with an Intel processor and a dedicated coprocessor.</p><p><a href=\"https://cointelegraph.com/news/ai-teacher-job-high-school-india\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T09:15:00.000Z",
    "title": " Bitcoin accumulation phase ends as ETFs fuel new $100K BTC price target ",
    "url": "https://cointelegraph.com/news/bitcoin-accumulation-phase-ends-etfs-100k-btc-price-target",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNWY2ZWE1ZTctNDNlMi00OTIzLWI3YTItYTRkODc5Y2RlY2QxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin has emerged from a mass accumulation phase in the past month — a classic move ahead of parabolic BTC price upside.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is ending a year-long accumulation spree that began at the end of the 2022 bear market, data suggests.</p><p>Figures from on-chain analytics firm Glassnode <a href=\"https://studio.glassnode.com/metrics?a=BTC&amp;m=addresses.AccumulationBalance&amp;zoom=all\" target=\"_blank\" rel=\"noopener nofollow\">show</a> BTC in accumulation addresses declining for the first time since the first quarter of 2023.</p><p data-ct-non-breakable=\"true\">Bitcoin hitting all-time highs this week may have sparked an instant sell-off, but behind the scenes, hodlers are already busy taking profits.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-accumulation-phase-ends-etfs-100k-btc-price-target\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T09:30:34.000Z",
    "title": "Total Bitcoin ETF net inflows reach $8.9 billion",
    "url": "https://cryptoslate.com/insights/total-bitcoin-etf-net-inflows-reach-8-9-billion/",
    "description": "<p>Quick Take BitMEX data showed $332 million in inflows into Bitcoin ETFs, equivalent to 4,995 Bitcoin, on Mar. 6. Leading the charge was BlackRock&#8217;s IBIT, which added $282 million to its coffers, bringing its total net inflows to $9.4 billion. This implies that IBIT currently holds around 188,000 BTC. Fidelity&#8217;s FBTC wasn&#8217;t far behind, maintaining [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/total-bitcoin-etf-net-inflows-reach-8-9-billion/\">Total Bitcoin ETF net inflows reach $8.9 billion</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-03-07T09:21:17.000Z",
    "title": " Generative AI teacher lands job in Indian high school ",
    "url": "https://cointelegraph.com/news/ai-teacher-job-high-school-india",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZTRkM2ZiMjYtNDUzMS00ZjdmLTk5ZDMtMDkxMzk5MTk1MTRlLmpwZw==.jpg\"></p><p>The new-age high school humanoid teacher is equipped with an Intel processor and a dedicated coprocessor to provide personalized learning experiences to students. </p>\n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T09:10:59.000Z",
    "title": "The $69,000 Bitcoin Question: Expert Forecasts When Price Will Breakout",
    "url": "https://www.newsbtc.com/news/bitcoin/69000-bitcoin-question-expert-forecasts-price-breakout/",
    "description": "As Bitcoin hovers near its all-time high, industry experts and investors are keenly watching for signs of its next major move. Alex Thorn, the Head of Research at Galaxy, recently shared his perspective on the Bitcoin price trajectory and the factors influencing its potential breakout. In a detailed post on X (formerly Twitter), Thorn provided insights grounded in historical data and current market dynamics. &#8220;We Will Climb the Wall of Worry,&#8221; Thorn proclaimed, setting the tone for his analysis. Bitcoin&#8217;s recent price action saw it reaching $69,324 on Coinbase on Tuesday, marking its first all-time high since November 10, 2021. This milestone came after an 846-day period of anticipation and speculation, only for the price to retract 14.3% to an intraday low of $59,224. This volatility, exacerbated by $400 million in long liquidations within an hour, underscores the cryptocurrency&#8217;s unpredictable nature. Despite the pullback, Bitcoin recovered, trading back at $67,000. Thorn remarked, &#8220;Volatility is back, and it’s likely to remain as we scale the wall of worry.&#8221; He compared the current situation to 2020 when Bitcoin first approached its then all-time high of approximately $20,000 from December 2017. Related Reading: Buckle Up: Bitcoin Set To Smash $150,000 Mark, Says Trading Guru – Here’s When BTC faced initial resistance, experiencing a 12.33% drop after tapping the barrier twice, before ultimately surging ahead. This pattern highlights the psychological and technical challenges at previous all-time highs, a natural resistance point for any asset class. A similar (second) move could be necessary this time to shake all sellers out of the market. Describing the “Wall of Worry,” Thorn explained, “By my count, from Jan. 1, 2017 to the Dec. 17, 2017 all-time high of ~$20k, Bitcoin experienced 13 drawdowns of 12%+ (12 were 15%+, and 8 were 25%+). The same story played out in 2020. Between the Mar. 12, 2020 Covid low ($3858) and the Apr. 14. 2021 ATH of $64,899, there were 13 drawdowns of 10% or more (7 of them were 15% or more).” Notably, Bitcoin already had two 15%+ retracements since the spot ETFs launched on January 11. This week was the second one, the first major drawdown was directly after the ETF launch, with price plunging roughly 20%. Why Bitcoin Is Just Getting Started In his analysis, Thorn also touched upon the role of &#8216;old coins&#8217; or long-held Bitcoin in shaping market movements. &#8220;Some old coins did revive and probably sell, possibly helping to create the intraday top,&#8221; he explained, pointing to blockchain data that indicated movement of coins mined as far back as 2010. This shift from old to new hands is characteristic of bull markets in Bitcoin, facilitating its broader distribution and acceptance. Related Reading: Bitcoin ETF Frenzy: BlackRock Smashes Expectations With $788 Million Inflows In One Day Highlighting the significance of market sentiment and investment flows, Thorn noted, &#8220;And Tuesday was the Bitcoin ETFs largest ever day of inflows and second largest day of net inflows (+$648m) since DAY 1.&#8221; This impressive influx of capital into Bitcoin ETFs underscores the growing interest and confidence in the cryptocurrency, even amidst volatility. Thorn remains bullish on Bitcoin&#8217;s future, suggesting that the current price dynamics are typical of the cryptocurrency&#8217;s bull markets, known for their non-linear progression and numerous corrections. He underscored the resilience and potential for growth despite the hurdles, stating, &#8220;nothing about yesterday’s price action makes me think we aren’t going higher.&#8221; In conclusion, Thorn&#8217;s analysis provides a nuanced view of Bitcoin&#8217;s journey towards breaking its all-time high. By comparing current events with past market behaviors, Thorn offers a compelling case for Bitcoin&#8217;s continued ascent, but after a potential phase of consolidation with several taps of the all-time high before a definitive breakout. &#8220;Buckle up, folks. We are still just getting started,&#8221; he advises. At press time, BTC stood at $66,821. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-07T09:28:24.000Z",
    "title": "14 AI Coins Ready to Explode – Part 3",
    "url": "https://www.altcoinbuzz.io/spotlight/14-ai-coins-ready-to-explode-part-3/",
    "description": "<p>We’ve been talking about AI coins, which we believe will explode in the coming months. We’ve published two parts on this already. This piece is our final on the topic. But why AI? Recall that AI crypto was one of the biggest narratives of 2023. Well, that hasn’t stopped yet. Even in the mainstream world, [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/14-ai-coins-ready-to-explode-part-3/\">14 AI Coins Ready to Explode &#8211; Part 3</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]