[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-01T05:30:01.000Z",
    "title": "Iran Increases Efforts to Join BRICS, Strengthen Ties With Member Countries",
    "url": "https://news.bitcoin.com/iran-increases-efforts-to-join-brics-strengthen-ties-with-member-countries/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Iran Increases Efforts to Join BRICS\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Iran has ramped up its efforts to become a member of the BRICS group ahead of the economic bloc&#8217;s summit. The Iranian deputy foreign minister for economic diplomacy revealed that Iran is actively pursuing opportunities to strengthen its economic ties with BRICS members, noting that it has already established strong relationships with China, Russia, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T05:35:19.000Z",
    "title": "XRPScan Launches New Developer Portal to Drive Innovation on XRPL",
    "url": "https://www.cryptopolitan.com/xrpscan-launches-new-developer-portal/",
    "description": "The XRP Ledger (XRPL) takes a giant leap forward in mainstream adoption as XRPScan, a vital component of the protocol, launches its new and improved developer portal – the XRPSCAN API platform. Offering a more streamlined and user-friendly experience, this cutting-edge toolset provides developers with a series of REST APIs, opening up a world of ... <a title=\"XRPScan Launches New Developer Portal to Drive Innovation on XRPL\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrpscan-launches-new-developer-portal/\" aria-label=\"More on XRPScan Launches New Developer Portal to Drive Innovation on XRPL\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-01T05:32:56.000Z",
    "title": "VC Spectra (SPCT) Advances Toward 100x Growth As Polygon (MATIC) and Cardano (ADA)  Users Jump Ships",
    "url": "https://nulltx.com/vc-spectra-spct-advances-toward-100x-growth-as-polygon-matic-and-cardano-ada-users-jump-ships/",
    "description": "VC Spectra (SPCT) is making waves in the crypto market as it sets its sights on 100x growth. As users from popular blockchain networks like Polygon (MATIC) and Cardano (ADA) make the switch, VC Spectra (SPCT) is positioning itself as an attractive and promising investment option. With its enticing features and potential for substantial returns, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-01T05:29:46.000Z",
    "title": "Arbitrum (ARB) Falls as Borroe ($ROE) and Shiba Inu (SHIB) Gain Investor Support",
    "url": "https://nulltx.com/arbitrum-arb-falls-as-borroe-roe-and-shiba-inu-shib-gain-investor-support/",
    "description": "Arbirtrum’s (ARB) ecosystem is progressing despite its price taking a beating. Investors have diversified into Shiba Inu (SHIB) and Borroe ($ROE) in 2023. Shiba Inu’s (SHIB) community is currently excited; now is the best time to invest. Also, Borroe ($ROE) has completed its beta presale stage, and investors are speedily buying this token right now. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-01T05:27:30.000Z",
    "title": "Solana Selling Off Despite Increasing Network Reliability, QUBE Emerges As A Store-of-Value",
    "url": "https://nulltx.com/solana-selling-off-despite-increasing-network-reliability-qube-emerges-as-a-store-of-value/",
    "description": "The crypto world is no stranger to high volatility, with the prices of cryptocurrencies often experiencing significant and wild fluctuations. In recent developments, Solana, despite its speed, scalability, and notable improvements in its New York reliability, experienced a sell-off. On the other hand, QUBE, the utility token of InQubeta, is gaining increasing attention as a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-01T05:24:12.000Z",
    "title": "Solana Records 1 Outage in First Half of 2023, DigiToads is Becoming one of the most successful presales of the year",
    "url": "https://nulltx.com/solana-records-1-outage-in-first-half-of-2023-digitoads-is-becoming-one-of-the-most-successful-presales-of-the-year/",
    "description": "We are almost halfway through 2023 and the global cryptocurrency market has seen its fair share of ups and downs. From clocking a market capitalization of $1.2 trillion to the launch of new innovative coins like DigiToads (TOADS) to Solana&#8217;s sole outage, there have been several headline-grabbing moments so far. Layer-1 blockchains such as Solana [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-01T05:14:04.000Z",
    "title": "Gala Games and Enjin Coin Users Are Shifting Their Attention to Pomerdoge Unique Gaming Model",
    "url": "https://nulltx.com/gala-games-and-enjin-coin-users-are-shifting-their-attention-to-pomerdoge-unique-gaming-model/",
    "description": "Gala Games (GALA) and Enjin Coin (ENJ) users have begun shifting their attention to different projects that can provide them with a higher level of value and enjoyment. One such project has been Pomerdoge (POMD) which has grabbed a significant level of appeal due to its unique gaming model Summary The Gala Games crypto decreased [&#8230;]"
  }
]