[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T04:26:47.000Z",
    "title": "Sensigo’s AI Tool is Porsche’s Answer to Advanced Auto Diagnostics",
    "url": "https://www.cryptopolitan.com/sensigos-ai-tool-porsches-advanced-auto/",
    "description": "In a significant leap forward for the automotive industry, Porsche, in partnership with US investment firm UP.Partners, has taken a bold step into the future with the creation of Sensigo, a start-up set to transform the way mechanics approach car diagnostics and repairs through the application of artificial intelligence (AI). With a vision to predict ... <a title=\"Sensigo&#8217;s AI Tool is Porsche&#8217;s Answer to Advanced Auto Diagnostics\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sensigos-ai-tool-porsches-advanced-auto/\" aria-label=\"More on Sensigo&#8217;s AI Tool is Porsche&#8217;s Answer to Advanced Auto Diagnostics\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T04:27:23.000Z",
    "title": "Ethereum Price Topside Bias Vulnerable Unless It Surges Past $1,665",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-vulnerable-1665/",
    "description": "Ethereum price is slowly moving lower toward the $1,600 support against the US dollar. ETH remains at risk of more losses unless it clears $1,650 and $1,665. Ethereum is struggling to stay above the $1,600 support zone. The price is trading below $1,640 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support near $1,620 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it clears the $1,650 and $1,665 resistance levels. Ethereum Price Holds Support Ethereum made another attempt to gain strength above the $1,650 resistance. ETH failed to settle above the $1,650 level, struggled to clear $1,665, and underperformed vs Bitcoin. A high was formed near $1,664 before the price saw a fresh decline. It retested the $1,620 support. A low has formed near $1,617 and the price is now attempting another recovery wave. There was a minor increase above the $1,625 level. Ethereum is now trading below $1,640 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support near $1,620 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,640 level or the 100-hourly Simple Moving Average. It is close to the 50% Fib retracement level of the recent decline from the $1,664 swing high to the $1,617 low. The next major resistance is $1,650 or the 76.4% Fib retracement level of the recent decline from the $1,664 swing high to the $1,617 low. The main resistance is still near the $1,665 level. A close above the $1,665 resistance might send the price toward the key resistance at $1,750. Source: ETHUSD on TradingView.com To start a decent upward move, Ether must settle above the $1,720 and $1,750 levels. The next key resistance might be $1,850. Any more gains might open the doors for a move toward $1,920. More Losses in ETH? If Ethereum fails to clear the $1,665 resistance, it could continue to move down. Initial support on the downside is near the $1,620 level. The next key support is $1,600. The first major support is now near $1,585. A downside break below the $1,585 support might start another strong decline. In the stated case, the price could revisit the $1,540 level. Any more losses may perhaps send Ether toward the $1,500 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,665"
  }
]