[
  {
    "source": "Decrypt",
    "date": "2024-01-02T19:19:29.000Z",
    "title": "Grayscale Bitcoin ETF: Here’s What’s in the Latest SEC Filing",
    "url": "https://decrypt.co/211514/grayscale-bitcoin-etf-latest-sec-filing",
    "description": "Grayscale is one of many high-profile firms vying to launch a spot Bitcoin ETF."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T19:20:14.000Z",
    "title": " Fidelity and Galaxy announce fees for proposed Bitcoin ETFs: Report ",
    "url": "https://cointelegraph.com/news/fidelity-galaxy-announce-fees-proposed-bitcoin-etfs-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzljMGFmMzUtYTgyYy00Njg4LTgyYjAtYmYwN2FkYjQ4YjQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Fidelity will charge 0.39% to shareholders of its spot Bitcoin ETF, whereas Galaxy/Invesco will waive fees for six months before charging 0.59% afterwards.</p>\n                    <p><p>The issuers of two proposed Bitcoin exchange traded funds have reportedly set the fees they will charge if their ETFs are approved. According to a report from Fortune, Fidelity Investments will <a href=\"https://fortune.com/crypto/2024/01/02/bitcoin-etf-fee-authorized-participant-fidelity-blackrock-galaxy-grayscale/\" target=\"_blank\" rel=\"noopener nofollow\">charge</a> 0.39% per year to holders of its Wise Origin Bitcoin Trust and Galaxy/Invesco will charge 0.59% per year for its BTCO fund. In Galaxy/Invesco’s case, the fee will be waived for the first six months of the fund’s operation. The report cited a Dec. 29 court filing as the source of the information.</p><p>The report also said Jane Street Capital will be the “authorized participant” for the Bitcoin ETFs of Fidelity, WisdomTree, and Valkyrie, implying that Jane Street Capital will be allowed to arbitrage differences in price between these funds’ shares and Bitcoin itself. Valkyrie also named Cantor Fitzgerald as a second authorized participant. Galaxy/Invesco and BlackRock have named both JPMorgan and Virtu as their authorized participants.</p><p>The ETFs <a href=\"https://cointelegraph.com/news/bitcoin-etf-applicants-bend-the-knee-cash-redemption-model\">will use a “cash” model</a> for creation and redemption, which means that authorized participants will not purchase Bitcoin and deposit it into the funds. Instead, they will deposit the cash equivalent for the amount of Bitcoin they want to deposit, which will then be used by the fund to purchase BTC. The US Securities and Exchange Commission (SEC) has pushed for this solution, claiming that it doesn’t want to allow broker-dealers to handle Bitcoin, the report stated.</p><p><a href=\"https://cointelegraph.com/news/fidelity-galaxy-announce-fees-proposed-bitcoin-etfs-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-02T19:37:59.000Z",
    "title": "Bitcoin climbs over $45,000 for the first time since 2022",
    "url": "https://cryptobriefing.com/bitcoin-climbs-over-45000-for-the-first-time-since-2022/?utm_source=feed&utm_medium=rss",
    "description": "Bitcoin surges to $45,532 amid ETF approval optimism, Ethereum also gains as market rallies ahead of 2024 elections."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T19:11:55.000Z",
    "title": "Donald Trump predicts market turmoil if he loses the presidential election",
    "url": "https://www.cryptopolitan.com/donald-trump-market-turmoil-election/",
    "description": "In recent statements, former U.S. President Donald Trump has expressed deep concerns about the current state of the U.S. economy, issuing warnings of a potential stock market crash worse than that of 1929 and drawing parallels to the Great Depression if he does not secure victory in the upcoming presidential election. Trump, the 45th President [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T19:20:10.000Z",
    "title": "Dormant Bitcoin at low numbers amid presumed profit taking",
    "url": "https://crypto.news/dormant-bitcoin-at-low-numbers-amid-presumed-profit-taking/",
    "description": "The amount of Bitcoin lying dormant in digital wallets is hovering at low levels despite market enthusiasm."
  }
]