[
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T03:26:23.000Z",
    "title": " Google’s ‘GPT-4 killer’ Gemini is out, here’s how you can try it ",
    "url": "https://cointelegraph.com/news/how-to-try-google-new-ai-model-gemini-chatbot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTRjYzE2MTgtOTE5Mi00NDAzLTkyZWItZTRiOTk2NmZiMmYzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Google has deployed its newest weapon in the AI arms race, a new artificial intelligence model that it claims is smarter and more powerful than OpenAI’s GPT-4.</p>\n                    <p><p>Tech giant Google has officially rolled out Gemini, its latest <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence</a> model that it claims has surpassed OpenAI's GPT-4.</p><p>On Dec. 6, Google CEO Sundar Pichai and Google DeepMind CEO and co-founder Demis Hassabis announced the launch of Gemini in a company <a href=\"https://blog.google/technology/ai/google-gemini-ai/\" target=\"_blank\" rel=\"noopener nofollow\">blog post</a></p><p>The AI model has been optimized for different sizes and use cases (Ultra, Pro, Nano) and built to be multimodal to understand and combine different types of information. </p><p><a href=\"https://cointelegraph.com/news/how-to-try-google-new-ai-model-gemini-chatbot\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T03:11:31.000Z",
    "title": "Asia Hedge Funds Ride High on Japan Rebound and AI Surge, Dodging China Turmoil",
    "url": "https://www.cryptopolitan.com/asia-hedge-funds-japan-and-ai-surge/",
    "description": "In a year marked by economic uncertainties and geopolitical tensions, Asia hedge funds have managed to steer clear of the tumultuous Chinese investment landscape. The real news lies in their strategic moves tied to Japan&#8217;s resurgence and the flourishing AI-driven technology sector. As Asia-focused funds celebrate a significant performance improvement, this narrative delves into the ... <a title=\"Asia Hedge Funds Ride High on Japan Rebound and AI Surge, Dodging China Turmoil\" class=\"read-more\" href=\"https://www.cryptopolitan.com/asia-hedge-funds-japan-and-ai-surge/\" aria-label=\"More on Asia Hedge Funds Ride High on Japan Rebound and AI Surge, Dodging China Turmoil\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T03:25:12.000Z",
    "title": "Bitcoin Price Consolidates Rally and Primed To Surge Toward $45K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-45k/",
    "description": "Bitcoin price started a strong increase above the $42,000 zone. BTC is now consolidating gains and might rally further toward the $45,000 zone. Bitcoin gained pace above the $42,200 and $43,200 levels. The price is trading above $43,000 and the 100 hourly Simple moving average. There are two bullish trend lines forming with support near $43,900 and $42,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair is likely setting up for a fresh increase above the $44,000 level. Bitcoin Price Remains Supported Bitcoin price started a major increase above the $42,000 resistance zone. BTC surged and even broke the $43,200 resistance zone. A new multi-month high was formed near $44,465 before the price started a minor downside correction. There was a move below the $44,000 level. The price tested the 23.6% Fib retracement level of the upward move from the $39,475 swing low to the $44,465 high. However, the bulls remained active above the $43,200 support zone. Bitcoin also trades above $43,500 and the 100 hourly Simple moving average. Besides, there are two bullish trend lines forming with support near $43,900 and $42,000 on the hourly chart of the BTC/USD pair. The second trend line is close to the 61.8% Fib retracement level of the upward move from the $39,475 swing low to the $44,465 high. On the upside, immediate resistance is near the $44,250 level. The first major resistance is forming near $44,450, above which the price might rally toward the $45,000 level. Source: BTCUSD on TradingView.com A close above the $45,000 resistance might send the price further higher. The next key resistance could be near $46,200, above which BTC could rise toward the $47,500 level. Short-term Dips In BTC? If Bitcoin fails to rise above the $44,250 resistance zone, it could start a downside correction. Immediate support on the downside is near the $43,900 level and the trend line. The next major support is near $42,550, below which the price might test the second trend line. If there is a move below $42,000, there is a risk of more downsides. In the stated case, the price could drop toward the $41,200 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $43,900, followed by $42,000. Major Resistance Levels – $44,250, $44,450, and $45,000."
  }
]