[
  {
    "source": "CoinDesk",
    "date": "2023-09-18T05:16:09.000Z",
    "title": "NFL Quarterback Trevor Lawrence and Two YouTube Influencers Settle FTX Case",
    "url": "https://www.coindesk.com/policy/2023/09/18/nfl-quarterback-trevor-lawrence-and-two-youtube-influencers-settle-ftx-case/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Three celebrity promoters of the failed FTX cryptocurrency exchange have opted to settle a case which alleged they helped dupe investors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T05:27:00.000Z",
    "title": "Idealistic Ethereum community-built zkEVM Scroll launching in weeks",
    "url": "https://cointelegraph.com/news/ethereum-community-built-zkevm-scroll-launching-in-weeks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/954d769b-e78e-40f2-9dca-74359f0db353.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Scroll co-founder Ye Zhang is aiming for a community-driven decentralized immutable scaling solution for Ethereum.</p>\n                    <p><p>After two years of development, a group of Ethereum idealists are close to launching their zero-knowledge EVM (Ethereum Virtual Machine) — Scroll — developed with Ethereum’s values in mind. </p><p>While there are already several zero-knowledge EVMs in existence today, Scroll co-founder Ye Zhang told Cointelegraph at Token2049 that the project was “idealistic” as the team was sticking to the philosophy and the principles that Ethereum already cultivates. </p><p>Zhang said that they have been working on this mostly as a “labor of love,” driven by a shared vision to scale Ethereum while staying true to its decentralization principles. </p><p>He added that the project was more human interest than simply solving computational problems, “we started in an open source way, in a community-driven way,” he said. </p><blockquote>“We can grow this community very organically, and then grow our network effect, not in a very silly way, not in a very marketing-driven aggressive way.”</blockquote><p>The new zkEVM is set to launch within weeks, having already undergone extensive testing and carried out audits on the code. Zhang said the Scroll will launch after some final testing and major projects like Uniswap and Aave are ready to deploy on Scroll at launch.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1cdc2371-f1f0-46af-8dcd-b24fb07eba0a.jpg\"  /><figcaption style=\"text-align: center;\">Scroll co-founder Ye Zhang. Source: Cointelegraph</figcaption></figure><p>The mathematician believes zk-rollups are the “holy grail” or best-in-class layer-2 scaling solutions, which are also very cheap and secure.</p><p>However, Scroll is entering a crowded ecosystem that already has zkEVM solutions from Polygon, <a href=\"https://cointelegraph.com/news/immutable-zkevm-begins-testnet-phase-with-polygon\">Immutable</a>, StarkWare, and ConsenSys’ Linea which <a href=\"https://cointelegraph.com/news/consensys-completes-public-launch-of-zkevm-linea\">launched</a> in August. </p><p>Zhang claimed that some of the other systems such as Linea have some “unproven” parts in the circuit but believes Scroll provides a “complete proof” of all Ethereum “opcodes” and components of the transaction. </p><p>“So it's not only compared to compatibility, but also a full proof for proving that everything we already have,” he said.</p><p><strong><em>Related:</em></strong> <a href=\"https://cointelegraph.com/news/buterin-weighs-in-on-zk-evms-impact-on-decentralization-and-security\"><strong><em>Buterin weighs in on zk-EVMs’ impact on decentralization and security</em></strong></a></p><p>Scroll is a layer-2 scaling project that has been in development for two years. It uses zero-knowledge proofs to compress data off-chain, meaning only proofs are submitted on-chain — enabling higher throughput.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As always, we published another ecosystem update, highlighting some of the latest projects to join the Scroll ecosystem <br><br>This week, we cover DeFi aggregators and permissionless lending protocols. <a href=\"https://t.co/1G4ErzAB00\">https://t.co/1G4ErzAB00</a></p>&mdash; Scroll  (@Scroll_ZKP) <a href=\"https://twitter.com/Scroll_ZKP/status/1703191136947613958?ref_src=twsrc%5Etfw\">September 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The EVM component enables full native compatibility with any existing Ethereum software and applications. </p><p>The initial setup will still involve some centralization such as sequencers, Zhang said, but the roadmap will decentralize this further over time. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/attack-zkevms-cryptos-10x-moment/\"><strong><em>Attack of the zkEVMs! Crypto’s 10x moment</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T05:12:29.000Z",
    "title": "What happened in crypto this weekend? ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum’s Holesky testnet launch fails, CoinEx writes open letter to hackers, Sam Bankman-Fried’s court drama, and more.</p>\n                    <p><h3>Ethereum's Holesky testnet fails launch</h3><p>Ethereum developers have been forced to regroup after failing to launch a new test network, Holesky, on Sept. 16. </p><p>The testnet attempted to launch with about 1.5 million validators but failed due to a misconfiguration in the source code, <a href=\"https://twitter.com/NethermindEth/status/1702719860915019784\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Ethereum infrastructure firm Nethermind in a Sept. 16 post. </p><p>Ethereum Foundation engineer Parithosh Jayanthi shed more light on the matter, explaining that while some validators manually fixed the configuration issue — enabling Holesky testnet to start —there weren’t enough active validators for the network to reach finality.</p><p>Nethermind said Ethereum Foundation’s developers agreed to try again a week from the time of the post — presumably around Sept. 23.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We had a misconfiguration in the el genesis file and that led to the holesky network improperly launching. Some validators manually fixed the config and were able to start the chain, but not enough for the network to finalize. <a href=\"https://t.co/5fchlRBCP3\">https://t.co/5fchlRBCP3</a></p>&mdash; parithosh |  (@parithosh_j) <a href=\"https://twitter.com/parithosh_j/status/1702816780542984504?ref_src=twsrc%5Etfw\">September 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Jayanthi said it’s “extremely likely” the network will properly launch within the next two weeks once the technical issue is resolved.</p><p>He <a href=\"https://twitter.com/parithosh_j/status/1702816783642546200\" target=\"_blank\" rel=\"noopener nofollow\">apologized</a> for the failed launch and said the team will ensure the same problem is prevented in the future:</p><blockquote>“Sorry for the chaos! We'll add some more validation steps and better docs to try and make sure this doesn't happen again.”</blockquote><p><a href=\"https://cointelegraph.com/news/ethereum-launches-new-testnet-holesky-allocates-1-6b-eth-for-devs\">Holesky is designed to facilitate staking,</a> infrastructure, and protocol development on the Ethereum network. It’s replacing the Goerli testnet after developers began <a href=\"https://ethereum-magicians.org/t/testnet-workgroup-paths-out-of-the-goerli-supply-mess/11453\" target=\"_blank\" rel=\"noopener nofollow\">complaining</a> that Goerli had too low of a supply of Goerli ETH to adequately handle testing needs. </p><p>Anthony Sassano, host of Ethereum show The Daily Gwei previously <a href=\"https://x.com/sassal0x/status/1702496695467262289\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the launch would be the largest public testnet in Ethereum history.</p><h3>CoinEx writes plea to hackers in bizarre open letter</h3><p>Crypto exchange CoinEx has published an open letter pleading for the hackers <a href=\"https://cointelegraph.com/press-releases/coinex-updates-on-recent-hot-wallets-hack\">behind the recent $70 million heist</a> to come forward and talk about the potential return of funds — adding a rather strange call to action. </p><p>“We sincerely invite you to work with us to resolve this issue in a securer, more reasonable, and more user-friendly manner. We encourage you to communicate and negotiate with us actively on the blockchain or through our official email address,” the firm wrote.</p><p>As hacked firms usually do, CoinEx said they were willing to offer the hackers a “generous” bug bounty as a reward for returning the stolen funds.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/CoinExResponseUpdate?src=hash&amp;ref_src=twsrc%5Etfw\">#CoinExResponseUpdate</a> - CoinEx’s Open Letter to Hackers<br><br>To Hackers,<br><br>We entered this industry with a vision of “making the world a better place via blockchain.” Like millions of blockchain enthusiasts who share the same faith, we strive to build an open, interconnected, and…</p>&mdash; CoinEx Global (@coinexcom) <a href=\"https://twitter.com/coinexcom/status/1702668801874206779?ref_src=twsrc%5Etfw\">September 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, bizarrely, CoinEx applauded the white hat hackers for their “technical expertise” and even invited them to discuss how CoinEx can upgrade its security system.</p><blockquote>“If possible, we sincerely invite you to discuss the future upgrade of CoinEx’s security system. Together with global blockchain enterprises and practitioners, we will safeguard a free, open, secure, and trustworthy blockchain ecosystem.”</blockquote><p>CoinEx’s message to the hackers also included a message more likely intended for its affected users, stating: </p><p>“This incident has come as a profound lesson for us and has alerted us to the fact that the security of exchange assets must never be compromised. The affected assets are not just numbers; they represent the trust millions of global users have placed in us,” they said.</p><p>On Sept. 12, crypto exchange CoinEx experienced abnormally large outflows to an address with no prior history. Several blockchain security firms have pointed to <a href=\"https://cointelegraph.com/news/coinex-north-korea-s-lazarus-group-responsible-for-55-m-coin-ex-hack-report\">North Korea’s Lazarus Group</a> as the likely perpetrator behind the attack. </p><h3>SBF’s proposed jury questions ‘unnecessarily intrusive’</h3><p>United States prosecutors have objected to a series of questions Sam Bankman-Fried’s lawyers plan to ask prospective jurors for his upcoming trial, calling them \"unnecessarily intrusive.\"</p><p>In a Sept. 15 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590939/gov.uscourts.nysd.590939.282.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> to U.S. District Court Judge Lewis A. Kaplan, the prosecutors argued that a fair trial isn’t prejudiced by Bankman-Fried’s public image and that it isn’t fair to ask jurors to ignore what they’ve previously seen in the news.</p><p>The prosecutors specifically don’t want Bankman-Fried’s <a href=\"https://cointelegraph.com/news/prosecutors-propose-jury-instructions-sam-bankman-fried-trial\">lawyers to ask prospective jurors</a> what they think of Bankman-Fried and FTX, whether they can “completely ignore” what they’ve seen in the news and whether they’ve made up their minds about his guilt or innocence.</p><p>Prosecutors say this is “unnecessarily intrusive” and steps outside the bounds of voir dire — a process of questioning by which members of a jury are selected from a pool of prospective jurors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/feaf929e-ed91-4f8e-a10c-d3d2f5ffd02e.png\"  /><figcaption style=\"text-align: center;\"><em>The United States prosecutor’s letter of objection to District Court Judge Lewis Kaplan. Source: Courtlistener</em></figcaption></figure><p>Questions about the Bankman-Fried’s ADHD diagnosis, political donations and effective altruism — a charitable philosophical movement on which he<a href=\"https://cointelegraph.com/magazine/sam-bankman-fried-the-crypto-whale-who-wants-to-give-billions-away/\"> built his reputation on</a> — were also objected by the prosecutors. </p><blockquote>“Telling the jury that the defendant has ADHD would serve only to improperly cast the defendant at the outset of the trial in a sympathetic light [...] His diagnosis of ADHD or depression — has no proper place at trial and the defense should also be precluded from mentioning it in opening statement.”</blockquote><p>The prosecutors didn’t object to Bankman-Fried’s lawyers questioning prospective jurors on the cryptocurrency industry.</p><p>Bankman-Fried’s trial is set to commence on Oct. 2.</p><h3>Grayscale CEO 'optimistic' a US crypto bill could be passed this year</h3><p>The United States Congress may be able to pass a cryptocurrency bill by the end of the year, says Grayscale Investment CEO Michael Sonnenshein.</p><p>Speaking to Yahoo Finance on Sept. 14, Sonnenshein <a href=\"https://au.finance.yahoo.com/video/regulating-crypto-grayscale-ceo-encouraged-204052494.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> there’s real momentum with cryptocurrency-related bills in Washington at the moment which could pay dividends by the year’s end:</p><blockquote>“I'm optimistic that we absolutely could [see legislation passed] if any Congress to date could do it it certainly could be this Congress.”</blockquote><p>The Grayscale boss said the firm has been encouraged by what they’ve seen by lawmakers in meetings over the last 12 months.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/JTpEFG4oFaM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/grayscale-asks-sec-meet-for-bitcoin-etf-conversion\"><strong><em>Grayscale asks SEC to meet on ‘way forward’ for Bitcoin ETF conversion </em></strong></a></p><p>He said he was particularly pleased with the efforts of Patrick McHenry, the Chairman of the U.S. House Financial Services committee — presumably in relation to the Digital Asset Market Structure Proposal draft that he co-released on June 2.</p><blockquote>“Many of the folks that have been involved in drafting that legislation and those that have voted for it are really hoping to build on that momentum that now that Congress is coming back into session that they can re-engage on these topics and get broader members support for it.”</blockquote><p>Sonnenshein believes the upcoming 2024 presidential election can be used as a catalyst to push this momentum even further.</p><h3>Other news</h3><p>Bankrupt cryptocurrency exchange <a href=\"https://cointelegraph.com/news/ftx-security-claims-portal-cyberbreach\">FTX has restored its customer claims</a> portal with tighter security protocols, which was previously shut down due to a cyberattack. Claimants can now continue to submit claims for assets they held on the exchange prior to it becoming insolvent. </p><p>The United States House Financial Services Committee is moving forward with legislation aimed at <a href=\"https://cointelegraph.com/news/us-lawmakers-advance-legislation-blocking-digital-dollar\">preventing the issuance of a central bank digital currency.</a> One of the bills announced by chairman Patrick McHenry purports to prohibit the Federal Reserve from initiating pilot programs to test CBDCs without approval from Congress while the other attempts to prohibit banks from offering certain financial products to individuals.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sec-delays-btc-etf-decision-grayscale-triumphs-sec-and-bitboy-gets-the-boot-hodlers-digest-aug-27-sept-2/\"><strong><em>Hodler’s Digest, Aug. 27 – Sept. 2: SEC delays BTC ETF decision, Grayscale triumphs over SEC and BitBoy gets the boot</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T05:27:12.000Z",
    "title": "Stellar (XLM)-Based ClickPesa Conquers the Billion-Dollar Remittance Market in Africa with a Bold Vision",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-based-clickpesa-conquers-the-billion-dollar-remittance-market-in-africa-with-a-bold-vision/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-based-clickpesa-conquers-the-billion-dollar-remittance-market-in-africa-with-a-bold-vision",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Blue-Planet-Studio-3Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Blue-Planet-Studio-3Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Blue-Planet-Studio-3Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Blue-Planet-Studio-3Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Blue-Planet-Studio-3Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Stellar-backed ClickPesa is working to solve remittance woes in Tanzania. The startup&#8217;s focus is typically on Small and Medium Enterprises (SMEs). Tanzania-based payment protocol ClickPesa built on the Stellar blockchain is making waves all over Africa with its revolutionary potential. ClickPesa is a company created by two Stellar Lumens developers, Rick Groothuizen and Richard Lema.  [...]"
  }
]