[
  {
    "source": "CoinDesk",
    "date": "2023-10-16T19:46:39.000Z",
    "title": "Protocol Village: ARPA Network's Random Number Generator 'Randcast' Live on Optimism",
    "url": "https://www.coindesk.com/tech/2023/10/16/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 16-22, with live updates throughout."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-16T19:51:59.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Crypto exchange Binance will stop accepting users in the United Kingdom on Oct. 16. Meanwhile, Australia's Treasury could soon require crypto exchanges to be licensed under the existing financial services license regime. And the biggest acquisition in gaming history could have important implications for the Web3 and crypto gaming communities.</p><h2>Crypto exchange Binance will stop accepting users in the United Kingdom on Oct. 16</h2><p><a href=\"https://cointelegraph.com/news/binance-halts-new-uk-user-onboarding\">Binance is no longer onboarding new users in the U.K</a>., according to a blog post from the cryptocurrency exchange. </p><p>This move comes after the U.K.’s Financial Conduct Authority (FCA) imposed legally binding requirements on its partner Rebuildingsociety.com Ltd (REBS) on Oct. 10. Per those rules, REBS was prohibited from ad promotions soliciting Binance goods and services. </p><p>This evidently left Binance without a U.K. partner in compliance with the FCA’s marketing requirements.</p><p>According to Binance:</p><blockquote>\"Binance is currently looking for a new FCA authorised approver. However, there will be some temporary restrictions coming into effect on our Platform (i.e. www.binance.com/en-GB and latest version of our Mobile App) during the period until Binance onboards with a new FCA authorised approver and has its financial promotions reapproved.\"</blockquote><h3>Australia to require crypto exchanges to get licensed under the existing regime</h3><p>The Australian federal government is charging forward with plans to regulate the digital asset sector at the exchange level, with plans to regulate crypto exchanges under an existing licensing regime for financial services. </p><p>In the newly-unveiled “Regulating digital asset platforms” consultation <a href=\"https://treasury.gov.au/sites/default/files/2023-10/c2023-427004-proposal-paper-final.pdf\" target=\"_blank\" rel=\"noopener nofollow\">paper</a>, released on Oct. 16, the Australian Treasury said that the new regulatory framework aims to address consumer harms while still supporting innovation in the digital asset sector.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Assistant Treasurer, Conroy, announces crypto regulation consultation and licensing for Australia with AFSL for service providers such as exchanges. <a href=\"https://t.co/AK1cCRw2gh\">pic.twitter.com/AK1cCRw2gh</a></p>&mdash; Martin Rogers  (@martinfrogers) <a href=\"https://twitter.com/martinfrogers/status/1713681494248665234?ref_src=twsrc%5Etfw\">October 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The core theme of the new regulatory framework is that it aims to regulate cryptocurrency exchanges and service providers instead of individual cryptocurrencies or tokens themselves. Additionally, the consultation paper explained that it will regulate crypto exchanges under pre-existing financial services laws, instead of crafting new crypto-specific rules.</p><p>Australian crypto exchanges have largely praised the Treasury’s latest proposal, though some warn that it could place crypto regulation within the confines of traditional finance, ignoring its nuances. </p><h2>Microsoft’s Activision purchase may see more metaverse in the office and crypto in gaming</h2><p>Microsoft’s recently finalized buyout of Activision Blizzard — the largest acquisition in gaming history — could be the catalyst for an uptick in cryptocurrency in gaming and the expansion of the metaverse for the office. </p><p>The Redmond behemoth’s Xbox division was never really meant to be a profitable arm of the Microsoft corporation, and the $68.7 billion acquisition of Activision Blizzard demonstrates the company’s intent to bet on long-term synergy between its gaming, software and enterprise verticals. </p><p>The principal players in the buyout — Microsoft CEO Satya Nadella, Xbox boss Phil Spencer and former Activision Blizzard CEO Bobby Kotick (who will stay until the end of 2023 to help with the turnover) — have all, at one time or another, expressed a fervent interest in exploring the metaverse space.</p><p> And if leaked internal documents are to be believed, both companies (prior to the buyout) had explored the crypto gaming space and, at least at the drawing board stage, developed potential plans. </p><p>Together, these notions indicate that both Web3 and crypto <a href=\"https://cointelegraph.com/news/microsoft-activision-buy-metaverse-office-crypto-gaming\">could have a bright future</a> under the massive umbrella of Microsoft/Xbox — now the third-largest gaming outfit in the world, trailing only Tencent and Sony. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today is a good day to play. We officially welcome Activision Blizzard King to Team Xbox. Together, we’ll create stories and experiences that bring players together, in a culture empowering everyone to do their best work and celebrate diverse perspectives. <a href=\"https://t.co/KBCESknYYh\">https://t.co/KBCESknYYh</a> <a href=\"https://t.co/jTHOeH48Wx\">https://t.co/jTHOeH48Wx</a></p>&mdash; Phil Spencer (@XboxP3) <a href=\"https://twitter.com/XboxP3/status/1712816031423729991?ref_src=twsrc%5Etfw\">October 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T20:00:17.000Z",
    "title": "Nishad Singh testifies to ‘excessive’ spending at Sam Bankman-Fried’s trial",
    "url": "https://cryptoslate.com/nishad-singh-testifies-to-excessive-spending-at-sam-bankman-frieds-trial/",
    "description": "<p>Nishad Singh, the former director of engineering at FTX, testified in the case of ex-FTX CEO Sam Bankman-Fried on Oct. 16. During his testimony, Singh confessed to committing several crimes, such as fraud and campaign finance violations, which were purportedly carried out in collaboration with Bankman-Fried and others. Singh reached a plea deal with prosecutors [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nishad-singh-testifies-to-excessive-spending-at-sam-bankman-frieds-trial/\">Nishad Singh testifies to &#8216;excessive&#8217; spending at Sam Bankman-Fried&#8217;s trial</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-16T19:41:50.000Z",
    "title": "Analyst suggests false Bitcoin ETF news was market manipulation",
    "url": "https://crypto.news/analyst-suggests-false-bitcoin-etf-news-was-market-manipulation/",
    "description": "A popular crypto YouTuber known as Coin Bureau recently discussed how fake news around a Bitcoin spot ETF approval caused a pump and dump in the Bitcoin price."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T20:00:42.000Z",
    "title": "Bitcoin Bloodbath: Fake Spot ETF Approval Sparks BTC Surge, Obliterates $78M Shorts At $30,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bloodbath-fake-spot-etf-approval-sparks-btc-surge-obliterates-78m-shorts-at-30000/",
    "description": "In a flurry of market activity, false news surrounding the approval of a Bitcoin (BTC) Spot Exchange-Traded Fund (ETF) by the US Securities and Exchange Commission (SEC) sent shockwaves through the cryptocurrency community.  False Rumors of BTC Spot ETF Approval Trigger Volatility Initially reported by Cointelegraph, the news claimed that BlackRock&#8217;s iShares Bitcoin Spot ETF had received regulatory approval.  Related Reading: Elliott Wave Theory Forecasts XRP Price Of $27 By 2026: Crypto Analyst However, Bloomberg analyst James Seyffart promptly cast doubt on the report&#8217;s authenticity, stating that he could not find any confirmation of the news at the time. Seyffart stated:  I believe this to be fake news. While this would be positive for the things we&#8217;ve been saying. I can&#8217;t find anything that would confirm this at the moment.  Subsequently, BlackRock confirmed to FOX reporter Eleanor Terret that the application was still under review, rendering the initial report false. The repercussions of this misinformation were immediately evident in the market. BTC experienced a brief surge from $27,800 to $30,000 within minutes as traders reacted to the purported ETF approval news. However, as the truth emerged, the market corrected itself, causing a wave of liquidations. According to data from Glassnode, the aftermath of the surge saw a significant increase in liquidations. Within four hours, $113.75 million in long positions and $78.87 million in short positions were liquidated, reflecting the volatility and sudden reversal prompted by the false news. The incident also prompted Cointelegraph to apologize for a post that had disseminated inaccurate information regarding the BlackRock Bitcoin ETF.  The media outlet announced that an internal investigation is underway to determine the source of the misinformation. Cointelegraph stated: We apologize for a tweet that led to the dissemination of inaccurate information regarding the Blackrock Bitcoin ETF. An internal investigation is currently underway. We are committed to transparency and will share the findings of the investigation with the public once it is concluded within 3 hours. False Breakout Fails To Dampen Bitcoin Profitable Streak Despite the false breakout above $30,000, Bitcoin has retained significant profits within 24 hours. Currently trading at $28,100, it remains $1,000 higher than the initial price before disseminating the fake news across all platforms. This marks a 5.1% profit during this period. Related Reading: Litecoin At 12: How Has Its 84 Million Supply Been Distributed Over Time? Consequently, this positive turn of events has caused Bitcoin to shift from negative to positive figures across various time frames. In the past 7 days, Bitcoin has recorded a 2.6% profit, while over 30 days, it has seen a 6.4% increase. Only in the 14 days was a slight decrease of 0.4%. Furthermore, a closer examination of BTC&#8217;s 1-day chart reveals its ability to surpass significant resistance levels. Notably, Bitcoin successfully overcame two critical moving averages: the 50-day MA at $27,150 and the 200-day MA at $27,030.  These moving averages posed major obstacles for Bitcoin&#8217;s price after initially dropping below this threshold. In addition, Bitcoin managed to break through the $28,000 resistance level, which had previously acted as a significant barrier following the false breakout above this mark. Moving forward, the sustainability of Bitcoin&#8217;s current price level and bullish momentum remains to be seen amidst the circulating rumors surrounding the long-awaited ETF decision by the applicants and the US SEC. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T20:02:00.000Z",
    "title": "Bitcoin Repeats Patterns Seen in Pre-Halving Years: Analyst",
    "url": "https://coinedition.com/bitcoin-repeats-patterns-seen-in-pre-halving-years-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Recent Data Showed the Impact of Halving Events on BTC’s Returns\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Recent-Data-Showed-the-Impact-of-Halving-Events-on-BTCs-Returns-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent YouTube video, crypto analyst Benjamin Cowen said the largest cryptocurrency network, Bitcoin, is repeating patterns seen in previous pre-halving years. The analyst pointed to the historic price performance of Bitcoin to drive his point home. In particular, the analyst mentioned that Bitcoin in pre-halving years trades up in the first half of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-repeats-patterns-seen-in-pre-halving-years-analyst/\">Bitcoin Repeats Patterns Seen in Pre-Halving Years: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-16T20:00:58.000Z",
    "title": "California Governor Gavin Newsom Signs Bill To Create Regulatory Framework for Digital Assets",
    "url": "https://dailyhodl.com/2023/10/16/california-governor-gavin-newsom-signs-bill-to-create-regulatory-framework-for-digital-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Payments-Legislation-Signed.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The governor of California has signed off on a bill that aims to create a new regulatory framework for digital assets. Governor Gavin Newsom recently signed Assembly Bill 39, which establishes the Digital Financial Assets Law. The legislation requires the state&#8217;s Department of Financial Protection and Innovation (DFPI) to &#8220;create a robust regulatory framework, including [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/16/california-governor-gavin-newsom-signs-bill-to-create-regulatory-framework-for-digital-assets/\">California Governor Gavin Newsom Signs Bill To Create Regulatory Framework for Digital Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]