[
  {
    "source": "Decrypt",
    "date": "2024-01-11T23:44:12.000Z",
    "title": "These Are All the Bitcoin ETFs That Are Now Trading in the US",
    "url": "https://decrypt.co/62912/high-profile-bitcoin-etf-applications",
    "description": "Spot Bitcoin ETFs are finally trading in the United States following SEC approval. Here are all the Bitcoin ETFs you can invest in today."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-12T00:00:08.000Z",
    "title": "How Bitcoin correlates with traditional assets in the ETF age",
    "url": "https://cryptoslate.com/how-bitcoin-correlates-with-traditional-assets-in-the-etf-age/",
    "description": "<p>The integration of Bitcoin into mainstream markets took a significant leap forward with the SEC&#8217;s approval to the first spot Bitcoin ETF in the U.S. This benchmark event shows the necessity of understanding its interaction with conventional assets, especially for the traditional investor looking to diversify their portfolios. Correlation coefficients, the statistical measures reflecting the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/how-bitcoin-correlates-with-traditional-assets-in-the-etf-age/\">How Bitcoin correlates with traditional assets in the ETF age</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T00:00:53.000Z",
    "title": "Solana Poised For Major Upside: Analyst Predicts 47% Surge After Price Breakout",
    "url": "https://www.newsbtc.com/news/solana/solana-poised-for-major-upside-analyst-predicts-47-surge-after-price-breakout/",
    "description": "With the recent approval of Bitcoin exchange-traded funds (ETFs) injecting new inflows and igniting a sense of bullish sentiment in the market, Solana (SOL) is emerging as one of the top gainers in the past 24 hours.  The cryptocurrency has experienced a 4.5% surge, trading at $99, aiming to reclaim the significant $100 milestone lost during a recent deep correction. Solana Bulls Targeting $150-$165 Price Range  Solana, holding the fifth position among cryptocurrencies by market capitalization, could undergo a substantial price surge if the current upward momentum continues and successfully breaks out of its downtrend correction. Related Reading: Bitcoin ETF Approval Triggers $1.2 Billion Trading Volume And New Highs For BTC Price Renowned crypto analyst Ali Martinez suggests that Solana is breaking out from a bullish flag pattern formed on the 4-hour chart.  A sustained close above the $106 mark can trigger a remarkable 47% rally, propelling SOL towards the price range of $150 to $165. However, at the time of writing, Solana has retraced below the upper boundary of the bull flag formation, which is positioned at $103.  Nevertheless, a breakout could be imminent if the growing interest in the token persists alongside a sustained bullish momentum. This scenario would position SOL to regain its previously lost highs and set its course toward Ali Martinez&#8217;s price targets within $150 to $165. SOL Market Cap Quadruples, DeFi, And NFT Metrics Skyrocket Solana has showcased remarkable performance during the fourth quarter of 2023, positioning itself as a leader in the crypto market rally, according to a recent report by Messari.  One of the key achievements for Solana in Q4 was its notable increase in market capitalization. SOL concluded the year with a market cap of $43.8 billion, marking a staggering 423% quarter-on-quarter (QoQ) growth and an astonishing 1,106% year-on-year (YoY) increase.  This growth propelled SOL to surpass notable tokens such as ADA, USDC, and XRP in market cap, securing the 5th position among all tokens. It is worth noting that Solana began 2023 ranked 17th in market capitalization, highlighting its exponential rise in prominence. Related Reading: Top 8 Crypto Trends That Will Dominate The Market In 2024: Analyst The Solana network&#8217;s decentralized finance (DeFi) Total Value Locked (TVL) also experienced significant growth. Solana&#8217;s DeFi TVL increased by 303% QoQ and an impressive 505% YoY, reaching $1.5 billion.  The report also highlights the notable increase in DeFi volume on the Solana network. The average daily spot DEX volume experienced a staggering 1,116% QoQ growth, reaching $359 million.  Among the contributors to this growth, Orca accounted for 45% of the Q4 volumes, followed by Raydium with a 29% market share. Phoenix, a fully on-chain central limit order book, stood out by averaging over 9% of the DEX volume market share. Solana&#8217;s influence in the NFT space also saw substantial growth during Q4. The average daily NFT volume increased by 356% QoQ, reaching $4.8 million. Solana&#8217;s market share of NFT volume, excluding Bitcoin, grew from 9% to 26% QoQ, demonstrating its increasing significance in the NFT market. Featured image from Shutterstock, chart from TradingView.com"
  }
]