[
  {
    "source": "Cointelegraph",
    "date": "2024-03-16T06:07:28.000Z",
    "title": " Vanguard’s outgoing CEO sticks to anti-Bitcoin ETF stance, despite inquiries ",
    "url": "https://cointelegraph.com/news/vanguard-ceo-tim-buckley-anti-bitcoin-etf-stance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNzNkMzk2NDctNzQ3ZC00NGU2LTg0ZjktOTQzMDdkNjlhYWQzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Vanguard CEO Tim Buckley is resisting customer pressure for spot Bitcoin ETFs, despite several of the firm's competitors already offering them.</p>\n                    <p><p>Vanguard Group's CEO, Tim Buckley, has maintained his strong opposition to Bitcoin exchange-traded funds (ETF) despite facing criticism from customers and ongoing inquiries about the firm's plans to offer them.</p><p>In a recent video <a href=\"https://investor.vanguard.com/investor-resources-education/news/vanguards-perspective-on-bitcoin-etfs#modal-transcript\" target=\"_blank\" rel=\"noopener nofollow\">published</a> by Vanguard, Buckley cautioned against including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs in retirement investment plans, due to the asset's volatile nature.</p><p>Buckley also contended that Bitcoin's status as a store of value is questionable, pointing out that during the stock market crash of 2022, Bitcoin experienced a significant decline alongside it.</p><p><a href=\"https://cointelegraph.com/news/vanguard-ceo-tim-buckley-anti-bitcoin-etf-stance\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-16T06:00:20.000Z",
    "title": "Post-Halving Pressure: Marathon Digital Anticipates Bitcoin Break-Even Price Of $43,000",
    "url": "https://www.newsbtc.com/bitcoin-news/post-halving-pressure-marathon-digital-anticipates-bitcoin-break-even-price-of-43000/",
    "description": "The Bitcoin (BTC) market has been on a wild ride recently, hitting a new all-time high (ATH) before experiencing notable volatility that resulted in an 8% drop to the $65,500 level on Friday.  Meanwhile, Marathon Digital, one of the largest US-based Bitcoin mining companies, is preparing to acquire more power infrastructure and streamline operations to meet the challenges posed by a reduction in revenue due to the upcoming April halving event.  Bitcoin Miners Brace For Post-Halving Shakeout According to a Bloomberg report, Marathon Digital plans to acquire additional power infrastructure and expand its mining capacity to keep costs low and maintain profitability.  By optimizing operations and scaling up, Marathon aims to mitigate the impact of the impending revenue drop and secure wider margins in the post-halving landscape. Related Reading: Solana’s Biggest Memecoin Gains Over $680,000 In 3 Days As Investors Bet On Its Popularity Marathon Digital recently announced an agreement to purchase a 200-megawatt data center in Garden City, Texas, for over $87 million. This acquisition marks the company&#8217;s second major investment in power infrastructure after it acquired multiple sites for $179 million earlier this year.  By increasing its ownership of mining capacity infrastructure to 53%, up from a meager 3% in the previous year, Marathon is positioning itself for greater operational efficiency and cost-effectiveness, Bloomberg notes.  However, post-halving, the Bitcoin mining industry is expected to undergo significant changes, with some miners facing profitability challenges and potential exits.  Profitability Crisis Looms Marathon Digital&#8217;s CEO, Fred Thiel, highlights the impact of revenue reduction, estimating that the industry&#8217;s average break-even point will rise from around $23,000 per Bitcoin to approximately $43,000. Thiel stated: Post halving, there will be some miners to lose profitability, maybe challenged, or maybe looking for an exit as their revenues will drop because of the Bitcoin rewarded will drop. The simple math is, if the industry average break-even point was around $23,000 per Bitcoin, it will now go up to around $43,000. It is worth noting that this does not necessarily mean that Bitcoin&#8217;s price will fall to $43,000 from its current trading price of $69,300. The breakeven price refers to the price at which miners like Marathon Digital can cover their operating costs and achieve profitability. It is not directly correlated to the market price of Bitcoin. Related Reading: Crypto Pundit Says God Candle Is Imminent For This Solana-Based Meme Coin As of the time of writing, BTC is trading at $69,300 and is on the verge of reclaiming the significant milestone of $70,000. The cryptocurrency experienced a notable spike in volatility during the early hours of Friday&#8217;s trading session but has since recovered, mitigating its losses from 8% down to 2.5%. Featured image from Shutterstock, chart from TradingView.com "
  }
]