[
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T01:54:17.000Z",
    "title": "SEC lawsuits squeeze net worths of Coinbase and Binance CEOs",
    "url": "https://cointelegraph.com/news/sec-lawsuits-coinbase-binance-ceos-net-worths",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/11eea73f-421d-4377-84da-c40e72f96d51.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Brian Armstrong and CZ have seen respective net worth losses of 11.8% and 5.1% since the SEC sued Coinbase and Binance.</p>\n                    <p><p>The net worths of Coinbase CEO Brian Armstrong and Binance CEO Changpeng Zhao (CZ) have suffered heavy blows due to recent lawsuits by the United States securities regulator. </p><p>Armstrong’s net worth was slashed by $289 million and Zhao’s by $1.33 billion within a span of 30 hours after the Securities Exchange Commission (SEC) sued <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Binance on June 5</a> and then <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase on June 6</a>, according to <a href=\"https://www.bloomberg.com/billionaires/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from the Bloomberg Billionaires Index and Forbes.</p><p>Zhao — the richest man in the crypto industry and the 54th richest person overall — had his net worth <a href=\"https://www.bloomberg.com/billionaires/profiles/changpeng-zhao/\" target=\"_blank\" rel=\"noopener nofollow\">fall</a> 5.1% to $26 billion this week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2e35df0b-1251-476e-a8bc-7afaa2991a37.png\"  /><figcaption style=\"text-align: center;\"><em>The SEC’s lawsuit against Binance has contributed to Zhao falling two spots in Bloomberg's Billionaire Index. Source: Bloomberg</em></figcaption></figure><p>While the Binance CEO’s net worth has rebounded by over 106% this year, he is still down over 73% from his highest net worth of $96.9 billion in January 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d861df79-7769-4df8-a2bb-9d8e976151f3.png\"  /><figcaption style=\"text-align: center;\"><em>Zhao’s net worth has fallen from nearly $100 billion to $26 billion since January 2022. Source: Bloomberg </em></figcaption></figure><p>Armstrong is <a href=\"https://www.forbes.com/profile/brian-armstrong/\" target=\"_blank\" rel=\"noopener nofollow\">ranked</a> as the 1,409th richest person by Forbes and took the bigger hit from the SEC’s latest action with his net worth falling 11.8% to $2.2 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f93608c6-7f2a-4b54-b02b-fca2af0b9036.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Change in net worth of Brian Armstrong since 2019. Source: Forbes</em></figcaption></figure><p>The Coinbase CEO has managed to reap the rewards of a market rebound this year, with a 61% increase in net worth over that time.</p><p>Despite the recent fall, Zhao and Armstrong have seen net worth increases well above the 9% year-to-date returns for others on Bloomberg's rich list.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sec-files-motion-for-restraining-order-against-binance\"><strong>SEC files motion for restraining order against Binance</strong></a></p><p>The SEC sued both Binance and Coinbase alleging the exchanges broke various securities rules, most notably for purportedly offering cryptocurrencies that the regulator considers to be unregistered securities. </p><p>Following the suites, a total of <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">67 cryptocurrencies have now been classed as securities</a> by the SEC.</p><p>Binance and <a href=\"https://cointelegraph.com/news/coinbase-reminds-world-it-tried-to-embrace-regulation-as-sec-sues-for-violations\">Coinbase have both confirmed</a> they will “vigorously” defend the lawsuits laid against them.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T02:00:00.000Z",
    "title": "The Rise of Meme Tokens and How They're Driving Exchanges to Embrace Unconventional Trends ",
    "url": "https://cryptodaily.co.uk/2023/06/the-rise-of-meme-tokens-and-how-theyre-driving-exchanges-to-embrace-unconventional-trends",
    "description": "<p>Meme coins have experienced an unprecedented rise in interest and value. With exuberant community support, meme coins are largely associated with meme images, cartoon characters, and animals. Dogecoin, SHIBA INU, and the recent Pepecoin ($PEPE) are a few of the top-selling meme coins in the crypto space. These coins have gained thousands in price surges in the shortest period. Offering investors ample opportunities to make significant profits based on a small investment.&nbsp;</p>\n<p>The trending meme coin, $PEPE, barely a month after its release, reached a whopping $1.5 billion in market cap. And a Spot Trading volume exceeding $2.7 billion. This value, according to various reports, rivaled Bitcoin&rsquo;s Spot Trading on the top crypto exchanges within the same timeframe. A testament to these coins&rsquo; ability to generate gargantuan returns for investors.&nbsp;</p>\n<p>$PEPE&rsquo;s initial price at the time of launch was a mere $0.000000001 and with a total token supply of over 420 trillion. Since listing on top exchanges, the meme coin experienced a price surge of over 3000%. While it has suffered countless sell-offs from early investors looking to make huge profits, Pepecoin is still ranked as one of the top 100 coins (number 78) based on market cap, per CoinMarketCap. Again, substantial proof of its unprompted leap in price in the shortest time possible.&nbsp;</p>\nThe Role of Exchanges and How Early Listing Impact Investors&rsquo; Returns&nbsp;\n<p>Crypto exchanges enable the seamless purchase of Bitcoin, altcoins, and meme coins alike. They are committed to providing customers with the hottest coins on the market, allowing them to become early investors. Now, why crypto exchanges are core components of the industry, obviously, their effect on the market continues to grow daily, partly a work of meme coins. How?&nbsp;</p>\n<p>These crypto exchanges understand the influence meme coins have on the market and investors. Hence why they are constantly on the lookout for the next hot project.&nbsp;</p>\n<p>To better understand the impact of early listing and how these exchanges actively influence investors&rsquo; returns, we&rsquo;ll use $PEPE and LBank, and other exchanges as examples.&nbsp;</p>\n<p>Via LBank&rsquo;s Articles Section, the global crypto exchange announced its decision to list the newly launched meme coin, $PEPE on its platform. Per the source above, the listing was scheduled for April 18, 2023, at 8 AM (UTC). LBank claimed the meme coin was a feasible, high-quality coin for its users. 12 days later, OKX Exchange announced its decision to list $PEPE. The result? An 850% surge in price. LBank users enjoyed a whopping 850% increase in their investment. Bitget Exchange also listed $PEPE the same day as LBank and since then (until the time of writing) has raked in returns exceeding a 5346% increase in price for investors. Substantial proof of early listing&rsquo;s impact on investments.&nbsp;</p>\n<p>Besides $PEPE, the listing of emerging meme coins like $PSYOP, $GEN, $SPONGE, $AIDOGE, $BEN, and $RFD further shows the role exchanges play in price surges. According to available market data, LBank, MEXC, and HUOBI are at the forefront of early token listings. For the previously mentioned emerging meme coins, LBank was the first to list 5 out of the 6 tokens&mdash;$BEN, $PSYOP, $RFD, $GEN, and $SPONGE. With MEXC Exchange listing $AIDOGE first and HUOBI following behind. In line with this data, LBank also recorded the highest gains for these meme coins, except for $AIDOGE and $BEN where MEXC recorded the highest gains.&nbsp;</p>\nLBank Exchange:&nbsp;\n<ul>\n<li>$PEPE; 6387%&nbsp;</li>\n<li>$AIDOGE; 19364%&nbsp;</li>\n<li>$BEN; 313%&nbsp;</li>\n<li>$PSYOP; 433%&nbsp;</li>\n<li>$RFD; 216%&nbsp;</li>\n<li>$SPONGE; 296%&nbsp;</li>\n<li>$GEN; 716%&nbsp;</li>\n</ul>\nMEXC Exchange&nbsp;\n<ul>\n<li>$PEPE; 2259%&nbsp;</li>\n<li>$AIDOGE; 70429%&nbsp;</li>\n<li>$BEN; 353%&nbsp;</li>\n<li>$PSYOP; 0%&nbsp;</li>\n<li>$RFD; 138%&nbsp;</li>\n<li>$SPONGE; 0%&nbsp;</li>\n<li>$GEN; None&nbsp;</li>\n</ul>\n<p>HUOBI and Gate.io recorded impressive gains&mdash;2710% and 2324%, respectively&mdash;for $PEPE. However, listing a day after LBank and Bitget cost their users over 2300% value increases on their investments.</p>\nHow Meme Coins are Driving Unconventional Innovation&nbsp;&nbsp;\n<p>As these crypto exchanges compete against themselves by constantly searching for potentially hot coins, one thing stands out&mdash;their willingness to openly embrace unconventional projects. By actively seeking out new projects to list, crypto exchanges show their commitment to supporting peculiar projects. Although meme coins are loosely based on famous memes, animals, or characters, they have become an avenue for experimentation in the web3 space.&nbsp;</p>\n<p>Meme coins are continually pushing the boundaries of conventional investments and attracting a diverse audience. Comprising a community of exuberant individuals committed to contributing to the growth of a project. By fervently seeking the next big meme coin, exchanges are encouraging developers to keep experimenting and launching unique projects. Additionally, the rise of these meme coins is proof of the impact of the internet and meme culture.&nbsp;</p>\n<p>Memes have become a huge part of the internet and social media experience. And by listing meme-based coins, exchanges are tapping into a potentially replete environment with millions of global supporters waiting to be onboarded. Speaking about these meme coins and how they're opening doors for mass adoption, Johnasson Chen, co-founder of LBank reiterates that the pursuit of meme coins contributes to the resilience and diversity of the emerging web3 ecosystem.&nbsp;</p>\n\n<p>&ldquo;Staying on top of the market for memes is crucial to delivering top-notch investments to our users as early as possible. The pursuit of meme coins also contributes to the overall diversity and resilience of the Web3 ecosystem. The inclusion of such coins alongside more established cryptocurrencies fosters a healthy balance between established projects and innovative newcomers, allowing for a continuous cycle of disruption and growth,&rdquo; the co-founder said.&nbsp;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  }
]