[
  {
    "source": "CoinDesk",
    "date": "2023-07-06T16:11:44.000Z",
    "title": "Big Banks, NY Fed’s Innovation Group See Merit in Digital Ledgers for Global Payments",
    "url": "https://www.coindesk.com/policy/2023/07/06/big-banks-ny-feds-innovation-group-see-merit-in-digital-ledgers-for-global-payments/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Citigroup Inc., HSBC, BNY Mellon and other global financial giants have been experimenting with what they call a “regulated liability network” for conducting round-the-clock, wholesale payments using shared ledgers, and a paper released Thursday suggests the system has potential."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-06T16:31:25.000Z",
    "title": "Taylor Swift and Crypto: Sam Bankman-Fried Walked Away from FTX Deal",
    "url": "https://cryptobriefing.com/taylor-swift-unraveled-100-million-ftx-deal/?utm_source=feed&utm_medium=rss",
    "description": "A partnership worth as much as $100 million was proposed between global pop star Taylor Swift and FTX, the now bankrupt cryptocurrency exchange, only to be shelved by FTX founder..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T16:30:00.000Z",
    "title": "Bitcoin Price Analysis:  31525 Peak Then Volatility - 7 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-31525-peak-then-volatility-7-july-2023",
    "description": "<p>BTC/USD Bulls Stampede to 31525 Before Volatility:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 7 July 2023</p>\n<p>Bitcoin (BTC/USD) attempted to retain recent strong advances early in the Asian session as the pair was lifted to the 31525.10 area, a fresh twelve-month high, after Stops were elected above the 31443.67 area that had represented a recently-established yearly high.&nbsp; Buying pressure emerged around the 30328.79 area and follow-on technical activity around the 30439.66 and 30575.66 areas accelerated the move.&nbsp; &nbsp;During a volatile pullback, buying pressure initially emerged around the 31828 level, a move lower to test the 38.2% retracement of the recent appreciating range from 30189.56 to 31525.10.&nbsp; Stops were eventually elected below the 31014, 30857, and 30699 areas during the eventual profit-taking depreciation, and additional downside retracement levels include the 30504 and 30475 areas.</p>\n<p>Above the market, additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.&nbsp; Following recent activity, areas of potential technical support and buying pressure include the 29863, 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30604.81 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30714.61.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T16:31:00.000Z",
    "title": "Fidelity’s epic move: $13.2b mutual funds for ETFs",
    "url": "https://www.cryptopolitan.com/fidelitys-move-13-2b-mutual-funds-for-etfs/",
    "description": "In a landmark move that echoes the larger currents of change sweeping the investment industry, Fidelity, the financial behemoth, is set to translate a sizable portion of its mutual funds assets—$13.2 billion to be precise—into Exchange Traded Funds (ETFs). This shift, slated for November this year, signals a visionary approach from Fidelity, one that could ... <a title=\"Fidelity&#8217;s epic move: $13.2b mutual funds for ETFs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fidelitys-move-13-2b-mutual-funds-for-etfs/\" aria-label=\"More on Fidelity&#8217;s epic move: $13.2b mutual funds for ETFs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T16:26:28.000Z",
    "title": "The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?",
    "url": "https://www.cryptopolitan.com/the-sandbox-price-predictions/",
    "description": "The Sandbox Price Prediction 2023-2032 If you&#8217;re into crypto games, SAND will be familiar to you, and The Sandbox Price Prediction will prove helpful. The new virtual universe inspired by Metaverse gaming firm The Sandbox has opened toward NFT auctions, where several pieces have been sold, including the mega yacht. According to announcements from the ... <a title=\"The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-sandbox-price-predictions/\" aria-label=\"More on The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T16:22:47.000Z",
    "title": "Asian chipmakers’ nightmare is China’s export curbs",
    "url": "https://www.cryptopolitan.com/asia-chipmakers-nightmare-china-export-curbs/",
    "description": "A sinister specter is looming over Asia&#8217;s technological landscape. The region, renowned as a powerhouse for global chip production, now faces a new challenge that threatens to unhinge its dominance: China&#8217;s export restrictions. Chinese trade policies, particularly those regarding crucial chip materials like gallium and germanium, are sending tremors throughout the Asian semiconductor industry. A ... <a title=\"Asian chipmakers&#8217; nightmare is China&#8217;s export curbs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/asia-chipmakers-nightmare-china-export-curbs/\" aria-label=\"More on Asian chipmakers&#8217; nightmare is China&#8217;s export curbs\">Read more</a>"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-07-06T16:27:32.000Z",
    "title": "Deposits and withdrawals for Aventus (AVT) starts now!",
    "url": "https://blog.kraken.com/deposits-and-withdrawals-for-aventus-avt-starts-now",
    "description": "We’re thrilled to announce that Kraken now supports Aventus (AVT)! Funding Funding is live. You can add AVT to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. Please note, trading for AVT tokens is not supported. Already have AVT and a Kraken account? Click below to get started ⤵️ Deposit [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T16:30:12.000Z",
    "title": "CFTC Investigators Conclude Celsius And Former CEO Violated Rules, Potential Case Looms",
    "url": "https://www.newsbtc.com/crypto/cftc-investigators-conclude-celsius-violated-rules/",
    "description": "The Commodity Futures Trading Commission (CFTC) has concluded its investigation into bankrupt crypto lender Celsius and its former CEO, Alex Mashinsky, and found that they violated United States rules, according to sources familiar with the matter.  The investigation, conducted by attorneys in the CFTC&#8217;s enforcement unit, revealed that Celsius misled investors and failed to register with the regulatory body. If the majority of the CFTC&#8217;s commissioners agree with these findings, the agency could file a case in federal court as early as this month. Celsius Reportedly Misled Investors, Lack Of Registration Surfaces  The findings of the investigation shed light on the actions of Celsius and its former CEO, raising questions about their compliance with regulatory requirements. It is alleged that Celsius engaged in deceptive practices and failed to provide accurate information to investors. Related Reading: Valkyrie Follows In BlackRock’s Footsteps, Refiles For Spot Bitcoin ETF By misleading investors, the lending platform potentially put their funds at risk and undermined market transparency. Furthermore, the failure to register with the CFTC raises concerns about the company&#8217;s adherence to regulatory oversight. The independent examiner appointed during Celsius&#8217; bankruptcy case further shed light on the company&#8217;s operations. The examiner found that Celsius had operated in a manner similar to a Ponzi scheme, which raised concerns about the company&#8217;s business practices and its impact on investors. This finding adds weight to the allegations against Celsius and strengthens the case for regulatory action. CEL token struggles at $0.15 &#124; Source: CELUSD on TradingView.com The potential case against Celsius and its ex-CEO has significant implications for the crypto industry and regulatory enforcement. If the CFTC proceeds with the lawsuit, it would signal a strong stance on holding companies accountable for their actions and ensuring investor protection in the cryptocurrency market. When Celsius filed for voluntary bankruptcy in July 2022, the lending company reportedly owed between $1 billion and $10 billion to creditors. The case is currently ongoing at the United States Bankruptcy Court for the Southern District of New York. Implications For The Crypto Industry And Regulatory Enforcement The allegations against Celsius and its former CEO highlight the need for increased regulatory scrutiny and oversight in the crypto sector. As the market continues to grow and attract more participants, it is crucial to establish clear guidelines and enforce compliance to protect investors and maintain market integrity. Related Reading: Analyst Says XRP Will Reach $100, Here’s Why Nevertheless,  the potential case against Celsius demonstrates the commitment of regulatory authorities to uphold these standards and address violations that occur within the industry. This case could serve as a precedent for future enforcement actions, shaping the regulatory landscape for the industry as a whole. Featured image from IQ.Wiki, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-06T16:22:00.000Z",
    "title": "Selling Pressure Threatens Bitcoin Support Levels Following FOMC Meeting",
    "url": "https://coinedition.com/selling-pressure-threatens-bitcoin-support-levels-following-fomc-meeting/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/BTC-91.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/BTC-91.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/BTC-91-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin has encountered an unexpected surge in selling pressure following the latest release of the United States Federal Open Market Committee (FOMC) meeting minutes. While most officials agreed to maintain the current interest rates, a few suggested a slight increase of 25 basis points. Looking ahead to 2023, most of the committee expects further rate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/selling-pressure-threatens-bitcoin-support-levels-following-fomc-meeting/\">Selling Pressure Threatens Bitcoin Support Levels Following FOMC Meeting</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]