[
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T00:01:26.000Z",
    "title": "Kinetix eyes GMX’s path, aims to revolutionize Kava Chain with perpetual swaps",
    "url": "https://cryptoslate.com/kinetix-eyes-gmxs-path-aims-to-revolutionize-kava-chain-with-perpetual-swaps/",
    "description": "<p>GMX launched in early September 2021 as a decentralized perpetual exchange offering swaps and leverage trading and it made a big splash in the DeFi community. If you haven&#8217;t heard about GMX, let&#8217;s get you up to speed: GMX&#8217;s launch on Arbitrum was seen as a major DeFi milestone. Aside from proving Arbitrum as an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kinetix-eyes-gmxs-path-aims-to-revolutionize-kava-chain-with-perpetual-swaps/\">Kinetix eyes GMX&#8217;s path, aims to revolutionize Kava Chain with perpetual swaps</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T00:00:59.000Z",
    "title": "Circle’s USDC will launch natively on Optimism, Coinbase’s Base next week",
    "url": "https://cryptoslate.com/circles-usdc-will-launch-natively-on-optimism-coinbases-base-next-week/",
    "description": "<p>The major stablecoin company Circle said it will launch its USDC stablecoin natively on two blockchains in the first week of September. The company said on Aug. 30 that it will launch USDC on Optimism&#8217;s OP Mainnet. It said that this new, native version of USDC will gradually replace OP Mainnet&#8217;s current version of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circles-usdc-will-launch-natively-on-optimism-coinbases-base-next-week/\">Circle&#8217;s USDC will launch natively on Optimism, Coinbase&#8217;s Base next week</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T00:00:44.000Z",
    "title": "Experts say Coinbase is about to suffer because of Bitcoin",
    "url": "https://www.cryptopolitan.com/experts-coinbase-to-suffer-cause-of-bitcoin/",
    "description": "While the cryptocurrency world rejoices over Bitcoin&#8217;s recent win with Grayscale&#8217;s court victory against the SEC, skeptics scrutinize the after-effects this could have on Coinbase, America&#8217;s premier crypto exchange. As the financial tides shift, these experts are sounding the alarm, warning of potential challenges that may loom for the leading exchange. Coinbase’s Potential Hurdle: A ... <a title=\"Experts say Coinbase is about to suffer because of Bitcoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/experts-coinbase-to-suffer-cause-of-bitcoin/\" aria-label=\"More on Experts say Coinbase is about to suffer because of Bitcoin\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T00:00:43.000Z",
    "title": "Cardano (ADA) Price Nears A Pivotal Shift – A Breach Into The $0.3 Level?",
    "url": "https://www.newsbtc.com/news/cardano-ada-price-nears-a-pivotal-shift-a-breach-into-the-0-3-level/",
    "description": "Cardano (ADA) enthusiasts are eagerly watching the charts as the cryptocurrency&#8217;s price forms a distinctive triangle pattern, suggesting an imminent breakout that could mark a significant shift in its trajectory.  This technical formation occurs when the price fluctuations of an asset are confined within converging trendlines, creating a triangle-like shape on the chart. Traders interpret this pattern as a period of consolidation, often preceding a substantial price movement. As Cardano&#8217;s price coils within the confines of the triangle pattern, traders are bracing for a potential decisive breakout in the days to come. The prevailing trend, in this case, supports the notion of a likely price ascent, and that is to make it to the $0.3 region. Related Reading: Bitcoin Cash (BCH) Records Surprising 15% Rally – What’s Behind It? However, market sentiment hints at the possibility of sellers breaching the bottom trendline, leading to an extension of the ongoing corrective trend. A report suggests that a retreat below the pattern&#8217;s support trendline might trigger an approximate 8.5% downturn. Current Scenario And ADA Price Analysis At present, Cardano&#8217;s price stands at $0.265, as reported by CoinGecko. The cryptocurrency has experienced a modest 1.2% gain over the past 24 hours and a 3.0% increase in value over the course of the last week. Nevertheless, the current triangle pattern indicates that these gains might be overshadowed by a potentially more significant movement. As of today, the market cap of ADA stood at $9.2 billion. Chart: TradingView.com Reflecting on its history, Cardano reached its all-time high price of $3.09 on Sept. 2, 2021, accompanied by a market cap of around $95 billion on the same day. Notably, a separate report underscores the consistent need for increased demand for Cardano in order to align with its historical price levels.  This necessity arises due to the cryptocurrency&#8217;s unique monetary expansion model, which introduces a fixed rate of 0.3% every five days for circulating the remaining tokens from the &#8216;reserve.&#8217; This approach effectively curtails the rate at which ADA is injected into the supply over time. Future Possibilities And Investor Prospects Analysts speculate that the current ADA price could potentially present an opportunity for investors to secure substantial gains, if the layer-1 blockchain manages to match its previous demand. This projection rests on the assumption that historical demand for ADA could surge once again. Related Reading: Lido (LDO) Price Inks Gains Alongside TVL Rise – What Traders Should Expect As Cardano&#8217;s price tightens within the triangle pattern, market participants hold their breath for the anticipated breakout. Traders remain cautious, aware that a breach below the pattern&#8217;s support trendline could lead to a notable downward movement. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from FX Empire"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-31T00:00:29.000Z",
    "title": "1inch Investment Fund Abruptly Accumulates $10,000,000 in Ethereum Amid Market Downturn: On-Chain Data",
    "url": "https://dailyhodl.com/2023/08/30/1inch-investment-fund-abruptly-accumulates-10000000-in-ethereum-amid-market-downturn-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/fund-amid-doldrums-data.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A blockchain tracker finds that the investment fund associated with the decentralized exchange (DEX) aggregator 1inch (1INCH) abruptly accumulated $10 million worth of Ethereum (ETH) over the weekend. Blockchain tracker Lookonchain notes that the 1inch investment fund wallet also bought a total of 17,000 ETH worth $26.8 million at an average price of $1,569 across [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/30/1inch-investment-fund-abruptly-accumulates-10000000-in-ethereum-amid-market-downturn-on-chain-data/\">1inch Investment Fund Abruptly Accumulates $10,000,000 in Ethereum Amid Market Downturn: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]