[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T20:27:44.000Z",
    "title": "Binance Lawsuit Could Be ‘Huge Mistake’ or Bring Needed Clarity to U.S. Crypto Industry",
    "url": "https://www.coindesk.com/policy/2023/06/05/binance-lawsuit-could-be-huge-mistake-or-bring-needed-clarity-to-us-crypto-industry/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Securities and Exchanges Commission’s (SEC) suit against the biggest crypto exchange in the world, Binance, could be a huge misstep if other countries allow the crypto industry to develop and it eventually replaces the traditional banking sector, Jim Bianco, president and founder of Bianco Research said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-05T20:21:51.000Z",
    "title": "BNB, CAKE Plummet Following SEC Crackdown on Binance",
    "url": "https://www.coindesk.com/markets/2023/06/05/bnb-cake-plummet-following-sec-crackdown-on-binance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Both are significant tokens in the Binance ecosystem and had their prices drop by more than 8%."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-05T20:20:35.000Z",
    "title": "Binance Condemns SEC’s ‘Blunt Weapons of Enforcement’",
    "url": "https://decrypt.co/143476/binance-condemns-secs-blunt-weapons-of-enforcement",
    "description": "The world’s biggest cryptocurrency exchange is “disheartened” by the American regulator’s latest action."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-05T20:12:14.000Z",
    "title": "SEC Quietly Removes Director William Hinman's Bio From Website",
    "url": "https://decrypt.co/143450/sec-removes-director-william-hinmans-bio",
    "description": "Hinman worked at the commission from May 2017 through December 2020. That's it. That's the whole bio after the SEC updated the page."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T20:30:00.000Z",
    "title": "How regulators are mitigating the risk of extinction from AI: Law Decoded, May 29–June 5 ",
    "url": "https://cointelegraph.com/news/how-regulators-are-mitigating-the-risk-of-extinction-from-ai-law-decoded-may-29-june-5",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cc4f3469-8b68-4fab-958a-a8cca20d6cf2.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>There is no shortage of regulatory efforts to mitigate the negative impacts of artificial intelligence.</p>\n                    <p><p>The lively discussion around artificial intelligence (AI) continues. Last week, dozens of AI experts — including the CEOs of OpenAI, Google DeepMind and Anthropic — signed an open statement <a href=\"https://cointelegraph.com/news/ai-experts-sign-doc-comparing-risk-of-extinction-from-ai-to-pandemics-nuclear-war\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ai-experts-sign-doc-comparing-risk-of-extinction-from-ai-to-pandemics-nuclear-war/amp\">with a single sentence</a>: “Mitigating the risk of extinction from AI should be a global priority alongside other societal-scale risks such as pandemics and nuclear war.”</p><p>Despite the ominous statement, there is no shortage of regulatory efforts to mitigate the negative impacts of AI. In China, the “improvement of governance” in digital data and AI is being discussed by President Xi Jinping and prominent <a href=\"https://cointelegraph.com/news/chinese-officials-issue-warning-about-ai-and-national-security\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/chinese-officials-issue-warning-about-ai-and-national-security/amp\">members of the Communist party</a>. The Australian government has announced a sudden eight-week consultation that will seek to understand whether any “high-risk” AI tools <a href=\"https://cointelegraph.com/news/australia-consultation-high-risk-ai-ban\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/australia-consultation-high-risk-ai-ban/amp\">should be banned</a>.</p><p>Italian Senator Marco Lombardo found a creative way to join the discussion by performing a <a href=\"https://cointelegraph.com/news/italian-senator-provokes-parliament-with-ai-generated-speech\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/italian-senator-provokes-parliament-with-ai-generated-speech/amp\">speech entirely composed</a> by OpenAI’s ChatGPT-4. He also trained the chatbot with the draft law of the Italian-Swiss agreement on cross-border workers, which was the topic of the meeting, along with other recent developments on the subject.</p><p>In Japan, the government’s AI strategy council blows the whistle on the <a href=\"https://cointelegraph.com/news/japan-council-concern-ai-trained-copyright-material\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/japan-council-concern-ai-trained-copyright-material/amp\">lack of laws protecting copyright</a> from AI. The Personal Information Protection Commission has demanded OpenAI minimize the sensitive data it collects for machine learning purposes. Previously, <a href=\"https://cointelegraph.com/news/openai-finds-fresh-support-from-japan-amid-global-country-wide-bans\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/openai-finds-fresh-support-from-japan-amid-global-country-wide-bans/amp\">local politicians voiced support for AI</a>, with Chief Cabinet Secretary Hirokazu Matsuno even saying Japan would consider incorporating AI technology into government systems.</p><h3>CNHC stablecoin issuer detained by Chinese police</h3><p>Employees of Trust Reserve — the issuer of the Chinese yuan-pegged stablecoin CNH Coin (CNHC) — have been detained by Chinese police. The company’s office in Pudong, Shanghai, was empty as of May 31. The door was sealed on May 29, with a notice saying, “Judicial seizure, strictly no vandalism.” In March, Trust Reserve <a href=\"https://cointelegraph.com/news/kucoin-leads-10m-funding-for-chinese-yuan-stablecoin-issuer\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kucoin-leads-10m-funding-for-chinese-yuan-stablecoin-issuer/amp\">secured $10 million in funding</a> in a round led by KuCoin Ventures, the venture capital arm of the major cryptocurrency exchange. </p><p><a href=\"https://cointelegraph.com/news/cnhc-stablecoin-issuer-detained-by-chinese-police-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cnhc-stablecoin-issuer-detained-by-chinese-police-report/amp\">Continue reading</a> </p><h3>Binance to delist privacy tokens in France, Italy, Spain and Poland</h3><p>Starting from June 26, privacy tokens, such as Monero (<a href=\"https://cointelegraph.com/xmr-price-index\">XMR</a>) and Zcash (<a href=\"https://cointelegraph.com/zec-price-index\">ZEC</a>), will no longer be available for trading for Binance customers in France, Italy, Poland and Spain. The new restrictions affect a total of 12 coins: Decred (DCR), Dash (<a href=\"https://cointelegraph.com/dash-price-index\">DASH</a>), ZEC, Horizen (ZEN), PIVX (PIVX), Navcoin (NAV), Secret (SCRT), Verge (XVG), Firo (FIRO), Beam (BEAM), XMR and MobileCoin (MOB). </p><p>The move comes as part of ongoing compliance processes within the company. “While we aim to support as many quality projects as possible, we are required to follow local laws and regulations regarding the trading of privacy coins to ensure we can continue to serve as many users as we can,” a Binance representative told Cointelegraph. </p><p><a href=\"https://cointelegraph.com/news/binance-to-delist-privacy-tokens-in-france-italy-spain-and-poland\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-to-delist-privacy-tokens-in-france-italy-spain-and-poland/amp\">Continue reading</a></p><h3>EU officials sign MiCA into law</h3><p>Sweden’s minister for rural affairs, Peter Kullgren, and European Parliament President Roberta Metsola signed the long-anticipated Markets in Crypto-Assets (MiCA) cryptocurrency regulatory framework into law roughly three years after the European Commission introduced the measure. The framework is <a href=\"https://cointelegraph.com/news/industry-leaders-and-policymakers-react-to-passage-of-mica-in-eu\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/industry-leaders-and-policymakers-react-to-passage-of-mica-in-eu/amp\">expected to come into effect</a> following publication in the Official Journal of the European Union, with many of MiCA’s regulations on crypto firms likely starting sometime in 2024.</p><p><a href=\"https://cointelegraph.com/news/eu-officials-sign-markets-in-crypto-assets-framework-into-law\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/eu-officials-sign-markets-in-crypto-assets-framework-into-law/amp\">Continue reading</a></p><h3>US lawmakers aim to limit the SEC’s power with a new bill </h3><p>Lawmakers in the United States House Financial Services Committee and House Agriculture Committee have released a draft discussion offering certain crypto assets a pathway to being labeled digital commodities. The draft bill would prohibit the U.S. Securities and Exchange Commission (SEC) from denying digital asset trading platforms from registering as a regulated alternative trading system, allowing such firms to offer “digital commodities and payment stablecoins.”</p><p>Specifically, the proposed legislation <a href=\"https://cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security/amp\">cracks down on the SEC’s approach</a>, which many in the crypto space have criticized. The framework under the bill would allow certain digital assets to qualify as digital commodities if they are “functional and considered decentralized,” and would require the SEC to provide a “detailed analysis” of any objections to a classification of a firm as decentralized.</p><p><a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec/amp\">Continue reading</a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T20:21:16.000Z",
    "title": "Price analysis 6/5: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, MATIC",
    "url": "https://cointelegraph.com/news/price-analysis-6-5-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9b6d4e3d-eaca-4c84-a2d6-b6bad0a5210b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and several altcoins took a beating on reports that the SEC filed a suit against Binance in the United States District Court.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and altcoins witnessed a sharp sell-off on the news that the United States Securities and Exchange Commission (SEC) had <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed a suit against Binance</a> in U.S. courts for unregistered securities operations.</p><p>This lawsuit could delay the recovery in Bitcoin and most major altcoins as traders could prefer to remain on the sidelines for a few days until some clarity emerges. Another upcoming event that could keep the investors at bay is the Federal Reserve’s meeting on June 14.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6f24bf26-3955-4cf1-9dcd-727f7e18e61f.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Although the short-term picture is uncertain, Glassnode data shows that the largest cohort of Bitcoin whales, owning at least 10,000 Bitcoin, <a href=\"https://cointelegraph.com/news/31k-was-not-the-end-5-things-to-know-in-bitcoin-this-week\">has been on an accumulation spree</a> for the past few days. On the other hand, all the other major cohorts have been in a distribution phase.</p><p>What are the important support levels that could start a recovery in Bitcoin and the major altcoins? Let’s study the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index (SPX) broke and closed above the overhead resistance of 4,200 on May 26, completing the bullish ascending triangle pattern.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b9d6ab87-42fd-4950-9351-0f8eee86b8dd.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: TradingView</em></figcaption></figure><p>The bears tried to trap the aggressive bulls on May 30 and May 31 but the bulls aggressively purchased the dip to the 20-day exponential moving average (4,183). The up-move resumed on June 1 and the bulls built upon it on June 2.</p><p>There is a minor resistance at 4,325 where the bears will try to stall the rally. On the way down, if bulls do not allow the price to slide below 4,200, it will enhance the prospects of an up-move to the 4,500 to 4,600 zone.</p><p>Contrary to this assumption, if the price turns down and breaks below the 50-day simple moving average (4,128) it will suggest that the recent breakout may have been a bull trap. The index may then dive to the uptrend line.</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index (DXY) rebounded off the 20-day EMA (103) on June 2, indicating that the sentiment has turned positive and bulls are buying the dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/74c645f3-9c77-4f59-b702-090c44fcb7ab.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will try to push the price above the immediate resistance at 104.70. If they succeed, the index could reach the overhead level of 106. This is an important level to watch for because a break above it could start a new up-move.</p><p>If the price turns down from 106 and breaks below the 20-day EMA, it will suggest that the index may extend its stay inside the range for a few more days. The bears will have to pull the price below 100.82 to complete the bearish head and shoulders pattern.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has been trading inside the descending channel pattern for the past several days. The bulls pushed Bitcoin above the 20-day EMA ($27,083) on June 4 but the long wick on the candlestick shows that the bears sold the rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7b084194-8903-42e7-8776-8e9aae714789.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price turned down on June 5 and plummeted below the immediate support at $26,500. The selling picked up momentum and the BTC/USDT pair dropped into the crucial support zone between $25,800 and $25,250. </p><p>Buyers are expected to guard this zone with all their might because a break below it may result in long liquidation. The pair could then descend toward $20,000.</p><p>The first of strength will be a break and close above the descending channel. That could indicate the end of the corrective phase. The pair may then soar to $31,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) broke above the falling wedge pattern on May 28 and successfully held the retest on June 1 but the bulls failed to start a new up-move.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d288a2e9-b096-4527-a90a-55a1c1af2efc.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>This gave an opportunity to the bears to make a comeback. Sellers tugged the price below the moving averages on June 5, which accelerated the selling. The ETH/USDT pair tumbled below the resistance line of the wedge pattern. If this level fails to hold, the next stop could be $1,740 and then the support line.</p><p>This negative view will invalidate in the near term if the price turns up and breaks above $1,928. The pair could then surge to $2,000 and eventually to $2,200 where the bears may again mount a strong defense.</p><h2>BNB price analysis</h2><p>BNB’s (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) narrow range trading resolved to the downside on June 5. The sharp selling pulled the price below $300 and the next support at $280.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b06fad3b-965e-4760-bc7b-22f8061d1f2d.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The BNB/USDT pair could drop to $265 which is an important level to keep an eye on. If the price turns up from $265 and rises above $280, it will indicate strong buying at lower levels. The pair may then rise to the 20-day EMA ($306) where the bulls are likely to encounter aggressive selling by the bears.</p><p>On the downside, a break and close below the $265 support could start a new downtrend. The pair may plunge to $240 and then to $220.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) has been oscillating inside a large range between $0.56 and $0.30 for the past several months. Generally, in such a well-defined range, traders buy at the support and sell close to the overhead resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4cdfec67-a8ef-4414-99ca-f147b8e0c584.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The XRP/USDT pair turned down from the overhead resistance on June 4, indicating profit-booking by the bulls and short positions by the aggressive bears. </p><p>If the price turns up from the 20-day EMA ($0.49), it will suggest that the sentiment has turned positive and traders are buying on dips. The bulls will then make one more attempt to clear the overhead hurdle.</p><p>Alternatively, if the price dips below the moving averages, it will suggest that the pair may remain stuck inside the range for a while longer.</p><h2>Cardano price analysis </h2><p>The long wick on Cardano’s (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) June 4 candlestick shows that the bears successfully halted the relief rally at the 50-day SMA ($0.38).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f4cc80ea-f2c7-48dd-a0ea-ebbda6fb63a8.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The ADA/USDT pair turned down sharply on June 5 and plummeted below the uptrend line of the ascending channel pattern. This move invalidated the bullish setup and the pair may next descend toward the critical support at $0.30.</p><p>If bulls want to prevent the downward move, they will have to quickly push the price back into the channel. Such a move will suggest that the pair has rejected the lower levels. The upside momentum could pick up on a break above $0.39.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-will-get-another-test-of-200-week-trend-line-analyst\"><em>Bitcoin price will get 'another test' of 200-week trend line — analyst</em></a></p><h2>Dogecoin price analysis</h2><p>The bulls repeatedly failed to push Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) above the 20-day EMA ($0.07) in the past few days, indicating that the bears are fiercely guarding the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7136cc7e-2295-4d8d-867d-f19553e91432.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The selling picked up momentum on June 5 and the bears yanked the price below the immediate support at $0.07. That may have hit the stops of several traders, opening the gates for a further fall to $0.06. This level may attract strong buying by the bulls.</p><p>On the upside, the $0.07 level may now act as a strong resistance during relief rallies. The bulls will have to propel and sustain the price above the breakdown level of $0.07 to signal the start of a potential recovery.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) broke above the 50-day SMA ($21.54) on June 4 but the bulls could not sustain the positive momentum. This indicates that demand dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/06299e3c-2089-4faa-a2d2-c7670b314c25.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears sensed an opportunity and pulled the price below the moving averages. That may have trapped the aggressive bulls, resulting in a sharp drop to the strong support at $18.70. This is an important level to keep an eye on because a break and close below it will open the doors for a potential drop to $15.28.</p><p>If the SOL/USDT pair rebounds off $18.70, the bulls will again try to clear the overhead hurdle at the moving averages. A break and close above $22.30 may tilt the advantage in favor of the bears.</p><h2>Polygon price analysis</h2><p>The bulls have been trying to push Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) above the 20-day EMA ($0.89) for the past few days but the bears held their ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9e4fc6df-f3c5-41bf-bcd7-5d39ae5fcc7a.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The selling intensified on June 5 and the bears pulled the price to the vital support at $0.82. Buyers are expected to defend this level aggressively. A strong bounce off this support will suggest that the pair may remain stuck between $0.82 and $0.94 for some more time.</p><p>Contrarily, if the support at $0.82 crumbles, the MATIC/USDT pair could start a decline toward the next major support at $0.69. The bulls will have to push and sustain the price above the moving averages to signal the start of a sustained recovery.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T20:39:55.000Z",
    "title": "Polkadot price analysis: DOT corrects lower at $5.06 after a bearish divergence",
    "url": "https://www.cryptopolitan.com/polkadot-price-analysis-2023-06-05/",
    "description": "The Polkadot price analysis indicates a strong bearish sentiment in the market. DOT/USD pair has been on a downward trajectory since the start of today and is now at $5.05 and nearly 5.31% down from its opening price of $5.35. The market crash is strong as the bears are in full control of the price ... <a title=\"Polkadot price analysis: DOT corrects lower at $5.06 after a bearish divergence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-analysis-2023-06-05/\" aria-label=\"More on Polkadot price analysis: DOT corrects lower at $5.06 after a bearish divergence\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T20:37:57.000Z",
    "title": "Best Twitter threads of the day – June 5th",
    "url": "https://www.cryptopolitan.com/best-twitter-threads-of-the-day-june-5th/",
    "description": "Breakdown of SEC filing against Binance/CZ Millions of gamers will be exposed to NFTs"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T20:29:39.000Z",
    "title": "Top crypto tweets of the day – June 5th",
    "url": "https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-june-5th/",
    "description": "US SEC Sues Binance and CEO Zhao for Breaking US Securities Rules Binance’s outflow spikes after SEC suit The end goal of the US crypto crackdown is an agenda-based CBDC, says Cardano founder BNB, and other major altcoins take a hit amid SEC Binance lawsuit SEC names&#160; SOL, ADA, MATIC, FIL, ATOM, and others as ... <a title=\"Top crypto tweets of the day &#8211; June 5th\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-june-5th/\" aria-label=\"More on Top crypto tweets of the day &#8211; June 5th\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T20:16:53.000Z",
    "title": "Terraform Labs co-founder Do Kwon walks free as court dismisses prosecution’s appeal, granting bail",
    "url": "https://www.cryptopolitan.com/do-kwon-walks-free-as-court-grants-bail/",
    "description": "Do Kwon, the well-known entrepreneur and blockchain advocate, has been released on bail once again after the court unexpectedly rejected the prosecution&#8217;s petition. This ruling concludes a court struggle that has captured the public&#8217;s interest and prompted discussion about the bounds of individual liberty and the potential of technological advancement. A Montenegrin court grants Tera, ... <a title=\"Terraform Labs co-founder Do Kwon walks free as court dismisses prosecution&#8217;s appeal, granting bail\" class=\"read-more\" href=\"https://www.cryptopolitan.com/do-kwon-walks-free-as-court-grants-bail/\" aria-label=\"More on Terraform Labs co-founder Do Kwon walks free as court dismisses prosecution&#8217;s appeal, granting bail\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T20:13:10.000Z",
    "title": "Everything to know about the list of tokens that the SEC says are securities",
    "url": "https://www.cryptopolitan.com/tokens-that-the-sec-says-are-securities/",
    "description": "In the fluid universe of cryptocurrency, the US Securities and Exchange Commission (SEC) has recently sharpened its perspective on regulations, laying out a clear delineation of tokens it deems to be securities. The declaration came in April in the form of a list that was shared publicly by the Commission&#8217;s five members, an aggregation that ... <a title=\"Everything to know about the list of tokens that the SEC says are securities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tokens-that-the-sec-says-are-securities/\" aria-label=\"More on Everything to know about the list of tokens that the SEC says are securities\">Read more</a>"
  }
]