[
  {
    "source": "Decrypt",
    "date": "2023-06-12T21:42:08.000Z",
    "title": "eToro to Halt Polygon, Alogrand, Decentraland, and Dash Purchases for US Customers",
    "url": "https://decrypt.co/144294/etoro-to-halt-polygon-alogrand-decentraland-and-dash-purchases-for-us-customers",
    "description": "The move follows a similar pull-back from stock and crypto trading app Robinhood."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T21:56:43.000Z",
    "title": "Binance.US hires former SEC enforcement official amid lawsuit: Report",
    "url": "https://cointelegraph.com/news/binance-us-hires-former-sec-enforcement-official-amid-lawsuit-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/beaf8538-82ac-439b-93d8-5669058f55c3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former SEC enforcement co-director George Canellos reportedly joins the Binance.US legal team as the firm faces challenges to keep its assets unfrozen.</p>\n                    <p><p>United States-based crypto exchange Binance.US has reportedly hired a former enforcement official from the Securities and Exchange Commission (SEC) as part of the legal team to defend itself against allegations of operating as an unregistered securities exchange.</p><p>According to a June 12 report from Bloomberg, Binance.US has <a href=\"https://www.bloomberg.com/news/articles/2023-06-12/binance-us-hires-former-sec-enforcement-co-director-canellos\" target=\"_blank\" rel=\"noopener nofollow\">hired</a> former SEC enforcement co-director George Canellos with the international law firm Milbank LLP along with three other lawyers. Canellos left the SEC in 2014 after serving for more than 4 years in different leadership positions. </p><p>“Binance is clearly preparing for a criminal prosecution and continuing to hire the best defense attorneys in the world,” <a href=\"https://twitter.com/JohnReedStark/status/1668281271728893955\" target=\"_blank\" rel=\"noopener nofollow\">said</a> former SEC internet enforcement chief John Reed Stark on Twitter. “Given the gravity of the fraud alleged by the CFTC and SEC (which might also be the tip of the iceberg of any criminal indictment), a DOJ prosecutor would certainly seek prison time for anyone convicted or pleading guilty to Binance-related crimes.”</p><p>Canellos’ addition to the Binance.US legal team came amid the U.S. firm facing a lawsuit from the SEC alleging it failed to register an exchange, broker and clearing agency. The SEC <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">made similar allegations</a> against global exchange Binance in the same filing and Coinbase in a subsequent filing, and <a href=\"https://cointelegraph.com/news/binance-us-user-funds-safe-amid-sec-injunction-freeze-assets\">attempted to freeze the assets</a> of the U.S. exchange through a temporary restraining order. </p><p>“If the Court does address the merits of the SEC’s motion, it should deny that motion,” <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.40.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Binance.US in a June 12 filing on the SEC’s court petition to freeze assets. “The SEC’s proposed remedies would effectively end [Binance.US’] business. The SEC seeks, among many other things, a draconian and unduly burdensome freeze of all the company’s operations without any exceptions.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-us-halts-trading-for-dozens-of-usdt-btc-busd-pairs-amid-sec-lawsuit\"><strong><em>Binance.US halts trading for dozens of USDT, BTC, BUSD pairs amid SEC lawsuit</em></strong></a></p><p>Following the SEC’s actions, Binance.US announced on June 9 it would be <a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">suspending U.S dollar deposits</a> and potentially pausing fiat withdrawals starting as early as June 13. The exchange cited the SEC’s “extremely aggressive and intimidating tactics” in its reasons for the move.</p><p>U.S. lawmakers and industry leaders have criticized the SEC for its seemingly heavy-handed approach to crypto enforcement. On June 12, Representative Warren Davidson <a href=\"https://cointelegraph.com/news/breaking-us-lawmakers-file-sec-stabilization-act-to-fire-gary-gensler\">called for the firing</a> of SEC chair Gary Gensler through a proposed bill aimed at restructuring the commission.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T21:45:00.000Z",
    "title": "Polygon 2.0 introduces upgrades to tap into ‘Value Layer’ of internet",
    "url": "https://cointelegraph.com/news/polygon-2-0-introduces-upgrades-to-tap-into-value-layer-of-internet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3728e87f-0d88-4c97-a431-06ec9e165dc4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Polygon Labs, Polygon 2.0 will enable users to create, exchange and program value on the internet. </p>\n                    <p><p>On June 12, Polygon Labs <a href=\"https://polygon.technology/blog/introducing-polygon-2-0-the-value-layer-of-the-internet\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> “Polygon 2.0,” a set of upgrades that seeks to establish the “Value Layer” of the internet, which the company says will allow users “to create, exchange, and program value.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Our vision for Polygon is simple: to build the Value Layer of the Internet.<br><br>The Internet allows anyone to create and exchange information. The Value Layer allows anyone to create, exchange, and program value.<br><br>Enter Polygon 2.0: a blueprint to build the ultimate Value Layer. <a href=\"https://t.co/9eYSr3H1L5\">pic.twitter.com/9eYSr3H1L5</a></p>&mdash; Polygon (Labs) (@0xPolygonLabs) <a href=\"https://twitter.com/0xPolygonLabs/status/1668312616459030528?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to an announcement shared on Twitter, “Polygon 2.0 is a set of upgrades that radically reimagine almost every aspect of Polygon, from protocol architecture to tokenomics to governance. It is a roadmap for how Polygon will become the Value Layer, offering unlimited scalability and unified liquidity via ZK [zero-knowledge] tech.”</p><p>Polygon 2.0 is setting out to be a network of interconnected chains powered by ZK technology, a cryptographic technique that allows one party, called the prover, to prove the validity of a statement to another party, known as the verifier, without revealing any additional information beyond the statement's validity. According to Polygon Labs:</p><blockquote>“The network can support a practically unlimited number of chains and cross-chain interactions can happen safely and instantly, without additional security or trust assumptions. Unlimited scalability and unified liquidity.\"</blockquote><p>At its core, Polygon 2.0 will unify protocols, providing “seamless usage\" across zk-Ethereum Virtual Machine tech, proof-of-stake, and supernets, making it “feel like you are using a single chain,” Polygon Labs president Ryan Wyatt shared on Twitter. Additionally, he mentioned “Token evolution” and “long-term decentralized governance” as some of the highlights of the technology. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What is Polygon 2.0?<br><br>At its core:<br><br>- Unifying the protocols: seamless usage across zkEVM, PoS, &amp; Supernets; it will feel like you are using a single chain<br><br>- Token evolution<br><br>- Establish long-term decentralized governance.<br><br>It will be a series of announcements this summer. <a href=\"https://t.co/DRWl3kBAkT\">https://t.co/DRWl3kBAkT</a> <a href=\"https://t.co/wUOWP4xHWC\">pic.twitter.com/wUOWP4xHWC</a></p>&mdash; Ryan Wyatt (@Fwiz) <a href=\"https://twitter.com/Fwiz/status/1668329917497618432?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Polygon is expected to reveal more details on the technology in the coming weeks. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/google-cloud-to-optimize-polygon-zkevm-scaling-performance\">Google Cloud to optimize Polygon zkEVM scaling performance</a></em></strong></p><p>On June 7, Wyatt testified before a United States House of Representatives committee on the topic of internet democratization and the <a href=\"https://cointelegraph.com/news/polygon-labs-president-testifies-on-internet-democracy-with-web3-and-blockchains\">potential of Web3 and blockchain technology</a>. The committee’s Subcommittee on Innovation, Data, and Commerce explored the future of these technologies and the regulatory challenges they present. </p><p>During the hearing, Wyatt emphasized the role of blockchain in addressing the “value extraction” problem prevalent in the current internet landscape. He explained that Web3, enabled by decentralized and transparent systems, offers a solution by democratizing the internet and giving users control over their data. Wyatt highlighted the importance of building a well-regulated blockchain ecosystem in the U.S., emphasizing the potential benefits for users and the overall economy. The hearing took place shortly after the Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/sec-is-killing-innovation-in-united-states-1inch-co-founder\">filed lawsuits against major crypto exchanges</a>, adding further relevance to the discussions on regulation and industry development.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>‘Moral responsibility’: Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T22:07:40.000Z",
    "title": "Circle CEO praises US stablecoin bill in remarks prepared for Congress",
    "url": "https://cryptoslate.com/circle-ceo-praises-u-s-stablecoin-bill-in-remarks-prepared-for-congress/",
    "description": "<p>Circle CEO Jeremy Allaire published a blog post on June 12 featuring testimony that he plans to present to Congress regarding draft stablecoin regulation. Those comments pertain to the hearing scheduled for June 13 titled &#8220;The Future of Digital Assets: Providing Clarity for the Digital Asset Ecosystem.: Allaire said his prepared remarks: &#8220;The stablecoin bill [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circle-ceo-praises-u-s-stablecoin-bill-in-remarks-prepared-for-congress/\">Circle CEO praises US stablecoin bill in remarks prepared for Congress</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T21:44:26.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T21:44:02.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s live Filecoin price is $3.51, with a 24-hour trading volume of $116,844,415.  Filecoin is up 0.99% in the last 24 hours. The current CoinMarketCap ranking is #32, with a live market cap of $1,504,327,199.  It has a circulating supply of 429,115,949 FIL coins and the max. supply ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T22:00:11.000Z",
    "title": "Binance Changes Terms of Service As BNB Reverses 2023 Gains",
    "url": "https://www.newsbtc.com/news/binance-coin/binance-changes-terms-of-service-as-bnb-reverses-2023-gains/",
    "description": "Binance, the largest global cryptocurrency exchange, has quietly changed its terms of service after the United States Securities and Exchange Commission (SEC) filed a complaint at the District Court for the District of Columbia on June 5. Meanwhile, BNB prices continue to crash, dropping to register new 2023 lows as when writing on June 12. Binance Changes Terms Of Service News of the exchange quietly changing its terms of service was shared on Twitter. Under these new terms, Binance can, at their volition, swap delisted assets held in a user&#8217;s dormant account without consent. Moreover, the exchange can swap the token or coin for any asset they wish. Related Reading: SBI CEO Predicts Massive XRP Price Surge, Expects Ripple Verdict In Few Weeks Observers on Twitter say this update represents an additional tool in the ramp&#8217;s arsenal, as it can affect users based on listing and delisting assets, identifying dormant accounts, and the precedents it establishes for other cryptocurrency exchanges. Under the new terms, Binance has exclusive authority to determine which assets are listed, allowing it to list or delist an asset at will. Such a delisted asset can then be converted into a different coin and modified to its order size. Binance can absolve itself and its operatives, of any liabilities or accountability to the asset&#8217;s owner, for any fees or losses, or damages incurred in the process. While most of the above interpretation is speculative, as there have been no official announcements or operational evidence of such activities, concerns have been raised about the possibility of Binance absolving itself of any need to be transparent. BNB Crashing After SEC&#8217;s Lawsuit The changes come after the SEC&#8217;s lawsuit against Binance, which accuses the exchange of allegedly illegally operating an unauthorized exchange in the United States. Changpeng Zhao, the CEO of Binance, claims that, from 2019, all US-based citizens were restricted from transacting on Binance Global. Zhao also reiterated that its US-based exchange is an independent entity. However, the SEC claims that the exchange&#8221; subverted their controls to secretly allow high-value United States customers to continue trading on the Binance Global platform.&#8221; Moreover, while Binance publicly claimed that Binance US is independent, the SEC alleges that Zhao secretly controls the company behind the scenes. Related Reading: Data Reveals Short-Term Bitcoin Holders Refuse To Sell Despite SEC Crackdown In the wake of this lawsuit, BNB has been free-falling, according to trackers on June 12. The coin is trading at $230 and down 35% from its April high. At this level, BNB has reversed all gains posted in 2023 and is trading in December 2022 territory. With the SEC cracking the whip, laying down allegations against cryptocurrency exchanges and individual protocols, their respective tokens would likely be under pressure as holders exit.   Feature Image From Canva, Chart From TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T22:01:42.000Z",
    "title": "Coinbase Invited To Move to Hong Kong By Regulators As SEC Lawsuit in US Develops",
    "url": "https://dailyhodl.com/2023/06/12/coinbase-invited-to-move-to-hong-kong-by-regulators-as-sec-lawsuit-in-us-develops/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-jumps-third-report.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Hong Kong is offering Coinbase the chance to expand to the region as US regulators crackdown on the digital asset industry. Johnny Ng, a member of Hong Kong&#8217;s Legislative Council, has offered to help Coinbase and other digital asset companies relocate to Hong Kong. “I hereby offer an invitation to welcome all global virtual asset [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/12/coinbase-invited-to-move-to-hong-kong-by-regulators-as-sec-lawsuit-in-us-develops/\">Coinbase Invited To Move to Hong Kong By Regulators As SEC Lawsuit in US Develops</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]