[
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T01:45:50.000Z",
    "title": "Polygon gas fees spike 1000% amid Ordinals-inspired token craze",
    "url": "http://cointelegraph.com/news/polygon-gas-fees-spike-thousand-percent-ordinals-token-craze",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5755cf95-f1f3-417e-8ac8-ea2e5b3d28ee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gas fees on the Polygon network reached as high as $0.10 during a mad rush to mint an Ordinals-inspired token called POLS. </p>\n                    <p><p>Gas fees on Ethereum layer-2 Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) surged more than 1,000% to reach a peak of $0.10 as users inundated the network with the minting of Ordinals-inspired tokens dubbed POLS. </p><p>In a Nov. 16 X (formerly Twitter) post Polygon founder Sandeep Nailwal shared his surprise at the elevated transaction activity on the network saying the spike could’ve been due to the launch of a new Polygon-based nonfungible token (NFT) collection. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What is going on on <a href=\"https://twitter.com/0xPolygon?ref_src=twsrc%5Etfw\">@0xPolygon</a> POS chain? 6m transactions in last 24 hrs. 170 TPS on average. 1mn+ MATIC burnt by the protocol. The chain worked smoothly, gas fees went crazy though but no reorgs or 0 blocks etc.<br><br>I hear there is some game Baby Shark Launching, could that be the…</p>— Sandeep Nailwal | sandeep. polygon  (@sandeepnailwal) <a href=\"https://twitter.com/sandeepnailwal/status/1725202988451483979?ref_src=twsrc%5Etfw\">November 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The reason for the uptick in network activity and sudden spike in gas fees seems to be coming mainly from a frenzy of enthusiasm for minting the new POLS token. </p><p>Dune Analytics data showed the rush of minting activity for POLS coincided with more than 102 million MATIC tokens — worth $86 million at current prices— being used as gas. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0110c73f-1177-42da-9fd5-3807614f479d.png\"><figcaption style=\"text-align: center;\"><em>POLS caused more than $86 million of MATIC to be used as gas.</em></figcaption></figure><p>The POLS token is built on a protocol dubbed PRC-20, which operates similarly to the Bitcoin Ordinals-derived <a href=\"https://cointelegraph.com/learn/what-is-a-brc-20-token-standard-an-overview\">BRC-20 token standard</a>. </p><p>According to data from Ethereum Virtual Machine data provider EVM, only 8.7% of the total POLS supply has been minted, with just over 18,100 owners claiming the token. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-see-resurgence-binance-listing\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-ordinals-see-resurgence-binance-listing/amp\"><strong><em>Bitcoin Ordinals see resurgence from Binance listing</em></strong></a></p><p>At the time of publication, Polygon gas fees have since returned to typical levels, settling at around 882 gwei. Gas fees quantify the amount of computing effort needed to conduct a transaction on a given blockchain, with 1 gwei equal to approximately 0.000000001 MATIC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4e1e8fd0-f5fd-4473-b998-03b3268fd34c.png\"><figcaption style=\"text-align: center;\"><em>Polygon gas fees have since returned to slightly above-average levels. Source: Livdir</em></figcaption></figure><p>The Bitcoin network witnessed a similar, albeit more prolonged, <a href=\"https://cointelegraph.com/news/bitcoin-under-siege-by-brc-20-coins-with-soaring-fees-claims-analyst\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-under-siege-by-brc-20-coins-with-soaring-fees-claims-analyst/amp\">spike in activity in May this year</a> following the <a href=\"https://cointelegraph.com/news/bitcoin-evolving-multi-asset-network#:~:text=In%20January%202023%2C%20developer%20Casey,file%20into%20the%20Bitcoin%20blockchain.\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-evolving-multi-asset-network#:~:text=In%20January%202023%2C%20developer%20Casey,file%20into%20the%20Bitcoin%20blockchain./amp\">release of the Ordinals protocol</a>, which allowed users to mint NFTs directly onto the Bitcoin blockchain. </p><p>The ensuing frenzy for Ordinals NFTs and BRC-20 tokens saw Bitcoin fees reach levels not since April 2021, a development that saw more traditionally-minded <a href=\"https://cointelegraph.com/news/ordinals-and-brc-20-will-disappear-in-months-jan3-ceo-says\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ordinals-and-brc-20-will-disappear-in-months-jan3-ceo-says/amp\">Bitcoiners such as Samson Mow</a> and Adam Back cast down the NFT protocol and token standard as wasteful. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/\"><strong><em>Breaking into Liberland — Dodging guards with inner-tubes, decoys and diplomats</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-17T02:00:00.000Z",
    "title": "Crypto Market Has Potential to Hit $10 Trillion This Cycle, Says Bloomberg Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/11/crypto-market-has-potential-to-hit-10-trillion-this-cycle-says-bloomberg-analyst/",
    "description": "As the total market capitalization of the cryptocurrency space keeps on growing and potentially moves to as much as $10 trillion, Bloomberg Intelligence analyst Jamie Coutts has suggested that some funds employing specific trading strategies could see their assets under management explode upward. In a series of posts Coutts told his followers on the microblogging […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T02:00:05.000Z",
    "title": "Ethereum Is No Longer A 20-100X Coin, But Panic Selling Is A Big Mistake",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-no-longer-20-100x-coin-panic-selling-big-mistake/",
    "description": "Ryan Sean Adams, a crypto investor and a vocal Ethereum supporter, notes that some ETH holders are panic selling and diversifying into layer-1 altcoins like Solana (SOL) or Cardano (ADA), primarily concerned that the coin may not outperform the market as it did in the last bull cycle when it soared to around $5,000. Ethereum Holders Selling For High-Performing Altcoins In an X post on November 16, Adams said price action, despite these actions, might rapidly change even if ETH is no longer a 20-100X coin in the eyes of venture capitalists. The investor compares the current trading atmosphere to 2020, months before the second most valuable coin turned higher, surging to record levels. Presently, Ethereum is trading below the $2,000 round number, pulling back from a recent higher but remaining within a bullish formation. Still, it appears the community is dissatisfied with this performance, especially with competitors, primarily SOL and ADA posting impressive gains.  As of writing on November 16, SOL has not only reversed losses of November 2022 when FTX filed for bankruptcy in the United States but has comfortably surged past key resistance lines, registering new 2023 highs of around $67. To quantify, SOL is up by over 200%.  At the same time, Cardano is firm, adding roughly 70% from October 2023 lows, looking at price action in the daily chart. By October, ADA had discouragingly sunk to as low as $0.25. However, the stellar recovery at the tail end of October sparked demand for the coin, driving it to present levels. Related Reading: Howling At The Moon: 23,000% Dogecoin Signal Reawakens Cardano has been slugging in recent months despite the continuous ecosystem developments, including the refinement of the network&#8217;s performance during the Basho stage. Several enhancements, including pipelining, have been introduced to make the network more scalable and secure. Still, this didn&#8217;t reflect in ADA&#8217;s price action until the recent spike in October. ETH Remains A &#8220;Fantastic Asset&#8221; For Retail Investors The difference in performance between Ethereum and competing altcoins, as price action reveals, could be due to project-related triggers but mainly the difference in market cap. Ethereum is the second most valuable project, only trailing Bitcoin, whose market cap is multiples higher than even the second largest smart contract platform by market cap, BNB Chain.  Related Reading: Bitcoin Open Interest Tops 19-Month High: Historical Data Shows What To Expect Subsequently, this makes ETH less volatile, forcing supporters, as Adam notes, to divest into other more volatile coins. These competing layer-1 altcoins have registered triple-digit gains in the last month alone. Nonetheless, even with ETH only adding 30% in the same period, Adams argues that the coin is a &#8220;fantastic asset&#8221; from a risk-adjusted basis for the average retail investor.  Feature image from Canva, chart from TradingView"
  }
]