[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-28T16:00:49.000Z",
    "title": "FDUSD’s Meteoric Rise: 62% Surge in Supply and 6th Highest Trading Volume Globally",
    "url": "https://news.bitcoin.com/fdusds-meteoric-rise-62-surge-in-supply-and-6th-highest-trading-volume-globally/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"FDUSD&#039;s Meteoric Rise: 62% Surge in Supply and 6th Highest Trading Volume Globally\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/fdusududjdjdjjdjdjjd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the span of the past 85 days, the recently introduced stablecoin known as FDUSD has witnessed a significant surge in its circulating supply, soaring by 62% since the commencement of August. This surge in supply has propelled FDUSD into the echelons of the top ten stablecoins by market capitalization, while its market volume share [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T16:00:25.000Z",
    "title": "Bitcoin Predictions To Keep An Eye On As Price Reclaims $34,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-predictions-to-keep-an-eye-on-as-price-reclaims-34000/",
    "description": "Bitcoin has once again reclaimed $34,000 even as the euphoria around the possibility of a Spot Bitcoin ETF being approved soon. Following this, there is the need to look at the predictions of certain analysts who have weighed on the future trajectory of the flagship cryptocurrency from its current price action.  Where Is Bitcoin Headed From $34,000? In a post shared on his X (formerly Twitter) platform, the CEO and Founder of trading platform MN Trading, Michaël van de Poppe, stated that the crypto was fighting $34,700 as resistance and that if it were to break out from that level, the crypto token could rise to as high as $37,000 to $38,000.   Still interesting to keep an eye on #Bitcoin. Fighting $34.7K as resistance, through which a breakout there should lead to $37-38K. On the other hand, areas between $32.6-33.1K, if we get there, areas of longing. Corrections are usually quite swift in upwards trends. pic.twitter.com/DTOYcoCQIK — Michaël van de Poppe (@CryptoMichNL) October 26, 2023 Related Reading: Chainlink (LINK) Surge Far From Done As Crypto Analyst Predicts Rise To $15 He also seemed to suggest that $32,600 and $33,100 were key support levels to keep an eye on as he labeled them “areas of longing.” Another crypto analyst, CryptoTony, projects that Bitcoin could still spike up to $36,000 before “rejecting and letting the range begin.”  $BTC / $USD &#8211; Update Still looking for that spike up to $36,000 before rejecting and letting the range begin. I will be long while we are above $30,000 personally, as we entered at $29,000 Range bound environment is where #Altcoins will flourish and capital will rotate pic.twitter.com/TC09TWWHll — Crypto Tony (@CryptoTony__) October 27, 2023 Bitcoin Halving has become an important metric in making price predictions as the event draws near. In line with this, crypto analyst CryptoCon mentioned that the 2-Year-Old Cumulative Bands MVRV (Market Value to Realized Value) indicates that the pre-halving woes have occurred.  BTCUSD is currently trading at $34.142. Chart: TradingView.com Bearing this in mind, CryptoCon seemed bullish on the crypto token as he stated that “Bitcoin has something special in store for us next.” The analyst had recently predicted that Bitcoin could hit $45,000 as early as November based on their analysis of historical data and past cycles.  Another crypto analyst, Crypto Rover, also mentioned using technical analysis that a bull flag was breaking out on the charts. This suggests that the rally already experienced might be nothing compared to what is on the way.  33.7 Trillion reasons to buy #Bitcoin pic.twitter.com/TQMNlK60Sx — Crypto Rover (@rovercrc) October 28, 2023 Bitcoin In A League Of Its Own Several crypto analysts have, over time, noted the correlation between BTC and the stock market. Bitcoin is said to experience a decline whenever stocks are down and an upward trend whenever these stocks are on the rise. However, recent data suggests that this trend might be over (for now, at least). In a post on the X platform, Bitcoin Magazine noted that Bitcoin has so far decoupled from the Nasdaq, S&#38;P 500, and Dow Jones this month. Bitcoin is up by over 28% in October, while the Nasdaq and S&#38;P500 have had a relatively quiet month with just over 3% gains this month.  Related Reading: Analyst Forecasts Chainlink (LINK) To Fall Below $10 Following Massive Price Surge Bitcoin is also hitting new highs (this year) in its dominance over the broader crypto market. Data from TradingView shows that the coin&#8217;s dominance currently stands at close to 54%. The flagship cryptocurrency has enjoyed an upward trend since the year began and hasn’t seen any significant competition from Ethereum despite talks about ‘The Flippening.’ Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-28T16:00:28.000Z",
    "title": "3 Reasons Why Cardano ($ADA) Can Shine in Bull Run: New AI Crypto Raises $3.8M",
    "url": "https://www.crypto-news-flash.com/3-reasons-why-cardano-ada-can-shine-in-bull-run-new-ai-crypto-raises-3-8m/?utm_source=rss&utm_medium=rss&utm_campaign=3-reasons-why-cardano-ada-can-shine-in-bull-run-new-ai-crypto-raises-3-8m",
    "description": "<img width=\"512\" height=\"319\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113-300x187.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-113-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />InQubeta ($QUBE) and Cardano ($ADA) have emerged as two of the best coins to invest in as bulls take over the cryptocurrency space. $ADA prices have grown 17% in the past week and the project’s trading volume has increased by over $100 million. InQubeta’s presale has enjoyed lots of investor interest, even when bears dominated [...]"
  }
]