[
  {
    "source": "CoinDesk",
    "date": "2023-12-29T07:19:30.000Z",
    "title": "Bitcoin Worth $1B Leaves Exchanges in Largest Single-Day Outflow in 12 Months",
    "url": "https://www.coindesk.com/markets/2023/12/29/bitcoin-worth-1b-leaves-exchanges-in-largest-single-day-outflow-in-12-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Net outflows from exchanges are often taken to represent investors' intention to hold coins for long-term."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T07:25:52.000Z",
    "title": " China calls for crackdown on Tether stablecoin in illegal forex trading ",
    "url": "https://cointelegraph.com/news/china-tether-crackdown-illegal-forex",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMDA2YzA3NmUtMWFiMS00NzFlLWE5YjQtNThhYzRmZDQ3NWEzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>China’s Supreme People’s Procuratorate has warned that using Tether as a medium of exchange between local and foreign currency is illegal.</p>\n                    <p><p>Chinese authorities are moving to crack down on the use of cryptocurrencies like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) in foreign exchange trading more than two years after enforcing a major crypto ban.</p><p>China’s Supreme People’s Procuratorate (SPP), the highest national agency responsible for legal prosecution in mainland China, has warned the public against using USDT as an intermediary to trade yuan with other fiat currencies.</p><p>The agency <a href=\"https://www.spp.gov.cn/xwfbh/wsfbt/202312/t20231227_638215.shtml#2\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a joint statement with the State Administration of Foreign Exchange (SAFE) on Dec. 27, urging local officials to implement stricter measures against Tether stablecoin use in cross-border foreign exchange transactions.</p><p><a href=\"https://cointelegraph.com/news/china-tether-crackdown-illegal-forex\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T07:25:07.000Z",
    "title": "Microsoft’s AI Dilemma – Safe, Yet Creating Disturbing Imagery?",
    "url": "https://www.cryptopolitan.com/microsoft-ai-dilemma-safe-disturbing-imagery/",
    "description": "In a chilling revelation, Microsoft&#8217;s artificial intelligence, touted as safe and integrated into everyday software, is under scrutiny for generating gruesome and violent images. The concern centers around Image Creator, a part of Microsoft&#8217;s Bing, recently added to the widely used Windows Paint. The technology, known as DALL-E 3 from Microsoft&#8217;s partner OpenAI, is now [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T07:15:07.000Z",
    "title": "Ethereum co-founder Vitalik Buterin calls for a return to cypherpunk values",
    "url": "https://www.cryptopolitan.com/vitalik-buterin-calls-for-return-cypherpunk/",
    "description": "In a recent blog post, Ethereum co-founder Vitalik Buterin expressed concern over the shift away from the original vision of Web3 and the core principles of decentralization within the cryptocurrency community. Cypherpunk vision fading away Buterin highlighted in his December 28 blog post the diminishing focus on decentralization, citing a growing ideological divide where some [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T07:30:00.000Z",
    "title": "Ethereum rainbow chart forecasts gains alongside Cosmos and Everlodge",
    "url": "https://crypto.news/ethereum-rainbow-chart-forecasts-gains-alongside-cosmos-and-everlodge/",
    "description": "Ethereum is firm despite the SEC's decision. Meanwhile, investors expect Cosmos and Everlodge to extend gains in 2024"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T07:26:19.000Z",
    "title": "Judge considers Terraform Labs’ LUNA and MIR as securities",
    "url": "https://crypto.news/judge-considers-terraform-labs-luna-and-mir-as-securities/",
    "description": "A U.S. federal judge has ruled in favor of the Securities and Exchange Commission (SEC) in a case against Terraform Labs and its former CEO Do Kwon. According to a U.S. court&#8217;s decision, Terraform Labs and Do Kwon sold two&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T07:18:29.000Z",
    "title": "Canadian crypto exchange CatalX suspends services following security incident",
    "url": "https://crypto.news/canadian-crypto-exchange-catalx-suspends-services-following-security-incident/",
    "description": "Canadian cryptocurrency exchange CatalX halted operations following a suspected insider job that resulted in a “security breach.&#8221; CatalX CTS Ltd., the Canadian crypto exchange operator, said in a press release on Dec. 28 that it had suffered a &#8220;security breach&#8221;&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-29T07:19:14.000Z",
    "title": "Missed Solana (SOL) Airdrops? Don’t Miss Injective (INJ)!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/missed-solana-sol-airdrops-dont-miss-injective-inj/",
    "description": "<p>Airdrop season seems to be upon us. Remember the Jito airdrop on Solana? 3 People claimed drops ranging between $5k and 10-12K and more. Projects without a token suddenly found themselves in the spotlight. From there, it&#8217;s only a small step to other ecosystems. Especially if they are on fire, like Solana. So, the step [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/missed-solana-sol-airdrops-dont-miss-injective-inj/\">Missed Solana (SOL) Airdrops? Don&#8217;t Miss Injective (INJ)!</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]