[
  {
    "source": "Decrypt",
    "date": "2023-12-08T19:06:31.000Z",
    "title": "Got $1 Million in Bitcoin or Tether? El Salvador Will Give You a 'Freedom Visa'",
    "url": "https://decrypt.co/209122/el-salvador-passport-cough-up-1m-bitcoin-tether",
    "description": "El Salvador has announced a new “freedom visa” for rich people who want to live in the Central American nation. "
  },
  {
    "source": "Decrypt",
    "date": "2023-12-08T18:57:41.000Z",
    "title": "Amazon Prime Is Giving Out Free Items for NFT Game ‘Champions Ascension’",
    "url": "https://decrypt.co/209121/amazon-prime-giving-out-free-items-nft-game-champions-ascension",
    "description": "Got an Amazon Prime membership? You’ll be able to grab in-game items for NFT actioner Champions Ascension on PC for weeks to come."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T18:49:28.000Z",
    "title": " Price analysis 12/8: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, AVAX, LINK, MATIC  ",
    "url": "https://cointelegraph.com/news/price-analysis-12-8-btc-eth-bnb-xrp-sol-ada-doge-avax-link-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvN2UzMmE1NjktOWZmNS00ZjVmLWE4NzYtMDY3ODQ2ZTkxZDhhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price staged an intraday rally to the $44,000 level and technical charts show altcoins are keen to follow.</p>\n                    <p><p>This week Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price saw a shallow pullback, but the intra-day rally to the $44,000 level is an indication that the bulls are not hurrying to close their positions. Data from the popular HODL Waves metric shows that investors who purchased Bitcoin between December 2020 and December 2021 have been <a href=\"https://cointelegraph.com/news/bitcoin-hodl-waves-2020-bull-market-buyers-supply\" >sitting on their coins</a>.</p><p>Investors have not been selling into strength because they anticipate higher levels in the future. Asset manager VanEck said in its crypto predictions for 2024 that <a href=\"https://cointelegraph.com/news/bitcoin-price-reach-high-fourth-quarter-2024-binance-lose-leadership-vaneck\" >Bitcoin would make a new all-time high</a>, buoyed by the “political events and regulatory shifts following a U.S. presidential election.”</p><p>Bitcoin’s rally of the past few days has also attracted investors to select altcoins, such as Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>). Research firm Santiment remains positive on the prospects of Bitcoin. It said on Dec. 7 that if FUD increases, Bitcoin could surge to $50,000.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-12-8-btc-eth-bnb-xrp-sol-ada-doge-avax-link-matic\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T18:45:00.000Z",
    "title": " Taiwan central bank completes wholesale CBDC study, plans next steps ",
    "url": "https://cointelegraph.com/news/taiwan-central-bank-wholesale-cbdc-study-next-steps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYWViYTMyMTMtYzcwMC00NDhiLWIzN2YtOWMzZTQ0MDc1NWVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A central bank official spoke about ongoing CBDC research and other payment modernization Taiwan is exploring.</p>\n                    <p><p>Taiwan’s central bank has completed a feasibility study of wholesale central bank digital currency (CBDC) and is continuing to consider its introduction. The central bank is seeking feedback from business and academics and will continue to work on platform design, deputy governor Mei-lie Chu <a href=\"https://www.cbc.gov.tw/tw/cp-302-164924-0423d-1.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Dec. 7. </p><p>In a lengthy speech at an event for bankers, Chu outlined what she called Banking 4.0, or “services embedded in customers’ daily lives,” including the integration of artificial intelligence and advanced mobile and digital technology into banking. She devoted about half of her presentation to CBDC.</p><p>Chu referred to Bank for International Settlements research and said she saw the advantages of CBDCs and tokenization of real-world assets. Furthermore:</p><p><a href=\"https://cointelegraph.com/news/taiwan-central-bank-wholesale-cbdc-study-next-steps\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-08T19:00:50.000Z",
    "title": "SEC issues new investor warning over crypto assets",
    "url": "https://cryptoslate.com/sec-issues-new-investor-warning-over-crypto-assets/",
    "description": "<p>In a recurring advisory issued today, the U.S. Securities and Exchange Commission (SEC), through its Office of Investor Education and Advocacy, has once again emphasized the significant risks associated with investing in crypto asset securities. The warning, echoing previous alerts, highlights the ongoing speculative and volatile nature of such investments, underscoring the substantial risk of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-issues-new-investor-warning-over-crypto-assets/\">SEC issues new investor warning over crypto assets</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-08T19:08:46.000Z",
    "title": "Solana to join spot ETF race in 2024, VanEck predicts",
    "url": "https://cryptobriefing.com/solana-join-spot-etf-race-2024-vaneck-predicts/?utm_source=feed&utm_medium=rss",
    "description": "Investment manager VanEck predicts Solana will join crypto spot ETF wars in 2024 as its market cap and users grow."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T19:01:50.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T19:00:04.000Z",
    "title": "Dogecoin Above $0.1? Crypto Analyst Lists Reasons Why DOGE Price Will Continue To Rally",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-0-1-doge-price-rally/",
    "description": "Dogecoin (DOGE) has been up close to 75% in the last 45 days and if one analyst&#8217;s projection is anything to go by, this rally isn’t coming to an end anytime soon. This comes at a time when many are hoping that DOGE can hit the $0.10 mark and possibly reach new highs.  Why DOGE’s Future Is Bullish  In a video posted on his YouTube Channel, crypto analyst Austin Hilton highlighted Dogecoin&#8217;s significant gain in the last 45 days and discussed the future trajectory of the meme coin. Austin sounded so bullish on DOGE as he gave reasons why he believes this rally will continue.  Related Reading: Shiba Inu Team Unveils Enhanced SHIB And BONE Burns, What This Means Firstly, he alluded to the fact that the crypto market as a whole was currently enjoying an upward trend as liquidity was flowing into the ecosystem. He noted that Bitcoin and other major altcoins have picked up as a result of this. DOGE hasn’t been left behind, as the meme coin is also riding this wave.  With this in mind, he believes that Dogecoin will continue to rise as more liquidity is expected to flow into altcoins like the meme coin. He attributed these inflows to the bullishness around Spot Bitcoin ETFs, which many expect the SEC to approve in January.  The second reason why he is bullish on DOGE’s future is based on his assertion that December happens to be “very, very good” for crypto. As such, he doesn’t expect this December to be any different. So far, this month has undoubtedly been good for the crypto market, and this momentum is likely to continue as many position themselves ahead of January.  DOGE price recovers toward $0.1 &#124; Source: DOGEUSD on Tradingview.com Dogecoin Also Looking Good On The Charts Several crypto analysts have also weighed in on DOGE’s future trajectory from a technical analysis perspective. Based on their projections, the meme coin could end the year on a high and possibly enjoy similar gains to the one it enjoyed in 2021.  Related Reading: Ethereum Whale With Over $60 Million In Unrealized Profits Moves Coins To Exchange Specifically, crypto analyst JD recently noted that Dogecoin’s MACD (Moving Average Convergence Divergence) was on the verge of having another bullish cross. The last time this happened was in 2021, which led to the meme coin seeing a 370x gain in its price. Based on the chart that JD shared, this bullish cross could happen again in 2024. Based on another crypto analyst’s projections, Dogecoin could gain over 900% in a move that will see it rise to $0.7, And 2024 is also predicted to be the year that this could happen. The fundamentals also complement these technical analyses as there are plans in place to send DOGE to the moon (and up the charts). At the time of writing, DOGE is trading at $0.09, up by over 1.50%, according to data from CoinMarketCap. Featured image from The Coin Republic, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-08T18:56:40.000Z",
    "title": "Invest $1 Million in Bitcoin or USDT, Get Citizenship: El Salvador’s Bold Move",
    "url": "https://www.crypto-news-flash.com/invest-1-million-in-bitcoin-or-usdt-get-citizenship-el-salvadors-bold-move/?utm_source=rss&utm_medium=rss&utm_campaign=invest-1-million-in-bitcoin-or-usdt-get-citizenship-el-salvadors-bold-move",
    "description": "<img width=\"1280\" height=\"855\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Bitcoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Bitcoin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Bitcoin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Bitcoin-1024x684.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Bitcoin-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />El Salvador has introduced its citizenship through the Bitcoin investment initiative. Despite criticisms, the country has evidence of positive Bitcoin adoption. El Salvador, the first country to embrace Bitcoin as legal tender, has launched an innovative citizenship-by-investment initiative, the &#8220;Adopting El Salvador Freedom Visa Program.&#8221; This bold program offers residency Visas and potential citizenship to [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-08T19:05:08.000Z",
    "title": "Trader Issues Warning on Altcoin That’s Exploded Over 900% in a Month, Unveils Targets for Solana and Avalanche",
    "url": "https://dailyhodl.com/2023/12/08/trader-issues-warning-on-altcoin-thats-exploded-over-900-in-a-month-unveils-targets-for-solana-and-avalanche/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Says-Memecoin-Frenzy-Sending.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is issuing a warning about one red-hot Solana-based (SOL) memecoin. Pseudonymous crypto strategist Altcoin Sherpa tells his 200,800 followers on the social media platform X that Bonk (BONK) could go on a massive decline after rising a bit more. However, he warns traders that shorting the meme asset is akin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/08/trader-issues-warning-on-altcoin-thats-exploded-over-900-in-a-month-unveils-targets-for-solana-and-avalanche/\">Trader Issues Warning on Altcoin That’s Exploded Over 900% in a Month, Unveils Targets for Solana and Avalanche</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]