[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-21T10:30:58.000Z",
    "title": "Bank of Russia Predicts Digital Ruble Won’t End Other Payment Methods",
    "url": "https://news.bitcoin.com/bank-of-russia-predicts-digital-ruble-wont-end-other-payment-methods/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bank of Russia Predicts Digital Ruble Won&#039;t End Other Payments Methods\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2127410144.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Central Bank of Russia does not expect the introduction of the digital ruble to end the popularity of other non-cash and cash payment options. According to statements offered by Alla Bakina, director of the bank&#8217;s national payment system department, other non-cash payment options have reached over 80% of the total payment transactions in Russia. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-21T10:24:37.000Z",
    "title": "How to Protect Your Cryptocurrency Investments from AI-Powered Scammers",
    "url": "https://www.cryptopolitan.com/protect-your-cryptocurrency-from-ai-scammers/",
    "description": "Cryptocurrency scams have been a persistent threat in digital finance, and scammers are continuously evolving their tactics. In recent times, with the rise of Artificial Intelligence (AI), scammers have harnessed this technology to target unsuspecting cryptocurrency investors.  Meta, formerly known as Facebook, recently sounded the alarm about hackers worldwide exploiting OpenAI&#8217;s AI-powered interactive tool, ChatGPT. ... <a title=\"How to Protect Your Cryptocurrency Investments from AI-Powered Scammers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/protect-your-cryptocurrency-from-ai-scammers/\" aria-label=\"More on How to Protect Your Cryptocurrency Investments from AI-Powered Scammers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-21T10:24:24.000Z",
    "title": "The BRICS Bear – How does Russia’s history influence its vision of crypto?",
    "url": "https://www.cryptopolitan.com/the-brics-bear-how-does-russias-history-influence-its-vision-of-crypto/",
    "description": "Part of a series of deeper dives on BRICS members to see their individual economic and political trends to try to imagine how they will move forward on crypto and how this may affect the BRICS perspective on crypto. Historical Background &#8211; Vikings, Mongols, serfdom, communism, Russia Today : Russian history can be divided into ... <a title=\"The BRICS Bear &#8211; How does Russia’s history influence its vision of crypto?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-brics-bear-how-does-russias-history-influence-its-vision-of-crypto/\" aria-label=\"More on The BRICS Bear &#8211; How does Russia’s history influence its vision of crypto?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-21T10:17:58.000Z",
    "title": "Third Wave Launches Raytrek Cloud: Affordable GPU Cloud Service",
    "url": "https://www.cryptopolitan.com/third-wave-launches-raytrek-cloud-gpu-cloud/",
    "description": "Japanese company Third Wave is set to disrupt the AI computing landscape by launching an innovative &#8216;GPU cloud&#8217; service known as Raytrek Cloud. This service aims to make high-performance AI computing accessible to many users without top-of-the-line PCs or GPUs. Bringing AI to the masses Third Wave&#8217;s Raytrek Cloud is designed to democratize AI computing. ... <a title=\"Third Wave Launches Raytrek Cloud: Affordable GPU Cloud Service\" class=\"read-more\" href=\"https://www.cryptopolitan.com/third-wave-launches-raytrek-cloud-gpu-cloud/\" aria-label=\"More on Third Wave Launches Raytrek Cloud: Affordable GPU Cloud Service\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-21T10:19:29.000Z",
    "title": "Bitcoin Could Benefit From ‘Flight To Quality’ Trend: Report",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-could-benefit-from-flight-to-quality-trend-report/",
    "description": "In the last seven days, Bitcoin has gone up by 10.50%, following a series of significant gains across the week. Most notably, the largest crypto asset surged by 7% on Monday following the emergence of fake news on the approval of the BlackRock iShares Bitcoin Spot ETF. As expected, this price gain drew a plethora of reactions from various crypto enthusiasts and analysts. In particular, Larry Fink, the CEO of BlackRock, stated in an interview with Fox Business that the BTC surge was partially due to the fake news of the spot ETF approval but also because of a growing demand for an investment safe haven.  According to Fink, the increasing geopolitical tensions &#8211; citing the ongoing Israel-Palestine conflict &#8211; have created uncertainties driving investors to traditional assets such as gold, but also crypto assets.  The BlackRock CEO describes this trend as a “flight to quality.” Related Reading: Bitcoin ETF Approval Anticipated To Trigger Fiat Influx Of $24-50 Billion Dissecting The Bitcoin &#8216;Flight To Quality&#8217; Theory Following Larry Fink’s statement earlier this week, blockchain analytics and research firm IntoTheBlock has now posted a report evaluating the feasibility of Bitcoin as a “Flight to Quality” asset.  In the post on Friday, IntoTheBlock highlighted various factors that backed Fink’s claim. Firstly, the analytic firm stated that US bonds are experiencing a historic sell-off as the 10-year yields on long-term bonds hit 5% this week. Generally, US bonds are considered one of the most secure investment forms. However, developments such as this are usually termed as negative. This is because an increase in bond yield leads to declining demand for existing lower-yielding bonds and in turn, the devaluation of these bonds.  As expected, this increasing bond yield has resulted in a 20% depreciation of long-term US bonds over the last six months. Meanwhile, there has been a significant 53% decline in the value of these investment assets since March 2020.  Related Reading: Bitcoin Knocks At The Door Of $30,000, But Can Break Happen? Bitcoin Records Less Volatility Than US Treasuries Furthermore, IntoTheBlock highlighted that Bitcoin’s volatility is currently lower than that of these US long-term bonds, indicating it offers a higher level of stability to traditional investors looking at the value of their investment.  Finally, the research firm pointed out Bitcoin’s remarkable performance during this bond market crash, likening it to the asset’s positive price movement during the series of US bank collapses earlier in 2023.  The blockchain research firm noted the crypto market leader tallies with gold with a 7% gain already in October and is receiving more recognition as a favorable alternative investment asset by several Wall Street financial experts. Considering all the factors listed above, IntoTheBlock states that there are growing signs that Bitcoin is becoming a safe haven for traditional investors and could largely benefit from a “Flight to Quality” movement, especially with the potential launch of spot Bitcoin ETF. At the time of writing, Bitcoin is trading at $29,667 with a 0.27% loss in the last day. In tandem, the token’s daily trading volume is down by 18.70% and is currently valued at $15.86 billion.  BTC trading at $29,661 on the hourly chart &#124; Source: BTCUSDT chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-21T10:34:00.000Z",
    "title": "EIP-7540 Would Introduce Asynchronous Deposit on Ethereum Network",
    "url": "https://coinedition.com/eip-7540-would-introduce-asynchronous-deposit-on-ethereum-network/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"EIP-7540 Would Introduce Asynchronous Deposit on Ethereum Network\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ethereum-Beacon-Chain-Issues-Settle-Finality-is-Restored-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>EIP-7540 will introduce asynchronous deposit and redemption flows on Ethereum. The introduction will come as an extension to the existing ERC-4626 tokenized vault standard. EIP-7540 has the potential to benefit protocols that deal with real-world assets (RWAs). According to reports, a new Ethereum Improvement Proposal, EIP-7540, to introduce asynchronous deposit and redemption flows has been [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eip-7540-would-introduce-asynchronous-deposit-on-ethereum-network/\">EIP-7540 Would Introduce Asynchronous Deposit on Ethereum Network</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]