[
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T03:30:35.000Z",
    "title": " Is this the end? GBTC outflows slow for second day straight ",
    "url": "https://cointelegraph.com/news/grayscale-gbtc-outflows-slow-for-second-day",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzFkZjYzOGUtNjMzZC00ZTc5LWE1OWEtODg3ZTJkZWQzMjQ5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Daily outflows from the Grayscale Bitcoin Trust have fallen to the lowest amount since launch day, in what some hope is the beginning of the end of the exodus.</p>\n                    <p><p>Outflows from Grayscale’s Bitcoin Trust (GBTC) have slowed for the second day in a row — prompting a glimmer of hope that a multibillion-dollar Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) dumping spree could soon end. </p><p>BitMEX Research data shows GBTC outflows were $429 million on Jan. 24 — the smallest daily outflow since the launch of Grayscale’s spot Bitcoin ETF on Jan. 11 and a 33% slowdown compared to the start of the week on Jan. 22.</p><p>In a Jan. 24 X post, Arkham explained the outflow data for GBTC shown on its platform is split between Coinbase Prime and new GBTC custody addresses — meaning not all of the BTC being moved from Grayscale’s Bitcoin Trust is necessarily being redeemed. </p><p><a href=\"https://cointelegraph.com/news/grayscale-gbtc-outflows-slow-for-second-day\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T03:19:33.000Z",
    "title": " SatoshiVM token dips as much as 38% amid Ape Terminal controversy on X ",
    "url": "https://cointelegraph.com/news/satoshivm-savm-token-dips-amid-ape-terminal-controversy-on-x",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2ZlN2ZiOTktOGRmYS00NzZjLTllYmUtY2JjNTFlNWVmZmY2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>SatoshiVM used Ape Terminal’s platform to launch its token, SAVM, via an Initial DEX Offering last week, which led to a myriad of scam accusations.</p>\n                    <p><p>The newly launched SatoshiVM (SAVM) token plunged as much as 38% amid a war of words between one of its advisers and fundraising platform Ape Terminal over a seemingly controversial token launch last week. </p><p>The heated argument stems from a launchpad event for SatoshiVM’s new token SAVM, <a href=\"https://etherscan.io/token/0x15e6E0D4ebeAC120F9a97e71FaA6a0235b85ED12\" target=\"_blank\" rel=\"noopener nofollow\">which began trading</a> on Jan. 19. Ape Terminal is a decentralized exchange (DEX) fundraising platform or “launchpad” for cryptocurrency projects looking to release a new token via an Initial DEX Offering. </p><p>SatoshiVM is a contributor-based Bitcoin layer 2 solution powered by zero-knowledge rollup technology.</p><p><a href=\"https://cointelegraph.com/news/satoshivm-savm-token-dips-amid-ape-terminal-controversy-on-x\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T03:25:21.000Z",
    "title": "Canine Facial Recognition App Emerges as a Game-Changer in the Battle Against Rabies",
    "url": "https://www.cryptopolitan.com/canine-facial-recognition-app-battle-rabies/",
    "description": "In a groundbreaking development, a mobile phone-based facial recognition application for dogs has emerged as a potential game-changer in the global fight against rabies. The research, conducted by a team of experts at Washington State University (WSU), showcases the app&#8217;s effectiveness in enhancing rabies vaccination efforts, particularly in endemic regions like Africa and Asia. The [&#8230;]"
  }
]