[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T13:00:00.000Z",
    "title": "Bitcoin Miner CleanSpark Buys 12,500 Bitmain Machines for $40.5M",
    "url": "https://www.coindesk.com/business/2023/06/01/bitcoin-miner-cleanspark-buys-12500-bitmain-machines-for-405m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "CleanSpark has been buying up assets during the bear market to reach its 2023-end of 16 EH/s, but discounts are getting smaller."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T12:46:08.000Z",
    "title": "Jimbos Protocol offers $800K bounty to the public after hacker ignores deal",
    "url": "https://cointelegraph.com/news/jimbos-protocol-offers-open-bounty-after-hacker-ignores-deal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/40e350a8-cbfa-45f0-b0cf-5e17b0533f39.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Jimbos Protocol team extended the bounty offer to the public, inviting anyone who can help catch the exploiter or recover the funds to claim the reward.</p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">Decentralized finance (DeFi)</a> platform Jimbos Protocol has offered 10% of the exploited funds to the general public after giving the hacker several days to respond to the deal.</p><p>On May 28, the Arbitrum-based DeFi app was exploited, resulting in a loss of 4,000 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). After taking advantage of the lack of slippage control on liquidity conversions, the exploiter was able to <a href=\"https://cointelegraph.com/news/arbitrum-based-jimbos-protocol-hacked-losing-7m-in-ethereum\">swipe assets worth around $7.5 million</a> at the time. </p><p>Following the hack, the team behind the exploited protocol attempted to negotiate with the hacker. The DeFi protocol <a href=\"https://cointelegraph.com/news/jimbos-protocol-offers-deal-to-hacker-threatens-police-action\">offered 10% of the exploited funds</a> as a bounty and threatened the hacker with prosecution. The team offered what they described as a “fast $800k payday” but said that if 90% of the funds are not returned, they won’t stop until the hacker is behind bars. </p><p>After giving the hacker some time to respond, the protocol recently announced that it would extend the bounty offer to the general public. In a Twitter thread, the DeFi protocol <a href=\"https://twitter.com/jimbosprotocol/status/1663914457758679040\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that anyone who could provide information that leads to either catching the exploiter or recovering the funds would be eligible for the reward. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s been a quiet couple of days. Let&#39;s catch up.<br><br>We&#39;ve spoken about our bounty before, 10% of stolen funds (~$800k USD). We&#39;ve given the hacker time to comply for the bounty but evidently, they&#39;re not interested, so we&#39;re committed to doing what we said we were going to do.</p>&mdash; Jimbos Protocol (v2, soon) (@jimbosprotocol) <a href=\"https://twitter.com/jimbosprotocol/status/1663914448384319488?ref_src=twsrc%5Etfw\">May 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In addition, the team also mentioned that they are already <a href=\"https://twitter.com/jimbosprotocol/status/1663914453136556035\" target=\"_blank\" rel=\"noopener nofollow\">working</a> with a law enforcement agency that focuses on blockchain cybercrime investigations. Furthermore, the team said they would share future plans for the protocol and a recovery plan for the exploit victims. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hack-negotiations-why-do-platforms-with-ineffective-bounty-programs-pay-a-higher-price\"><strong><em>Hack negotiations: Why platforms with ineffective bounty programs pay a higher price</em></strong></a></p><p>While the recent hack shows that some hackers may not be willing to negotiate, other bounty negotiations have been successful. On April 4, the Euler Finance team <a href=\"https://cointelegraph.com/news/euler-labs-hacker-returns-all-of-the-recoverable-funds-timeline\">recovered 90% of hacked funds</a> after offering the exploiter a bounty of $19.6 million. Similarly, lending protocol Sentiment also managed to recover 90% of its funds from a hacker after <a href=\"https://cointelegraph.com/news/sentiment-recovers-870k-after-negotiations-with-the-hacker\">offering a 10% bounty</a> to the exploiter. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T13:01:58.000Z",
    "title": "Yesterday saw the largest one-day Bitcoin transfer from miners to an exchange in two years",
    "url": "https://cryptoslate.com/insights/yesterday-saw-the-largest-one-day-bitcoin-transfer-in-two-years/",
    "description": "<p>Quick Take The total daily amount of Bitcoin transferred from miners to exchange wallets hit a two-year high yesterday. The transaction occurred between the mining pool, Poolin, and Binance. This does not necessarily mean that the Bitcoin was sold; it only means that it was transferred. CryptoSlate has been monitoring Poolin since it experienced a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/yesterday-saw-the-largest-one-day-bitcoin-transfer-in-two-years/\">Yesterday saw the largest one-day Bitcoin transfer from miners to an exchange in two years</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-01T12:40:00.000Z",
    "title": "Asset Management Led by ATPBot Innovation: A Letter to Investors",
    "url": "https://www.cryptoglobe.com/latest/2023/06/asset-management-led-by-atpbot-innovation-a-letter-to-investors/",
    "description": "Disclaimer: This article is sponsored content and is for informational purposes only. It does not constitute financial advice. Cryptocurrency trading involves significant risk of loss and is not suitable for all investors. The views expressed in this article are those of the sponsor and do not necessarily reflect those of CryptoGlobe. We advise all readers […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T12:53:33.000Z",
    "title": "Crypto Exchange Gemini Seeks UAE License",
    "url": "https://cryptodaily.co.uk/2023/06/crypto-exchange-gemini-seeks-uae-license",
    "description": "<p>US-based crypto exchange Gemini announced it seeks a crypto license in the United Arab Emirates, citing &ldquo;hostility and [a] lack of clarity&rdquo; on US regulations. </p>\n<p>Gemini, the cryptocurrency exchange owned by Cameron and Tyler Winklevoss, announced on Wednesday that it will &ldquo;soon&rdquo; start the process of obtaining a crypto service license for customers in the United Arab Emirates (UAE).</p>\n\n<p dir=\"ltr\" lang=\"en\">1/ We&rsquo;re coming to the UAE! 🇦🇪We&rsquo;re thrilled to announce that Gemini will soon begin the process of acquiring a crypto license to serve customers based in the United Arab Emirates (UAE). pic.twitter.com/Ycdj9RxMbE</p>\n&mdash; Gemini (@Gemini) June 1, 2023\n<p>\n\n</p>\n<p>In a blog post, the exchange said the UAE, as a forward-thinking, global financial hub, is fast establishing itself as a crypto hub. The company said its team has met with stakeholders throughout the region to learn more about local regulatory requirements, further stating that it aims for the &ldquo;adoption of crypto globally across 20 countries.&rdquo;</p>\n<p>Gemini said:</p>\n\n<p>By applying for a license, we will be taking another step towards making Gemini a truly global company.</p>\n\n<p>It is not yet clear where Gemini&rsquo;s base operations will be located, but Cointelegraph reports that the exchange has hinted at establishing headquarters in Dubai and Abu Dhabi.</p>\n<p>Gemini co-CEOs, the Winklevoss twins, also told media outlet Zaywa that its decision was prompted by &ldquo;hostility and a lack of clarity&rdquo; regarding crypto regulations in the US.</p>\n<p>The exchange announced last week that it plans to establish its European operations out of Dublin, Ireland.</p>\nUAE Residents Have Bought More Crypto Than US Residents\n<p>In Gemini&rsquo;s Global State of Crypto Report for 2022, data revealed more than 35% of those surveyed in the UAE purchased crypto, compared to only 20% in the US.</p>\n\n<p dir=\"ltr\" lang=\"en\">4/As part of Gemini&rsquo;s 2022 Global State of Crypto Report, we found that those in the UAE were rapidly acquiring crypto and putting it to use making in-person purchases. 🤝We also found high intent to purchase crypto among those who were not yet ownershttps://t.co/EIB1ji2uBP pic.twitter.com/Ay9pfzkJk4</p>\n&mdash; Gemini (@Gemini) June 1, 2023\n<p>\n\n</p>\n<p>Data further revealed that almost 32% of those in the UAE who do not own crypto are likely to purchase some in the next year. Compared to just 19% of global crypto owners, 33% of holders in the UAE said they plan to use crypto to make in-person purchases at brick-and-mortar retailers.</p>\nGemini Launches Offshore Crypto Derivatives Exchange\n<p>Gemini has rapidly expanded its offerings by launching Gemini Foundation, an offshore crypto derivatives platform. The platform launched in 30 countries but is not available to US, UK, or European Union users.</p>\n<p>Gemini Foundation allows users to begin trading with Bitcoin perpetual contracts denominated in Gemini Dollars (GUSD) and offers 100x leverage.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T12:40:00.000Z",
    "title": "LBank Labs Invests in Sparkle Ventures to Ignite Innovation in Web3",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-labs-invests-in-sparkle-ventures-to-ignite-innovation-in-web3",
    "description": "<p>Road Town, British Virgin Islands, June 1st, 2023, Chainwire</p><p>LBank Labs, a leading blockchain venture fund, is pleased to announce an investment in Sparkle Ventures, a prominent fund manager based in Luxembourg. The strategic investment aims to foster innovation and support the growth of highly-scalable Web3 infrastructures on a global scale.</p><p>LBank Labs, known for its protocol and exchange-agnostic approach, is committed to supporting projects through direct funding, acceleration, incubation, and extensive networking. With $100 million in assets under management (AUM), the venture capitalist arm of global cryptocurrency exchange LBank has a strong track record of nurturing startups and helping them thrive. Besides direct investments, the team aims to build a strong fund network via investing in global top funds to support portfolios from the network in both financial and resource value-add. Czhang Lin, IC board member of Labs, is also personally LP to NGC, Blockchain Founders Fund and Lemniscap, while Eric He, Co-Founder of LBank is LP to SevenX Ventures fund I, II and FOF, and IOSG Ventures.&nbsp;</p><p>Sparkle Ventures, acting as the strategic fund manager in conjunction with Animoca Brands, has gained recognition for its investments in cutting-edge technologies, supporting early-stage Web3 infrastructure enablers globally. Among the General Partners of Sparkle Ventures are industry veterans like Sebastien Borget, Co-Founder and COO of The Sandbox, Yat Siu, Founder and Chairman of Animoca Brands, Julien Pageaud, former head of strategic investments and tech lead at Nomura Digital, and Thibaut Chess&eacute;, former head of tech adoption for the Tezos blockchain protocol.</p><p>Notable projects backed by Sparkle Ventures include institutional-grade DeFi SaaS platform Kiln.fi, data analytics software AbsoluteLabs.io, and ZKP systems Polyhedra.network and OAS.gg. Their co-investors include market giants such as Accel, BinanceLabs, Coinbase, Consensys, Matrix Partners, Polychain, and Sequoia.</p><p>By investing in Sparkle Ventures, LBank Labs aims to leverage their combined expertise, networks, and resources to drive innovation in NFT, gaming and metaverse infra to advance the creation of highly scalable businesses and technologies that will shape the future of Web3.</p>\"We are thrilled to invest in Sparkle Ventures to support our shared mission to accelerate the growth of transformative technologies in the Web3 space,\" said Jiayu Gao, Head of FOF investment at LBank Labs. \"We believe this investment will empower entrepreneurs and developers to bring their ideas to life, pushing the boundaries of what is possible in the realm of Web3,&rdquo; she added.<p>With $100 million assets under management, LBank Labs brings extensive financial resources and a vast global network to Sparke Ventures. In turn, Sparkle Ventures will reciprocate by contributing significant value to LBank Labs, leveraging their expertise, strategic insights, and innovative approach to fuel mutual growth and success.</p><p>The venture fund also aims to forge its commitment by building a comprehensive network of Fund of Funds, designed to enhance the performance and diversification of its portfolios while emphasizing the inherent value of its ecosystem network. Labs&rsquo; presence in seven global regions, including San Francisco, Dubai, and Shanghai, positions them as a powerhouse for fostering collaboration and innovation across borders.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram&nbsp;l&nbsp;Twitter&nbsp;l&nbsp;Facebook&nbsp;l&nbsp;LinkedIn&nbsp;l&nbsp;Instagram&nbsp;l&nbsp;YouTube</p>ContactGlobal PR DirectorJeremy Van der HaegenLBankpress@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T12:44:36.000Z",
    "title": "Bitvo stands strong amidst crypto exchange closures, offers a 50% discount on withdrawal fees",
    "url": "https://www.cryptopolitan.com/bitvo-stands-strong-amidst-crypto-exchange-closures-offers-a-50-discount-on-withdrawal-fees/",
    "description": "Bitvo Inc., the renowned crypto asset trading platform, is thrilled to unveil a special promotion that will undoubtedly excite new and existing customers. Starting today, June 1st, until August 31st, 2023, Bitvo will offer an incredible 50% discount on its regular withdrawal fee. This gesture comes when numerous cryptocurrency exchanges and trading platforms are regrettably ... <a title=\"Bitvo stands strong amidst crypto exchange closures, offers a 50% discount on withdrawal fees\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitvo-stands-strong-amidst-crypto-exchange-closures-offers-a-50-discount-on-withdrawal-fees/\" aria-label=\"More on Bitvo stands strong amidst crypto exchange closures, offers a 50% discount on withdrawal fees\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T13:01:20.000Z",
    "title": "US investment bank Cowen shuts crypto trading unit ",
    "url": "https://crypto.news/us-investment-bank-cowen-shuts-crypto-trading-unit/",
    "description": "Cowen Inc. has indefinitely suspended its digital assets trading unit. The bank’s digital asset service exposed institutional investors to 16 cryptocurrencies, including bitcoin (BTC) and ether (ETH). Cowen Inc., an over-a-century-old full-service investment bank acquired by North America’s leading lender,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T12:46:18.000Z",
    "title": "First Digital unveils Hong Kong-based USD stablecoin",
    "url": "https://crypto.news/first-digital-unveils-hong-kong-based-usd-stablecoin/",
    "description": "Hong Kong-based trust company First Digital is set to introduce a new stablecoin, \"First Digital USD\" (FDUSD), which will be pegged to the US dollar and regulated in Asia."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T13:07:42.000Z",
    "title": "PanCakeSwap Investor Sees Big ROI Opportunity In $Golden Token, Buys 6 $BNB Of New Bep20 Crypto",
    "url": "https://www.crypto-news-flash.com/pancakeswap-investor-sees-big-roi-opportunity-in-golden-token-buys-6-bnb-of-new-bep20-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=pancakeswap-investor-sees-big-roi-opportunity-in-golden-token-buys-6-bnb-of-new-bep20-crypto",
    "description": "<p>A Crypto whale alert for the Golden Inu token ecosystem was made yesterday.    A new investor spiked by the binance-chain based tokens’ value. The trader made a purchase via PancakeSwap exchange much larger than the previous 30 days of day-to-day buyers of the new coin. Totalling over 6 $BNB coins in value, the $Golden [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/pancakeswap-investor-sees-big-roi-opportunity-in-golden-token-buys-6-bnb-of-new-bep20-crypto/\">PanCakeSwap Investor Sees Big ROI Opportunity In $Golden Token, Buys 6 $BNB Of New Bep20 Crypto</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T13:01:31.000Z",
    "title": "MOSDEX Celebrates 1st Anniversary With An Exceptional Staking Rebate Event",
    "url": "https://www.crypto-news-flash.com/mosdex-celebrates-1st-anniversary-with-an-exceptional-staking-rebate-event/?utm_source=rss&utm_medium=rss&utm_campaign=mosdex-celebrates-1st-anniversary-with-an-exceptional-staking-rebate-event",
    "description": "<p>Mosdex, the pioneering platform in the ever-evolving world of cryptocurrency, proudly marks the significant milestone of its 1st Anniversary since launching its AI-Powered Arbitrage Protocol for individual customers. As we reflect on this remarkable journey together, Mosdex is excited to unveil an exceptional event that will delight its user base. From June 1st to July [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/mosdex-celebrates-1st-anniversary-with-an-exceptional-staking-rebate-event/\">MOSDEX Celebrates 1st Anniversary With An Exceptional Staking Rebate Event</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T12:58:08.000Z",
    "title": "Bitcoin to Reach $100,000 by End of 2023 and $1 Billion in 2038, Predicts industry giant Fidelity",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-to-reach-100000-by-end-of-2023-and-1-billion-in-2038-predicts-industry-giant-fidelity/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-to-reach-100000-by-end-of-2023-and-1-billion-in-2038-predicts-industry-giant-fidelity",
    "description": "<p>Bitcoin (BTC) has been getting a number of positive projections from industry leaders. Latest is the $100,000 prediction from Fidelity Investment&#8217;s Jurrien Timmer by the end of this year. Jurrien Timmer, Director of Global Macro at Fidelity Investments, have made a bold forecast that the world’s biggest cryptocurrency Bitcoin (BTC) will reach $100,000 by the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-btc-to-reach-100000-by-end-of-2023-and-1-billion-in-2038-predicts-industry-giant-fidelity/\">Bitcoin to Reach $100,000 by End of 2023 and $1 Billion in 2038, Predicts industry giant Fidelity</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T12:56:15.000Z",
    "title": "ChatGPT and Google Bard price prediction for Shiba Inu and Tradecurve",
    "url": "https://www.crypto-news-flash.com/chatgpt-and-google-bard-price-prediction-for-shiba-inu-and-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=chatgpt-and-google-bard-price-prediction-for-shiba-inu-and-tradecurve",
    "description": "<p>Two of the most advanced large language model AIs used today include ChatGPT and Google Bard, investors and traders in the Web3 space have begun using them in creative ways in order to accurately predict the future value of specific cryptocurrencies.  To figure out what the future might hold for Shiba Inu and Tradecurve, we [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/chatgpt-and-google-bard-price-prediction-for-shiba-inu-and-tradecurve/\">ChatGPT and Google Bard price prediction for Shiba Inu and Tradecurve</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T12:39:51.000Z",
    "title": "LBank Labs Invests in Sparkle Ventures to Ignite Innovation in Web3",
    "url": "https://www.crypto-news-flash.com/lbank-labs-invests-in-sparkle-ventures-to-ignite-innovation-in-web3/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-invests-in-sparkle-ventures-to-ignite-innovation-in-web3",
    "description": "<p>Road Town, British Virgin Islands, June 1st, 2023, Chainwire LBank Labs, a leading blockchain venture fund, is pleased to announce an investment in Sparkle Ventures, a prominent fund manager based in Luxembourg. The strategic investment aims to foster innovation and support the growth of highly-scalable Web3 infrastructures on a global scale. LBank Labs, known for [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/lbank-labs-invests-in-sparkle-ventures-to-ignite-innovation-in-web3/\">LBank Labs Invests in Sparkle Ventures to Ignite Innovation in Web3</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T13:00:00.000Z",
    "title": "Crypto Market Takes a Knock, Leaving the Alt Market Cap at Risk",
    "url": "https://coinedition.com/crypto-market-takes-a-knock-leaving-the-alt-market-cap-at-risk/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-at-a-Crossroads-Will-They-Rise-or-Fall.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The collective market cap of the crypto market dropped 0.50% over the past 24 hours, according to CoinMarketCap. This brought the total down to around $1.13 trillion at press time. During this period, altcoins also took a bit of a tumble, with the total altcoin market cap dropping more than 1.8%. The latest drop in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-market-takes-a-knock-leaving-the-alt-market-cap-at-risk/\">Crypto Market Takes a Knock, Leaving the Alt Market Cap at Risk</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T12:40:00.000Z",
    "title": "Inscription Transactions Are Game Changer For Bitcoin Network",
    "url": "https://coinedition.com/inscription-transactions-are-game-changer-for-bitcoin-network/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Inscription Transactions on the Bitcoin (BTC) network have witnessed an impressive surge in popularity, with a notable contribution from BRC-20 tokens, according to a recent Twitter post by the on-chain analytics firm Glassnode. The post added that these transactions now make up a substantial 39% of all transactions on the Bitcoin network. In addition to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/inscription-transactions-are-game-changer-for-bitcoin-network/\">Inscription Transactions Are Game Changer For Bitcoin Network</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]