[
  {
    "source": "CoinDesk",
    "date": "2024-04-08T08:18:31.000Z",
    "title": "Bitcoin Tops $71K, Ordinals Bets Rise Ahead of Halving",
    "url": "https://www.coindesk.com/markets/2024/04/08/bitcoin-tops-71k-ordinals-bets-rise-ahead-of-halving/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Broader crypto markets remained little changed over the weekend but some Ordinal ecosystems saw gains as a proxy bet for BTC."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T08:33:45.000Z",
    "title": " ParaSwap DAO allocates funds for hack victims&#039; compensation ",
    "url": "https://cointelegraph.com/news/paraswap-allocates-funds-hack-compensation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvN2ZiY2M5NWUtZDI2My00MTcwLTljYzAtMzAzMWMzNDAzZmY2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The ParaSwap Augustus v6 contract, which momentarily went live on March 18, contained a critical vulnerability that allowed hackers to drain funds from users who approved the upgrade.</p>\n                    <p><p>The community behind the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> aggregator ParaSwap has agreed to compensate hack victims using funds from the treasury. </p><p>On April 4, the ParaSwap decentralized autonomous organization (DAO) pitched the idea of refunding the <a href=\"https://cointelegraph.com/news/paraswap-hack-augustus-v6-contract-vulnerability\">victims of the Augustus V6 contract vulnerability</a> using its treasury funds. </p><p>After a three-day voting period, 96.81% of ParaSwap voters agreed with the DAO’s proposed method of compensating users.</p><p><a href=\"https://cointelegraph.com/news/paraswap-allocates-funds-hack-compensation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-08T08:13:22.000Z",
    "title": "HashKey Group secures Bermuda license, launches new global crypto exchange",
    "url": "https://cryptobriefing.com/hashkey-bermuda-license-new-exchange/",
    "description": "The Asia-based financial group is expanding its presence beyond the region, aiming at new markets across the globe."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T08:20:12.000Z",
    "title": "HashKey Group Launches Global Exchange, Expands Digital Asset Services in Asia",
    "url": "https://www.cryptopolitan.com/hashkey-group-launches-global-exchange/",
    "description": "HashKey Group, a leading digital asset service provider in Asia, has announced the launch of its HashKey Global exchange. This move comes after a successful acquisition of a license in Bermuda for carrying out licensed digital assets trading activities, which was announced on Monday. Livio Weng, Chief Operating Officer of HashKey Group, commented that the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T08:19:12.000Z",
    "title": "Data Scientists Are Highly Paid Among Tech Professionals—NodeFlair Study",
    "url": "https://www.cryptopolitan.com/data-scientists-are-highly-paid-nodeflair/",
    "description": "According to a new study conducted by NodeFlair, data scientists salaries have grown many folds during the last year. Previously, software engineers were considered the most highly paid professionals in the tech sector, but now data scientists have overtaken them, at least in Singapore. Cybersecurity and artificial intelligence professionals are now the highest paid and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-08T08:34:42.000Z",
    "title": "FARM token surges 80% in a day amidst trading frenzy",
    "url": "https://crypto.news/farm-token-surges-80-in-a-day-amidst-trading-frenzy/",
    "description": "FARM, the native token of the yield farming protocol Harvest Finance, was trending in the U.S. as it was exchanging hands at $88, up 80% in the past day. At the time of writing, FARM had a 24-hour trading volume&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-04-08T08:27:03.000Z",
    "title": "ApeBond: New Era in DeFi and Community Unity",
    "url": "https://www.altcoinbuzz.io/product-release/apebond-new-era-in-defi-and-community-unity/",
    "description": "<p>ApeBond is a new and improved version of ApeSwap, the popular decentralized exchange (DEX). This upgrade is more than a redesign. This is a big step towards building a better decentralized finance (DeFi) world. Let&#8217;s discover more about ApeBond. The Revolutionary Upgrade of ApeSwap to ApeBond ApeBond is about bringing the community together and driving [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/apebond-new-era-in-defi-and-community-unity/\">ApeBond: New Era in DeFi and Community Unity</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]