[
  {
    "source": "CoinDesk",
    "date": "2023-12-01T21:56:53.000Z",
    "title": "Protocol Village: Blast, Envisioned as Layer-2 With Yield, Now Hiring",
    "url": "https://www.coindesk.com/tech/2023/11/30/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 30-Dec. 6, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-01T22:04:09.000Z",
    "title": "Grayscale: Bitcoin ETF Approval Is a 'Matter of When, Not If'",
    "url": "https://decrypt.co/208321/grayscale-bitcoin-etf-approval-when-not-if",
    "description": "Although Grayscale says Bitcoin ETF timelines are \"inherently uncertain,\" it still believes an approval is a \"matter of when, not if.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-01T21:39:58.000Z",
    "title": " Nayib Bukele steps down as El Salvador’s President ahead of re-election bid ",
    "url": "https://cointelegraph.com/news/nayib-bukele-resigns-president-el-salvador",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYmM5NGEwNzYtMzNkNC00ZWQxLTgzYzktODA1N2VhODI5Nzg4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Acting President Claudia Rodríguez de Guevara, the first female head of state for El Salvador, took office on Dec. 1 and is expected to serve until June 2024.</p>\n                    <p><p>El Salvador President <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/nayib-bukele\">Nayib Bukele</a>, who was behind legislation recognizing Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) as legal tender in the country, has stepped down from office to campaign.</p><p>On Dec. </p><p>“Current state of democracy in El Salvador: the office of the President of the Republic will be occupied by a person for whom no one has ever voted,” <a href=\"https://twitter.com/hectorsilva/status/1730444954910994524\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Héctor Silva, candidate for the mayor’s office of San Salvador, on X.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">El legado correcto <br><br>The right legacy <br> <a href=\"https://t.co/dO2c0ZtQUN\">https://t.co/dO2c0ZtQUN</a></p>— Nayib Bukele (@nayibbukele) <a href=\"https://twitter.com/nayibbukele/status/1729681624156058015?ref_src=twsrc%5Etfw\">November 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>Bukele, who first took office in June 2019, quickly became known for his attempts to reduce the homicide rate in El Salvador — one of the highest in the world at the time — as well as his pro-crypto policies. He advocated for the Salvadoran government to adopt Bitcoin as legal tender in September 2021 and <a href=\"https://cointelegraph.com/news/el-salvador-focused-on-bringing-investment-to-bitcoin-city-says-ambassador\" >pushed for the creation</a> of a volcano-powered ‘Bitcoin City’ in the country.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/el-salvador-pro-bitcoin-president-nayib-bukele-reelection\" ><strong><em>Salvadoran pro-Bitcoin President Nayib Bukele launches reelection bid</em></strong></a></p><p>Though the homicide rate under Bukele has dropped significantly, many critics have pointed to El Salvador violating laws on human rights in its attempts to crack down on gang activity. </p><p><a href=\"https://cointelegraph.com/news/nayib-bukele-resigns-president-el-salvador\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-01T21:45:42.000Z",
    "title": "Ukraine seizes $1.5m in crypto from former official",
    "url": "https://crypto.news/ukraine-seizes-1-5m-in-crypto-from-former-official/",
    "description": "The National Anti-Corruption Bureau of Ukraine has seized crypto assets worth $1.5 million from Yury Shchigol, ex-chief of the Special Communications Service."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-01T22:00:52.000Z",
    "title": "Ethereum Price Prediction: Crypto Analysts Reveal Catalyst That Will Drive Price Above $3,500",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-price-predictio-3500/",
    "description": "A crypto analyst has singled out an event that could be the spark that Ethereum needs to hit the price level of $3,500. He believes that the second-largest cryptocurrency by market cap is going to make this run after Bitcoin “gets its shine.” How Ethereum Will Hit $3,500 In a post shared on his X (formerly Twitter) platform, the CEO and founder of MN Trading, Michaël van de Poppe, alluded to the Ethereum Spot ETF filing by Fidelity in his price prediction of $3,500. The crypto analyst seemed to be suggesting that approval of an Ethereum Spot ETF could propel Ethereum’s price to such heights.  Related Reading: XRP Price Prediction: Analyst Identifies 3 Key Factors That Will Trigger Parabolic Move His reference to Bitcoin also confirms that this might indeed be van de Poppe’s “thesis.” He spoke about Ethereum “running to $3,500 in Q1 2024” after Bitcoin has had its shine. The “shine” likely refers to the possible approval of a Spot Bitcoin ETF. Some analysts have predicted that there is a 90% chance that a Spot Bitcoin ETF will be approved by January 10, 2024. With this in mind, the crypto analyst possibly believes that approval of an Ethereum Spot ETF could come not long after once the Spot Bitcoin ETF is approved. If that happens, it could spark a massive rally in Ethereum’s price. That could explain why Michaël van de Poppe is predicting Ethereum to run to $3,500.  Several asset managers have already applied with the Securities and Exchange Commission (SEC) to offer an Ethereum Spot ETF. However, all eyes seem to be on the SEC’s decision on the pending Spot Bitcoin ETF applications. This could simply be because a final decision is expected on the pending Spot Bitcoin ETF applications, unlike Ethereum’s, which still have a longer review process. ETH price steadies above $2,000 &#124; Source: ETHUSD on Tradingview.com Ethereum Spot ETFs May Not Get The Same Reception Historically speaking, there is reason to believe that Ethereum Spot ETFs might not enjoy the same reception that Spot Bitcoin ETFs have gotten so far. This is based on the fact that there was a stark comparison in the numbers when the futures ETF of both crypto tokens launched.  Related Reading: Shiba Inu L2 Shibarium Crosses 4 Million Transactions As Burn Rate Explodes Bitcoin futures ETFs were already in place as of 2021, with ProShares Bitcoin Strategy (BITO) ETF being the first to launch. Meanwhile, Ethereum futures ETFs just launched this year. What is most interesting is the trading volume that BITO saw on its launch date in comparison to all Ethereum futures ETFs on their launch date.  BITO is reported to have seen more than $1 billion in trading volume in the first two days of launching. On the other hand, the total trading volume for Ether ETFs on their launch day amounted to just under $2 million.  Featured image from Tron Weekly, chart from Tradingview.com"
  }
]