[
  {
    "source": "Cointelegraph",
    "date": "2023-12-21T06:45:55.000Z",
    "title": " Large AI training data set removed after study finds child abuse material ",
    "url": "https://cointelegraph.com/news/laion-5b-ai-data-set-removed-child-sexual-abuse-material",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTRmZTNhYzctODNmOC00MDI0LTkyNWQtYTkyZWY1M2JiYmI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>LAION-5B, a large artificial intelligence data set used to train several popular text-to-image generators, was found to contain child sexual abuse material. </p>\n                    <p><p>A widely-used artificial intelligence data set used to train Stable Diffusion, Imagen and other AI image generator models has been removed by its creator after a study found it contained thousands of instances of suspected child sexual abuse material. </p><p>LAION — also known as Large-scale Artificial Intelligence Open Network, is a German nonprofit organization that makes open-sourced artificial intelligence models and data sets used to train several popular text-to-image models.</p><p>A Dec. 20 report from researchers at the Stanford Internet Observatory’s Cyber Policy Center said they identified 3,226 instances of suspected CSAM — or child sexual abuse material — in the LAION-5B data set, \"much of which was confirmed as CSAM by third parties,” according to Stanford Cyber Policy Center's Big Data Architect and Chief Technologist David Thiel.</p><p><a href=\"https://cointelegraph.com/news/laion-5b-ai-data-set-removed-child-sexual-abuse-material\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-21T06:42:36.000Z",
    "title": " El Salvador tops Bitcoin-interest charts as Brazil overtakes Nigeria ",
    "url": "https://cointelegraph.com/news/el-salvador-tops-bitcoin-interest-charts-brazil-overtakes-nigeria",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOTdhZGUwNWYtMDJmOC00YjI5LWE2NWUtZjQ0YjllMGU0NmUyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In Nigeria, stablecoins have become the favored cryptocurrency because they’re tied to a widely accepted asset, the U.S. dollar, providing a hedge against inflation and the devaluation of the naira.</p>\n                    <p><p>Brazil has knocked Nigeria, Africa’s largest economy, off its second-place perch on the interest-in-Bitcoin rankings. El Salvador has retained its position in the top spot, Brazil is next in line, and Nigeria is in third place, data from Google Trends shows.</p><p>The data <a href=\"https://trends.google.com/trends/explore?date=now%201-H&amp;q=bitcoin&amp;hl=en\" target=\"_blank\" rel=\"noopener nofollow\">suggests</a> that as Bitcoin popularity expands in Brazil, Latin America’s most populous country, Nigerian crypto users are increasingly favoring USDT stablecoin over Bitcoin. In 2022, El Salvador held the top spot, Nigeria occupied second place and Brazil was in third place.</p><p>El Salvador has retained its top spot in Bitcoin interest as the country's commitment to Bitcoin solidifies. On Dec. 7, the <a href=\"https://cointelegraph.com/news/el-salvador-bitcoin-freedom-visa-more-expensive-citizenship-by-investment\">El Salvador government, </a>in partnership with stablecoin issuer Tether, launched the Freedom Visa - a citizenship-by-donation program that grants residency and a pathway to citizenship for 1,000 people willing to put down a $1 million Bitcoin<a href=\"https://cointelegraph.com/bitcoin-price\"> (BTC)</a> or Tether<a href=\"https://cointelegraph.com/tether-price-index\"> (USDT)</a> donation toward the country.</p><p><a href=\"https://cointelegraph.com/news/el-salvador-tops-bitcoin-interest-charts-brazil-overtakes-nigeria\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T06:58:26.000Z",
    "title": "AI-Powered SEO Tools: A Comprehensive Guide for 2024",
    "url": "https://www.cryptopolitan.com/ai-powered-seo-tools/",
    "description": "AI-driven technologies have revolutionized the world of SEO, offering over 100 free AI chatbots, cost-effective tools, and scalable solutions catering to marketing agencies and enterprises. In recent years, artificial intelligence (AI) has become an indispensable part of various digital landscapes, particularly in search engine optimization (SEO). In this comprehensive guide, we will delve into the [&#8230;]"
  }
]