[
  {
    "source": "CoinDesk",
    "date": "2023-06-22T12:18:27.000Z",
    "title": "First Mover Americas: BTC Crosses $30K and Bitcoin Layer 2 Stacks Networks Gains 15% ",
    "url": "https://www.coindesk.com/markets/2023/06/22/first-mover-americas-btc-crosses-30k-and-bitcoin-layer-2-stacks-networks-gains-15/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 22, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-22T12:19:05.000Z",
    "title": "Atomic Wallet Claims 'Less Than 0.1%' of Users Affected by $100M Hack",
    "url": "https://decrypt.co/145765/atomic-wallet-claims-less-than-0-1-of-users-affected-by-100m-hack",
    "description": "The Atomic Wallet team reported that they are working to recover the funds, but would not confirm how much money was stolen in the attack."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T12:33:48.000Z",
    "title": "Gods Unchained launches to 230 million players on Epic Games Store",
    "url": "https://www.cryptopolitan.com/gods-unchained-launches-on-epic-games-store/",
    "description": "Immutable Games, a global pioneer in web3 game creation and publishing, has announced that its flagship product, Gods Unchained – Ethereum&#8217;s highest-grossing trading card game — has become the next crypto game to premiere on major digital distribution platform Epic Games Store (EGS). According to a June 21 release, the game is now available to ... <a title=\"Gods Unchained launches to 230 million players on Epic Games Store\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gods-unchained-launches-on-epic-games-store/\" aria-label=\"More on Gods Unchained launches to 230 million players on Epic Games Store\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T12:31:41.000Z",
    "title": "Ripple receives in-principle regulatory approval in Singapore",
    "url": "https://www.cryptopolitan.com/ripple-in-principle-regulatory-approval/",
    "description": "Ripple, a blockchain-based payments firm, has received provisional regulatory approval from Singapore&#8217;s financial regulator, the Monetary Authority of Singapore (MAS), to offer digital asset payments and token products in the country. Ripple&#8217;s subsidiary, Ripple Markets Asia Pacific, will be able to expand its On-Demand Liquidity (ODL) service, which enables customers to move XRP globally without ... <a title=\"Ripple receives in-principle regulatory approval in Singapore\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-in-principle-regulatory-approval/\" aria-label=\"More on Ripple receives in-principle regulatory approval in Singapore\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T12:14:27.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T12:22:11.000Z",
    "title": "Web3 game Gods Unchained expands to Epic Games Store",
    "url": "https://crypto.news/web3-game-gods-unchained-expands-to-epic-games-store/",
    "description": "Immutable Games has expanded the reach of its Web3 digital trading card game, Gods Unchained, with its recent launch on the renowned Epic Games Store."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T12:30:51.000Z",
    "title": "‘Ripple (XRP) Is A Must-Hold For The Next Bull Run,’ Says Bitcoin Maxi",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-xrp-is-a-must-hold-for-the-next-bull-run-says-bitcoin-maxi/",
    "description": "In the often-polarizing universe of crypto, it isn&#8217;t often that an established Bitcoin maximalist or advocate publicly places a bet on a different coin. However, in a sudden turn of events, Crypto Rover, a crypto influencer and Bitcoin devotee, recently confirmed his substantial investment in XRP. The influencer did not only seem to boast its latest XRP purchase but also gave advice in the same tweet that read &#8220;Ripple is a must-hold for the next Bull Run.&#8221; While this type of word coming from a Bitcoin maxi is quite unusual, there could be possible reasons behind the BTC devotee XRP support. Unforeseen Support For XRP From A Bitcoin Proponent Crypto Rover who is famous for his Bitcoin-centric views recently surprised the crypto community by revealing a major purchase of $250,000 in XRP in recent weeks. He shared this update via a tweet, indicating a departure from his usual investment pattern of Bitcoin holdings. Related Reading: XRP Price Projection: Assessing The Ripple-Colombia Central Bank Partnership According to the influencer, he believes Ripple will emerge winner in its ongoing legal proceedings, which, in his opinion, may lead to a widespread FOMO (Fear of Missing Out) effect. It is worth noting that this factor alone could be one of the reasons behind the Bitcoin Maxi&#8217;s sudden support for XRP.  Ripple will win the case, and the $XRP FOMO will be insane. I have bought $250,000 worth of #XRP in the past few weeks. I don&#8217;t have a lot of #Altcoins in my portfolio now. But Ripple is a must-hold for the next Bull Run. — Crypto Rover (@rovercrc) June 21, 2023 Rover&#8217;s backing of XRP spurred an enthusiastic reaction from the XRP community, leading to speculation and investment interest. Comments following his announcement range from assertions of Ripple&#8217;s stocks and XRP as a &#8216;must-hold&#8217; to enthusiastic declarations of imminent large XRP purchases, citing it as a &#8216;lifetime opportunity&#8217;. Ripple Court Case &#8211; A Deciding Factor For XRP&#8217;s Future? Ripple Labs, the firm responsible for the creation of XRP, is currently in a legal dispute with the United States Securities and Exchange Commission (SEC). The crux of the argument revolves around whether XRP should be classified as a security. So far, Ripple Labs has moved to dismiss the lawsuit filed against it by the SEC. The company maintains that XRP, unlike traditional securities, functions as a digital currency due to its utility and decentralized attributes. Ripple is challenging the SEC&#8217;s jurisdiction in this matter and criticizes the regulatory body for not providing clear guidance on XRP&#8217;s status as a security. The company asserts that the ongoing legal battle has negatively impacted XRP holders and hindered innovation in the crypto industry. As such, the court&#8217;s decision on Ripple&#8217;s request for dismissal is highly anticipated and could significantly influence the course of the lawsuit. Related Reading: XRP Price Could Regain Strength If It Clears This Resistance If approved, it could pose a serious blow to the SEC&#8217;s case and if not, the legal dispute will proceed with the SEC&#8217;s allegations against Ripple still in play. Overall, a win for Ripple could potentially influence how digital assets are classified, improving XRP&#8217;s standing and possibly enhancing its price. Meanwhile, amid the ongoing legal dispute, XRP is still able to mirror the ubiquitous uptrend in the global crypto market. Over the past 24 hours, XRP has surged 3.5% with a market price above $0.5, at the time of writing. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T12:37:46.000Z",
    "title": "Ultimate Guide to Spotting Top & Best Meme Coins – Hollywood X PEPE",
    "url": "https://www.crypto-news-flash.com/ultimate-guide-to-spotting-top-best-meme-coins-hollywood-x-pepe/?utm_source=rss&utm_medium=rss&utm_campaign=ultimate-guide-to-spotting-top-best-meme-coins-hollywood-x-pepe",
    "description": "Cryptocurrencies have been taking over the financial world, with meme coins becoming increasingly popular among enthusiasts and investors. One such coin gaining traction is the Hollywood X PEPE $HXPE, best meme coin that&#8217;s currently in its Presale Stage 1 Before we delve deeper into $HXPE and other potential top meme coins, let&#8217;s first understand the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-22T12:30:23.000Z",
    "title": "3 Coins That Grew +40% In the Last Week",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-coins-that-grew-40-in-the-last-week/",
    "description": "<p>In the last 7 days, the price of bitcoin has grown 20% due to the great interest of different investment groups in creating an ETF. As a result, altcoins also tend to increase in price. In this article, we will tell you which coins grew by at least 40% in the last 7 days. 1) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-coins-that-grew-40-in-the-last-week/\">3 Coins That Grew +40% In the Last Week</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]