[
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T04:23:39.000Z",
    "title": "​​JPEX scandal won’t hurt Hong Kong crypto vision: Financial Secretary",
    "url": "http://cointelegraph.com/news/jpex-scandal-wont-impact-hong-kong-crypto-vision-financial-secretary",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1b71f8fb-421a-400f-b9f2-6c5b6be55300.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Christopher Hui took the stage at Fintech Week and outlined a list of regulatory moves Hong Kong authorities are looking to implement following the JPEX scandal. </p>\n                    <p><p>The Hong Kong government says the recent $165 million alleged scandal involving crypto exchange JPEX won’t  stifle its Web3 vision for the region. </p><p>In a Nov. 2 keynote at Hong Kong Fintech Week, the region’s Secretary for Financial Services and the Treasury Christopher Hui said the saga hasn’t affected the government’s plan.</p><blockquote>“We’ve been asked many times whether JPEX will affect our determination to grow the Web3 market — the answer is a clear ‘no.’”</blockquote><p>Hui was referring to the financial scandal involving the Dubai-based exchange JPEX, where 2,500 locals allege they were allegedly defrauded, prompting the Securities and Futures Commission (SFC) to warn that JPEX was <a href=\"https://cointelegraph.com/news/jpex-increases-withdrawal-fee-to-almost-1k-after-warning-from-hong-kong-s-watchdog\">promoting its services locally</a> without a license.</p><p>Hong Kong said it <a href=\"https://cointelegraph.com/news/crypto-rules-hong-kong-tightened-after-jpex-fraud-case\">would tighten</a> its crypto regulations after JPEX’s alleged actions. Additionally, the SFC set up a <a href=\"https://cointelegraph.com/news/hong-kong-police-sfc-crypto-task-force-jpex-scandal\">task force with the police</a> to deal with illicit crypto exchange activities and <a href=\"https://cointelegraph.com/news/hong-kong-regulator-changes-crypto-policies\">updated its policies</a> on crypto sales and requirements.</p><p>Hui said “a lot of things are going on on the regulatory front” — part of the government’s future Web3 regulatory framework plan sees the SFC issuing guidance on tokenized securities and the tokenization of SFC-authorized investment products.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/243a2a81-34f8-422a-8f7b-b9f728493506.jpg\"  /><figcaption style=\"text-align: center;\"><em>Hui discusses the government’s plans for its Web3 regulatory framework. (Cointelegraph/Tom Mitchelhill)</em></figcaption></figure><p>Crypto regulations will also be expanded to cover buying and selling “beyond trades taking place on now-regulated trading platforms,” Hui said.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-cbdc-pilot-e-hkd-trials-phase-2\"><strong><em>Hong Kong advances CBDC pilot, bringing e-HKD trials to phase 2</em></strong></a></p><p>A “much sought after” joint consultation on stablecoins by the Hong Kong Monetary Authority (HKMA) and the Financial Services and the Treasury Bureau is also set to drop soon, which will take feedback from a <a href=\"https://cointelegraph.com/news/hong-kong-will-not-tolerate-algorithmic-stablecoins-in-new-regulation\">January HKMA discussion paper</a>.</p><p>Reports earlier this year said the <a href=\"https://cointelegraph.com/news/hong-kong-government-pressures-bank-giants-accept-crypto-clients\">HKMA pressured banks</a> to provide services to crypto companies in the religion. Hui said the HKMA will consult the sector on guidance for “banks providing digital asset custodial services.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/?doing_wp_cron=1691052881.1558809280395507812500\"><strong><em>Chinese police vs. Web3, blockchain centralization continues: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T04:19:00.000Z",
    "title": "What is the Black Box Dilemma of Using AI for Reputation Management – Exclusive Report",
    "url": "https://www.cryptopolitan.com/what-is-the-black-box-dilemma-of-using-ai/",
    "description": "In today&#8217;s fast-paced digital landscape, the art of maintaining a positive brand image is significantly shifting, thanks to Artificial Intelligence (AI). With its capacity to process enormous amounts of data at lightning speed, spot emerging trends, and facilitate rapid responses, AI has revolutionized reputation management. This powerful technology enables businesses to forecast public sentiment, tackle ... <a title=\"What is the Black Box Dilemma of Using AI for Reputation Management &#8211; Exclusive Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-is-the-black-box-dilemma-of-using-ai/\" aria-label=\"More on What is the Black Box Dilemma of Using AI for Reputation Management &#8211; Exclusive Report\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T04:28:29.000Z",
    "title": "Ethereum Bulls Keeps Pushing, Why Rally Could Soon Reach $2,000",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-bulls-keeps-pushing-2000/",
    "description": "Ethereum price popped above the $1,850 resistance against the US dollar. ETH is showing positive signs and might soon climb toward the $2,000 resistance. Ethereum is slowly moving higher above the $1,850 resistance zone. The price is trading above $1,820 and the 100-hourly Simple Moving Average. There was a break above a key declining channel with resistance near $1,818 on the hourly chart of ETH/USD (data feed via Kraken). The pair is signaling bullish signs and a possible move toward the $2,000 resistance. Ethereum Price Aims Higher Ethereum formed a base above the $1,780 level and recently started a steady increase, like Bitcoin. ETH gained pace for a move above the $1,820 resistance zone. There was a break above a key declining channel with resistance near $1,818 on the hourly chart. It sparked bullish moves and pushed the price above the main hurdle at $1,850. The price traded to a new multi-week high at $1,875 and is currently consolidating gains. Ethereum is now trading above $1,820 and the 100-hourly Simple Moving Average. It is also above the 23.6% Fib retracement level of the recent increase from the $1,784 swing low to the $1,875 high. On the upside, the price is facing resistance near the $1,875 level. If ETH surpasses the $1,875 resistance, it could again start a steady increase and test $1,920. The next key resistance is near $1,950, above which the price could accelerate higher toward the $2,0000 level. Source: ETHUSD on TradingView.com Any more gains might call for a move toward the $2,050 level. In the stated case, the price could even climb toward the $2,120 level. Are Dips Limited in ETH? If Ethereum fails to clear the $1,875 resistance, it could start a downside correction. Initial support on the downside is near the $1,850 level. The next key support is $1,820 or the 61.8% Fib retracement level of the recent increase from the $1,784 swing low to the $1,875 high. The main support is now forming near the $1,800 level and the 100-hourly Simple Moving Average. A downside break below the $1,800 support might spark a bearish wave. In the stated case, Ether could drop toward the $1,750 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,820 Major Resistance Level – $1,875"
  }
]