[
  {
    "source": "Decrypt",
    "date": "2024-01-12T02:45:00.000Z",
    "title": "Generative Art Across Mediums: Artists Discuss the Evolving Space",
    "url": "https://decrypt.co/videos/live-events/GK3aN0zo/generative-art-across-mediums-artists-discuss-the-evolving-space",
    "description": "In this panel discussion from Rug Radio's R Haus at Art Basel Miami 2023, Sofia Garcia, Ismail Tazi, Emily Edelman, and Aleksandra Art discuss the expanding generative art space—and why \"generative\" doesn't necessarily have to mean digital."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-12T03:01:00.000Z",
    "title": "Ethereum’s Price Soars as Bitcoin Spot ETFs Launch; Ether ETFs on the Horizon?",
    "url": "https://www.cryptoglobe.com/latest/2024/01/ethereums-price-soars-as-bitcoin-spot-etfs-launch-ether-etfs-on-the-horizon/",
    "description": "The price of the second-largest cryptocurrency Ethereum ($ETH), saw a surprising surge shortly after the historic approval of spot Bitcoin exchange-traded funds (ETFs) in the United States as investors are weighing the potential of a spot Ether ETF being approved. The price of Ethereum jumped more than 10% shortly after 11 spot Bitcoin ETFs were […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T03:00:58.000Z",
    "title": "Bitcoin Price Struggles Below $48K, Why BTC Could Correct Lower",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-struggles-below-48k/",
    "description": "Bitcoin price started another increase above the $46,500 resistance. BTC cleared the $47,800 resistance and spiked toward $48,000 before the bears appeared. Bitcoin topped near the $49,000 level and corrected gains. The price is trading above $45,500 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $45,900 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh decline if there is a move below the $45,600 support zone. Bitcoin Price Faces Rejection Bitcoin price attempted a fresh increase above the $46,800 and $47,200 levels. BTC even cleared the $48,000 resistance and spiked toward $49,000. A new multi-week high was formed near $49,000 before the price trimmed all gains. There was a sharp move below the $47,500 and $47,000 levels. The price even retested the $45,500 support zone. A low was formed near $45,619 and the price is now consolidating losses. Bitcoin is trading above $45,500 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $45,900 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $46,400 level and the 23.6% Fib retracement level of the downward move from the $49,000 swing high to the $45,619 low. The first major resistance is $47,300 or the 50% Fib retracement level of the downward move from the $49,000 swing high to the $45,619 low. A clear move above the $47,300 resistance could send the price toward the $48,200 resistance. Source: BTCUSD on TradingView.com The next resistance is now forming near the $49,000 level. A close above the $49,000 level could send the price further higher. The next major resistance sits at $50,000. More Losses In BTC? If Bitcoin fails to rise above the $47,300 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $45,900 level and the trend line. The next major support is $45,500. If there is a move below $45,500, the price could gain bearish momentum. In the stated case, the price could drop toward the $44,450 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $45,900, followed by $45,500. Major Resistance Levels – $47,300, $48,200, and $49,000."
  }
]