[
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T03:21:57.000Z",
    "title": "CBDCs aren't about solving today's problems — Australia's CBDC lead",
    "url": "https://cointelegraph.com/news/australia-cbdc-solves-problems-tomorrow-dilip-rao",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a4bf5599-174b-4de4-bbd0-5545154d4a1d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dilip Rao, a former Ripple executive who's now leading Australia’s CBDC pilot has been examining 14 possible use cases of central bank digital currencies.</p>\n                    <p><p>Central Bank Digital Currencies (CBDCs) may not solve any problems faced today, but could be the answer to ones not even fathomed yet, says the executive spearheading Australia’s CBDC pilot. </p><p>Speaking to Cointelegraph, Dilip Rao, a former Ripple executive who's now spearheading Australia’s in-pilot CBDC research project, believes a central bank-issued currency could be built for use cases not yet considered:</p><blockquote>“It may not solve a problem today, but maybe it solves a problem the day after tomorrow.”</blockquote><p>Rao serves as the research program director at the Digital Finance Cooperative Research Centre (DFCRC) which is collaborating with the Reserve Bank to explore <a href=\"https://cointelegraph.com/news/australian-central-bank-to-launch-live-pilot-of-cbdc-in-coming-months\">use cases of a potential CBDC</a>. </p><p>Rao, however, said the question is yet to be answered why individuals would want or need to use one.</p><p>One possible future use, Rao explained, could be large institutions trading tokenized assets on marketplaces that may prefer using a CBDC to mitigate risks.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Big shout out to attendees at the <a href=\"https://twitter.com/hashtag/AustralianCBDCPilot?src=hash&amp;ref_src=twsrc%5Etfw\">#AustralianCBDCPilot</a> Conference last Friday - 100 in person and over 150 online!<br><br>15 use cases demonstrated, three panels offered deeper insights into the <a href=\"https://twitter.com/hashtag/futureofmoney?src=hash&amp;ref_src=twsrc%5Etfw\">#futureofmoney</a>!<br><br>Thanks <a href=\"https://twitter.com/RBAInfo?ref_src=twsrc%5Etfw\">@RBAInfo</a>, <a href=\"https://twitter.com/DigiFinanceCRC?ref_src=twsrc%5Etfw\">@DigiFinanceCRC</a>, Treasury and all industry partners! <a href=\"https://t.co/0wvNrMechi\">pic.twitter.com/0wvNrMechi</a></p>&mdash; diliprao (@diliprao) <a href=\"https://twitter.com/diliprao/status/1662993707103326208?ref_src=twsrc%5Etfw\">May 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Australia’s CBDC pilot is examining 14 <a href=\"https://cointelegraph.com/news/australia-uses-cbdc-in-fx-transaction-pilot-test\">possible use cases</a>. Rao said the report on those tests — yet to be released — will narrow down which would deserve further exploration.</p><p>“You don’t necessarily need a CBDC in every use case,” he said. He added “people have to see value” in a CBDC if it's to be widely adopted.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-debanking-could-drive-industry-underground-australia-treasury\"><strong><em>Crypto debanking could drive industry underground: Australian Treasury</em></strong></a></p><p>Another hurdle for a CBDC, at least in Australia, would be the required legislative changes that need public backing.</p><p>For such changes to make it through parliament “politicians have to come on board,” said Rao, which would require a wide amount of public consultation.</p><p>Such consultation would focus on solving the “problems that people want solved,” according to Rao. “No politician is gonna do something that will lose votes,\" he added.</p><blockquote>“You have to go through [...] Solving those problems, whether with technology or with legislation to make sure that people were comfortable with what you were doing.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-sydney-harbor-bridge-synthetix-finder/\"><strong><em>Crypto City guide to Sydney: More than just a ‘token’ bridge</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T03:15:00.000Z",
    "title": "What Does ChatGPT Say About Chainlink (LINK) and Tradecurve (TCRV) Prices For 2023?",
    "url": "https://cryptodaily.co.uk/2023/06/what-does-chatgpt-say-about-chainlink-link-and-tradecurve-tcrv-prices-for-2023",
    "description": "<p>Chainlink (LINK) is currently one of the best cryptocurrencies. However, things in the crypto industry change rapidly, so you can never rely on only one coin.</p>\n<p>Tradecurve (TCRV) recently entered the cryptocurrency world, and although still in presale, it already faces an 80% price increase. Therefore, experts estimate that once Tradecurve (TCRV) tokens reach reputable exchanges, they can surge by 100x.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nChainlink (LINK) Price Predictions\n<p>After establishing a partnership with Stella in order to secure its DeFi strategies, Chainlink (LINK) rebounded on a bullish run. But that didn&rsquo;t last for too long.</p>\n<p>In the last 24 hours, Chainlink (LINK) decreased by 0.79%, currently standing at $6.09. The main reason for its price decline is Golteum&rsquo;s joining the Chainlink (LINK) BUILD program, which significantly pressures the Chainlink (LINK) coin. However, this should leverage the Chainlink (LINK) industry-leading technology and provide investors with secure, efficient, and transparent trading options.</p>\n<p>On a more positive note, experts believe that Chainlink (LINK) will have a positive price movement in the upcoming period if this collaboration proves to work. Additionally, ChatGPT has bright expectations about the coin as well. It forecasts that Chainlink (LINK) will reach $12 if the tokens&rsquo; supply remains constant.</p>\n<p>&lt;blockquote class=\"twitter-tweet\"&gt;&lt;p lang=\"en\" dir=\"ltr\"&gt;The past few weeks have been amazing for the &lt;a href=\"https://twitter.com/hashtag/Tradecurve?src=hash&amp;amp;ref_src=twsrc%5Etfw\"&gt;#Tradecurve&lt;/a&gt; project and community. 💎&lt;br&gt;&lt;br&gt;We have over 12,000 users who have signed up for the presale, 4,400 holders, and have raised over $2.7 million. 🔥&lt;br&gt;&lt;br&gt;For a LIMITED time only, the team is offering a 50% deposit bonus.&lt;br&gt;&lt;br&gt;👉🧵👇 &lt;a href=\"https://t.co/CCwI4aICZr\"&gt;pic.twitter.com/CCwI4aICZr&lt;/a&gt;&lt;/p&gt;&amp;mdash; Tradecurve (@Tradecurveapp) &lt;a href=\"https://twitter.com/Tradecurveapp/status/1673464018651205632?ref_src=twsrc%5Etfw\"&gt;June 26, 2023&lt;/a&gt;&lt;/blockquote&gt; &lt;script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"&gt;&lt;/script&gt;</p>\n<p></p>\nTradecurve (TCRV) Brings Waves to the Crypto Industry\n<p>Tradecurve (TCRV) is a new project representing a decentralized platform that offers numerous trading options from a single account. More precisely, you can trade cryptocurrencies, CFDs, forex, options, commodities, EFTs, indices, and bonds. Due to combining all of these options in one platform, Tradecurve (TCRV) is the first project to offer something like this.&nbsp;</p>\n<p>With Tradecurve (TCRV), you can enjoy total anonymity because the platform doesn&rsquo;t implement the lengthy KYC verification method. Also, Tradecurve has some pretty amazing benefits for investors. For instance, you can utilize copy trading that helps you implement successful traders&rsquo; techniques, high leverage starting at 500:1, and AI algorithmic or automatic trading. All you need to do is put crypto as a deposit and enjoy.&nbsp;</p>\n<p>But Tradecurve (TCRV) doesn&rsquo;t stop here. The platform is considering developing a metaverse trading academy that will help less experienced traders connect with industry experts and learn their strategies.&nbsp;</p>\n<p>However, the main reason why Tradecurve (TCRV) draws so much attention is its native TCRV tokens that have faced an 80% price increase while still in presale. You can purchase the TCRV tokens for $0.018. In addition, Tradecurve has already raised $2.8 million from its goal of $20 million, which puts it in a great position to compete with the industry&rsquo;s giants &ndash; Binance and Kraken.&nbsp;</p>\n<p>Crypto analysts forecast that TCRV tokens will experience a 50x surge while in presale and an additional 100x once they get listed on a tier 1 CEX. So why don&rsquo;t you hurry up and take advantage of the Tradecurve (TCRV) 50% deposit bonus that is available until the 3rd of July?&nbsp;</p>\nFor more information about $TCRV presale tokens:\n<p>Website: https://tradecurve.io/&nbsp;</p>\n<p>Buy presale: https://app.tradecurve.io/sign-up&nbsp;</p>\n<p>Twitter: https://twitter.com/Tradecurveapp&nbsp;</p>\n<p>Telegram: https://t.me/tradecurve_official&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T03:15:00.000Z",
    "title": "InQubeta (QUBE) Appears as More Profitable Option than Cardano (ADA) in 2023. Can QUBE 10x?",
    "url": "https://cryptodaily.co.uk/2023/06/inqubeta-qube-appears-as-more-profitable-option-than-cardano-ada-in-2023-can-qube-10x",
    "description": "<p>Most crypto enthusiasts are familiar with older crypto giants that have made a lot of money for investors since their introduction to the crypto market. While these crypto giants have created a lot of profit for investors, it has become necessary for investors to seek out new DeFi projects to earn money from. Thankfully, new crypto projects with viable utilities are constantly added to the market, giving investors more options.</p>\n<p>InQubeta (QUBE) is one of the latest crypto projects whose presale has already made money for investors after its Beta stage. InQubeta's presale indicates it could be more profitable than an older crypto giant like Cardano (ADA). More investors are putting their money into InQubeta to increase their profit margins in the coming months.</p>\n<p>InQubeta's (QUBE) Presale Forges Ahead in the Crypto Market</p>\n<p>InQubeta has successfully launched a presale that crypto enthusiasts are eager to participate in. With an ecosystem designed to offer an easy pathway to the AI market, InQubeta is slowly gaining the trust of reputable crypto investors. InQubeta's presale has recorded unprecedented success in the crypto market, increasing investors' chances of becoming wealthy through this project.</p>\n<p>The QUBE token presale is divided into 10 stages, and each stage has an allocated number of tokens to be sold at a different price. The price of QUBE increases at the beginning of a new presale stage, ensuring the token's value grows as the presale progresses. The first presale stage, the Beta stage, was recently completed, pushing QUBE into its second presale phase, Stage 1.</p>\n<p>The DeFi coin price of QUBE in its current stage is $0.00875, and there are 100,000,000 QUBE tokens to be sold. InQubeta's presale has raised over $600,000, and it will only raise more before the presale stages are complete. In the next stage, QUBE will be sold for $0.0098, drawing closer to its launch price of $0.0308. InQubeta is one of the most profitable new DeFi projects, as its presale also features bonuses for investors.</p>\n<p>Once the presale ends, InQubeta's ability to link AI startups and investors will make it even more popular among investors. With an NFT marketplace that allows AI startups to connect with potential investors, InQubeta is set to become one of the best DeFi projects the crypto market has ever seen. InQubeta's NFT marketplace is built on the Ethereum blockchain, increasing its credibility and efficiency.&nbsp;</p>\n<p>All transactions within InQubeta are paid for using the QUBE token. This increases the token's value, solidifying InQubeta's position as an excellent project to add to your portfolio in 2023. As more investors notice InQubeta's value, its DeFi coin price is only likely to increase, making it an excellent investment option for the future. Some believe it could 10x by the end of the year, and it definitely has all the key components of a crypto that could explode in value.</p>\n<p></p>\n<p>Cardano (ADA) Maintains its Position as a Crypto Giant</p>\n<p>Cardano was created using a research-based approach to crypto development. The crypto giant is one of the most popular blockchains for developers to build decentralized applications (dApps). It also offers a highly sustainable network with increased transaction processing speeds.</p>\n<p>Cardano seeks to build a network that is not limited by bandwidth, promising a wider reach for blockchain developers in the crypto market. Cardano has remained one of the most profitable cryptocurrencies since it was launched. Its native token, ADA, runs operations on the platform.</p>\n<p>&nbsp;</p>\n<p></p>\n<p>Conclusion</p>\n<p>Cardano is one of the best DeFi projects in the crypto market; however, investors are looking for new cryptos to diversify their portfolios. InQubeta's presale has created a more profitable opportunity for investors to earn more money. This is why InQubeta's presale is selling out fast and gaining momentum among investors.</p>\n<p>The QUBE token may be the most profitable crypto token of 2023. Its ecosystem promises to give investors better investment opportunities that will increase the value of their holdings. Investing in its presale now is a great way to ensure you are not left out when InQubeta's price rises.</p>\n<p>&nbsp;</p>\n<p></p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T03:15:00.000Z",
    "title": "Ethereum (ETH) Price Prediction: Will Validator Limit Change?",
    "url": "https://cryptodaily.co.uk/2023/06/ethereum-eth-price-prediction-will-validator-limit-change",
    "description": "<p>As the Ethereum (ETH) network continues to evolve, changes in its validator limit can significantly impact its performance, transaction fees, and adoption. By analyzing the latest market trends, the article will provide insights into Ethereum's (ETH) future price trajectory.</p>\n<p>Meanwhile, a presale token, Uwerx, is taking the crypto market by surprise with its astounding presale success. The project has made significant progress and updates to spice up its platform before launch.&nbsp;</p>\n<p>Stay tuned to navigate Uwerx&rsquo;s success and Ethereum's (ETH) potential price prediction in light of the validator limit change.&nbsp;</p>\n<p>&gt;&gt;&gt;BUY WERX TOKENS NOW&lt;&lt;&lt;</p>\nPredicting Ethereum's (ETH) Price Post Validator Limit Change\n<p>As Ethereum (ETH) continues to make waves in the crypto market, one key factor closely watched by investors and analysts is the impact of the Validator Limit Change on its future price projection.&nbsp;</p>\n<p>The Validator Limit Change refers to a crucial adjustment in the Ethereum (ETH) network to address scalability challenges and improve transaction throughput.</p>\n<p>Ethereum (ETH) has snowballed in recent weeks to hit new highs that strengthen its stance on the market. Ethereum (ETH) trades for $1,881.11 with a trading volume of $12 billion. As the second-largest crypto, Ethereum (ETH) has a market cap of $226 billion.&nbsp;</p>\n<p>The Validator Limit Change is expected to further enhance Ethereum's (ETH) scalability, enabling the network to process more transactions efficiently.&nbsp;</p>\n<p>This upgrade has generated a positive sentiment among market participants, as it addresses long-standing concerns about network congestion and high transaction fees.</p>\n<p>Analysts predict that the update could affect Ethereum (ETH) positively. Some experts anticipate Ethereum (ETH) surpassing $1,966 as the network's improvements take effect.</p>\n<p>Regardless of the positive Ethereum (ETH) outlook, Uwerx promises to improve as investors expect a price surge in the coming months.</p>\n<p>&gt;&gt;&gt;BUY WERX TOKENS NOW&lt;&lt;&lt;</p>\nUwerx (WERX) Price Prediction: Presale Sell-Out Nears\n<p>The Uwerx revolution is in full swing, propelling the future of work toward unprecedented heights. With the presale nearing its end, Uwerx is gearing up to express its gratitude to early supporters through a Test Airdrop, acknowledging their unwavering trust and commitment to the project.</p>\n<p>Uwerx's unwavering dedication to stability and long-term growth is evident in its decision to lock liquidity for an astonishing 25 years. This commitment ensures a reliable platform for users, fostering a sense of trust and confidence in the ecosystem. The team's tokens are locked for 9 months, demonstrating their deep-rooted belief in Uwerx's potential.</p>\n<p>Breaking free from the traditional fee structures, Uwerx charges an industry-leading transaction fee of just 1%. This remarkable difference, compared to platforms like Upwork and Fiverr, with significantly higher costs, empowers users to retain a more significant portion of their hard-earned income, fostering financial independence.</p>\n<p>Introducing the game-changing Uwerx Vault allows users to securely store their WERX tokens while earning rewards based on platform variables. This innovative feature ensures the safety of assets and encourages active participation and engagement, fueling a vibrant and dynamic ecosystem.</p>\n<p>Ensuring the highest level of security, Uwerx subjected its platform to rigorous audits by reputable firms like SolidProof and InterFi Network. These comprehensive assessments provide users with peace of mind, knowing that their transactions and assets are protected within a robust and reliable infrastructure.</p>\n<p>The Uwerx community thrives, with over 7,000 sign-ups, an active Twitter presence, and a vibrant Telegram group. This engaged and supportive community forms the backbone of Uwerx's success, fostering collaboration and collective growth.</p>\n<p>Uwerx's presale has been nothing short of extraordinary, surpassing expectations and capturing the crypto community's attention. In Stage 5 of the presale, Uwerx offers tokens at an enticing price of $0.041 each. This presents a unique opportunity for investors to join the Uwerx ecosystem at an accessible rate. And with a generous 15% bonus accompanying each purchase, the value proposition becomes even more compelling.</p>\n<p>Consider joining the presale now to take advantage of the anticipated price increase from $0.0415 to $0.047725. To benefit from the potential yield, ensure that you place your orders before Wednesday, 28th at 18:00. Any orders placed after this time will be completed at the corresponding price.</p>\nFor more information on Uwerx&rsquo;a presale:\n<p>Presale: invest.uwerx.network &nbsp;</p>\n<p>Telegram: https://t.me/uwerx_network &nbsp;</p>\n<p>Twitter: https://twitter.com/uwerx_network &nbsp;</p>\n<p>Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T03:27:00.000Z",
    "title": "Ethereum Price Holds Strong at $1,800 – A Strong Case for Upside",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-holds-strong-1800/",
    "description": "Ethereum price is holding gains above the $1,800 level against the US Dollar. ETH could gain bullish momentum if it clears the $1,880 resistance zone. Ethereum is attempting a fresh increase from the $1,820 zone. The price is trading near $1,865 and the 100-hourly Simple Moving Average. There was a break above a connecting bearish trend line with resistance near $1,838 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise steadily if it clears the $1,880 resistance in the near term. Ethereum Price Aims Fresh Increase Ethereum’s price started a downside correction below the $1,865 support. ETH even spiked below the $1,820 level but the downsides were limited, unlike Bitcoin. A low is formed near $1,817 and the price is now attempting a fresh increase. There was a break above the $1,840 resistance zone. Besides, there was a break above a connecting bearish trend line with resistance near $1,838 on the hourly chart of ETH/USD. Ether is now testing the 50% Fib retracement level of the downward move from the $1,912 swing high to the $1,817 low. It is also trading near $1,865 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,875 level or the 61.8% Fib retracement level of the downward move from the $1,912 swing high to the $1,817 low. The next major resistance is near the $1,900 level. The first breakout level is near the $1,920 level. Source: ETHUSD on TradingView.com A close above the $1,920 zone could start a fresh rally. The next resistance sits near $2,000, above which the price could rise toward the $2,050 level. Any more gains could send Ether toward the $2,120 resistance. Another Decline in ETH? If Ethereum fails to clear the $1,875 resistance or $1,880, it could start another decline. Initial support on the downside is near the $1,860 level and the 100-hourly Simple Moving Average. The next major support is near the $1,840 level. The first major support is near $1,820. If there is a move below $1,820, the price could drop toward $1,790. Any more losses may perhaps send the price toward the $1,740 support. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,820 Major Resistance Level – $1,880"
  }
]