[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T04:19:32.000Z",
    "title": " BlackRock&#039;s Bitcoin ETF reaches top 0.2% of all ETFs so far this year ",
    "url": "https://cointelegraph.com/news/blackrock-bitcoin-now-fifth-largest-etf-flows-this-year",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTg0ZTAxNzEtZmRiZi00ZTdhLWEwMTctZTQzYTYxNTlhZTJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The position of BlackRock’s Bitcoin ETF could have been higher had it not missed the first seven trading days on the NASDAQ while it awaited approval from the SEC.</p>\n                    <p><p>BlackRock’s iShares Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) has made it into the top 0.16% of all United States-issued ETF products.</p><p>The spot Bitcoin ETF has topped $3.19 billion in flows, according to Feb. 5 data from Senior Bloomberg ETF analyst Eric Balchunas, being surpassed only by broad index funds tracking the S&amp;P 500 and Vanguard’s Total Stock Market ETF.</p><p>The latest figure is down 88% from Grayscale’s worst day of outflows on Jan. 22, which saw $640 million leave the newly converted ETF. </p><p><a href=\"https://cointelegraph.com/news/blackrock-bitcoin-now-fifth-largest-etf-flows-this-year\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-07T04:34:02.000Z",
    "title": "Congress questions Yellen’s call for crypto regulation, criticizes Howey Test",
    "url": "https://cryptobriefing.com/congress-questions-yellen-call-crypto-regulation-criticizes-howey-test/?utm_source=feed&utm_medium=rss",
    "description": "Congress seeks answers from Yellen regarding her call to address regulatory gaps in the spot market for non-security digital assets."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T04:18:03.000Z",
    "title": "AI Tools – Are You Leveraging Them to Elevate Your Proficiency?",
    "url": "https://www.cryptopolitan.com/ai-tools-leveraging-them-elevate-proficiency/",
    "description": "In the ever-evolving landscape of technological innovation, the integration of AI tools has emerged as a pivotal force reshaping industries and professions worldwide. Amidst the discourse surrounding AI&#8217;s potential to revolutionize workflows and streamline processes, the fundamental question arises: How can individuals harness AI tools effectively while preserving and enhancing their own skills and capabilities? [&#8230;]"
  }
]