[
  {
    "source": "CoinDesk",
    "date": "2023-11-09T10:18:12.000Z",
    "title": "Here's Why GTA VI Probably Won't Have a Crypto Component",
    "url": "https://www.coindesk.com/web3/2023/11/09/heres-why-gta-vi-probably-wont-have-a-crypto-component/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Rumors are persistent that the next Grand Theft Auto will have a GameFi element. Lawyers aren't so sure, but there's a catch."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T10:32:33.000Z",
    "title": "Bitcoin ETF launch could be delayed more than a month after SEC approval ",
    "url": "http://cointelegraph.com/news/bitcoin-etf-only-month-after-sec-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/d5aea067-5f77-47c7-9ca9-8bccd0e1c2e2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> A total of 12 asset managers have filed for a spot Bitcoin ETF with the U.S. SEC, with the first window for approval from the SEC opening on Nov. 8. </p>\n                    <p><p>With the United States Securities and Exchange Commission’s first window opening up for the approval of a spot Bitcoin ETF, analysts have noted that even if the SEC approves a spot Bitcoin ETF, it will be a month before the actual launch.</p><p>The expected delay in launch following a potential SEC approval would be due to the two-step process in launching an ETF. For an issuer to start a Bitcoin ETF, they must get SEC approval from the Trading and Markets division on its 19b-4 filing and the Corporate Finance division on the S-1 filing or prospectus.</p><p>The main focus of Corporate Finance includes fund operations details and risk disclosures. To date, of the 12 Bitcoin ETF applications, nine issuers have submitted revised prospectuses showing they have communicated with Corporate Finance. Market analysts believe the Bitcoin ETF launch may get delayed if the SEC approves the 19b-4 approvals before prospectus documents are signed off.</p><p>Bloomberg ETF analyst James Seyffart notified that even if 19b-4 is approved, S-1s approval could take weeks or months between approval and launch.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What Scott said: There are TWO paths that need to be completed for an ETF launch. Even if 19b-4 is approved, S-1s still need sign off from division of Corp Fin. No sign that&#39;s done yet. Possible and even likely that there could be weeks or even months between approval &amp; launch <a href=\"https://t.co/LZSdutmlT8\">https://t.co/LZSdutmlT8</a> <a href=\"https://t.co/7OLj5HjSDy\">pic.twitter.com/7OLj5HjSDy</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722342220617945195?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>There is an <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">8-day window for the SEC, </a>starting on Nov. 8 and ending on Nov 17, to approve the first spot Bitcoin ETF. Although market pundits have increased the chances of approval to 90%, they believe approval won't come before early next year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New Research note from me today. We still believe 90% chance by Jan 10 for spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur <a href=\"https://t.co/u6dBva1ytD\">pic.twitter.com/u6dBva1ytD</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722321412218638632?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC had earlier extended the deadline for comment on the spot Bitcoin ETF until Nov. 8 for the comment period.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-hype-blockchain-games-yat-siu\"><strong><em>Spot Bitcoin ETF hype reignited zest for blockchain games: Yat Siu</em></strong></a></p><p>The spot Bitcoin ETF race in the U.S. began when the world’s largest asset manager, BlackRock, filed its application. While Fidelity and a few other asset managers have also filed for spot Bitcoin ETFs, most faced rejections or withdrew their applications.</p><p>The 2023-24 cycle, however, has prompted many market pundits to predict a possible approval for the spot ETF giving it as high as 90% chance.</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T10:23:52.000Z",
    "title": "Chinese president calls for unity on AI challenges and cyber development ",
    "url": "http://cointelegraph.com/news/chinese-president-calls-for-unity-on-ai-challenges-and-cyber-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/27f882bf-16a5-4b89-a20a-f63e04dbfb3b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Xi Jinping addressed the World Internet Conference Summit saying there is a need to “deepen” exchanges and cooperation on an international level on AI challenges and cyberspace development.</p>\n                    <p><p>Chinese President Xi Jinping <a href=\"https://www.youtube.com/watch?v=36lAsmjJc8Y\" target=\"_blank\" rel=\"noopener nofollow\">addressed</a> an audience on Nov. 8 at the World Internet Conference Summit in Wuzhen, China calling for international cooperation on risks posed by artificial intelligence (AI). </p><p>Xi’s speech, pre-recorded and broadcast at the conference, stressed the need for “deepened” exchanges and cooperation to “jointly advance the building of a community with a shared future in cyberspace to a new stage.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f6c20bfd-b8d6-4041-8a0f-1abc9866f278.png\"  /><figcaption style=\"text-align: center;\"><em>Chinese President Xi Jinping addressing the World Internet Conference Summit 2023. Source: CCTV</em></figcaption></figure><p>“As the internet becomes a new driving force of development, a new frontier of ensuring security, and a new platform for mutual learning between civilizations,” he continued, “the building of a community with a shared future in cyberspace is a natural choice in answering the call of the times and a common aspiration of the international community.”</p><p>The Chinese head of state stressed that the “fruits of internet development” should benefit more countries and greater numbers of people. </p><p>While one of the main points of the speech was stressing the importance of international cooperation, he also said that: </p><blockquote>“Cyber sovereignty as well as each country’s internet development and governance mode should be respected.”</blockquote><p>implement its Global AI Governance Initiative. The government proposed this initiative a month prior focusing on an open and fair AI development environment. </p><blockquote>“We should uphold the principle of common security and avoid bloc confrontation and arms race in cyberspace.” </blockquote><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/alibaba-launches-chat-gpt-like-ai-model-for-public-restrictions-china\"><strong><em>Alibaba launches its ChatGPT-like AI model for public use amid loosening restrictions in China</em></strong></a></p><p>His remarks come a week after the United Kingdom’s inaugural AI Safety Summit, at which China was an attendee. </p><p>At the conference a spokesperson from the Chinese government similarly stressed the <a href=\"https://cointelegraph.com/news/uk-ai-safety-summit-bletchy-declartion-china-elon-musk\">importance of international cooperation</a>, saying it calls for “global cooperation to share AI knowledge and make AI technologies available to the public on open-source terms.”</p><p>China has been at the forefront of the global race to develop and deploy high-level AI systems. The country has been facing <a href=\"https://cointelegraph.com/news/us-official-confirms-military-concerns-over-china-access-ai-cloud-technology\">direct competition with the United States</a>, who is one of the world’s <a href=\"https://cointelegraph.com/news/us-expands-export-controls-ai-chips-china\">leaders in chip manufacturing</a> and major companies deploying AI models. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/\"><strong><em>AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T10:14:29.000Z",
    "title": "Swedish Bitcoiners targeted by armed criminals ",
    "url": "http://cointelegraph.com/news/swedish-bitcoiners-targeted-by-armed-criminals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/60bce0b5-ac0c-472a-a2e3-dd739f438be0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Swedish cryptocurrency proponent Eric Wall has flagged targeted attacks on well-known BTC community members.</p>\n                    <p><p>Criminals in Sweden are specifically targeting prominent local Bitcoin figures, which appears to be the result of the ease of access to personal information and residential addresses in the country.</p><p>Reports from Swedish media outlets LT and Aftonbladet have linked separate robberies in Rönninge and Södertälje that appear to have occurred under the same modus operandi. Victims were tied up and physically abused to steal physical and virtual Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) holdings.</p><p>Prominent cryptocurrency proponent Eric Wall, who currently serves as a StarkNet Foundation board member, highlighted the incidents in an X post (formerly Twitter). Wall said the two assault cases indicate that Swedish criminals are actively looking to target Bitcoin users.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">there&#39;s now officially a situation in sweden<br><br>this monday, a middle-aged swedish couple was tied up in their home and robbed by 4 masked men. they were physically abused and threatened with their own kitchen knives. they were tied up for hours and one had to be escorted to the…</p>&mdash; Eric Wall (@ercwl) <a href=\"https://twitter.com/ercwl/status/1722371132026712143?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“This Monday, a middle-aged Swedish couple was tied up in their home and robbed by 4 masked men. They were physically abused and threatened with their own kitchen knives. They were tied up for hours and one had to be escorted to the hospital via helicopter,” Wall wrote.</p><p>He noted that the purpose of the assault was to steal the couple’s Bitcoin before highlighting the link to a separate incident where “two well-known Bitcoin/crypto profiles were targeted in their homes by masked, armed men.”</p><p>According to Wall, the victims were subjected to violent physical abuse for hours in an effort to steal their Bitcoin holdings held in hardware wallets. He added that the first incident of criminals targeting Bitcoin users took place in 2022, when “one of Sweden’s most well-known Bitcoiners” had their apartment broken into.</p><p><strong><em>Related:</em></strong> <a href=\"https://cointelegraph.com/news/uk-bill-seize-bitcoin-passed\"><strong><em>UK passes bill to enable authorities to seize Bitcoin used for crime</em></strong></a></p><p>Wall also believes criminals scour social media to identify and target Bitcoin or cryptocurrency users. He claims that a common theme of the attacks was that they took place shortly after individuals had livestreamed podcasts focused on Bitcoin and cryptocurrencies or mentioned the subject in public.</p><p>He also believes that Sweden’s <em><a href=\"https://www.regeringen.se/sa-styrs-sverige/grundlagar-och-demokratiskt-deltagande/offentlighetsprincipen/\" target=\"_blank\" rel=\"noopener nofollow\">Offentlighetsprincipen </a></em>(Principle of Public Access to Information) laws, which give the public the right to request information, including residential addresses and tax records from the government, are becoming a means for criminals to prey on ecosystem participants.</p><blockquote>“While the intention behind this legislation was to reduce corruption, it is not fit for modern society.”</blockquote><p>Wall added that he left the country due to these laws and that Sweden “is probably one of the least safe countries to be active in the cryptocurrency sector.”</p><p>The <em>Offentlighetsprincipen </em>law also reportedly makes it easy for citizens to search for Swedish residents’ addresses as well as scour their tax records. This is being abused, as criminals can ascertain how much an individual has paid in income or capital gains tax and “size them up” as a result.</p><p><em>Cointelegraph has reached out to the Swedish Police Authority to ascertain further details of these incidents and if any arrests have been made.</em></p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T10:10:00.000Z",
    "title": "Former NYSE President Eyes FTX Revival Amid Bankruptcy Auction",
    "url": "https://www.cryptoglobe.com/latest/2023/11/former-nyse-president-eyes-ftx-revival-amid-bankruptcy-auction/",
    "description": "In a bold move that could signal a significant turnaround in the cryptocurrency industry, Tom Farley, the former president of the New York Stock Exchange (NYSE), is reportedly making strides to relaunch the bankrupt crypto exchange FTX. According to a report published by The Wall Street Journal (WSJ) yesterday, Farley’s technology firm, Bullish, is actively […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-09T10:30:57.000Z",
    "title": "NFT Giant Opensea Retrenches an Unknown Number of Employees",
    "url": "https://news.bitcoin.com/nft-giant-opensea-retrenches-an-unknown-number-of-employees/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"NFT Giant Opensea Retrenches an Unknown Number of Employees\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/opse.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Opensea recently retrenched an unknown number of employees as part of what the CEO Devin Finzer describes as a rebuilding exercise. According to the CEO, taking this step helps Opensea build a foundation which enables it to innovate faster. Smaller Team With Direct Connection to Users Opensea, one of the largest non-fungible token (NFT) marketplaces, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:33:42.000Z",
    "title": "AI Chatbot-Inspired Token GROKAI Surges by 650%",
    "url": "https://www.cryptopolitan.com/ai-chatbot-inspired-token-grokai-surges/",
    "description": "In a stunning market turn, a token named after Elon Musk’s new AI chatbot, Grok, has seen its value soar by an unprecedented 650%. This rapid ascent highlights the volatile and dynamic nature of the cryptocurrency market. This past weekend, X — the platform previously identified with Twitter and now under Musk&#8217;s ownership — launched ... <a title=\"AI Chatbot-Inspired Token GROKAI Surges by 650%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-chatbot-inspired-token-grokai-surges/\" aria-label=\"More on AI Chatbot-Inspired Token GROKAI Surges by 650%\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:31:24.000Z",
    "title": "JPEX Executives Arrested in Taiwan for Alleged Fraud After Investigations",
    "url": "https://www.cryptopolitan.com/jpex-executives-arrested-in-taiwan/",
    "description": "Chang Tung-Ying and Shi Yu, two key figures behind the troubled cryptocurrency exchange JPEX, have been detained by the Taipei District Prosecutors Office on suspicion of fraud. The arrests took place earlier today after prosecutors conducted investigations at nine locations related to JPEX&#8217;s Taiwan operations. According to the Central News Agency, Chang and Shi have ... <a title=\"JPEX Executives Arrested in Taiwan for Alleged Fraud After Investigations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jpex-executives-arrested-in-taiwan/\" aria-label=\"More on JPEX Executives Arrested in Taiwan for Alleged Fraud After Investigations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:24:23.000Z",
    "title": "Alert Grandma Thwarts AI Voice-Cloning Scam",
    "url": "https://www.cryptopolitan.com/alert-grandma-thwarts-ai-voice-cloning-scam/",
    "description": "A San Diego grandmother narrowly avoided losing thousands of dollars to a scam involving AI-generated voice cloning that imitated her beloved grandson. The incident unfolded when Maureen, a North County grandma, received a phone call from an anonymous number, initially mistaken for her sister&#8217;s hidden number call. The voice on the other end sounded eerily ... <a title=\"Alert Grandma Thwarts AI Voice-Cloning Scam\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alert-grandma-thwarts-ai-voice-cloning-scam/\" aria-label=\"More on Alert Grandma Thwarts AI Voice-Cloning Scam\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:12:06.000Z",
    "title": "How Powerful New AI Systems Like ChatGPT Work",
    "url": "https://www.cryptopolitan.com/how-powerful-new-ai-systems-like-chatgpt-work/",
    "description": "Generative artificial intelligence (AI) has taken the tech world by storm, with headlines featuring the remarkable capabilities of systems like OpenAI&#8217;s ChatGPT, which can produce text almost indistinguishable from human writing. But what exactly is generative AI, and how does it differ from traditional AI models?&#160; In the not-so-distant past, discussions about AI primarily revolved ... <a title=\"How Powerful New AI Systems Like ChatGPT Work\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-powerful-new-ai-systems-like-chatgpt-work/\" aria-label=\"More on How Powerful New AI Systems Like ChatGPT Work\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T10:10:38.000Z",
    "title": "Australian crypto exchange CoinSpot’s $2.4M crypto hack exposed",
    "url": "https://www.cryptopolitan.com/australian-crypto-exchange-coinspots-hacked/",
    "description": "In a recent security breach, Australian crypto exchange CoinSpot has reportedly fallen victim to a hack resulting in a loss of $2.4 million. Blockchain security firm CertiK suggests that the compromise of a private key on at least one of CoinSpot&#8217;s hot wallets is the likely cause of the incident. ZachXBT, a blockchain investigator, brought ... <a title=\"Australian crypto exchange CoinSpot&#8217;s $2.4M crypto hack exposed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australian-crypto-exchange-coinspots-hacked/\" aria-label=\"More on Australian crypto exchange CoinSpot&#8217;s $2.4M crypto hack exposed\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T10:18:49.000Z",
    "title": "Bitcoin’s whale-sized moves hint at $37k ascent",
    "url": "https://crypto.news/bitcoins-whale-sized-moves-hint-at-37k-ascent/",
    "description": "Bitcoin (BTC) is observing noticeable spikes in whale transactions worth at least $100,000. Its supply on exchanges witnesses a gradual uptick amid the fight to reclaim $37,000. These spikes in large transactions started earlier this month, data from Santiment confirms.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T10:09:42.000Z",
    "title": "SAND jumps 7% as Gucci launches Cosmos Land experience",
    "url": "https://crypto.news/sand-jumps-7-as-gucci-launches-cosmos-land-experience/",
    "description": "Like the real-life exhibition, Gucci&#8217;s new initiative with The Sandbox lets visitors explore the brand’s history. While the hype surrounding the metaverse seems to perish, the famous Italian luxury fashion brand Gucci is doubling down on its virtual reality strategy&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-09T10:34:35.000Z",
    "title": "Sui Provides ZK Compute for Web3 Games",
    "url": "https://www.altcoinbuzz.io/product-release/sui-provides-zk-compute-for-web3-games/",
    "description": "<p>Sui recently partnered with Space and Time (SxT). The partnership provides developers building on Sui with access to a full stack of zero-knowledge-proof-based (ZK) tools. In addition, the partnership names SxT as the preferred data warehouse for the Sui ecosystem. Let&#8217;s discover more about this announcement. Sui Partners with SxT to Develop Web3 Gaming Sui [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/sui-provides-zk-compute-for-web3-games/\">Sui Provides ZK Compute for Web3 Games</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-09T10:11:02.000Z",
    "title": "Binance Now Supports opBNB Deposits and Withdrawals",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/binance-now-supports-opbnb-deposits-and-withdrawals/",
    "description": "<p>According to each Chain&#8217;s explorer, BNB Chain&#8217;s Layer 2, opBNB, has undergone on-chain growth to become the second most popular L2 in terms of DAU in less than two months of the mainnet going live. Furthermore, Binance, the world&#8217;s largest cryptocurrency exchange by trading volume, said today that it will accept opBNB deposits and withdrawals. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/binance-now-supports-opbnb-deposits-and-withdrawals/\">Binance Now Supports opBNB Deposits and Withdrawals</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T10:29:06.000Z",
    "title": "Trust Wallet Introduces WaaS Technology — Connected to Binance’s Web3 Wallet?",
    "url": "https://coinedition.com/trust-wallet-introduces-waas-technology-connected-to-binances-web3-wallet/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/WEB-3.0-10-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Trust Wallet, a decentralized wallet provider owned by Binance, has introduced Wallet as a Service (WaaS), a platform allowing businesses to offer various decentralized services to their users amidst Binance’s launch of its first self-custody wallet, the Web3 Wallet. Trust Wallet&#8217;s WaaS enables a wide range of clients, from Web3 operators to startups and traditional [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/trust-wallet-introduces-waas-technology-connected-to-binances-web3-wallet/\">Trust Wallet Introduces WaaS Technology — Connected to Binance’s Web3 Wallet?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T10:12:28.000Z",
    "title": "Crypto Exchange Coinspot Loses Over $2 Million in Hack: ZachXBT",
    "url": "https://coinedition.com/crypto-exchange-coinspot-loses-over-2-million-in-hack-zachxbt/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Hacker-Steals-4300BNB-from-BitKeep-Swap-Moves-it-to-Tornado-Cash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Hacker Steals 4300BNB from BitKeep Swap, Moves it to Tornado Cash\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Hacker-Steals-4300BNB-from-BitKeep-Swap-Moves-it-to-Tornado-Cash.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Hacker-Steals-4300BNB-from-BitKeep-Swap-Moves-it-to-Tornado-Cash-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Hacker-Steals-4300BNB-from-BitKeep-Swap-Moves-it-to-Tornado-Cash-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Hacker-Steals-4300BNB-from-BitKeep-Swap-Moves-it-to-Tornado-Cash-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Hacker-Steals-4300BNB-from-BitKeep-Swap-Moves-it-to-Tornado-Cash-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coinspot, a crypto exchange in Australia, seems to have fallen victim to an exploit that drained assets worth $2 million from two of its wallets.&#160; Popular on-chain crypto sleuth ZachXBT noted the exploit in a post on his Telegram channel. Notably, ZachXBT cited two transactions from the wallet as evidence of the hack. One of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-exchange-coinspot-loses-over-2-million-in-hack-zachxbt/\">Crypto Exchange Coinspot Loses Over $2 Million in Hack: ZachXBT</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T10:15:21.000Z",
    "title": "Crypto Whales Heavily Accumulating Ethereum-Based Altcoin That’s Exploded Over 1,000% in Three Months: Santiment",
    "url": "https://dailyhodl.com/2023/11/09/crypto-whales-heavily-accumulating-ethereum-based-altcoin-thats-exploded-over-1000-in-three-months-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Whales-Heavily-Accumulating-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top crypto analytics firm says that deep-pocketed whales are stacking an Ethereum (ETH)-based token that&#8217;s surged over the past three months. According to Santiment, traders who own 1,000 to 100,000 tokens of the decentralized oracle protocol Tellor (TRB) now own 46% of the asset’s total supply, up from just 31% seven weeks ago. Affluent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/crypto-whales-heavily-accumulating-ethereum-based-altcoin-thats-exploded-over-1000-in-three-months-santiment/\">Crypto Whales Heavily Accumulating Ethereum-Based Altcoin That’s Exploded Over 1,000% in Three Months: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]