[
  {
    "source": "Decrypt",
    "date": "2023-09-27T00:01:25.000Z",
    "title": "Beyond ChatGPT: NExT-GPT is an OpenSource Model That Lets You Master AI With Audio, Video and Text",
    "url": "https://decrypt.co/198875/beyond-chatgpt-next-gpt-is-an-opensource-model-that-lets-you-master-ai-with-audio-video-and-text",
    "description": "The new ‘any-to-any’ AI could leapfrog largely text-only giants and compete with visual tools like Google’s Gemini and OpenAI’s ChatGPT-Vision."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-26T23:58:15.000Z",
    "title": "Texas Is Now the Top US Bitcoin Mining Spot: Foundry",
    "url": "https://decrypt.co/198889/texas-top-us-state-for-bitcoin-mining-foundry-cambridge",
    "description": "A digital asset researcher at Cambridge says the region's dominance \"does not come as a surprise.\""
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-27T00:00:53.000Z",
    "title": "Judge Limits Bankman-Fried’s Trial Arguments; Allows Recreational Drug Use Questions",
    "url": "https://news.bitcoin.com/judge-limits-bankman-frieds-trial-arguments-allows-recreational-drug-use-questions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ftxxc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A federal judge has issued rulings limiting some arguments the defense can make at Sam Bankman-Fried&#8217;s criminal fraud trial next month. However, the judge will allow Bankman-Fried&#8217;s lawyers to question witnesses about past recreational drug use. Bankman-Fried Can&#8217;t Mention Jail Time at Trial In a 16-page order, Lewis Kaplan, the U.S. District judge presiding over [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T00:07:24.000Z",
    "title": "How Crypto Companies are Looking for Ways to Rebrand Products that Consumers No Longer Trust",
    "url": "https://www.cryptopolitan.com/crypto-companies-ways-to-rebrand-trust/",
    "description": "In the wake of a tumultuous year marked by high-profile scandals and waning consumer trust, the cryptocurrency industry is at a crossroads. Once-celebrated figures like Sam Bankman-Fried and Do Kwon have fallen from grace, prompting a wave of introspection and rebranding efforts within the sector. Companies are distancing themselves from the tarnished &#8220;crypto&#8221; label, exploring ... <a title=\"How Crypto Companies are Looking for Ways to Rebrand Products that Consumers No Longer Trust\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-companies-ways-to-rebrand-trust/\" aria-label=\"More on How Crypto Companies are Looking for Ways to Rebrand Products that Consumers No Longer Trust\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T23:56:53.000Z",
    "title": "Why experts think BlackRock has the fate of crypto in its hands",
    "url": "https://www.cryptopolitan.com/blackrock-has-fate-of-crypto-in-its-hands/",
    "description": "While the general narrative surrounding cryptocurrencies may appear bleak with Bitcoin’s price declining over the past six months, industry insiders challenge this somber perspective. Rumblings within the financial sector suggest that the fate of cryptocurrency, particularly Bitcoin, rests in the clutches of global investment powerhouses. And leading that pack? BlackRock. From Underdog to Industry Leader: ... <a title=\"Why experts think BlackRock has the fate of crypto in its hands\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-has-fate-of-crypto-in-its-hands/\" aria-label=\"More on Why experts think BlackRock has the fate of crypto in its hands\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T23:45:40.000Z",
    "title": "Hong Kong’s crypto love meets its match – The details",
    "url": "https://www.cryptopolitan.com/hong-kongs-crypto-love-meets-its-match/",
    "description": "A once radiant star in Hong Kong&#8217;s financial skies, cryptocurrency group JPEX painted the town teal-and-white. From dominating billboards in the financial district to owning ad spaces on taxis and trams, they were the talk of the town. But today, their bright hues have been overshadowed by dark clouds of suspicion and alleged fraud. From ... <a title=\"Hong Kong&#8217;s crypto love meets its match &#8211; The details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kongs-crypto-love-meets-its-match/\" aria-label=\"More on Hong Kong&#8217;s crypto love meets its match &#8211; The details\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T00:00:03.000Z",
    "title": "Analyst Uncovers BlackRock Long Interest In Bitcoin Mining – Details",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-uncovers-blackrock-long-interest-in-bitcoin-mining-details/",
    "description": "Based on a recent report by Bloomberg analyst Jamie Coutts, asset managers&#8217; interest in Bitcoin stretches beyond exchange-traded funds (ETF) into the mining sector. In particular, Coutts speaks about BlackRock, describing the asset manager’s application with the US Securities and Exchange Commission (SEC) to offer a Bitcoin spot ETF as “unsurprising.”  The analyst stated that BlackRock and other prominent global asset managers, namely Vanguard and State Street, have been involved in the Bitcoin mining industry for over three years.  Related Reading: Bitcoin Mining Difficulty Hits New All-Time High As BTC Price Moves Sideways BlackRock And Other ESG-Driven Companies Investing In Bitcoin Mining, Analyst Says James Coutts stated that BlackRock began its venture into Bitcoin mining in 2020 by investing in Marathon Digital, the second-largest publicly traded mining company. Notably, this development occurred when the Bitcoin mining industry faced high criticism, likely due to the substantial reliance on fossil fuels. Over the last three years, Coutts reports that BlackRock, Vanguard, and State Street have increased their respective investments in Bitcoin mining companies, regardless of the market cycle.  Interestingly, all three asset managers are known to promote Environmental, Social, and Governance (ESG) investment principles, part of which is limiting fossil fuel use. However, it appears that investing in Bitcoin mining may not damage the ESG credentials of these companies.  According to a report by Daniel Batten, co-founder of CH4 Capital, James Coutt notes that Bitcoin mining currently derives 50% of its energy from sustainable sources. And this percentage is likely to increase as Bitcoin mining has the unique ability to monetize stranded energy and stabilize energy grids.  Related Reading: Here’s Why Arthur Hayes Is Not In Support Of A BlackRock Spot Bitcoin ETF Potential Effect Of Bitcoin Mining Institutionalization Based on James Coutts’s report, BlackRock and the two other asset managers in the discussion are currently the top investors in the three largest publicly traded mining companies, namely Marathon Digital, Riot Platforms, and Cleanspark.  Together, these mining companies collectively own 8.9% of the global hash rate, which is significant as public miners only account for 15% of the global hash power. Source: Bloomberg Intelligence For now, James Coutts believes that the involvement of these asset managers in Bitcoin mining poses little challenge to the network’s decentralization. However, the analyst notes that there may be a future clash of network and ESG values, especially given the activist tendencies of BlackRock, Vanguard, and State Street. However, this would not prevent the Bitcoin network from operating as expected. But it may lead other miners whose operations still rely on fossil fuels to start processing “censored transactions.” At the time of writing, Bitcoin trades at $26,198.48, with a 0.57% gain in the last month, according to data from Tradingview.  BTC trading at $26,198.48 on the hourly chart &#124; Source: BTCUSDT chart on Tradingview.com Featured image from The New Yorker, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T00:00:44.000Z",
    "title": "One Ethereum-Based Altcoin Gearing Up for ‘Very Strong’ Performance, Says Trader – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/09/26/one-ethereum-based-altcoin-gearing-up-for-very-strong-performance-says-trader-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/gearing-up-strong-says.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes that one Ethereum (ETH)-based digital asset is setting up for an explosive run. Pseudonymous analyst Altcoin Sherpa tells his 196,400 followers on the social media platform X that the decentralized oracle network Chainlink (LINK) is a solid crypto project from a fundamental standpoint. According to the trader, LINK could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/26/one-ethereum-based-altcoin-gearing-up-for-very-strong-performance-says-trader-heres-his-timeline/\">One Ethereum-Based Altcoin Gearing Up for ‘Very Strong’ Performance, Says Trader – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]