[
  {
    "source": "Cointelegraph",
    "date": "2023-10-07T05:24:31.000Z",
    "title": "X's 'everything app' push continues as Elon Musk tests video game streaming",
    "url": "https://cointelegraph.com/news/x-everything-app-elon-musk-tests-video-game-streaming",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/36631d54-8000-476a-9740-61028ff941cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>During his stream, Elon Musk said that X has plans to integrate streaming services with Xbox and PS5, but has no plans of trying to be better than specialised streaming platforms. </p>\n                    <p><p>X, formerly Twitter, has made another step toward becoming an “everything app” after Elon Musk tested out video game streaming on the platform. </p><p>In a 50-minute-long stream on Oct. 6, Musk streamed himself playing the popular online action role-playing game Diablo 4. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Stream Test 3 <a href=\"https://t.co/1ih0ZAY2tS\">https://t.co/1ih0ZAY2tS</a></p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1710466583766696108?ref_src=twsrc%5Etfw\">October 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As things kicked off, Musk outlined that “what we are aiming for here is that the audio sounds normal, the image looks reasonably good so it's not flickering, and the comments are working.”</p><p>While the feature is still in its early stages of development, the quality of the stream remained consistent throughout, with Musk seemingly chuffed with the work the devs have put in so far. </p><p> “It's cool that it works at all,” he said. </p><p>Toward the end of the stream, Musk answered some questions from his viewers and provided more context on what X is aiming for. </p><p>“We will add in streaming for Xbox and PS5. You know we're not trying to do everything better than every other app, but we wanna say that ‘okay if you wanna do something within the X system or the X platform, you can do it if you want,” he said, adding: </p><blockquote>“I think the very specialist apps are still gonna be probably better than us in a lot of ways but you know, I think we can be the best generalist app. There's some value to being a generalist app for I guess discovery, and for interacting with the largest number of people in the world.” </blockquote><p>Musk, however, did not reveal anything about payments or crypto being integrated with streaming for aspects like subscriptions or donations etc. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4ce7658f-6b05-4103-8880-0aaab2d04f25.png\"  /><figcaption style=\"text-align: center;\"><em>Elon Musk explaining his Diablo character build. Source: X</em></figcaption></figure><p>There seems to be a significant amount of interest in the move. </p><p>At the time of writing, the stream or “broadcast” has had 2.8 million viewers in just a few hours since the session ended, while the tweet highlighting the stream has a whopping 9.3 million views and more than 5,300 retweets. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-musk-scorns-sec-doj-lawsuit-twitter-purchase\"><strong><em>Elon Musk hits at SEC, DOJ amid suit to force testimony in Twitter probe</em></strong></a></p><p>Following the rebranding from Twitter to X in July, Musk explained that it was<a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\"> part of his plans</a> to develop an “everything app” that essentially hosts a wide array of social media features and supports financial services,<a href=\"https://cointelegraph.com/news/twitter-to-launch-crypto-and-stock-trading-in-partnership-with-etoro-reports\"> including crypto</a>. </p><p>This focus has seen Twitter introduce the revenue share model for<a href=\"https://cointelegraph.com/news/elon-musk-twitter-blue-rebrand-x-premium\"> X Premium subscribers</a>, among a host of other features, and to offer users the ability to post videos and content directly on the platform. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\"><strong><em>Web3 Gamer: Minecraft bans Bitcoin P2E, iPhone 15 &amp; crypto gaming, Formula E</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T05:26:06.000Z",
    "title": "Binance adjusts to UK regulatory shifts post FCA’s canceled permissions",
    "url": "https://www.cryptopolitan.com/binance-adjusts-to-uk-regulatory-shifts/",
    "description": "Binance, a prominent cryptocurrency exchange, has introduced a specialized domain catering to its users in the United Kingdom (UK). This strategic initiative represents a substantial effort towards aligning with the UK&#8217;s recently updated Financial Promotions Regime. Additionally, the exchange has joined forces with Rebuildingsociety.com Limited, a firm regulated by the Financial Conduct Authority (FCA). This ... <a title=\"Binance adjusts to UK regulatory shifts post FCA&#8217;s canceled permissions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-adjusts-to-uk-regulatory-shifts/\" aria-label=\"More on Binance adjusts to UK regulatory shifts post FCA&#8217;s canceled permissions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T05:17:11.000Z",
    "title": "UC Berkeley Professor Leverages Predictive AI Technology to Spot Domestic Violence Early",
    "url": "https://www.cryptopolitan.com/predictive-ai-technology-domestic-violence/",
    "description": "In a groundbreaking move at UC Berkeley, Assistant Professor Irene Chen is leading a charge against domestic violence, harnessing the power of artificial intelligence (AI) to predict and identify potential victims. The revolutionary approach involves utilizing machine learning to sift through radiology reports and medical records of past patients involved in abusive relationships. Chen&#8217;s algorithm ... <a title=\"UC Berkeley Professor Leverages Predictive AI Technology to Spot Domestic Violence Early\" class=\"read-more\" href=\"https://www.cryptopolitan.com/predictive-ai-technology-domestic-violence/\" aria-label=\"More on UC Berkeley Professor Leverages Predictive AI Technology to Spot Domestic Violence Early\">Read more</a>"
  }
]