[
  {
    "source": "Cointelegraph",
    "date": "2023-07-23T21:42:45.000Z",
    "title": "Federal Reserve of San Francisco hiring crypto architect for CBDC project",
    "url": "https://cointelegraph.com/news/federal-reserve-san-francisco-hiring-crypto-architect-cbdc-project",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/50e30a10-5a1b-4ee5-bd89-594f4fb847bf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>San Francisco's Federal Reserve Bank is seeking a crypto architect for a central bank digital currency (CBDC).</p>\n                    <p><p>San Francisco's Federal Reserve Bank is seeking a crypto architect for a<a href=\"https://cointelegraph.com/cryptocurrency-regulation-for-beginners/what-is-a-cbdc-why-central-banks-want-to-get-into-digital-currencies\"> central bank digital currency (CBDC)</a> project, <a href=\"https://www.indeed.com/viewjob?jk=693350f24c197b6a\" target=\"_blank\" rel=\"noopener nofollow\">reveals</a> an Indeed job posting. According to the role description, the employee will work on CBDC research and development.</p><p>The position is full-time and hybrid, with an annual salary starting at $134,900, requiring candidates to have \"knowledge of distributed systems implementation, cryptographic protocols such as hashing, public-private keypairs and signing, consensus algorithms, and security.\" </p><p>\"Given the dollar’s significant role, the FRS seeks to further understand the cost and benefits of the potential technologies for CBDC and this emerging field,\" reads the posting.<a href=\"https://rb.wd5.myworkdayjobs.com/en-US/FRS/job/San-Francisco-CA/Sr-Application-Architect---Digital-Currency_R-0000016586-1\" target=\"_blank\" rel=\"noopener nofollow\"> According</a> to the Federal Reserve System Careers page, the position has been open for more than 30 days.</p><p>\"We are looking for a Lead Application Developer to implement example systems related to a CBDC. You will engage directly with management, other developers on the team, development operations teams, and vendors to ensure the Federal Reserve is well-positioned to design, develop, and implement technology to support a CBDC as may be required by the Board of Governors.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2111ffb6-ff79-4233-9d76-e7b8d0e8a8bb.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Screenshot: Federal Reserve Bank of San Francisco's job posting. Source: Indeed.</em></figcaption></figure><p>A team of crypto developers has been forming at the San Francisco's Fed at least since February, when it<a href=\"https://cointelegraph.com/news/san-francisco-federal-bank-eyes-cbdc-system-development-reveals-job-posting\"> was looking for a software engineer</a> to help develop and implement systems related to a CBDC initiative.</p><p>The recruitment efforts contradict the public stance of the Federal Reserve Board of Governors on CBDCs. On July 19, the central bank said on Twitter that it had not yet<a href=\"https://cointelegraph.com/news/federal-reserve-service-not-related-to-cbdcs\"> decided whether to issue a CBDC</a> and “would only proceed with the issuance of a CBDC with an authorizing law.”</p><p>The possibility of a digital version of the U.S. dollar has stirred controversy in the country, promising to be a key talking point in the upcoming presidential election. Many opponents of CBDC argue that it threatens citizens' privacy and could lead to governmental control, while supporters see it as a global application of blockchain technology.</p><p>In a recent event, presidential candidate and Florida Governor Ron DeSantis<a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\"> vowed to ban CBDCs in the United States</a> if elected president. “If I am the president, on day one, we will nix central bank digital currency. Done. Dead. Not happening in this country,” he said during the Family Leadership Summit in Iowa. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-23T21:56:34.000Z",
    "title": "Can Generative AI Help WGA and Studios Reshape Hollywood’s Future?",
    "url": "https://www.cryptopolitan.com/generative-ai-help-wga-and-studios-hollywood/",
    "description": "The Writers Guild of America (WGA) is on strike against studios to secure a new contract allowing writers to have a more significant stake in the industry. Among the contentious issues is the perceived threat posed by generative AI, exemplified by products like ChatGPT, to the livelihood of creative professionals, including writers. Studios view generative ... <a title=\"Can Generative AI Help WGA and Studios Reshape Hollywood&#8217;s Future?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-help-wga-and-studios-hollywood/\" aria-label=\"More on Can Generative AI Help WGA and Studios Reshape Hollywood&#8217;s Future?\">Read more</a>"
  }
]