[
  {
    "source": "Cointelegraph",
    "date": "2024-03-26T00:02:31.000Z",
    "title": " Grayscale sees Ether ETF approvals despite SEC ‘lack of engagement’ ",
    "url": "https://cointelegraph.com/news/grayscale-ether-etf-approvals-despite-sec-lack-engagement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZDczYjk5YWMtZmIwNi00NmMwLTlkMmUtMTEwYThkZWQxZTIxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Important details concerning the creation and redemption procedures, cash and in-kind models, asset protection, loss prevention and custody “were figured out” in the spot Bitcoin ETF applications, the Grayscale executive explained.</p>\n                    <p><p>Grayscale is confident that spot Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> exchange-traded funds will be approved in May despite recent “chatter” about the U.S. securities regulator’s “lack of engagement” with applicants.</p><p>“I don’t think perceived lack of engagement from regulators should be indicative of one outcome or another [...] I personally am not deterred by it and believe the ETFs should be approved,” <a href=\"https://x.com/CraigSalm/status/1772360837094691302\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> Grayscale Chief Legal Officer Craig Salm in an X post on March 25. </p><p>Salm explained that in the months before <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">spot Bitcoin ETFs were approved</a>, many of the issues common to spot Ether ETFs “were figured out” — such as details of creation and redemption procedures, cash and in-kind models, asset protection, loss prevention, and custody.</p><p><a href=\"https://cointelegraph.com/news/grayscale-ether-etf-approvals-despite-sec-lack-engagement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-26T00:00:08.000Z",
    "title": "Robert Kiyosaki Predicts Bitcoin Hitting $100K by September — Plans to Buy BTC This Week as Halving Nears",
    "url": "https://news.bitcoin.com/robert-kiyosaki-predicts-bitcoin-hitting-100k-by-september-plans-to-buy-btc-this-week-as-halving-nears/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Robert Kiyosaki Predicts Bitcoin Hitting $100K by September — Plans to Buy BTC This Week as Halving Nears\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bitcoin-halving-kiyosaki.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Rich Dad Poor Dad author Robert Kiyosaki has updated his bitcoin price prediction. He now anticipates the cryptocurrency reaching $100K by September. The famous author also announced his intention to purchase more bitcoin this week, citing the approaching halving event. He encouraged investors to consider adding bitcoin to their portfolios if they haven&#x2019;t already done [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T00:00:31.000Z",
    "title": "Ethereum’s Rocky Road To $4,000: Will SEC Hurdles Derail Its Bullish Journey?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-rocky-road-to-4000-will-sec-hurdles-derail-its-bullish-journey/",
    "description": "Ethereum (ETH) stands at a crucial juncture, with its eyes set on the $4,000 price mark. Amid this ambitious pursuit, the digital asset faces a significant challenge that could influence its trajectory: scrutiny from the US Securities and Exchange Commission (SEC). Despite this potential regulatory hurdle, some analysts remain optimistic about Ethereum&#8217;s prospects. A detailed analysis by Captain Faibik, a market watcher, highlighted a bullish pattern in ETH’s four-hour candlestick chart, suggesting that the $4,000 threshold is within reach. Related Reading: Market Alert: Ethereum Faces Potential Downfall As Dencun Upgrade Looms – Here’s Why Ethereum Eyes $4,000 Milestone This optimism stems from a descending wedge pattern observed by Faibik, indicating an end to Ethereum&#8217;s consolidation phase and signaling a possible price breakout. The technical analysis paints a promising picture for Ethereum, suggesting that the asset could reclaim its lost valuation. $ETH #Ethereum Descending Broadening Wedge Upside Breakout is Confirmed on the 4hrs timeframe Chart..✅ $4,000 incoming ⌛️📈 https://t.co/qrKE5jiXon pic.twitter.com/MLIXefVsd8 — Captain Faibik (@CryptoFaibik) March 25, 2024 However, the recent market conditions have posed challenges for Ethereum, with the asset experiencing a more than 15% drop over two weeks, further exacerbated by the broader Bitcoin market correction. This decline saw ETH trading below the $3,500 mark, with a significant dip to $3,070 on March 20, amid reports of the SEC&#8217;s increasing interest in classifying Ethereum as a security. Particularly, reports indicate that the commission has been seeking financial records from US companies engaged with the Ethereum Foundation, intensifying the debate over Ethereum&#8217;s classification. Such regulatory scrutiny casts a shadow over Ethereum&#8217;s path to $4,000, introducing uncertainty into its future. ETF analyst James Seyffart suggests that the SEC&#8217;s stance could lead to the denial of spot Ethereum ETF applications by May 23, 2024. He cites a lack of engagement on Ethereum specifics, contrasting with the approach taken for Bitcoin ETFs. My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round. The SEC hasn&#8217;t engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall. https://t.co/TyAzAOrAC5 — James Seyffart (@JSeyff) March 19, 2024 Ethereum&#8217;s Network Activity: A Silver Lining Despite these challenges, Ethereum&#8217;s network has witnessed notable growth, with increases in daily active users and transaction volumes signaling a bullish outlook for the cryptocurrency. An upsurge in network activity typically indicates heightened demand, a positive sign for Ethereum&#8217;s price potential. From January 3, the number of daily active Ethereum addresses surged by over 46%, coinciding with a significant price rally. This increased activity and price appreciation period highlights Ethereum&#8217;s resilience and potential for growth, even in the face of regulatory uncertainties. As Ethereum navigates through these regulatory and market challenges, the coming weeks will be critical in determining its ability to breach the $4,000 mark. The juxtaposition of technical bullish signals against the backdrop of SEC scrutiny presents a complex scenario for ETH. Related Reading: Ethereum Is Not Done: Crypto Analyst Sets New $5,000 Target However, the strength of its network and the increasing user engagement offer a glimmer of hope for Ethereum enthusiasts and investors. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-26T00:00:31.000Z",
    "title": "Trader Says Shiba Inu May Be Repeating 2021 Bull Market Pattern, Updates Outlook on Solana and Dogecoin",
    "url": "https://dailyhodl.com/2024/03/25/trader-says-shiba-inu-may-be-repeating-2021-bull-market-pattern-updates-outlook-on-solana-and-dogecoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto strategist who accurately called the latest Bitcoin (BTC) correction says the top meme token Shiba Inu (SHIB) may be mirroring a pattern last seen during the 2021 bull market. Pseudonymous analyst Rekt Capital tells his 436,200 followers on the social media platform X that SHIB is in the process of retesting its weekly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/25/trader-says-shiba-inu-may-be-repeating-2021-bull-market-pattern-updates-outlook-on-solana-and-dogecoin/\">Trader Says Shiba Inu May Be Repeating 2021 Bull Market Pattern, Updates Outlook on Solana and Dogecoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]