[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T05:16:43.000Z",
    "title": "Raise Update: Memeinator’s Hits $1.4m",
    "url": "https://www.cryptopolitan.com/raise-update-memeinators-hits-1-4m/",
    "description": "The frost of crypto winter is thawing, with once-frigid market conditions finally showing signs of easing up. Considering Bitcoin’s recent surge past $35,000 and billions of dollars in inflows toward investment opportunities in 2023, conditions indicate that winter is over. Crypto pundits, therefore, expect a new wave of people looking to invest in crypto to ... <a title=\"Raise Update: Memeinator&#8217;s Hits $1.4m\" class=\"read-more\" href=\"https://www.cryptopolitan.com/raise-update-memeinators-hits-1-4m/\" aria-label=\"More on Raise Update: Memeinator&#8217;s Hits $1.4m\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-11-30T05:38:15.000Z",
    "title": "ColdStack $CLS Hits 9-Months High, Hitting Over 500% Lately",
    "url": "https://nulltx.com/coldstack-cls-hits-9-months-high-hitting-over-500-lately/",
    "description": "ColdStack ($CLS) has surged to impressive heights, reaching a 9-month peak and edging closer to its yearly high after a substantial 7-day rally that has garnered significant attention lately.  In the spotlight as one of the prominent altcoins, ColdStack has experienced a remarkable price surge, soaring by a staggering 500% [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T05:20:43.000Z",
    "title": "AVAX Price Prediction: Avalanche Rally Just Getting Started?",
    "url": "https://www.newsbtc.com/analysis/avax/avax-price-prediction-avalanche-rally-25/",
    "description": "AVAX price is showing positive signs above the $20 support. Avalanche bulls seem to be in control, and they might aim for a rally toward $25. AVAX price is showing positive signs above the $20 level against the US dollar. The price is trading above $21 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $20.60 on the 4-hour chart of the AVAX/USD pair (data source from Kraken). The pair could continue to rise if there is a clear move above the $22.50 and $23.00 resistance levels. AVAX Price Signals Fresh Rally After a strong increase, Avalanche’s AVAX faced resistance near the $24.00 zone. It started a downside correction from $24.05 but remained in a positive zone, like Bitcoin and Ethereum. There was a drop below the $23 and $22 levels. The price declined below the 50% Fib retracement level of the upward move from the $15.60 swing low to the $24.05 high. It even spiked below the $20 support zone. However, the bulls were active above $18.80. AVAX price found support near $18.80 and the 61.8% Fib retracement level of the upward move from the $15.60 swing low to the $24.05 high. It is again moving higher and trading above the $20 level. There was a move above the $21 zone and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $20.60 on the 4-hour chart of the AVAX/USD pair. On the upside, an immediate resistance is near the $22.50 zone. Source: AVAXUSD on TradingView.com The next major resistance is forming near the $23.00 zone. If there is an upside break above the $22.50 and $23.00 levels, the price could surge over 10%. In the stated case, the price could rise steadily towards the $25 level. Dips Limited in Avalanche? If AVAX price fails to continue higher above the $22.50 or $23.00 levels, it could start another decline. Immediate support on the downside is near the $20.60 level and the 100 simple moving average (4 hours). The main support is near the $19.50 zone. A downside break below the $19.50 level could open the doors for a fresh decline towards $18.80. The next major support is near the $15.80 level. Technical Indicators 4 hours MACD – The MACD for AVAX/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for AVAX/USD is now above the 50 level. Major Support Levels – $19.50 and $18.80. Major Resistance Levels – $22.50, $23.00, and $25.00."
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-30T05:15:19.000Z",
    "title": "Terra Luna Classic (LUNC) Price Prediction 2023-2030: Will LUNC Price Hit $0.001 Soon?",
    "url": "https://coinedition.com/terra-luna-classic-lunc-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra-Classic-(LUNC)-Price-Prediction 2022\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Terra is an open-sourced blockchain project built to enhance the development of following-generation products and services. Its native token, called before its market implosion in May 2022, is now rebranded to Terra Classic and denoted with LUNC. Terra Classic investors are bullish, and the return on their investment has been over 19 times in the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/terra-luna-classic-lunc-price-prediction/\">Terra Luna Classic (LUNC) Price Prediction 2023-2030: Will LUNC Price Hit $0.001 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]