[
  {
    "source": "CoinDesk",
    "date": "2023-08-17T08:30:48.000Z",
    "title": "Bitcoin's 2023 Bullish Trendline in Focus as Traders Search for Directional Clues",
    "url": "https://www.coindesk.com/markets/2023/08/17/bitcoins-2023-bullish-trendline-in-focus-as-traders-search-for-directional-clues/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A bullish trendline is a an upward-sloping diagonal line connecting two or more higher price lows."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-17T08:31:17.000Z",
    "title": "Bitcoin, Ethereum Dip After Fed Hints at More Rate Hikes",
    "url": "https://decrypt.co/152767/bitcoin-ethereum-dip-after-fed-hints-more-rate-hikes",
    "description": "Crypto and stocks saw a decline after the U.S. Federal Reserve reaffirmed its aims to bring inflation down to its 2% target. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T08:22:13.000Z",
    "title": "Bitcoin mining researchers claim new tech ups winning hash chance by 260%",
    "url": "https://cointelegraph.com/news/bitcoin-mining-researchers-claim-new-tech-ups-winning-hash-chance-by-260",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c150e9cc-5da4-4df9-9355-17d1be5111c9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>UK-based research company Quantum Blockchain Technologies has developed algorithmic search methods that boost Bitcoin mining efficiency and reward probability, CEO Francesco Gardin says in an interview.</p>\n                    <p><p>Quantum Blockchain Technologies (QBT), a research company based in the United Kingdom, has developed artificial intelligence-powered algorithms that could significantly increase the mining winning probability of certain ASIC Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miners, CEO Francesco Gardin said in an interview with Cointelegraph.</p><p>Speaking exclusively to the publication, Gardin unpacked how Quantum Blockchain Technologies (QBT) has incorporated AI to enable the smart search of winning hashes as an alternative to conventional random searches.</p><p>In the space of two years, the company has developed a number of different patented methods by tapping into the expertise of some twenty experts from the fields of quantum computing, machine learning, cryptography, ASIC chips design and algorithm optimization theory.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-miners-bullish-despite-bear-market-hut8-foundry-braiins\"><strong><em>Related: Bitcoin miners still bullish despite toughest bear market yet — Hut8, Foundry, Braiins</em></strong></a></p><p>QBT’s machine learning teams have developed two different algorithmic search methods which reportedly improve performance of ASIC miners by increasing efficiency and winning result probabilities.</p><p>“Method A” is said to improve miner efficiency by 10% while “Method B” is set to improve the probability of a miner finding a winning has by 260%.</p><p>Gardin said that the company is looking to explore three specific areas, starting with a short term target of increasing mining performance of existing commercial ASIC chips by adding a software AI component running on a mining rig.</p><p>The team is also designing a new architecture for ASIC mining chips to optimize Bitcoin mining, which it detailed in a recent <a href=\"https://www.londonstockexchange.com/news-article/QBT/patent-application/16052227\" target=\"_blank\" rel=\"noopener nofollow\">patent application</a>. </p><p>Meanwhile QBT has a <a href=\"https://www.londonstockexchange.com/news-article/QBT/r-d-update-quantum-%20computing/15784940\" target=\"_blank\" rel=\"noopener nofollow\">long term goal</a> of using quantum computers to mine Bitcoin using an in-development SHA-256 computation method that can operate on quantum computing systems. </p><p>QBT announced a patent application in July 2023 for the latter, outlining its architectural change to Bitcoin mining ASIC chips which it claims pre-processes data used by future blocks on the Bitcoin blockchain.</p><p>Gardin said the QBT Message Scheduling for Cryptographic Hashing ASIC (MSFCA) is able to perform pre-calculations of future BTC blocks before the current block is closed. The “anticipatory resource efficiency algorithm” reduces logic gates of SHA-256 ASIC architecture.</p><p>Logic gates are software or hardware devices that carry out logical operations. According to Gardin, MSFCA allows miners to use less logic gates, lowering energy costs and improving efficiency of ASIC mining hardware. </p><p><a href=\"https://cointelegraph.com/news/tether-cto-paolo-ardoino-money-2020-interview\"><strong><em>Related: Tether’s game plan in El Salvador: Why invest in Volcano Energy?</em></strong></a></p><p>The firm estimates that miners could free up to 8% of logic gates of SHA-256 ASIC chips by pre-processing data used by future blocks on the Bitcoin blockchain, which would make certain logic gates involved in the computation of that data no longer necessary on the ASIC chip.</p><p>Gardin also weighed in on the potential for these new methods to influence the Bitcoin mining industry. The QBT said that BTC mining is highly dependent on hardware configurations and hashing power of miners as well as expending considerable amounts of energy.</p><p>Gardin added that the probability of finding the winning hash increases with the number and halving speed of a miners’ fleet or an entire pool as well as the corresponding cost of energy while conducting a “completely random search”.</p><blockquote>“There are no methods, intelligence, or strategy in current BTC mining, but simply brute force and luck.”</blockquote><p>Although the mining rigs market is dominated by just a handful of ASIC manufacturers, Gardin believes that there are minimal differences, features or distinct advances between hardware aside from differences in hashing rates and power consumption. </p><p>He added that QBT’s technology, which was mainly developed using Intel’s Blockscale ASIC chips which were recently <a href=\"https://arstechnica.com/gadgets/2023/04/intel-introduced-bitcoin-mining-chips-a-year-ago-and-theyre-already-going-away/\" target=\"_blank\" rel=\"noopener nofollow\">pulled from production</a>, would provide advantages to any mining rig.</p><p>The firm’s technologies are being touted to give an “uncatchable advantage” using AI and SHA-256 optimization and while QBT does not plan to open source its patented methods, Gardin said QBT is considering different options to take its solutions to the Bitcoin mining market.</p><p>This could include subscription, licensing, forming a joint venture or outright purchase of the company and its associated technologies. </p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T08:18:35.000Z",
    "title": "TRON DAO Ventures Invests $2 Million in CRV and Curve to Launch on TRON and BTTC",
    "url": "https://cryptodaily.co.uk/2023/08/tron-dao-ventures-invests-2-million-in-crv-and-curve-to-launch-on-tron-and-bttc",
    "description": "<p>Geneva, Switzerland, August 17th, 2023, Chainwire</p><p>TRON DAO Ventures, the investment arm of TRON DAO, has recently bought $2 million worth of CRV tokens. As part of this strategic partnership, Curve will launch on both the TRON and the BTTC networks.</p><p>Curve is a decentralized exchange acclaimed for its automated market makers (AMMs) tailored for stablecoin trading. Having experienced an exponential surge in the latter half of 2020, it once established itself as the epitome of DeFi platforms. Currently, Curve ranks as the world's second-largest decentralized exchange (DEX) and the largest DEX for stablecoin trading.</p><p>The recent hack targeting the platform has led to a chain reaction in the DeFi space. TRON founder Justin Sun promptly expressed his support for Curve after the incident, stating, \"Curve is an essential DeFi infrastructure for the blockchain industry. Our thoughts are with the team and the users affected. As a community, let's support and strengthen the security measures to protect our decentralized ecosystem.\"&nbsp;</p><p>Amidst the volatile market on August 1, TRON forged a partnership with Curve, introducing a stUSDT pool on the platform. stUSDT, the world's first rebase real-world asset (RWA) protocol on the TRON blockchain, is hailed as the Web3 world's version of Yu'E Bao (once China&rsquo;s largest money market fund). According to Defillama, the TVL on stUSDT has already exceeded $700 million.</p><p>Following that, TRON DAO Ventures announced its investment in Curve, underscoring TRON's ecosystem support not only through collaboration but also through financial backing. Meanwhile, Curve will integrate with the TRON and the BTTC networks as part of the partnership.</p><p>The collaboration among TRON, BTTC, and Curve is set to generate crucial synergies for the industry. Curve, a foundation infrastructure in the DeFi domain, offers significant advantages in terms of reduced financial costs and time inefficiencies while also supporting prominent public blockchains like Ethereum, Arbitrum, and Avalanche. This collaboration is poised to help further develop TRON's DeFi ecosystem. Meanwhile, as a major driver of DeFi innovation, TRON will share its most secure and cutting-edge products with Curve.</p><p>The integration between Curve and BTTC will also fuel the growth of DeFi ecosystems, especially DEX platforms. As the industry's first heterogeneous cross-chain interoperability protocol, BTTC has supported cross-chain functionality between TRON, Ethereum, and BNB Chain upon its release. It will also introduce zero-knowledge (ZK) proof technology later this year, which enables users to build dApps seamlessly across different blockchains, promoting an inclusive ecosystem open to everyone.</p><p>With the backing of TRON and BTTC, Curve anticipates a rapid rebound, and users are bound to witness a more vibrant DeFi ecosystem in the crypto industry.</p><p></p><p>About TRON DAO</p><p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p><p>Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. The TRON network has gained incredible traction in recent years. As of August 2023, it has over 179.07 million total user accounts on the blockchain, more than 6.26 billion total transactions, and over $13.01 billion in total value locked (TVL), as reported on TRONSCAN.&nbsp;</p><p>In addition, TRON hosts the largest circulating supply of USD Tether (USDT) stablecoin across the globe, overtaking USDT on Ethereum since April 2021. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently in October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, which marks the first time a major public blockchain partnered with a sovereign nation to develop its national blockchain infrastructure. On top of the government&rsquo;s endorsement to issue Dominica Coin (&ldquo;DMC&rdquo;), a blockchain-based fan token to help promote Dominica&rsquo;s global fanfare, seven existing TRON-based tokens - TRX, BTT, NFT, JST, USDD, USDT, TUSD, have been granted statutory status as authorized digital currency and medium of exchange in the country.</p><p>TRONNetwork | TRONDAO | Twitter | YouTube | Telegram | Discord | Reddit | GitHub | Medium | Forum</p><p></p><p>About Curve</p><p>Founded by Michael Egorov and launched in January 2020, Curve Finance positions itself as a DEX built on an AMM model. It focuses on the trading of stablecoins (USDT, USDC, DAI), synthetic assets/derivatives/staking assets (wBTC, renBTC, stETH), etc. In addition to its stronghold Ethereum, Curve also extended its presence across other chains such as Fantom, Polygon, Avalanche, Arbitrum, and Optimism.&nbsp;</p><p></p>ContactHayward Wongpress@tron.network"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T08:21:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T08:13:17.000Z",
    "title": "Experts Expect Government Adoption of Ripple (XRP) to Drive Price to $1 and Beyond – This Is What It Takes",
    "url": "https://www.crypto-news-flash.com/experts-expect-government-adoption-of-ripple-xrp-to-drive-price-to-1-and-beyond-this-is-what-it-takes/?utm_source=rss&utm_medium=rss&utm_campaign=experts-expect-government-adoption-of-ripple-xrp-to-drive-price-to-1-and-beyond-this-is-what-it-takes",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Ripple is reportedly in talks with the New Zealand government to launch its CBDC on the XRP Ledger. The XRP Network activity has shot up and the current RSI levels show that XRP is not in the overbought territory. With the court ruling coming in favor of Ripple last month, a number of financial institutions [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T08:11:25.000Z",
    "title": "Cardano Poised for a Massive 50% Upswing Ahead as Ecosystem Developments Explode – Could ADA Reach $0.35 Soon?",
    "url": "https://www.crypto-news-flash.com/cardano-poised-for-a-massive-50-upswing-ahead-as-ecosystem-developments-explode-could-ada-reach-0-35-soon/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-poised-for-a-massive-50-upswing-ahead-as-ecosystem-developments-explode-could-ada-reach-0-35-soon",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CARDANO-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Cardano is ranked third in development activity, showcasing the network&#8217;s progress and stakeholder engagement. A noticeable surge in Cardano&#8217;s daily trading volume indicates growing investor sentiment. Sourced from the recent Santiment tweet, the crypto community is abuzz with the revelation that Cardano ($ADA) has marked its territory as one of the top three crypto assets [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-17T08:34:00.000Z",
    "title": "Shiba Inu Shibarium Faces Technical Issues Just Hours After Launch",
    "url": "https://coinedition.com/shiba-inu-shibarium-faces-technical-issues-just-hours-after-launch/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shiba Inu’s Shibarium launch has come with a significant hurdle for the crypto community barely 24 hours into its release. In a recent tweet, Chinese reporter Colin Wu highlighted that transaction activities on Shibarium, the Layer 2 solution for Shiba Inu, are currently experiencing a pending state. According to the data shared, nearly $2 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-shibarium-faces-technical-issues-just-hours-after-launch/\">Shiba Inu Shibarium Faces Technical Issues Just Hours After Launch</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-17T08:15:00.000Z",
    "title": "Increased Shorting Activity May Soon Lead To Liquidations: Report",
    "url": "https://coinedition.com/increased-shorting-activity-may-soon-lead-to-liquidations-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Traders_are_shorting_now_as_crypto_market_caps_continue_their_downturn-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Santiment, the blockchain intelligence firm, revealed in a tweet yesterday that traders are shorting the cryptocurrency market as the market capitalizations of many digital assets continue to decline. Despite this, the firm predicted that the likelihood of liquidations against traders betting against the market will rise, which will be an overall bullish indication. According to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/increased-shorting-activity-may-soon-lead-to-liquidations-report/\">Increased Shorting Activity May Soon Lead To Liquidations: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]