[
  {
    "source": "CoinDesk",
    "date": "2023-11-13T14:05:07.000Z",
    "title": "The Tax Implications of Sam Bankman-Fried’s Conviction",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/13/the-tax-implications-of-sam-bankman-frieds-conviction/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The end of the trial provides some clarity for FTX customers as to how the company’s bankruptcy might affect their taxes. But how the IRS might act in the context of illegal activity is unclear."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-13T13:57:04.000Z",
    "title": "Will Dogecoin (DOGE) and Shiba Inu (SHIB) Surpass Expectations with a Pre-2024 Rally?",
    "url": "https://cryptodaily.co.uk/2023/11/will-dogecoin-doge-and-shiba-inu-shib-surpass-expectations-with-a-pre-2024-rally",
    "description": "Dive into the captivating world of Dogecoin (DOGE) and Shiba Inu (SHIB) as they navigate the unpredictable crypto market. Our in-depth analysis focuses on their current performance and the potential for an early rally before 2024. Gain valuable insights into the possibilities of a bullish surge or a bearish retreat, and stay informed about these popular meme coins in the ever-changing realm of cryptocurrency."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T13:56:56.000Z",
    "title": "Tether Mints 4 Billion USDT in a Month Amidst Crypto Market Observations",
    "url": "https://www.cryptopolitan.com/tether-mints-4-billion-usdt-in-a-month/",
    "description": "Stablecoin issuer Tether has been actively minting new USDT tokens, adding 4 billion USDT to circulation in the past month. The latest issuance includes 1 billion USDT on the Tron blockchain on November 10 and 1 billion on Ethereum on November 9. Tether&#8217;s Chief Technology Officer and new CEO, Paolo Ardoino, explained that these transactions ... <a title=\"Tether Mints 4 Billion USDT in a Month Amidst Crypto Market Observations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-mints-4-billion-usdt-in-a-month/\" aria-label=\"More on Tether Mints 4 Billion USDT in a Month Amidst Crypto Market Observations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T13:51:22.000Z",
    "title": "Ripple CEO Advocates for a Multichain Crypto Future",
    "url": "https://www.cryptopolitan.com/ripple-ceo-on-a-multichain-crypto-future/",
    "description": "During the Ripple Swell 2023 event held in Dubai, Ripple CEO Brad Garlinghouse shared his views on the future of the cryptocurrency space, emphasizing the need to move away from crypto maximalism and embrace a multichain world. In addition to discouraging maximalist attitudes, Garlinghouse highlighted two key factors that he believes will drive institutional adoption ... <a title=\"Ripple CEO Advocates for a Multichain Crypto Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-ceo-on-a-multichain-crypto-future/\" aria-label=\"More on Ripple CEO Advocates for a Multichain Crypto Future\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T13:41:16.000Z",
    "title": "Spain’s CNMV Cracks Down on Fraudulent Crypto Promotions, Vows Strict Enforcement",
    "url": "https://www.cryptopolitan.com/spains-cnmv-on-fraudulent-crypto-promotion/",
    "description": "The National Stock Market Commission (CNMV), Spain&#8217;s leading financial regulator, has issued a stern warning against fraudulent cryptocurrency promotions on social media platforms and emphasized the importance of adherence to local laws. CNMV&#8217;s head, Rodrigo Valbuena, revealed these concerns during a speech at the Deloitte annual conference for the Spanish financial sector. Illegal use of ... <a title=\"Spain&#8217;s CNMV Cracks Down on Fraudulent Crypto Promotions, Vows Strict Enforcement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spains-cnmv-on-fraudulent-crypto-promotion/\" aria-label=\"More on Spain&#8217;s CNMV Cracks Down on Fraudulent Crypto Promotions, Vows Strict Enforcement\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T14:03:09.000Z",
    "title": "Solana dominates crypto conversations with 42% price jump",
    "url": "https://crypto.news/solana-dominates-crypto-conversations-with-42-price-jump/",
    "description": "Solana is the top trending cryptocurrency on social media today after a 42% price surge over the last 7 days."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T13:50:55.000Z",
    "title": "Crypto media The Block sells $70m majority stake to Foresight Ventures",
    "url": "https://crypto.news/crypto-media-the-block-sells-70m-majority-stake-to-foresight-ventures/",
    "description": "Crypto media firm The Block sold a majority stake to Foresight Ventures in a deal, valuing it at $70 million. Most capital is used to buy out former CEO Mike McCaffrey&#8217;s stake. He resigned after the news that he secretly&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T13:42:25.000Z",
    "title": "Crypto analysts bullish on Cardano and Bitcoin, Everlodge to rally",
    "url": "https://crypto.news/crypto-analysts-bullish-on-cardano-and-bitcoin-everlodge-to-rally/",
    "description": "Analysts predict Cardano (ADA) and Bitcoin (BTC) to continue rallying. Meanwhile, Everlodge (ELDG) may also continue increasing"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T14:00:25.000Z",
    "title": "Chainlink Forms Sell Signal, Analyst Predicts Pullback To This Level",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-sell-analyst-predicts-pullback-level/",
    "description": "An analyst has pointed out how Chainlink is forming a TD Sequential sell signal right now, which could lead to a retracement to this level. Chainlink Could Decline To $12.50 Following The Sell Signal As explained by analyst Ali in a new post on X, LINK could be heading toward a correction based on what the TD Sequential signal says. The &#8220;Tom Demark (TD) Sequential&#8221; is a popular indicator in technical analysis that is used to pinpoint reversals in the price of any asset (which, in the current discussion, is naturally Chainlink). The metric gives a signal whenever the asset has seen nine candles following a reversal in its price. The signal is a sell one if the candles are green, while it&#8217;s a buy one if the candles are red. Related Reading: Is A Bearish Reversal Coming For Bitcoin? This Metric May Warn So This phase is called the &#8220;setup phase.&#8221; Once the setup is done, a 13-candle long countdown phase kicks off. At the end of these 13 candles, the price could be believed to have hit another probable bottom or top (depending on whether the phase started with a sell or buy signal). Chainlink has recently been enjoying some very rapid growth, which has led to the asset&#8217;s price hitting heights not seen since April of last year. This run, however, may be going toward at least a temporary setback, as according to Ali, a TD Sequential setup phase seems to have finished for the cryptocurrency recently. The signal has in fact appeared on not just one, but three of the coin&#8217;s price charts: daily, 3-day, and weekly. Here are the charts as shared by the analyst: LINK appears to have completed a TD-9 setup &#124; Source: @ali_charts on X As displayed in the above graph, the Chainlink TD Sequential setup phase has finished with green candles on all of these LINK charts, implying a reversal towards the bearish side may be imminent for the cryptocurrency. Ali anticipates that the retracement would be towards the $12.50 level, which would mean a drawdown of more than 18% from the current price level of the asset. &#8220;Failing to hold above this critical support area could extend the losses to $10.50,&#8221; the analyst further adds. Such a decline all the way to $10.50 would suggest a decrease of over 31% for Chainlink, but even if such a steep drop happens, LINK still wouldn&#8217;t have fully undone the recovery it has made since the last third of October, showing just how sharp the asset&#8217;s bullish momentum has been recently. Related Reading: Ethereum At $2,100: Why Path To $2,500 Is Now All Clear It now remains to be seen what trajectory the asset takes from here considering this bearish signal. So far, chances are not looking in the favor of the coin, as it has seen two red candles already since the pattern has formed, implying that the countdown phase might have begun. LINK Price Chainlink had risen above the $16.5 mark during the weekend, but the coin has taken a hit in the past day as it&#8217;s now close to the $15 level. LINK has more than doubled during the past month &#124; Source: LINKUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-13T14:10:55.000Z",
    "title": "Fanton Fantasy Football Wins Big with TONcoin.Fund",
    "url": "https://www.crypto-news-flash.com/fanton-fantasy-football-wins-big-with-toncoin-fund/?utm_source=rss&utm_medium=rss&utm_campaign=fanton-fantasy-football-wins-big-with-toncoin-fund",
    "description": "<img width=\"600\" height=\"400\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Fanton_TONcoin.Fund_.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Fanton_TONcoin.Fund_.png 600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Fanton_TONcoin.Fund_-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Fanton_TONcoin.Fund_-104x69.png 104w\" sizes=\"(max-width: 600px) 100vw, 600px\" />( Tel Aviv, Israel ) The innovative game Fanton Fantasy Football, which combines the thrill of fantasy football with the latest in NFT and crypto tech, is proud to announce a significant initial investment from TONcoin.Fund. Fanton has become a big name in the fantasy sports scene, giving football fans a chance to put their [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-13T13:45:43.000Z",
    "title": "Solana’s Meteoric Rise: Is a $75 Breakout Imminent?",
    "url": "https://www.crypto-news-flash.com/solanas-meteoric-rise-is-a-75-breakout-imminent/?utm_source=rss&utm_medium=rss&utm_campaign=solanas-meteoric-rise-is-a-75-breakout-imminent",
    "description": "<img width=\"1043\" height=\"575\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Anatoly Yakovenko, the co-founder of Solana Labs, believes that using Ethereum (ETH) as a layer-2 solution for the Solana (SOL) blockchain is a viable concept, despite some limitations and potential risks.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-1024x565.jpg 1024w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />In the top 35 coins, Solana has been the biggest gainer at over 40% in the past week, and despite a slight correction today, the price looks set to regain momentum. Analysts have pointed out that the crypto has been consolidating in the past few days in a closed range and expect the price to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T14:04:00.000Z",
    "title": "XRP Price Analysis: Why a Ride Down to $0.60 Is Possible",
    "url": "https://coinedition.com/xrp-price-analysis-why-a-ride-down-to-0-60-is-possible/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Internal-XRP-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>At the expense of its holders, the price of Ripple (XRP) has dropped to $0.65. This decrease represents a 9.72% fall in the last seven days, considering that the token hit $0.72 on November 7. The recent price action is in line with the cooling period a lot of altcoins are having. From the XRP/USD [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-price-analysis-why-a-ride-down-to-0-60-is-possible/\">XRP Price Analysis: Why a Ride Down to $0.60 Is Possible</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]