[
  {
    "source": "BTCManager",
    "date": "2023-11-23T08:28:10.000Z",
    "title": "Shiba Inu and The Sandbox face competition from an up-and-coming rival ",
    "url": "https://crypto.news/shiba-inu-and-the-sandbox-face-competition-from-an-up-and-coming-rival/",
    "description": "NuggetRush gains investor attention with its P2E gameplay as Shibarium introduces \"Donate\". The Sandbox-Gucci alliance boosts SAND "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T08:10:50.000Z",
    "title": "Dogecoin Dazzle: Netflix Director’s $4 Million Bet Turns Into $27 Million",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-netflix-director-bet/",
    "description": "In an audacious financial play, Carl Erik Rinsch, the director of Netflix&#8217;s sci-fi series &#8220;Conquest,&#8221; reportedly magnified a $4 million investment in Dogecoin to a whopping $27 million. This unexpected windfall is part of a larger, dramatic narrative involving Rinsch&#8217;s handling of the series&#8217; budget. Dogecoin Windfall And Extravagant Expenditure Rinsch&#8217;s journey into the crypto realm began after he faced significant losses in the stock market. Financial records show that after receiving an additional $11 million from Netflix to support &#8220;Conquest,&#8221; Rinsch allocated $10.5 million to stock market ventures, primarily in pharmaceutical companies and the S&#38;P 500. These risky options trades resulted in a loss of nearly $6 million in just a few weeks, leaving him with a little over $4 million. Related Reading: Dogecoin Jumps 10%, But This Signal Could Bring Rally To A Stop In a bold pivot, Rinsch transferred the remaining funds to the cryptocurrency exchange Kraken, where he invested heavily in Dogecoin, a then-emerging digital currency inspired by an internet meme. His investment coincided with an extraordinary surge in Dogecoin&#8217;s value, culminating in him cashing out around $27 million in May 2021, as evidenced by an account statement seen by the Times. Following this success, Rinsch reportedly expressed his gratitude in an online chat with a Kraken representative, saying, “Thank you and god bless crypto.” However, Rinsch&#8217;s windfall quickly translated into extravagant spending. He embarked on a lavish spree, purchasing five Rolls-Royces, a Ferrari, a high-priced Vacheron Constantin watch valued at $387,630, and an assortment of luxury furniture and designer clothing. The total expenditure amounted to $8.7 million, as determined by a forensic accountant hired by Ms. Rosés, Rinsch’s then-wife. Related Reading: Dogecoin Metrics Signal Impending Breakout, How High Can The Price Go? The spending raised suspicions during Rinsch&#8217;s acrimonious divorce from Ms. Rosés. Her legal team speculated that these purchases might be an attempt to conceal his cryptocurrency profits. In response, Rinsch claimed in a deposition that these items were props for “Conquest,” funded by Netflix&#8217;s production money. &#8220;Conquest&#8221; Is Written Off Remarkably, Rinsch’s financial upswing stands in sharp contrast to the fate of &#8220;Conquest.&#8221; Netflix, having invested over $55 million in the series, has yet to receive a single completed episode. Rinsch&#8217;s unconventional financial maneuvers and erratic behavior during the production have led to a standoff with Netflix. The streaming giant is now embroiled in a confidential arbitration process with Rinsch, who claims a breach of contract and seeks at least $14 million in damages. Netflix, contesting these claims, views Rinsch&#8217;s demands as unfounded. Thomas Cherian, a spokesman for Netflix, highlighted the company&#8217;s extensive support for Rinsch&#8217;s series, noting the eventual decision to write off the project due to the realization that Rinsch was not on track to complete it. At press time, DOGE traded at $0.0755. Featured image from iStock, chart from TradingtView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-23T08:36:19.000Z",
    "title": "Investing in Crypto’s New Horizon: NuggetRush and Optimism as Alternatives to a Waning Chainlink",
    "url": "https://www.crypto-news-flash.com/investing-in-cryptos-new-horizon-nuggetrush-and-optimism-as-alternatives-to-a-waning-chainlink/?utm_source=rss&utm_medium=rss&utm_campaign=investing-in-cryptos-new-horizon-nuggetrush-and-optimism-as-alternatives-to-a-waning-chainlink",
    "description": "<img width=\"512\" height=\"292\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-40-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-40-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-40-1-300x171.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />NuggetRush (NUGX) is poised to dominate the GameFi space by combining gaming excitement with real-world impact through play-to-earn mechanics, artisanal mining, and crypto trading. A significant withdrawal of Optimism (OP) tokens by Amber Group from Binance on November 13, 2023, triggered a substantial price rally and increased activity on Optimism&#8217;s network. Chainlink (LINK) experienced a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-23T08:33:44.000Z",
    "title": "Bitcoin (BTC) Price Prediction 2023-2030: Will BTC Price Hit $50,000 Soon?",
    "url": "https://coinedition.com/bitcoin-btc-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish BTC price prediction ranges from $44,805.43 to $46,721.11. BTC price might also reach $50,000 this 2023. BTC’s bearish market price prediction for 2023 is $21,564.98. Bitcoin (BTC) is the most prominent cryptocurrency with a tremendous growth potential. Over the years, BTC has also gained significant recognition in the economy, being acknowledged by governments and [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-btc-price-prediction/\">Bitcoin (BTC) Price Prediction 2023-2030: Will BTC Price Hit $50,000 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]