[
  {
    "source": "CryptoSlate",
    "date": "2024-01-12T16:47:08.000Z",
    "title": "BlackRock CEO’s crypto pivot continues, turns bullish on tokenization to eliminate ‘corruption’",
    "url": "https://cryptoslate.com/blackrock-ceos-crypto-pivot-continues-turns-bullish-on-tokenization-to-eliminate-corruption/",
    "description": "<p>BlackRock&#8217;s spot Bitcoin ETF launch was highlighted in an interview with CEO Larry Fink on CNBC. Fink, who had previously expressed skepticism about Bitcoin, now views it as a viable asset class, though not a potential currency. This change of stance aligns with BlackRock&#8217;s broader strategy of embracing technological advancements in the financial sector, mainly [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrock-ceos-crypto-pivot-continues-turns-bullish-on-tokenization-to-eliminate-corruption/\">BlackRock CEO&#8217;s crypto pivot continues, turns bullish on tokenization to eliminate &#8216;corruption&#8217;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T16:55:31.000Z",
    "title": "Ethereum Price Prediction 2024-2033: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2024-2033 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T17:00:33.000Z",
    "title": "Solana In 2024: Roadmap And Key Price Targets For This Year",
    "url": "https://www.newsbtc.com/news/solana/solana-2024-roadmap-key-price-targets/",
    "description": "The Solana Foundation has unveiled a roadmap for 2024, focusing on innovation, developer engagement and network scalability. &#8220;2024 is the year of Solana,&#8221; the foundation proclaimed, focusing on the key milestones achieved and strategic goals for the year in the statement. The “Solana Foundation&#8217;s State of Developer Ecosystem Report” highlights a surge in developer activity, with over &#8220;2,500 active developers committing to open source repositories&#8221; and an impressive increase in developer retention, rising &#8220;from 31% to over 50% throughout the previous year.&#8221; The report further elucidated the evolution of Solana&#8217;s infrastructure, which in 2023 saw a leap in maturity with the deployment of &#8220;program frameworks for Rust, Python, and more,&#8221; as well as &#8220;SDKs available for 10 languages, laying a solid foundation for diverse dApp development.&#8221; Solana Labs’ innovative GameShift API has been a game-changer, a piece of &#8220;app-specific tooling&#8221; designed to revolutionize the gaming space on Solana&#8217;s blockchain. Related Reading: Massive Solana Heist: CLINKSINK Drainer Campaigns Swipe Nearly $1M Worth Of SOL On-chain data provided by Messari reinforces the network&#8217;s growth narrative, citing &#8220;a 65% quarter-over-quarter increase in daily average non-voting transactions, reaching 40.7 million, and a remarkable 102% quarter-over-quarter rise in average daily fee payers, amounting to 190,000.&#8221; The roadmap also unveils forthcoming advancements poised to redefine blockchain capabilities. First, Solana aims to introduce “token extensions to empower more complex and multifaceted tokenomics.&#8221; Second, a focus in 2024, will be on the launch of Firedancer, a new independent validator client for the Solana blockchain, built by Jump Crypto. It aims to support a higher number of concurrent transactions, increase network throughput, resilience, and efficiency, and address historical weaknesses in Solana&#8217;s peer-to-peer interface. Notably, Firedancer went live on the testnet in October 2023. A third focus in the 2024 roadmap will be the development of Runtime v2 by Solana Labs, which aims to &#8220;significantly enhance the network&#8217;s performance and developer experience.&#8221; This runtime is a concurrent transaction processor, handling transactions with specified data dependencies and explicit dynamic memory allocation. It introduces changes coordinated by epochs, influencing the cluster&#8217;s behavior. Moreover, Solana Core announced support for the Move programming language as a major modification in Runtime v2. Related Reading: Solana Poised For Major Upside: Analyst Predicts 47% Surge After Price Breakout The Solana Foundation’s message via X echoes a commitment to innovation and community engagement: &#8220;The strength of the Solana ecosystem is amplified by our passionate community. With the community&#8217;s unwavering support, we are ready to accelerate into 2024 and solidify Solana’s position as the premier platform for blockchain development. It’s time to accelerate. Let’s keep building &#38; make 2024 the year of Solana.&#8221; Solana Price Prediction 2024: A Technical Analysis A technical analysis of the Solana price action in the weekly chart (SOL/USD) offers predictions for 2024. Since mid-November, SOL’s price movement has been encapsulated within a parallel uptrend channel, indicative of a stable and consistent upward trajectory. The parallel lines representing support and resistance have guided the price action, providing clear levels for potential buy and sell points. The Fibonacci retracement tool, applied from the swing high of around $262 to the swing low of $7.93, unveils key levels that may act as barriers or support in the future. 0.236 at $69.59: A retracement level that previously acted as resistance and has turned into support. 0.382 at $107.74: This level has been tested and is the next major price target of a weekly close. 0.5 at $138.57: From 2021 till early 2022, this price level acted as strong support, but was turned into resistance in April 2022. 0.618 at $169.41: Often considered the &#8216;golden ratio,&#8217; this level is crucial for assessing trend continuation. 0.786 at $213.30: Breaching this level could signal strong bullish momentum. 1 at $269.22: As soon as SOL reaches its all-time high, the price discovery phase begins. Extended Fibonacci levels, such as 1.618 at $430.69 and 2.618 at $691.98, offer aspirational targets should the uptrend persist. The latter would be an ultra-bullish price target. The Exponential Moving Averages (EMA) for the 20, 50, 100, and 200 periods all lie below the current price, confirming the strength of the uptrend. A &#8216;golden cross&#8217; is evident in mid-December with the 50-EMA crossing above the 100-EMA, traditionally a bullish signal. The trading volume shows a constructive pattern, with higher volume seen on upswings, a positive sign for continued interest in SOL. The Relative Strength Index (RSI) is positioned around 60, suggesting that while the momentum is upward, there is still room for growth before reaching overbought conditions. The technical analysis, grounded in the weekly chart&#8217;s display of a parallel uptrend channel, robust Fibonacci levels, supportive moving averages, and healthy volume and RSI readings, paints a very optimistic price outlook for Solana in 2024. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-12T17:00:08.000Z",
    "title": "Shifting Investor Focus: From Stellar and Shiba Inu to the Next Buzzworthy Cryptocurrency",
    "url": "https://www.crypto-news-flash.com/shifting-investor-focus-from-stellar-and-shiba-inu-to-the-next-buzzworthy-cryptocurrency/?utm_source=rss&utm_medium=rss&utm_campaign=shifting-investor-focus-from-stellar-and-shiba-inu-to-the-next-buzzworthy-cryptocurrency",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-92.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-92.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-92-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-92-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-92-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto experts predict an 81% price surge for Stellar (XLM) by the end of 2024. Analysts predict Shiba Inu (SHIB) will cross the $0.000015 mark in 2024. A new meme coin is making a buzz in the crypto arena with 150% growth predictions. Stellar (XLM) recently celebrated the one-year anniversary of its Stellar Aid Assist. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-12T16:50:00.000Z",
    "title": "Xai Token Plummets Over 10% Post-Airdrop and Binance Debut",
    "url": "https://coinedition.com/xai-token-plummets-over-10-post-airdrop-and-binance-debut/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Xai Token Plummets Over 10% Post-Airdrop and Binance Debut\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Altcoins-Drop-Against-BTC-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Xai, a layer-3 gaming token, has witnessed a significant price drop of over 10%, a surprising turn of events in the cryptocurrency market. The decline followed closely on the heels of its airdrop and a major listing on the Binance exchange.  This sudden market reaction raises concerns and speculation among investors and market analysts. Consequently, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xai-token-plummets-over-10-post-airdrop-and-binance-debut/\">Xai Token Plummets Over 10% Post-Airdrop and Binance Debut</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]