[
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T20:57:47.000Z",
    "title": "Digital euro can ward off a host of private payment service ills: ECB official ",
    "url": "https://cointelegraph.com/news/digital-euro-can-ward-off-private-payment-service-ills-ecb-official",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/64c69588-9e26-4137-965e-122c701761b8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Private payment services can gain a monopoly over services with no benefit to other market players or economic stability, ECB board member Fabio Panetta said.</p>\n                    <p><p>The European Central Bank (ECB) is quite happy with the European Commission's (EC) legislative proposals for the digital euro. ECB executive board member Fabio Panetta told the European Parliament’s Committee on Economic and Monetary Affairs in a speech on Sept. 4 that the proposals “put Europe at the forefront of advanced economies” in CBDC development, potentially heading off private dominance of the financial sector and the ills that implies.</p><p>The EC <a href=\"https://cointelegraph.com/news/european-commission-aims-universal-acceptance-digital-euro-proposal\">made its proposals public</a> on June 28. Panetta, <a href=\"https://cointelegraph.com/news/ecb-official-crypto-deleterious-no-societal-benefits-scathing-speech\">a critic of cryptocurrency</a>, called the EC proposals for the euro central bank digital currency (CBDC) “a new paradigm for preserving monetary sovereignty” that would ensure Europeans always have access to a public payment option, whether it was cash or digital, even as “closed-loop solutions are becoming increasingly prevalent” in private payment services. Panetta compared private payment systems to private messaging, where users are pressured to join the most popular systems.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> A digital euro would be a new form of central bank money, says Executive Board member Fabio Panetta. It is now up to legislators to ensure it would replicate key characteristics of cash in the digital sphere, particularly its privacy<a href=\"https://t.co/nQJzYylwpV\">https://t.co/nQJzYylwpV</a><br><br>1/3 <a href=\"https://t.co/4XPlk83Lwj\">pic.twitter.com/4XPlk83Lwj</a></p>&mdash; European Central Bank (@ecb) <a href=\"https://twitter.com/ecb/status/1698701792375091363?ref_src=twsrc%5Etfw\">September 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The EC proposed giving the digital euro the status of legal tender, making its acceptance for payment mandatory. Panetta also praised the EC’s privacy proposals for the digital euro. He specified:</p><blockquote>“The Eurosystem would be unable to see the personal details of digital euro users or connect any payment information to private individuals. Intermediaries would only see the user information needed for onboarding and compliance with existing regulation.”</blockquote><p>“Furthermore, the possibility to pay offline would provide cash-like privacy, with neither the intermediary nor the central bank processing the payment,” Panetta said.</p><p>The proposals also included reasonable pricing policies and allowing the ECB to maintain equilibrium in the financial systems with tools like holding limits. Panetta said:</p><blockquote>“Let me emphasise, once again, that the issuance of a digital euro represents an opportunity, not a risk, for the European financial sector.” </blockquote><p>The alternative to introducing a CBDC is not maintaining the status quo. Rather, it is losing ground to new private solutions that could impact the economy, Panetta said. He held PayPal’s recently introduced PYUSD stablecoin up as an example of potential risk.  </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/eu-approves-smart-contract-kill-switch-rules-under-data-act\">EU finalizes controversial smart contract kill switch rules under Data Act</a></em></strong></p><p>Private payment service providers seek to gain market share and have no motivation to restrict their range of services or make them compatible with other services. As a result, a private service could attain a monopoly position on the market, as has happened before, Panetta explained. </p><p>In contrast, the digital euro “would pay due attention to orderly adjustments in the financial sector while offering payment service providers a platform for innovations with pan-euro area reach,” he said. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-blockchain-control-robots-incentivise-humans/\">How to control the AIs and incentivize the humans with crypto</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T20:51:49.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The former chair of Singapore's financial watchdog has become the city-state's next president. Australian lawmakers have sent the crypto bill presented by Senator Andrew Bragg back for minor amendments, after a long delay before the report was published. Meanwhile, the native token of the Gala ecosystem, GALA, has slumped after two co-founders filed separate lawsuits against each other.</p><h3>Regulator who called crypto ‘highly risky’ becomes Singapore’s next president</h3><p>Former Singaporean finance minister Tharman Shanmugaratnam <a href=\"https://cointelegraph.com/news/former-mas-chair-called-crypto-highly-risky-wins-singapore-presidential-race\">won the country’s presidential race</a> this past weekend—an outcome that received mixed reactions from the crypto community.</p><p>The former chair of the Monetary Authority of Singapore (MAS) earned more than 70% of the popular vote, according to local media reports. He will be sworn into office on Sept. 14. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6cddae08-fafa-4b61-8aa8-29b7ed4082bd.jpg\"  /><figcaption style=\"text-align: center;\"><em>Tharman Shanmugaratnam announces presidential victory on Sept. 2. Source: Facebook</em></figcaption></figure><p>As a member of the MAS, Shanmugaratnam called crypto a “highly volatile asset” and a “highly risky” investment product. However, that was before the regular <a href=\"https://cointelegraph.com/news/singapore-authority-issues-crypto-warning-after-pm-falls-prey-to-scammers\">green-lighted several crypto exchanges</a> to operate in the country, including Crpyto.com, Bitstamp, Coinbase and Gemini Trust. </p><p>Following his departure from the MAS, the financial regulator has continued to work on streamlining digital assets into the country’s financial infrastructure. This included announcing a revised regulatory framework for stablecoins, which was part of a public consultation launched in 2022. </p><h3>Australian lawmakers send back crypto bill by Andrew Bragg</h3><p>Australia’s Senate Committee on Economics Legislation has finally provided feedback to the cryptocurrency bill introduced by senator Andrew Bragg.</p><p>The committee on Sept. 4 reported on the draft bill referred to as “The Digital Assets (Market Regulation) Bill 2023,” asking the bill authors to add some amendments.</p><p>The Senate particularly concluded that it would pass the bill with minor amendments such as removing the term nonfungible tokens (NFTs) from the definition of regulated digital assets.</p><p>Among other recommendations, the lawmakers asked the bill authors to exclude certain asset-based tokens — such as the Gold and Silver Standard and the BetaCarbon Token — from the definition of stablecoin. The Senate also asked to extend the transition period from three to nine months.</p><p>In the report, the Senate also urged the Board of Taxation to review the tax treatment of digital assets and transactions in Australia with a target to introduce legislation in early 2024.</p><p>The government should implement in full the recommendations of the Council of Financial Regulators for potential policy responses to debanking in Australia, the lawmakers added. The Australian Department of the Treasury previously admitted that the growing trend of banks cutting services to cryptocurrency firms could lead to unwanted consequences like driving the industry underground.</p><p>“The committee inquiry has demonstrated that the government’s approach to digital asset regulation is hurting Australian consumers and investment,” the document reads. According to the Senate, the bill by senator Bragg is the “first serious step towards implementing a comprehensive digital asset regulatory framework,” adding:</p><blockquote>“The government has junked the ambitious crypto agenda of the former liberal government, and Australians will pay the price.”</blockquote><p>Senator Bragg introduced the “Digital Assets (Market Regulation) Bill 2023” in March, aiming to “protect consumers and promote investors.” The draft bill provides regulatory recommendations for stablecoins, licensing of exchanges and custody requirements.</p><p>The latest report by the Senate Committee came a while after it was originally expected. The committee initially planned to provide a report on the bill by Aug. 2, but sought an extension of the reporting date to Aug. 16. The deadline was subsequently extended to Aug. 25 and then to Sept. 4.</p><h3>GALA price slumps after founders lock horns in court </h3><p>Two co-founders of blockchain gaming platform Gala Games have sued each other in two separate lawsuits, one alleging the theft of $130 million worth of Gala and the other alleging corporate waste.</p><p>On Aug. 31, Gala co-founders Wright Thurston and Eric Schiermeyer filed lawsuits against one another in a Utah District Court.</p><p>On behalf of Gala, Schiermeyer — also the firm’s CEO — <a href=\"https://ecf.utd.uscourts.gov/doc1/18306207947?caseid=142042\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> that in early 2021, Thurston and his investment firm, True North United Investments, <a href=\"https://cointelegraph.com/news/exploits-hacks-and-scams-stole-almost-1b-in-2023-report\">stole around</a> $130 million worth of a token tied to the Gala Games ecosystem.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You can read both of the lawsuits here:<br>1. Gala Game&#39;s CEO Eric Schiermeyer&#39;s Lawsuit against co-founder: <a href=\"https://t.co/92ywN1fPnY\">https://t.co/92ywN1fPnY</a><br>2. Gala Game&#39;s co-founder Write Thurston lawsuit against Gala&#39;s CEO: <a href=\"https://t.co/xCoFkXRkaG\">https://t.co/xCoFkXRkaG</a></p>&mdash; Jake Browatzke  (@jakebrowatzke) <a href=\"https://twitter.com/jakebrowatzke/status/1697905305315635608?ref_src=twsrc%5Etfw\">September 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The same day, Thurston’s True North <a href=\"https://ecf.utd.uscourts.gov/doc1/18306209021?caseid=142069\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a lawsuit against Schiermeyer — similarly on behalf of Gala — claiming he caused Gala to “sell off and waste millions of dollars in company assets” and lent millions of Gala’s funds to himself <a href=\"https://cointelegraph.com/news/ftx-yacht-former-alameda-ceo-sam-trabucco\">for personal purchases</a>.</p><p>Schiermeyer’s suit requested Thurston be removed as a Gala director and seeks various relief and damages payments, including the return of the allegedly stolen GALA.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/dbc96792-5b26-4c9f-81fa-c4dcf14ce215.png\"  /><figcaption style=\"text-align: center;\"><em>GALA token 7-day price chart. Source: Cointelegraph Markets Pro</em></figcaption></figure><p>Thurston similarly requested that Schiermeyer be removed from Gala and sought at least $750 million in various damages and relief.</p><p>The price of GALA is currently down 12% over seven days, trading at $0.017 at the time of writing, <a href=\"https://www.coingecko.com/en/coins/gala\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from CoinGecko. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-04T21:00:40.000Z",
    "title": "UK Government publishes objectives for upcoming AI Safety Summit",
    "url": "https://cryptoslate.com/uk-government-publishes-objectives-for-upcoming-ai-safety-summit/",
    "description": "<p>On Sept. 4, the government of the United Kingdom published a series of objectives for its AI Safety Summit, which will take place Nov. 1-2 at Bletchley Park. Published by the Department for Science, Innovation &#38; Technology, the statement outlines five &#8220;ambitions&#8221; for safe artificial development (AI) development that will serve as guidelines for discussion [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uk-government-publishes-objectives-for-upcoming-ai-safety-summit/\">UK Government publishes objectives for upcoming AI Safety Summit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-04T20:40:28.000Z",
    "title": "Leading Crypto Casino Stake.com Hacked for $41 Million",
    "url": "https://cryptobriefing.com/leading-crypto-casino-stake-com-hacked-41-million/?utm_source=feed&utm_medium=rss",
    "description": "Stake.com, the world's largest crypto casino, suffers a $41 million breach with funds drained on Ethereum, BSC, and Polygon."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-04T21:03:17.000Z",
    "title": "Crypto Betting Platform Stake.com Comfirms Hacking Incident, Over $40 Million Worth of Assets Stolen",
    "url": "https://news.bitcoin.com/crypto-betting-platform-stake-com-comfirms-hacking-incident-over-40-million-worth-of-assets-stolen/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/stake.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto betting platform Stake.com confirmed on Sept. 4 that an unknown entity had carried out unauthorised transactions from its ethereum and Binance Smartchain hot wallets. However, the crypto-betting platform insisted that user funds were safe and that its other hot wallets remain operational. Digital Assets Worth More Than $40 Million Reportedly Stolen Stake.com, one of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T21:00:47.000Z",
    "title": "Bitcoin’s Spot ETF: Will BTC Mimic Gold’s 2004 Price Surge? Analyst Weighs In",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-spot-etf-will-btc-mimic-golds-2004/",
    "description": "A fresh perspective on Bitcoin has recently surfaced courtesy of prominent crypto enthusiast and YouTuber Lark Davis. Davis offers an interesting parallel between Bitcoin&#8217;s potential fate and gold&#8217;s historical performance, especially spotlighting the transformative year of 2004 for the latter. Reflecting on gold&#8217;s journey in the early 2000s, a period marked by the introduction of a gold Exchange Traded Fund (ETF), Lark Davis suggests that Bitcoin may be on the brink of a similar breakout. While this is a bold claim, its rationale, centered on the anticipated launch of a Bitcoin spot exchange-traded fund (ETF), warrants a closer look. Related Reading: Bitcoin Exchanges See Three Straight Months Of Withdrawals For First Time Ever Gold&#8217;s 2004 Surge: A Prelude To Bitcoin&#8217;s Future? 2004 was transformative for gold, with its price trajectory reflecting a notable paradigm shift. The catalyst for this change was the launch of the first gold ETF &#8211; SPDR Gold Shares (NYSE: GLD) by State Street Corporation. A chart shared by Davis vividly encapsulates this: the price of gold began its ascent from a modest $400 per ounce towards the end of 2004 and reached a pinnacle of $1,939 by 2011. Although a decline to $1,184 followed this meteoric rise, the overall trend showcased the profound impact of ETFs on asset prices. If history were to serve as a guide, Davis&#8217;s analogy suggests Bitcoin might follow a similar path. A potential Bitcoin spot ETF could usher in a flurry of new investments, changing the market&#8217;s supply and demand dynamics. As Davis showed from the gold example, introducing such an ETF for Bitcoin could potentially attract between $20 billion and $30 billion. Assuming today&#8217;s prices, this would be equivalent to newcomers snapping up approximately half of the available Bitcoin on exchanges. Estimates are that a spot Bitcoin ETF would bring 20-30 billion of fresh cash into Bitcoin. That would buy about half of all coins on exchanges at current prices. For reference here is what happened to gold when it got its first ETF approved on US markets. History repeating? pic.twitter.com/CBNvZgMq18 — Lark Davis (@TheCryptoLark) September 4, 2023 &#8216;Supply And Demand Don&#8217;t Lie&#8217; While Davis&#8217;s projection is rooted in past trends, it&#8217;s crucial to understand the broader dynamics at play. His assertion that &#8220;supply and demand don&#8217;t lie&#8221; underlines the fundamental economic principle that when demand exceeds supply, prices generally rise. The launch of a Bitcoin ETF would invariably boost demand by offering a more accessible and regulated way for investors to gain exposure to Bitcoin without owning the underlying asset directly. This surge in demand and Bitcoin&#8217;s capped supply might push prices higher, just as it did for gold in 2004. However, as with all financial forecasts, there&#8217;s a degree of speculation involved. While the parallel between gold&#8217;s 2004 trajectory and Bitcoin&#8217;s potential future is compelling, only time will reveal the actual course of events. Related Reading: This Could Be The Metric To Watch For A Bitcoin Bounce: Santiment Despite this forecast, Bitcoin has seen a slight dip over the past 24 hours, with a current market price of $25,867, at the time of writing. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-04T21:03:10.000Z",
    "title": "Pro-XRP Lawyer Maps Potential Ripple-SEC Settlement Amid Coinbase Case Influence",
    "url": "https://www.crypto-news-flash.com/pro-xrp-lawyer-maps-potential-ripple-sec-settlement-amid-coinbase-case-influence/",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"This decline could be just the initial sign of greater challenges for XRP. Whale Alert, a well-known entity tracking significant cryptocurrency transactions, highlighted a remarkable development.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />John Deaton speaks on the possibility of Ripple and the SEC reaching a settlement with its ongoing case.  XRP continues its decent run as it kickstarts the new week with a surge in trading volume.  Conversations on the Ripple vs. SEC lawsuit is still ongoing, especially as the SEC looks to make an appeal to [...]"
  }
]