[
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T18:57:51.000Z",
    "title": "Could Polygon (MATIC) Be Your Best Crypto Bet for 2023?",
    "url": "https://cryptodaily.co.uk/2023/11/could-polygon-matic-be-your-best-crypto-bet-for-2023",
    "description": "Explore the potential of Polygon (MATIC) in 2023 amidst the crypto market's excitement for Bitcoin ETFs. This article delves into MATIC's impressive market performance, recent surge in network activity, and provides a nuanced price prediction. Discover whether Polygon (MATIC) could be your key to crypto success in the evolving digital currency landscape."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T18:45:33.000Z",
    "title": "Top Crypto Marketing Agencies In 2024",
    "url": "https://cryptodaily.co.uk/2023/11/top-crypto-marketing-agencies-in-2024",
    "description": "The cryptocurrency landscape, currently valued at $1.47 trillion and experiencing a significant 74.33% variation over the past year,"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T18:48:16.000Z",
    "title": "X account of Ethereum L2 Loopring hacked by phishers",
    "url": "https://crypto.news/x-account-of-ethereum-l2-loopring-hacked-by-phishers/",
    "description": "Loopring’s X account remained compromised at press time, with the exploiters publishing multiple malicious links promoting a fake LRC airdrop."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T19:00:07.000Z",
    "title": "OpenAI Setback No Match For FET’s 160% Surge: Time To Invest In AI?",
    "url": "https://www.newsbtc.com/analysis/fet/openai-setback-no-match-for-fets-160-surge-time-to-invest-in-ai/",
    "description": "The Artificial Intelligence (AI) sector in the crypto space has enjoyed one of the most prominent rallies despite the debacle with OpenAI. The company behind ChatGPT fired one of its founders and CEO, Sam Altman, sparkling downside pressure for AI-based tokens, such as FET. Related Reading: Altcoin Corrections Signal Strong Buy Opportunities: Crypto Analyst The native token for Fetch.ai, FET, has been trending to the upside following the general market sentiment. Over the past month, the cryptocurrency recorded a 160% rally, and it’s poised for further profits as it breaches critical resistance levels. OpenAI Controversy Adds Fuel For FET’s Rally Data from Coingecko indicates that FET’s bullish momentum took a hit last week as news about Sam Altman leaving OpenAI broke. The token has been moving with any development from the broader AI sector, and the uncertainty surrounding this company has impacted its performance on low timeframes. Over the weekend, FET regained its bullish momentum and reclaimed territory, extending a more significant rally. In that sense, a pseudonym trader looked into FET’s potential target as the cryptocurrency continues “its rally without a dip.” In the past week, FET breached the resistance at $0.56, targeting its 2022 highs, as seen in the chart below. If the bullish momentum continues, the token could rise to its 2021 highs between $0.70 and $0.90. FET Rally Could End In Massive Correction Our Editorial Director and analyst, Tony Spilotro, has been bullish on FET’s trajectory. The analyst believes FET could rise 2x to 4x before losing steam and re-visiting support. In the past, whenever the token followed a similar trajectory, printing a buy signal above the monthly Bollinger Band, as Spilotro stated, FET corrected by an impressive 80%. Thus, the analyst recommended new investors to tread carefully. Spilotro said: (…) its safe more than likely to buy FET at such levels, so long as you have a plan to get out before the next 70+% correction happens. Otherwise, price could retrace back to your entry here. Be smart and don&#8217;t expect the rally to go on forever. Related Reading: Argentina Welcomes First Pro-Bitcoin President, BTC Price Surges Above $37,000 Today, Microsoft announced the hiring of Sam Altman to spearhead a new AI division. The company will commit to providing resources for the new division, which could ignite a new bull era for AI and AI-based tokens. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-20T19:05:54.000Z",
    "title": "$100,000,000,000 in TradFi Money Waiting for Bitcoin ETF Approval, Says Bloomberg Intelligence Analysts",
    "url": "https://dailyhodl.com/2023/11/20/100000000000-in-tradfi-money-waiting-for-bitcoin-etf-approval-says-bloomberg-intelligence-analysts/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/regulator-rejects-bitcoin-etfs.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The market for a spot Bitcoin (BTC) exchange-traded fund (ETF) could quickly turn into a &#8220;$100 billion juggernaut,&#8221; according to new estimates from Bloomberg Intelligence. Investment giant Galaxy Digital reportedly held a call earlier this month with roughly 300 investment professionals regarding allocating capital to BTC ahead of the expected ETF debut. Jeff Janson of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/100000000000-in-tradfi-money-waiting-for-bitcoin-etf-approval-says-bloomberg-intelligence-analysts/\">$100,000,000,000 in TradFi Money Waiting for Bitcoin ETF Approval, Says Bloomberg Intelligence Analysts</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]