[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T14:45:13.000Z",
    "title": "FTX Users Potentially Targeted in Possible Phishing Attack as Bankruptcy Claims Deadline Nears",
    "url": "https://www.coindesk.com/business/2023/07/20/ftx-users-potentially-targeted-in-possible-phishing-attack-as-bankruptcy-claims-deadline-nears/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Multiple FTX users have received a \"reset password\" request from the defunct exchange's official email address as it appears a hacker is attempting to secure control of user's bankruptcy claims."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T14:50:44.000Z",
    "title": "Terraform Labs requests to subpoena docs from bankrupt FTX in SEC case defense",
    "url": "https://cryptoslate.com/terraform-labs-requests-to-subpoena-docs-from-bankrupt-ftx-in-sec-case-defense/",
    "description": "<p>Terraform Labs (TFL), the developer of the failed Terra blockchain, wants to subpoena bankrupt FTX for relevant documents it could use to defend its case against the U.S. Securities and Exchange Commission (SEC), according to a July 19 court filing. In February, the SEC sued the blockchain developer and its former CEO, Do Kwon, alleging [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/terraform-labs-requests-to-subpoena-docs-from-bankrupt-ftx-in-sec-case-defense/\">Terraform Labs requests to subpoena docs from bankrupt FTX in SEC case defense</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-20T14:48:38.000Z",
    "title": "Neopets Abandons NFT Game Plans After Raising $4M",
    "url": "https://cryptobriefing.com/neopets-abandons-nft-game-plans-after-raising-4m/?utm_source=feed&utm_medium=rss",
    "description": "Neopets  the beloved and longstanding virtual pet franchise  has called off its metaverse and NFT gaming venture after securing over $4 million in funding from Avalanche and Polygon..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T14:58:43.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T14:58:07.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T14:43:50.000Z",
    "title": "China’s digital yuan hits $250 billion in transactions",
    "url": "https://crypto.news/chinas-digital-yuan-hits-250-billion-in-transactions/",
    "description": "China's central bank governor Yi Gang has announced transactions worth almost $250 billion have occurred with the country's digital yuan since the start of its pilot 18 months ago."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T15:00:12.000Z",
    "title": "Terraform Labs Appoints New CEO Following Do Kwon’s Sentencing In Montenegro",
    "url": "https://www.newsbtc.com/terra-luna/terraform-labs-appoints-new-ceo/",
    "description": "Terraform Labs has announced the appointment of Chris Amani as the interim Chief Executive Officer (CEO), replacing co-founder Do Kwon.  Terraform Labs Elevates Former COO Chris Amani as Director and Interim CEO Chris Amani, an experienced leader with over two decades of experience in the technology industry, has been selected as the interim CEO for Terraform Labs. Having served as the Chief Operating Officer (COO) and Chief Financial Officer (CFO) since joining the company in 2021, Amani brings valuable insights and expertise to this new role.  Related Reading: Binance Burns $480 Million In BNB, Will Price Recover? Previously, Amani held leadership positions at prominent technology companies such as MongoDB, Electronic Arts, and Zynga. His deep understanding of TFL&#8217;s operations and strategy positions him to steer the company through its current challenges and drive its mission forward. This decision comes as Kwon faces potential extradition to South Korea or the United States from Montenegro, where he is currently serving a prison sentence. Navigating Through Troubled Waters: Terra&#8217;s Comeback Plan Terra, known for its TerraUSD and Luna cryptocurrencies, faced a significant setback in May 2022 when the collapse of its stablecoin caused a ripple effect across the crypto market.  Co-founder Do Kwon&#8217;s legal troubles further exacerbated the situation, with charges of misleading investors and alleged involvement in illicit transactions during the collapse. Amidst these challenges, Chris Amani expressed his commitment to reviving the Terra blockchain and focusing on developing applications that provide real utility.  LUNA price sitting at $0.65 &#124; Source: LUNAUSDT on Tradingview.com TFL&#8217;s comeback plan involves executing a clear vision for Terra&#8217;s role within the broader Web3 ecosystem, which Amani and the team are dedicated to implementing. The new CEO emphasized the importance of community collaboration and shared goals during this rebuilding phase. With approximately 40 employees, the company will continue to operate without Do Kwon&#8217;s leadership, as he focuses on addressing his legal affairs. The team is optimistic about its ability to salvage the situation and is actively working on plans to propel the company forward. Nevertheless, the legal issues surrounding Do Kwon&#8217;s involvement in the collapse have been a significant point of concern.  Related Reading: Ethereum Monthly Burn Surpasses 146,000 ETH As Total Clears $6.5 Billion Terra&#8217;s recovery plan is not without its complexities, but the team is determined to restore value to the Terra Classic ecosystem. Amain, in his statement, said,  &#8220;The process won&#8217;t be easy, but we have a clear vision of where Terra fits within the broader Web3 ecosystem and are hyper-focused on executing against that vision. We look forward to sharing more on this soon&#8221;  The plan involves reducing node syncing times, creating a TerraUSD testnet, developing yield-generating applications, and implementing a reward system for developers. Featured image from Binance Academy, chart from Tradingview.com"
  }
]