[
  {
    "source": "CoinDesk",
    "date": "2023-09-20T19:52:45.000Z",
    "title": "U.S. CBDC Efforts Opposed in Legislation Advanced by House Republicans",
    "url": "https://www.coindesk.com/policy/2023/09/20/us-cbdc-efforts-opposed-in-legislation-advanced-by-house-republicans/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A crypto-related bill meant to stifle a future U.S. central bank digital currency is now heading toward consideration on the floor of the U.S. House of Representatives after committee approval Wednesday, marking further progress for digital assets legislation in Congress."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-20T19:57:50.000Z",
    "title": "Amazon to Tap Its Own AI Model to Upgrade Alexa for Smart Homes",
    "url": "https://decrypt.co/198029/amazon-alexa-artificial-intelligence-ai-llm-smart-home",
    "description": "Amazon annnounced ambitious plans to integrate generative AI across its product ecosystem."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-20T19:49:20.000Z",
    "title": "PayPal Brings PYUSD Stablecoin to Venmo",
    "url": "https://decrypt.co/198022/paypal-brings-pyusd-stablecoin-to-venmo",
    "description": "Select Venmo users can already buy the payment platform’s ERC-20 stablecoin."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T20:00:00.000Z",
    "title": "US Democrats speak up for CBDC global leadership, Republicans fear ‘dark side’",
    "url": "https://cointelegraph.com/news/dems-speak-up-global-leadership-us-cbdc-republicans-fear-dark-side",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1e4243cf-cf1f-45b1-84ff-a80bdb2bdcac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite approaching the issue from vastly different angles, the two sides were able to agree on a few basics before the committee recessed.</p>\n                    <p><p>Debate in the United States House Financial Services Committee during the markup of the CBDC Anti-Surveillance State Act on Sept. 20 occasionally wandered beyond strictly financial and technical issues. Star Wars and anarchists were mentioned in the discussion at various points, as were crypto bros.</p><p>Beneath the rhetoric, the value of research, U.S. citizens’ privacy and the role of government in everyday life were discussed as they relate to a U.S. central bank digital currency (CBDC). </p><p>Tom Emmer <a href=\"https://www.youtube.com/watch?v=ZuYfQE_PLZs\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> the bill after several other bills had been passed through the committee. He characterized his bill as “simple,\" saying, “It halts the efforts of the administrative state under President Biden from issuing a financial surveillance tool that will undermine the American way of life.”</p><blockquote>“If not designed to emulate cash, [it] could give the federal government the ability to surveil and restrict Americans’ transactions.”  </blockquote><p>Emmer mentioned the Chinese digital yuan and government social credit system and Canada’s freezing of bank accounts during the truckers’ protest of 2022 as he introduced the bill. The bill has the support of 50 senators and numerous organizations, according to Emmer.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d3b98065-38e7-4bc9-a00e-14be82e4daa0.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>The House Financial Services Committee's busy Sept. 20 s</em><em>chedule</em><em>. Source: House Financial Services Committee</em></figcaption></figure><p>Ranking member Maxine Waters renamed the bill The CBDC Anti-Innovation Act. She said it would threaten the status of the dollar as the principal global reserve currency, adding:</p><blockquote>“We don’t know at this point how the introduction of CBDCs could shape the global financial landscape. […] Republicans are making baseless attacks against a CBDC that does not even exist.”</blockquote><p>Later she said the bill would “give China the reins to set the global standard for central bank digital currencies.”</p><p>Stephen Lynch pointed out some inconsistent language in the bill, and there were questions about what research on CBDC would be allowed under the bill, which was taken up repeatedly during the debate. </p><p>Brad Sherman compared cryptocurrency unfavorably to CBDCs. “Keep in mind, this is a pilot program. Keep in mind, no one has to have any digital currency,” he said.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/tom-emmer-crypto-sleeper-issue-2024-elections\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/tom-emmer-crypto-sleeper-issue-2024-elections/amp\">Rep. Tom Emmer: Digital assets will be a ‘sleeper issue’ for 2024 elections</a></em></strong></p><p>Mike Flood was among those who did not want to trust the government with the power a CBDC could give it. He suggested the government committee members:</p><blockquote>“Picture a politician they dislike the most. […] Now imagine that person, and all the ill intentions you ascribe to them, with the power that comes with a retail CBDC.”</blockquote><p>The legislators eventually agreed that the bill prevents the issuance of a CBDC without an act of Congress, which has been insisted on by the Federal Reserve from the beginning. The general lack of financial privacy in the country was also noted by both sides.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Financial Services Committee is set to vote on my bill, the CBDC Anti-Surveillance State Act, today. Watch my remarks from the debate: <a href=\"https://t.co/C4S3okdl0w\">pic.twitter.com/C4S3okdl0w</a></p>— Tom Emmer (@GOPMajorityWhip) <a href=\"https://twitter.com/GOPMajorityWhip/status/1704553373901394141?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Waters and Lynch introduced amendments to clarify the bill’s reach over research to authorize the Fed to study the Chinese digital yuan, which could facilitate efforts to evade U.S. sanctions. Waters <a href=\"https://cointelegraph.com/news/bis-releases-full-report-on-mbridge-wholesale-cbdc-platform-after-successful-pilot\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bis-releases-full-report-on-mbridge-wholesale-cbdc-platform-after-successful-pilot/amp\">made reference to the mBridge</a> pilot between China, Hong Kong, Thailand and the United Arab Emirates.</p><p>The committee went into recess at 1:30 p.m., local time, after four hours.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T19:45:51.000Z",
    "title": "The #1 CopyTrading Exchange-Bitget Turns 5, $100 Bonus for Newcomers",
    "url": "https://cryptoslate.com/the-1-copytrading-exchange-bitget-turns-5-100-bonus-for-newcomers/",
    "description": "<p>Who Are Bitget?: Five years ago, a visionary group of traditional finance experts and innovators embarked on a journey to reshape the digital landscape. Inspired by Nakamoto Satoshi’s vision of a more equitable financial system, Bitget emerged as a beacon of innovation. Born during the bear market of 2018, Bitget has always been driven by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/the-1-copytrading-exchange-bitget-turns-5-100-bonus-for-newcomers/\">The #1 CopyTrading Exchange-Bitget Turns 5, $100 Bonus for Newcomers</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T20:01:18.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T20:00:23.000Z",
    "title": "Is Bitcoin Bull Run Coming Soon? What Network Fundamentals Say",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bull-run-soon-network-fundamentals/",
    "description": "Here&#8217;s what the Bitcoin network fundamentals have to say regarding whether the cryptocurrency could see a bull run soon or not. Monthly Average Bitcoin New Addresses Have Shot Up Recently In a new post on X, analyst Ali discussed the possibility of a bull run starting soon for the cryptocurrency. According to the analyst, &#8220;a bull run is often characterized by increased on-chain activity.&#8221; To measure the activity, Ali has used the &#8220;new addresses&#8221; metric, which keeps track of the total number of new addresses coming online on the Bitcoin blockchain every day. When the value of this metric is high, it means that many users have joined the network during the past day. This could suggest that the cryptocurrency is observing high adoption right now. On the other hand, low values imply not many newcomers are currently attracted to the blockchain, potentially a sign of a lack of interest in the market around the coin. Related Reading: Here’s Where Next Bitcoin Resistance Lies, From An On-Chain Perspective Now, here is a chart that shows the trend in the Bitcoin new addresses, as well as the 30-day and 365-day simple moving averages (SMAs) of the indicator over the past few years: The data for the daily new addresses on the network since January 2018 &#124; Source: @ali_charts on X The increased activity, which may be associated with a bull run, can be &#8220;spotted when the monthly average of new wallets (red) surpasses the yearly average (blue), which indicates strengthened network fundamentals and increased use,&#8221; as explained by the analyst. The graph shows that the 30-day SMA of the Bitcoin new addresses had been under the 365-day SMA during the bear market, but with the rally this year, the former had managed to break above the latter. The reverse cross had happened during the slowdown in May-June, but as the subsequent rebound in the price had occurred, the monthly average new addresses had broken back above the yearly average, and it has since stayed there. Recently, despite the struggle in the price, the 30-day SMA of the metric has only continued to rise sharply. This could naturally be a constructive sign for the asset, and going by historical precedence, it may even mean a return toward bullish momentum. The lead on-chain analyst at Glassnode, @_Checkmatey_, however, has replied to Ali&#8217;s post, saying, &#8220;with the advent of ordinals, it is always a great idea to pair &#8216;addresses,&#8217; and &#8216;transactions&#8217; metrics with &#8216;volume&#8217; metrics.&#8221; &#8220;Ordinals&#8221; here refer to inscribing data directly into the Bitcoin blockchain. They are utilized in various applications, including making non-fungible tokens (NFTs) on the network. Related Reading: Bitcoin May Not See Lasting Bullish Momentum Until This Happens Such chain applications can skew the address-related metrics, as new ones may be created solely for using the blockchain in this way and not for actually trading the coin itself. The Glassnode lead explains that they assign a slightly higher weight towards the volume metrics because the Ordinals-related transactions don&#8217;t involve much volume. The exchange volume over the last few years &#124; Source: @_Checkmatey_ on X Unlike the new addresses metric, the bullish pattern isn&#8217;t yet forming for the exchange volume (which includes both inflows and outflows). This would suggest that the activity on the network may not be at a bull run stage right now. BTC Price At the time of writing, Bitcoin is trading at around $27,000, up 3% over the past week. BTC has stagnated around the $27,000 mark &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T19:53:36.000Z",
    "title": "Fed Holds Interest Rates Steady, Bitcoin Awaits Trend Reversal Above $27,000",
    "url": "https://www.newsbtc.com/breaking-news-ticker/fed-holds-interest-rates-steady-bitcoin-awaits-trend-reversal-above-27000/",
    "description": "In a highly anticipated announcement for the overall cryptocurrency market and Bitcoin (BTC), the Federal Reserve (Fed) opted to maintain interest rates at their current level, ranging between 5.25% and 5.5%.  The decision aligns with market expectations and signals a continuation of the Fed&#8217;s existing policy stance. While the interest rate decision had no immediate impact on Bitcoin&#8217;s price, cryptocurrency analysts anticipate a potential shift in market dynamics. Analysts Predict Bitcoin Reversal Following Fed&#8217;s Decision Bitcoin, the leading cryptocurrency in terms of market capitalization, has experienced a period of consolidation around the crucial $27,000 support level for the past two days.  Despite the absence of significant price fluctuations immediately following the recent interest rate decision, market experts believe this stability could potentially signify the beginning of a trend reversal. Related Reading: Grayscale Takes New Approach As It Files For Another Ethereum Futures ETF Renowned cryptocurrency analyst Michael Van De Poppe shared his perspective on X (formerly Twitter), suggesting that the era of interest rate hikes may have reached its conclusion.  Van De Poppe went on to indicate that Bitcoin is likely to embark on an upward trajectory from this juncture, noting the importance of exercising caution when interpreting price movements following major news events. Van De Poppe&#8217;s remarks mirror the sentiment among BTC enthusiasts who anticipate the Federal Reserve&#8217;s decision to act as a catalyst for the cryptocurrency&#8217;s resurgence.  The prevailing hope is that this decision could mark the end of the current market downtrend, paving the way for Bitcoin to reach new yearly highs before the conclusion of 2023. BTC’s Historical Patterns Suggest Potential Bottom Formation Crypto Con, a renowned crypto analyst provided insights into Bitcoin&#8217;s price movements, focusing on its historical patterns and the MVRV (Market Value to Realized Value) deviation bands.  Crypto Con’s analysis highlights the significance of BTC’s recent visit just below the green band, as seen in the chart above, drawing parallels to previous market cycles. Drawing on historical data, Crypto Con notes that Bitcoin spent approximately 10 months hovering around the bottom purple and blue deviation bands before making its second visit just below the green band.  In 2016, this particular pattern marked a local bottom, and in 2019, it would have done the same if not for unforeseen circumstances such as the black swan event. Related Reading: Chainlink: Analyst’s Vision Of A 20% Rally And How It Could Happen Comparing the duration spent at the bottom during the current cycle to that of 2015, Crypto Con highlights a striking similarity. This observation raises the question of whether the significant downside experienced in 2019 was a consequence of the massive price surge that preceded it, with Bitcoin even reaching the cycle top band. The current value of the red band stands at $54,000, according to Crypto Con’s analysis. However, he assures that this value is subject to change as the market progresses toward “the endgame”.  At present, Bitcoin is trading at $27,100, indicating no change in the 24-hour timeframe. As a result, the impact of the Federal Reserve&#8217;s decision on the cryptocurrency and the broader market in the short term remains uncertain. Whether this news will have a positive effect shortly or prove beneficial for the remainder of the year is yet to be determined. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T19:58:00.000Z",
    "title": "Crypto Influencer Projects $100,000 For BTC Amid Bitcoin ETF Frenzy",
    "url": "https://coinedition.com/crypto-influencer-projects-100000-for-btc-amid-bitcoin-etf-frenzy/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"First Bitcoin ETF in Europe Receives an ESG Label, Sparking Debate\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto Rover, an influencer popular among the crypto community online, believes that Bitcoin has the potential to reach as high as $100,000 over time. The crypto influencer’s bullish sentiment was based on the potential impact of the ongoing spot Bitcoin exchange-traded fund (ETF) frenzy, which has caught the attention of major traditional finance players. Crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-influencer-projects-100000-for-btc-amid-bitcoin-etf-frenzy/\">Crypto Influencer Projects $100,000 For BTC Amid Bitcoin ETF Frenzy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-20T20:00:01.000Z",
    "title": "Crypto Analyst Details Bitcoin Downside Targets, Foresees a Bull Market Once BTC Clears This Level",
    "url": "https://dailyhodl.com/2023/09/20/crypto-analyst-details-bitcoin-downside-targets-foresees-a-bull-market-once-btc-clears-this-level/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/details-targets-for-full.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is weighing in on potential downside moves for Bitcoin (BTC) after the king crypto crosses $27,000. Pseudonymous analyst Credible Crypto tells his 345,900 followers on the social media platform X that Bitcoin could dip to around $24,900 and still remain on track for a bull market cycle. “I have marked [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/crypto-analyst-details-bitcoin-downside-targets-foresees-a-bull-market-once-btc-clears-this-level/\">Crypto Analyst Details Bitcoin Downside Targets, Foresees a Bull Market Once BTC Clears This Level</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-20T19:55:50.000Z",
    "title": "Bloomberg Analyst Reveals Under-the-Radar Bitcoin Achievement That Few Industries Can Claim",
    "url": "https://dailyhodl.com/2023/09/20/bloomberg-analyst-reveals-under-the-radar-bitcoin-achievement-that-few-industries-can-claim/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/Into-Bitcoin-and-Two.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence’s crypto market analyst Jamie Coutts says that Bitcoin (BTC) is pulling off one major achievement that is flying under the radar. Coutts says on the social media platform X that at the same rate that Bitcoin adoption is increasing, its network’s carbon emissions are declining, a rare phenomenon. “And this is where the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/bloomberg-analyst-reveals-under-the-radar-bitcoin-achievement-that-few-industries-can-claim/\">Bloomberg Analyst Reveals Under-the-Radar Bitcoin Achievement That Few Industries Can Claim</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]