[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T13:22:08.000Z",
    "title": "Israel Consults Public on DAO Regulation, Sets Up Special Examination Team",
    "url": "https://www.coindesk.com/policy/2023/07/27/israel-consults-public-on-dao-regulation-sets-up-special-examination-team/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The team will examine required corporate status, taxation other aspects of DAOs to \"create legal certainty\" and reduce risks, the government has said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-27T13:12:40.000Z",
    "title": "First Mover Americas: BTC and ETH CME Futures See Record Participation From Big Traders",
    "url": "https://www.coindesk.com/markets/2023/07/27/first-mover-americas-btc-and-eth-cme-futures-see-record-participation-from-big-traders/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 27, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T13:26:00.000Z",
    "title": "Journeys: Hervé Larren on Bitcoin, Apes and the psychology of ‘blue-chip’ NFTs",
    "url": "https://cointelegraph.com/magazine/journeys-herve-larren-on-bitcoin-apes-and-the-psychology-of-blue-chip-nfts/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/magazine-Journeys-Herve-Larren-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hervé Larren’s crypto journey has taken him from luxury goods to Bitcoin mining and back full circle to the world of “blue-chip” NFTs.</p>\n                    <p><p><strong>During a period of hyperinflation in 2013, my Venezuelan mother asked me to send money to Caracas, the countrys capital, Herv</strong> <strong>Larren recalls. However, bank transfers were not possible between the two countries. </strong></p><p>Busy with work in New York, he told a friend that he planned to fly to Caracas  carrying cash for his mother  and return the same day. Why dont you just send Bitcoin? his friend asked, which quickly led to a change of plans as Larren made his first Bitcoin transfer.</p><blockquote class=\"wp-block-quote\"><p>My first crypto transaction, in 2013, was to wire Bitcoin from the U.S. to Venezuela. Due to the economic collapse, there was no functioning banking system between these two countries.</p></blockquote><p>Switching from a career with luxury goods company LVMH Mot Hennessy Louis Vuitton, Larren co-founded a large-scale crypto mining operation and worked with Grayscale to bring crypto assets to old-school investors. He later became a key adviser to ApeCoin and the first person to bid a million dollars for a nonfungible token.</p><h2 id=\"h-from-old-to-new\"><strong>From old to new</strong></h2><p>We were reporting to Nicolas Sarkozy, and he was coming to our meetings, Larren recalls of his time as the head of a high school student council in Neuilly-sur-Seine, the wealthiest old-money suburb of Paris, where he grew up. </p><p>Sarkozy served as the local mayor for 20 years before becoming the president of France. Larrens mother  from Venezuela  was a TV host and the first Latina model signed by the LOreal cosmetics brand. His French father imported wine to Canada,  where a third of the population is French-speaking.</p><p>In the late 90s, Larren began undergraduate business studies at Montreals Concordia University. In 2019, Concordia <a href=\"https://www.concordia.ca/cunews/offices/vpaer/aar/2019/50-under-50/the-blockchain-maven.html\" target=\"_blank\" rel=\"nofollow\" >labeled</a> him The Blockchain Maven as part of a 50 Under 50 alumni distinction. Upon graduation, he got a job at Mot Hennessys New York office, where he worked on brand development of the firms Hennessy cognac brand in the United States.</p><p>Larren worked on his MBA at Columbia University part time while at LVMH, graduating in 2010 and entering the venture capital world with Peak Ventures, which was involved in tech companies including Twitter. It was Larrens first experience in the technology sector, which he describes as very different from the old-world, intergenerational luxury goods industry.</p><p>Larren quickly moved to accept Bitcoin at an e-commerce business he was involved with, a company that helped charities raise money by partnering with celebrities. In 2015, he formed crypto mining firm Global Crypto Ventures, which grew into an operation of nearly 3,000 machines composed primarily of Bitmain Antminer S9 miners in Las Vegas and Texas, where the cost of infrastructure and electricity was cheaper. </p><figure class=\"wp-block-image alignright size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image3-780x1024.jpg\" alt=\"\" class=\"wp-image-22445\" width=\"349\" height=\"458\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image3-780x1024.jpg 780w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image3-229x300.jpg 229w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image3-770x1011.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image3-1170x1536.jpg 1170w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image3.jpg 1523w\" sizes=\"(max-width: 349px) 100vw, 349px\" /><figcaption class=\"wp-element-caption\"><em>Larren at his mining facility. (Herv Larren)</em></figcaption></figure><h2 id=\"h-grayscale-digital-large-cap-fund\"><strong>Grayscale Digital Large Cap Fund </strong></h2><p>While speaking at the 2017 World Technology Forum in New York, Larren met Digital Currency Group CEO Barry Silbert, who was talking right after him about the Grayscale Bitcoin Trust, through which retail investors could get exposure to Bitcoin through their brokerage. He was also working on a new investment vehicle called Grayscale Digital Large Cap Fund (GDLC), which represented a weighted portfolio of cryptocurrencies, including Ether, MATIC, ADA and SOL, in addition to Bitcoin. </p><p>As a publicly traded investment instrument, it would require approval by the Securities and Exchange Commission. One relevant matter would be to ensure that the fund could buy its digital assets from a trusted source, preferably from within the United States. Larrens mining firm was an ideal source, and having a ready buyer for mining proceeds made business smoother.</p><p>This opportunity represented Larrens first foray into crypto beyond Bitcoin, and it attracted me to a new space.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p>Working with the SEC was no easy task, Larren recalls. It was a nerve-racking process. Though the company was very confident about getting approval, there was a lot of uncertainty because no such investment trust had been approved previously.</p><p>However, the GDLC was approved, expanding the potential pool of crypto investors. Though many in the industry continue to preach the not your keys, not your coins mantra, Larren argues that just as with stocks, owning Bitcoin and other crypto assets through a financial instrument instead of on an exchange or cold-storage device is preferable for most of the public.</p><p>There is less risk of being hacked or losing access to keys, and regulated funds must meet stringent security policies and often carry insurance. He also notes that they are easier to manage on a portfolio basis, particularly regarding taxation and being more straightforward for accountants to understand.</p><h2 id=\"h-will-blackrock-s-bitcoin-etf-be-approved\"><strong>Will BlackRocks Bitcoin ETF be approved?</strong></h2><p>These advantages make it easy to see why heavyweights of the financial industry see an opportunity in offering Bitcoin investment vehicles accessible to retail investors. One of these is BlackRock, which <a href=\"https://cointelegraph.com/news/blackrock-larry-fink-crypto-will-transcend-international-currencies\" target=\"_blank\" rel=\"nofollow\" >recently applied to launch</a> a Bitcoin spot exchange-traded fund in the United States.</p><p>BlackRock offers the credibility to convince the SEC that the Bitcoin market can be operated safely and has much to offer investors, Larren says optimistically. He expects that with <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\" target=\"_blank\" rel=\"nofollow\" >BlackRocks track record</a> of 575 approved ETFs versus one denial, it will soon come online, with <a href=\"https://cointelegraph.com/news/monochrome-filing-spot-bitcoin-etf-asx-australia\" target=\"_blank\" rel=\"nofollow\" >similar products expected</a> in other markets.</p><blockquote class=\"wp-block-quote\"><p>I think it would lead to an automatic rise in Bitcoins price. I think many people are on the sidelines waiting for clarity, and thats a step in Bitcoins institutional adoption.</p></blockquote><p>For a very long time, Grayscale had a premium on its shares compared with the price of Bitcoin, Larren notes, explaining that the security, certainty and convenience meant that more conservative investors were historically willing to pay more per BTC. BlackRocks ETF is unlikely to hold a large premium, which would serve to make the market more efficient.</p><h2 id=\"h-all-roads-in-decentraland-lead-to-beeple\"><strong>All roads in Decentraland lead to Beeple</strong></h2><p>Larren first heard about the metaverse through Decentralands initial coin offering in August 2017. They were selling 90,000 pieces of NFT land in the metaverse, he recalls, adding that he felt a proximity to the projects Argentine founders due to South Americas shared currency issues. My first NFT purchase was actually buying my name in the metaverse, he says, recalling how he spent 100 MANA to name his avatar.<br></p><p>He was also given a piece of land on which to build the Airvey art gallery, where Larren placed various NFTs for sale. When Christies announced it would auction Beeples Everydays piece in its first-ever NFT auction in March 2021  <a href=\"https://cointelegraph.com/magazine/nft-artist-beeples-mammoth-5040-day-artwork/\" target=\"_blank\" rel=\"nofollow\" >a story previously covered by Magazine</a>  the auction house contacted the Airvey gallery to invite bids.</p><blockquote class=\"wp-block-quote\"><p>I wanted to be the first person in the world who bid seven figures on an NFT.</p></blockquote><p>Well that escalated quickly was Beeples only comment when Larrens bid for $1 million came through, representing the first volley in a bidding battle that would see an anonymous buyer later revealed as Vignesh Sundaresan, also known as Metakovan, beat Tron founder Justin Sun with a record-setting bid of $69 million.</p><figure class=\"wp-block-image alignright size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image1-637x1024.jpg\" alt=\"\" class=\"wp-image-22447\" width=\"303\" height=\"488\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image1-637x1024.jpg 637w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image1-187x300.jpg 187w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image1-770x1237.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image1-956x1536.jpg 956w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image1.jpg 1170w\" sizes=\"(max-width: 303px) 100vw, 303px\" /><figcaption class=\"wp-element-caption\"><em>Beeple posted his reaction to the $1 million bid on Instagram.</em></figcaption></figure><h2 id=\"h-bored-apes-design-apecoin\"><strong>Bored Apes design ApeCoin</strong></h2><p>With a newfound passion for NFTs, Larren joined Horizen Labs in 2021, months before the firm began discussions with Yuga Labs, a small company where four founders were working on an NFT project involving monkeys.</p><p>Yuga contracted Horizen Labs to create ApeCoin, a large allocation of which was distributed to holders of Yugas NFT collections  including Bored Ape Yacht Club, Mutant Ape Yacht Club and Bored Ape Kennel Club  via massive airdrop. </p><p>We did everything from the white paper, tokenomics, to listing on exchanges. In less than 20 minutes, it became an $8 billion project, Larren says, referring to the tokens undiluted market cap, now about $2 billion. In addition to the launch, Larren notes that Horizen Labs designed the tokens staking mechanism, which will see 100 million tokens distributed to the community over three years.</p><p>As Gucci and TAG Heuer <a href=\"https://cointelegraph.com/news/swiss-luxury-watchmaker-tag-heuer-introduces-nft-enabled-smartwatch\" target=\"_blank\" rel=\"nofollow\" >began accepting ApeCoin</a> as a form of payment, Larrens luxury contacts came calling back.</p><p>I spent a week with Chanels team at a castle in the English countryside, educating them on all aspects of Web3, including MetaMask and NFT drops. Larren observes that as he moved from the most successful physical goods company, LVMH, to the most successful digital goods company, Yuga Labs, the thought process was the same.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/defi-security-audits-bug-bounties-broken-heres-how-fix/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Crypto audits and bug bounties are broken: Heres how to fix them</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Unstablecoins: Depegging, bank runs and other risks loom</p>                        </a>                    </div></div></div><p>He describes metaverse real estate and PFPs, which include Yugas famous monkey pictures, as fitting into a broad category of consumer NFTs that are purchased by individuals in a way not dissimilar to luxury goods. Indeed, he notes that many of LVMH founder Bernard Arnaults children  heirs of the worlds second-richest man  are actively <a href=\"https://www.highsnobiety.com/p/tag-heuer-tiffany-co-nft-lvmh-arnault/\" target=\"_blank\" rel=\"nofollow\" >dabbling</a> in them.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image6-1024x768.jpg\" alt=\"\" class=\"wp-image-22449\" width=\"629\" height=\"472\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image6-1024x768.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image6-300x225.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image6-770x578.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image6-1536x1153.jpg 1536w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image6.jpg 1999w\" sizes=\"(max-width: 629px) 100vw, 629px\" /><figcaption class=\"wp-element-caption\"><em>Larren overlooking the Horizen Labs office floor in Milan. (Elias Ahonen</em>)</figcaption></figure><p>People want to feel that they are part of an exclusive community with like-minded individuals, he explains, relating the concept sold in luxury boutiques and exclusive events the world over. In the case of Yugas NFTs, he argues that there is value for many people in being members of a group that shares similar cultural references, whether it being digital or at concerts, referring to events like ApeFest, the next of which will take place in Hong Kong in November.</p><h2 id=\"h-can-an-ape-jpg-really-be-a-blue-chip-nft\"><strong>Can an ape JPG really be a blue-chip NFT?</strong></h2><p>NFTs that gain mass appeal as recognizable status symbols are often labeled as blue chip among the NFT community, a nod to a term typically referring to reliable stocks and originally derived from poker, where blue chips are traditionally the most valuable. </p><p>Its a brand-building element as recognition of industry and buyers. Supply is far less than demand, and there is a strong fan and collector base. In traditional art, Picasso and Jean-Michel Basquiat are blue chips, he explains, noting that Bored Apes and CryptoPunks hold such a position within the PFP hierarchy.</p><blockquote class=\"wp-block-quote\"><p>The price is a result of the value that has been created. When you go to a Louis Vuitton store, the price is nowhere to be seen.</p></blockquote><p>Holding a BAYC can make sense because you can stake it to earn tokens, and it can act as a financial instrument because you can borrow against it, he notes, naturally enough, considering his company designed the staking mechanism. </p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image5-1024x461.jpg\" alt=\"\" class=\"wp-image-22451\" width=\"646\" height=\"291\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image5-1024x461.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image5-300x135.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image5-770x347.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/07/image5.jpg 1280w\" sizes=\"(max-width: 646px) 100vw, 646px\" /><figcaption class=\"wp-element-caption\"><em>Larren poses in Milan with images of NFTs, including a Bored Ape and an Otherside land plot. (Elias Ahonen</em>)</figcaption></figure><p>There are blue chips in other categories as well, such as metaverse land, he adds, cautioning that its value, like traditional real estate, will depend on the income generated with it. </p><p>This is because, in his opinion, people will not remain interested in vast spaces of empty metaverse land but rather in spaces that are built up and useful, like his art gallery. Traditional real estate involves buildings  the same will be true of metaverse land.</p><p>Where might we look for the next crop of blue chips?</p><p>Im now passionate about building on top of Bitcoin with BRC-20s and Ordinals, Larren explains, hinting that something big is in the works. For him, the coming metaverse is a place and time when your digital life is more important than your physical life and where digital image matters more than physical image. In this new environment, he believes that the Bitcoin chain, with its newfound <a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\" target=\"_blank\" rel=\"nofollow\" >capability to host NFTs</a>, will hold a key position as a central pillar.</p><blockquote class=\"wp-block-quote\"><p>In Web3, you need to anticipate how consumer taste will evolve and what the market will want in the next six months.</p></blockquote><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-27T13:23:53.000Z",
    "title": "Coinbase CEO Says Vote ‘Yes’ for Crypto Regulatory Bills: FIT2, Blockchain Certainty Act",
    "url": "https://cryptobriefing.com/coinbase-ceo-says-vote-yes/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase&#8217;s chief, Brian Armstrong, is using his platform to encourage American citizens to endorse the proposed crypto regulatory bills &#8211; the Financial Innovation and Technology for the 21 Century Act..."
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-07-27T13:26:00.000Z",
    "title": "Journeys: Hervé Larren on Bitcoin, Apes and the psychology of ‘blue-chip’ NFTs",
    "url": "https://cointelegraph.com/magazine/journeys-herve-larren-on-bitcoin-apes-and-the-psychology-of-blue-chip-nfts/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/07/magazine-Journeys-Herve-Larren-scaled.jpg\"></p><p>Hervé Larren’s crypto journey has taken him from luxury goods to Bitcoin mining and back full circle to the world of “blue-chip” NFTs.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T13:13:58.000Z",
    "title": "Swisstronik Testnet Launches, Enabling Secure, Private & Compliant Blockchain Transactions",
    "url": "https://cryptodaily.co.uk/2023/07/swisstronik-testnet-launches-enabling-secure-private-compliant-blockchain-transactions",
    "description": "<p>Lucerne, Switzerland, July 27th, 2023, Chainwire</p><p>Swisstronik, the layer-1 network for building scalable, decentralized applications that ensure users&rsquo; privacy while remaining regulatory compliant, is delighted to announce the launch of its first testnet. Swisstronik Testnet 1.0 is available now, bringing immediate benefits to dApp developers including robust encryption and enterprise-grade transaction security through its utilization of Intel SGX technology.&nbsp;</p><p>The project is aiming to foster real-life adoption of blockchain through a robust, user-friendly and secure network that relies on hardware and software solutions to address challenges around legal compliance, data privacy, and interoperability. Swisstronik aims to become the preferred blockchain solution for dApp developers, individuals, enterprises and anyone else who cares about compliant and safe solutions while staying true to crypto&rsquo;s ethos of privacy and decentralization.&nbsp;</p><p>The launch of Swisstronik Testnet 1.0 comes at a time when interest in networks that can support secure, private transactions in a highly regulated environment is growing. Existing privacy solutions are too focused on anonymity, which is anathema to regulations. Amid the tightening regulations around crypto globally, increased regulatory action against cryptocurrency exchanges and early adoption of central bank digital coins (CBDCs), it&rsquo;s clear that the crypto industry urgently requires a compliant yet privacy-preserving, decentralized alternative. Once CBDCs launch, the industry will require a compliant and compatible bridge between them and the rest of the cryptocurrency ecosystem. This is the gap Swisstronik is aiming to fill with its identity-based blockchain platform powered by the first of its kind Web3 Compliance Suite - a self-regulating network of local personal data verifiers and compliance partners that allows seamless yet compliant cross-border operations..&nbsp;</p><p>Swisstronik&rsquo;s Compliance Suite is created to reduce any company's regulatory burden by doing compliance management in a more cost-effective and user-centered manner to ensure privacy and safety for every user. Moreover, because all interactions are executed inside fully encrypted Intel SGX enclaves, Swisstronik nodes cannot access the details of any transaction. The SGX enclaves can be likened to creating a protective wrapper around the EVM, ensuring all transaction information is hidden from the rest of the network. It means every transaction on Swisstronik&rsquo;s blockchain is fully isolated and safeguarded from prying eyes.&nbsp;</p><p>In a future update, Swisstronik will bolster its privacy and security features with the addition of zk-SNARKs &ndash; cryptographic proofs that allow one party to provably verify information without having to reveal it. Based on zero-knowledge proofs, zk-SNARKs will be especially useful for verifying KYC data and other personal information of users.&nbsp;</p><p>Swisstronik Testnet 1.0 is fully compatible with the Ethereum Virtual Machine (EVM) standard, meaning developers can seamlessly migrate Ethereum-based dApps and smart contracts to its ecosystem. Future versions of the Swisstronik Testnet will implement the Inter-Blockchain Communication (IBC) protocol, further enhancing the interoperability among Cosmos based-blockchains.&nbsp;</p><p>Swisstronik anticipates a great deal of interest among dApp developers looking to build compliant offerings and explore data security concepts such as Intel SGX and zk-SNARKs, having received more than 750+ applications for early access to its testnet, despite not making any active efforts to promote the network.&nbsp;</p><p>To ensure the integrity of its testnet and increase confidence within the community, Swisstronik is delighted to announce the launch of its first Bug Bounty campaign, with a $70,000 reward fund. The campaign will end on September 15, 2023, after which any bugs found will be fixed before the launch of Swisstronik Testnet 2.0 in the autumn.&nbsp;</p><p>About Swisstronik</p><p>Swisstronik is building a scalable layer-1 network to address challenges around legal compliance, data privacy, and interoperability in order to boost real-life adoption of the blockchain. Its goal is to become the go-to solution for developers building compliant, privacy-preserving dApps and cryptocurrency users who value data protection and transaction secrecy.&nbsp;</p><p>Swisstronik is the first platform that lets anyone build compliant yet private dApps with zero legal expertise. It does so with an unprecedented combination of two functionalities &ndash; a first of its kind Web3 Compliance Suite that gathers international regulators, KYC issuers and other legal service providers in a self-regulating network, and combination of programmable, hardware-based protection technology based on Intel SGX, and cryptographic techniques based on zero-knowledge proofs. As a result, Web3 companies can become KYC, AML and DPR compliant with minimum costs by launching on Swisstronik or integrating one of its utilities in their dApps on other chains. And users can be sure their data stays private &amp; secure even during identity checks.</p><p>Twitter - Linkedin - Telegram - Discord - Github</p>ContactMarketing DirectorAlexandra SerebrennikovaAlexandra.s@swisstronik.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T13:33:30.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $73.68, with a 24-hour trading volume of $84,774,240. Aave is up 4.82% in the last 24 hours. The current CoinMarketCap ranking is #42, with a live market cap of $1,067,598,619. It has a circulating supply of 14,489,513 AAVE coins and a ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T13:29:50.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T13:25:23.000Z",
    "title": "US financial committee votes in favor of key crypto bills",
    "url": "https://crypto.news/us-financial-committee-votes-in-favor-of-key-crypto-bills/",
    "description": "The US House Financial Services Committee passed two crypto regulatory bills, clarifying jurisdiction for crypto firms under US securities and commodities regulators."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T13:22:49.000Z",
    "title": "Utility Crypto Revolution: Uwerx (WERX) The Freelance Platform Sensation Outperforms Crypto Market Mainstays!",
    "url": "https://www.crypto-news-flash.com/utility-crypto-revolution-uwerx-werx-the-freelance-platform-sensation-outperforms-crypto-market-mainstays/?utm_source=rss&utm_medium=rss&utm_campaign=utility-crypto-revolution-uwerx-werx-the-freelance-platform-sensation-outperforms-crypto-market-mainstays",
    "description": "<img width=\"1200\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/cvcv.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/cvcv.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/cvcv-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/cvcv-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/cvcv-768x492.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />With its groundbreaking features and forward-thinking approach, Uwerx has become the go-to platform for freelancers and clients seeking a thriving and rewarding ecosystem. Join Uwerx,  and have a view into the its extraordinary world  and witness immediately how it outshines the competition in the ever-evolving crypto market. In a world where innovation and practicality reign, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T13:15:48.000Z",
    "title": "Swisstronik Testnet Launches, Enabling Secure, Private & Compliant Blockchain Transactions",
    "url": "https://www.crypto-news-flash.com/swisstronik-testnet-launches-enabling-secure-private-compliant-blockchain-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=swisstronik-testnet-launches-enabling-secure-private-compliant-blockchain-transactions",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Opt2_1200x720_1690462697aaRkoK6yfU.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Opt2_1200x720_1690462697aaRkoK6yfU.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Opt2_1200x720_1690462697aaRkoK6yfU-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Opt2_1200x720_1690462697aaRkoK6yfU-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Opt2_1200x720_1690462697aaRkoK6yfU-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Lucerne, Switzerland, July 27th, 2023, Chainwire Swisstronik, the layer-1 network for building scalable, decentralized applications that ensure users’ privacy while remaining regulatory compliant, is delighted to announce the launch of its first testnet. Swisstronik Testnet 1.0 is available now, bringing immediate benefits to dApp developers including robust encryption and enterprise-grade transaction security through its utilization [...]"
  }
]