[
  {
    "source": "NullTX",
    "date": "2024-02-17T06:54:31.000Z",
    "title": "Worldcoin (WLD) Surges Over 35% Amid Whale Accumulation",
    "url": "https://nulltx.com/worldcoin-wld-surges-over-35-amid-whale-accumulation/",
    "description": "Worldcoin (WLD), backed by Sam Altman, has experienced a significant surge in value, witnessing a remarkable increase of over 35% today.  The sudden uptick in price can be attributed to a recent whale accumulation, resulting in substantial profits for investors, according to insights from Spot On Chain, a prominent crypto [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T06:48:31.000Z",
    "title": "Phishing Scheme Targets Beam Network, Resulting In Loss Of 181 Million BEAM Tokens",
    "url": "https://nulltx.com/phishing-scheme-targets-beam-network-resulting-in-loss-of-181-million-beam-tokens/",
    "description": "A recent phishing scheme has rocked the Beam network, resulting in the loss of a significant amount of its native cryptocurrency, BEAM. According to a report from on-chain source Spotonchain, 181 million BEAM tokens, valued at $4.63 million, were lost on February 15th.  The target of the scheme was Kirill.eth, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T06:41:17.000Z",
    "title": "Blur ($BLUR) Sees Modest Growth Amidst Unlocking Of Tokens",
    "url": "https://nulltx.com/blur-blur-sees-modest-growth-amidst-unlocking-of-tokens/",
    "description": "Blur ($BLUR), a prominent participant in the non-fungible token (NFT) marketplace and aggregator platform, has experienced a slight uptick of over 10% in the past week, although its price has been subject to fluctuations. The platform offers advanced features such as real-time price feeds, portfolio management tools, and multi-marketplace NFT [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-17T06:45:39.000Z",
    "title": "Bitcoin Bull Run: On-Chain Data Points To Declining Retail Participation",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bull-run-on-chain-data-points-to-declining-retail-participation/",
    "description": "The price of Bitcoin has continued to soar this week, with the premier cryptocurrency consolidating its place above the $50,000 mark. Interestingly, on-chain data shows that a particular class of investors had less to do about the recent rally, sparking conversations about their participation in the current bull cycle. Recent BTC Price Primarily Fueled By &#8216;Institutional Demand&#8217; In a recent post on X, analyst Ali Martinez pointed out that there has been an apparent decline in the involvement of retail investors in the Bitcoin market. This shift comes despite the recent surge in the flagship cryptocurrency&#8217;s price. This revelation is based on the noticeable fall in the daily creation of new Bitcoin addresses. According to the crypto intelligence platform Glassnode, this metric tracks the number of unique addresses that appeared for the first time in a transaction of the native coin in the network. Chart showing the number of new addresses on the Bitcoin network &#124; Source: Ali_charts/X Related Reading: AVAX Rides The Crypto Avalanche To Success: Market Cap Skyrockets By 344% Typically, more individuals are inclined to enter the market as the value of Bitcoin increases, often resulting in a spike in new addresses to store and transact the coin. However, there is currently a deviation between the BTC price and the creation of new addresses. According to Martinez, this curious trend suggests a lack of retail participation in the ongoing Bitcoin bull run. The crypto analyst, however, tied the flagship cryptocurrency&#8217;s recent positive performance to institutional players&#8217; activity. This analysis seems to hold some weight, considering it&#8217;s been a little over a month since the Securities and Exchange Commission approved the trading of spot BTC exchange-traded funds in the United States. These investment products are issued and managed by some of the world’s largest financial companies, including BlackRock, Grayscale, Fidelity, and so on. Bitcoin Whales Show Highest Activity Since 2022 Another on-chain revelation that somewhat supports the argument of increased institutional participation has emerged. According to analytics platform Santiment, BTC whale activity has been heating up lately, reaching its highest level in over 20 months. Data from Santiment shows that wallets with 1,000 &#8211; 10,000 BTC are on an accumulation spree, adding roughly 249,000 coins (worth about $12.8 billion) in 2024 only. However, it is worth mentioning that a lower tier of investors (100 &#8211; 1,000 BTC) has sold more than 151,000 Bitcoin since the year started. Related Reading: Aptos Market Cap Skyrockets, $574 Million Worth Of APT Tokens Set To Shake The Market In Q1 2024 As of this writing, Bitcoin is valued at $51,950, reflecting a 0.6% decline in the past day. Nonetheless, the premier cryptocurrency has retained most of its weekly profit, having gained almost 10% in the last seven days. Bitcoin price hovering around $52,000 on the daily timeframe &#124; Source: BTCUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  }
]