[
  {
    "source": "CoinDesk",
    "date": "2024-01-29T22:45:55.000Z",
    "title": "HyperVerse's Alleged Ponzi Scheme Raked in Nearly $2B, Hired Actor as Fake CEO",
    "url": "https://www.coindesk.com/policy/2024/01/29/hyperverses-alleged-ponzi-scheme-raked-in-nearly-2b-hired-actor-as-fake-ceo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "HyperVerse was a nearly $2 billion fraudulent crypto investment scheme with a fake CEO at its helm, the U.S. Securities and Exchange Commission (SEC) and a grand jury allege in a lawsuit and criminal indictments against two of its leaders."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-29T22:44:42.000Z",
    "title": "Hallucination Nation: How Crazy Is Your Favorite AI Model?",
    "url": "https://decrypt.co/214647/hallucination-nation-how-crazy-is-your-favorite-ai-model",
    "description": "Huggingface’s new Hallucinations Leaderboard ranks models based on how prone they are to generate content that is not true."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-29T23:00:11.000Z",
    "title": "Stellar Development Foundation Votes to Delay Protocol 20 Upgrade Amid Bug Concerns",
    "url": "https://news.bitcoin.com/stellar-development-foundation-votes-to-delay-protocol-20-upgrade-amid-bug-concerns/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stellar Development Foundation Wants to Hits Pause on Protocol 20 Upgrade Due to Critical Bug\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stellar_bug.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Stellar Development Foundation wishes to put a hold on the upcoming Protocol 20 upgrade of the Stellar blockchain network, originally scheduled for January 30. This decision follows the discovery of a bug that could impact the Soroban smart contract transactions. Stellar Development Foundation Wants to Hit Pause on Protocol 20 Upgrade Due to Critical [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T23:00:33.000Z",
    "title": "Expert Reveals Key Macro Indicators For Bitcoin: A Roadmap To Next Rally?",
    "url": "https://www.newsbtc.com/bitcoin-news/expert-reveals-key-macro-indicators-for-bitcoin-a-roadmap-to-next-rally/",
    "description": "Bitcoin advocate and CEO of Jan3, Samson Mow, has pinpointed a range of macroeconomic indicators that could signal an impending rally for Bitcoin. Mow focuses on exchange-traded inflows (ETF), Bitcoin’s Hashrate, and whale activity on prominent exchanges like Bitfinex. The Jan3 CEO also mentioned the 200-week moving average (WMA) in forecasting Bitcoin’s trajectory. The recent data shared by Cypherpunk on X highlighting significant whale accumulation on Bitfinex further supports Mow&#8217;s Bitfinex whale indicator, suggesting an increased interest from large-scale investors in the flagship crypto. This is some great alpha from @Excellion. You can see for yourself that the whales on #Bitfinex are accumulating #Bitcoin. Decide what you want to do with that information. 🚀 https://t.co/IHjrqUvrDn pic.twitter.com/FS518AIYoz — CYPHERPUNK (@cypherpunkstore) January 29, 2024 Broader Economic Indicators Mow also looks beyond the crypto-specific data, considering global economic factors like Tether’s USDT Assets Under Management, government debt payments, and Debt-to-GDP ratios. The Bitcoin advocate believes these factors, along with nation-state adoption of Bitcoin, real inflation rates, and M3 money supply, could profoundly impact Bitcoin’s performance. These are the #Bitcoin macro indicators I’m looking at: ⬆️ ETF inflows ⬆️ Hashrate ⬆️ Finex whale accumulation ⬆️ 200 WMA trend ⬆️ Tether USDt AUM ⬆️ Govt interest payments on debt ⬆️ Debt GDP ratios ⬆️ Nation-state Bitcoin adoption ⬆️ Real inflation ⬆️ M3 money — Samson Mow (@Excellion) January 28, 2024 Notably, Samson Mow has remained steadfast in his ambitious prediction for BTC, maintaining a $1 million price target for the crypto. Mow recently cautioned about the potential &#8216;max pain&#8216; accompanying a rapid ascent of Bitcoin to this monumental valuation. Related Reading: Crypto Analyst Says February Will Be A Bullish Month For Bitcoin, Here’s Why Furthermore, Mow has recently suggested that this significant price milestone could materialize relatively quickly, possibly within days or weeks. However, according to the Jan3 CEO, the starting point for this potential surge is &#8220;TBD&#8221; (to be disclosed). My main prediction is the run up to $1M happens in days to weeks. Starting point TBD. — Samson Mow (@Excellion) January 14, 2024 Bitcoin Latest Trajectory And Prediction Despite a recent dip below $39,000 last week, BTC has shown a slight increase, with an uptick bringing its price above $42,000. This recovery, though slight, aligns with the optimistic predictions of various analysts and experts, including Samson Mow. SkyBridge Capital&#8217;s founder, Anthony Scaramucci, has also joined the chorus with an optimistic prediction for Bitcoin. Scaramucci’s analysis suggests a potential 300% increase in Bitcoin’s value post-halving, with a long-term price target of $400,000. Related Reading: Bitcoin Eyes $45,000 Amid Anticipation Of FOMC Decision His estimates, based on historical data and market trends, indicate that the peak bullish period for BTC could be about 18 months after the halving event. These predictions are further supported by the recent developments in Bitcoin ETFs, including the filing of the first-ever Bitcoin spot ETF in Hong Kong, indicating a growing institutional interest in BTC. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-29T23:01:31.000Z",
    "title": "Crypto ETPs See $500,000,000 in Institutional Outflows in One Week, According to CoinShares",
    "url": "https://dailyhodl.com/2024/01/29/crypto-etps-see-500000000-in-institutional-outflows-in-one-week-according-to-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Inflows-Into-Cash-Funds.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutions are pulling out of crypto exchange-traded products (ETPs) to the tune of $500 million weeks after the U.S. Securities and Exchange Commission (SEC) approved a spot BTC exchange-traded fund (ETF) earlier this month. In its latest Digital Asset Fund Flows report, CoinShares finds that even though crypto investment products saw massive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/29/crypto-etps-see-500000000-in-institutional-outflows-in-one-week-according-to-coinshares/\">Crypto ETPs See $500,000,000 in Institutional Outflows in One Week, According to CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]