[
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T08:00:00.000Z",
    "title": "Struct Finance Launches Customizable Interest Rate Solution",
    "url": "https://cryptodaily.co.uk/2023/06/struct-finance-launches-customizable-interest-rate-solution",
    "description": "<p>Struct Finance, an innovative decentralized finance (DeFi) platform facilitating the trading of structured financial instruments, has unveiled its flagship product. Struct has released a customizable interest rate vault that features a groundbreaking &ldquo;tranching&rdquo; mechanism.</p>\n<p>According to an official statement, Struct Finance will incorporate various tokens, tokenized derivatives, vaults, and pools to create customized interest rate products that align with users&rsquo; risk preference. The newly launched interest rate products will empower individuals to divide and repackage the risk associated with any yield-bearing DeFi assets into distinct segments. This is undertaken in a process known as tranching. These products consist of a single vault that is split into two tranches, each offering different returns.</p>\n<p>&nbsp;</p>\nChoose Your Interest\n<p>The first tranche Struct has pioneered caters to conservative investors seeking consistent fixed returns, while the second tranche suits those with a higher risk appetite and provides variable returns. The yield generated by the underlying asset is directed to the fixed tranche, ensuring predictable returns. The remaining yield is allocated to the variable tranche, providing it with amplified exposure to the yield-bearing asset.</p>\n\n<p>&ldquo;The lack of fixed-yield returns in crypto has been a deterrent to entry of both larger institutions and smaller players with more conservative risk appetites,&rdquo; stated Struct. &ldquo;Considering the Struct Factory allows permissionless tranching of liquidity pools, fixed rate returns may become commonplace enough to tame the wild and volatile returns of web3.&rdquo;</p>\n\n<p>&nbsp;</p>\nMore Structured Products in the Works\n<p>The tranching mechanism developed by Struct is merely the first in a series of planned products, designed to provide DeFi users with diversified investment opportunities. At the core of these products is the series of interest rate vaults that will power the Struct Finance ecosystem as it develops.</p>\n<p>Built on top of GMX (GLP), Struct&rsquo;s vaults tranche an underlying yield-bearing asset into two, creating a product that generates fixed yield, and another with enhanced exposure to the performance of the underlying asset. Currently live on Avalanche&rsquo;s layer1 network, Struct&rsquo;s future plans include the release of a native token and the development of additional structured financial products.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T07:45:00.000Z",
    "title": "Huobi Founder Sues Crypto Exchange For Trademark Infringement",
    "url": "https://cryptodaily.co.uk/2023/06/huobi-founder-sues-crypto-exchange-for-trademark-infringement",
    "description": "<p>Huobi founder Li Lin has sued Huobi Global in Hong Kong for using the Huobi trademark without proper permission. Lin has filed a lawsuit in the High Court of the Hong Kong Special Administrative Region.&nbsp;</p>\n<p>According to the lawsuit, the exchange continued to use the Huobi trademark without obtaining consent from Li Lin&rsquo;s company, X-Spot.&nbsp;</p>\nHuobi Founder Sues Exchange He Founded&nbsp;\n<p>Chinese crypto reporter posted details about the lawsuit on his Twitter handle, stating that the crypto firm had resumed using the &ldquo;Huobi&rdquo; trademark without permission from X-Spot. Lin&rsquo;s company maintains exclusive rights to the trademark. The news of the lawsuit comes as the exchange attempts to increase its footprint in Hong Kong in the face of growing regulatory pressure on the crypto industry. The United States Securities and Exchange Commission has also clamped down on cryptocurrencies and crypto platforms, forcing exchanges to look for more friendly jurisdictions.&nbsp;</p>\n<p>Colin Wu, a Chinese crypto reporter, published details about the lawsuit on Twitter, stating,&nbsp;</p>\n\n<p>&ldquo;Huobi founder Li Lin formally sued Huobi Global in Hong Kong for using its Chinese trademark 火币 that was not allowed to continue to be used in the original acquisition contract. Huobi was acquired by Justin Sun for over $1 billion last year. Sun froze Li Lin&rsquo;s brother&rsquo;s account and accused him of dumping HT this year.&rdquo;</p>\n\nLi vs Sun&nbsp;\n<p>The move to sue the exchange comes after Justin Sun, Huobi Global Advisor, moved to block Li Lin&rsquo;s brother, Li Wei&rsquo;s account and accused him of dumping Huobi Global&rsquo;s native HT token. Sun had assured token holders at the time that the volume of HT tokens sold by Wei would be removed from the circulating supply, restoring the token&rsquo;s original value. The move resulted in the token facing significant volatility. Following the blocking of the account, Huobi began using the &ldquo;Huobi&rdquo; trademark once again.&nbsp;</p>\n<p>However, the complaint filed by Li Lin on the 21st of June, 2023, states that X-Spot had retained exclusive rights to the Huobi trademark.&nbsp;</p>\n\n<p>&ldquo;X-Spot Limited has retained exclusive rights to the &lsquo;Huobi&rsquo; trademark, which Huobi Global Limited has been using without X-Spot&rsquo;s authorization.&rdquo;&rsquo;</p>\n\n<p>Apparently, when the original shareholders transferred their shares in Huobi Global to About Capital Management, they explicitly agreed to retain the &ldquo;Huobi&rdquo; trademark. According to the terms of the agreement, About Capital&rsquo;s buyout vehicle would control a majority stake in Huobi Global once the transaction was complete. The sale of the exchange was part of a larger strategy to position the platform as an option for providing international investors with the best investment and trading services.&nbsp;</p>\n<p>Apart from retaining trademark rights, shareholders also agreed that the rights would not be transferred to Huobi or the buyer. They added that the parties&rsquo; asset delivery and equity transfer agreement prohibited the purchaser from using the &ldquo;Huobi&rdquo; brand and trademark.&nbsp;</p>\nHuobi Global Counters&nbsp;\n<p>However, Huobi Global has countered the claims, arguing that the exchange maintains the right to use the trademark in a number of legal jurisdictions globally. According to the exchange&rsquo;s interpretation of the agreement, it has the mandate to use the &ldquo;Huobi&rdquo; trademark freely. Huobi Global Limited is currently looking to expand its operations in Hong Kong. However, the exchange is not yet registered in the region. This is significant due to the threat posed to the proposed expansion plans by Li Lin&rsquo;s lawsuit.&nbsp;</p>\n<p>According to operational rules in Hong Kong and other regions, the right to use a trademark is subject to the regulations and laws in the region. As a result, a court will have to approve Huobi&rsquo;s expansion plans. Meanwhile, the Huobi token is currently trading at $2.69, suggesting increased investor interest in the token despite the ongoing troubles. So far, there has been no official comment by Justin Sun or Huobi Global about the lawsuit.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T07:50:48.000Z",
    "title": "Shiba Inu: This New AI Meme Token Partnered With Shibarium, Surges 81%",
    "url": "https://www.newsbtc.com/news/shiba-inu-ai-meme-token-partners-with-shibarium/",
    "description": "Shiba Inu lead developer Shytoshi Kusama recently published a new blog post about the latest developments in the SHIB ecosystem. However, while the focus of Kusama&#8217;s blog post was on Shibacals, there was a more hidden news: Shibarium&#8217;s partnership with AI meme token project Bad Idea.AI. The project&#8217;s official Twitter account also drew attention to the news, confirming that the partnership is now official. An image within the blog post showed an overview of all official partners and tokens that belong to the Shibarium ecosystem. Among them is Bad Idea.AI. It’s official @badideaai &#38; #Shibarium partnership pic.twitter.com/pUQMT2FkdA — Bad Idea Ai (@badideaai) June 21, 2023 Kusama has already spoken out in the AI meme token project&#8217;s Telegram group, expressing his delight that artificial intelligence (AI) will help decentralize Shibarium. He wrote: Thanks to this BAD community that has given us great insight about AI for our upcoming projects. Alongside our other partners like Unification, (and some projects I believe will bring massive value to Shibarium) we now have a powerful toolset, and plan that includes AI, for decentralization. I can&#8217;t thank you enough. #hailshib that&#8217;s one thing that was never a bad idea. Remarkably, Bad Idea.AI&#8217;s tool already caused a stir within the SHIB community in the past few days, but at that time it was not yet clear that it would become an official partner of Shiba Inu. On Saturday, June 17, the Bad Idea AI bot posted a reply in the Shiba Inu Telegram group to influencer @LucieSHIB&#8217;s question about why people attack the SHIB army. Honest answer 😤😞😂 Bad Idea x #SHIBARMY pic.twitter.com/p8GukUSxcn — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) June 17, 2023 Shiba Inu Goes AI: BAD Tokenomics A few hours ago, Lucie used Twitter to spread the word about the AI meme token, which she says has only 908 holders. &#8220;I was 773 and had no idea it was going to be introduced as a friendshib,&#8221; Lucie wrote, but she also stated: &#8220;It&#8217;s not financial advice! We bought this as a joke and love it and look forward to seeing how we implement it in the future. If you join the ride REMEMBER to have fun and Ask Bad Idea.AI questions!!!&#8221; Related Reading: Shiba Inu Breaks Through Crucial Resistance Point With 10% Climb According to the official white paper of the new Shiba Inu partner, the project was developed to answer the million dollar question of how humanity and AI technology can live in harmony in the future. &#8220;Will AI be our savior or our downfall?&#8221; is the core question of the project. To answer this question, the team has launched BAD IDEA, an &#8220;experiment&#8221; that combines AI, blockchain and DAOs in &#8220;a risky, meme-worthy concoction&#8221;, &#8220;think of it as humanity&#8217;s Hail Mary pass, a last-ditch effort to secure our future in a world where artificial intelligence threatens to call the shots.&#8221; Related Reading: US Politician Cheers Shiba Inu Price Surge, But Trend Reversal Still Pending The BAD token is currently only available on Uniswap V2 and has a total supply of 831 trillion BAD tokens. 59% are currently public, the rest is being held back for development, marketing and a &#8220;Humanity&#8217;s Last Hope Fund&#8221;. Also, there is a team allocation of 4.2%. At press time, BAD was ranked #2772 on CoinMarketcap and had a market cap of around $10 million. In the last 24 hours, its trading volume was $1.4 million, up 702%. With a price of $0.00000001134, BAD has seen an increase of 81% in the last 24 hours. The Shiba Inu price is currently facing key resistance at $0.00000837, where the 23.6% Fibonacci retracement level resides. As outlined in the last price analysis, the first scenario has come true. Now, SHIB needs to break above the 23.6% Fibonacci level and break out of the downtrend channel. Featured image from Neural Love, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T08:03:53.000Z",
    "title": "Bitcoin Set to Challenge US Dollar Dominance: Russian Bank CEO Predicts Rise of Chinese Yuan and BTC",
    "url": "https://www.crypto-news-flash.com/bitcoin-set-to-challenge-us-dollar-dominance-russian-bank-ceo-predicts-rise-of-chinese-yuan-and-btc-2/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-set-to-challenge-us-dollar-dominance-russian-bank-ceo-predicts-rise-of-chinese-yuan-and-btc-2",
    "description": "According to Andrey Kostin, CEO of VTB Bank, significant changes are occurring in the global economy.  JPMorgan recently highlighted emerging signs of de-dollarization in the global economy. Andrey Kostin, CEO of VTB Bank, mentioned in a recent Reuters interview that US sanctions are pushing Russia and countries to use currencies other than USD for international [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T08:02:09.000Z",
    "title": "Shiba Inu Has A Tough Rival: This New Memecoin Will Deliver 15,000% Before December",
    "url": "https://www.crypto-news-flash.com/shiba-inu-has-a-tough-rival-this-new-memecoin-will-deliver-15000-before-december/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-has-a-tough-rival-this-new-memecoin-will-deliver-15000-before-december",
    "description": "Listen up, meme enthusiasts and crypto investors! The battleground of memecoins is heating up, and it&#8217;s a showdown you don&#8217;t want to miss. New tokens are popping up, determined to surpass or replicate the success of the industry&#8217;s top dogs: Dogecoin, the pioneer, and Shiba Inu, the feisty rival. Both of these memecoins have enjoyed [...]"
  }
]