[
  {
    "source": "Decrypt",
    "date": "2023-08-10T09:27:07.000Z",
    "title": "Dollar Strength in the Global Economy ‘Is Under Threat’, Says Circle CEO",
    "url": "https://decrypt.co/151981/dollar-strength-global-economy-is-under-threat-says-circle-ceo",
    "description": "Jeremy Allaire’s pro-crypto ad urged the US to “make a choice” regarding digital currencies, iterating the threats facing the dollar."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T09:34:06.000Z",
    "title": "Nigeria to issue verifiable blockchain certificates for NYSC",
    "url": "https://cointelegraph.com/news/nigeria-to-issue-verifiable-blockchain-certificates-for-nysc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8f55ee3e-b339-4c18-a5dc-3b874e5ac772.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This initiative aims to house all NYSC certificates on the blockchain, providing individuals with the means to easily verify and authenticate them.</p>\n                    <p><p>Kashifu Inuwa Abdullahi, who holds the position of Director-General at the National Information Technology Development Agency (NITDA), has disclosed that <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain technology</a> will be employed for the generation and validation of National Youth Service Corps (NYSC) certificates within Nigeria.</p><p>The National Youth Service Corps is a program in Nigeria that requires university graduates under 30 years old to undergo a one-year period of national service involving community development projects and cross-cultural integration.</p><p>This <a href=\"https://www.youtube.com/watch?v=sfUtFeNYcF4\" target=\"_blank\" rel=\"noopener nofollow\">declaration</a> took place at the Stakeholders’ Policy Dialogue centered around the execution of the National Blockchain Policy. The gathering was organized by NITDA in collaboration with the stakeholders from the Blockchain Association of Nigeria (SiBAN).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a51fad7f-6c5b-4851-9a44-8a287a711299.JPG\"  /><figcaption style=\"text-align: center;\"><em>Image of Kashifu Inuwa Abdullahi, the Director-General at NITDA at the event. Source: Youtube</em></figcaption></figure><p>The Director-General of NITDA highlighted that the NYSC certificate has been susceptible to considerable counterfeiting within Nigeria. Consequently, the Director-General approached NITDA for assistance, and a mutual agreement was reached to aid in the creation of a blockchain-based certificate authentication system. This initiative aims to house all NYSC certificates on the blockchain, providing individuals with the means to easily verify and authenticate them.</p><p>Additionally, Kashifu Inuwa Abdullahi articulated the plan to furnish individuals who have successfully completed training programs under NITDA with certificates backed by blockchain technology. He also highlighted the willingness of the <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/central-bank-of-nigeria\">Central Bank of Nigeria </a>to collaborate with the broader ecosystem. </p><p>As per the head of NITDA, blockchain presents a significant economic potential and a tangible avenue to delve into the extensive prospects of blockchain technology is its application in the issuance of certificates. Abdullahi said,</p><blockquote>“I believe blockchain, with the ability to add $1.7 trillion to the global GDP, will be a good technology for Nigeria to leverage. And if we position ourselves well based on the BWC report, Nigeria can add about $40 billion to its GDP by 2030.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-nigeria-faces-calls-for-ban-by-nigerian-bureau-de-change-association\"><strong><em>Binance faces calls for ban by Nigerian Bureau De Change association</em></strong></a></p><p>A prominent voice at the gathering was Obinna Iwuno, serving as the President of SiBAN, who conveyed a positive outlook on the sector's forthcoming prospects. He highlighted that the government has embraced a grander vision for our industry and its future potential. </p><p>Consequently, they have begun to adopt a more comprehensive and expansive viewpoint, expressing their readiness to forge even stronger collaborations with the SiBAN, with the aim of ensuring the robust expansion of the industry.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T09:30:05.000Z",
    "title": "NFT collection Y00ts plans Ethereum migration prompting 350% trade volume boom",
    "url": "https://cryptoslate.com/nft-collection-y00ts-plans-ethereum-migration-prompting-350-trade-volume-boom/",
    "description": "<p>Polygon-based (MATIC) NFT collection y00ts said it would migrate to Ethereum (ETH) and return the $3 million grant it previously received from the layer2 network, according to an Aug. 10 tweet. y00ts did not provide additional information on when the migration would occur. It said:  &#8220;The migration date will be announced shortly.&#8221; Meanwhile, the NFT [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nft-collection-y00ts-plans-ethereum-migration-prompting-350-trade-volume-boom/\">NFT collection Y00ts plans Ethereum migration prompting 350% trade volume boom</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T09:29:45.000Z",
    "title": "PayPal’s PYUSD Stablecoin Launch Raises Eyebrows in Washington",
    "url": "https://www.cryptopolitan.com/paypals-pyusd-stablecoin-washington/",
    "description": "In a move that has ruffled feathers in the corridors of power, American payments behemoth PayPal recently unveiled its USD-pegged PYUSD stablecoin, issued by Paxos Trust Co. However, the announcement was met with skepticism and concern from some quarters, most notably from Democrat congresswoman Maxine Waters. Congresswoman Maxine Waters Voices Concerns Waters, known for her ... <a title=\"PayPal&#8217;s PYUSD Stablecoin Launch Raises Eyebrows in Washington\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paypals-pyusd-stablecoin-washington/\" aria-label=\"More on PayPal&#8217;s PYUSD Stablecoin Launch Raises Eyebrows in Washington\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T09:17:51.000Z",
    "title": "NxtWave Empowers Students with Hands-On Generative AI Workshop",
    "url": "https://www.cryptopolitan.com/nxtwave-empowers-students-generative-ai/",
    "description": "NxtWave, an upskilling platform focused on software careers, recently organized a virtual Mega Workshop on Generative AI. This workshop aimed to provide aspiring tech students with up-to-date knowledge about emerging technologies. The event garnered significant participation from students across India, representing over 3,000 colleges. NxtWave&#8217;s virtual Mega Workshop on Generative AI aimed to equip young ... <a title=\"NxtWave Empowers Students with Hands-On Generative AI Workshop\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nxtwave-empowers-students-generative-ai/\" aria-label=\"More on NxtWave Empowers Students with Hands-On Generative AI Workshop\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T09:15:52.000Z",
    "title": "All Smoke And Mirrors? Why The Aptos-Microsoft Deal Is A Reason To Short APT",
    "url": "https://www.newsbtc.com/news/why-aptos-microsoft-deal-reason-to-short/",
    "description": "Aptos (APT) has scored a major deal with tech giant Microsoft yesterday. However, the announcement of a &#8220;partnership&#8221; between Aptos Labs and tech giant Microsoft has raised eyebrows and ignited debates across the crypto community if this is just smoke and mirrors. With the APT token witnessing a surge of nearly 20% following the news, and a significant token unlock looming, the timing and nature of this partnership have come under scrutiny. Aptos-Microsoft Deal Just A Click? In the official press release, Aptos Labs revealed its plans to integrate Microsoft&#8217;s artificial intelligence (AI) technology. The collaboration aims to introduce a range of tools and services, including the Aptos Assistant chatbot, powered by Microsoft&#8217;s Azure OpenAI Service. The chatbot is designed to assist users with queries about the Aptos ecosystem and offer resources to developers crafting smart contracts and decentralized applications. Related Reading: Aptos Labs’ Collaboration With Microsoft Sends APT Soaring By 17% CEO Mo Shaikh commented on the convergence of AI and blockchain, stating, &#8220;Artificial intelligence and blockchain technologies are quickly converging for one important reason: They are both generational breakthroughs that profoundly impact the evolution of the internet and shape society.” However, the partnership&#8217;s announcement has not been without its critics. Renowned crypto analyst @DefiSquared, known for being the top-ranked trader on Bybit, took to Twitter to express his skepticism. He pointed out, &#8220;lmao what. Did you guys really just pump Aptos 15% on the &#8220;news&#8221; that it&#8217;s paying to use Microsoft Azure services? Seems like an obvious short on a chain that yes, still has no users and an $8 bil valuation with an infinite token supply and 100% annual emissions.&#8221; @DefiSquared further highlighted the timing of the news, just two days (on Friday) before more than 4.5 million APT tokens (2% of the circulating supply) will be unlocked, suggesting potential ulterior motives. He also shared a screenshot from Microsoft&#8217;s website, indicating the ease with which entities can join the Microsoft AI Cloud partner program, sarcastically remarking, &#8220;Aptos really clicked &#8216;Enroll at no cost and become a partner today&#8217; and added a billion dollars to their market cap. Who knew it was that easy?&#8221; Aptos really clicked &#8220;Enroll at no cost and become a partner today&#8221; and added a billion dollars to their market cap. Who knew it was that easy? pic.twitter.com/Lt42y4vpB2 — DeFi^2 (@DefiSquared) August 10, 2023 Related Reading: Aptos (APT) Succumbs To Bearish Pressure, Loses 10% In A Single Week While the partnership promises to explore blockchain-based financial services, including asset tokenization and central bank digital currencies, the specifics remain vague. Aptos&#8217; representative emphasized the collaborative nature of the partnership, stating, “This is a collaboration from day one. Aptos Labs’ team of AI experts, Ph.Ds, and Web3 developers are working directly with Microsoft’s AI team to train models, integrate AI technology into the Aptos Assistant and GitHub elements integrating with Aptos’ blockchain.&#8221; APT Price Analysis As the crypto community continues to dissect the nuances of this partnership, the question remains: Is this a genuine stride forward for Aptos, or a well-timed PR move to buoy token prices ahead of a significant unlock for venture capitalists (VCs)? Only time will tell. At press time, the APT price stood at $7.27. Thus, APT failed to post a higher high. The price has already bounced downwards off the resistance at $7.98 and also ahead of the 200-day EMA as well as the 23.6% Fibonacci retracement level. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T09:23:20.000Z",
    "title": "Cardano’s Daily Transaction Count Surpasses Bitcoin’s, BTC and ADA Holders Find Ripe Opportunity in $ROE Presale",
    "url": "https://www.crypto-news-flash.com/cardanos-daily-transaction-count-surpasses-bitcoins-btc-and-ada-holders-find-ripe-opportunity-in-roe-presale-2/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-daily-transaction-count-surpasses-bitcoins-btc-and-ada-holders-find-ripe-opportunity-in-roe-presale-2",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-10T121837.638.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-10T121837.638.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-10T121837.638-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-10T121837.638-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-10T121837.638-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-10T121837.638-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic landscape of cryptocurrencies, every milestone achieved is a testament to the relentless innovation and the shifting tides of potential. Cardano, often hailed for its visionary approach and groundbreaking technology, has recently achieved a remarkable feat that reverberates across the crypto sphere.  As the daily transaction count of Cardano surpasses even that of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T09:13:48.000Z",
    "title": "Lawsuit Targets VC Firms Linked to FTX Cryptocurrency Exchange – Report",
    "url": "https://www.crypto-news-flash.com/lawsuit-targets-vc-firms-linked-to-ftx-cryptocurrency-exchange-report/?utm_source=rss&utm_medium=rss&utm_campaign=lawsuit-targets-vc-firms-linked-to-ftx-cryptocurrency-exchange-report",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Lawsuit filed against VC firms connected to FTX cryptocurrency exchange due to alleged involvement in aiding FTX fraud. Allegations claim defendant VCs enabled FTX&#8217;s expansion and misrepresented its operations while violating securities laws. In a recent development that highlights the intricate web of connections within the cryptocurrency industry, a lawsuit has been initiated against prominent [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T09:15:55.000Z",
    "title": "Bitcoin ‘Party’ Is About To Start, Predicts Crypto Analyst Michaël van de Poppe – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/08/10/bitcoin-party-is-about-to-start-predicts-crypto-analyst-michael-van-de-poppe-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Party-Is-About.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto trader Michaël van de Poppe is expressing bullish sentiment on Bitcoin (BTC) as the flagship crypto asset hovers below a key resistance level. In reference to a potential upside move, Van de Poppe tells his 662,700 Twitter followers that Bitcoin is “close to a party.&#8221; The widely followed crypto analyst also indicates on an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/bitcoin-party-is-about-to-start-predicts-crypto-analyst-michael-van-de-poppe-here-are-his-targets/\">Bitcoin ‘Party’ Is About To Start, Predicts Crypto Analyst Michaël van de Poppe – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]