[
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T04:41:36.000Z",
    "title": "‘Evidence is piling’ for a new crypto bull run: Delphi Digital co-founder",
    "url": "https://cointelegraph.com/news/delphi-digital-cofounder-signals-new-crypto-bull-run",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/38bce5c9-dec0-4245-93d1-aa00bf4f1e44.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Delphi Digital co-founder Kevin Kelly believes a recent change in a key U.S. manufacturing business index could be one of the bellwethers for a crypto bull run.</p>\n                    <p><p>Several on-chain metrics and charts are showing signals that could hint at the beginning of a new crypto bull market cycle, according to the co-founder of Delphi Digital.</p><p>On Aug. 14, institutional crypto research firm Delphi Digital's Kevin Kelly said that crypto markets are cyclical and predictable which “has huge implications for the crypto market going forward.”</p><blockquote>\"Evidence is piling up that we're in the early stages of a new cycle. Risk assets like stocks [and] crypto have been sniffing this out all year.\"</blockquote><p>Kelly also shared an Aug. 8-dated chart by Delphi Digital, highlighting that Bitcoin follows four-year cycles with distinct patterns that have reliably repeated for the past three cycles — with Bitcoin suffering an 80% drawdown in the first year, recovering to prior highs over two years, before rallying to a new all-time high in the fourth year. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The crypto market is highly cyclical.<br><br>Crypto market cycles are also remarkably consistent.<br><br>But their consistency isn’t just by coincidence.<br><br>They’re predictable.<br><br>If we&#39;re right, this has huge implications for the crypto market going forward.<br><br>Time to air out some charts... </p>&mdash; Kevin Kelly (@Kevin_Kelly_II) <a href=\"https://twitter.com/Kevin_Kelly_II/status/1691200100922724353?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kelly noted that Bitcoin cycle peaks also typically coincide with the peaks in the Institute of Supply Management (ISM) manufacturing index — which tracks the health of the manufacturing and service sectors in the United States.</p><blockquote>“BTC price peaks occur around the same time the ISM shows signs of topping out. Active addresses, total transaction volumes, total fees – they all peaked alongside tops in the ISM too.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fd8397b1-2190-42cd-9de5-01071997567c.jpg\"  /><figcaption style=\"text-align: center;\"><em>BTC price/ISM PMI. Source: Delphi Digital</em></figcaption></figure><p>Kelly explained that when the business cycle starts to show recovery, so does the crypto market. </p><p>“Turning points in the business cycle have historically been ripe opportunities to increase risk exposure,” he said before adding, “It looks like the ISM is nearing the final stages of its two-year downtrend which again risk assets have been sniffing out.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/five-catalysts-to-break-bitcoin-crypto-from-stupor-analysts\"><strong><em>Analysts tip 5 catalysts that could break Bitcoin, crypto from its stupor</em></strong></a></p><p>Bitcoin and crypto markets have been lethargic for the past five months or so but analysts told Cointelegraph that several fundamental factors such as ETF approvals, an end of the rate hikes, and an Ethereum scaling upgrade could bring them out of hibernation. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Wolf Of All Streets worries about a world where Bitcoin hits $1M: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T04:44:44.000Z",
    "title": "Ethereum Price Plunge To $1,800 On The Horizon, As Bulls Show Weak Hands",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-plunge-to-1800/",
    "description": "Ethereum price is struggling to rise above the $1,850 zone against the US Dollar. ETH could drop toward the $1,800 support in the near term. Ethereum is trading in a range below the $1,850 and $1,860 resistance levels. The price is trading below $1,850 and the 100-hourly Simple Moving Average. There is a key contracting triangle forming with support near $1,840 on the hourly chart of ETH/USD (data feed via Kraken). The pair could drop toward $1,800 if there is no close above the $1,860 resistance. Ethereum Price Dips Again Ethereum’s price remained below the $1,860 resistance zone and reacted to the downside. ETH topped near $1,853 and declined below the $1,840 level, similar to Bitcoin. A low is formed near $1,837 and the pair is now consolidating losses. It climbed above the 23.6% Fib retracement level of the recent decline from the $1,853 swing high to the $1,837 low. Ether is now trading below $1,850 and the 100-hourly Simple Moving Average. There is also a key contracting triangle forming with support near $1,840 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,845 level or the 100-hourly Simple Moving Average. Source: ETHUSD on TradingView.com The 50% Fib retracement level of the recent decline from the $1,853 swing high to the $1,837 low is also near $1,845. The first key resistance is near the $1,850 level. The next key resistance is near the $1,860 level. A close above the $1,860 level could send the price toward $1,880. Any more gains might send the price toward the $1,920 pivot level, above which the price could rise toward the $2,000 zone. More Losses in ETH? If Ethereum fails to clear the $1,850 resistance, it could continue to move down. Initial support on the downside is near the $1,840 level or the triangle lower trend line. The first major support is near the $1,835 zone. If the bulls fail to protect the $1,835 support, there could be more losses. The next major support is near the $1,800 support level. Any more losses might send the price toward the $1,740 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,835 Major Resistance Level – $1,850"
  }
]