[
  {
    "source": "Decrypt",
    "date": "2023-07-04T12:01:03.000Z",
    "title": "Political Satirist Slammed for Creating Deepfakes of Trump, Biden Cheating on their Wives",
    "url": "https://decrypt.co/147238/political-satirist-slammed-for-creating-deepfakes-of-trump-biden-cheating-on-their-wives",
    "description": "Images of several politicians engaged in infidelity were created to force a high-level conversation on disinformation."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T11:58:00.000Z",
    "title": "Gemini’s Winklevoss Threatens DCG With Litigation",
    "url": "https://cryptodaily.co.uk/2023/07/gemini-winklevoss-threatens-dcg-with-litigation",
    "description": "<p>One of the Winklevoss twins has demanded a payment of $1.47 billion from Digital Currency Group (DCG)&rsquo;s Barry Silbert.&nbsp;</p>\nWinklevoss Calls Out Silbert\n<p>In an interesting turn of events, Cameron Winklevoss, co-founder of Gemini, has made a final offer demanding a payment of $1.47 billion from DCG&rsquo;s CEO Barry Silbert. He also threatened the latter with legal action if the final payment offer was not met by the deadline of July 6, 4 PM ET. Winklevoss claimed that the legal action would include a detailed report of Silbert&rsquo;s personal liability in hiding Genesis&rsquo;s insolvency issues and filing a Turnover Motion to force the immediate payment of the $630 million payment owed to creditors.&nbsp;</p>\nDCG&rsquo;s Credit Struggles\n<p>When Genesis&rsquo;s parent company DCG got caught up in the credit crisis of 2022, the latter entered into negotiations with creditors. However, the company did miss a $630 million payment to Genesis in May, which has now led to Cameron Winklevoss penning the open letter to Silbert, with the final offer of a $1.47 compensation. This substantial amount reflects the magnitude of the alleged damages and underlines the seriousness of the accusations against DCG and Silbert.</p>\n&ldquo;Game Over&rdquo;: Winklevoss\n<p>Winklevoss posted the open letter on Twitter on Monday, claiming that Silbert had never had any intentions of resolving the matter with the creditors in mind ever since the company had halted its withdrawals. He claimed that instead of working on a proper resolution to return their funds to the Earn users, Silbert and his team have dedicated the last eight months to buy time, to &ldquo;raise money and stiff creditors and Earn users again.&rdquo;</p>\n<p>He wrote,&nbsp;</p>\n\n<p>&ldquo;I write to inform you that your games are over. In addition to dragging out a resolution, they have ballooned professional fees to over $100 million, all of which have gone to lawyers and advisors at the expense of creditors and Earn users. Enough is enough.&rdquo;</p>\n\n$1.2B Owed To Earn Customers\n<p>The demand comes amidst allegations of fraud involving Barry Silbert, founder of DCG, and has sparked widespread speculation within the cryptocurrency community. Gemini had previously lent customer funds to Genesis under the Earn program. Winklevoss claimed that more than 232,000 Earn users have over $1.2 billion of assets trapped in Genesis. Other than this amount, DCG also owes a further $2.1 billion to creditors.&nbsp;</p>\n<p>Winklevoss closed out the letter by writing,&nbsp;</p>\n\n<p>&ldquo;I've seen a lot of bad behavior from you and your colleagues over the last 9 months, but perhaps the most disturbing part is something you said to me this Fall that you're a victim in all of this. It takes a special kind of person to owe $3.3 billion dollars to hundreds of thousands of people and believe, or at least pretend to believe, that they are some kind of victim.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T12:00:04.000Z",
    "title": "Coinbase Stock Soars Nearly 12% As BlackRock Reveals Surveillance Partnership",
    "url": "https://www.newsbtc.com/coinbase/coinbase-stock-soars-as-blackrock-reveals-partnership/",
    "description": "Coinbase, a prominent United States cryptocurrency exchange, has recently witnessed an upswing in its COIN share prices. This surge comes on the heels of the world&#8217;s largest asset manager, BlackRock, choosing Coinbase as a surveillance partner for its re-filed Bitcoin ETF application. In the limelight of this crypto-mainstream finance crossover, Coinbase&#8217;s shares have soared by a nearly 12% over the past day. Renewed BlackRock Application Spurs Coinbase Growth Nasdaq disclosed on July 3 that BlackRock, the eminent entity in worldwide asset management, had updated its proposal for a spot Bitcoin ETF, incorporating new specifics about a &#8216;surveillance-sharing agreement&#8217; with Coinbase.  Related Reading: SEC Sues Binance, Coinbase Then BlackRock Files For Bitcoin Spot ETF; Is This An Inside Job? This news triggered a bullish response in the market, and Coinbase shares skyrocketed, marking a significant day in the crypto market landscape. The details in the application outline an agreement between Nasdaq and Coinbase forged last month. The pact, intended to &#8220;supplement the exchange’s market surveillance program,&#8221; provides Nasdaq access to spot BTC trade data. The report revealed that should BlackRock&#8217;s Bitcoin ETF gain approval, Nasdaq expects to leverage the data obtained from Coinbase in surveilling the trading. Notably, the regulatory landscape around cryptocurrencies in the US remains a hotbed of speculation and anticipation. While the Security and Exchange Commission (SEC) has granted approval to a number of futures-based ETFs, a spot-based one, physically backed by the asset as opposed to CME contracts, has not yet been given the green light. Refiled applications for multiple companies looking to launch spot BTC funds emerged last week, facilitated by Cboe. This includes Fidelity, WisdomTree, VanEck, and Invesco, all of which have listed Coinbase as a surveillance-sharing partner, further amplifying Coinbase&#8217;s critical role in the process. Nate Geraci, the President of ETF Store, believes that the launch of a spot Bitcoin ETF will shatter previous ETF launch records. It is worth noting that with such optimistic industry sentiments, Coinbase&#8217;s crucial part in this narrative solidifies their importance. COIN Surges Nearly 12% In response to BlackRock&#8217;s endorsement, Coinbase shares saw an upsurge of nearly 12% in the past day. Consequently, COIN is trading just below $80, at the time of writing up by 11.71%. The company stock has since been in a bullish trend since the beginning of 2023, outpacing the crypto market, which has gained roughly over 50% in the same period. Particularly, larger crypto assets such as Bitcoin and Ethereum have seen a massive surge since the year began, and BTC currently trades above $30,000 after briefly trading at $31,000 yesterday. Related Reading: Coinbase CEO Faces Allegations Of Insider Trading In $1.7 Million Stock Sale Ethereum on the other hand has followed the BTC movement closely, surpassing the $1,900 mark. Currently, the asset is looking to break past the $2,000 region as it trades at a price of $1,952, at the time of writing. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T12:03:58.000Z",
    "title": "Stellar Powers Multi-Billion Dollar App to Conquer Trillion-Dollar Payment Market – Can XLM Price Hit $0.15? Report",
    "url": "https://www.crypto-news-flash.com/stellar-powers-multi-billion-dollar-app-to-conquer-trillion-dollar-payment-market-can-xlm-price-hit-0-15-report/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-powers-multi-billion-dollar-app-to-conquer-trillion-dollar-payment-market-can-xlm-price-hit-0-15-report",
    "description": "WisdomTree has chosen the Stellar protocol to host its new investing app. Amid the confluence of positivity around Stellar, is XLM&#8217;s price likely to touch $0.15? Traditional financial service providers are seeking avenues to create a balance with the nascent cryptocurrency industry and on that premise, WisdomTree, set to release a new application dubbed WisdomTree [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T12:00:50.000Z",
    "title": "Is It a Marketing Agency? Is It an Advertising Giant? It’s Shiba Memu! What Investors Need To Know About This New Crypto",
    "url": "https://www.crypto-news-flash.com/is-it-a-marketing-agency-is-it-an-advertising-giant-its-shiba-memu-what-investors-need-to-know-about-this-new-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=is-it-a-marketing-agency-is-it-an-advertising-giant-its-shiba-memu-what-investors-need-to-know-about-this-new-crypto",
    "description": "In recent years, the meme coin market has seen a massive surge in value and market capitalization, with the market value rising from $0 back in 2020 to a whopping $20 billion in 2022. Many crypto enthusiasts and eager investors are waiting for the next big meme token.  Well, the meme market is about to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T12:00:09.000Z",
    "title": "PEPE Defies Odds And Gets Listed on Major US Crypto Exchange, QUBE Will Be Next",
    "url": "https://www.crypto-news-flash.com/pepe-defies-odds-and-gets-listed-on-major-us-crypto-exchange-qube-will-be-next/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-defies-odds-and-gets-listed-on-major-us-crypto-exchange-qube-will-be-next",
    "description": "The cryptocurrency market continues to surprise and defy expectations, with unique tokens entering the spotlight. One such example is the frog-themed meme coin, PEPE, which has recently achieved a significant milestone by getting listed on the prestigious Gemini Foundation platform. This major U.S. crypto exchange has recognized the potential of PEPE, and its listing on [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T12:06:00.000Z",
    "title": "Bill Morgan Questions Coinbase’s Suspension of XRP Trading",
    "url": "https://coinedition.com/bill-morgan-questions-coinbases-suspension-of-xrp-trading/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Coinbase-May-Relist-XRP-If-Ripple-Wins-Lawsuit-Against-SEC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Digital assets enthusiast Bill Morgan has once again questioned Coinbase’s decision to halt the trading of XRP amid its lawsuit with the US Securities and Exchange Commission (SEC). Morgan quote tweeted Coinbase Chief Legal Officer Paul Grewal asking the latter to relist XRP. While slamming Coinbase as “pathetically inconsistent,” Morgan tweeted: Bill Morgan expressed his [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bill-morgan-questions-coinbases-suspension-of-xrp-trading/\">Bill Morgan Questions Coinbase&#8217;s Suspension of XRP Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T11:45:47.000Z",
    "title": "Terra Luna Classic Faces Financial Quandary as LUNC Price Battles Bears",
    "url": "https://coinedition.com/terra-luna-classic-faces-financial-quandary-as-lunc-price-battles-bears/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Terra-Classic-9-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Terra Luna Classic community is grappling with a financial predicament as its community pool balance experiences a substantial decline. Following the approval of three significant spending proposals, the balance has plummeted from 2.37 billion LUNC to a mere 416 million LUNC. This alarming reduction has left the community in a precarious situation, hampering further [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/terra-luna-classic-faces-financial-quandary-as-lunc-price-battles-bears/\">Terra Luna Classic Faces Financial Quandary as LUNC Price Battles Bears</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T11:45:09.000Z",
    "title": "Project Incubated by Coinbase Gears Up for Launch of Ethereum Layer-2 Mainnet",
    "url": "https://dailyhodl.com/2023/07/04/project-incubated-by-coinbase-gears-up-for-launch-of-ethereum-layer-2-mainnet/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Up-for-Launch-of-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A project supported by the US-based crypto exchange Coinbase says that its Ethereum (ETH) layer-2 protocol is on the cusp of launching its mainnet. The project, known as Base, says it has recently completed internal and external security audits, which means it has now fulfilled four out of the five criteria it set out for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/project-incubated-by-coinbase-gears-up-for-launch-of-ethereum-layer-2-mainnet/\">Project Incubated by Coinbase Gears Up for Launch of Ethereum Layer-2 Mainnet</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]