[
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T14:00:00.000Z",
    "title": "Perfect storm for undervalued ASICs: Blockstream plans $50M raise to buy miners",
    "url": "https://cointelegraph.com/news/blockstream-plans-50m-raise-to-buy-miners",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2dfe4861-9140-49ab-9d3a-b051816c5132.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockstream intends to buy and store ASIC mining hardware ahead of Bitcoin’s halving in 2024.</p>\n                    <p><p>Blockchain technology firm Blockstream is looking to raise up to $50 million to purchase and store mining equipment that it perceives to be undervalued on secondary markets.</p><p>Speaking exclusively to Cointelegraph, Blockstream mining sales head James Macedonio unpacked the company’s plans to take advantage of a “huge separation” in the value of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and ASIC mining equipment.</p><p>Blockstream is partnering with Luxembourg-based digital securities marketplace STOKR to launch the Blockstream ASIC (BASIC) Note. Macedonio said that blockstream will look to initially secure $5 million for its Series 1 BASIC Notes, each valued at $115,000, to buy ASICs at scale, store and then sell them back to the market as demand for hardware picks up into 2024.</p><p>The 24-month investment note is set to be available to accredited international investors, while Macedonio said that the firm anticipates seeing returns in 12 to 18 months, factoring in Bitcoin’s next mining reward halving earmarked for April 2024.</p><p>Blockstream also notes that BASIC is intended as a Bitcoin basis investment vehicle that aims to \"generate a bitcoin-on-bitcoin return\". The company also expects that majority of investments to be made with BTC. </p><p>According to Macedonio, the price of ASIC miners — specialized hardware used to mine proof-of-work cryptocurrencies like Bitcoin — is nearly 10 times lower than their peak around December 2021.</p><blockquote>“The price of Bitcoin is half of what it was, but ASICS are a tenth of what they were, and historically they’ve been highly correlated.”</blockquote><p>Blockstream’s team has previously noted that the value of ASIC miners typically correlates to the price movements of Bitcoin, with BTC appreciation leading to an increase in miner prices.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7180dfc2-d6fc-4cab-869b-eac7804c514b.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>ASIC price index reflects the current price per terahash of different Bitcoin mining ASICs grouped by three efficiency tiers. Source: ASIC Index Data</em></figcaption></figure><p>Macedonio notes some factors that have impacted the stagnant price of mining hardware compared with Bitcoin’s recent price recovery to current levels of around $30,000.</p><blockquote>“A lot of companies over-leveraged themselves using Bitcoin as collateral. So when Bitcoin went down, they defaulted. Some of those lenders had a large inventory of miners that were pushed into the market.”</blockquote><p>Soaring energy prices in 2022 challenged Bitcoin profitability for miners, which also played a role in the oversupply of ASIC miners on secondary markets. Macedonio said that the lack of recovery for ASIC miner prices is driven by a lack of capacity to operate the machinery and difficulty raising funds to acquire more hardware.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/blockstream-raises-125m-to-finance-expanded-bitcoin-mining-operations\">Blockstream raises $125M to finance expanded Bitcoin mining operations</a></em></strong></p><p>Blockstream anticipates a positive price correction for ASIC hardware and plans to raise capital to purchase ASIC hardware to be stored in bonded warehouses. </p><p>Blockstream will look to raise a target of $50 million through $5 million tranches. Macedonio added that while the company will look to acquire the most efficient machines on secondary markets, the possibility of a Bitcoin bull run could drive demand for less efficient machines:</p><blockquote>“If Bitcoin goes to $70,000 or more, people are going to try to get their hands on any ASICs they can just to start mining because their profitability would be so great.”</blockquote><p>Blockstream is primarily planning to purchase Bitmain and MicroBT mining equipment, with Macedonio highlighting that the hardware is prevalent and historically has good resale value.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T13:40:27.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The Jacobi Bitcoin exchange-traded fund (ETF) is finally going live on the Euronext Amsterdam stock exchange, more than a year after its planned launch. Meanwhile, crypto custodian Prime Trust has filed for Chapter 11 bankruptcy after being unable to honor user deposits for months, and a Chinese man was reportedly arrested for buying and transferring stablecoins.</p><h3>First EU spot Bitcoin ETF hits Euronext Amsterdam exchange</h3><p>Europe will welcome a first-ever spot Bitcoin ETF after the long-awaited launch of Jacobi Asset Management’s Jacobi FT Wilshire Bitcoin ETF.</p><p>The London-based digital asset management firm announced that its new investment product was going live on the Euronext Amsterdam stock exchange on Aug. 15, more than a year later than its planned launch in 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/351b4407-e681-4b68-a084-0c7288f24de8.png\"  /></figure><p>As previously reported by Cointelegraph, the offering was touted as the first spot or physical-backed Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) fund that would <a href=\"https://cointelegraph.com/news/new-spot-bitcoin-etf-launched-at-euronext-amsterdam-exchange\">allow investors to gain exposure</a> to a financial product that is physically backed by BTC.</p><p>The new exchange-traded fund (ETF) is set to trade under the BCOIN ticker, while the product was approved by the Guernsey Financial Services Commission back in October 2021. As <a href=\"https://blockworks.co/news/us-europe-spot-bitcoin-etf\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> by Blockworks, Fidelity Digital Assets will handle the custodial elements of the BCOIN ETF.</p><p>The asset management firm also highlighted the environment and socially friendly nature of the fund, having added a renewable energy certificate (REC) to the ETF.</p><p>The fund taps into external data to measure the energy usage of the Bitcoin network and buys and retires the RECs. The RECs are also accounted for on a blockchain service, which is aimed to allow investors to verify the eco-friendly claims of the fund.</p><p>BCOIN makes use of the FT Wilshire Bitcoin Blended Price Index to access real-time average Bitcoin price data from certain cryptocurrency exchanges. The spot ETF allows investors to gain exposure to the Bitcoin market without having direct ownership or custody of the underlying asset.</p><p>The launch of the spot Bitcoin ETF marks a milestone for Europe, while United States regulators are yet to approve a number of similar spot Bitcoin ETF applications from major asset managers, including BlackRock and Fidelity.</p><p>A statement from Jacobi CEO Martin Bednall highlighted the continent’s progressive attitude toward cryptocurrency investment products as a potential catalyst for further adoption:</p><blockquote>“It is exciting to see Europe moving ahead of the US in opening up Bitcoin investing for institutional investors who want safe, secure access to the benefits of digital assets using familiar and regulated structures like our ETF.”</blockquote><p>The launch of the Jacoby Bitcoin ETF follows the debut of a Bitcoin Equities ETF on the Euronext Amsterdam exchange by Melanion Capital in June 2023. The ETF is designed to track the Melanion Bitcoin Exposure Index, which is a custom basket of European and American stocks closely tied to BTC’s market price.</p><p>This differs from the spot ETF in that investors gain exposure to the fund, which comprises stocks from companies with significant investments in Bitcoin holdings, cryptocurrency exchanges and mining operations.</p><p>This includes the likes of technology firm MicroStrategy, which holds over 140,000 BTC, as well as major Bitcoin mining companies, such as Riot, Marathon Digital and Hut8.</p><h3>Prime Trust files for Chapter 11 bankruptcy </h3><p>Prime Trust <a href=\"https://cointelegraph.com/news/prime-trust-files-for-bankruptcy-delaware\">filed for Chapter 11 bankruptcy protection</a> in a Delaware court following months of being unable to honor customer withdrawals.</p><p>In a court filing it said it it has between 25,000 to 50,000 creditors with estimated assets of $50 million to $100 million compared to liabilities between $100 million to $500 million.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Prime Trust files for Chapter 11 protection. Prime is an actual trust company that holds people’s crypto for a fee. How do you go broke in that business?<a href=\"https://t.co/RPIHKNnhRD\">https://t.co/RPIHKNnhRD</a></p>&mdash; Amy Castor (@ahcastor) <a href=\"https://twitter.com/ahcastor/status/1691274170146177024?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Prime Trust said will file court motions to facilitate its evaluation of all alternatives which may include potentially selling its assets and operations. </p><p>The motions are also expected to include requests to continue to pay wages and benefits to employees.</p><p>A <a href=\"https://cointelegraph.com/news/nevada-financial-regulator-petitions-court-prime-trust-receivership\">court petition</a> by Nevada’s business regulator that <a href=\"https://cointelegraph.com/news/nevada-court-approves-regulator-petition-prime-trust-receivership\">was approved</a> in July said Prime Trust owed over $85 million in fiat to its clients but only had around $2.9 million.</p><p>Its digital asset liabilities were smaller, with Prime Trust owing about $69.5 million in crypto while holding around $68.6 million.</p><h2>China enforcing crypto ban with latest arrest</h2><p>China’s crackdown on cryptocurrency transactions remains in full swing, as evidenced by the latest enforcement actions in Fujian province.</p><p>According to local media, a man described only as <a href=\"https://cointelegraph.com/news/chinese-man-sentenced-9-months-prison-buying-13-thousand-in-tether-usdt\">Mr. Chen was convicted</a> by the Fuzhou Mawei People’s Procuratorate on charges of “concealmant and concealment of crime” for purchasing $13,067 worth of Tether’s USDT stablecoin. Mr. Chen reportedly received a request from his acquaintance, Mr. Lin, to purchase the USDT on his behalf. Prosecutors seemed to imply that the transaction was used for money laundering.</p><p>“Con artists use virtual currency to transfer and launder stolen money,” the Fuzhou Mawei People’s Procuratorate said, according to a Google translation. “This kind of online money laundering in the name of purchasing virtual currency, knowing that others use the information network to commit crimes and providing assistance to them, has violated the law.”</p><p>Mr. Chen was sentenced to nine months in prison and fined 5,000 yuan, or $689.</p><p>China has been cracking down on cryptocurrencies since at least 2017 and has <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">expanded its enforcement actions</a> recently. Multichain was shut down in July after Chinese police arrested the protocol’s CEO.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T13:45:00.000Z",
    "title": "SBF Charged With Using Stolen Funds For Political Donations",
    "url": "https://cryptodaily.co.uk/2023/08/sbf-charged-with-using-stolen-funds-for-political-donations",
    "description": "<p>FTX founder Sam Bankman-Fried is in the news once again after a recent development revealed that he had allegedly used stolen customer funds to donate over $100 million to political campaigns.&nbsp;</p>\nFTX Founder's Troubles Deepen\n<p>Federal prosecutors have filed a fresh indictment against Bankman-Fried, charging him with seven counts of conspiracy and fraud related to the collapse of his crypto exchange. According to the indictment, Bankman-Fried contributed over $100 million of funds stolen from customer accounts on the FTX exchange to donate to political campaigns in the run-up to the 2022 U.S. midterm elections to influence softer crypto legislations.&nbsp;</p>\n<p>The former CEO of the defunct crypto exchange is already under legal scrutiny over charges of pilfering billions in FTX customer funds to offset losses at Alameda Research, his crypto-focused hedge fund.&nbsp;</p>\nPolitical Leanings And Opaque Donations\n<p>The 31-year-old entrepreneur, who previously pleaded not guilty to the initial charges, is now confronted with new allegations that he misappropriated customer funds for political donations.</p>\n<p>Bankman-Fried reportedly made substantial political donations in 2022, with a CBS News analysis suggesting the figure exceeded $40 million. Although the majority of these contributions were made to Democratic candidates and causes, he stated that Bankman-Fried had also supported Republicans through undisclosed \"dark\" donations.</p>\nLobbying Efforts And Hidden Agendas\n<p>The indictment highlights Bankman-Fried's alleged use of FTX's influence and connections to push for cryptocurrency-friendly regulations. He purportedly directed fellow FTX executives to make donations aimed at circumventing contribution limits, with the goal of supporting legislation that would enable FTX to continue accepting customer deposits and growing its operations.</p>\n<p>The indictment claims that Bankman-Fried orchestrated the donations in a covert manner, transferring funds from FTX's sister trading firm, Alameda, to the personal bank accounts of FTX executives. These executives would then make donations under their own names, evading restrictions on certain political contributions and enhancing FTX's political clout.</p>\nLegal Maneuvering And Upcoming Trial\n<p>While prosecutors initially charged Bankman-Fried with violating U.S. campaign finance laws, they later dropped this charge in light of the Bahamas' refusal to extradite him on that basis. Despite this setback, prosecutors have indicated their intention to file a new indictment that would clarify the allegations of an illegal campaign finance scheme as part of the broader fraud and money laundering charges.</p>\n<p>U.S. District Judge Lewis Kaplan ordered Bankman-Fried's incarceration prior to his scheduled trial on October 2. The decision was made based on probable cause to believe that he tampered with witnesses on two occasions. Previously confined to his parents' home in Palo Alto, California, on a $250 million bond, Bankman-Fried now faces a more restrictive situation in the lead-up to his trial.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-15T14:00:19.000Z",
    "title": "From Crypto Custodian to Court: Prime Trust Files for Bankruptcy Protection",
    "url": "https://news.bitcoin.com/from-crypto-custodian-to-court-prime-trust-files-for-bankruptcy-protection/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From Crypto Custodian to Court: Prime Trust Files for Bankruptcy Protection\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/chaop11.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the wake of financial upheavals and regulatory hurdles, Prime Trust, a digital currency custodian, has formally sought Chapter 11 bankruptcy protection. This move closely follows the appointment of John Guedry as the company&#8217;s overseer, bolstered by a designated committee to steer the restructuring process. Crypto Custodian Prime Trust Files for Chapter 11 Bankruptcy Protection [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T14:06:19.000Z",
    "title": "Top crypto tweets of the day – August 15th",
    "url": "https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-15th/",
    "description": "The sales volume of Bitcoin Ordinals went plunged to almost zero Sam Bankman-Fried is heading to a Brooklyn jail notorious for poor conditions SkyBridge tells SEC the time is long overdue for a spot Bitcoin ETF Robert Kiyosaki predicts Bitcoin could reach 100k DOJ submits new complaints against Sam Bankman-Fried Bitcoin makes a new ATH ... <a title=\"Top crypto tweets of the day &#8211; August 15th\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-15th/\" aria-label=\"More on Top crypto tweets of the day &#8211; August 15th\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T14:06:09.000Z",
    "title": "Best Twitter threads of the day – August 15th",
    "url": "https://www.cryptopolitan.com/best-twitter-threads-of-the-day-august-15th/",
    "description": "Binance files court order against the US SEC The current state of rollups that recently launched 5 use cases of Bitcoin and crypto that could boost price performance"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T14:00:18.000Z",
    "title": "Netflix begins streaming video games – Here’s why you should care",
    "url": "https://www.cryptopolitan.com/netflix-begins-streaming-video-games/",
    "description": "Netflix has begun the first public testing of its cloud-streamed games. Beginning Monday, some Netflix users in Canada and the United Kingdom will be able to enjoy Netflix games on select TVs, connected TV devices, and online via Netflix.com. Netflix&#8217;s VP of gaming, Mike Verdu, described this as a &#8220;limited beta test&#8221; for a small ... <a title=\"Netflix begins streaming video games &#8211; Here&#8217;s why you should care\" class=\"read-more\" href=\"https://www.cryptopolitan.com/netflix-begins-streaming-video-games/\" aria-label=\"More on Netflix begins streaming video games &#8211; Here&#8217;s why you should care\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T13:54:56.000Z",
    "title": "Does OpenAI’s financial crunch overshadow ChatGPT’s potential in the crypto realm?",
    "url": "https://www.cryptopolitan.com/openais-financial-crunch-chatgpts-potential/",
    "description": "In recent years, ChatGPT has emerged as a revolutionary AI chatbot, showcasing rapid advancements in its performance and usability across diverse sectors. From the realms of blockchain and bitcoin to the thriving arts and entertainment industries, ChatGPT&#8217;s potential has been anticipated after its initial performance. But, beneath the veneer of success lies a looming predicament ... <a title=\"Does OpenAI&#8217;s financial crunch overshadow ChatGPT&#8217;s potential in the crypto realm?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openais-financial-crunch-chatgpts-potential/\" aria-label=\"More on Does OpenAI&#8217;s financial crunch overshadow ChatGPT&#8217;s potential in the crypto realm?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T13:44:15.000Z",
    "title": "Singapore central bank unveils regulatory framework, bringing clarity to stablecoins",
    "url": "https://www.cryptopolitan.com/singapore-central-bank-stablecoin-regulation/",
    "description": "Singapore&#8217;s central bank has announced its revised regulatory framework, whose primary objective is ensuring the stability of single-currency stablecoins that fall under the jurisdiction of the city-state. Unveiled on August 15th by the Monetary Authority of Singapore, this framework is designed to oversee single-currency stablecoins (SCS) linked to the valuation of either the Singapore dollar ... <a title=\"Singapore central bank unveils regulatory framework, bringing clarity to stablecoins\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapore-central-bank-stablecoin-regulation/\" aria-label=\"More on Singapore central bank unveils regulatory framework, bringing clarity to stablecoins\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T14:01:34.000Z",
    "title": "Hedera (HBAR) Blooms 21% – Uncloaking The Factors Behind The Rise",
    "url": "https://www.newsbtc.com/news/hedera-hbar-soars-17-uncloaking-the-catch-behind-the-rise/",
    "description": "Hedera (HBAR) has stolen the limelight by becoming the highest-gaining cryptocurrency in the past 24 hours. As investors eagerly accumulate, the token&#8217;s price exhibits a roller-coaster ride of volatility. While optimism fuels the anticipation of a price rally, caution is advised as HBAR&#8217;s Bollinger Bands cast a shadow of uncertainty over its immediate future. At the time of writing, HBAR&#8217;s price is recorded at $0.071 according to CoinGecko, reflecting an 8.1% rally over the past 24 hours. Impressively, the token has experienced a seven-day surge of 21.3%, underlining its significance in the market&#8217;s recent performance. Hedera price action today. Source: Coingecko Hedera Price Roller-Coaster And Its Indicators The token&#8217;s recent performance showcases its resilience amidst market dynamics, but investors should be prepared for its volatile nature. Bollinger Bands, a widely-used technical analysis tool, serve as a flashing signal of HBAR&#8217;s ongoing turbulence.  A price analysis notes that token is currently trading above the upper band of the indicator, implying a potential overbought situation. Moreover, the notable disparity between the upper and lower bands accentuates the prevailing high volatility. This discrepancy warns of an imminent correction, underscoring the capricious nature of HBAR&#8217;s market behavior. Today, @droppcc, the micropayments solution built on @Hedera and fuelled by #HBAR, was showcased as a service provider for FedNow, the instant payment service developed by the @federalreserve 🇺🇸 Catch up with @SushilDropp (CEO, Dropp) as he explains the #Hedera integration: pic.twitter.com/4HbZqlwghl — HBAR Foundation (@HBAR_foundation) August 14, 2023 Related Reading: XRP Volume Jolt: How Did The $3 Billion Surge Impact Price Action? The surge in HBAR&#8217;s value can be attributed to a significant development in the coin&#8217;s ecosystem. News of the United States Federal Reserve&#8217;s endorsement of the FedNow payment system, which integrates support for Dropp—a micropayment platform built on the Hedera Network—has undoubtedly propelled the value of HBAR.  This latest endorsement follows a series of positive strides for Hedera. In the preceding week, the network cemented its commitment to a &#8220;blockchain-powered future&#8221; by becoming a part of Blockchain for Europe.  HBAR market cap currently at $2.3 billion. Chart: TradingView.com Hedera Transactions, User Base Climb Amidst the market&#8217;s tumult, Hedera&#8217;s accomplishments continue to underscore its prowess. The recent celebration of processing 17 billion transactions on its blockchain stands as a testament to its efficiency and scalability.  Related Reading: Toncoin Solid Climb: Price Spikes By 21% In Surprise Burst Source: Arkhia Metrics Data sourced from Arkhia reveals that the total transactions now stand at an impressive 17.5 billion. Additionally, the network boasts an expanding user base, with 3.1 million accounts created as of press time. These milestones not only reflect the network&#8217;s growth but also highlight its potential as a significant player in the blockchain space. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Daily Hodl"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T14:02:20.000Z",
    "title": "XRP’s Day in Court: Ripple v. SEC Update Sparks Intense Debate and Price Speculation",
    "url": "https://www.crypto-news-flash.com/xrps-day-in-court-ripple-v-sec-update-sparks-intense-debate-and-price-speculation/?utm_source=rss&utm_medium=rss&utm_campaign=xrps-day-in-court-ripple-v-sec-update-sparks-intense-debate-and-price-speculation",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple and stellar Swift integration\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs-150x150.jpg 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />The US Securities and Exchange Commission&#8217;s recent submission of an interlocutory appeal triggers discussions among individuals close to the case. According to Lawyer Bill  Morgan, there is a slight change in language by SEC in their recent settlement with crypto exchange Bittrex.  Ripple Labs recently got a partial victory in its case against the US [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T14:00:55.000Z",
    "title": "As Litecoin (LTC) and Chainlink (LINK) Prices Stabilize, Investors Rush to a New Promising AI Powered Altcoin Poised for 1000% Growth",
    "url": "https://www.crypto-news-flash.com/as-litecoin-ltc-and-chainlink-link-prices-stabilize-investors-rush-to-a-new-promising-ai-powered-altcoin-poised-for-1000-growth/?utm_source=rss&utm_medium=rss&utm_campaign=as-litecoin-ltc-and-chainlink-link-prices-stabilize-investors-rush-to-a-new-promising-ai-powered-altcoin-poised-for-1000-growth",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-37-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market, known for its rapid fluctuations, has seen some stabilization in the prices of established coins like Litecoin (LTC) and Chainlink (LINK). However, as these giants find their footing, a promising new altcoin is garnering significant attention from investors. With its AI-powered features and potential for remarkable growth, Borroe is poised to make [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T14:05:13.000Z",
    "title": "FTX Former Executive Ryan Salame Refuses To Testify Under Oath",
    "url": "https://coinedition.com/ftx-former-executive-ryan-salame-refuses-to-testify-under-oath/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/From_the_US_governments_motion_in_limine_in_the_Sam_Bankman_Fried-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ryan Salame, the former co-chief executive of FTX, was declared unavailable to testify, and if subpoenaed, Salame would invoke his Fifth Amendment right against self-incrimination. Molly White, a crypto researcher and software engineer, shared on social media the latest news from the U.S. government’s motion in limine in the Sam Bankman-Fried criminal trial. Bankman-Fried’s indictment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-former-executive-ryan-salame-refuses-to-testify-under-oath/\">FTX Former Executive Ryan Salame Refuses To Testify Under Oath</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]