[
  {
    "source": "Decrypt",
    "date": "2023-07-19T14:13:57.000Z",
    "title": "Ethereum ICO Whale Moves $116M in ETH to Kraken",
    "url": "https://decrypt.co/149142/ethereum-ico-whale-moves-116m-in-eth-to-kraken",
    "description": "Yet another dormant Ethereum wallet that participated in the project’s ICO has woken up after years of slumber."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T14:30:56.000Z",
    "title": "Russia could begin digital rubles testing as early as next month",
    "url": "https://cryptoslate.com/russia-could-begin-digital-rubles-testing-as-early-as-next-month/",
    "description": "<p>Russia could begin testing a Central Bank Digital Currency (CBDC), Digital Ruble, as early as next month if its upper parliament approves the move and President Vladimir Putin signs it into law, according to a July 19 Bloomberg report. The Bank of Russia would collaborate with 15 of the country&#8217;s top lenders to run a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/russia-could-begin-digital-rubles-testing-as-early-as-next-month/\">Russia could begin digital rubles testing as early as next month</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-19T14:31:02.000Z",
    "title": "SOL Staking Service by Marinade Finance Now Live",
    "url": "https://cryptobriefing.com/sol-staking-service-by-marinade-finance-now-live/?utm_source=feed&utm_medium=rss",
    "description": "Marinade Finance, the project with the highest total value locked (TVL) in the Solana ecosystem, has introduced its first-ever native staking service, Marinade Native. Welcome Marinade Native! Turn your SOL..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T14:11:01.000Z",
    "title": "Nasdaq Puts a Pause on Crypto Custody Service Plans Amid Regulatory Uncertainties",
    "url": "https://www.cryptoglobe.com/latest/2023/07/nasdaq-puts-a-pause-on-crypto-custody-service-plans-amid-regulatory-uncertainties/",
    "description": "In a surprising turn of events, Nasdaq, Inc. (NASDAQ:NDAQ) has reportedly decided to put its plans for a cryptocurrency custody service on hold. According to an article published by CoinDesk a short time ago, this announcement was made by CEO Adena Friedman during her company’s Q1 2023 Earnings Conference Call. According to the transcript (from […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T14:15:00.000Z",
    "title": "Global Gaming Giant PlayWay partners with GameSwift to release OuterLife utilising a zk-powered Polygon Supernet",
    "url": "https://cryptodaily.co.uk/2023/07/global-gaming-giant-playway-partners-with-gameswift-to-release-outerlife-utilising-a-zk-powered-polygon-supernet",
    "description": "<p>The frequent name on Steam&rsquo;s Global bestseller list is now entering web3, porting the first batch of its world famous simulator games into OuterLife.&nbsp;</p>\n<p>PlayWay, the global gaming giant, has teamed up with GameSwift to introduce and launch OuterLife as their entry into the web3 gaming world on Polygon network</p>\n<p>OuterLife is an innovative Web3 gaming accelerator and incubator, and it will allow PlayWay to integrate blockchain technology and non-fungible tokens (NFTs) into its famous simulator titles such as Animal Shelter, Farming Life, Cafe Owner Simulator and more.. PlayWay commented that it will port some of its existing catalogue of games, providing new, engaging and fresh experiences for its gamers with constantly evolving storylines and added productions. OuterLife also gives opportunity to other gaming studios producing simulators to join the incubator and using a zk-powered Polygon Supernet, to also build their own blockchains.</p>\n<p>Paweł Łaskarzewski, COO at OuterLife expressed that the gaming industry is &ldquo;ripe for disruption,&rdquo; in this case led by blockchain and NFT based initiatives. He said,</p>\n\n<p>&ldquo;Blockchain technology has the ability to provide new and engaging enhancements to tried and tested gaming models that have worked over the years, allowing players to get close to the game more than ever.&rdquo;</p>\n\n<p> Marek Parzyński, PlayWay, conveyed his delight in being part of the OuterLife launch and looks forward to a promising future in collaboration with both Polygon Labs and GameSwift.</p>\nWhat does this mean for players and developers?&nbsp;\n<p>Through the collaboration, existing and new developers within PlayWay&rsquo;s ecosystem and beyond will be able to connect their games to a world of interconnected digital reality, simply by an SDK, creating a truly open world. For players, OuterLife will offer an all new gaming experience where players can enhance statistics, acquire in-game items as non-fungible tokens and establish interconnected gaming simulations.</p>\n<p>CEO of GameSwift Wojciech Gruszka known also under his Twitter handle as Pan Paragraf comments, </p>\n\n<p>&ldquo;With OuterLife, character developments and upgrades in one game simulator will also have an impact in another - creating a truly interconnected digital reality with the power of blockchain.&rdquo;&nbsp;</p>\n\nHealthy Supply and Demand\n<p>Major strides are being made to bring blockchain technology to mainstream gaming, with over $739M invested in Q1 2023 alone, according to a DappRadar report. Driving forces for mass adoption are games that are fun, and not complicated for user onboarding, regardless of its usage of blockchain technology. In addition to fun, trends suggest healthy supply and demand for ownership, privacy, creator empowerment and ecosystem growth.</p>\n<p>OuterLife will use a zk-powered Polygon Supernet integration, which will address those to create a winning economic formula, while ensuring a seamless, scalable, easy to onboard and privacy-focused ecosystem for players, developers and gaming studios alike.&nbsp;</p>\nNot Far Off\n<p>PlayWay, the leading company behind gaming boom, was listed as the third-largest games company&mdash;trailing only CD Projekt Red, developers of The Witcher series and Cyberpunk 2077, and Techland with Dying Light. It is worth to highlight that PlayWay has around 4 times bigger capitalization than Ten Square Games, the mobile giant behind Let&rsquo;s Fish and Fishing Clash. The Global Giant has been home to some of the most successful gaming titles on Steam marketplace, with more than 100 titles in development, having partnered with more than 120 studios worldwide. While it's unclear on when the watershed mass-adoption moment will arrive, it's clear to see it having a major push with one of the biggest game studios in the world making heaps with the technology.&nbsp;</p>\n<p>Gaming continues to be one of the major vectors of mainstream adoption for Web3,&rdquo; said Urvit Goel, Vice President, Head of Global Business Development at Polygon Labs. &ldquo;When leading game companies like PlayWay and GameSwift join forces to establish the groundwork for Web3 gaming infrastructure, and with the market leading advancements in zero knowledge technology being developed at Polygon Labs, the future of gaming holds tremendous potential.</p>\n<p>PlayWay&rsquo;s simulator games have frequently been on Steam&rsquo;s global bestseller list, and the partnership with GameSwift only means it is not a question of if, but when blockchain technology will enhance games in a way that drives mass adoption.&nbsp;</p>\nAbout PlayWay:\n<p>PlayWay is one of the biggest group of gaming simulator studios in the world. Created in 2011, it has produced and released over 100 games that are sold and downloaded worldwide. With over 200 more still to come, PlayWay is listed at the Stock Exchange, with over 10 companies from PlayWay Group now on the stock exchange.&nbsp;&nbsp;</p>\nAbout GameSwift:\n<p>GameSwift is a Modular Gaming Ecosystem based on Modular Blockchain with Steam-like platform in its heart, which enables gamers to play web3 games with just one click (using Google/Facebook account) and without any blockchain know-how. GameSwift collaborated with Polygon Labs in August 2022 and will be building a Polygon Supernet. GameSwift will be backing PlayWay on the way to build their side chain using ZK rollups.</p>\nAbout Polygon Labs:\n<p>Polygon Labs develops Ethereum scaling solutions for Polygon protocols. Polygon Labs engages with other ecosystem developers to help make available scalable, affordable, secure and sustainable blockchain infrastructure for Web3.</p>\n<p>Polygon Labs has initially developed a growing suite of protocols for developers to gain easy access to major scaling solutions, including layer 2s (zero-knowledge rollups), sidechains, app-specific chains and data availability protocols. Scaling solutions that Polygon Labs initially developed have seen widespread adoption with tens of thousands of decentralised apps, unique addresses exceeding 287 million, over 1.4 million smart contracts created and 2.7 billion total transactions processed since inception. The existing Polygon network is home for some of the biggest Web3 projects, such as Aave, Uniswap, and OpenSea, and well-known enterprises, including Robinhood, Stripe and Adobe. Polygon Labs is carbon neutral with the goal of leading Web3 in becoming carbon negative.&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T14:15:00.000Z",
    "title": "Bitcoin Price Analysis:  Better After 29525 Print - 20 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-better-after-29525-print-20-july-2023",
    "description": "<p>BTC/USD Reclaiming Losses After 29525 Print:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 20 July 2023</p>\n<p>Bitcoin (BTC/USD) worked to reclaim recent losses early in the Asian session as the pair hovered around the 30000 figure after trading as high as the 30196.24 area.&nbsp; Significant Stops were elected below the 29592.63 area during the pair&rsquo;s recent depreciation, a downside price objective that is related to recent selling pressure that strengthened around the 31862.21 and 31376.52 areas.&nbsp;&nbsp; After BTC/USD escalated appreciated to interday highs and came off, Stops were elected below the 29860.62 area, representing the 50% retracement of the recent appreciating range from 29525 to 30196.24.&nbsp; Following recent trading activity, areas of technical support and potential buying pressure include the 29108, 28275, 27443, 26413, and 26257 levels.&nbsp;</p>\n<p>Below current price activity, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Upside price objectives include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30420.27 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30001.33.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-19T14:15:46.000Z",
    "title": "Alchemy Pay: Exploring the Development and Trends of the Emerging Crypto Payment Industry with High Demand",
    "url": "https://news.bitcoin.com/alchemy-pay-exploring-the-development-and-trends-of-the-emerging-crypto-payment-industry-with-high-demand/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dcbd2002-3b1c-414c-a811-d9ba4cf85142.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With traditional commercial institutions like Visa, Mastercard, Tesla, BNY Mellon, BlackRock, Gucci and countries such as El Salvador, Central African Republic constantly expanding in the cryptocurrency field, more and more investors are starting to look at cryptocurrency with new eyes. In 2022 alone, the number of cryptocurrency users has reached 320 million, identifying a huge [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:21:35.000Z",
    "title": "Corporate depositors push US banks for higher interest rates",
    "url": "https://www.cryptopolitan.com/corporate-push-us-banks-higher-interest-rate/",
    "description": "The dynamics of the banking sector are undergoing a seismic shift as corporate depositors urge US banks to offer higher interest rates. This move is causing ripples of concern for the profitability of these financial institutions and underscores the growing challenges they face in generating revenue amidst tightening monetary policy. Corporate Demand Squeezes US Bank ... <a title=\"Corporate depositors push US banks for higher interest rates\" class=\"read-more\" href=\"https://www.cryptopolitan.com/corporate-push-us-banks-higher-interest-rate/\" aria-label=\"More on Corporate depositors push US banks for higher interest rates\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:14:52.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.126, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.71% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:13:58.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T14:38:51.000Z",
    "title": "Moxy launches token sale, ‘Battle of the Influencers,’ and esports platform",
    "url": "https://crypto.news/moxy-launches-token-sale-battle-of-the-influencers-and-esports-platform/",
    "description": "Moxy.io, an esport platform, held a triple launch for its Moxy platform, MOXY--its native token, and a battle among top internet influencers on July 15"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T14:36:13.000Z",
    "title": "Ripple’s (XRP) Victory Calls For Replacing Gary Gensler And Limiting SEC’s Power To Bitcoin And Crypto Market",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-victory-calls-for-replacing-gary-gensler-and-limiting-secs-power-to-bitcoin-and-crypto-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-victory-calls-for-replacing-gary-gensler-and-limiting-secs-power-to-bitcoin-and-crypto-market",
    "description": "<img width=\"800\" height=\"390\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-300x146.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-768x374.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Senator Lummis Urges Crypto Framework Post Ripple’s (XRP) Ruling Victory: Emphasizing Consumer Protection and Innovation Ripple&#8217;s Legal Triumph Sparks Calls to Limit SEC&#8217;s Crypto Power: Setting a Precedent for Digital Asset Regulations Republican Senator Cynthia Lummis from Wyoming has taken to Twitter to highlight the significance of the recent court ruling on Ripple’s ( XRP) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T14:30:06.000Z",
    "title": "These 3 Crypto AI Projects Are Taking Over YouTube",
    "url": "https://www.crypto-news-flash.com/these-3-crypto-ai-projects-are-taking-over-youtube/?utm_source=rss&utm_medium=rss&utm_campaign=these-3-crypto-ai-projects-are-taking-over-youtube",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T171259.924.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T171259.924.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T171259.924-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T171259.924-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Introducing the dynamic trio of InQubeta, Fetch, and Ocean Protocol, three unique crypto AI projects that are taking over YouTube.  InQubeta is transforming the landscape of AI startup investment with its unique platform and $QUBE token, while Fetch is transforming data exchange with AI-powered capabilities. Ocean Protocol is reshaping the way data is shared and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T14:27:38.000Z",
    "title": "Oasis Introduces Sapphire: A Game-Changing Privacy Solution for Ethereum Ecosystem",
    "url": "https://www.crypto-news-flash.com/oasis-introduces-sapphire-a-game-changing-privacy-solution-for-ethereum-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=oasis-introduces-sapphire-a-game-changing-privacy-solution-for-ethereum-ecosystem",
    "description": "<img width=\"1176\" height=\"1056\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy.jpg 1176w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy-300x269.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy-1024x920.jpg 1024w\" sizes=\"(max-width: 1176px) 100vw, 1176px\" />Oasis has launched a privacy-first, cross-chain DApp development environment for the Ethereum ecosystem and smart contract blockchain networks. Solidity developers building privacy dApps can now add a privacy layer to new and existing dApps through Sapphire&#8217;s innovations. Oasis has launched the first confidential Ethereum Virtual Machine-compatible blockchain, Sapphire, allowing developers to add privacy features to [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-19T14:31:26.000Z",
    "title": "Beginner’s Guide To Kiba Inu – Part 1",
    "url": "https://www.altcoinbuzz.io/reviews/altcoin-projects/beginners-guide-to-kiba-inu-part-1/",
    "description": "<p>As the world of meme coins continues to evolve, numerous copycats have emerged, all vying for recognition. However, drawing inspiration from the beloved Naruto&#8217;s Kiba Inuzuka, Kiba Inu stands out as a remarkable anomaly amidst this flurry of competitors. What sets Kiba Inu apart is its unique purpose and a passionate team, ceaselessly striving to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/altcoin-projects/beginners-guide-to-kiba-inu-part-1/\">Beginner&#8217;s Guide To Kiba Inu &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T14:30:38.000Z",
    "title": "Cathie Wood Says ARK Invest Bullish on Coinbase After Ripple’s Victory in SEC Lawsuit",
    "url": "https://dailyhodl.com/2023/07/19/cathie-wood-says-ark-invest-bullish-on-coinbase-after-ripples-victory-in-sec-lawsuit/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Invest-Bullish-on-Coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>ARK Invest CEO Cathie Wood says that she is bullish on top US crypto exchange Coinbase after the ruling in Ripple’s legal battle with the U.S. Securities and Exchange Commission (SEC). In a new Bloomberg interview, Wood says that while ARK decided to sell some Coinbase shares for profit-taking, she continues to have an optimistic [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/cathie-wood-says-ark-invest-bullish-on-coinbase-after-ripples-victory-in-sec-lawsuit/\">Cathie Wood Says ARK Invest Bullish on Coinbase After Ripple’s Victory in SEC Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]