[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T21:27:43.000Z",
    "title": "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/06/27/ftx-pauses-sale-of-500m-stake-in-ai-firm-anthropic-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The move followed months of due diligence on the stake being done by the bidders, according to Bloomberg’s sources."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T21:23:11.000Z",
    "title": "Azuki NFT Floor Plummets as Collectors Blast 'Identical' Elementals Art",
    "url": "https://decrypt.co/146464/azuki-nft-prices-plummet-collectors-blast-identical-elementals-art",
    "description": "After the huge Azuki Elementals drop, the new NFTs are trading under the mint price—and the originals are falling fast."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T21:29:09.000Z",
    "title": "Nevada asks for Prime Trust to be put in receivership, reports $82M deficit",
    "url": "https://cryptoslate.com/nevada-asks-for-prime-trust-to-be-put-in-receivership-reports-82m-deficit/",
    "description": "<p>Regulators in Nevada filed a court petition to place Prime Trust LLC in receivership, according to an official press release on June 27. The Nevada Financial Institutions Division (NFID) said that it had asked courts to appoint a receiver to take control of Prime Trust&#8217;s daily operations. After examining the company, the receiver could return [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nevada-asks-for-prime-trust-to-be-put-in-receivership-reports-82m-deficit/\">Nevada asks for Prime Trust to be put in receivership, reports $82M deficit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T21:21:02.000Z",
    "title": "Prime Trust’s wallet disaster: $82m gone, trust shattered",
    "url": "https://www.cryptopolitan.com/prime-trusts-wallet-disaster-82m-gone/",
    "description": "The beleaguered Bitcoin and cryptocurrency custodian, Prime Trust, grapples with the fallout from losing access to their legacy wallet system last year. Now, the company faces a formidable debt of $82 million to its clientele, shattering the trust many once placed in their secure storage capabilities. Access lost, coffers depleted Last year marked a grave ... <a title=\"Prime Trust&#8217;s wallet disaster: $82m gone, trust shattered\" class=\"read-more\" href=\"https://www.cryptopolitan.com/prime-trusts-wallet-disaster-82m-gone/\" aria-label=\"More on Prime Trust&#8217;s wallet disaster: $82m gone, trust shattered\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T21:10:56.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the crypto space. Let&#8217;s see what ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T21:24:56.000Z",
    "title": "Nevada regulator petitions for receivership of Prime Trust",
    "url": "https://crypto.news/nevada-regulator-petitions-for-receivership-of-prime-trust/",
    "description": "The Nevada Financial Institutions Division has recently lodged a petition for receivership for Prime Trust citing operational instability and insolvency."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T21:30:20.000Z",
    "title": "Uniswap Bullish But Struggles With Resistance, Potential For More Gains?",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-bullish-but-struggles-with-resistance-potential-for-more-gains/",
    "description": "Despite the losses incurred earlier this month, the price of Uniswap (UNI) has managed to recover. However, it has struggled to break through a significant resistance level, causing it to remain stagnant. Despite this, the technical analysis of UNI shows bullish signals, with notable buying strength and a significant increase in both demand and accumulation. Related Reading: Robinhood To Lay Off 7% of Full-Time Staff In Latest Restructuring While UNI has seen an appreciation of over 20% in the past week, the pace of gains has slowed down on the daily chart. A potential rally could occur if UNI surpasses the important overhead resistance. The performance of Bitcoin, which has been above the $30,600 price mark, has positively impacted most altcoins, including UNI. To move beyond its current price ceiling in future trading sessions, the altcoin&#8217;s price movement is closely tied to the broader market strength. Conversely, if UNI cannot break the immediate resistance zone, it may experience a decline toward its support zone. The increased market capitalization of UNI suggests the potential for further gains and extended bullish sentiment. Uniswap Price Analysis: One-Day Chart As of the time of writing, UNI is being traded at $5.20. The altcoin is anticipated to face significant resistance at the $5.40 level or resistance zone (highlighted in blue). Breaking through this resistance at $5.40 can propel the altcoin to $5.80 and ultimately to $6, triggering a rally. Conversely, if the Uniswap price fails to sustain its current price level, it may drop to $5, and an inability to remain above $5 could result in UNI trading near or below the $4.80 price mark. Notably, an increase in trading volume has been observed in recent sessions, indicating an influx of buyers into UNI. Technical Analysis Following a rebound from the $5 price level, UNI has experienced a notable increase in buying strength, resulting in consistently positive demand. The Relative Strength Index (RSI) indicates an upward trend, with the index just below the 60-mark, indicating heightened buying volume. Additionally, the price of UNI has moved above the 20-Simple Moving Average (SMA) line, indicating that buyers are currently driving the price momentum in the market. Strong buy signals on the daily chart show increased demand for UNI. The Moving Average Convergence Divergence (MACD), is a tool that reflects price momentum and trend shifts. It displayed green histograms associated with buy signals for UNI. This indicates a bullish sentiment for the altcoin, suggesting the potential for future gains. In terms of price volatility and fluctuation, the Bollinger Bands provide insight. Related Reading: XRP Traders Show Capitulation, Why This Could Be Bullish Currently, the bands are open and diverged. This indicated that the Uniswap price may experience significant price fluctuations in the upcoming trading sessions. Featured image from UnSplash, charts from TradingView.com"
  }
]