[
  {
    "source": "CoinDesk",
    "date": "2024-03-12T13:24:09.000Z",
    "title": "EU Parliament Approves New Sanctions Laws That Also Apply to Crypto",
    "url": "https://www.coindesk.com/policy/2024/03/12/eu-parliament-approves-new-sanctions-laws-that-also-apply-to-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The laws are to ensure sanctions rules are applied uniformly across the EU's 27 member states."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-12T13:30:00.000Z",
    "title": " China will intensify Bitcoin bull run, $1M by 2028: Bitcoin Man, X Hall of Flame ",
    "url": "https://cointelegraph.com/magazine/crypto-bull-run-china-bitcoin-herbert-sim-hall-of-flame/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/03/Crypto-Twitter-Hall-of-Flame-Herbert-Sim-scaled.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Bitcoin bull run will explode as China gets involved, $1M BTC price by 2028, tips Herbert Sim “The Bitcoin Man”, X Hall of Flame.</p>\n                    <p><p><strong>According to Herbert Sim, aka The Bitcoin Man, the most recent bull run didnt even scratch the surface of whats to come in the crypto market, as China is yet to throw its hat into the ring.</strong></p><p>The thing now is the Chinese are actually still in the midst of gearing up. They havent even really entered the crypto market yet. I know this first hand because Im working with all the Chinese guys, he says.</p><p>That means the $69,000 Bitcoin price is the baseline for the bull run to start running. </p><p><a href=\"https://cointelegraph.com/magazine/crypto-bull-run-china-bitcoin-herbert-sim-hall-of-flame/\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-03-12T13:30:00.000Z",
    "title": " China will intensify Bitcoin bull run, $1M by 2028: Bitcoin Man, X Hall of Flame ",
    "url": "https://cointelegraph.com/magazine/crypto-bull-run-china-bitcoin-herbert-sim-hall-of-flame/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/03/Crypto-Twitter-Hall-of-Flame-Herbert-Sim-scaled.jpg\"></p><p>The Bitcoin bull run will explode as China gets involved, $1M BTC price by 2028, tips Herbert Sim “The Bitcoin Man”, X Hall of Flame.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-12T13:14:24.000Z",
    "title": "After AI Crypto Surge, Whales are Only Holding Solana and Algotech in 2024",
    "url": "https://cryptodaily.co.uk/2024/03/after-ai-crypto-surge-whales-are-only-holding-solana-and-algotech-in-2024",
    "description": "With rising excitement for the upcoming Bitcoin halving, an uplifting mood has hit the industry, with whales focused on Solana (SOL) and Algotech (ALGT)."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T13:39:27.000Z",
    "title": "LG Electronics Invests $60m in Bear Robotics for AI-Driven Service Robots",
    "url": "https://www.cryptopolitan.com/lg-electronics-invests-60m-for-ai-robots/",
    "description": "LG Electronics, a global leader in technology and innovation, has announced a significant investment of $60 million in Bear Robotics, a Silicon Valley startup specializing in AI-driven autonomous service robots. This move reflects LG&#8217;s commitment to advancing its capabilities in the field of service robotics, prioritizing long-term growth over short-term gains. As a result of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T13:20:22.000Z",
    "title": "Google’s Comprehensive Plan to Ensure Integrity in Lok Sabha Polls",
    "url": "https://www.cryptopolitan.com/googles-plan-to-ensure-integrity-in-polls/",
    "description": "Google&#8217;s has announced a comprehensive plan to provide voters with high-quality information for the upcoming Lok Sabha polls, emphasizing its commitment to supporting the democratic process. The tech giant aims to tackle misinformation, offer essential voting information, and help users navigate AI-generated content. This initiative, revealed on Tuesday, underscores Google&#8217;s dedication to ensuring the integrity [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T13:16:17.000Z",
    "title": "Pokemon Company Establishes Pokemon Works Subsidiary in Japan",
    "url": "https://www.cryptopolitan.com/pokemon-company-establishes-pokemon-works/",
    "description": "In a strategic move aimed at enhancing its development capacity and addressing concerns over game quality, The Pokemon Company has established a new subsidiary named Pokemon Works. Located in the bustling district of Shinjuku, Tokyo, Pokemon Works operates out of the same building as ILCA, a company renowned for its contributions to developing Pokemon Brilliant [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T13:15:59.000Z",
    "title": "ICP Price Prediction 2024-2033: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "Internet Computer ICP Price Prediction 2024-2033 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T13:13:21.000Z",
    "title": "XRP’s meteoric rise fueled by mystery whale moves",
    "url": "https://www.cryptopolitan.com/xrps-meteoric-rise-by-mystery-whale-moves/",
    "description": "The price of XRP has experienced a notable uptick, rising by 10% to reach $0.6921. This surge follows a series of significant transfers that sparked a buying frenzy in the market.  Notably, a transfer involving the movement of 100 million XRP from an undisclosed wallet to another contributed substantially to the bullish sentiment. Over the past week, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-12T13:30:33.000Z",
    "title": "Crypto Institutional Investors Are Frontrunning Retail As Inflows Reach Record Highs",
    "url": "https://www.newsbtc.com/crypto/crypto-institutional-inflows-record/",
    "description": "Crypto investment products continue to shine in the middle of a strong bullish market sentiment. New data has shown institutional investors and traders are now going full speed on crypto investment products, allowing inflows to attain a new inflow record. According to CoinShares, a digital asset investment firm, digital investment products registered a record weekly inflow of $2.7 billion last week, pushing the year-to-date inflow near a new record. Crypto Institutional Investors Continue To Aim Higher The crypto market has attracted its fair share of rich visionaries and institutional traders over the years, with most just dabbling in and out. Recent market factors, however, have opened the industry and made it palatable to big traders. As a result, trading volume from this cohort of investors has ballooned to new highs. Related Reading: Record $1 Billion In Shorts Risk Liquidation If Bitcoin Hits This Price In its latest weekly report, CoinShares noted that investment products based on cryptocurrencies reached a new milestone of $2.7 billion inflow last week, bringing the run to six consecutive weeks of inflows. Hence, the total inflow year-to-date is now at $10.3 billion, just $300 million shy of the $10.6 billion inflows recorded in 2021. To put this into perspective, we&#8217;re less than three months into 2024, and inflows are already on par with those recorded throughout the bullish cycle in 2021.  At the same time, trading volume reached a new record of $43 billion for the week, smashing the $30 billion record set in the previous week. Unsurprisingly, most of this activity can be credited to Bitcoin, with the majority of inflow going into the cryptocurrency. According to CoinShares, Bitcoin remained the focus of investors to attract $2.6 billion in inflows last week, representing 96% of the total inflow. This comes despite a $1.65 billion outflow from Grayscale&#8217;s Spot Bitcoin ETF. Speaking of Spot Bitcoin ETFs, there&#8217;s no denying the fact that these investment vehicles have been the primary catalyst for Bitcoin&#8217;s recent growth. This has allowed Bitcoin to break over various price resistance to reach new all-time highs. Last week, the 10 ETFs in the US ended the week at a net inflow of $2.238 billion, with BlackRock and Fidelity leading the charge. Despite recent price rises, short Bitcoin products also recorded $11 million in inflows last week. Related Reading: Cardano Price About To Explode: Crypto Pundit Reveals Next Target On the other hand, Ethereum investment products witnessed an outflow of $2.1 million last week to reverse $84.7 million inflows recorded in the prior week. This is despite Ethereum crossing over the $4,000 price level for the first time in two years. The reverse case is for Solana, which witnessed $24 million inflows after an outflow of $11.9 million in the previous week.  Polkadot, Fantom, Chainlink, and Uniswap also saw inflows of $2.7 million, $2 million, $2 million, and $1.6 million, respectively. Total market cap climbs to $2.62 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from CIM-Cyprus Business School, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-12T13:39:52.000Z",
    "title": "Nibiru Chain Debuts Public Mainnet Along with Four Major Exchange Listings",
    "url": "https://www.crypto-news-flash.com/nibiru-chain-debuts-public-mainnet-along-with-four-major-exchange-listings/?utm_source=rss&utm_medium=rss&utm_campaign=nibiru-chain-debuts-public-mainnet-along-with-four-major-exchange-listings",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Nibiru-black-1200x720_1710239445hMG8qJcfy3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Nibiru-black-1200x720_1710239445hMG8qJcfy3.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Nibiru-black-1200x720_1710239445hMG8qJcfy3-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Nibiru-black-1200x720_1710239445hMG8qJcfy3-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Nibiru-black-1200x720_1710239445hMG8qJcfy3-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Nibiru-black-1200x720_1710239445hMG8qJcfy3-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Tortola, British Virgin Islands, March 12th, 2024, Chainwire Nibiru Chain, a developer and user-centric Layer 1 platform, has officially launched its public mainnet. Nibiru Chain stands out by offering a secure and efficient environment for building highly-performant decentralized applications. It is distinguished by its robust smart contract ecosystem offering superior throughput and unparalleled security, making [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-12T13:30:24.000Z",
    "title": "Edu3Labs Making Big News",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/edu3labs-making-big-news/",
    "description": "<p>Web3 mechanisms can change everything from how we play to how we learn. This started with Play-to-earn (P2E) games. For the first time in history, we can earn tokens and/or NFTs for playing a video game. Then came web3 platforms that paid you to walk. Some of them even saw some adoption. And now, this [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/edu3labs-making-big-news/\">Edu3Labs Making Big News</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]