[
  {
    "source": "Cointelegraph",
    "date": "2024-01-30T09:51:51.000Z",
    "title": " UAE makes first digital dirham transfer via mBridge CBDC platform ",
    "url": "https://cointelegraph.com/news/uae-digital-dirham-transfer-mbridge-cbdc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDVhMWZjNTgtMjhhZi00Y2E0LTkzNGEtZjU1N2IyNDVmNjhlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>mBridge is a multi-national collaborative effort on using the CBDC for cross border transactions. </p>\n                    <p><p>The central bank of the United Arab Emirates (UAE) conducted its first cross-border digital dirham transfer using the mBridge central bank digital currency (CBDC) platform on Jan. 29.</p><p>The first cross-border CBDC transfer was worth 50 million AED ($13.6 million) and was sent to China using the multi-CBDC bridge platform mBridge, <a href=\"https://gulfnews.com/business/video-first-cross-border-payment-made-using-uaes-digital-dirham-1.100731629\" target=\"_blank\" rel=\"noopener nofollow\">reported </a>Gulf news. The chairman of the Board of the Central Bank of the UAE, Sheikh Mansour, conducted the CBDC transfer on the occasion of the golden jubilee celebration of the establishment of the central bank.</p><p>Project mBridge was <a href=\"https://cointelegraph.com/news/mbridge-cbdc-project-preparing-new-members-minimum-viable-product\">introduced in 2021</a> by the central monetary authorities of China, Hong Kong, Thailand and the UAE in partnership with the Bank of International Settlement (BIS). It is the only international collaborative partnership that involves China. The <a href=\"https://cointelegraph.com/news/bis-marks-cbdc-pilot-as-successful-with-22m-transacted\">project completed its pilot in September 2022</a> and was <a href=\"https://cointelegraph.com/news/mbridge-cbdc-project-preparing-new-members-minimum-viable-product\">commercially launched a year later</a> in September 2023.</p><p><a href=\"https://cointelegraph.com/news/uae-digital-dirham-transfer-mbridge-cbdc\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-30T09:47:03.000Z",
    "title": " NYC Bar Association pushes for crypto law reforms to halt firm exits ",
    "url": "https://cointelegraph.com/news/nyc-bar-association-crypto-amendments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNmRhMjYyZWEtMDMxMi00Y2MxLWE3NWQtMDhiOTdkMzMyOWEyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Bar Association seeks to maintain New York’s preeminence in digital asset transactions, not just paper-based financial transactions.</p>\n                    <p><p data-ct-non-breakable=\"true\">The New York City Bar Association has proposed a new amendment related to emerging technologies, such as digital assets, to encourage crypto firms to set up headquarters in New York and preserve the city’s preeminence as a leading commercial jurisdiction.</p><p>The New York Emerging Technologies Amendments seek to promote technological and commercial advances that decrease transaction costs and enhance the efficiency and security of financial transactions governed by the New York Uniform Commercial Code (UCC), according to the New York State Legislative <a href=\"https://www.nycbar.org/wp-content/uploads/2024/01/20221244-2024LegislativeAgenda.pdf\" target=\"_blank\" rel=\"noopener nofollow\">Agenda</a> published on Jan. 29.</p><p>The Bar Association noted that these advantages are significant factors considered by market participants choosing New York as a business location or as the jurisdiction in which to resolve legal disputes.</p><p><a href=\"https://cointelegraph.com/news/nyc-bar-association-crypto-amendments\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-30T09:39:44.000Z",
    "title": " GBTC outflows drop 70% from peak as Bitcoin exchanges shed BTC ",
    "url": "https://cointelegraph.com/news/gbtc-outflows-drop-bitcoin-exchanges-btc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzM1NDkzNzctMTU4OC00M2ZmLWIzMGUtYTg1MjU2YmI0NjNmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin ETFs — including GBTC — may soon begin to record net inflows, data suggests, as exchanges' BTC balances revert to their downtrend.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange outflows in January are chipping away at bearish BTC price prognoses.</p><p>The <a href=\"https://studio.glassnode.com/metrics?a=BTC&amp;e=coinbase&amp;m=transactions.TransfersVolumeFromExchangesSum&amp;s=1691772162&amp;u=1706486400&amp;zoom=\" target=\"_blank\" rel=\"noopener nofollow\">latest data</a> from on-chain analytics firm Glassnode confirms that despite a 20% dip on BTC/USD, coins have continued to leave exchanges.</p><p>Bitcoin investor appetite has not suffered as a result of current BTC price pressures, according to on-chain monitoring.</p><p><a href=\"https://cointelegraph.com/news/gbtc-outflows-drop-bitcoin-exchanges-btc\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T09:51:59.000Z",
    "title": "AI in Fashion: Can It Carry On a Designer’s Legacy?",
    "url": "https://www.cryptopolitan.com/ai-in-fashion-carry-on-a-designers-legacy/",
    "description": "Norma Kamali, the celebrated New York fashion designer with over five decades of experience, is pioneering a novel approach to ensure her creative legacy lives on. At 78, she isn&#8217;t ready to retire, but she&#8217;s contemplating the future of her eponymous fashion label. Instead of the traditional succession planning route, Kamali is delving into the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T09:50:00.000Z",
    "title": "Bitcoin mirrors COVID-19 rally, eyes all-time high – Bull market inbound?",
    "url": "https://www.cryptopolitan.com/bitcoin-mirrors-covid-19-rally/",
    "description": "The COVID-19 pandemic, which wreaked havoc on global economies and financial markets, profoundly impacted Bitcoin in 2020. Initially, the crypto experienced a sharp decline alongside traditional markets in the midst of panic-induced selling. However, Bitcoin&#8217;s resilience shone through as it rebounded swiftly, attracting a new wave of investors seeking a hedge against traditional economic uncertainties.&#160; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T09:48:53.000Z",
    "title": "Louis Vuitton Appoints Saoirse Ronan as Ambassador",
    "url": "https://www.cryptopolitan.com/louis-vuittons-saoirse-ronan-ambassador/",
    "description": "Louis Vuitton has officially announced Saoirse Ronan as their latest ambassador. This decision comes after a series of collaborations between the luxury fashion house and the American-Irish actress. Ronan has been a familiar face at various Louis Vuitton events, including the Academy Museum Gala and the brand’s Spring 2024 ready-to-wear show. Nicolas Ghesquière, the artistic [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T09:47:26.000Z",
    "title": "Health IT Trends in India 2024: AI, Robotics, and Technology Adoption in Healthcare",
    "url": "https://www.cryptopolitan.com/indias-ai-adoption-in-healthcare/",
    "description": "In 2024, the healthcare landscape in India is poised for significant transformation, driven by the adoption of cutting-edge technologies. Hospital Chief Information Officers (CIOs) from Max Hospitals and the Rajiv Gandhi Cancer Institute have shared insights into the evolving trends in health information technology (IT) and the challenges and opportunities that lie ahead. Rise of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T09:44:30.000Z",
    "title": "Chainlink Price Prediction 2024-2033: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2024-2033 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-30T09:46:10.000Z",
    "title": "Binance to reduce stake in Korean crypto exchange Gopax, report says",
    "url": "https://crypto.news/binance-to-reduce-stake-in-korean-crypto-exchange-gopax-report-says/",
    "description": "Binance reportedly plans to reduce its stake in Korean crypto exchange Gopax within the next two months to address regulatory reporting issues. Crypto exchange Binance, the major shareholder of Korean crypto trading platform Gopax, is set to reduce its stake&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-30T10:05:35.000Z",
    "title": "Uniswap Launches Web Token Sending via ENS Domain/Wallets",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/uniswap-launches-web-token-sending-via-ens-domain-wallets/",
    "description": "<p>Users can now send tokens directly from the Uniswap interface. Users can use either ENS domains or traditional wallet addresses. This update marks a substantial improvement in user experience, making Uniswap more accessible and versatile for a wider audience. Enhanced User Experience with New Sending Feature on Uniswap Interface Uniswap continues to innovate and enhance [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/uniswap-launches-web-token-sending-via-ens-domain-wallets/\">Uniswap Launches Web Token Sending via ENS Domain/Wallets</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]