[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T08:16:48.000Z",
    "title": "Atomic Wallet Hackers Move Stolen Funds via OFAC-Sanctioned Exchange Garantex: Elliptic",
    "url": "https://www.coindesk.com/tech/2023/06/13/atomic-wallet-hackers-move-stolen-funds-via-ofac-sanctioned-exchange-garantex-elliptic/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The attackers are believed to be the infamous North Korean hacker group Lazarus, as per blockchain security firm Elliptic."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T08:30:34.000Z",
    "title": "‘There's no more exciting time than now’ for Bitcoin: BTC Prague 2023",
    "url": "https://cointelegraph.com/news/btc-prague-2023-samson-mow-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5e23d75f-5d14-4ff3-a1df-55c5f96d7446.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Samson Mow, the CEO of JAN3, spoke with Cointelegraph about the current state of Bitcoin and why he’s bullish for the future. </p>\n                    <p><p>In recent weeks, the cryptocurrency market has been <a href=\"https://cointelegraph.com/news/bitcoin-and-select-altcoins-show-resilience-even-as-the-crypto-market-sell-off-continues\">facing bearish trends</a>, which have market capitalization down to its lowest level in over two months. </p><p>Though according to market analysts, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and other altcoins are still proving to be resilient despite the overall market climate. However, it's not only the market trends that still hold onto a bullish sentiment. </p><p>At the Bitcoin Prague 2023 conference, JAN3 CEO Samson Mow spoke with Cointelegraph about how he sees the current state of the Bitcoin market and why he’s bullish for the near- and long-term future. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/de94a52e-ed6d-4a0f-b35c-268a8857ee2d.jpg\"  /><figcaption style=\"text-align: center;\"><em>Cointelegraph reporter Joe Hall with JAN3 CEO Samson Mow. Source: Cointelegraph</em></figcaption></figure><p>In terms of price, Mow said that anything under 30K is “massively undervalued” and bound to make a rebound sometime soon. The last time BTC hit that price point was in April 2023, for the first time in ten months. </p><p>Nonetheless Mow said he’s not bearish at all and believes that BTC will hit six figures. </p><blockquote>“I'm bullish because everyone needs Bitcoin.”</blockquote><p>He pointed out this is becoming more apparent to the greater world as traditional financial systems continue to face turmoil.</p><blockquote>“The banking system is failing. The legacy financial system is failing. Money is not money anymore and stopped being money some time ago, payments can be frozen. Nothing works. Only Bitcoin works.”</blockquote><p>Mow told Cointelegraph, that he expects to see a wave of Bitcoin adoption within the next five years.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/btc-prague-2023-students-for-liberty-interview\"><strong><em>BTC Prague 2023: ‘Anyone can produce value in the Bitcoin ecosystem’</em></strong></a></p><p>In terms of the technology behind Bitcoin, Mow said, “there’s no more exciting time than now.” </p><blockquote>“We're seeing more people talking about new Bitcoin layers, new protocols, ARK - and I think liquid is getting more traction again.”</blockquote><p>“I think people are just now understanding that maybe we should look into liquid,” he said. “It's a very exciting time if you're paying attention to the technical part of Bitcoin, so pay attention, everyone.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T08:12:41.000Z",
    "title": "Markets anticipate rate hike ‘skip’ at FOMC meeting",
    "url": "https://cryptoslate.com/insights/markets-anticipate-rate-hike-skip-at-fomc-meeting/",
    "description": "<p>Quick Take The U.S. Consumer Price Index (CPI) report is due at 08:30 ET today and will influence the outcome of the FOMC meeting tomorrow. April&#8217;s year-over-year CPI came in at 4.9%. May&#8217;s is forecasted to come in at 4.0%. May&#8217;s year-over-year core CPI is forecasted to come in at 5.3%. This metric refers to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/markets-anticipate-rate-hike-skip-at-fomc-meeting/\">Markets anticipate rate hike &#8216;skip&#8217; at FOMC meeting</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-13T08:33:16.000Z",
    "title": "Highly Anticipated Chancer Crypto Presale Officially Launches Today",
    "url": "https://www.cryptoglobe.com/latest/2023/06/highly-anticipated-chancer-crypto-presale-officially-launches-today/",
    "description": "London, United Kingdom, June 13th, 2023, Chainwire Chancer, one of the most exciting new Web3 projects of 2023 has officially launched its crypto presale today, 13th June. The project aims to disrupt the betting industry by removing the ‘house’ from the picture and putting the markets firmly back in the hands of the bettors, allowing […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T08:29:32.000Z",
    "title": "LBank Lists Four New Tokens in a Week",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-lists-four-new-tokens-in-a-week",
    "description": "<p>Road Town, BVI, June 13th, 2023, Chainwire</p><p>Digital asset exchange LBank has revealed plans to list four new tokens in the space of a week, further expanding the range of cryptos available to its users. Each of the four assets was selected for listing based on specific criteria including diversity of category, community sentiment, roadmap, and novelty.</p><p>For the week starting on June 12, 2023, four new tokens will make their LBank debut. The first of these is $BPVC. Bored Pepe Vip Club is a collection of 10,000 Bored Pepe NFTs. These are unique digital collectibles living on the Ethereum blockchain. The project is complemented by a native $BPVC token which has now been listed on LBank.</p><p>The second token project to be approved for trading on LBank is $TXO, set to debut on June 13, 2023. The TXO protocol provides a blockchain interface to various platforms for collaboration and operation. This ecosystem includes a variety of platforms, from food services to product and lifestyle. It operates as a protocol business with established rules and rewards and is oriented towards transitioning from traditional platform businesses. This provides various rewards and conveniences to members and participants.</p><p>The third project whose token is listing on LBank is Aureus Nummus Gold. Its $ANG token is to be added on June 14, 2023. The Aureus Nummus Gold functions as a simple payments and savings tool. It supports small transactions for individuals and small businesses as well as large financial transactions for states, governments, or major corporations.</p><p>Finally, on June 15, $6PR will list on LBank Exchange. This memecoin, created for ardent Mortys and Mortettes, is inspired by the muscle-packed 6 Pack Rick. The token is designed for fans of the popular cartoon series and aims to inject some fun into trading by demonstrating that the $6PR community has the best memes.</p><p></p><p>For the week running from June 5-11, 2023, LBank listed a record 13 tokens including GLIVE, ADD, USP, FUNCH, and SWITCH. Of these, GLIVE recorded an impressive weekly gain of&nbsp; 7,394%, while another new asset, INU, rose by 40% and INEDIBLE climbed 147%. FUNCH, meanwhile, rose by almost 500% over the same period.&nbsp;</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute the global adoption of cryptocurrencies.</p><p>&nbsp;</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp; Telegram l Twitter l Facebook l LinkedIn l Instagram l YouTube&nbsp;</p><p></p><p></p><p></p>ContactLBK Blockchain Co. Limitedbusiness@lbank.info"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-13T08:30:05.000Z",
    "title": "Honduras Applies to Join BRICS Bank",
    "url": "https://news.bitcoin.com/honduras-applies-to-join-brics-bank/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Honduras Applies to Join BRICS Bank\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1328821109.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The government of Honduras has formally applied to become part of the New Development Bank, known as the BRICS bank, in an official visit of Honduran President Xiomara Castro to Shanghai. Honduras is now another country that has requested entry into the financial organization, alongside Argentina. Honduras Requests Entry to BRICS Bank The New Development [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T08:15:00.000Z",
    "title": "Binance.US counters SEC’s motion to freeze funds as it threatens its business",
    "url": "https://crypto.news/binance-us-counters-secs-motion-to-freeze-funds-as-it-threatens-its-business/",
    "description": "Binance.US has vehemently opposed the US Securities and Exchange Commission&#8217;s (SEC) proposed temporary restraining order, claiming that it would effectively end its business operations. The crypto exchange filed a response on June 12, criticizing the SEC&#8217;s emergency motion as &#8220;draconian&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T08:31:00.000Z",
    "title": "LBank Lists Four New Tokens in a Week",
    "url": "https://www.crypto-news-flash.com/lbank-lists-four-new-tokens-in-a-week/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-lists-four-new-tokens-in-a-week",
    "description": "Road Town, BVI, June 13th, 2023, Chainwire Digital asset exchange LBank has revealed plans to list four new tokens in the space of a week, further expanding the range of cryptos available to its users. Each of the four assets was selected for listing based on specific criteria including diversity of category, community sentiment, roadmap, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T08:15:12.000Z",
    "title": "Did Microsoft Just ConfirmOne-in-a-lifetime OpportunityWhy AI Is Here To Stay? InQubeta Presale I",
    "url": "https://www.crypto-news-flash.com/did-microsoft-just-confirmone-in-a-lifetime-opportunitywhy-ai-is-here-to-stay-inqubeta-presale-i/?utm_source=rss&utm_medium=rss&utm_campaign=did-microsoft-just-confirmone-in-a-lifetime-opportunitywhy-ai-is-here-to-stay-inqubeta-presale-i",
    "description": "Artificial Intelligence (AI) has been one of the most transformative technologies of the 21st century, revolutionizing various industries and reshaping how we live and work. As AI continues to evolve and expand its capabilities, its significance and potential for the future have become undeniable. The recent developments of the new AI-powered Microsoft Bing and Edge, [...]"
  }
]