[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T00:01:26.000Z",
    "title": "BRICS revolution: UAE and China announce mega trade shift using local currencies",
    "url": "https://www.cryptopolitan.com/uae-and-china-to-settle-trade-in-yuan/",
    "description": "The United Arab Emirates is looking for increased trade with China to become one of the global players. Both countries are trying to increase their cooperation by indulging in bilateral investments and cooperation to grow their presence in the Pacific Islands and Africa. The report further says that trade between the two countries will be [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T00:00:47.000Z",
    "title": "Polkadot Shows Bearish Signal, Analyst Predicts Drawdown To This Target",
    "url": "https://www.newsbtc.com/analysis/dot/polkadot-bearish-analyst-predicts-target/",
    "description": "A cryptocurrency analyst has explained how Polkadot could potentially see a decline to this level because of a sell signal in in its weekly price chart. Polkadot Weekly Price Has Formed A TD Sequential Sell Setup Recently In a new post on X, analyst Ali has pointed out that a TD Sequential sell signal has been forming for Polkadot recently. The &#8220;TD Sequential&#8221; refers to a tool in technical analysis that&#8217;s generally used for pinpointing likely points of reversal in any asset&#8217;s price. The indicator is made up of two phases. In the first phase, called the setup, candles of the same polarity are counted up to 9. After the ninth candle, a probable reversal in the price may be assumed to have taken place. Related Reading: Dogecoin In Demand: Data Shows DOGE Adoption Is Accelerating If the setup&#8217;s completion occurred with the overall trend being towards the up (that is, the nine candles were green), the asset might have hit a top. Similarly, a bottom could be in if the price had been going down. The second phase, known as the &#8220;countdown,&#8221; begins right after the setup&#8217;s completion and lasts for thirteen candles. At the end of these thirteen candles, another probable reversal in the asset could be assumed to have occurred. Recently, Polkadot&#8217;s weekly price has completed a TD Sequential phase of the former type, as the chart below shared by the analyst shows. Looks like the cryptocurrency has seen nine green candles in this setup &#124; Source: @ali_charts on X As is apparent from the graph, the Polkadot weekly price has finished the TD Sequential setup phase with green candles recently. This could suggest that a sell signal has now formed for the cryptocurrency. In the same chart, Ali has also displayed the data for the 100-day exponential moving average (EMA) for the asset, a level that has been a source of resistance in the past. Interestingly, this TD Sequential setup has completed just as the weekly price of the cryptocurrency has approached the 100-day EMA. &#8220;This could lead to a spike in profit-taking, potentially driving DOT down to $7.50,&#8221; explains the analyst. From the current spot price, a drawdown to this level would mean a drop of more than 18% for Polkadot. DOT Is Up Almost 3% During The Last 24 Hours While these bearish developments have occurred in the weekly price of DOT, the asset has still continued to rise during the past day, as its price has now cleared the $9.2 level. Related Reading: Bitcoin Whales Do $2.2 Billion Selloff, But BTC Stays Strong Below is a chart that shows how Polkadot has performed during the past month. The price of the asset seems to have shot up during this period &#124; Source: DOTUSD on TradingView The green returns during the last 24 hours are a continuation of the bullish momentum that DOT has enjoyed in the past week, a window inside which it&#8217;s now up almost 39%. Though the asset has been able to continue this run for now, the technical obstacles it&#8217;s facing in terms of the TD Sequential and 100-day EMA could mean that the top might be near for the coin. Featured image from Traxer on Unsplash.com, charts from TradingView.com"
  }
]