[
  {
    "source": "Crypto Daily",
    "date": "2024-01-28T15:04:06.000Z",
    "title": "Ethereum and Bitcoin lovers discover new cryptocurrency with similar potential currently priced at a mere $0.09",
    "url": "https://cryptodaily.co.uk/2024/01/ethereum-and-bitcoin-lovers-discover-new-cryptocurrency-with-similar-potential-currently-priced-at-a-mere-009",
    "description": "In the world of digital money, people who like and invest in cryptocurrencies are always searching for the next exciting idea that could change the market."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-28T14:54:48.000Z",
    "title": "Bitcoin (BTC) Correction Ends With Bullish Signal, Cardano (ADA) Set for Big Gains While Pullix (PLX) Draws Investors With Amazing Innovation",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-btc-correction-ends-with-bullish-signal-cardano-ada-set-for-big-gains-while-pullix-plx-draws-investors-with-amazing-innovation",
    "description": "After losing more than 15% of its value in two weeks, crypto analysts have spotted a bullish pattern for Bitcoin (BTC). Things could change in the coming weeks, as a bullish golden cross pattern has been spotted on the BTC chart."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-28T14:48:13.000Z",
    "title": "Best investment of 2024? Top analyst says Pushd (PUSHD) over the likes of Solana (SOL) and OKB (OKB)",
    "url": "https://cryptodaily.co.uk/2024/01/best-investment-of-2024-top-analyst-says-pushd-pushd-over-the-likes-of-solana-sol-and-okb-okb",
    "description": "As the cryptocurrency market continues to evolve, investors are carefully evaluating potential opportunities, s"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-28T15:05:19.000Z",
    "title": "XRP ledger sets new milestone with 5.02M active wallets",
    "url": "https://www.cryptopolitan.com/xrp-ledger-sets-new-milestone-with-5-02m/",
    "description": "The XRP Ledger, a blockchain network associated with the XRP cryptocurrency, has achieved a significant milestone with the number of active wallets on its network. According to blockchain analytics company Santiment, this development reflects a growing interest in XRP over the past few years. Rising interest in XRP XRP, a prominent cryptocurrency in the digital [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-28T14:50:23.000Z",
    "title": "PlayStation Plus Surprise Becomes a Sensation Among Gamers",
    "url": "https://www.cryptopolitan.com/playstation-plus-surprise-becomes/",
    "description": "PlayStation Plus subscribers are excited over a game they had never heard of before – Inscryption. This unexpected sensation has garnered praise and chef&#8217;s kisses from gamers who ventured into the unknown and discovered a delightful surprise.&#160; Despite being relatively under the radar, Inscryption has managed to capture the hearts of players and is being [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-28T14:48:48.000Z",
    "title": "FTX’s cash holdings soar as company sells off digital assets to repay customers",
    "url": "https://www.cryptopolitan.com/ftx-sells-off-digital-assets-repay-customers/",
    "description": "FTX, the cryptocurrency exchange that faced a tumultuous collapse in 2022, has been steadily unloading its crypto assets and accumulating cash reserves, according to a recent report by Bloomberg. This financial maneuver has caught the attention of industry experts and observers as FTX&#8217;s cash reserves nearly doubled by the end of 2023, surging from approximately [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-28T14:44:48.000Z",
    "title": "Overwatch 2 vs Valorant: A Comprehensive Comparison",
    "url": "https://www.cryptopolitan.com/overwatch-2-vs-valorant-a-comprehensive/",
    "description": "The battle between Overwatch 2 and Valorant has been ongoing for over four years, with both games having unique strengths and appeal. One of the key factors in determining which game is better is the player count.&#160; Overwatch, being the older game, has been around for several years. In contrast, Overwatch 2 was released in [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-28T15:00:00.000Z",
    "title": "Bitcoin falls after ETF approval; investors turn to Chainlink and NuggetRush",
    "url": "https://crypto.news/bitcoin-falls-after-etf-approval-investors-turn-to-chainlink-and-nuggetrush/",
    "description": "NuggetRush and Chainlink are floating higher despite Bitcoin prices crashing"
  }
]