[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-21T00:00:00.000Z",
    "title": "Incoming Sell-Off? Ethereum ICO Participant Moves $10 Million Worth of $ETH to Kraken After Appreciating 500,000%",
    "url": "https://www.cryptoglobe.com/latest/2023/09/incoming-sell-off-ethereum-ico-participant-moves-10-million-worth-of-eth-to-kraken-after-appreciating-500000/",
    "description": "An early Ethereum ($ETH) investor has moved a whopping 6,000 ETH, worth nearly %10 million, to popular cryptocurrency trading platform Kraken in a move that could lead to a significant sale of tokens on the market. According to popular cryptocurrency analysis service Lookonchain, the whale participated in Ethereum’s initial coin offering, where they purchased 254,908 […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T00:00:49.000Z",
    "title": "Whales Abandon Ship? Ethereum’s Value In Jeopardy As Major Holders Liquidate",
    "url": "https://www.newsbtc.com/news/ethereum/whales-abandon-ship-ethereums-value-in-jeopardy/",
    "description": "Ethereum (ETH), a significant player in the crypto space, has recently come under scrutiny due to some concerning on-chain activities. Notably, the number of addresses holding significant amounts of Ethereum has declined, and some long-term holders appear to be liquidating their positions, potentially posing threats to Ethereum&#8217;s value. Related Reading: Ethereum Path To $1,700 – Predictions For The Week Ahead Whale Watch: A Steep Decline In Ethereum Holdings On-chain analytics have been instrumental in offering real-time insights into crypto market trends. Recent revelations have highlighted a downturn in Ethereum&#8217;s holding patterns that might have deeper implications for the digital asset&#8217;s value and the market. According to Glassnode, a leading on-chain analytic platform, the number of addresses holding 1,000 Ethereum (ETH) coins or more has plummeted to a 5-year low. Precisely, these addresses, often termed &#8216;whale addresses&#8217; in the crypto world, have decreased to 6,082. Such a sharp decline can be attributed to the liquidation activities of some of Ethereum&#8217;s long-term holders. It is worth noting that this contraction in whale holdings could potentially increase the susceptibility of Ethereum to market bears, potentially initiating a downward price trajectory. The impact of such sales on the market is apparent. When large quantities of a cryptocurrency, such as Ethereum, are offloaded, it often leads to a considerable influx of selling pressure. This can cause panic among smaller investors, prompting further sales and possibly leading to a price drop. Additional Pressures From Dormant Wallets Interestingly, another layer adds to Ethereum&#8217;s selling pressure alongside the decrease in large-scale holdings. According to data from Lookonchain, a renowned on-chain data analysis firm, a dormant Ethereum wallet, untouched for around four years, has suddenly sprung into action. The wallet in question liquidated its entire ETH holding, quickly pushing roughly $4.81 million worth of the altcoin into the market. A wallet that had been dormant for 4 years sold all 2,591 $ETH for $4.18M stablecoins 6 hours ago.https://t.co/et78rXHG5u pic.twitter.com/pJanMLxwA3 — Lookonchain (@lookonchain) September 20, 2023 Such unexpected sales from long-inactive wallets could raise alarms in the market. While the exact reasons behind such liquidations often remain concealed, they invariably amplify the selling pressures on the affected cryptocurrency, which, in this case, is Ethereum. Related Reading: Ethereum-Based Balancer Under Attack, Users Receive Warning Meanwhile, Ethereum&#8217;s price has seen a slight bullish trajectory over the past week, up 1.4%. The asset has moved from a low of $1,596 seen last Wednesday to trade above $1,650 on Monday before retracing to $1,626, at the time of writing down by 1.8% in the past 24 hours. Featured image from Unpslah, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T00:00:16.000Z",
    "title": "Here’s What’s in Store for XRP, Chainlink and One Low-Cap Altcoin, According to Analyst",
    "url": "https://dailyhodl.com/2023/09/20/heres-whats-in-store-for-xrp-chainlink-and-one-low-cap-altcoin-according-to-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/stoe-xrp-one-low.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist is outlining what&#8217;s on the horizon for XRP, Chainlink (LINK) and one controversial new altcoin. Looking at the cross-border payments solution first, analyst Michaël van de Poppe tells his 667,200 followers on the social media platform X that he&#8217;s waiting for XRP to flash signs of strength. &#8220;Full retrace on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/heres-whats-in-store-for-xrp-chainlink-and-one-low-cap-altcoin-according-to-analyst/\">Here’s What’s in Store for XRP, Chainlink and One Low-Cap Altcoin, According to Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]