[
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T14:16:06.000Z",
    "title": "Why is Bitcoin is holding strong in spite of the SEC’s regulatory crackdown?",
    "url": "https://cryptoslate.com/why-is-bitcoin-is-holding-strong-in-spite-of-the-secs-regulatory-crackdown/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) sued Binance and Coinbase earlier this week, introducing considerable volatility into the crypto market. Bitcoin reacted strongly to these events — on June 5, it dropped from $27,300 to $25,300, a 7.3% decrease. This sharp dip incited concern among investors, as the legal uncertainty raised the possibility of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/why-is-bitcoin-is-holding-strong-in-spite-of-the-secs-regulatory-crackdown/\">Why is Bitcoin is holding strong in spite of the SEC&#8217;s regulatory crackdown?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T14:15:00.000Z",
    "title": "World Mobile Plans Major African Expansion of Its DeWi Service",
    "url": "https://cryptodaily.co.uk/2023/06/world-mobile-plans-major-african-expansion-of-its-dewi-service",
    "description": "<p>Source: Depositphotos</p>\n<p>Decentralized wireless (DeWi) operator World Mobile has announced a major expansion to its African network coverage following successful field trials. The company, whose decentralized network forms part of the sharing economy, has been conducting tests in Kenya, Mozambique, and Nigeria ahead of a broader rollout across the African continent.</p>\n<p>&nbsp;</p>\nWorld Mobile Does DeWi\n<p>For the past few months, World Mobile has been on a mission to convince Africans to trial its cellular data service. Its message is simple: World Mobile can provide data significantly cheaper than incumbent carriers and provide better coverage, particularly in rural areas where residents can struggle to get a signal.</p>\n<p>World Mobile&rsquo;s ultimate goal is to create a community-owned wireless network that spans the globe, with users incentivized to provision spare bandwidth. To get its African service up and running, however, the company has utilized TV White Space equipment. This taps into unused spectrum in the TV broadcast band, harnessing it to deliver mobile network services. To further boost bandwidth, World Mobile also utilized Starlink, the satellite internet constellation operated by SpaceX.</p>\n\n<p>According to World Mobile CEO Micky Watkins, &ldquo;The successful completion of field tests in Kenya, Mozambique, and Nigeria, mark a significant milestone in World Mobile's mission to connect the unconnected. These tests validate the feasibility and scalability of our DeWi technology, bringing us one step closer to providing affordable and reliable internet access to both rural and underserved areas worldwide.&rdquo;</p>\n\n<p>&nbsp;</p>\nFrom Zanzibar to India and Beyond\n<p>World Mobile has been steadily rolling out its services to select territories with a view to gauging demand and ensuring its network can scale to match demand. Last month, the company launched its commercial service in Zanzibar, having completed successful trials in the East African island cluster that saw 16,000 users sign up.</p>\n<p>Meanwhile, the company has announced its intention to perform periodic buybacks of its WMT token. The token is used to reward participants in World Mobile&rsquo;s sharing economy and support adoption of its mobile solutions. Ultimately, World Mobile aims to forge an inclusive mobile ecosystem in which users can earn revenue while retaining a degree of ownership over network infrastructure and data.</p>\n<p>Within the radical decentralized mobile economy World Mobile is building, individuals and businesses are encouraged to operate nodes on the network. This helps provide greater network coverage while rewarding operators for their efforts.</p>\n<p>While Africa has formed the focus of World Mobile&rsquo;s strategy for much of 2023, there are plans to gain a foothold in other key regions including India. Tellingly, the company recently announced the appointment of Manoj Kohli as an advisor. As the former country head of SoftBank India and CEO of Bharti Airtel, Kohli&rsquo;s telecoms expertise will be pivotal in realizing this goal.</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T14:14:06.000Z",
    "title": "Gamestop fires CEO Matt Furlong, Ryan Cohen takes the helm as executive chairman",
    "url": "https://www.cryptopolitan.com/gamestop-fires-ceo-matt-furlong-ryan-cohen/",
    "description": "GameStop, the video game retailer that became a focal point of the &#8220;meme stock rally&#8221; in 2021, has announced the termination of CEO Matt Furlong and the appointment of Ryan Cohen as its new executive chairman. The sudden shakeup comes alongside the release of the company&#8217;s first-quarter financial results, which reveal a decline in revenue ... <a title=\"Gamestop fires CEO Matt Furlong, Ryan Cohen takes the helm as executive chairman\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gamestop-fires-ceo-matt-furlong-ryan-cohen/\" aria-label=\"More on Gamestop fires CEO Matt Furlong, Ryan Cohen takes the helm as executive chairman\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T14:24:09.000Z",
    "title": "Dogecoin Takes a Dive as SEC Rulings Shake Coinbase and Binance: Is This a 10x Investment Opportunity for DOGE? Report",
    "url": "https://www.crypto-news-flash.com/dogecoin-takes-a-dive-as-sec-rulings-shake-coinbase-and-binance-is-this-a-10x-investment-opportunity-for-doge-report/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-takes-a-dive-as-sec-rulings-shake-coinbase-and-binance-is-this-a-10x-investment-opportunity-for-doge-report",
    "description": "<p>Dogecoin has sustained bearish slumps following the crackdowns on Binance and Coinbase. While not named security, the potential for future growth remains high. Things are not looking so great for Elon Musk-linked memecoin Dogecoin (DOGE), especially after the Securities and Exchange Commission (SEC) focused its crypto crackdown on Binance and Coinbase. Compared to its closing [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-takes-a-dive-as-sec-rulings-shake-coinbase-and-binance-is-this-a-10x-investment-opportunity-for-doge-report/\">Dogecoin Takes a Dive as SEC Rulings Shake Coinbase and Binance: Is This a 10x Investment Opportunity for DOGE? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T14:23:38.000Z",
    "title": "Cardano and Charles Hoskinson Challenge SEC: ADA’s Not a Security in US, Exposing SEC and Gary Gensler’s Inaccuracy",
    "url": "https://www.crypto-news-flash.com/cardano-and-charles-hoskinson-challenge-sec-adas-not-a-security-in-us-exposing-sec-and-gary-genslers-inaccuracy/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-and-charles-hoskinson-challenge-sec-adas-not-a-security-in-us-exposing-sec-and-gary-genslers-inaccuracy",
    "description": "<p>Charles Hoskinson has responded to the SEC&#8217;s claim that Cardano&#8217;s native token ADA is a security, exposing the SEC. IOG notes that the claim by the SEC contains numerous factual inaccuracies and will not impact the company&#8217;s operations in any way. After a landmark case was brought against two of the largest crypto exchanges in [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cardano-and-charles-hoskinson-challenge-sec-adas-not-a-security-in-us-exposing-sec-and-gary-genslers-inaccuracy/\">Cardano and Charles Hoskinson Challenge SEC: ADA&#8217;s Not a Security in US, Exposing SEC and Gary Gensler&#8217;s Inaccuracy</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T14:20:00.000Z",
    "title": "U.S. Government Objects to Bittrex’s Plan for Customer Repayment",
    "url": "https://coinedition.com/u-s-government-objects-to-bittrexs-plan-for-customer-repayment/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/U.S.-Government-Objects-to-Bittrex-Customer-Repayment-Plan-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/U.S.-Government-Objects-to-Bittrex-Customer-Repayment-Plan-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/U.S.-Government-Objects-to-Bittrex-Customer-Repayment-Plan-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/U.S.-Government-Objects-to-Bittrex-Customer-Repayment-Plan.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The U.S. has lodged a legal challenge against a proposal made by bankrupt crypto exchange Bittrex for the return of customer funds and cryptocurrencies. The U.S. government claims that it is still owed millions of dollars by Bittrex for violations related to sanctions. This challenge was revealed in a court filing on Wednesday. Siloing creditors [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/u-s-government-objects-to-bittrexs-plan-for-customer-repayment/\">U.S. Government Objects to Bittrex&#8217;s Plan for Customer Repayment</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T14:30:29.000Z",
    "title": "Major Move Coming for Bitcoin (BTC) As Market Forms Bullish Pattern: Glassnode Co-Founder",
    "url": "https://dailyhodl.com/2023/06/08/major-move-coming-for-bitcoin-btc-as-market-forms-bullish-pattern-glassnode-co-founder/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Move-Coming-for-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto analytics firm Glassnode co-founder says Bitcoin (BTC) is gearing up for a bull run after a dip down. Pseudonymous crypto analyst Negentropic, one of Glassnode’s co-founders, tells his 55,200 Twitter followers that after Bitcoin’s plunge to the $25,000 level the king crypto is likely setting up for a rally. He shares a chart [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/major-move-coming-for-bitcoin-btc-as-market-forms-bullish-pattern-glassnode-co-founder/\">Major Move Coming for Bitcoin (BTC) As Market Forms Bullish Pattern: Glassnode Co-Founder</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]