[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T17:59:45.000Z",
    "title": "Cardano blockchain network breaks new ground with revolutionary AI chatbot Girolamo",
    "url": "https://www.cryptopolitan.com/cardano-revolutionary-ai-chatbot-girolamo/",
    "description": "Cardano, a leading blockchain platform, has unveiled Girolamo, its first internet-generative chatbot, signaling a major advancement in the intersection of blockchain technology and artificial intelligence (AI). This beta launch of Girolamo, named after the Italian mathematician Girolamo Cardano, marks a significant evolution in Cardano’s journey in AI. Girolamo: A new frontier in AI and blockchain ... <a title=\"Cardano blockchain network breaks new ground with revolutionary AI chatbot Girolamo\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-revolutionary-ai-chatbot-girolamo/\" aria-label=\"More on Cardano blockchain network breaks new ground with revolutionary AI chatbot Girolamo\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T17:53:47.000Z",
    "title": "Ripple whales move $30 million to exchanges. How low will XRP drop?",
    "url": "https://www.cryptopolitan.com/ripple-whales-move-30m-how-low-will-xrp-drop/",
    "description": "Ripple has been in an aggressive legal battle with the United States Securities and Exchanges Commission (SEC) and has recorded partial wins in the court hearings. The XRP parent company has been in the spotlight amid recent developments in the case, and investors have been undecided on their stand, some believing it is intended to ... <a title=\"Ripple whales move $30 million to exchanges. How low will XRP drop?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-whales-move-30m-how-low-will-xrp-drop/\" aria-label=\"More on Ripple whales move $30 million to exchanges. How low will XRP drop?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T17:49:24.000Z",
    "title": "The Esports Revolution",
    "url": "https://www.cryptopolitan.com/the-esports-revolution/",
    "description": "Esports, the competitive world of video gaming, has undergone a transformative journey, evolving from a casual pastime into a multi-billion-dollar industry. Major media networks and traditional sports leagues have eagerly embraced Esports, recognizing its immense potential. Moreover, educational institutions have joined the fray, with over 600 colleges and high schools offering varsity teams and scholarships ... <a title=\"The Esports Revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-esports-revolution/\" aria-label=\"More on The Esports Revolution\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-25T17:40:38.000Z",
    "title": "Bitcoin Spot ETF Will Bring $70 Billion In New Money To Trigger Price Rally – Glassnode",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-70-billion/",
    "description": "Blockchain analytics firm Glassnode has estimated a substantial influx of investor demand following the approval of Bitcoin Spot ETF. The analysis indicates around $70 billion in new money flowing into Bitcoin, potentially setting the stage for a BTC price rally.  Bitcoin Spot ETF Set To Ignite New Inflows Blockchain data and intelligence provider, Glassnode has recently published research insights on the potential impacts of Bitcoin Spot ETF approvals on the price of Bitcoin and the broader crypto market. The on-chain analytics company has predicted about $70.5 billion flowing into Bitcoin from increased demand from institutional investors.  Related Reading: Crypto Fund Exits BLUR For Lido And IMX—Endorsing DeFi? Glassnode bases its analysis on the assumption that substantial portions of capital invested in the stocks, bonds, and gold market might shift toward Bitcoin investments. The blockchain analytics firm has stated that this influx of new capital could have a huge effect on the Bitcoin market, potentially driving its price to greater levels.  “Based on these assumptions, we estimate approximately $60.6 billion could flow into Bitcoin from the combined stock and bond ETFs, and about $9.9 billion from the gold market, totaling around $70.5 billion in potential new capital influx,” Glassnode stated.  It added: “This significant infusion of new capital could have a considerable impact on Bitcoin&#8217;s market, potentially driving up its price as it gains broader acceptance and becomes integrated into more traditional investment portfolios.” Bitcoin Futures And Altcoins Soar On BTC ETF Hype  Glassnode has extended its analysis to examine how Spot Bitcoin ETF applications are influencing Chicago Mercantile Exchange (CME) Bitcoin futures and various altcoins.  The blockchain analytics firm has stated that the recent crypto market recovery has been driven by the surrounding anticipation of Spot Bitcoin ETF potential approval by the United States Securities and Exchange Commission (SEC).  Bitcoin (BTC) is currently trading at $37.696. Chart: TradingView.com “The market&#8217;s upward trajectory was largely driven by the anticipation of Spot BTC ETF approvals, with market movements significantly influenced by updates on filings from major financial entities like Invesco and BlackRock,” Glassnode stated.  The on-chain analysis firm revealed that the growing optimism in Spot Bitcoin ETFs has caused a notable increase in Bitcoin futures on CME. According to the blockchain intelligence provider, CME Bitcoin futures rose to an all-time high of 27.8%, exceeding Binance for the first time since the start of the crypto bear market.  Various other altcoins like Ethereum and Solana also experienced staggering price increases. Solana surged by 79.05%, and Ethereum’s price is presently above the $2000 mark.  Related Reading: Bitcoin Price Rockets Past $38,000, Hits Highest Peak Since May 2022 – Details The most notable increase caused by the ongoing hype on Spot Bitcoin ETFs was seen in Bitcoin. BTC surged above $37,000 as the optimism of regulator approvals for the first Spot Bitcoin ETF spread.  Additionally, institutional engagement in open interest in Bitcoin call options also rose by $4.3 billion, marking an 80% increase to surpass $9.7 billion. These recent spikes in investor demand and crypto prices have signaled a potential bullish trajectory for the maturing crypto market.  Featured image from Pexels"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-25T17:55:57.000Z",
    "title": "Terra (LUNA) Founder Do Kwon’s Extradition to the US and South Korea Approved by Montenegro Court",
    "url": "https://dailyhodl.com/2023/11/25/terra-luna-founder-do-kwons-extradition-to-the-us-and-south-korea-approved-by-montenegro-court/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/to-the-us-south.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The extradition of disgraced Terra (LUNA) founder Do Kwon to the US and South Korea has been approved by a court in Montenegro. In a new press release, the Higher Court of Podgorica has ruled that the legal requirements needed for extraditing Kwon to the US and South Korea have been met. “It was established [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/25/terra-luna-founder-do-kwons-extradition-to-the-us-and-south-korea-approved-by-montenegro-court/\">Terra (LUNA) Founder Do Kwon’s Extradition to the US and South Korea Approved by Montenegro Court</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]