[
  {
    "source": "Bitcoin.com",
    "date": "2024-02-21T03:00:50.000Z",
    "title": "Coinbase CEO: Every Institution Is Now Starting to Hold Crypto",
    "url": "https://news.bitcoin.com/coinbase-ceo-every-institution-is-now-starting-to-hold-crypto/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase CEO: Every Institution Is Now Starting to Hold Crypto\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/coinbase-earnings.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Coinbase CEO Brian Armstrong says &#x201C;every institution is now starting to hold crypto,&#x201D; emphasizing that &#x201C;the asset class will be a standard part of every diversified portfolio.&#x201D; Moreover, the executive noted that institutions will eventually be using crypto in other ways, such as &#x201C;holding it on their balance sheet, paying their vendors, [and] doing payroll.&#x201D; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T02:43:40.000Z",
    "title": "Meta’s Zuckerberg Set to Confer with Samsung Chief in South Korea Over AI Innovations",
    "url": "https://www.cryptopolitan.com/metas-zuckerberg-confer-samsung-chief-ai/",
    "description": "In a strategic maneuver underscoring the burgeoning significance of artificial intelligence (AI) on a global scale, Meta&#8217;s Chief Executive Officer Mark Zuckerberg is slated to embark on a pivotal journey to South Korea. Set to convene with Samsung Electronics chairman Jay Y Lee, the agenda for this high-profile encounter is conspicuously anchored on the transformative [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T02:39:41.000Z",
    "title": "Ethereum surpasses $3k for the first time in 2 years",
    "url": "https://www.cryptopolitan.com/ethereum-surpasses-3k-first-time-in-2-years/",
    "description": "Ethereum has blasted past the $3,000 mark as of February 20, marking a significant milestone not seen since April 2022. This achievement highlights a strong uptick in the cryptocurrency&#8217;s valuation, with ETH&#8217;s price escalating from $2,881 just a day earlier. The surge also amounts to an impressive 4% increase within a mere 24 hours and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T03:07:04.000Z",
    "title": "Bitcoin Price Sits In Range With Sharp Moves, $50K Is The Key",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-range-50k-key/",
    "description": "Bitcoin price spiked toward the $53,200 resistance. BTC is trading in a major range and still holding gains above the $50,000 support zone. Bitcoin price is struggling to clear the $52,500 resistance zone. The price is trading below $52,400 and the 100 hourly Simple moving average. There is a connecting bearish trend line forming with resistance at $52,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could dip toward the $51,600 support before it attempts a fresh increase. Bitcoin Price Holds Ground Bitcoin price made another attempt to gain strength above the $52,200 resistance zone. BTC broke the $52,500 level and even spiked above $52,800. However, the bears were active near the $53,000 level. A new multi-week high was formed near $52,991 and the price dived toward $50,500. A low was formed at $50,663 and the price is now attempting a fresh increase. There was a move above the $51,600 level. The price climbed above the 50% Fib retracement level of the downward move from the $52,991 swing high to the $50,663 low. Bitcoin is now trading below $52,400 and the 100 hourly Simple moving average. There is also a connecting bearish trend line forming with resistance at $52,300 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $52,200 level. The next key resistance could be $52,400 or the trend line or the 76.4% Fib retracement level of the downward move from the $52,991 swing high to the $50,663 low, above which the price could rise toward the $52,800 resistance zone. Source: BTCUSD on TradingView.com The main resistance is now near the $53,000 level. A clear move above the $53,000 resistance could send the price toward the $53,500 resistance. The next resistance could be near the $54,200 level. Another Drop In BTC? If Bitcoin fails to rise above the $52,400 resistance zone, it could start another decline in the near term. Immediate support on the downside is near the $51,600 level. The first major support is $51,200. If there is a close below $51,200, the price could gain bearish momentum. In the stated case, the price could decline toward the $50,500 support zone, below which the price might turn bearish in the short term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $51,600, followed by $51,200. Major Resistance Levels – $52,200, $52,400, and $52,800."
  }
]