[
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T01:02:35.000Z",
    "title": "Cathie Wood ‘very positive’ on Coinbase after Ripple court ruling",
    "url": "https://cointelegraph.com/news/cathie-wood-positive-coinbase-shares-ripple-sec-ruling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/9dac7744-9d7e-489f-b9cd-4a9f4535ee3f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Ark Invest CEO said the recent Ripple court ruling is a major win for crypto exchanges.</p>\n                    <p><p>Cathie Wood, the founder and CEO of ARK Investment Management, said she remains “very positive” on Coinbase in light of Ripple’s <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">partial victory over the Securities and Exchange Commission</a> on July 13. </p><p>While Wood noted the ruling wasn’t <a href=\"https://cointelegraph.com/news/ripple-decision-is-troublesome-on-multiple-fronts-says-former-sec-official\">in outright favor of Ripple</a>, she lauded the outcome as “by and large, very positive for [crypto] exchanges.”</p><p>Wood joins the ranks of crypto industry pundits <a href=\"https://cointelegraph.com/news/xrp-holders-celebrate-ripple-win-victory-sec-case\">who have made similar points</a>, arguing that the ruling — which found that XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) tokens sold to retail investors on crypto exchanges were not securities — could set a positive precedent <a href=\"https://cointelegraph.com/news/sec-targeting-coinbase-binance-proxies-crypto\">for Coinbase and Binance</a> in their respective legal battles with the regulator. </p><p>Wood explained that despite the crypto exchange <a href=\"https://cointelegraph.com/news/coinbase-could-face-sec-enforcement-action-for-potential-violations-of-securities-law\">receiving a Wells Notice</a> in March and being hammered by a <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">lawsuit from the SEC</a> in June, the share price never fell to new lows, suggesting a robustness in the value of Coinbase stock. </p><p>On July 11, Wood’s flagship fund, the ARK Innovation exchange traded fund (ETF) <a href=\"https://cointelegraph.com/news/coinbase-ark-invest-cathie-wood-sells-135k-coinbase-shares-as-coin-hits-90\">cashed in on the crypto exchange’s</a> impressive rally, selling 135,152 Coinbase shares, worth $12 million at the time. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f5d32c15-2466-4b84-a243-e1b4711826f1.png\"  /><figcaption style=\"text-align: center;\"><em>Coinbase share price year-to-date. Source: TradingView</em></figcaption></figure><p>Coinbase began 2023 trading at just $33.60 a share. At the time of publication shares of COIN have surged more than 184% since then to reach a price of $105.55 according to data from TradingView. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-crypto-startup-in-q2-galaxy-digital\"><strong><em>US ‘dominates’ crypto startup funding in Q2: Report</em></strong></a></p><p>While many industry players are turning increasingly bullish on Coinbase, analysts from investment firm Berenberg Capital Markets warned that many aspects of regulation for crypto exchanges are far from being resolved. </p><p>In a July 17 investment note seen by Cointelegraph lead analyst Mark Palmer said that Coinbase Earn — a financial product that offers yield on crypto staking — appears “particularly vulnerable” to being defined as a security in light of the comments made by Judge Torres in her ruling on the Ripple case. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T01:05:17.000Z",
    "title": "Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla",
    "url": "https://cryptoslate.com/elizabeth-warren-asks-sec-to-investigate-elon-musks-dual-roles-at-twitter-and-tesla/",
    "description": "<p>On July 17, Senator Elizabeth Warren called on the U.S. Securities and Exchange Commission (SEC) to initiate investigations into two companies led by Elon Musk, namely Tesla and Twitter, due to potential legal and ethical issues Warren began by reiterating concerns that she sent to Tesla in December 2022, all of which concern Musk&#8217;s dual leadership [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elizabeth-warren-asks-sec-to-investigate-elon-musks-dual-roles-at-twitter-and-tesla/\">Elizabeth Warren asks SEC to investigate Elon Musk&#8217;s dual roles at Twitter and Tesla</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-18T00:40:00.000Z",
    "title": "$SHIB: Shibarium’s Testnet Puppynet Surpasses 30 Million Transaction Milestone",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shib-shibariums-testnet-puppynet-surpasses-30-million-transaction-milestone/",
    "description": "The native test network of Shiba Inu’s layer-2 Shibarium, fondly called Puppynet, has recorded an impressive tally of over 30 million transactions, emanating from an estimated 17 million wallets. This notable achievement signals the network’s steady march towards a broader release slated for the forthcoming months. Puppynet is Shibarium’s testnet, meaning a blockchain network tailored […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T01:00:53.000Z",
    "title": "USDC Market Cap Drops As Redemptions Climb To $1.4 Billion",
    "url": "https://www.newsbtc.com/stablecoin/usdc-market-cap-drops-as-1-4-billion/",
    "description": "As one of the biggest stablecoins, USDC is one of the major players in the crypto industry. However, the stablecoins have seen better days, as the stablecoin has seen its market cap drop drastically over the past few months. Related Reading: 29% Of Bitcoin’s Circulating Supply Is Now Presumed Lost Forever The second-largest stablecoin has seen its market cap drop by over $1.4 billion in just the last few days thanks to a surge in redemptions.  $1.4 Billion Redeemed In One Week The stablecoin market was rocked this week by a massive redemption of USDC. According to Circle and data obtained from Coinmarketcap, the supply of USDC decreased by $1.4 billion in just seven days as Circle&#8217;s rate of token burning outnumbered the rate of new token creations. This led to a market cap drop from $27.4 billion to $26.9 billion in a 7-day timeframe. This comes as the overall supply of USDC has been on a steep decline since the beginning of the year, plummeting from $45 billion to its present level of $26 billion. The worst drop in USDC’s market cap this year came during the height of Silicon Valley Bank&#8217;s shutdown.  USDC market cap plunges &#124; Source: Glassnode According to Nansen, Circle burned $1.6 billion in USDC in a single day. During this period, Circle’s market cap fell by more than $10 billion. This came as investors rushed to redeem USDC due to Circle having cash reserves in the failed bank. What Does This Mean For USDC? The rush to redeem USDC over the course of the past year has prompted doubts about the reserves underpinning the stablecoin. But the stablecoin market appears to be doing just fine in terms of maintaining its peg to the US dollar. Circle also maintains that the USDC cryptocurrency is backed 1:1 by cash and other monetary equivalents.  USDC market cap sitting at $27.25 billion &#124; Source: Market Cap USDC on Tradingview.com In March of this year, Circle switched to short-term maturity bonds. This means that the USDC reserve is now held 80% in short-dated US treasuries and 20% in cash deposits within the US banking system. Given this, there are worries among investors as redemptions at this scale could strain the reserves if they’re invested in less liquid assets. This would explain the high volume of redemptions over this time. Related Reading: XRP Crosses 1 Million Trades Per Minute Following Court Ruling The cryptocurrency market is known for its volatility, but stablecoins have become one of the backbones of the industry due to their ability to offer more stability. Overall, most of the stablecoin market remains split between USDT and USDC, making up more than 83% of the total stablecoin market cap.  For now, USDT has the higher momentum. While USDC’s market cap has slipped throughout the year, data shows USDT has added over $15 billion to its market cap. Featured image from Cryptonomist, chart from Tradingview.com"
  }
]