[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T13:30:51.000Z",
    "title": "Coinbase VP says Canada can be a ‘global leader’ in crypto  ",
    "url": "https://cointelegraph.com/news/coinbase-vp-says-canada-can-be-a-global-leader-in-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3b08e650-78f7-4198-863b-5ac4ba31f1a3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The cryptocurrency exchange Coinbase officially launched in Canada in August 2023 and is expanding its service offerings amid a promising local crypto climate. </p>\n                    <p><p>The cryptocurrency exchange Coinbase <a href=\"https://investor.coinbase.com/news/news-details/2023/Coinbase-Accelerates-International-Expansion-with-Official-Launch-in-Canada/default.aspx#:~:text=Through%20its%20partnership%20with%20Peoples,and%20out%20of%20your%20account\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> an expansion of its services offered to Canadian users on Aug. 14 through a partnership with the local financial services company Peoples Trust Company. </p><p>Coinbase integrated the option for 100% of its users to deposit and withdraw money from their accounts via the Interac e-Transfers service. According to the exchange, this feature was the most requested update from Canadian users, post-launch in the country earlier this month. </p><p>Nana Murugesan, the vice president for international and business development at Coinbase, commented on Canada’s appeal in the crypto industry due to its level of awareness: </p><blockquote>“Canada is well positioned to be a global leader in the crypto-economy thanks to the high levels of crypto awareness, a passionate local tech ecosystem, and the progress towards a strong regulatory framework.”</blockquote><p>The exchange also said it sees the Canadian market as its next “Go Deep Market,” and cited a <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.osc.ca%2Fen%2Fnews-events%2Fnews%2Fosc-survey-explores-canadians-crypto-ownership-and-knowledge&amp;esheet=53527249&amp;newsitemid=20230814475027&amp;lan=en-US&amp;anchor=Ontario+Securities+Commission&amp;index=1&amp;md5=8c175e08a93695b29ed6700be1ac623c\" target=\"_blank\" rel=\"noopener nofollow\">survey</a> from the Ontario Securities Commission that claims more than 30% of Canadians said they’ll buy crypto within the year. </p><p>Coinbase’s entrance into the Canadian crypto market comes after both <a href=\"https://cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules#:~:text=Binance%20will%20withdraw%20from%20the,on%20the%20country's%20crypto%20industry.\">crypto exchanges Binance</a> and ByBit left the country due to <a href=\"https://cointelegraph.com/news/crypto-exchange-bybit-exits-canada-citing-recent-regulatory-development#:~:text=Cryptocurrency%20exchange%20Bybit%20has%20announced,Canadians%20starting%20on%20May%2031.\">tightening regulations</a> from local leaders. </p><p>The Canadian Securities Administrators (CSA) introduced regulations that mandated cryptocurrency exchanges to sign on to many terms and conditions while their applications were still under review. According to a Bloomberg <a href=\"https://www.bnnbloomberg.ca/coinbase-ceo-says-canadian-crypto-regulations-encouraging-1.1958663\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, Coinbase was one of 11 exchanges that signed onto pre-clearance rules back in March. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/coinbase-earnings-show-the-company-is-now-much-more-than-just-an-exchange\"><strong><em>Coinbase earnings show the company is now much more than just an exchange</em></strong></a></p><p>Coinbase’s expansion into Canada comes as the exchange <a href=\"https://cointelegraph.com/news/coinbase-gains-legal-support-as-scholars-file-amicus-brief\">continues to fight legal battles</a> with legislators in the United States. </p><p>On Aug. 4 the company filed an order <a href=\"https://cointelegraph.com/news/coinbase-to-file-order-seeking-dismissal-of-sec-lawsuit\">seeking a dismissal</a> of its ongoing lawsuit with the U.S. Securities and Exchange Commission. </p><p>Despite the company’s legal troubles in the U.S., its CEO Brian Armstrong is quoted saying on Aug. 4 that<a href=\"https://cointelegraph.com/news/coinbase-ceo-leaving-usa-not-realm-possibility-right-now\"> a departure from the country</a> is “not even in the realm of possibility right now.” </p><p>However, Armstrong has also <a href=\"https://cointelegraph.com/news/coinbase-may-face-years-long-court-battle-with-sec-ceo-warns-report\">previously mentioned</a> relocating Coinbase headquarters outside of the U.S. for a more crypto-friendly regulatory environment. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T13:23:20.000Z",
    "title": "Metaverse project The Sandbox unlocks $133M worth of tokens ",
    "url": "https://cointelegraph.com/news/metaverse-project-the-sandbox-unlocks-133m-worth-of-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8b35812b-50fd-4b8b-988f-afbc541401d5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The next batch of token unlocks for The Sandbox is on Feb. 14, 2024, and will unfreeze over 200 million SAND for its team, company reserve and advisors. </p>\n                    <p><p>Metaverse platform The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>) has unlocked a total of 332 million SAND tokens, which is around 16% of the digital asset’s current circulating supply. The unlocked tokens are worth around $133 million at the time of the unlock. </p><p>On Aug. 14, The Sandbox proceeded with its scheduled unlock for over 300 million tokens. According to the vesting schedule tracker Token Unlocks, The Sandbox <a href=\"https://token.unlocks.app/the-sandbox\" target=\"_blank\" rel=\"noopener nofollow\">unlocked</a> 71 million for its team, 37.5 million for its advisors, 96.8 million for its company reserve, 24 million for its strategic sale buyers and almost 103 million tokens for its seed sale participants. Each of these holders are now able to trade their tokens into the open market. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e301b15e-6289-4d62-a92c-4993380542fc.png\"  /><figcaption style=\"text-align: center;\"><em>Unlock progress for The Sandbox token. Source: Token Unlocks</em></figcaption></figure><p>A token unlock is normally very bearish for digital asset prices, as it unfreezes liquidity and injects it into the open market. The SAND token has been on a bearish trend since 30 days ahead of the unlock. </p><p>On July 15, the token hovered around $0.45. The price then dropped to $0.39 at the time of writing. Currently, SAND’s 24-hour trading volume sits at $106 million according to coin information website CoinGecko. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/93a0f5f1-c3a2-4167-b19a-255afcf5959d.png\"  /><figcaption style=\"text-align: center;\"><em>30-day price chart for The Sandbox token. Source: CoinGecko</em></figcaption></figure><p>The schedule for the next batch of unlocks for SAND tokens is on Feb. 14, 2024. By that time, around 205 million tokens will be unfrozen and allocated to its team, company reserve and advisors. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/wintermute-moves-over-4m-in-optimism-to-binance-ahead-of-token-unlock\"><strong><em>Wintermute moves over $4M of Optimism tokens to Binance ahead of OP unlock</em></strong></a></p><p>Meanwhile, The Sandbox has consistently been onboarding various players into the metaverse. On July 28, the company partnered with the British Museum in an effort to make artifacts within the museum's collection more accessible to the public. The partnership allows The Sandbox players to learn about history, art and culture through the museum. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-mark-zuckerbergs-metaverse-losses-nft-game-discord-gods-unchained-hot-take/\"><strong><em>Web3 Gamer: Zuckerberg’s metaverse losses, NFT game on Discord, Gods Unchained hot take</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T13:21:00.000Z",
    "title": "Crypto adoption crosses party lines amid Washington’s political deadlock",
    "url": "https://cointelegraph.com/news/crypto-adoption-political-deadlock-usa",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/99c178b5-b63c-4951-a896-7d52fc444bfb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Support for crypto among United States politicians and voters appears to be crossing party lines with bipartisanship agreements.  </p>\n                    <p><p>Crypto’s legitimacy and adoption have increased in recent years, and along with the uptick in use, the tech has become a <a href=\"https://cointelegraph.com/news/bipartisan-support-crypto-regulation-attractive-to-firms-moodys\">topic of political divisiveness</a>, resulting in a <a href=\"https://cointelegraph.com/news/crypto-cannot-be-partisan-says-us-lawmaker-who-scored-negative-on-bipartisanship-index-report\">perception of partisanship</a> — especially in the United States. </p><p>Speaking to Cointelegraph, Jonathan Jachym, the Global Head of Policy at <a href=\"https://cointelegraph.com/news/kraken-receives-virtual-asset-service-provider-authorization-in-ireland-ahead-of-mica-vote\">U.S.-based crypto exchange Kraken</a>, said he doesn’t think crypto is partisan and that the situation is far more nuanced. </p><p>He says crypto tech is fundamentally about financial empowerment, the ownership of assets and the decentralization of power structures. </p><p>“These are non-partisan issues which legislators across the globe face daily as their constituents navigate the challenges of the existing financial system,” Jachym said.</p><p>“Technology can be used to build a fairer, trustless, apolitical financial system, which is more efficient, transparent and secure for everyone. Now is the time to embrace crypto,” he added.</p><h2>Nearly even split of crypto support among politicians and voters </h2><p>According to Coinbase’s Legislative Portal, which <a href=\"https://www.coinbase.com/public-policy/legislative-portal\" target=\"_blank\" rel=\"noopener nofollow\">tracks</a> U.S. politicians who have made positive statements about crypto, there is a healthy number of crypto supporters in Congress on both sides of the political aisle, with 26 Republicans and 22 Democrats in the House of Representatives voicing support. </p><p>In the Senate, it’s slightly skewed toward the right, with 24 Republicans and only 11 Democrats making positive statements about crypto. Support for crypto among voters also appears to be a close split between the left, right and independents. </p><p><a href=\"https://assets.ctfassets.net/c5bd0wqjc7v0/WvuOkBwNXZsqhd6EWtkEL/7f94f8b6fbb222f3faf4d0346e473012/Morning_Consult_Cryptocurrency_Perception_Study_Feb2023_Memo__1_.pdf\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a Feb. 27 national survey conducted by <a href=\"https://cointelegraph.com/news/americans-frustrated-by-financial-system-inequality-20-own-crypto-survey\">business intelligence company Morning Consult</a>, 22% of Democrats, 18% of Republicans and 22% of Independents said they own crypto. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/339d90ea-2e79-4f22-8134-b3d128a5efdd.jpg\"  /></figure><p>Jachym believes bad actors have sown division in the space, but overall he says crypto itself remains an inclusive, transformative technology with the potential to improve lives. </p><p>“This is why, regardless of the political consensus of their populous, many developed economies are advancing bespoke regulatory regimes for crypto assets,” he said, adding, “For example, at the state level within the United States, both ‘red’ and ‘blue’ states have made meaningful progress toward workable frameworks for crypto.”</p><h2>Bipartisan support for crypto already happening</h2><p>There have already been some examples of bipartisanship among politicians with forming the <a href=\"https://cointelegraph.com/news/driving-purists-beserk-co-chair-of-blockchain-caucus-wants-to-reverse-crypto-transactions\">Congressional Blockchain Caucus</a> on Sept. 26, 2016, through cooperation by Democrats and Republicans.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/congress-may-be-ungovernable-but-us-could-see-crypto-legislation-in-2023\"><strong><em>Congress may be ‘ungovernable,’ but US could see crypto legislation in 2023</em></strong></a></p><p>The blockchain caucus was created to study blockchain tech and the role Congress can play in its development, and according to its <a href=\"https://congressionalblockchaincaucus-schweikert.house.gov/members\" target=\"_blank\" rel=\"noopener nofollow\">website</a>, the current four co-chairs are two Republicans and two Democrats. </p><p>Both parties also appear to be happy accepting monetary donations from the crypto industry. </p><p>In the wake of <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">FTX’s collapse in 2022</a>, it came to light that the exchange’s CEO Sam Bankman-Fried had made <a href=\"https://cointelegraph.com/news/who-has-returned-donations-or-contributions-from-ftx-amid-the-firm-s-reputational-risks\">political donations to Democrats</a>, but he also <a href=\"https://cointelegraph.com/news/fec-probe-demanded-after-sbf-admitted-to-making-dark-money-donations\">implied in a later interview</a> that Republicans had received roughly the same amount in “dark” donations. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1) I was a significant donor in both D and R primaries.<br><br>Supporting constructive candidates across the aisle to prevent pandemics and bring a bipartisan climate to DC.<br><br>And working with them to support permissionless finance.</p>&mdash; SBF (@SBF_FTX) <a href=\"https://twitter.com/SBF_FTX/status/1588965163323265025?ref_src=twsrc%5Etfw\">November 5, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bradley Allgood, the co-founder and CEO of U.S.-based blockchain development and fintech company Fluent Finance, told Cointelegraph that he doesn’t consider crypto a partisan issue but does believe the tech has been drawn into political discussions and power plays.</p><p>“A fundamental aspect of crypto — its inherent political neutrality and its role in fostering innovation — has found resonance in certain political factions, notably among those who favor deregulation and open markets,” he said. </p><p>“Contrarily, some elements of the current administration and regulators have adopted an adversarial stance toward crypto, purportedly to protect traditional institutions and maintain control over monetary mechanisms,” Allgood added, </p><p>However, Allgood says he firmly believes that the tech and the ideals it represents, such as decentralization, transparency and individual freedom, are far removed from the political squabbles of our time. He said:</p><blockquote>“I must emphasize: each individual cryptocurrency is in and of itself the product of human intention and does carry inherent political bias.”</blockquote><p>“The policies and parameters which govern individual cryptocurrencies — for example, how consensus is achieved on-chain, how validators are rewarded for their services, and inflation schedules — attract certain types of users and repel others,” he added.</p><h2>Critics of crypto are united as well </h2><p>Critics of the crypto industry also come from both sides of politics. Democrats such as <a href=\"https://cointelegraph.com/news/congressmen-raise-crypto-tax-compliance-concerns-treasury-irs\">California Representative Brad Sherman</a> and Massachusetts <a href=\"https://cointelegraph.com/news/us-banking-advocacy-senator-warren-crypto-bill\">Senator Elizabeth Warren</a> are two of the loudest voices criticizing the industry.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When you’ve made enemies with the bankers and Elizabeth Warren, you know you’re doing the right thing. <a href=\"https://t.co/w2WflrkJOu\">https://t.co/w2WflrkJOu</a></p>&mdash; Tyler Winklevoss (@tyler) <a href=\"https://twitter.com/tyler/status/1685065784265969664?ref_src=twsrc%5Etfw\">July 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>They are not alone, though, with Republicans such as Kansas Senator Roger Marshall co-sponsoring Warren’s bill demanding more <a href=\"https://cointelegraph.com/news/sens-warren-and-marshall-introduce-new-money-laundering-legislation-for-crypto\">transparency in digital asset transactions</a> and South Carolina Senator Lindsey Graham throwing his <a href=\"https://cointelegraph.com/news/us-banking-advocacy-senator-warren-crypto-bill\">support behind reintroducing the bill</a>. </p><p>Speaking to Cointelegraph, Aharon Miller, <a href=\"https://cointelegraph.com/news/oobits-skyscanner-for-bitcoin-trading-fails-to-meet-expectations\">co-founder and chief operating officer</a> of <a href=\"https://cointelegraph.com/news/how-to-earn-passive-income-with-peer-to-peer-lending\">peer-to-peer</a> trading platform Oobit, said crypto challenges the <a href=\"https://cointelegraph.com/news/crypto-and-fiat-currencies-are-worlds-apart-here-are-the-reasons-why\">traditional financial system</a>, so it’s natural for people with different political beliefs to have differing opinions on it.</p><p>He says crypto isn’t just for one political camp; it’s a technology that goes beyond political boundaries and has the potential to impact everyone, bringing perks such as financial inclusion, lower transaction costs and more transparency to the table.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\">Blockchain games aren’t really decentralized… but that’s about to change</a></em></strong></p><p>Miller characterizes crypto as a “game-changer that can revolutionize finance,” which is why he says regulators, policymakers, and the industry must work together to find the right balance between protecting consumers and fostering innovation. </p><p>“We need an environment that encourages responsible innovation so we can unlock crypto’s full potential,” he said. </p><blockquote>“The more we understand the real-world advancements facilitated by cryptocurrency, the better equipped we are to address practical and accessibility concerns, thus promoting broader adoption.” </blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-14T13:10:14.000Z",
    "title": "Cross-Chain Token Swaps Change Gears with Orbs, Axelar",
    "url": "https://cryptobriefing.com/cross-chain-token-swaps-change-up/?utm_source=feed&utm_medium=rss",
    "description": "Orbs integrates with Axelar to ensure seamless ORBS transitions to premier blockchains, following the unexpected shutdown of Multichain."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T13:14:12.000Z",
    "title": "Visa Tests ETH Gas Fee Payments Using Cards",
    "url": "https://cryptodaily.co.uk/2023/08/visa-tests-eth-gas-fee-payments-using-cards",
    "description": "<p>Visa recently completed a test that allows users to pay Ethereum (ETH) gas fees through credit and debit cards. </p>\n<p>Global payment giant Visa has successfully completed a test for an innovative solution on the Ethereum blockchain, which will allow its users to pay on-chain gas fees using a Visa debit or credit card.</p>\n<p>The test was revealed by Mustafa Bedawala, a Visa product manager, to address the ongoing challenge of ensuring Ether balances for covering gas fees.</p>\n\n<p dir=\"ltr\" lang=\"en\">We're excited to share our experimental solution on Paying Onchain Gas Fees with a Visa Card At @Visa, we've been exploring ways to simplify blockchain transactionsImagine paying for gas fees as easily as buying coffee with your card! But how did we get here?🧵👇 pic.twitter.com/uGhAde60xe</p>\n&mdash; Mustafa (@digitalmustafa) August 10, 2023\n<p>\n\n</p>\n<p>The possible solution aims to improve the interaction process with dApps on the Ethereum blockchain. Visa said the trial &ldquo;helps set the stage for a more accessible and user-friendly approach to digital transactions.&rdquo;</p>\n<p>Visa said:</p>\n\n<p>\"To transact using a blockchain like Ethereum, consumers must maintain a balance of the blockchain&rsquo;s native token (e.g., ETH) to pay fees for using the network, known as &ldquo;gas.&rdquo; What if sending blockchain transactions using self-custodial wallets was as straightforward for the user as using your card to pay for a cup of coffee?\"</p>\n\nVisa Aims to Eliminate Overspending ETH\n<p>The standard Ethereum transaction requires users acquiring ETH from an exchange wanting to transfer it to their wallets to pay variable gas fees. The variable gas fees often result in users spending more ETH than necessary or having insufficient ETH.</p>\n<p>To address these concerns, Visa&rsquo;s solution uses Ethereum&rsquo;s ERC-4337 standards and the &ldquo;Paymaster&rdquo; smart contract allowing off-chain gas fee payments. Users trigger an Ethereum transaction through their wallets which is then sent to the paymaster. Paymaster calculates the gas fee and charges Visa through a service called Cybersource.</p>\n<p>A digital signature is produced and validated for a limited time, then attached by the wallet before sending it to the blockchain. The signature is verified, and Paymaster settles the gas fees. Visa&rsquo;s innovative solution thereby allows users to pay gas fees off-chain with their Visa card and eliminates the need for users to hold ETH to pay for gas fees.</p>\n<p>Visa explained that:</p>\n\n<p>&ldquo;The intricacies and complexities of blockchain-based transactions have been a significant stumbling block for many users, creating a challenging learning curve and increasing user friction.&rdquo;&nbsp;</p>\n\n<p>Visa&rsquo;s research team added that the solution offers a &ldquo;promising approach to substantially addressing these challenges.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T13:20:52.000Z",
    "title": "Zunami protocol plunges into crisis as hackers make off with $2.1M",
    "url": "https://www.cryptopolitan.com/zunami-protocol-hacked/",
    "description": "The Zunami Protocol, a prominent player in the realm of decentralized finance (DeFi), recently issued a cautionary advisory to its user base, urging them to refrain from acquiring its Zunami Ether (zETH) and Zunami USD (UZD) stablecoins. This advisory came in the wake of a concerning incident that unfolded within the protocol&#8217;s ecosystem &#8211; an ... <a title=\"Zunami protocol plunges into crisis as hackers make off with $2.1M\" class=\"read-more\" href=\"https://www.cryptopolitan.com/zunami-protocol-hacked/\" aria-label=\"More on Zunami protocol plunges into crisis as hackers make off with $2.1M\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T13:17:08.000Z",
    "title": "Coca-Cola launches Masterpiece NFT collection on Coinbase’s Base network",
    "url": "https://www.cryptopolitan.com/coca-cola-launches-masterpiece-nft-collection-on-coinbases-base-network/",
    "description": "Coca-Cola has unveiled its latest venture into the digital realm. The beverage giant has launched a new collection of NFTs titled “Masterpiece.” This collection, available on Base, Coinbase&#8217;s Ethereum Layer 2 network, blends historical and contemporary art pieces. Significantly, this move is part of Coinbase&#8217;s multi-week “Onchain Summer” initiative, which began on August 9. Historical ... <a title=\"Coca-Cola launches Masterpiece NFT collection on Coinbase&#8217;s Base network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coca-cola-launches-masterpiece-nft-collection-on-coinbases-base-network/\" aria-label=\"More on Coca-Cola launches Masterpiece NFT collection on Coinbase&#8217;s Base network\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T13:30:43.000Z",
    "title": "Dogecoin (DOGE) vs. Gala (GALA) vs. Anarchy (ANA): Which Coin Offers 10x Better Returns?",
    "url": "https://www.crypto-news-flash.com/dogecoin-doge-vs-gala-gala-vs-anarchy-ana-which-coin-offers-10x-better-returns/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-doge-vs-gala-gala-vs-anarchy-ana-which-coin-offers-10x-better-returns",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-18.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-18.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-18-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-18-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto ecosystem is one of the most dynamic markets on earth. Words like breathtaking, thrilling, incredible do not do justice to the rate at which the crypto market moves. You barely have time to spot new trends and investment opportunities. New tokens are popping up on a daily basis like mushrooms after a rainy [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T13:20:52.000Z",
    "title": "Crypto Analyst Predicts Impending Bitcoin (BTC) Correction to $25,000, Expects Temporary Panic",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-predicts-impending-bitcoin-btc-correction-to-25000-expects-temporary-panic/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-predicts-impending-bitcoin-btc-correction-to-25000-expects-temporary-panic",
    "description": "<img width=\"1920\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-ga87746a87_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-ga87746a87_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-ga87746a87_1920-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-ga87746a87_1920-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-ga87746a87_1920-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-ga87746a87_1920-1536x1152.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin price correction could create panic in the market before resuming the uptrend to $36,000. Any price correction would create an opportunity to accumulate for long-term investors. Altcoins will resume uptrend in 2024-2025. The world&#8217;s largest cryptocurrency Bitcoin (BTC) has been consolidating around $29,000 for a while and lacking enough ammo for any further price [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-14T13:37:22.000Z",
    "title": "Is LUNC Too Decentralized to Survive? Community Debates Need for a CEO",
    "url": "https://coinedition.com/is-lunc-too-decentralized-to-survive-community-debates-need-for-a-ceo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LUNC Community’s Activity Is a Positive Sign Says Trader\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to experts in the crypto space, the Terra Luna Classic (LUNC) network is ailing and unable to recover due to the absence of a leadership figure in the space. More than once, the LUNC community has pondered bringing Changpeng Zhao (CZ), the CEO of Binance Exchange, to take charge of the LUNC affairs. In [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-lunc-too-decentralized-to-survive-community-debates-need-for-a-ceo/\">Is LUNC Too Decentralized to Survive? Community Debates Need for a CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-14T13:35:00.000Z",
    "title": "DeFiChain Founder’s Proposal to Boost DFI Price and Demand by Over $1M",
    "url": "https://coinedition.com/defichain-founders-proposal-to-boost-dfi-price-and-demand-by-over-1m/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Proposal-for-Emergency-DFIP-on-defichain-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>DeFiChain founder Dr. Julian Hosp has put forward a strategic proposal to boost the value of the platform’s native token, DFI, and drive substantial demand of over $1 million. The proposal, referred to as the DFIP (DeFi Improvement Proposal), revolves around bolstering the utility of DFI while concurrently generating buying pressure. It involves several strategic [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/defichain-founders-proposal-to-boost-dfi-price-and-demand-by-over-1m/\">DeFiChain Founder’s Proposal to Boost DFI Price and Demand by Over $1M</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-14T13:15:00.000Z",
    "title": "Will RUNE Continue to Steal the Spotlight from Other Altcoins?",
    "url": "https://coinedition.com/will-rune-continue-to-steal-the-spotlight-from-other-altcoins/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Will_RUNE_Continue_to_Steal_the_Spotlight_from_Other_Altcoins-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Over the last week, the majority of altcoins failed to produce any significant move. But ThorChain (RUNE) managed to stand out, producing a staggering 46.71% hike in the last seven days. RUNE’s increase also ensured that it outperformed memecoins including Dogecoin (DOGE) and Shiba Inu (SHIB), which have had a recent profitable period. Although RUNE’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/will-rune-continue-to-steal-the-spotlight-from-other-altcoins/\">Will RUNE Continue to Steal the Spotlight from Other Altcoins?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]