[
  {
    "source": "Decrypt",
    "date": "2023-09-20T17:53:51.000Z",
    "title": "Toncoin Surges Into Top 10 Cryptocurrencies, Briefly Topping Dogecoin",
    "url": "https://decrypt.co/197987/toncoin-surges-top-10-cryptocurrencies-briefly-topping-dogecoin",
    "description": "Toncoin (TON) is now the 10th-largest digital asset by market cap, following news of a Telegram crypto wallet launch."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-20T18:02:12.000Z",
    "title": "Former U.S. Treasury Secretary Larry Summers Issues Dire Warning: Inflation and Federal Reserve Failures Risk Recession",
    "url": "https://www.cryptoglobe.com/latest/2023/09/former-u-s-treasury-secretary-larry-summers-issues-dire-warning-inflation-and-federal-reserve-failures-risk-recession/",
    "description": "Former U.S. Treasury Secretary Larry Summers has openly expressed his apprehensions about the current inflationary environment in the United States. During his talk at the recent All-In Summit 2023, Summers cast doubt on the Federal Reserve’s assurance that it has the inflation situation well in hand. Lawrence Henry Summers, commonly known as Larry Summers, is […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T18:00:18.000Z",
    "title": "dYdX v4 Enables 1-Click Onboarding With Squid & Axelar",
    "url": "https://cryptodaily.co.uk/2023/09/dydx-v4-enables-1-click-onboarding-with-squid-axelar",
    "description": "dYdX v4 Enables 1-Click Onboarding With Squid & Axelar"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T17:47:38.000Z",
    "title": "Metacade Tokens Opened Up to Millions More Investors via Bitget Exchange Listing",
    "url": "https://cryptodaily.co.uk/2023/09/metacade-tokens-opened-up-to-millions-more-investors-via-bitget-exchange-listing",
    "description": "Metacade, the world’s first community-led gaming platform, has confirmed it will list its token, MCADE, on Bitget on the 20th of September - a strategic move welcomed by investors as it accompanies a number of recent announcements about new collaborations and product updates."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T17:40:13.000Z",
    "title": "$16.5M Discord crypto trading bot shuts down after exploit",
    "url": "https://crypto.news/16-5m-discord-crypto-trading-bot-shuts-down-after-exploit/",
    "description": "None Trading, a cryptocurrency and NFT trading platform built on Discord, announced its immediate shutdown on Sept. 20 due to a &#8220;critical exploit&#8221; in its infrastructure that resulted in substantial financial losses, including &#8220;team tokens&#8221; crucial for business operations. The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T18:00:20.000Z",
    "title": "Grayscale Takes New Approach As It Files For Another Ethereum Futures ETF",
    "url": "https://www.newsbtc.com/news/ethereum/grayscale-ethereum-futures-etf/",
    "description": "On the back of its partial victory against the US Securities and Exchange Commission (SEC), Grayscale has applied to the Commission for another Ethereum Futures Exchange-Traded Fund (ETF). Why Another ETH Futures ETF? According to a report by the Wall Street Journal (WSJ), Grayscale Investments filed this application on September 20. This development may come as a surprise to many, considering that the asset manager had filed an earlier application to offer this same investment vehicle. As such, this will represent its third application (Grayscale withdrew its first application due to SEC concerns before filing another one in July). Related Reading: Is $10,000 Possible For XRP Price? Crypto Analysts Weigh In There is, however, a distinction between both applications, as WSJ noted. The latest application is filed under the Securities Act of 1933, a regulation under which spot Bitcoin ETFs like BlackRock’s filed. Meanwhile, the initial application was filed under the Investment Company Act of 1940, a regulation which securities-based ETFs are registered under.  While the exact reason for Grayscale’s action remains unknown, it may be a contingency plan in case the SEC denies its initial proposed Ethereum futures ETF, which is expected to launch in October, barring any denial. Grayscale’s filing under the Securities Act of 1933 isn’t the first, as Brazilian investment firm Hashdex filed its Ethereum ETF application under that Act. Last week, Hashdex applied with the SEC to offer a fund that will hold both Ether futures contracts and a Spot Ethereum ETF (the first of its kind). The firm justified this move by stating that a combination of both markets will help mitigate the risk of market manipulation. Hashdex’s application has been singled out for how distinct it is from other applications. The investment firm has proposed to use the Chicago Mercantile Exchange (CME) to track the price of Ethereum and also plans to buy the Ether, which the fund will hold from the CME Market’s Exchange for Physical (EFP) transactions.  ETH price holding above $1,600 support &#124; source: ETHUSD on Tradingview.com Ethereum Futures ETF Imminent? Several Ethereum futures ETFs are expected to hit the market in October, barring a denial by the SEC. Rule 485(a) of the SEC Rules allows these ETFs to launch 75 days from their respective filing dates if the SEC doesn’t deny them before then.  In line with this, the ETFs of fund managers like Volatility Shares, Bitwise, VanEck, ProShares, and Roundhill will be the first to launch if they receive approval from the SEC. Related Reading: Lawyer Involved In Cryptoqueen’s OneCoin Scam Receives Shocking Response From Court Volatility Shares was the first among them to apply to offer Ethereum futures ETF. As such, it will gain the first-mover advantage, carrying a possible October 12 launch date, with others coming after. However, this is subject to any decision by the SEC. The SEC approving an Ethereum ETF will be a historical event that is expected to give the crypto market a much-needed boost as the bear market continues to linger. There are already forecasts that ETH’s price could rise above $2,000 when these funds launch.  Featured image from Analytics Insight, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T18:05:41.000Z",
    "title": "XRP’s Imminent Surge: Analyst Forecasts 27x Rally to $90 After 68-Month Accumulation",
    "url": "https://www.crypto-news-flash.com/xrps-imminent-surge-analyst-forecasts-27x-rally-to-90-after-68-month-accumulation/?utm_source=rss&utm_medium=rss&utm_campaign=xrps-imminent-surge-analyst-forecasts-27x-rally-to-90-after-68-month-accumulation",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple(xrp)\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />An analyst predicts XRP might surge 27 times to reach $90, citing extended consolidation phases. The current 68-month accumulation phase is the longest XRP has seen. Crypto analyst EGRAG has generated significant buzz in the cryptocurrency community with their recent XRP price behavior analysis. EGRAG&#8217;s assessment suggests that XRP may be on the brink of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-20T18:05:40.000Z",
    "title": "Analyst Will Clemente Says Setup for Bitcoin (BTC) Becoming ‘Increasingly Favorable’ – Here’s Why",
    "url": "https://dailyhodl.com/2023/09/20/analyst-will-clemente-says-setup-for-bitcoin-btc-becoming-increasingly-favorable-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-outperform-tech-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst and Bitcoin bull Will Clemente says that there&#8217;s a large-scale macro setup now forming for BTC. Addressing his 690,000 followers on the social media platform X, Clemente says that the US economy is now in a position where it absolutely has to issue more dollars in order to service its debt. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/analyst-will-clemente-says-setup-for-bitcoin-btc-becoming-increasingly-favorable-heres-why/\">Analyst Will Clemente Says Setup for Bitcoin (BTC) Becoming ‘Increasingly Favorable’ – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]