[
  {
    "source": "Decrypt",
    "date": "2023-11-15T21:00:02.000Z",
    "title": "Gamers Hate 'Call of Duty: Modern Warfare III'—What Went Wrong?",
    "url": "https://decrypt.co/206223/call-of-duty-modern-warfare-iii-trashed-by-gamers-reviews",
    "description": "Activision’s latest Call of Duty is getting slammed by critics and everyday gamers alike amid reports of rushed development."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-15T20:40:26.000Z",
    "title": "Regulators Are Powerless to Prevent Another FTX, Says CFTC Chairman",
    "url": "https://decrypt.co/206235/regulators-cant-prevent-another-ftx-cftc",
    "description": "The CFTC isn't any better suited to stop a collapse like FTX today than it was a year ago, said commodities chief Rostin Behnam."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T21:00:00.000Z",
    "title": "US House Financial Services subcommittee looks for answers on crypto and crime",
    "url": "http://cointelegraph.com/news/us-house-financial-services-subcommittee-answers-cryptocurrency-crime",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/51f0aefb-5f07-45fd-9f6f-7a7e075e3b6f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reports on crypto funding terrorism and blockchain forensics were confusing, but everyone agreed on the need for collaboration and regulation. </p>\n                    <p><p>The United States House Financial Services Subcommittee on Digital Assets, Financial Technology and Inclusion received an education in the uses of blockchain technology in a hearing entitled “Crypto Crime in Context: Breaking Down the Illicit Activity in Digital Assets” on Nov. 15. The hearing was bipartisan in nature, chair French Hill stated at the outset. </p><p>Hill began the meeting by citing an article published by The Wall Street Journal on Oct. 10 on the use of crypto by Hamas for fundraising. The article was <a href=\"https://cointelegraph.com/news/wall-street-journal-corrects-article-misciting-hamas-crypto-terrorism-funding-data\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/wall-street-journal-corrects-article-misciting-hamas-crypto-terrorism-funding-data/amp\">corrected on Oct. 27</a> to reflect more accurately crucial data produced by blockchain analytics firm Elliptic, as Hill also mentioned. He continued:</p><blockquote>“Phone and the internet aren’t to be blamed for terror financing and crypto shouldn’t either.”</blockquote><p>In a similar vein, subcommittee ranking member Stephen Lynch stated the hope that “we can put aside some of the preconceived notions some may have.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/99abc1c2-10b9-4df2-b414-64b840c21dd2.png\"><figcaption style=\"text-align: center;\">The House subcommittee hearing announcement. Source: The House Financial Services Committee</figcaption></figure><p>The panel of <a href=\"https://cointelegraph.com/news/us-fsc-discuss-illicit-activity-crypto-upcoming-hearing\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-fsc-discuss-illicit-activity-crypto-upcoming-hearing/amp\">witnesses included representatives</a> of ConsenSys and Chainalysis, as well as forensic experts and a senior counsel from law firm Hogan Lovells. They spoke about the need for international collaboration and public-private collaboration in stopping the misuse of digital assets, the need for well crafted legislation and the intricacies of blockchain sleuthing.</p><p>Rep. Brad Sherman asked Dynamic Securities Analytics<strong> </strong>President<strong> </strong>Alison Jimenez for an example of a licit use of a crypto mixer, which she was unable to provide.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/israeli-authorities-seize-crypto-from-terror-organizations-credit-new-technology\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/israeli-authorities-seize-crypto-from-terror-organizations-credit-new-technology/amp\">Israeli authorities seize crypto from terror organizations, credit new technology</a> </em></strong></p><p>Plenty of other voices wanted to be heard at the same time on this topic. Hill, Rep. Tom Emmer, Financial Services Committee chair Patrick McHenry and Rep. Ritchie Torres were lead signers along with a bipartisan group of 53 more House members of a letter to U.S. President Joe Biden and Treasury Secretary Janet Yellen on Nov. 15. </p><p>The letter requested information on Hamas and Palestinian Islamic Jihad fundraising and the role of cryptocurrency in its efforts. The letter <a href=\"https://emmer.house.gov/_cache/files/1/e/1e5fb989-7fc2-4c14-85f1-3b82f11e0d38/45A1769B2F24FA8AD15E771E419AF171.congressionalletter.11.15.23.pdf\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>:</p><blockquote>“It is important to understand the scope of Hamas’s digital assets fundraising campaign in the context of its traditional funding activities.”</blockquote><p>It went on to say that traditional fundraising methods “could far exceed” the revenue brought in through crypto, and Congress needs assistance “understanding the size, scope, and duration of Hamas’s digital asset fundraising campaign, as well as accurate information on blocked or forfeited digital assets from terrorist organizations.” </p><p>The letter cites the same Wall Street Journal article. On Nov. 12, the WSJ <a href=\"https://www.wsj.com/world/middle-east/hamas-needed-a-new-way-to-get-money-from-iran-it-turned-to-crypto-739619aa\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a second article by the same authors on the use of crypto to funnel money to Hamas. </p><p>Also on Nov. 15, the Blockchain Association released an open letter to Hill and other members of the Financial Services Committee. That letter was <a href=\"https://theblockchainassociation.org/wp-content/uploads/2023/11/NatSecCommunity_LettertoCongress-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> by 40 former members of the U.S. military, intelligence officers and national security professionals who now have links to digital assets companies or venture capital. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/HappeningNow?src=hash&ref_src=twsrc%5Etfw\">#HappeningNow</a>: Chairman <a href=\"https://twitter.com/RepFrenchHill?ref_src=twsrc%5Etfw\">@RepFrenchHill</a> convenes the Digital Assets, Financial Technology and Inclusion Subcommittee for a hearing entitled \"Crypto Crime in Context: Breaking Down the Illicit Activity in Digital Assets.\"<br><br> Watch Live <a href=\"https://t.co/r2ydRRrWvp\">https://t.co/r2ydRRrWvp</a> <a href=\"https://t.co/Wfrz90FdVR\">pic.twitter.com/Wfrz90FdVR</a></p>— Financial Services GOP (@FinancialCmte) <a href=\"https://twitter.com/FinancialCmte/status/1724865227542397246?ref_src=twsrc%5Etfw\">November 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>They too mentioned the earlier WSJ article, saying they were concerned that the “grossly overstated” and “debunked” article “continues to be used to push legislation that would be counterproductive to U.S. national security interests.”</p><p>Encouraging the growth of a regulated, compliant digital asset industry in the United States is the best way to root out bad actors, the letter continued.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0: The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T20:43:53.000Z",
    "title": "Why is Bitcoin price up today?",
    "url": "http://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/2975699c-abdd-4f7b-bd35-74267a570117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is up today, as the available liquid supply hits an all-time low right as institutional investors increase their allocations to BTC. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is up today, rebounding from the Nov. 14 correction to $34,500 and hitting an intra-day high of $37,650. The rally comes after <a href=\"https://cointelegraph.com/news/btc-price-1-week-lows-bitcoin-whales-sell-35k\">Bitcoin price</a> briefly touched 1-week lows on Nov. 15. The hype around a spot BTC exchange-traded fund (<a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">ETF</a>) is bringing significant inflows to Bitcoin as liquid supply is tightening, pushing prices across the crypto market higher. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7dfd02ae-d617-4e06-880b-707256aa09f0.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Let’s look into the reasons why Bitcoin price is up today. </p><h2>Potential spot BTC ETF approval boosts market sentiment </h2><p>Despite a bevy of macro headwinds, Bitcoin price continues to push higher, achieving a 126% year-to-date gain and <a href=\"https://cointelegraph.com/news/48k-bitcoin-price-target-filbfilb-interview\">options market data</a> shows traders angling toward the $40,000 level. The price move of the last two weeks sent the Crypto Fear and Greed index firmly in the “Greed” cohort, showing improved market sentiment. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/531a16f1-d23d-44b1-aceb-c6f52d8bec0c.png\"  /><figcaption style=\"text-align: center;\"><em>Fear and Greed Index. Source: Newhedge</em></figcaption></figure><p>After a rush of spot <a href=\"https://cointelegraph.com/news/bitcoin-price-holds-as-institutional-investor-boosts-sentiment\">Bitcoin ETF amendments</a> in mid-October, the first window for the Securities and Exchange Commission (<a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">SEC</a>) to approve the 12 outstanding ETFs opened on Nov. 9.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New Research note from me today. We still believe 90% chance by Jan 10 for spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur <a href=\"https://t.co/u6dBva1ytD\">pic.twitter.com/u6dBva1ytD</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722321412218638632?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>To date, the SEC has refused to approve a spot Bitcoin ETF despite numerous applicants, including <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock</a>, Fidelity, <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">ARK</a> Invest and 21Shares. The open period for approval lasts until Nov. 17. If the SEC continues the pattern of delaying a spot Bitcoin ETF approval, it remains open until Jan. 10. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><p>According to reports, an approval may <a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\">generate $600 billion</a> in new demand. CryptoQuant analysts believe that an ETF approval will lead to a $1 trillion increase in Bitcoin’s <a href=\"https://cointelegraph.com/tags/market-capitalization\">market capitalization</a>.</p><p>Galaxy Digital predicts a 74% <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\">price increase</a> in the first year after a spot BTC ETF launch. </p><h2>Institutional inflows surpass $1 billion</h2><p>While some investors may be awaiting increased liquidity from approved ETFs, institutional investors have already begun deploying funds to Bitcoin and crypto. According to CoinShares, institutional investors have pushed more than $1 billion into crypto in the past year.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/bb32be8d-d73d-4f3c-922e-ce0be973b7c5.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto asset institutional investor inflow. Source: CoinShares</em></figcaption></figure><p>Of the $1 billion pushed to crypto assets in the last year, over $240 million has flowed to <a href=\"https://cointelegraph.com/news/crypto-product-inflows-amid-excitement-bitcoin-etf\">Bitcoin</a> specifically. Institutional investors also account for 19.8% of all Bitcoin trading volume. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Digital asset investment products saw inflows totalling US$293m last week.<br> Year to Date inflows: US$1.14bn (3rd highest yearly inflows on record)<br><br>– <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> –<br> <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a>: US$240m innflows (year to date inflows: US$1.08bn)<br> Short Bitcoin: US$7m outflows<br><br> Bitcoin ETP… <a href=\"https://t.co/6UK1aDtF96\">pic.twitter.com/6UK1aDtF96</a></p>&mdash; CoinShares (@CoinSharesCo) <a href=\"https://twitter.com/CoinSharesCo/status/1724104898743026158?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Bitcoin supply tightens  </h2><p>While institutional investors continue to pour money into Bitcoin, the liquid available BTC supply is tightening. Coinciding with Bitcoin price gains, the BTC <a href=\"https://cointelegraph.com/news/bitcoin-exchanges-same-btc-supply-late-2017\">supply on exchanges </a>remains below the May 3, 2023 peak. Exchanges have shed over 200,000 Bitcoin since that yearly peak, continuing a multi-year downtrend in BTC balances.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/dc58ee7a-d634-4d23-9e51-af640a5aecea.png\"  /><figcaption style=\"text-align: center;\"><em>BTC balance on exchanges. Source: Glassnode</em></figcaption></figure><p>The market perceives coins leaving crypto exchanges as a bullish signal, given traders withdraw their BTC typically when they want to hold it in self-custody long-term. On Nov. 7, long-term <a href=\"https://cointelegraph.com/news/bitcoin-supply-held-long-term-holders-hits-all-time-high\">Bitcoin holders</a> hit an all-time in purchasing 92% of all newly BTC minted. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/chainlink-pumps-26-in-6-days-is-there-room-for-more\"><strong><em>Chainlink (LINK) pumps 26% in 6 days — Is there room for more?</em></strong></a></p><p>Analysts at Glassnode believe that the exchange supply combined with short-term holder supply could mean available Bitcoin supply is at a historical low on a relative basis. </p><p>The analysis continues,</p><blockquote>“If we compare Short-Term Holder Supply and Exchange Balances, we can see they are of a similar magnitude of around 2.3M BTC. Combined, these two measures of ‘available supply’ equate to 23.8% of the circulating supply, which is now at an all-time low.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a4722416-7659-4937-a81b-42e8d0dc49ba.png\"  /><figcaption style=\"text-align: center;\"><em>BTC available supply. Source: Glassnode</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/why-is-bitcoin-price-up-today&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T21:00:14.000Z",
    "title": "Bitcoin Defies Global Market Trends: Negative Correlation Hits Pre-Pandemic Levels",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-defies-global-market-trends-negative-correlation/",
    "description": "So far, Bitcoin has demonstrated a unique trajectory over the past weeks, distinct from broader financial movements. While global markets have been riding buoyancy, with investors embracing a more risk-on attitude following softer US inflation data, Bitcoin has charted its own path. Bloomberg reported since the release of the US data on Tuesday, an index of global shares surged by 2% on speculation that the Federal Reserve might halt interest rate hikes and lean towards reductions in 2024. In this context, Bitcoin has seen a decline in the short term but overall gains on the longer time horizon. Related Reading: From $35,000 To $500,000? The Bitcoin Rollercoaster This Expert Sees Ahead This unusual behavior has resulted in a significant shift in the correlation between Bitcoin and traditional stock markets. The report read: A 30-day correlation coefficient for Bitcoin and MSCI Inc.’s gauge of world stocks now sits at minus 0.23, the most negative since the onset of the pandemic in early 2020. This data corresponds with the expectation that falling bond yields and rallying equities, combined with a potential Federal Reserve policy reversal, would also benefit crypto like Bitcoin, often seen as harbingers of high-risk investment appetites. Bitcoin’s Cautious Trajectory Amid ETF Anticipation Furthermore, the dynamics of Bitcoin&#8217;s market behavior have so far proved to be notably influenced by anticipations surrounding US spot exchange-traded funds (ETFs) investing directly in BTC. Bitcoin had already surged over 100% in 2023, fueled by optimism over regulatory approvals for these spot ETFs. In the past week, the asset has seen quite a retracement, dropping from trading above $37,000 last week to a current trading price of $36,434, at the time of writing. Tony Sycamore, a market analyst at IG Australia Pty, notes that the recent selloff in Bitcoin could be attributed to &#8216;weak hands folding,&#8217; given the absence of sustained upward momentum over the past week. This sentiment reflects a cautious approach among investors, weighing the prospects of Bitcoin in the context of its recent performance and the broader expectations of developments such as the approval of a BTC spot ETF in the crypto space. Further Sentiments On Bitcoin Alongside Sycamore&#8217;s insights on Bitcoin&#8217;s price movements, other experts and analysts have shared their perspectives on this leading cryptocurrency. Financial commentator Tedtalksmacro pointed to a notable increase in open interest, hinting at possible significant market shifts or &#8216;fireworks&#8217; ahead. Another analyst, CryptoCon, predicts a surge in Bitcoin&#8217;s price. CryptoCon analysis suggests Bitcoin is entering its fourth mid-cycle phase, a crucial period for forecasting the crypto&#8217;s future direction. According to the analyst, this phase could lead BTC to a &#8216;mid-top&#8217; cycle peak, potentially reaching around $45,500. Conversely, JPMorgan analysts have expressed skepticism about the recent rally in the crypto market, suggesting it might be more speculative than substantive. Their report adopts a cautious tone, hinting that the market&#8217;s enthusiasm might not be fully grounded in strong fundamentals. Related Reading: Crypto’s Current Climb: JPMorgan Suggests Rally May Be Reaching Its Peak The analysts further highlighted the possibility of a &#8216;buy the rumor, sell the fact&#8217; situation following the approval of a spot Bitcoin ETF, indicating a potential downturn after the initial hype. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-15T21:00:39.000Z",
    "title": "Janet Yellen Says ‘Unbacked Crypto Assets’ To Be Discussed at APEC Summit in San Francisco",
    "url": "https://dailyhodl.com/2023/11/15/janet-yellen-says-unbacked-crypto-assets-to-be-discussed-at-apec-summit-in-san-francisco/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/yellen-apec-summit.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US Treasury Secretary Janet Yellen plans to discuss crypto assets at an annual meeting between economic leaders of Asian and Pacific countries. The 30th annual meeting between finance ministers of Asia-Pacific Economic Cooperation (APEC) countries is currently ongoing in San Francisco. APEC is a regional economic forum established in 1989 to promote trade and economic [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/15/janet-yellen-says-unbacked-crypto-assets-to-be-discussed-at-apec-summit-in-san-francisco/\">Janet Yellen Says ‘Unbacked Crypto Assets’ To Be Discussed at APEC Summit in San Francisco</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-15T20:55:40.000Z",
    "title": "Sergey Nazarov Predicts Financial ‘Reckoning’ That Could Lead to Rapid Crypto Adoption",
    "url": "https://dailyhodl.com/2023/11/15/sergey-nazarov-predicts-financial-reckoning-that-could-lead-to-rapid-crypto-adoption/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/adoption-2021-gemini.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Chainlink (LINK) creator Sergey Nazarov says that a financial cataclysm could trigger a rush into digital assets and blockchain ecosystems. In a new interview with Ash Bennington on Real Vision, Nazarov outlines what he calls a &#8220;global correction back to reality&#8221; where blockchain technology is integrated with the financial system and other industries to bring [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/15/sergey-nazarov-predicts-financial-reckoning-that-could-lead-to-rapid-crypto-adoption/\">Sergey Nazarov Predicts Financial ‘Reckoning’ That Could Lead to Rapid Crypto Adoption</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]