[
  {
    "source": "Crypto Daily",
    "date": "2023-07-24T11:45:00.000Z",
    "title": "Grizzly.Fi Launched the Grizzly Trade Decentralized Perpetual Exchange",
    "url": "https://cryptodaily.co.uk/2023/07/grizzlyfi-launched-the-grizzly-trade-decentralized-perpetual-exchange",
    "description": "<p>Grizzly.Fi, the trailblazing DeFi platform committed to democratizing innovative financial solutions, has shared a momentous announcement that transcends its vibrant community.</p>\n<p>On July 21, 2023, Grizzly Trade, their decentralized perpetual platform built on opBNB in collaboration with Metavault Trade, officially launched on BNB Mainnet.&nbsp;</p>\n<p>This highly anticipated release marks the platform's advancement into a new realm alongside its existing range of earning products, further benefiting the Grizzly ecosystem.&nbsp;</p>\nThe First Decentralized Perpetuals on opBNB\n<p>Grizzly, one of the most promising projects in the DeFi span, has launched its decentralized perpetual exchange, Grizzly Trade.&nbsp;</p>\n<p>This strategic expansion marks a significant milestone for the Grizzly Ecosystem, as it taps into a new market and propels the platform towards its vision of becoming a decentralized hub for DeFi's finest utilities.</p>\n<p>In collaboration with Metavault Trade, Grizzly.Fi has extended its product line to include a futures trading platform, providing additional benefits to the Grizzly ecosystem.&nbsp;</p>\n<p>The opBNB (BNB Layer 2) deployment process commenced on June 30, 2023, and made Grizzly Trade available for testing. Following the initial deployment on the opBNB Testnet, the platform was also launched on the BNB mainnet on July 21.</p>\n<p>Grizzly Trade allows users to trade blue-chip cryptocurrencies such as BTC, ETH, and BNB with leverage of up to 50x while ensuring a fully non-custodial experience.&nbsp;</p>\n<p>The platform boasts an intuitive and user-friendly interface, providing a glimpse of the upcoming V2 update, which aims to transform the growing ecosystem into a beginner-friendly crypto hub.</p>\n<p>Beyond its appeal as a new product catering to a broader audience, Grizzly Trade plays a vital role within the Grizzly ecosystem, serving as a lucrative real yield source for yield farmers. By providing liquidity, users can earn 50% of all platform fees while simultaneously being exposed to BTC, ETH, BNB, and stablecoins.</p>\n<p>One of the most notable features of Grizzly Trade is the built-in Buyback &amp; Burn functionality for Grizzly's native token, \"GHNY.\" This unique feature utilizes 25% of all generated platform fees to purchase GHNY from the open market and burn it. This mechanism effectively curbs inflation, transforming GHNY into an ultrasound (deflationary) token.&nbsp;</p>\n<p>Grizzly Trade not only expands the potential market size by introducing a utility already utilized by thousands of individuals regularly but also stabilizes inflation and drives the protocol's traction.&nbsp;</p>\n<p>It signifies an important step towards achieving the overarching goal of the Grizzly ecosystem: to lead and onboard the next million users into DeFi.</p>\nWin Big with GrizzlyFi's \"Trade to Earn\" and \"Trade to Win\" Challenges!\n<p>In parallel with this launch and to celebrate it, GrizzlyFi establishes new trading challenges to reward and encourage new users to explore the platform: 'Trade to Earn' and 'Trade to Win.' With these two challenges, users can win impressive prizes from a reward pool of $20,000 in the 'Trade to Earn' challenge with a $1,000 transaction volume. Also, they can compete for some of the $50,000 and $30,000 prize pools in the 'Trade to Win Beginner' and 'Trade to Win Pro' challenges, respectively.&nbsp;</p>\nDiscover Grizzly.Fi\n<p>Grizzly.Fi is a tech company founded in 2021, and it incorporates a DeFi platform dedicated to democratizing decentralized finance for all.&nbsp;</p>\n<p>Today, Grizzly.Fi is also one of the most intuitive Liquidity Mining platforms. Renowned for its solutions and unwavering dedication to inclusivity, the company sets the benchmark in the industry.</p>\n<p>Apart from its exceptional accessibility, Grizzly.Fi upholds an unwavering focus on security and transparency.&nbsp;</p>\n<p>Employing cutting-edge security protocols, the platform ensures the utmost protection of users' funds and personal information while fostering a culture of complete operational transparency.</p>\nStay Updated\n<p>For more information, discover the honeycomb of Grizzly.Fi and explore its exceptional range of products by visiting its official website. Also, engage with the company through social media on LinkedIn, Twitter, Discord, Telegram, Reddit, Instagram, and YouTube, to stay connected with the latest news and updates.</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T12:00:27.000Z",
    "title": "Attorney Deaton claps back at post criticizing Judge Torres’ Ripple-XRP ruling",
    "url": "https://www.cryptopolitan.com/deaton-responds-post-criticizing-xrp-ruling/",
    "description": "In a long Twitter thread, Attorney John Deaton has given his insight on a recent post by Charles Gasparino in New York Post, which questioned Judge Anita Torres&#8217; verdict on XRP and Ripple and stirred debate among XRP supporters. Deaton has held his stance, saying that Judge Torres&#8217;s SEC v. Ripple case ruling is very ... <a title=\"Attorney Deaton claps back at post criticizing Judge Torres&#8217; Ripple-XRP ruling\" class=\"read-more\" href=\"https://www.cryptopolitan.com/deaton-responds-post-criticizing-xrp-ruling/\" aria-label=\"More on Attorney Deaton claps back at post criticizing Judge Torres&#8217; Ripple-XRP ruling\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-24T11:46:42.000Z",
    "title": "Crypto whales accumulate MakerDAO (MKR) token",
    "url": "https://crypto.news/crypto-whales-accumulate-makerdao-mkr-token/",
    "description": "Maker (MKR) stats show significant deposits, swaps, and accumulations carried out by major players in the crypto market.   In recent days, MakerDAO Founder RuneKek has been involved in noteworthy swaps, according to data from Spot on Chain. He acquired 1,613&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T11:59:36.000Z",
    "title": "Algorand (ALGO) and Polkadot (DOT) Post Positive Numbers As Tradecurve (TCRV) Turns Market Winds Bullish With Its Presale",
    "url": "https://www.crypto-news-flash.com/algorand-algo-and-polkadot-dot-post-positive-numbers-as-tradecurve-tcrv-turns-market-winds-bullish-with-its-presale/?utm_source=rss&utm_medium=rss&utm_campaign=algorand-algo-and-polkadot-dot-post-positive-numbers-as-tradecurve-tcrv-turns-market-winds-bullish-with-its-presale",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T142357.014.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T142357.014.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T142357.014-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T142357.014-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the market is showing signs of revival, investors are on a hunt to find a project where they can make millions. They have found one such opportunity in Tradecurve’s (TCRV) presale. On the sidelines, Algorand (ALGO) and Polkadot (DOT) have also moved up on the price chart, but they are still susceptible to bears. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-24T12:00:15.000Z",
    "title": "What’s in Store for GameFi?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/whats-in-store-for-gamefi/",
    "description": "<p>In the crypto and blockchain landscape, the GameFi realm is blurring the boundaries between gaming and decentralized finance. Leading to the emergence of an immersive and lucrative new sector. GameFi, a term coined to stand for the intersection of video games and DeFi, has gained significant traction in recent years. As we head further into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/whats-in-store-for-gamefi/\">What’s in Store for GameFi?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-24T11:45:07.000Z",
    "title": "Analyst Flips Long-Term Bullish on One Ethereum Rival, Says Altcoin May Perform ‘Super Well’ in Next Bull Run",
    "url": "https://dailyhodl.com/2023/07/24/analyst-flips-long-term-bullish-on-one-ethereum-rival-says-altcoin-may-perform-super-well-in-next-bull-run/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who called the end of Bitcoin&#8217;s (BTC) 2021 bull market believes that one Ethereum (ETH) challenger is a solid candidate to hold for the long term. Pseudonymous analyst Pentoshi tells his 700,700 Twitter followers that Solana (SOL) looks good on the high timeframe charts after taking out its bear market resistance. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/24/analyst-flips-long-term-bullish-on-one-ethereum-rival-says-altcoin-may-perform-super-well-in-next-bull-run/\">Analyst Flips Long-Term Bullish on One Ethereum Rival, Says Altcoin May Perform ‘Super Well’ in Next Bull Run</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]