[
  {
    "source": "CoinDesk",
    "date": "2024-02-21T22:48:33.000Z",
    "title": "DCG Calls Out Genesis' Settlement With New York as 'Subversive'",
    "url": "https://www.coindesk.com/policy/2024/02/21/dcg-calls-out-genesis-settlement-with-new-york-as-subversive/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Digital Currency Group (DCG) is objecting to the settlement between the New York attorney general and Genesis – the failed crypto lender that was among DCG's array of digital assets businesses."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-21T23:07:08.000Z",
    "title": "Sam Bankman-Fried dismisses conflict-of-interest concerns after changing lawyers",
    "url": "https://cryptoslate.com/sam-bankman-fried-dismisses-conflict-of-interest-concerns-after-changing-lawyers/",
    "description": "<p>Sam Bankman-Fried, the embattled founder of the now-defunct crypto exchange FTX, has replaced his legal team as he approaches the critical sentencing phase of his trial. The change in legal representation was formalized in a court appearance on Feb. 21, the first since Bankman-Fried&#8217;s conviction. The move comes as the former billionaire prepares for his sentencing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sam-bankman-fried-dismisses-conflict-of-interest-concerns-after-changing-lawyers/\">Sam Bankman-Fried dismisses conflict-of-interest concerns after changing lawyers</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T23:00:45.000Z",
    "title": "Bitcoin Fisher Transform Reaches Critical Level Not Seen Since 2021, What This Means",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-fisher-transform-critical/",
    "description": "The Bitcoin price has had a rocky start to the new week after losing its footing above $52,000 on Tuesday. However, all hope is not lost, as indicators still point to a continuation of this trend. Crypto analyst Tony The Bull has identified an important trend in the Bitcoin chart which could trigger a continuation of the trend back above $52,000. Bitcoin 1-Week Fisher Transform At Crucial Point In an analysis posted on X (formerly Twitter), the crypto analyst shared a chart that showed the Bitcoin Fisher Transform in comparison to price. Most importantly, the chart showed the 1-week Fisher Transform and how it has moved since 2017. Related Reading: Finance Expert Drops Grim Prediction For US Economy, Says Bitcoin Is The ‘Parachute’ The analysis shows some similarities between the current trend and the trends seen in 2017. A similar trend was also seen in 2019 and 2021, where the Fisher Transform rose rapidly before falling. But the importance of this trend lies in where the Fisher Transform heads next from here. The current important level is the 1.5 Standard Deviation, which has been a crucial point whenever this trend has occurred. Now, if the Fisher Transform is able to stay above this level, it is bullish for the price. However if it falls below this standard deviation, it is very bearish for the price. Source: Tony The Bull on X “This is a pivotal area based on historical price action and its exhibiting 2017-like behavior not seen in 2019 or 2021,” the crypto analyst explains. “Below it tends to incite bearish trends, while holding above gives bulls extra vigor.” BTC price at $51,100 &#124; Source: BTCUSD on Tradingview.com Bears And Bulls Vie For Control Over BTC Price The interest in the next direction of the Bitcoin price has seen bulls and bears lock horns over which camp will reclaim control of BTC. This has seen the price of the digital asset fluctuate wildly over the last few days, going from $53,000 to below $51,000, before bouncing back up once again in the early hours of Wednesday. Related Reading: Dogecoin Adoption Explodes In Stunning Move, Can DOGE Chart A Path To $0.2? This tug-of-war continues to hold the price of Bitcoin down, but investor sentiment seems to be climbing even through this. According to the Bitcoin Fear &#38; Greed Index, investor sentiment has reached Extreme Greed for the first time in one year. Historically, the index going into extreme greed has signaled the top of the market, with prices trending downward not too long after. However, Bitcoin is still seeing positive indicators, with its trading volume rising more than 40% in the last 24 hours alone. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Freepik, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T23:01:18.000Z",
    "title": "Ripple CEO Brad Garlinghouse Says XRP ETF ‘Makes Sense,’ Predicts Inevitable Wave of New Crypto Investment Products",
    "url": "https://dailyhodl.com/2024/02/21/ripple-ceo-brad-garlinghouse-says-xrp-etf-makes-sense-predicts-inevitable-wave-of-new-crypto-investment-products/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Grayscale-Investments-Makes-Move-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive of payments platform Ripple says that it would “make sense” if exchange-traded funds (ETF) centered around XRP and other digital assets were created. In a new interview with Bloomberg, Ripple Labs CEO Brad Garlinghouse predicts that a new wave of crypto investment products will appear in the future. “I think it makes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/ripple-ceo-brad-garlinghouse-says-xrp-etf-makes-sense-predicts-inevitable-wave-of-new-crypto-investment-products/\">Ripple CEO Brad Garlinghouse Says XRP ETF ‘Makes Sense,’ Predicts Inevitable Wave of New Crypto Investment Products</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]