[
  {
    "source": "CryptoGlobe",
    "date": "2024-03-22T23:00:00.000Z",
    "title": "Cardano Defies Crypto Downturn: Smart Contract Development Up 170% Year-to-Date",
    "url": "https://www.cryptoglobe.com/latest/2024/03/cardano-defies-crypto-downturn-smart-contract-development-up-170-year-to-date/",
    "description": "Amid a wider cryptocurrency market downturn that has seen cryptocurrency prices plunge after Bitcoin ($BTC) hit a new all-time high, the smart contract platform Cardano ($ADA) has been seeing its smart contract development skyrocket. Data from Cardano Blockchain Insights shows a remarkable increase of over 170% in Plutus scripts, the network’s language for building smart […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-22T23:00:42.000Z",
    "title": "SatoshiDEX Is Launching the World’s First DEX on Bitcoin, Surpassing $5M in Fundraising",
    "url": "https://news.bitcoin.com/satoshidex-is-launching-the-worlds-first-dex-on-bitcoin-surpassing-5m-in-fundraising/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_2024-03-22_22-04-41.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. SatoshiDEX is a novel Bitcoin trading platform that introduces flexibility and innovative ideas to the blockchain system. It enables users to: Trade tokens on Bitcoin eliminating the need for wrapped assets and expensive Ethereum fees. Stake and earn $SATX So far, they have raised over $5,000,000 on presale, and presale is going to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T23:00:59.000Z",
    "title": "Dogecoin Whales Go On Massive Buying Spree, Here’s How Much They’ve Bought",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-whales-buying-spree/",
    "description": "Dogecoin has seen a steady rise in activity in the past two days to reverse the period of stagnancy recorded earlier in the week. At the time of writing, DOGE is up by 7% in the past 24 hours, reversing some of the corrections it has experienced in the past week. Turns out some Dogecoin whales have been going on a massive buying spree, as indicated by on-chain data.  Popular crypto analyst Ali Martinez highlighted this accumulation trend by tweeting that DOGE whales have bought over 25 million DOGE worth around $3.75 million in the past three days.  Crypto Analyst Reveals Dogecoin Whale Accumulation According to the Santiment chart shared by Ali Martinez on social media, wallets holding between 10 million to 100 million DOGE tokens have now pushed their total balance to 15.63 billion DOGE after adding 25 million DOGE in the past 24 hours.  Related Reading: Don’t Panic: The Bitcoin Bull Market Is Far From Over, Quant Says Interestingly, the chart dynamics indicate this is a major change in sentiment from this cohort of traders, as their collective balance has been in a freefall since March 14th. #Dogecoin whales have bought 25 million $DOGE in the past 72 hours, worth around $3.75 million! pic.twitter.com/y1RnRffWhv — Ali (@ali_charts) March 21, 2024 Why Does This Matter? Crypto whales typically move the market. Increased buying or selloff from a few large traders could change the sentiment of other investors, and they could further cascade a price surge or decline. Notably, the chart shared by Martinez shows that the total balance of DOGE&#8217;s whale addresses has largely corresponded with the price increase.  For example, the drop on March 14 in the total whale balance corresponded with a 33% drop in DOGE&#8217;s price from $0.1878 on March 14 to March 20. However, DOGE is now showing signs of recovery and is currently trading at $0.1629. While Dogecoin whales and FOMO buyers may temporarily push DOGE higher, its long term success really depends on whether it can transform from a memecoin into a widely used cryptocurrency. Dogecoin recently scored a point in its bid to achieve mainstream adoption. Coinbase, America&#8217;s biggest crypto exchange, revealed plans to introduce Dogecoin along with Litecoin and Bitcoin Cash to its regulated futures contract offerings. Related Reading: Crypto Expert Reveals The Possibility Of Bitcoin Reaching $500,000 According to an earlier prediction by Ali Martinez, DOGE could reach the $1 mark in April. His prediction was based off of the crypto&#8217;s performance after similar breakouts in 2017 and 2021.  A large part of this prediction coming to manifestation is a bullish sentiment from whale addresses, especially if they continue on an accumulation pattern. A key price level to watch is $0.20. If DOGE breaks above this resistance level, it could continue surging higher on buying momentum. But if it fails to break $0.20 and starts dropping again, it may indicate the rally is running out of steam. DOGE price trending at $0.156 &#124; Source: DOGEUSDT on Tradingview.com Featured image from CryptoRank, chart from Tradingview.com"
  }
]