[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-12T02:47:00.000Z",
    "title": "Shiba Inu Burn Rate Skyrockets 8,900% as Akai Token Destroys 804 Million $SHIB",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shiba-inu-burn-rate-skyrockets-8900-as-akai-token-destroys-804-million-shib/",
    "description": "The burn rate of the meme-inspired cryptocurrency Shiba Inu ($SHIB) has recently surged after a project known as Akai Token ($AKAI) moved 804 million tokens to a dead wallet in a historic burning frenzy. The AKAI project, according to recently unveiled data, has recently destroyed over $9000 worth of the meme-inspired cryptocurrency’s circulating supply, helping […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T03:00:36.000Z",
    "title": "Unmoved Bitcoin Supply Hits New all time high as BTC rally resumes",
    "url": "https://www.newsbtc.com/bitcoin-news/unmoved-bitcoin-supply-hits-new-ath/",
    "description": "Bitcoin continues to dominate the market as it struggles to find a continued surge in price. In its latest weekly report, crypto exchange Bitfinex highlighted a key part of Ark Invest&#8217;s report to show growing support from strong holders and improved institutional sentiment toward Bitcoin.  As of early July, 70% of the existing Bitcoin supply of 19.4 million BTC has remained unmoved for at least 12 months. This means that Bitcoin’s unmoved supply, that is, the amount of BTC that hasn’t been transferred in over a year, just reached an all-time high.  Bitcoin Sees Growing Institutional Interest Institutional investors are taking interest in Bitcoin as a hedge against inflation. When major players put serious money into an asset, it signals they believe in its future value.  Related Reading: Bitcoin Hash Rate Retakes All-Time High As Miners Continue To Expand Capacity According to the report, several factors have contributed to the increase in long-term confidence of Bitcoin investors. One major influence is the news of major investment companies filing for Bitcoin spot ETFs which seemed to have fueled more interest.  Over-the-counter (OTC) trading reached a one-year high in June, surging by 60% in the past quarter alone. These OTC trading deals are now more popular with institutional investors, indicating BTC is becoming a preferred investment option. BTC price recovers above $30,500 resistance &#124; Source: BTCUSD on TradingView.com This surge in Bitcoin’s unmoved supply definitely means positive things for the price of Bitcoin. As more of the supply becomes locked up by long-term holders, the available supply in circulation decreases. According to the law of supply and demand, when supply goes down but demand remains the same or increases, the price goes up. It’s not all bullish for the asset though because, according to Bitfinex&#8217;s report, news of the spot ETF filing by BlackRock and other investment companies led to a surge of more than 38% in Bitcoin Open Interest. This suggests that derivatives traders may be dominating the current market momentum, which might negatively affect the price of BTC in the short term. Percent of Supply Last Active 5+ Years Ago Reaches All-Time High Following in the same vein as the Bitfinex report, on-chain data from Glassnode alerts also show that Bitcoin’s supply which has remained unmoved for more than 5 years recently reached an all-time high of 29.070%. Clearly, this shows that more people are holding Bitcoin as a long-term investment rather than trading or spending it. Related Reading: BNB Whale Moves $35 Million To Binance Ahead Of Arkham (ARKM) Sale With Bitcoin having a fixed supply, the unmoved supply of the cryptocurrency is expected to continue to rise as long as investment institutions such as MicroStrategy continue to accumulate more of the cryptocurrency. Featured image from iStock, chart from TradingView.com"
  }
]