[
  {
    "source": "CoinDesk",
    "date": "2024-03-07T10:26:51.000Z",
    "title": "Figment, Apex to List Ether and Solana Staking ETPs on SIX Swiss Exchange",
    "url": "https://www.coindesk.com/business/2024/03/07/figment-apex-to-list-ether-and-solana-staking-etps-on-six-swiss-exchange/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Interest in ETH and SOL has increased substantially over the past few months and the ETPs will contribute to greater access to staking rewards for a wide audience, Figment said."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T10:30:14.000Z",
    "title": "Solana Regains 2-Year High as BONK, WIF Meme Coin Volume Surges",
    "url": "https://decrypt.co/220543/solana-2-year-high-bonk-wif-trading-volume",
    "description": "Soaring meme coin trading volumes pushed Solana's native coin, SOL, back to the 2-year high it saw on Tuesday when Bitcoin was rallying."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T10:29:37.000Z",
    "title": " Philippine gov&#039;t blocks unlicensed crypto exchange sites, Binance unaffected ",
    "url": "https://cointelegraph.com/news/philippine-unlicensed-crypto-blocked-binance-accessible",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTJhOTg5N2QtYzE3ZS00YTMzLWExYWEtYTEwODU4ODVjYTQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Binance is still accessible in the country even after the three-month countdown that the Philippine SEC set for banning the crypto trading platform. </p>\n                    <p><p data-ct-non-breakable=\"true\">The Philippine National Telecommunications Commission (NTC) has started to block websites of crypto companies offering investment products in the country without the necessary licenses. </p><p>On March 7, local media outlet Bitpinas <a href=\"https://bitpinas.com/regulation/ntc-orders-blocking-of-unlicensed-crypto-exchanges/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the websites of crypto firms MiTrade and OctaFX were now inaccessible in the country. The NTC issued an order on Feb. 21 to internet service providers to block applications and websites of MiTrade for violating regulations enforced by the Philippines’ Securities and Exchange Commission (SEC).</p><p>The NTC’s action follows a request from the SEC to begin blocking websites of crypto platforms operating without a license in the country. In a press release, the Philippine SEC Chairperson Emilio Aquino said that the NTC’s action will help prevent investment scams in the country. Aquino said: </p><p><a href=\"https://cointelegraph.com/news/philippine-unlicensed-crypto-blocked-binance-accessible\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T10:26:21.000Z",
    "title": " Women in crypto: Contrasting industry dynamics with traditional sectors ",
    "url": "https://cointelegraph.com/news/women-in-crypto-an-overview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNmRmZTU4YjktOWVhNi00N2M5LWFjNzAtODcwMGI3YjAwNmJjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Delve into the realm of women in crypto and blockchain, contrasting their roles and opportunities with traditional industries.</p>\n                    <p><p>The cryptocurrency world has seen exponential growth in the last decade, with technological innovation being a driving factor for transformation and disruption in the sector. In this evolving landscape of <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain</a> and <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrency</a>, acknowledging and fostering gender diversity has become a vitally important aspect. </p><p>It is imperative to recognize the contributions and perspectives of individuals across the gender spectrum, including men, women and non-binary individuals, to ensure the development of a more inclusive and equitable professional ecosystem. </p><p>This article particularly focuses on women and explores the current state of women in crypto and blockchain, contrasting it with traditional sectors such as fintech, healthcare and retail. By examining statistics, exploring gender dynamics and highlighting the experiences of women pioneers, the article sheds light on the challenges and opportunities for female representation in crypto and its contrasting dynamics with traditional business landscapes.</p><p><a href=\"https://cointelegraph.com/news/women-in-crypto-an-overview\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T10:13:37.000Z",
    "title": " Bitcoin miner revenue records second-best day in history  ",
    "url": "https://cointelegraph.com/news/bitcoin-miner-revenue-second-best-day-history",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZjM0MDk0ZjctOWYzOS00ZDNmLTk0NjAtMTYzOTNkMzMzZGJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin prices retraced over 22% back in April 2021, when daily miner revenue reached its all-time high of $77.3 million.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bitcoin miner revenue recorded its second-best day in history on March 6, a day after Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price hit a new all-time <a href=\"https://cointelegraph.com/news/bitcoin-price-sets-new-record-high-69k\">high</a> above $69,200.</p><p>Daily Bitcoin miner revenue reached $75.9 million on March 6, according to an X post by Julio Moreno, head of research at CryptoQuant.</p><p>The revenue surge came the same day as <a href=\"https://cointelegraph.com/news/hut-8-closes-bitcoin-mining-site-citing-surging-energy-costs\">Bitcoin miner Hut 8</a> announced closing its mining site in Drumheller, Alberta, Canada, with immediately effect due to power disruptions and surging energy costs. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-miner-revenue-second-best-day-history\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T10:15:16.000Z",
    "title": "BlockFi hails ‘excellent outcome’ in $875 million settlement with FTX",
    "url": "https://cryptoslate.com/blockfi-hails-excellent-outcome-in-875-million-settlement-with-ftx/",
    "description": "<p>Bankrupt crypto firms FTX and BlockFi have reached an in-principle agreement to settle all litigation and disputes for nearly $900 million, according to a Mar. 6 court filing. Under the terms, BlockFi will receive $185.2 million in compensation for customer claims against the FTX debtors. Additionally, the insolvent lender is set to obtain a separate [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blockfi-hails-excellent-outcome-in-875-million-settlement-with-ftx/\">BlockFi hails &#8216;excellent outcome&#8217; in $875 million settlement with FTX</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T10:22:06.000Z",
    "title": "LEGEND Token Announces Presale Event for Revolutionary Digital Collectibles Platform",
    "url": "https://cryptodaily.co.uk/2024/03/legend-token-announces-presale-event-for-revolutionary-digital-collectibles-platform",
    "description": "LEGEND Token Announces Presale Event for Revolutionary Digital Collectibles Platform"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T10:22:09.000Z",
    "title": "LEGEND Token Announces Presale Event for Revolutionary Digital Collectibles Platform",
    "url": "https://www.cryptopolitan.com/legend-token-announces-presale-event-for-revolutionary-digital-collectibles-platform/",
    "description": "Laurens, USA, March 7th, 2024, Chainwire LEGEND Token, the premier platform for digital collectibles, is excited to announce its presale event, starting on March 5th 2024. This event marks the beginning of a new era in digital ownership, offering collectors and creators a unique opportunity to be part of the LEGEND Token ecosystem from the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T10:20:31.000Z",
    "title": "BofA Boasts 800 AI Patents as it Doubles Down on Customer Service Tech",
    "url": "https://www.cryptopolitan.com/bofa-boasts-800-ai-patents/",
    "description": "Bank of America (BofA) has topped up its AI-related patents amid a broad plan to deploy the technology to serve the customers better.&#160; BofA Now Has 800 AI Related Patents BofA said Wednesday it secured 644 U.S. patents last year covering different areas, including artificial intelligence, information security, and machine learning. The record represents a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T10:17:50.000Z",
    "title": "Meta Unveils AI-Powered Video Recommendations Across Facebook",
    "url": "https://www.cryptopolitan.com/meta-unveils-ai-powered-video-recommendation/",
    "description": "Meta, formerly known as Facebook, is making significant strides in artificial intelligence (AI), unveiling plans to integrate AI-powered video recommendations across its platform, according to recent reports from Engadget. The tech giant aims to enhance user engagement and relevance, drawing inspiration from the success of TikTok&#8217;s recommendation engine. Meta&#8217;s AI integration strategy Under the leadership [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T10:12:59.000Z",
    "title": "Binance.US struggles amid SEC lawsuit and banking hurdles",
    "url": "https://www.cryptopolitan.com/binance-us-struggles-amid-sec-lawsuit/",
    "description": "In a recent development that has significantly impacted Binance.US, the United States Securities and Exchange Commission&#8217;s (SEC) lawsuit filed in June has led to severe operational challenges for the cryptocurrency exchange. According to Christopher Blodgett, the Chief Operating Officer of Binance.US, during a deposition shared in a court filing on March 5, the legal action [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T10:12:25.000Z",
    "title": "Ransomware gang BlackCat exit scams affiliates with millions in Bitcoin after attacking medical IT firm",
    "url": "https://crypto.news/ransomware-gang-blackcat-exit-scams-affiliates-with-millions-in-bitcoin-after-attacking-medical-it-firm/",
    "description": "Cyber gang BlackCat allegedly scammed its own affiliates as the group went dark shortly after it disrupted the U.S. healthcare system. An address associated with the ransomware gang BlackCat, also known as ALPHV and Noberus, received approximately $22 million worth&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T10:20:00.000Z",
    "title": "Fetch AI Fetches Fire – 110% Price Surge Ignites All-Time High",
    "url": "https://www.newsbtc.com/news/fetch-ai-fetches-fire-110-price-surge-ignites-all-time-high/",
    "description": "In the volatile world of cryptocurrencies, the recent bullish trend sweeping through the market has not only propelled Bitcoin to new heights but has also catapulted altcoins like Fetch.ai (FET) to unprecedented levels. FET marked a significant milestone with a fresh all-time high today, following the lead set by the primary cryptocurrency. At the time of writing, FET is priced at $2.76, with a trading volume of $2.77 billion over the last 24 hours. Its market capitalization stands at nearly $2 billion. Notably, the coin has experienced a remarkable 110% increase in price within the past seven days, data from CoinMarketCap shows. Related Reading: Can DOGE Avoid A Dive? Sell Pressure Puts Memecoin To The Test Fetch AI (FET) In Full Steam The recent surge in FET&#8217;s price is attributed to the Fetch.AI Foundation&#8217;s announcement on March 5, 2024, introducing &#8220;Fetch Compute&#8221; as part of a substantial $100 million investment in advancing the AI economy. FET soaring in the 24-hour timeframe. Source: CoinMarketCap The initiative involves deploying top-of-the-line Nvidia GPUs, including models like H200, H100, and A100, to supercharge innovation within the Fetch.AI ecosystem. Funded through the Fetch Ecosystem Fund, this move addresses the GPU shortage, providing developers and users with enhanced computing power to create advanced models and solutions. Will Fetch AI Hit $60 Billion Market Cap? Many cryptocurrency experts have recently been bullish about Fetch.ai&#8217;s future prospects. There is a lot of potential for FET to continue growing, according to Crypto Rover, a well-known expert. $FET is going exponential. Most likely you think, it will top out any time soon. But I bought at $0.7 and I will not sell anytime soon. It is now at $2b market cap. I think it will top out around $40b-$60b. 20x from here seems reasonable. pic.twitter.com/n38Mc4m6dk — Crypto Rover (@rovercrc) March 6, 2024 Rover recently posted on X that they bought $FET at $0.70 and have no plans to sell anytime soon. With the bold statement, &#8220;It is now at $2b market cap,&#8221; Rover revealed much more information. The range he is predicting is $40–$60 billion. Some 100% of the FET&#8217;s total circulating supply is generating profits for its investors, per the Global In/Out of the Money (GIOM) indicator. A cohort holding 18,350 FET valued $36,700, acquired at an average price of $1.82, was the last to turn a profit. FET GIOM data. Source: IntoTheBlock This demonstrates that investors are still amassing FET despite the ongoing upward trend and confirmed profits. As a result, offering assistance for additional price escalations. In a related development, Fetch AI has just established a strategic alliance with Deutsche Telekom, a notable corporate organization, reinforcing its standing as a major entity in the blockchain industry. FET market cap currently at $2.27 billion. Chart: TradingView.com Whale Appetite Up Meanwhile, FET whale addresses have been selling off their holdings. These massive wallets have made approximately $17 million from the sale of 8.45 million FET since then. Related Reading: Solana DeFi Landscape Thrives With Record $11 Billion Trading Volume By March 11, according to CoinCodex&#8217;s short-term Fetch.ai price prediction, the currency would hit $1.792. By April 5, the prediction rose to $1.924. Technical analysis on the site was positive, with 26 signs indicating price appreciation and 4 indicating price decline. Featured image from Freepik, chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-07T10:22:25.000Z",
    "title": "Opulous: Unlocking New Revenue Streams for Music Artists and Investors",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/opulous-unlocking-new-revenue-streams-for-music-artists-and-investors/",
    "description": "<p>The IFPI reports that music streaming now generates 67% of the music industry&#8217;s revenue.  This shift alters music consumption and monetization, posing challenges and opportunities for artists. However, this also means that musicians depend on very few sources of income and Opulous aims to solve this. How Opulous Empowers Music Artists Financially With music streaming [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/opulous-unlocking-new-revenue-streams-for-music-artists-and-investors/\">Opulous: Unlocking New Revenue Streams for Music Artists and Investors</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-07T10:27:00.000Z",
    "title": "SEC Delays Ethereum ETF Approvals, Requests Public Input",
    "url": "https://coinedition.com/sec-delays-ethereum-etf-approvals-requests-public-input/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Is Ethereum ETF Launch Closer? Issuers Remain Confident of the Approval\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Whether_people_want_to_admit_or_not_Adam_is_💯_correct_here_And-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Last Monday, the U.S. Securities and Exchange Commission (SEC) delayed deciding on the Ethereum ETF applications by BlackRock and Fidelity. Instead, the commission launched a comments period for both applications, aiming for feedback from the public on the subject. According to reports, the SEC has asked commenters to provide opinions, explaining if they agree with [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sec-delays-ethereum-etf-approvals-requests-public-input/\">SEC Delays Ethereum ETF Approvals, Requests Public Input</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-07T10:09:47.000Z",
    "title": "Trader Predicts Monster XRP Rally Ending in $2 “Blow-Off Top” by July",
    "url": "https://coinedition.com/trader-predicts-monster-xrp-rally-ending-in-2-blow-off-top-by-july/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/The_XRP_Ledger_just_closed_80_million_ledgers_in_about_10_5_years-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to a crypto trader identified as CoinsKid on X, XRP appears to be setting up for a potential rally in what he described as a “blow-off top theory.” In a recent post, CoinsKid discussed a confluence that could trigger an XRP move towards $2 by July this year, with the potential of breaking above [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/trader-predicts-monster-xrp-rally-ending-in-2-blow-off-top-by-july/\">Trader Predicts Monster XRP Rally Ending in $2 “Blow-Off Top” by July</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-07T10:15:36.000Z",
    "title": "Anthony Scaramucci Says Bitcoin Is at ‘March of 1999’ Stage of Adoption – Here’s What He Means",
    "url": "https://dailyhodl.com/2024/03/07/anthony-scaramucci-says-bitcoin-is-at-march-of-1999-stage-of-adoption-heres-what-he-means/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/03/Anthony-Scaramucci-Says-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Hedge fund veteran and SkyBridge Capital chief executive Anthony Scaramucci says Bitcoin (BTC) is still in the very early stages of adoption. In a new interview with CNBC, Scaramucci predicts Bitcoin’s global adoption will continue to increase in the coming years, leading to massive network growth. He compares Bitcoin’s current adoption rate to the early [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/anthony-scaramucci-says-bitcoin-is-at-march-of-1999-stage-of-adoption-heres-what-he-means/\">Anthony Scaramucci Says Bitcoin Is at ‘March of 1999’ Stage of Adoption – Here’s What He Means</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]