[
  {
    "source": "Decrypt",
    "date": "2023-12-26T22:31:02.000Z",
    "title": "‘We’re Living Longer, But We’re Living Longer, Sicker’: Rejuve CEO",
    "url": "https://decrypt.co/210928/were-living-longer-but-were-living-longer-sicker-rejuve-ceo",
    "description": "A SingularityNET spinoff hopes to leverage AI and blockchain to crowdsource better health and longevity."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T22:15:00.000Z",
    "title": " Surge in BNB Chain activity backs 11% rally, but can BNB push above $300? ",
    "url": "https://cointelegraph.com/news/surge-in-bnb-chain-activity-backs-11-rally-but-can-bnb-push-above-300",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTg2ZmI1MzMtZmQyZS00ODYxLTk4ZTMtNmQyOGUzZWZhYzFlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BNB Chain saw an uptick in deposits and activity, but is the fresh momentum sustainable? </p>\n                    <p><p>Binance Coin, the native token of BSC Chain (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) took a different direction from the wider cryptocurrency market on Dec. 26 by surging 11% to reach its highest level in six months. Although BNB initially struggled to break the $300 resistance, the rally successfully closed the market capitalization gap opened by Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>).</p><p>Before Dec. 23, BNB held the position of the third-largest cryptocurrency (excluding stablecoins). However, SOL's impressive 50% gains over seven days changed that. The question now is whether BNB can maintain a market cap exceeding $46 billion to regain its third spot. Both BSC Chain and Solana, despite their decentralization merits, offer fast and cost-effective blockchains that don't exclusively rely on layer-2 scaling solutions.</p><p>A significant portion of BNB token's value comes from reduced trading fees and exclusive launchpad offers and services from Binance. Investors initially feared that the exchange would lose market share swiftly after its founder, Changpeng 'CZ' Zhao, pleaded guilty to U.S. Federal charges on November 21. However, this was not the case, at least until the trial concludes and Binance is required to report all trades to a watchdog designated by the Justice Department. Furthermore, Binance's recent engagement with the U.S. Commodity Futures Trading Commission (CFTC) on Dec. 18 further decreased the risk of regulatory shutdown.</p><p><a href=\"https://cointelegraph.com/news/surge-in-bnb-chain-activity-backs-11-rally-but-can-bnb-push-above-300\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T22:24:11.000Z",
    "title": "Can the Podcast Industry Regroup with AI in 2024?",
    "url": "https://www.cryptopolitan.com/podcast-industry-with-ai-in-2024/",
    "description": "The podcast industry is gearing up for a robust 2024, brimming with optimism for growth, diversification, and technological innovation. Key industry leaders, including Jen Sargent, CEO of Wondery, and Conal Byrne, CEO of the iHeartMedia Digital Audio Group, shared their insights on the sector&#8217;s prospects. Global expansion takes center stage Despite recent challenges, podcasting remains [&#8230;]"
  }
]