[
  {
    "source": "Decrypt",
    "date": "2023-11-10T22:41:33.000Z",
    "title": "This Week in Coins: Bitcoin Hits 18-Month High, Solana’s Market Cap Closes in on USDC",
    "url": "https://decrypt.co/205554/this-week-in-coins-bitcoin-hits-18-month-high-solana-market-cap-near-usdc",
    "description": "Bitcoin’s rally continued and a number of other alts experienced powerful gains this week—for a number of reasons. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-10T23:00:40.000Z",
    "title": "Coinbase rolls out on-chain credential verification",
    "url": "https://cryptoslate.com/coinbase-rolls-out-on-chain-credential-verification/",
    "description": "<p>Coinbase announced a feature on Nov. 9 that allows users to attest their account and country credentials on-chain and access additional benefits. Coinbase&#8217;s help pages indicate that issued verifications are meant to serve as a &#8220;trusted badge&#8221; that grants access to on-chain apps and benefits. Coinbase said that verification will initially provide users with a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-rolls-out-on-chain-credential-verification/\">Coinbase rolls out on-chain credential verification</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T23:00:05.000Z",
    "title": "When Is the Next BTC Halving Date? Bitcoin Halving Guide",
    "url": "https://www.newsbtc.com/news/bitcoin/when-is-the-next-btc-halving-date-bitcoin-halving-guide/",
    "description": "Guide: What Is The Bitcoin (BTC) Halving? The anticipation around the next BTC halving is palpable among investors and cryptocurrency enthusiasts alike. This process, which slashes the reward for mining Bitcoin transactions in half, is a pivotal event for the economy of the flagship cryptocurrency. The next BTC halving date is not just a mark on the calendar; it&#8217;s a beacon for potential shifts in value and market dynamics, making the question &#8220;when is the next BTC halving&#8221; all the more critical for market participants. This comprehensive guide dives deep into the concept of Bitcoin halving, its historical impact, and what the future holds as we approach the next halving. Bitcoin Network 101: The Basics Explained The next BTC halving is a seminal event in the Bitcoin blockchain&#8217;s timeline, marking the point at which the reward for mining new blocks is halved. This event is not just a technical adjustment, but a significant milestone that historically has had profound implications for Bitcoin&#8217;s economics and market sentiment. Since the 2020 halving, miners have been receiving 6.25 Bitcoins (BTC) per successfully mined block, a reward that incentivizes the decentralized security of the network. Looking ahead, the next BTC halving is projected to take place in early-to-mid 2024, a moment when the mining incentive will decrease to 3.125 BTC per block. This editorial delves into the intricacies of the next BTC halving, examining its anticipated date, the countdown to the event, and the broader implications for Bitcoin&#8217;s supply and valuation. We will also explore the historical context of past halvings to understand the potential future trajectory of Bitcoin as the reward continues to halve towards the smallest unit of a Bitcoin, one Satoshi. The Bitcoin network is a triumph of cryptographic achievements and economic incentives that create a trustless system for value transfer. At its core, the network is a distributed database, known as the blockchain, that maintains a continuously growing list of transaction records hardened against tampering and revision. It employs a consensus algorithm called Proof of Work (PoW) to ensure network synchrony and security. Bitcoin Mining 101 Miners, who are network participants with specialized hardware, compete to solve cryptographically hard puzzles. The solution to these puzzles requires a significant amount of computational power and energy. The first miner to validate a block of transactions by solving the puzzle is granted the right to append that block to the blockchain. This process is referred to as &#8216;mining&#8217; a block, and it is through this mechanism that transactions are confirmed and the network is secured. The reward for mining is twofold: miners collect transaction fees from each transaction included in the new block, and they are also awarded a block subsidy. This subsidy is composed of newly created bitcoins and is the mechanism through which new bitcoins are introduced into circulation. The block subsidy is predetermined by the Bitcoin protocol and undergoes a halving event every 210,000 blocks, which historically occurs approximately every four years. The Bitcoin protocol is designed to be a self-regulating market system. The difficulty of the cryptographic puzzles adjusts approximately every two weeks (“Bitcoin Difficulty Adjustment”), ensuring that the time between each block found remains close to ten minutes, despite the fluctuating amount of computational power dedicated to mining. This difficulty adjustment is critical to the network&#8217;s stability and the predictability of Bitcoin issuance. Definition And Rationale Behind BTC Halving The BTC halving is an event that is deeply embedded in the Bitcoin protocol, serving as a deflationary mechanism by design. It is a deliberate algorithmic adjustment that occurs every 210,000 blocks, which historically equates to roughly every four years. During this event, the block subsidy awarded to miners for each block mined—comprising new bitcoins created and added to the circulating supply—is cut in half. This halving process is a critical component of Bitcoin&#8217;s economic model, which is characterized by a capped supply limit of 21 million coins. The halving serves to enforce a synthetic form of inflation that is programmatically decreasing over time, ensuring that the issuance of new bitcoins follows a predictable deceleration curve akin to the extraction of a finite resource. Key Narrative Behind The Bitcoin Halving The rationale behind this process is multifaceted: Controlled Supply Emission: By algorithmically enforcing a reduction in the rate at which new bitcoins are created, the halving event ensures that the total supply approaches the maximum cap asymptotically, a stark contrast to fiat currencies which can be printed without limit. Inflation Hedge: The halving events contribute to Bitcoin&#8217;s proposition as a hedge against inflation. As the rate of supply expansion slows down, assuming demand remains constant or increases, the purchasing power of Bitcoin should, in theory, strengthen over time. Security Incentives: The block subsidy is a critical incentive for miners to expend energy securing the network. As the subsidy decreases, the expectation is that a corresponding increase in the value of Bitcoin will offset the reduced block reward, maintaining or enhancing the security budget. Market Anticipation and Speculation: Halving events are often accompanied by significant market attention and speculation, leading to increased trading activity and liquidity as investors attempt to predict and capitalize on potential price movements resulting from the supply shock. Long-Term Viability: By enforcing a methodical reduction in new supply, Bitcoin&#8217;s halving events are designed to ensure the network&#8217;s long-term viability, preventing the rapid depletion of mining rewards and encouraging sustainable growth. Brief History Of Past BTC Halving Dates And Their Impact The history of Bitcoin halving dates back to November 28, 2012, when the first halving occurred at block 210,000. Prior to this event, the block reward was 50 BTC. Post-halving, it was reduced to 25 BTC. The impact was significant, with the price of Bitcoin increasing from approximately $12 in November 2012 to over $1,100 in November 2013, marking an increase of over 9,000%. This price surge is attributed to the reduced supply of new bitcoins and increased media and investor attention. The Second and Third BTC Halving The second BTC halving took place on July 9, 2016, at block 420,000, further reducing the block reward to 12.5 BTC. The price at the time of the halving was around $650, and over the next 18 months, Bitcoin experienced unprecedented growth, reaching an all-time high of nearly $20,000 in December 2017. This represented an approximate 3,000% increase from the halving date to the peak of the market cycle. The most recent, third Bitcoin halving occurred on May 11, 2020, at block 630,000, cutting the block reward down to the current 6.25 BTC. The price of Bitcoin on the halving date hovered around $8,600. Following this halving, Bitcoin entered another bull market, reaching a peak of around $64,000 in April 2021, which corresponds to an increase of roughly 644% from the halving date to the peak. Each BTC halving has been followed by a period of increased Bitcoin prices, though the extent and duration of these bull markets have varied. The halvings are believed to have a direct impact on the price due to the reduced rate of new Bitcoin creation, which, if demand remains constant or increases, can lead to a higher price per Bitcoin. The Fourth Bitcoin Halving It&#8217;s important to note that while the Bitcoin halvings are significant, they are not the sole drivers of Bitcoin&#8217;s price. Other factors such as regulatory changes, technological advancements, macroeconomic trends, and shifts in investor sentiment also play crucial roles in the cryptocurrency&#8217;s valuation. The next BTC halving is estimated to occur on April 24, 2024, at block 840,000, where the block reward will be reduced to 3.125 BTC. As with previous halvings, there is considerable speculation about the potential impact on the price and mining dynamics of Bitcoin. Historical patterns suggest a potential increase in Bitcoin&#8217;s price, but the actual outcome will depend on a complex interplay of market forces at the time. List Of The Next BTC Halving Dates Bitcoin halvings occur every 210,000 blocks, which, with an average block time of roughly 10 minutes, translates to approximately every four years. Given that the last halving occurred in May 2020, we can project the next BTC halvings by adding four years to the previous halving date, keeping in mind that variations in actual block times can cause slight deviations from these estimates. Here is a projected list of the next BTC halving dates until the emission of new bitcoins reaches zero: The Next BTC Halving: Expected at block 840,000, around April 2024, reducing the block reward to 3.125 BTC. 2028 Halving: Expected at block 1,050,000, reducing the block reward to 1.5625 BTC. 2032 Halving: Expected at block 1,260,000, reducing the block reward to 0.78125 BTC. 2036 Halving: Expected at block 1,470,000, reducing the block reward to 0.390625 BTC. 2040 Halving: Expected at block 1,680,000, reducing the block reward to 0.1953125 BTC. 2044 Halving: Expected at block 1,890,000, reducing the block reward to 0.09765625 BTC. 2048 Halving: Expected at block 2,100,000, reducing the block reward to 0.048828125 BTC. 2052 and Beyond: The next BTC halvings will continue every four years, with the block reward continuing to halve until it becomes negligible. The process will continue until the maximum supply of 21 million bitcoins has been reached, which is estimated to occur by the year 2140. After the final Bitcoin has been mined, miners will no longer receive block subsidies and will rely solely on transaction fees as compensation for their contribution to the network&#8217;s security. Projecting the Next BTC Halving Date When Is The Next BTC Halving Date The next BTC halving is projected to occur when the Bitcoin blockchain reaches block 840,000. Based on the average time it takes to mine a block, the halving events have historically taken place approximately every four years. Given the current block height and the average block time, the next BTC halving is estimated to happen in April 2024. Current Data And Prediction Of The Next BTC Halving Date As of the latest data, the next BTC halving is anticipated to occur in April 2024. However, the exact date cannot be predicted with absolute certainty due to the variable nature of block times; it could potentially occur in late March or extend into May 2024. The most precise estimates suggest that the event will likely take place on April 20, 2024, at 10:24:52 AM UTC, according to CoinWarz. These predictions are based on the current hashrate, or the total computational power, being used to mine and process transactions on the Bitcoin network. Fluctuations in hashrate can affect block times and thus could slightly alter the expected date of the halving. It&#8217;s important to note that while these predictions are made with the best available data, they should be considered as estimates rather than exact timings. Next BTC Halving Countdown How To Track The BTC Halving Countdown To track the BTC halving countdown, enthusiasts and investors can use specialized tools that monitor the current block height and calculate the estimated time until the next BTC halving event based on the average block time. List Of Reliable Countdown Tools Here are the estimated dates and times for the next BTC halving according to various countdown tools, providing a range of perspectives on when the event is expected to occur: NiceHash BTC Next Halving Countdown: Estimates the next BTC halving to occur on March 27, 2024, at 19:28 UTC. This tool factors in the current hashrate and block time to provide its countdown. Bitcoinsensus BTC Halving Countdown: Projects the halving to take place on April 24, 2024, at 04:24:04. Bitcoinsensus provides a detailed countdown timer that updates in real-time. CoinWarz BTC Halving Countdown: Predicts the halving event will happen on April 20, 2024, at 10:24:21 AM UTC. CoinWarz uses a comprehensive approach to estimate the date and time, considering the latest network data. Blockchair BTC Halving Countdown: Offers an estimated date and time for the reward drop on April 24, 2024, at 3:22 AM UTC. Blockchair&#8217;s countdown is based on sophisticated tracking of blockchain metrics. Historical Market Trends Pre- And Post-Halving Historically, Bitcoin has exhibited significant price movements both in anticipation of and following halving events. The halving tends to create a bullish sentiment as the supply of new bitcoins entering the market slows down. Crypto analyst Rekt Capital has delineated the Bitcoin market cycle into five distinct phases surrounding the next BTC halving event, based on historical patterns: Pre-Halving Period: With approximately 5.5 months until the April 2024 halving, history suggests that any significant price retracements in this phase can offer substantial ROI for investors in the months following the halving. Pre-Halving Rally: Roughly 60 days before the halving, a rally typically ensues as investors buy into the hype, anticipating a sell-off post-event. Pre-Halving Retrace: Around the time of the halving, the market often experiences a retrace. This was -38% in 2016 and -20% in 2020, leading to doubts about the halving&#8217;s bullish impact. Re-Accumulation: Post-halving, a period of re-accumulation occurs, often marked by investor exit due to the slow pace of price movement and lack of immediate gains. Parabolic Uptrend: Once Bitcoin exits the re-accumulation phase, it typically enters a parabolic uptrend, leading to accelerated growth and new all-time highs. FAQs About The Next BTC Halving What Is The Bitcoin Network? The Bitcoin network is a decentralized digital ledger that records all Bitcoin transactions across a network of computers. It is powered by blockchain technology, which ensures security and transparency by allowing multiple copies of the data to be stored on nodes across the network. When Is The Next BTC Halving Date? The next BTC halving is estimated to occur on April 24, 2024, but the exact date may vary based on the network&#8217;s hashrate and block time. Are There Websites For The Next BTC Halving Date? Yes, there are several websites that provide countdowns to the next BTC halving, including NiceHash, Bitcoinsensus, CoinWarz, and Blockchair. What Is The Bitcoin Halving? The Bitcoin halving is an event that halves the rate at which new bitcoins are generated by miners. It occurs every 210,000 blocks, roughly every four years, as a part of Bitcoin&#8217;s deflationary monetary policy. What Is The BTC Halving Countdown? The BTC halving countdown is a timer that counts down to the next BTC halving event, indicating how much time is left until the block reward for miners is halved. Why Are BTC Halvings Occurring Every 4 Years? BTC halvings are scheduled to occur every 210,000 blocks, which roughly translates to every four years. This is designed to create a predictable and decreasing supply of new bitcoins, mimicking the extraction curve of a finite resource like gold. What Will Happen After The Last BTC Halving? After the last Bitcoin halving, no new bitcoins will be created, and miners will be compensated solely with transaction fees for their role in processing transactions and securing the Bitcoin network. This is expected to occur around the year 2140. Featured image from iStock"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T23:01:26.000Z",
    "title": "Tron Founder Justin Sun Offers 5% Cut to Hacker After Poloniex Crypto Exchange Loses $125,000,000 in Cyber Heist",
    "url": "https://dailyhodl.com/2023/11/10/tron-founder-justin-sun-offers-5-cut-to-hacker-after-poloniex-crypto-exchange-loses-125000000-in-cyber-heist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/08/hacker-fun.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Tron (TRX) founder Justin Sun is offering a 5% white hat bounty to the hacker who exploited the exchange Poloniex for $125 million in crypto. Sun, who acquired Poloniex in 2019, says that the hacker has a week to accept the offer and return the assets to the wallets he took them from, otherwise, law [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/tron-founder-justin-sun-offers-5-cut-to-hacker-after-poloniex-crypto-exchange-loses-125000000-in-cyber-heist/\">Tron Founder Justin Sun Offers 5% Cut to Hacker After Poloniex Crypto Exchange Loses $125,000,000 in Cyber Heist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]