[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T00:02:27.000Z",
    "title": "Monochrome moves Bitcoin ETF bid to Cboe Australia",
    "url": "https://www.cryptopolitan.com/monochrome-moves-bitcoin-etf-bid-to-cboe/",
    "description": "Monochrome Asset Management, a Brisbane-based company, has moved its request for Bitcoin exchange-traded fund (ETF) licenses to Cboe Australia. The company’s intent was to go public on the Australian Securities Exchange (ASX) by July 2023. The selection of Cboe Australia results from the growing importance of Asia’s investment landscape. Monochrome wants to utilize Cboe’s market [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-04-06T00:00:54.000Z",
    "title": "BlockDAG $10 Dream Outshines ETH Price Prediction & Solana",
    "url": "https://nulltx.com/blockdag-10-dream-outshines-eth-price-prediction-solana/",
    "description": "BlockDAG Reveals Tech Whitepaper with 20,000x ROI Potential Outshining ETH’s Bullish Surge and SOL&#8217;s Meme Coin Slowdown Ethereum (ETH) transaction fees have skyrocketed to a whopping $1.2 billion in Q1 2024, signalling a bullish frenzy in the crypto market. But Solana (SOL) meme coins, the latest craze in the crypto [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-06T00:00:34.000Z",
    "title": "FOMO Gives Way To Fear: Bitcoin-Ethereum Ratio Signals Shift In Crypto Sentiment",
    "url": "https://www.newsbtc.com/bitcoin-news/fomo-gives-way-to-fear-bitcoin-ethereum-ratio-signals-shift-in-crypto-sentiment/",
    "description": "The recent ratio between Bitcoin (BTC) and Ethereum (ETH) prices suggests a potential decline in risk appetite within the crypto market. The ratio has reached its highest level since April 2021, indicating a stronger demand for Bitcoin than its smaller rival, Ethereum. This development has led crypto asset trading firm QCP Capital to speculate that this shift in the ratio could be an early indication of a transition from &#8220;fear of missing out&#8221; (FOMO) to outright fear.  Bitcoin And Ethereum Performance Regarding recent market trends, the second quarter of 2024 has begun with relatively subdued activity. Bitcoin&#8217;s price has dipped below the $70,000 mark and has remained range-bound between $65,000 and $68,000 for the past few days despite briefly touching the $70,000 mark on Monday.  Related Reading: XRP To $20 And Ethereum To $20,000: Crypto Analyst Reveals When This Will Happen According to QCP&#8217;s analysis, the inflow of funds into the spot Bitcoin Exchange-Traded Fund (ETF) market has not been substantial enough to drive significant price movements in either direction.  As a result, the company has observed that funding rates have stabilized, and the front end of the forward curve has declined from previous highs of 50% to less than 20% currently. Interestingly, while the front end of the forward curve has decreased, the back end remains elevated. This has led to interest in rolling spot-forward basis positions further out, potentially driven by the continued demand for long-dated Bitcoin calls extending into 2025. On the other hand, Ethereum&#8217;s performance has been relatively weak. QCP also notes that the ETHBTC ratio cross-tests a critical support level after breaking below 0.05. Notably, there has been sustained selling of Ethereum calls, resulting in lower volatility and downward pressure on the price. Ultimately, QCP finds that these developments are prompting speculation as to whether this could be an early sign of FOMO turning into fear, particularly about Ethereum&#8217;s role as a proxy for altcoins. While Bitcoin may find support from topside demand and ETF inflows, Ethereum&#8217;s performance and its impact on altcoins will be important factors to watch closely. Will BTC Experience A Double-Top? Renowned crypto analyst Crypto Con has raised an intriguing question about whether BTC is poised for a double top similar to the patterns observed in 2013 and 2021. Analyzing previous market cycles, Crypto Con highlights that more evident double tops, such as those witnessed in the first and third cycles of 2021, triggered significant initial surges on the Fisher Transform indicator.  In contrast, the 2017 double-top formation showed a more subtle initial rise in June. Notably, all final cycle tops ended with a regular bearish divergence, where the price reached higher levels while the indicator declined, as seen in the chart below. Related Reading: Polygon Observes Buy Signal: Analyst Suggests MATIC Rebound To This Level Currently, Bitcoin is approaching levels similar to those seen in 2017, as seen in the lower part of the chart. Crypto Con suggests that if the Fisher Transform indicator can consolidate around these levels without spiking to the line seen in 2013 and 2021, it could indicate a higher likelihood of a single top formation, which is the analyst&#8217;s most likely outcome, for December 2024, marking the top of this cycle. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-06T00:00:01.000Z",
    "title": "Binance Launchpool Rolls Out Support for New Layer-1 Crypto Project Focused on Developers",
    "url": "https://dailyhodl.com/2024/04/05/binance-launchpool-rolls-out-support-for-new-layer-1-crypto-project-focused-on-developers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/04/rolls-support-new-on.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top global crypto exchange Binance is rolling out support for a new layer-1 crypto project via its Launchpool platform. Binance Launchpool, which lets users stake coins to farm new assets, says its 51st project will be Saga (SAGA), a web3 platform designed for developers. Saga aims to enable developers to launch interoperable, application-specific chains called [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/05/binance-launchpool-rolls-out-support-for-new-layer-1-crypto-project-focused-on-developers/\">Binance Launchpool Rolls Out Support for New Layer-1 Crypto Project Focused on Developers</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]