[
  {
    "source": "CryptoSlate",
    "date": "2024-03-22T14:00:04.000Z",
    "title": "Full blockchain nodes added to smart WiFi routers in DePIN innovation – Exclusive",
    "url": "https://cryptoslate.com/full-blockchain-nodes-added-to-smart-wifi-routers-in-depin-innovation-exclusive/",
    "description": "<p>Minima, a layer-1 blockchain focused on Decentralised Physical Infrastructure Network (DePIN) solutions, has announced a novel partnership with Wicrypt, a smart Wi-Fi network that allows users to earn tokens by sharing their Wi-Fi hotspots. The collaboration aims to democratize internet access and make it more affordable for everyone by decentralizing the infrastructure required to provide [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/full-blockchain-nodes-added-to-smart-wifi-routers-in-depin-innovation-exclusive/\">Full blockchain nodes added to smart WiFi routers in DePIN innovation &#8211; Exclusive</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-22T13:42:14.000Z",
    "title": "Fezoo's Presale: A New Dawn for Crypto Trading, Attracting Polygon and Bitcoin Cash Investors with Its Pioneering Features",
    "url": "https://cryptodaily.co.uk/2024/03/fezoos-presale-a-new-dawn-for-crypto-trading-attracting-polygon-and-bitcoin-cash-investors-with-its-pioneering-features",
    "description": "Investing in presales allows you to be among the first supporters of a project, placing you at the forefront of potential technological advancements. This early support is not just about the potential financial gains but also about the excitement of being part of something new and potentially revolutionary from the beginning."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-22T14:05:59.000Z",
    "title": "Ripple pumps 5% while market is red but Green Bitcoin also soars",
    "url": "https://crypto.news/ripple-pumps-5-while-market-is-red-but-green-bitcoin-also-soars/",
    "description": "Despite a downturn in the crypto market, XRP demonstrates resilience with a 5% surge, while Green Bitcoin, a new ICO crypto, gains momentum. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-22T14:04:29.000Z",
    "title": "Understanding Bitcoin halving: impact and importance",
    "url": "https://crypto.news/understanding-bitcoin-halving-impact-and-importance/",
    "description": "What is Bitcoin halving? Learn about its mechanics, significance, and investment implications in this comprehensive guide. If you’re thinking about investing in crypto, you’ll want to know about Bitcoin halving. It’s one of the most significant events in the world&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-22T13:46:51.000Z",
    "title": "WisdomTree receives crypto custody launch approval from NYDFS",
    "url": "https://crypto.news/wisdomtree-receives-crypto-custody-launch-approval-from-nydfs/",
    "description": "WisdomTree has received a license from the NYDFS, allowing it to offer cryptocurrency-related products and services. Under New York State banking laws, asset manager WisdomTree has received approval from the NYDFS to operate as a limited liability trust company.With the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T14:00:00.000Z",
    "title": "Bitcoin Spot ETFs See 4 Consecutive Days Of Outflows, Here’s What Happened Last Time",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-outflows/",
    "description": "Bitcoin Spot ETF outflows have ramped up this week and has seen the week characterized by price declines throughout the crypto space. These outflows, like before, are being led by the Grayscale Spot ETF as investors believe their fees are too high. This has led to four consecutive week of outflows, which is the second time it is happening since Spot ETFs were approved for trading. So, where does the Bitcoin price go from here? Bitcoin Spot ETFs Hit 4 Consecutive Days Of Outflows The outflows began on Monday and continued into subsequent days. So far, the highest single-day outflow happened on Tuesday, March 19, with total net flows for the day coming out to $326.2 million, a new record for Bitcoin funds. Related Reading: Top 3 Solana Meme Coins To Buy Amid The Bitcoin Crash That Could 10x Subsequent days have seen lower figures when it comes to overall net flows but they continue to come out in the negative. On Wednesday, net flows were $261.5 million, and on Thursday, March 22, net flows came out to $94 million. This marked the second time that the Spot Bitcoin ETFs are seeing four consecutive days of outflows this year. The vast majority of these outflows, as mentioned above, are coming from the Grayscale Bitcoin ETF. In the last day alone, the fund saw outflows of 5,900 BTC, which translates to $339 million at current prices. Then, over the last week, Coinglass data shows that 28,207.5834 BTC has left the fund, causing its total BTC under management to fall by 7.35% in one week. Other funds have also seen outflows during this time but to a much lower degree. For example, the Invesco Galaxy Bitcoin ETF saw the second-highest outflow of all the funds, but only 667 BTC flowed out of the fund in the last day. The WisdomTree Bitcoin Fund saw 10.8.2635 BTC in outflows, while all other outflow figures came in below 100 BTC. What Happened To BTC The Last Time? The last time that Spot Bitcoin ETFs saw four consecutive days of outflows was in January, lasting from January 22 to January 25. This also bears some similarities to the current outflow trend in some was, one of which was the outflows began at the start of the week and carried through to the end. Related Reading: Crypto Analyst Says XRP Price Is Headed For $27 As 2017 Pattern Emerges However, a difference between both times is that the ETFs had just begun trading with trading days fluctuating between inflows and outflows. Meanwhile, the current trend has come after almost two consecutive weeks of inflows, something that could have an impact on the BTC price going forward. In January, after four days, the outflows had begun to slow down, and by Friday, there was a change in direction, with inflows beginning to dominate. Once the tide turned and ETF inflows began to rise, the BTC price followed sharply. With the climb came a more established rally in the Bitcoin price, causing it to go from $40,000 to over $70,000 in the space of two months. If this trend repeats and inflows into Spot BTC ETFs outpace outflows, then the BTC price is expected to start climbing again. However, if the outflows continue, then the BTC price could be in for further crashes. BTC price drops below $65,000 &#124; Source: BTCUSD on Tradingview.com Featured image from 20 Minutes, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-22T13:46:00.000Z",
    "title": "5 Projects Set to Unlock New Tokens and their Price Predictions",
    "url": "https://coinedition.com/5-projects-set-to-unlock-new-tokens-and-their-price-predictions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"How-Will-These-Top-5-Tokens-React-to-Next-Week&#039;s-Unlocks\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/How-Will-These-Top-5-Tokens-React-to-Next-Weeks-Unlocks-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Next week, several projects are scheduled to unlock a new set of tokens and release them into circulation. Some of the projects in this cohort include Sui (SUI), Manta Network (MANTA), dydx (DYDX), Optimism (OP), and SingularityNET (AGIX). According to data from Token Unlocks, SUI would unlock $7.12 million worth of the token. MANTA plans [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/5-projects-set-to-unlock-new-tokens-and-their-price-predictions/\">5 Projects Set to Unlock New Tokens and their Price Predictions</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]