[
  {
    "source": "Decrypt",
    "date": "2023-06-17T20:46:17.000Z",
    "title": "AI Is Helping HR Departments Write Termination Letters",
    "url": "https://decrypt.co/145083/ai-is-helping-hr-departments-write-termination-letters",
    "description": "As tech industry layoffs continue, even human resources departments find themselves in need of help."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-17T20:43:31.000Z",
    "title": "BUSD falls to fourth position among stablecoins",
    "url": "https://cointelegraph.com/news/busd-falls-to-fourth-position-among-stablecoins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/66185f10-ffa6-4492-aea0-9d369f23eb13.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After a dip of over $1 billion in the past 30 days, BUSD now sits at the fourth position in market capitalization among stablecoins. </p>\n                    <p><p>The dollar-pegged Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>) stablecoin sits now at the fourth position in market capitalization among other stablecoins following a dip of over $1 billion in the past 30 days, data from CoinMarketCap <a href=\"https://coinmarketcap.com/view/stablecoin/\" target=\"_blank\" rel=\"noopener nofollow\">shows</a>.</p><p>As of writing, BUSD market cap stands at $4.30 billion, down 29% from $5.54 billion on May 18. The stablecoin has been in a downward trend since December last year, when its market cap topped $23 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/cfb41c39-8b4a-467f-9fdc-2a0d180ccf8d.png\"  /><figcaption style=\"text-align: center;\"><em>Top stablecoins by market capitalization on June 17. Source: CoinMarketCap</em></figcaption></figure><p>The decline in BUSD market cap parallels major developments surrounding Binance following FTX's dramatic collapse in November 2022. Last December, a report indicating Binance would be targeted by the U.S. Department of Justice <a href=\"https://cointelegraph.com/news/binance-net-withdrawals-topped-3-6b-over-the-last-7-days-report\">led to net withdrawals of $3.6 billion</a> within seven days. The exchange saw large BUSD redemptions from market makers, including more than $245 million from Jump Finance.</p><p>A partnership between Binance and Paxos Trust created the BUSD stablecoin in September 2019. Paxos issues and owns the product, while Binance licenses its brand. For Paxos, the partnership brought new challenges. In February, the company was reportedly <a href=\"https://cointelegraph.com/news/stablecoin-issuer-paxos-to-face-sec-lawsuit-over-binance-usd-report\">served a Wells Notice</a> from the U.S. Securities and Exchange Commission alleging that Binance USD was an unregistered security. </p><p><strong><em><a href=\"https://cointelegraph.com/learn/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work\">Related: Stablecoins 101 - What are crypto stablecoins, and how do they work?</a></em></strong></p><p>The investigation led the New York Department of Financial Services (NYDFS) to order Paxos <a href=\"https://cointelegraph.com/news/paxos-ordered-to-stop-issuing-binance-usd-report\">to stop the issuance of BUSD</a>. Together, these episodes took a significant bite out of BUSD's market share, from $15.88 billion on February 12 to $8.38 billion on March 13. </p><p>The most recent blow came from the SEC lawsuit against Binance on June 5 for allegedly offering unregistered securities. The U.S. regulator <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">pressed 13 charges against the exchange</a>, including unregistered offers and sales of the BNB and BUSD tokens. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bbe5a2ad-aae2-44b6-8d20-43cb7d83393f.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Binance USD (BUSD) market share in 12 months. Source: CoinMarketCap.</em></figcaption></figure><p>The market dominance of stablecoins pegged to the U.S. dollar <a href=\"https://cointelegraph.com/news/usdt-market-share-jumps-amid-economic-uncertainty-usdc-shrinks\">has undergone some changes over the past year</a>, with Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) climbing back to its all-time high, while most stablecoins are declining.</p><p>Circle’s USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) saw its market share decline from 34.88% in May 2022 to 23.05% in May 2023. Market participation of BUSD plunged from 11.68% to 4.18% in the same period, while Dai’s (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) share of the crypto market was at 3.66%, down from 4.05% in May 2022.</p><p>Tether's USDT, on the other hand, is gaining traction. The stablecoin’s market dominance stood at 65.89% in May, up from 47.04% a year ago. Its market capitalization has risen to $83.1 billion, while USDC’s market cap has dropped from a peak of $55 billion to $29 billion.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation — Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-17T21:00:00.000Z",
    "title": "Polygon Proposes New Ecosystem Council",
    "url": "https://cryptodaily.co.uk/2023/06/polygon-proposes-new-ecosystem-council",
    "description": "<p class=\"md-end-block md-p\">Polygon, the renowned Ethereum scaling solution, recently proposed a new decentralized governance model aimed at enhancing its network's security, upgradeability, and robustness.</p>\n<p class=\"md-end-block md-p\">This proposal, revolving around the establishment of an \"Ecosystem Council,\" will redefine how system smart contracts within the Polygon environment are managed and upgraded. This proposal indicates the continuous efforts by Polygon to strike a perfect balance between community-driven governance and efficient decision-making in a decentralized network.</p>\nA New System for Decentralized Governance\n<p class=\"md-end-block md-p\">System smart contracts represent a fundamental element of the blockchain infrastructure. They can directly or indirectly influence user funds and the infrastructure's functioning. A crucial aspect of these contracts is their upgradeability, which allows seamless migration to improved versions under specific circumstances. The importance of this feature is evident in various Layer 2 (L2) solutions, such as Optimism, Arbitrum, and zkSync, where an efficient means of patching bugs and upgrading pivotal architecture components is required.</p>\n<p class=\"md-end-block md-p\">According to the proposal, the Ecosystem Council would comprise technically proficient and value-aligned individuals, elected and removable by the community. This council will be responsible for performing timelock-limited upgrades to system smart contracts across Polygon networks, such as Polygon PoS and zkEVM.</p>\n<p class=\"md-end-block md-p\">For example, in the case of non-emergency or routine proposals, the council will make a proposal and proceed with the timelock as usual. On the other hand, if there is a perceived threat to user funds due to potential vulnerabilities in smart contracts, the council will enact an Emergency State, freezing transactions to protect assets. </p>\n<p class=\"md-end-block md-p\">The Polygon community will be empowered with three competencies: the election and removal of Ecosystem Council members, the ability to exit an Emergency State, and the power to veto any upgrade proposed by the Ecosystem Council. This model is expected to increase community engagement while retaining a level of control to prevent malicious activities.</p>\nThe Ecosystem Council: Balancing Efficiency and Decentralization\n<p class=\"md-end-block md-p\">The proposed model suggests the creation of an Ecosystem Council, a group consisting of reputable, technically adept, and value-aligned individuals. These individuals would be democratically elected by the community and could also be removed by them. The council's primary role would be to perform timelock-limited upgrades to the system's smart contracts across the Polygon networks, including the Polygon PoS and zkEVM.</p>\n<p class=\"md-end-block md-p\">The governance model will allow the council to handle both routine and sensitive proposals. In the case of routine proposals, the council will make a proposal and proceed with the standard timelock protocol. However, if a potential vulnerability poses a risk to user funds, the council will enact an Emergency State, freezing transactions to protect the funds. </p>\n<p class=\"md-end-block md-p\">To maintain a balance between efficiency and community engagement, Polygon proposes empowering the community with several competencies. These include the power to elect and remove Ecosystem Council members, the ability to exit the Emergency State, and the authority to veto any upgrade proposed and scheduled by the Ecosystem Council. By bestowing the community with these powers, Polygon hopes to increase the overall community engagement while maintaining a level of centralized control to prevent malicious activities.</p>\nNavigating the Transition: Inviting Community Input\n<p class=\"md-end-block md-p\">While the proposed model promises improved governance and security, its rollout must be gradual and well planned, especially considering the live nature of the blockchain. To ensure a seamless transition, the Polygon team is inviting its community to participate in the process, providing feedback, and assisting in answering open questions.</p>\n<p class=\"md-end-block md-p\">The community is particularly encouraged to contribute ideas regarding incentivizing participation in the model and establishing a robust and secure voting mechanism. Decisions around these aspects, like the general design principles, voting power proxy, and architecture, will be crucial to the model's success. The team is also considering the use of the $MATIC token as a voting power proxy, which would provide broad ecosystem inclusion and legitimize the Ecosystem Council.</p>\n<p class=\"md-end-block md-p md-focus\">Polygon's proposed Ecosystem Council represents an exciting step towards more robust, efficient, and community-driven governance of system smart contracts. By integrating elements of both centralized and decentralized decision-making, the model aims to bring the best of both worlds to the Polygon network. This move could help Polygon maintain its reputation as a leading Layer 2 solution, offering an improved governance framework that values efficiency, security, and community inclusion.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  }
]