[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:47:26.000Z",
    "title": "Protocol Village : Metagood, derrière les NFT OnChainMonkey, lève un tour de table de 5 millions de dollars",
    "url": "https://www.coindesk.com/fr/tech/2023/12/14/protocol-village-metagood-behind-onchainmonkey-nfts-raises-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Les dernières mises à niveau technologiques blockchain, annonces de financement et accords. Pour la période du 14 décembre au 14 décembre. 20, avec des mises à jour en direct tout au long."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:47:26.000Z",
    "title": "Protocol Village: Metagood, dietro gli NFT OnChainMonkey, raccoglie un round di seed da 5 milioni di dollari",
    "url": "https://www.coindesk.com/it/tech/2023/12/14/protocol-village-metagood-behind-onchainmonkey-nfts-raises-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Gli ultimi aggiornamenti sulla tecnologia blockchain, annunci di finanziamenti e offerte. Per il periodo dal 14 dicembre al 14 dicembre. 20, con aggiornamenti in tempo reale ovunque."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:47:26.000Z",
    "title": "Protocol Village: Metagood, por trás dos NFTs OnChainMonkey, levanta rodada inicial de US$ 5 milhões",
    "url": "https://www.coindesk.com/pt-br/tech/2023/12/14/protocol-village-metagood-behind-onchainmonkey-nfts-raises-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "O que há de mais recente em atualizações de tecnologia blockchain, anúncios de financiamento e negócios. Para o período de 14 de dezembro a dez. 20, com atualizações ao vivo por toda parte."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:39:39.000Z",
    "title": "L'isteria di \"Bitcoin NFT\" arriva da Sotheby's con il personaggio del fungo in stile Super Mario che supera i 200.000 dollari",
    "url": "https://www.coindesk.com/it/tech/2023/12/14/bitcoin-nft-hysteria-comes-to-sothebys-as-super-mario-style-mushroom-character-tops-200k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Nella prima vendita in assoluto delle iscrizioni degli Ordinali da parte della storica casa d'aste, nota come \"NFT su Bitcoin\", un lotto di tre immagini pixelate provenienti da una collezione a tema funghi ha fruttato circa $ 450.000, ovvero circa cinque volte le stime più alte."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:39:39.000Z",
    "title": "'Bitcoin NFT' Hysteria Comes to Sotheby's as Super-Mario-Style Mushroom Character Tops $200K",
    "url": "https://www.coindesk.com/tech/2023/12/14/bitcoin-nft-hysteria-comes-to-sothebys-as-super-mario-style-mushroom-character-tops-200k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In the historic auction house's first-ever sale of the Ordinals inscriptions known as \"NFTs on Bitcoin,\" a batch of three pixelated images from a mushroom-themed collection drew about $450,000, or roughly five times the highest estimates."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:39:39.000Z",
    "title": "A histeria do ' Bitcoin NFT' chega à Sotheby's quando o personagem cogumelo estilo Super Mario chega a US$ 200 mil",
    "url": "https://www.coindesk.com/pt-br/tech/2023/12/14/bitcoin-nft-hysteria-comes-to-sothebys-as-super-mario-style-mushroom-character-tops-200k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Na primeira venda das inscrições Ordinals da histórica casa de leilões, conhecida como “NFTs no Bitcoin”, um lote de três imagens pixeladas de uma coleção com tema de cogumelo atraiu cerca de US$ 450.000, ou cerca de cinco vezes as estimativas mais altas."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:39:39.000Z",
    "title": "L'hystérie «Bitcoin NFT » arrive chez Sotheby's alors que le personnage de champignon de style Super-Mario dépasse 200 000 $",
    "url": "https://www.coindesk.com/fr/tech/2023/12/14/bitcoin-nft-hysteria-comes-to-sothebys-as-super-mario-style-mushroom-character-tops-200k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lors de la toute première vente par la maison de ventes aux enchères historique des inscriptions Ordinals connues sous le nom de « NFT sur Bitcoin», un lot de trois images pixellisées provenant d'une collection sur le thème des champignons a rapporté environ 450 000 $, soit environ cinq fois les estimations les plus élevées."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T21:47:26.000Z",
    "title": "Protocol Village: Metagood, Behind OnChainMonkey NFTs, Raises $5M Seed Round",
    "url": "https://www.coindesk.com/tech/2023/12/13/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Dec 14-Dec. 20, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-14T21:59:57.000Z",
    "title": "Instagram Adds Generative AI That Swaps Image Backgrounds",
    "url": "https://decrypt.co/209868/instagram-adds-generative-ai-that-swaps-image-backgrounds",
    "description": "The green screen-like Backdrop feature lets users replace their messy kitchens with lush tropical forests."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T21:59:44.000Z",
    "title": " US energy NGO warns of overwhelming demand, as ERCOT considers crypto proposals ",
    "url": "https://cointelegraph.com/news/us-energy-ngo-warns-overwhelming-demand-ercot-considers-crypto-proposals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNzA2MzQ0NTAtODU4OS00YTBlLTkyNDQtMjQzNWE3NzAxM2EwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Government policy and challenges getting projects online complicate energy policy and may have grave consequences. </p>\n                    <p><p>The North American Electric Reliability Corporation (NERC), a nonprofit corporation that oversees regional organizations that support energy reliability, has <a href=\"https://www.nerc.com/pa/RAPA/ra/Reliability%20Assessments%20DL/NERC_LTRA_2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> its annual long-term reliability assessment of the United States electrical grid. It identified large portions of the United States and Canada as high- or elevated-risk areas for energy reliability. Those areas included Texas, where the cryptocurrency mining industry is seeking to expand.</p><p>Both development and demand are rising “faster than at any time in the past five or more years.” New projects are being planned at a rate that challenges operator management, and the industry of facing pressure from mounting demands for energy and on transmission system adequacy, the report said.</p><p>Nine states saw rolling blackouts in December 2022, Mateson added.</p><p><a href=\"https://cointelegraph.com/news/us-energy-ngo-warns-overwhelming-demand-ercot-considers-crypto-proposals\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T21:43:09.000Z",
    "title": " Why is Cardano (ADA) price up this week? ",
    "url": "https://cointelegraph.com/news/why-is-cardano-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvZWUyNDI5NjYtNjU2OS00YWFhLTg0ZTEtZDAzY2FiYzMxMWIxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ADA price had gained nearly 80% in a month and data suggests the rally could continue.</p>\n                    <p><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) recorded an impressive 43% gain in the seven days leading up to Dec. 14, reaching its highest level since May 2022. The rapid increase to $0.64 has pushed Cardano's market capitalization to $22.7 billion, an interesting point to note, as it matches the valuation of Danske Bank (DANSKE.CO), Denmark's largest bank, which serves over 5 million retail customers.</p><p>While ADA’s market cap is quite impressive, it's essential to recognize that decentralized protocol valuations differ significantly from traditional financial assets. Traditional assets rely on generating revenue to cover expenses, including financing costs and operational overhead. On the other hand, Cardano is a decentralized protocol, so its market capitalization does not depend on sales and earnings. Nevertheless, it's important to analyze the potential reasons behind ADA's price increase to determine if further gains are possible.</p><p>Constructing a narrative for Cardano's recent success is relatively straightforward, but pinpointing the specific events responsible for the 70% gain in December is more challenging. For instance, a post on the social network X by user @matiwinnetou brilliantly highlights the driving factors behind this bullish momentum.</p><p><a href=\"https://cointelegraph.com/news/why-is-cardano-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-14T21:50:47.000Z",
    "title": "Pope Francis advocates for ‘binding international treaty’ on AI regulation",
    "url": "https://cryptoslate.com/pope-francis-advocates-for-binding-international-treaty-on-ai-regulation/",
    "description": "<p>Pope Francis called for an international treaty on the regulation of AI in the Vatican&#8217;s annual World Day of Peace Message on Dec. 14. The pope stated in his message: &#8220;The global scale of artificial intelligence makes it clear that &#8230; international organizations can play a decisive role in reaching multilateral agreements &#8230; I urge [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/pope-francis-advocates-for-binding-international-treaty-on-ai-regulation/\">Pope Francis advocates for &#8216;binding international treaty&#8217; on AI regulation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2023-12-14T21:54:51.000Z",
    "title": "$BONK Achieves a Remarkable Surge With Coinbase Listing Amidst Whale Interest",
    "url": "https://nulltx.com/bonk-achieves-a-remarkable-surge-with-coinbase-listing-amidst-whale-interest/",
    "description": "In the realm of cryptocurrencies, $Bonk, a significant player within the Solana ecosystem, has become a subject of intense speculation, creating ripples in the cryptocurrency landscape. Over the past 24 hours, $Bonk has experienced an impressive surge of over 52%. Thereby, maintaining an upward trajectory for months and accumulating substantial [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T21:42:49.000Z",
    "title": "Gensler: SEC reevaluating spot Bitcoin ETF with fresh perspective",
    "url": "https://crypto.news/gensler-sec-reevaluating-spot-bitcoin-etf-with-fresh-perspective/",
    "description": "U.S. Securities and Exchange Commission Chair Gary Gensler indicated a possible change in the agency’s approach towards Bitcoin ETFs."
  }
]