[
  {
    "source": "Decrypt",
    "date": "2023-07-18T20:01:03.000Z",
    "title": "Vitalik Buterin Explains How Ethereum Plans to Make Crypto Wallets as Simple as Email",
    "url": "https://decrypt.co/149063/vitalik-buterin-explains-how-ethereum-plans-to-make-crypto-wallets-as-simple-as-email",
    "description": "Account abstraction, which would make it possible to store seed phrases in smart contracts, is \"a pretty big deal,\" he said."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-18T19:47:16.000Z",
    "title": "Asset Managers Back Bitcoin But Hold More Ethereum in CoinShares Poll",
    "url": "https://decrypt.co/149066/bitcoin-ethereum-asset-manager-poll-coinshares",
    "description": "A new survey offers a tantalizing insight into sentiment among institutions—and it's clear that BlackRock's filing for a spot Bitcoin ETF has had a huge impact."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T19:45:00.000Z",
    "title": "What is a token maker, and how does it work?",
    "url": "https://cointelegraph.com/explained/what-is-a-token-maker-and-how-does-it-work",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/a313c0e784c77523b73e1d70d8dd418b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A token maker provides the necessary infrastructure and functionalities for individuals or organizations to design, issue and manage their own tokens.</p>\n                    <p><h2>Key considerations while selecting a good token maker</h2><p></p><p><em>A good token maker should be secure, rich in features and reputable.</em></p><p>Picking the right token maker is paramount in ensuring that token creation is successful. First, a token generator platform should ideally be from a reputable name and not a fly-by-night platform on the internet with flimsy technicals. It’s always a good idea to research the platform before deciding to use it for token creation, as well as read other users’ reviews about it.</p><p>A good token generator will also offer a wide range of features, such as the ability to expire, burn, mint or blacklist tokens. The price and user experience of the tool are also important considerations. Look into the fees and level of customization allowed (if any), and if these match your budget and needs.</p><p>Lastly, a good token generator is one that is secure and regularly updated by its developers. Look for bug reporting facilities and update schedules to ensure the DApp is kept updated and maintained.</p><p>Here are some examples of token maker platforms that help create tokens: </p><h3>CoinTool</h3><p>CoinTool allows for the creation of a wide range of tokens, including ERC-20 and BEP-20 tokens. Users can also create tokens for Solana, Polygon, Avalanche and more. The tool offers a drag-and-drop token creation interface and other helpful features, such as NFT creator, contract auditor and gas price index.</p><h3>TokenMint</h3><p>TokenMint by Horizen facilitates the creation of fungible tokens with custom <a href=\"https://cointelegraph.com/learn/what-is-tokenomics-a-beginners-guide-on-supply-and-demand-of-cryptocurrencies\">tokenomics</a> in a fully transparent environment. The platform also offers enhanced privacy and security. To use the generator, however, one must first download the Cobalt wallet and fund it with Horizen (ZEN) cryptocurrency to pay for token generation fees.</p><h3>Create My Token</h3><p>This platform allows users to create BEP-20 and ERC-20 tokens without coding. One simply has to connect their <a href=\"https://cointelegraph.com/learn/metamask-tutorial-for-beginners-how-to-set-up-a-metamask-wallet\">MetaMask wallet</a>, customize the details and features of their token, and deploy the same. Gas fees apply.</p><h2>Benefits and drawbacks of token generators</h2><p></p><p><em>Token generators are lauded for their convenience, security and affordability. However, they might sometimes be too simplistic for those looking for more complex smart contract applications. </em></p><p>Among the foremost benefits of token generators are convenience and affordability, as there would be no need to enlist the help of a blockchain programmer to code a smart contract. And, if one uses a reputable token maker platform, the process can also be highly secure and efficient. </p><p>On the other hand, token generators do have several drawbacks. For one, their “plug-and-play” nature can also make them less customizable and might lack features found in more complex smart contracts. Furthermore, some platforms may charge hefty fees for using their service or might require users to pay for certain assets.</p><p>Overall, though, token generators are an incredibly useful tool for entrepreneurs and developers looking to create digital tokens quickly and securely. As the cryptocurrency space continues to evolve, these types of tools are also primed to become more intuitive and secure in the coming years.</p><h2>Types of cryptocurrency tokens</h2><p></p><p><em>Cryptocurrency tokens generally fall into four main categories: security tokens, utility tokens, tokenized securities and currency tokens.</em></p><p>Security tokens represent a particular investment — like voting rights or shares in a company or centralized organization. They could also represent other valuable underlying assets or utilities, whether tangible or digital. These tokens can be programmed with a variety of ownership rights and unique characteristics.</p><p>Utility tokens represent access to a blockchain-based product or service. These types of tokens may also be used to power a network’s consensus mechanism (such as <a href=\"https://cointelegraph.com/learn/proof-of-stake-vs-proof-of-work:-differences-explained\">proof-of-work and proof-of-stake</a>). There are other applications as well, such as paying for transaction fees or granting voting rights within a <a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organization</a>.</p><p>Tokenized securities, not to be confused with security tokens, refer to digital representatives of their underlying securities, such as bonds, investment funds or equity. The main goal, then, is to broaden a security’s liquidity or market accessibility. As such, there are typically no unique features or cryptographic characteristics embedded in these tokens.</p><p>Lastly, currency tokens are tokens designed to function as digital currencies that can be traded and spent. Some currency tokens are also asset-backed, but many are not tied to underlying assets. The value of these tokens lies in their underlying blockchain network and distribution mechanism.</p><h2>No-code token generation: How token generators work</h2><p></p><p><em>A token generator simplifies the tokenization process through automation while integrating custom tokenomics and ensuring privacy.</em></p><p>Token generators streamline the process of token creation with automated drag-and-drop functions, eliminating the barriers to tokenization that cryptocurrency enthusiasts with little to no programming knowledge typically face.</p><p>Tokens represent particular utilities or assets. Tokenization effectively converts something valuable into a digital token that blockchain-based applications can then effectively use. Depending on one’s desired utility, tokens can represent either tangible or intangible assets.</p><p>Tangible assets are those with physical forms, such as real estate, physical artworks or gold. Intangible assets, on the other hand, may refer to things like licensing, ownership rights, loyalty points or voting rights.</p><p>Developers traditionally create tokens by writing code in a programming language that the particular protocol can understand. Creating an ERC-20 token on the <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency\">Ethereum blockchain</a>, for example, will require one to determine the token’s unique specifications, codify the smart contract, test the token, and verify its source code.</p><p><img alt=\"Steps to generate tokens using token generators\" src=\"https://s3.cointelegraph.com/storage/uploads/view/8a826f51b9c172e0288f67caec0cfa3a.jpg\" title=\"Steps to generate tokens using token generators\"></p><p>Needless to say, one would need a lot of technical knowledge to successfully understand (and implement) how digital tokens are created. With a token generator tool, however, one can create the same ERC-20 token in as little as 10 minutes — and with zero coding.</p><p>On CoinTool, for example, one will need to connect their <a href=\"https://cointelegraph.com/learn/bitcoin-wallets-a-beginners-guide-to-storing-btc\">cryptocurrency wallet</a> to the app and start creating a token on their desired blockchain. Features can be added through a series of simple steps, such as defining the token’s name and token supply, as well as adding features and mechanisms for minting and burning.</p><h2>The basics of token makers</h2><p></p><p><em>A token maker or token generator tool is a type of software used to create cryptocurrency tokens.</em></p><p><a href=\"https://cointelegraph.com/learn/a-step-by-step-beginners-guide-to-creating-your-first-cryptocurrency-token\">Tokens represent various assets</a>, including digital currencies, virtual goods, loyalty points and even real-world assets, such as real estate or artwork. Tokens may also be created to grant access to a <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized application (DApp)</a> or deploy token <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a>.</p><p>So, what is a token maker? Technically, token makers take the tedious task of coding out of the mix — virtually allowing anyone to create their own token and launch a new cryptocurrency.</p><p>Not so long ago, cryptocurrency token development was a singularly complex task, and only advanced blockchain developers with <a href=\"https://cointelegraph.com/explained/programming-languages-used-in-blockchain-explained\">strong blockchain programming skills</a> could mint digital coins. </p><p>As the technology evolved, however, <a href=\"https://cointelegraph.com/innovation-circle/overcoming-hurdles-to-tokenization\">no-code tokenization</a> platforms <a href=\"https://cointelegraph.com/news/how-to-create-and-launch-a-cryptocurrency-token-with-tokenmint\">like TokenMint </a>and CoinTool developed innovative platforms that equipped virtually anyone with an aptitude for cryptocurrencies to create their own tokens.</p><p>Depending on the platform, token generators can create <a href=\"https://cointelegraph.com/learn/fungible-vs-nonfungible-tokens-what-is-the-difference\">fungible or nonfungible tokens (NFTs)</a> in accordance with specific token standards (like ERC-20 and <a href=\"https://cointelegraph.com/learn/what-is-a-brc-20-token-standard-an-overview\">BRC-20</a>). Aside from using automation to create and manage tokens, token creators also allow one to control certain parameters, such as token validity. Tokens may also be revoked if necessary.</p><p>To ensure that the generated tokens are secure and, therefore, truly random and unpredictable, these tools usually introduce an entropy source when generating tokens. Entropy refers to the amount of uncertainty, measured in “bits,” that a malicious actor or attacker will have to face in order to determine the value of encrypted information. </p><p>An entropy source, in a nutshell, is an input device on a computer that supplies random bits, raising the difficulty level that a possible attacker has to deal with when trying to access unauthorized information.</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:45:20.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-18T20:00:05.000Z",
    "title": "Polygon’s MATIC Remains in Red as InQubeta Presale Breaks Above $1.4 Million",
    "url": "https://nulltx.com/polygons-matic-remains-in-red-as-inqubeta-presale-breaks-above-1-4-million/",
    "description": "As the cryptocurrency market experiences ups and downs, some tokens struggle to find their footing while others defy expectations. Polygon&#8217;s MATIC has been facing a downward trend, but amidst this volatility, InQubeta&#8217;s presale has been making waves. With over $1.4 million raised in just a few weeks, InQubeta is capturing the attention of investors and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T20:00:48.000Z",
    "title": "Thodex CEO Sentenced To Prison For Tax Evasion",
    "url": "https://www.newsbtc.com/crypto/thodex-ceo-sentenced-to-prison-for-tax-evasion/",
    "description": "Farouk Fatih Özer, the former CEO of the now-defunct crypto exchange Thodex, has been sentenced to seven months in jail. The executive was convicted for failing to submit the required documents to Turkey&#8217;s tax board. Related Reading: This Under-The-Radar Coin Just Beat The Top 100 Cryptocurrencies With 120% Explosion Thodex, which was once a prominent crypto exchange in Turkey, experienced an abrupt closure, leading its CEO, Farouk Fatih Özer, to flee to Albania. However, after an Interpol Red Notice was issued, Özer was deported back to Turkey to be held accountable for the approximately $2 billion worth of cryptocurrencies belonging to investors. Özer, along with 21 other defendants, is embroiled in a protracted court case facing charges of alleged fraud, money laundering, and operating a criminal network through Thodex. Throughout the trial, Özer vehemently denied any wrongdoing and asserted that he was not the official representative of Thodex at the time, which made him unable to produce the requested books. Former CEO Of Thodex Claims To Have Been &#8220;Framed&#8221; In addition to the aforementioned charges, Özer is also facing accusations of defrauding Thodex investors and is currently awaiting a hearing to address these claims. Despite the allegations, the entrepreneur maintains his innocence and asserts that the defendants have framed him. During Özer&#8217;s first court appearance in June, he denied all charges and claimed to have been framed. He stated, &#8220;I started my company and my company was hacked,&#8221; addressing the court. The legal proceedings against Özer commenced after his failure to adhere to a notification issued on October 30, 2021. The notification requested the submission of documents pertaining to his business. Despite the notification, Özer did not provide the best  requested documents within the designated legal timeframe. Özer&#8217;s claim that a trustee had been assigned to oversee the company in his absence, he was unable to produce the required documents to the Tax Inspection Board. As a result, he was convicted. Initially, the prosecutor in Özer&#8217;s case requested a five-year prison sentence on charges of &#8220;smuggling&#8221; under the Tax Procedure Law. However, the court initially sentenced the crypto entrepreneur to one year and six months of imprisonment. It was subsequently reduced to seven months and 15 days. The reduction in sentences can be attributed to various factors. These included Özer&#8217;s social relations, as well as his overall behaviour and conduct throughout the trial. Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? In April 2021, the defunct cryptocurrency exchange platform abruptly halted trading and withdrawal services. This left approximately 391,000 customers with losses amounting to around $2 billion. Following this incident, Turkish police authorities initiated a large-scale investigation into the platform. Featured image from Gearrice, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T19:41:22.000Z",
    "title": "Binance Implements Cost-Cutting Measures as Profits Decline",
    "url": "https://www.crypto-news-flash.com/binance-implements-cost-cutting-measures-as-profits-decline/?utm_source=rss&utm_medium=rss&utm_campaign=binance-implements-cost-cutting-measures-as-profits-decline",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Leading cryptocurrency exchange Binance prepares to lay off at least 1,000 employees.  According to an insider source, Binance is making this move, in a bid to cut down on quantity and pour its resources into talent nurturing.  As reported by The Wall Street Journal and CNBC, Binance will be letting go of at least 1,000 [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-18T20:00:21.000Z",
    "title": "Kevin O’Leary Says American Small Businesses Getting Crushed by Surging Rate Hikes and Inflation",
    "url": "https://dailyhodl.com/2023/07/18/kevin-oleary-says-american-small-businesses-getting-crushed-by-surging-rate-hikes-and-inflation/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/small-businesses-getting-crushed.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Investor and Shark Tank star Kevin O’Leary says that the Biden administration’s economic policies have neglected small businesses as rising inflation and interest rate hikes add to their pain. In a recent Fox News interview, O’Leary says that the CHIPS Act (Creating Helpful Incentives to Produce Semiconductors) and the Inflation Reduction Act (IRA), which President [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/18/kevin-oleary-says-american-small-businesses-getting-crushed-by-surging-rate-hikes-and-inflation/\">Kevin O’Leary Says American Small Businesses Getting Crushed by Surging Rate Hikes and Inflation</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-18T19:55:25.000Z",
    "title": "Former Goldman Sachs Executive Says Bitcoin ETF Could Trigger ‘Blind Panic’ of Capital to Crypto Markets",
    "url": "https://dailyhodl.com/2023/07/18/former-goldman-sachs-executive-says-bitcoin-etf-could-trigger-blind-panic-of-capital-to-crypto-markets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-is-about-crush.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Real Vision CEO Raoul Pal is predicting that the approval of a spot Bitcoin (BTC) exchange-traded fund (ETF) would trigger a rapid flood of capital into the crypto asset markets. In a new interview with Lark Davis, the former Goldman Sachs executive says that a spot BTC ETF approval could coincide with an already warming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/18/former-goldman-sachs-executive-says-bitcoin-etf-could-trigger-blind-panic-of-capital-to-crypto-markets/\">Former Goldman Sachs Executive Says Bitcoin ETF Could Trigger ‘Blind Panic’ of Capital to Crypto Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]