[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-27T00:45:00.000Z",
    "title": "World Markets Unprepared for 7% US Interest Rates, Warns JPMorgan’s Dimon",
    "url": "https://www.cryptoglobe.com/latest/2023/09/world-markets-unprepared-for-7-us-interest-rates-warns-jpmorgans-dimon/",
    "description": "Global financial markets could face unprecedented turbulence if the Federal Reserve pushes its benchmark interest rate to 7% in the face of stagflation, cautioned Jamie Dimon, the CEO of JPMorgan Chase &amp; Co. During a recent conversation while in Mumbai for a JPMorgan investor summit, Dimon referred famous investor Warren Buffet, often referred to as […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T01:00:24.000Z",
    "title": "Bitcoin Price Up 30% Versus Ethereum, New 2023 Lows Incoming?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-up-30-versus-ethereum-new-2023-lows-incoming/",
    "description": "Bitcoin price is up 30% versus Ethereum (ETH) in 2023, and bulls appear not to be slowing down, looking at the performance in the weekly chart. BTC is on the brink of pushing ETH lower at spot rates, registering new 2023 lows and extending gains from early this year. The Downtrend Remains: Will Bitcoin Extend Rally? Bitcoin bulls are in the driving seat. Candlestick arrangement in the weekly chart shows that BTC pushed on, extending its rally against the second most valuable coin despite attempts for higher highs in mid-August.  In the second week of August, ETH added roughly 7% versus BTC. Notably, this expansion was after a period of horizontal consolidation as momentum shifted in favor of ETH. However, bears reversed gains and continued the primary trend established since the beginning of the year. Related Reading: XRP Ledger Developer Xumm Reveals “Infrastructure Overhaul,” More Than An Upgrade? The medium trajectory seems to be guided by events in mid-March 2023. Then, ETH prices devalued drastically versus Bitcoin, forming a bearish engulfing bar marked by a spike in trading volume. The surging demand for BTC saw prices reverse progress in late October 2022.  Bitcoin bulls have since extended gains versus Ethereum. However, one notable formation is that BTC is rallying at the back of light trading volume. Since the rally of BTC in Q1 2023 versus ETH, trading volume has been contracting despite prices printing lower lows.  Regulatory Pressure, Hacks In Focus, Will Halving Spark Demand? It cannot be immediately ascertained whether the current draw-down will continue. The level of participation has significantly decreased in the last six months as sentiment dipped.  Over the past two quarters, the involvement of regulators, including the Commodity Futures Trading Commission (CFTC) and the Securities and Exchange Commission (SEC), seems to have negatively impacted activity. In early June, the SEC sued Coinbase and Binance, two of the world’s leading cryptocurrency exchanges. The regulator cited various claims, accusing Coinbase of listing unregistered securities and Binance of, among other charges, manipulation and violating different securities laws. Binance and Coinbase plan to defend themselves against the SEC.  Related Reading: Bitcoin Spot Trading Volume Hit Six-Year Low – Is Investor Confidence Rising? Besides regulations, the broader community remains cautious, considering the number of hacks targeting multiple exchanges and decentralized finance (DeFi) protocols. Some of these exploits have been linked to the Lazarus Group, a notorious cell allegedly sponsored by North Korea. Despite the general market lull, traders look forward to the upcoming Bitcoin halving event in 2024. The event will create a supply shock, making BTC scarcer. Whether this will see BTC press ETH even lower back to June 2022 lows is yet to be seen. Feature image from Canva, chart from TradingView"
  }
]