[
  {
    "source": "Cointelegraph",
    "date": "2024-03-18T04:56:36.000Z",
    "title": " Cardano finally gets fiat-backed stablecoin USDM after huge delays ",
    "url": "https://cointelegraph.com/news/cardano-blockchain-launch-fiat-backed-stablecoin-usdm",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOWE2OTY5YjEtODhmZS00MDY2LWJhYmEtMDBkNDY1N2FiNDY5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mehen Finance planned to launch USDM in early 2023 but saw delays after crypto-friendly banks shuttered in 2023 and its banking partner went to work with Circle.</p>\n                    <p><p>Layer-1 blockchain Cardano has welcomed its first 1-to-1 fully fiat-backed stablecoin, USDM, the latest entrant in a $146 billion stablecoin market dominated by Tether <a href=\"https://cointelegraph.com/tether-price-index\">(USDT)</a> and Circle <a href=\"https://cointelegraph.com/usdc-price-index\">(USDC).</a> </p><p>Launched on March 17, the Mehen Finance-founded stablecoin <a href=\"https://www.cardanocube.com/collections/stablecoin\" target=\"_blank\" rel=\"noopener nofollow\">allows</a> holders to mint or redeem USDM via the United States dollar and differs from existing Cardano-based stablecoins such as DJED and iUSD, which are algorithmic and synthetic-based.</p><p>Mehen founding partner Matthew Plomin said the road to launching the stablecoin on Cardano wasn’t an easy one, with delays caused by issues with U.S. banks in 2023. </p><p><a href=\"https://cointelegraph.com/news/cardano-blockchain-launch-fiat-backed-stablecoin-usdm\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T04:47:09.000Z",
    "title": "Analyzing NYCB’s situation and its [perhaps] impending collapse",
    "url": "https://www.cryptopolitan.com/nycbs-situation-and-its-impending-collapse/",
    "description": "Every financial tempest leaves behind a trail of victors and vanquished. Amid the chaos of regional bank downturns in March 2023, New York Community Bancorp emerged, seemingly unscathed, clutching newly acquired pieces of Signature Bank in its victory lap. Fast forward a year, and the tables have turned dramatically for NYCB. Previously buoyed by strategic [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T04:39:58.000Z",
    "title": "LIX and ComAve form an alliance with AFC Ajax: A Milestone Partnership in the ComAve Ecosystem",
    "url": "https://www.cryptopolitan.com/lix-and-comave-form-an-alliance-with-afc-ajax-a-milestone-partnership-in-the-comave-ecosystem/",
    "description": "LIX, a leading blockchain-based loyalty rewards platform, proudly announces a transformative partnership with ComAve and AFC Ajax. This collaboration represents a significant achievement in LIX&#8217;s journey within the ComAve ecosystem, reinforcing its mission to redefine fan engagement and commerce across the retail, restaurant, and hospitality sectors. Rooted in the success of its deployment during the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T05:08:06.000Z",
    "title": "SOL Price Crosses $200 Milestone, What’s Next For Solana?",
    "url": "https://www.newsbtc.com/analysis/sol-price-crosses-200/",
    "description": "Solana is gaining bullish momentum above $200. SOL price is still showing positive signs, and it could even surpass the $220 resistance in the near term. SOL price gained bullish momentum and cleared the $200 resistance against the US Dollar. The price is now trading above $200 and the 100 simple moving average (4 hours). There is a connecting bullish trend line forming with support at $195 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could continue to rally if it clears the $205 and $212 resistance levels. Solana Price Extends Rally Solana price remained strong above the $150 level and extended its rally. There was a decent increase above the $165 and $180 levels. The price is up nearly 20% and there was a move above the $200 level, outperforming Bitcoin and Ethereum. A new multi-month high was formed near $204, and the price is now consolidating gains. It is stable above the 23.6% Fib retracement level of the upward move from the $142 swing low to the $204 high. There is also a connecting bullish trend line forming with support at $195 on the 4-hour chart of the SOL/USD pair. Solana is now trading above $200 and the 100 simple moving average (4 hours). Source: SOLUSD on TradingView.com Immediate resistance is near the $205 level. The next major resistance is near the $212 level. A successful close above the $212 resistance could set the pace for another major increase. The next key resistance is near $220. Any more gains might send the price toward the $232 level. Are Dips Supported in SOL? If SOL fails to rally above the $205 resistance, it could start a downside correction. Initial support on the downside is near the $195 level and the trend line. The first major support is near the $175 level or the 50% Fib retracement level of the upward move from the $142 swing low to the $204 high, below which the price could test $165. If there is a close below the $165 support, the price could decline toward the $150 support or the 100 simple moving average (4 hours) in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $19, and $175. Major Resistance Levels – $205, $212, and $220."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T04:42:26.000Z",
    "title": "Ethereum Price Grinds Lower, Why Pullback Is Not Over Yet",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-grinds-lower-3400/",
    "description": "Ethereum price started a downside correction below $3,650. ETH traded below $3,500 and is currently attempting a decent recovery wave in the near term. Ethereum started a downside correction below the $3,700 zone. The price is trading below $3,700 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,660 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its increase if it clears the $3,750 resistance zone. Ethereum Price Dips Ethereum price started a downside correction below the $3,800 and $3,700 levels, like Bitcoin. ETH declined below the $3,650 support level to enter a short-term bearish zone. It even spiked below the $3,500 support zone. A low was formed at $3,414 and the price is now attempting a recovery wave. There was a move above the $3,500 level. Ether climbed above the 23.6% Fib retracement level of the downward move from the $4,084 swing high to the $3,414 low. Ethereum price is now trading below $3,700 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $3,650 level. There is also a key bearish trend line forming with resistance at $3,660 on the hourly chart of ETH/USD. The first major resistance is near the $3,750 level or the 50% Fib retracement level of the downward move from the $4,084 swing high to the $3,414 low. The next major resistance is near $3,830, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com In the stated case, Ether could rally toward the $3,925 level. If there is a move above the $3,925 resistance, Ethereum could even rise toward the $4,000 resistance. Any more gains might call for a test of $4,080. More Losses In ETH? If Ethereum fails to clear the $3,650 resistance, it could start a fresh decline. Initial support on the downside is near the $3,520 level. The first major support is near the $3,500 zone. The next key support could be the $3,420 zone. A clear move below the $3,420 support might send the price toward $3,350. Any more losses might send the price toward the $3,250 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $3,500 Major Resistance Level – $3,650"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-18T05:04:26.000Z",
    "title": "Coinbase Solves Solana’s Delayed Sends; SOL Surges Above $200",
    "url": "https://coinedition.com/coinbase-solves-solanas-delayed-sends-sol-surges-above-200/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://coinedition.com/wp-content/uploads/2024/03/SOL2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SOL Surges 10.24% With Coinbase Solving Solana’s Delayed Sends\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/SOL2.jpg 512w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-127x70.jpg 127w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/SOL2-355x200.jpg 355w\" sizes=\"(max-width: 512px) 100vw, 512px\" /><p>U.S.-based crypto exchange Coinbase users faced technical issues causing delays in their Solana transactions. However, according to the recent update from Coinbase, the issue has been resolved. As per the official message posted on Coinbase’s page, some users experienced delayed sends for Solana (SOL). The notification highlighted that the delay happened on March 17, 2024, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/coinbase-solves-solanas-delayed-sends-sol-surges-above-200/\">Coinbase Solves Solana’s Delayed Sends; SOL Surges Above $200</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]