[
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T02:43:37.000Z",
    "title": "Ripple gets formal approval for Singapore payments license",
    "url": "https://cointelegraph.com/news/ripple-approval-singapore-payments-license",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/86e9460e-0f3f-496c-a325-1517e3cf5508.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ripple said it received its fully-fledged digital payment tokens license from the Monetary Authority of Singapore.</p>\n                    <p><p>Ripple says it received a license to operate as a major payments institution from Singapore's central bank allowing it to continue operations in the country after receiving in-principle approval in June.</p><p>In an Oct. 4 blog <a href=\"https://ripple.com/insights/ripple-fully-licensed-to-provide-digital-payment-token-services-in-singapore/\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, the company said its local entity, Ripple Markets APAC Pte Ltd, was granted the full license by the Monetary Authority of Singapore (MAS).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s official: Ripple is now fully licensed to provide digital payment token services in Singapore by <a href=\"https://twitter.com/MAS_sg?ref_src=twsrc%5Etfw\">@MAS_sg</a>! Ripple is committed to delivering real-world crypto solutions for businesses in APAC.<br><br>Learn more: <a href=\"https://t.co/jD8xSc2pdd\">https://t.co/jD8xSc2pdd</a></p>— Ripple (@Ripple) <a href=\"https://twitter.com/Ripple/status/1709389270962647382?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple chief Brad Garlinghouse said in a statement that \"Singapore has developed into one of the leading fintech and digital asset hubs striking the balance between innovation, consumer protection and responsible growth.”</p><p>Garlinghouse said Singapore was home to the firms Asia Pacific headquarters since 2017 and the country \"has been pivotal to Ripple’s global business.\"</p><p>The license allows Ripple to provide digital payment token services. It joins a <a href=\"https://eservices.mas.gov.sg/fid/institution?term=Digital%20Payment%20Token%20Service&sector=Payments&category=Major%20Payment%20Institution&activity=Digital%20Payment%20Token%20Service&page=2\" target=\"_blank\" rel=\"noopener nofollow\">list</a> of 14 others given the same license by MAS including the local arms of crypto exchanges Coinbase, Independent Reserve and Blockchain.com.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T03:00:30.000Z",
    "title": "Analyzing the upcoming contenders in the evolving crypto exchange landscape",
    "url": "https://cryptoslate.com/analyzing-the-upcoming-contenders-in-the-evolving-crypto-exchange-landscape/",
    "description": "<p>The ebb and flow of crypto regulations have been a fixture since the very beginning of the DeFi ecosystem. From the most liberal to the most stringent, every country and its regulators have constantly grappled with streamlining the market. In the United Kingdom, this dialogue has taken a pivotal turn, with the latest guidelines introduced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/analyzing-the-upcoming-contenders-in-the-evolving-crypto-exchange-landscape/\">Analyzing the upcoming contenders in the evolving crypto exchange landscape</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-04T02:45:39.000Z",
    "title": "Kevin O’Leary Warns of Crypto Innovation Fleeing US Due to Regulatory Hurdles",
    "url": "https://news.bitcoin.com/kevin-oleary-warns-of-crypto-innovation-fleeing-us-due-to-regulatory-hurdles/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kevin O&#039;Leary Warms of Crypto Innovation Exodus from US\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/kevin-oleary.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shark Tank investor Kevin O’Leary, aka Mr. Wonderful, has expressed concerns that regulatory obstacles will drive crypto innovation away from the U.S. His comments followed a congressional hearing where Congress members grilled U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler over crypto regulation. O’Leary Expects Crypto Innovation to Leave the U.S. Shark Tank investor [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T02:50:19.000Z",
    "title": "Ripple defeats SEC again as judge denies critical appeal bid",
    "url": "https://www.cryptopolitan.com/ripple-defeats-sec-again/",
    "description": "Ripple Labs, the entity behind the creation of the XRP token, has received a favorable ruling. District court judge Analisa Torres has denied the United States Securities and Exchange Commission&#8217;s (SEC) request to appeal its defeat in the case. Judge Torres, who previously ruled in July that Ripple&#8217;s direct sale of a cryptocurrency token to ... <a title=\"Ripple defeats SEC again as judge denies critical appeal bid\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-defeats-sec-again/\" aria-label=\"More on Ripple defeats SEC again as judge denies critical appeal bid\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T03:00:31.000Z",
    "title": "Economist Predicts “Monster” Move for Bitcoin: Is A 6X To $200,000 On The Table?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-6x-to-200000-btc-spx-ratio/",
    "description": "Macro-economist Henrik Zeberg thinks Bitcoin (BTC) and other risk assets are gearing up for a &#8220;monster&#8221; move, with the trend still in its early stages. Zeberg&#8217;s predictions are based on the BTC/SPX Ratio, an indicator that compares Bitcoin&#8217;s performance to the S&#38;P 500 index (SPX). BTC/SPX Ratio Says There Is A Monster Move Incoming Despite recent fluctuations and concerns about the crypto market&#8217;s sustainability, Zeberg remains bullish on BTC. In the analyst&#8217;s view, the BTC/SPX Ratio offers strong evidence that the Bitcoin uptrend is &#8220;just starting.&#8221; Based on price movements, the current leg down in September could provide opportunities for traders to accumulate. The BTC/SPX Ratio is an indicator that assesses the relative performance of Bitcoin and the stock market. The ratio is derived from dividing the Bitcoin and S&#38;P 500 index (SPX) spot prices. When it is rising, like it is presently the case, it indicates that Bitcoin is outperforming the stock market. Conversely, a declining ratio suggests that Bitcoin is underperforming. In that case, banking on the stock market could generate better returns than HODLing BTC. Related Reading: Twitter IPO: Dogecoin Takes Center Stage In Elon Musk’s X IPO Rumors From the chart shared on October 3, Zeberg said a &#8220;bull&#8221; signal was triggered in February 2023, preceding a substantial rally in Bitcoin&#8217;s price. By July 2023, Bitcoin had surged to approximately $32,000. While there has been a cooling-off period since then, Bitcoin is trending above February highs at around $25,200, confirming the uptrend. Between April 2019 and May 2021, when a similar bull signal was printed, BTC soared by 6X, while the S&#38;P 500 saw a more modest increase of 41%. Zeberg&#8217;s assessment, based on the BTC/SPX Ratio, suggests that Bitcoin&#8211;and other risk assets, by extension, can post strong gains in the months ahead. Will Bitcoin Fly To $200,000 This Bull Run? Whether this will be printed or not can only be speculated. Looking at the BTC/SPX Ratio, the indicator is lagging and doesn&#8217;t precisely capture market peaks or bottoms.  For instance, the last bear signal in May 2021 was months ahead before Bitcoin peaked in November 2021 and fell. Therefore, while the bull signal was recorded in early February 2023, it is unclear whether there will be another leg down before prices rise or bears press on, pushing the coin back to 2022 lows.  Related Reading: Cardano To Shed Its Gains? Profit-Taking Spikes To High Levels If buyers take control and the BTC/SPX Ratio indicator is correct, it is impossible to determine how high BTC will rise at current rates. If the last bull run is anything to go by, BTC may surge by 6X. In that case, BTC may rally and push beyond $200,000 in this bull cycle. Feature image from Canva, chart from TradingView"
  }
]