[
  {
    "source": "Cointelegraph",
    "date": "2023-06-10T07:54:09.000Z",
    "title": "Nigeria to tax crypto, digital assets 10% on capital gains: Experts react ",
    "url": "https://cointelegraph.com/news/nigeria-to-tax-crypto-digital-assets-10-on-capital-gains-experts-react",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c3d72a36-3063-4897-b27c-0c6d39c09b67.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Act aims to enhance fiscal transparency, boost revenue and recognize cryptocurrencies as legitimate assets. </p>\n                    <p><p>On the eve of his departure from office, May 28, former President Muhammadu Buhari signed into law the Finance Act 2023. </p><p>The Act <a href=\"https://pwcnigeria.typepad.com/files/2022-finance-bill_hor.pdf\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> a series of tax reforms aimed at modernizing the country’s fiscal framework. Among its provisions was the introduction of a 10% tax on gains from the disposal of <a href=\"https://cointelegraph.com/tags/digital-asset\">digital assets</a>, <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">including cryptocurrencies</a>.</p><p>The Finance Act 2023 is a comprehensive piece of legislation that seeks to enhance fiscal transparency, boost revenue generation and promote economic growth. Recognizing the increasing prominence of digital assets, such as cryptocurrencies, the Act aims to bring them into the purview of taxation. </p><p>By doing so, the Nigerian government seeks to create a level playing field and ensure that these assets contribute their fair share to the country’s development. This signifies Nigeria’s recognition of the growing influence and economic potential of digital assets while ensuring that the tax system keeps pace with the evolving financial landscape. Cointelegraph contacted the local crypto ecosystem to understand how the industry and the community accept the Act. </p><p>Local crypto expert Barnette Akomolafe, from the crypto exchange app M7pay spoke about how the taxation can be seen as a step towards recognizing cryptocurrencies as legitimate assets and integrating them into the existing financial and regulatory framework. This is considering the already existing ban previously reported by Cointelegraph, <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/central-bank-of-nigeria\">the Central Bank of Nigeria</a> <a href=\"https://cointelegraph.com/news/central-bank-of-nigeria-bans-banks-from-servicing-crypto-exchanges\">barred commercial banks from servicing crypto exchanges</a> back in February 2021.</p><p>Another local crypto expert, who prefers to stay anonymous said that the taxation of cryptocurrencies can be challenging due to the unique nature of digital assets, such as valuation, tracking transactions and international complexities. Governments need to establish clear guidelines and provide adequate education and support to taxpayers in return. This point of view seemed to be supported by more crypto ethusiaists. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Just read that very soon you all will start paying taxes on your crypto and Forex profits in Nigeria. <br><br>10% of your capital gains goes to government . What are we going to get in return?</p>&mdash; CryptoLord NE  (@CryptoDefiLord) <a href=\"https://twitter.com/CryptoDefiLord/status/1666795650153947138?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In many cases, governments do require the cooperation of crypto exchanges operating within their jurisdiction to track users' capital gains. By working with exchanges, authorities can access transaction data and identify individuals or entities for tax purposes. However, the level of cooperation and specific regulations vary from country to country. Some jurisdictions have implemented stricter requirements for exchanges to report user information, while others may have limited regulations or be in the process of developing them. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nigerian-crypto-company-suspends-withdrawals-after-btc-and-naira-compromise\"><strong><em>Nigerian crypto company suspends withdrawals after BTC and naira compromise</em></strong></a></p><p>Cointelegraph reached out to Binance Africa for a comment on this but didn’t get a response at the time of this publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-10T07:42:26.000Z",
    "title": "Shiba Inu (SHIB) Price Analysis for 10 June 2023: ‘A Strong Sell Signal’",
    "url": "https://www.cryptoglobe.com/latest/2023/06/shiba-inu-shib-price-analysis-for-10-june-2023-a-strong-sell-signal/",
    "description": "Introduction Welcome to our comprehensive price analysis report for Shiba Inu (SHIB) as of June 10, 2023. This report is based on price data, technical indicators, and moving average data sourced from Binance at 07:11 AM UTC. We delve into the intricate dynamics of SHIB’s price, volume, and key technical indicators. Whether you’re a seasoned […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-10T08:09:05.000Z",
    "title": "CFTC Scores Victory in Landmark Ooki DAO Litigation Case",
    "url": "https://www.cryptopolitan.com/cftc-victory-in-ooki-dao-litigation-case/",
    "description": "The U.S. Commodity Futures Trading Commission (CFTC) has achieved a significant victory in its litigation against the Ooki DAO, marking a major milestone in its ongoing efforts to combat illicit activities within the digital asset industry. The court&#8217;s decision establishes the legal liability of decentralized autonomous organizations (DAOs) and carries significant implications for the entire ... <a title=\"CFTC Scores Victory in Landmark Ooki DAO Litigation Case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cftc-victory-in-ooki-dao-litigation-case/\" aria-label=\"More on CFTC Scores Victory in Landmark Ooki DAO Litigation Case\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-10T07:49:38.000Z",
    "title": "Venture Firms Accuse Curve Founder of Elaborate Fraud Scheme",
    "url": "https://www.cryptopolitan.com/venture-firms-accuse-curve-founder-of-fraud/",
    "description": "Three prominent venture firms, ParaFi Digital Opportunities, Framework Ventures, and 1kx, have filed a lawsuit against Curve founder Michael Egorov, alleging an extensive fraudulent scheme and deception. The plaintiffs claim that Egorov misled them with false promises of a stake in Curve and subsequently stole their trade secrets. Egorov is further accused of using the ... <a title=\"Venture Firms Accuse Curve Founder of Elaborate Fraud Scheme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/venture-firms-accuse-curve-founder-of-fraud/\" aria-label=\"More on Venture Firms Accuse Curve Founder of Elaborate Fraud Scheme\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-10T07:48:05.000Z",
    "title": "Impervious: TMS Network (TMSN) Stands Resolute as Aptos (APT) and Chainlink (LINK) Falter",
    "url": "https://www.cryptopolitan.com/impervious-tms-network-tmsn-stands-resolute-as-aptos-apt-and-chainlink-link-falter/",
    "description": "The recent disruption in the ever-evolving landscape of cryptocurrency has invited many companies to bring innovation to the trading market. As currencies like Aptos (APT) and Chainlink (LINK) struggle to stabilize, the steadfast approach and commitment to innovation of&#160;TMS Network (TMSN)&#160;have allowed it to thrive amidst a volatile market. Here is a detailed comparison between ... <a title=\"Impervious: TMS Network (TMSN) Stands Resolute as Aptos (APT) and Chainlink (LINK) Falter\" class=\"read-more\" href=\"https://www.cryptopolitan.com/impervious-tms-network-tmsn-stands-resolute-as-aptos-apt-and-chainlink-link-falter/\" aria-label=\"More on Impervious: TMS Network (TMSN) Stands Resolute as Aptos (APT) and Chainlink (LINK) Falter\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-10T07:50:40.000Z",
    "title": "New Cardano-Based Decentralized Prediction Platform Enters The Market, Foreon Network",
    "url": "https://www.crypto-news-flash.com/new-cardano-based-decentralized-prediction-platform-enters-the-market-foreon-network/?utm_source=rss&utm_medium=rss&utm_campaign=new-cardano-based-decentralized-prediction-platform-enters-the-market-foreon-network",
    "description": "Despite current controversies on its status, a new prediction protocol, Foreon Network has made its way into the Cardano protocol. Foreon Network has a goal of becoming the dominant Web3.0 prediction tool in 5 years. Foreon Network, an information market prediction platform which is based on the Cardano (ADA) blockchain is poised for outstanding growth [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-10T07:45:31.000Z",
    "title": "Chainlink (LINK) and DigiToads (TOADS) Lead the Pack Amidst Volatile Market Conditions",
    "url": "https://www.crypto-news-flash.com/chainlink-link-and-digitoads-toads-lead-the-pack-amidst-volatile-market-conditions/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-and-digitoads-toads-lead-the-pack-amidst-volatile-market-conditions",
    "description": "Market conditions are tough in the crypto world right now, making picking a winner harder than it once was. But it&#8217;s still not impossible: defi tokens like TOADS and LINK lead the pack with the upside they both bring to the table. So if you&#8217;re looking for altcoin investments that don&#8217;t just survive in volatile [...]"
  }
]