[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T03:30:56.000Z",
    "title": "AI-Driven Tech Stocks Set for Explosive Growth",
    "url": "https://www.cryptopolitan.com/ai-driven-tech-stocks-explosive-growth/",
    "description": "AI-driven tech stocks"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T03:10:56.000Z",
    "title": "Bitcoin Price Nosedives and Turns Attractive To Sellers On Recovery",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-nosedives-25k-2/",
    "description": "Bitcoin price tumbled below the $28,400 support. BTC tested $24,800 and is currently attempting a recovery wave toward $27,000. Bitcoin is down over 6% and trading below the $27,000 support zone. The price is trading below $26,800 and the 100 hourly Simple moving average. There are two bearish trend lines forming with resistance near $27,500 and $28,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move down and trade below the $25,800 support. Bitcoin Price Breaks Support Bitcoin price started a fresh decline after it failed to stay above the $28,400 support zone. BTC declined heavily after it broke the $28,000 support zone. It is down over 6% and there was a spike below the $25,500 support zone. A low is formed near $24,800 and the price is now attempting a recovery wave. It recovered above the $25,000 and $26,000 levels. However, the bears are now protecting the 50% Fib retracement level of the downward move from the $29,182 swing high to the $24,800 low. Bitcoin is now trading below $27,000 and the 100 hourly Simple moving average. There are two bearish trend lines forming with resistance near $27,500 and $28,500 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $27,000 level. The next major resistance is near $27,500 and the trend line. It is close to the 61.8% Fib retracement level of the downward move from the $29,182 swing high to the $24,800 low. The main resistance is now forming near the $28,500 zone and the 100 hourly Simple moving average. Source: BTCUSD on TradingView.com A close above the $28,500 resistance could start a decent increase toward the $29,200 resistance zone. Any more gains might set the pace for a larger increase toward $30,000. Another Decline In BTC? If Bitcoin fails to clear the $27,500 resistance, it could continue to move down. Immediate support on the downside is near the $25,800 zone. The next major support is near the $25,500 level. A downside break below the $25,500 level might push the price further into a bearish zone. In the stated case, the price could drop toward $24,800. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 40 level. Major Support Levels – $25,800, followed by $25,500. Major Resistance Levels – $27,000, $27,500, and $28,500."
  }
]