[
  {
    "source": "CoinDesk",
    "date": "2024-03-08T06:43:09.000Z",
    "title": "U.S. Will Appeal Do Kwon's Extradition to South Korea: Report",
    "url": "https://www.coindesk.com/policy/2024/03/08/us-will-appeal-do-kwons-extradition-to-south-korea-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. will appeal the ruling of a Montenegro Court to hand Terraform Labs co-founder Do Kwon to South Korea, according to Bloomberg."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T07:07:53.000Z",
    "title": "Ex-Google Engineer’s Alleged Scheme Leads to CEO Role in Chinese Startup",
    "url": "https://www.cryptopolitan.com/ex-google-engineers-alleged-ceo-startup/",
    "description": "In a startling turn of events, a former Google software engineer, Linwei Ding, has been apprehended under accusations of orchestrating an intricate scheme to pilfer vital AI and supercomputing secrets from Google Cloud. Ding, also known as Leon, allegedly capitalized on this stolen knowledge to ascend to the position of CEO at Shanghai Zhisuan Technology [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T06:46:12.000Z",
    "title": "Can AI Bias Be Overcome in Data Collection Practices?",
    "url": "https://www.cryptopolitan.com/can-ai-bias-be-overcome-in-data-collection/",
    "description": "In a world where data reigns supreme, the issue of AI bias in data collection has become a pressing concern. Yet, amidst discussions at the 2024 Consumer Electronics Show in Las Vegas, a beacon of hope emerged – the potential of AI to revolutionize data collection practices. With the theme of &#8220;Harnessing the Power of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T06:40:31.000Z",
    "title": "Biometric Facial Recognition at Texas Airports",
    "url": "https://www.cryptopolitan.com/facial-recognition-at-texas-airports/",
    "description": "Texas airports have embraced biometric facial recognition technology in a swift evolution of travel security, replacing traditional ID checks with a more streamlined and efficient system. The Transportation Security Administration (TSA) has spearheaded this initiative, installing the system in over 200 U.S. airports to enhance identity verification accuracy and expedite security processes. This article delves [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-08T07:04:18.000Z",
    "title": "Uniswap’s $UNI Token Surges Over 143% In Four Weeks, Hits Yearly High",
    "url": "https://nulltx.com/uniswaps-uni-token-surges-over-143-in-four-weeks-hits-yearly-high/",
    "description": "In the past four weeks, the price of the $UNI token has experienced an impressive surge, marking a remarkable 143% increase fueled by heightened buying demand.  This recovery rally propelled the token&#8217;s price above $10, with Uniswap breaking through the significant $13.5 resistance level to reach a yearly high of [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-08T06:55:13.000Z",
    "title": "Ribbon Finance (RBN) Surges 20% In 24 Hours, Leading DeFi Trend",
    "url": "https://nulltx.com/ribbon-finance-rbn-surges-20-in-24-hours-leading-defi-trend/",
    "description": "Over the past 24 hours, Ribbon Finance (RBN), a decentralized finance (DeFi) platform renowned for its derivatives and structured products, has experienced a remarkable 20% surge in its price, marking an impressive 80% increase over the past week.  The price of $RBN has increased by more than 75%! And whales [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-08T06:46:38.000Z",
    "title": "Fetch.AI Token (FET) Hits New All-Time High Amidst Fetch Compute Launch",
    "url": "https://nulltx.com/fetch-ai-token-fet-hits-new-all-time-high-amidst-fetch-compute-launch/",
    "description": "The AI token FET has soared to unprecedented heights, reaching a new all-time high of $2.84, closely following the trajectory set by the core cryptocurrency market. Fetch.AI Foundation&#8217;s recent announcement on March 5, 2024, unveiling &#8220;Fetch Compute&#8221; alongside a substantial $100 million investment in enhancing the AI economy, has been [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-08T06:42:35.000Z",
    "title": "Ethereum’s Price Surge Fueled By Whale Accumulation",
    "url": "https://nulltx.com/ethereums-price-surge-fueled-by-whale-accumulation/",
    "description": "In recent weeks, Ethereum (ETH) has experienced notable price momentum, largely attributed to significant accumulation by Ethereum whales. This trend has caught the attention of crypto enthusiasts and investors alike, signaling positive sentiment towards the digital asset. According to on-chain data analysis, two major ETH accumulators have emerged during this [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-08T06:58:44.000Z",
    "title": "Ethereum Price (ETH) On The Path To Rally Past $4K",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-rally-4k/",
    "description": "Ethereum price extended its increase toward $3,950. ETH is now consolidating gains and might aim for a move above the $4,000 resistance. Ethereum traded to a new multi-month high above $3,940. The price is trading above $3,850 and the 100-hourly Simple Moving Average. There was a break above a short-term bullish flag pattern with resistance at $3,830 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its increase if it clears the $3,940 resistance zone. Ethereum Price Remains In Strong Uptrend Ethereum price extended its rally above the $3,850 level, unlike Bitcoin. BTC failed to extend gains above the $68,000 zone and is now consolidating gains. However, ETH silently moved higher above $3,850. There was a break above a short-term bullish flag pattern with resistance at $3,830 on the hourly chart of ETH/USD. The pair broke the $3,900 resistance zone. It traded to a new multi-month high above $3,940 and recently started a consolidation phase. There was a pullback below the $3,900 level. The price tested the 23.6% Fib retracement level of the recent increase from the $3,716 swing low to the $3,943 high. Ethereum is now trading above $3,850 and the 100-hourly Simple Moving Average. Immediate resistance on the upside is near the $3,920 level. The first major resistance is near the $3,940 level. The next major resistance is near $4,000, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com The next stop for the bulls could be near the $4,080 level. If there is a move above the $4,080 resistance, Ether could even rally toward the $4,220 resistance. Any more gains might call for a test of $4,350. Are Dips Limited In ETH? If Ethereum fails to clear the $3,940 resistance, it could start another downside correction. Initial support on the downside is near the $3,850 level. The first major support is near the $3,800 zone or the 76.4% Fib retracement level of the recent increase from the $3,716 swing low to the $3,943 high. The next key support could be the $3,720 zone. A clear move below the $3,720 support might send the price toward $3,550. Any more losses might send the price toward the $3,400 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,720 Major Resistance Level – $3,940"
  }
]