[
  {
    "source": "CryptoSlate",
    "date": "2024-01-27T14:00:46.000Z",
    "title": "PayPal to launch AI-powered products",
    "url": "https://cryptoslate.com/paypal-to-launch-ai-powered-products/",
    "description": "<p>PayPal announced on Jan. 25 that it will launch a variety of artificial intelligence (AI)-powered products aimed at end users and merchants. In an interview with Reuters, PayPal President and CEO Alex Chriss said: &#8220;The data that we have and our ability to actually see what people have bought and know what merchants are trying [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/paypal-to-launch-ai-powered-products/\">PayPal to launch AI-powered products</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-27T14:03:44.000Z",
    "title": "Crypto craze as DeeStream (DST) launches its long-awaited presale! Investors from Pepe (PEPE) and Bonk (BONK) rush to buy",
    "url": "https://cryptodaily.co.uk/2024/01/crypto-craze-as-deestream-dst-launches-its-long-awaited-presale-investors-from-pepe-pepe-and-bonk-bonk-rush-to-buy",
    "description": "Cryptocurrency fans are excited because DeeStream (DST) has now started its much-awaited presale."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-27T13:49:48.000Z",
    "title": "Will users of Amazon and eBay see value in the new Pushd (PUSHD) presale as Ripple (XRP) and Litecoin (LTC) investors buy in",
    "url": "https://cryptodaily.co.uk/2024/01/will-users-of-amazon-and-ebay-see-value-in-the-new-pushd-pushd-presale-as-ripple-xrp-and-litecoin-ltc-investors-buy-in",
    "description": "In the changing world of digital currencies Ripple (XRP) and Litecoin (LTC) are moving forward indicating signs of improvement and steadiness."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T13:52:58.000Z",
    "title": "Solana’s price behavior: Analyst bluntz capital eyes $70s target",
    "url": "https://www.cryptopolitan.com/solanas-price-behavior-analyst-bluntz/",
    "description": "Cryptocurrency analyst Bluntz Capital, known for accurately predicting the cryptocurrency market bottom in 2018, has expressed renewed interest in Solana ($SOL) as the smart contract platform&#8217;s price exhibits intriguing patterns.&#160; Bluntz Capital recently shared insights on Twitter, pointing to an Elliott Wave Theory pattern known as a &#8220;B wave triangle.&#8221; This development has caught the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T13:45:54.000Z",
    "title": "Bitcoin halving event could impact the profitability of major miners",
    "url": "https://www.cryptopolitan.com/bitcoin-halving-event-could-impact/",
    "description": "Financial firm Cantor Fitzgerald has released a report warning that the upcoming Bitcoin halving event, expected in April, may severely impact the profitability of major publicly traded Bitcoin (BTC) miners.&#160; The report highlights that eleven out of thirteen miners, including well-known names such as Argo Blockchain and Hut 8 Mining, could struggle to maintain profitability [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-27T13:51:55.000Z",
    "title": "BlackRock’s IBIT Maintains Lead In BitcoETF Market, Crosses $2 Billion In Inflows",
    "url": "https://www.newsbtc.com/news/bitcoin/blackrocks-ibit-maintains-lead-in-bitcoetf-market-crosses-2-billion-in-inflows/",
    "description": "According to data from BitMEX Research, BlackRock’s Bitcoin spot ETF &#8211; IBIT &#8211;  has now set a new record, achieving a total net inflow of $2 billion. This feat allows IBIT to maintain its position as the best-performing fund of the bunch, following the approval of 11 Bitcoin spot ETFs by the US Securities and Exchange Commission on January 10. Related Reading: Bitcoin plummets 20% post-ETF approvals: what’s behind the crash? BlackRock’s IBIT Maintains Dominance As Total Net Flows Reach $744.6 Million On January 25, which marked the tenth trading day of the Bitcoin spot ETF market, BlackRock’s IBIT produced an unsurprising positive performance, notching $170.7 million in inflows. This gain allowed the investment fund to move into an exclusive list as the first Bitcoin spot ETF to amass $2 billion in market cap. Commenting on this feat, Bloomberg analyst James Seyfarrt has credited the recent rise in BTC’s price as a major contributing factor. He said: Yes, the #Bitcoin price has pushed $IBIT&#8216;s assets beyond $2 billion. This plus likely new flows today should mean it will be above $2 billion at close. Following the trading debut of BTC spot ETFs on January 11, IBIT quickly emerged as an investor’s favorite, recording the highest individual daily inflows of the market at $386 million on January 12. BlackRock’s BTC spot ETF has managed to retain this investors’ attention over the first two trading weeks, evidenced by its consistent positive performances, which has culminated in a total flow of $2.086 billion. IBIT’s performance is closely followed by Fidelity’s FBTC, which recorded $101 million in inflows on January 25, moving its total flows to $1.825 billion. Meanwhile, other Bitcoin spot ETFs with notable performances include Bitwise’s BITB and Ark Invest’s ARKB, both of which boast individual cumulative AUMs of over half a billion dollars. In other news, the outflows in Grayscale’s GBTC remain a constant trend; however, there has been a notable decline in selling volume over the last few days. At the time of writing, GBTC&#8217;s total outflow is valued at $4.786 billion. In comparison with a cumulative inflow of $5.53 billion, total flows in the Bitcoin spot ETF market stand at $744.6 million.  Source: BitMEX Related Reading: Bitcoin Capitulation: Holders Flee BTC As Post-ETF Disappointment Hits Bitcoin Price Overview At press time, Bitcoin is currently trading at $41,725.19 following a 4.52% price gain in the past day, according to data from CoinMarketCap. This recent uptick is quite significant, considering the asset’s previous bearish form, marked by a 20% decline over the last two weeks which resulted in BTC’s dipping below $39,000.  Bitcoin’s price has been negatively affected by GBTC’s massive outflows; however, as the selling pressure appears to be decreasing, coupled with consistent positive performances of other ETFs, notably BlackRock’s IBIT, that crypto market leader could soon pull off a market recovery. BTC trading at $41,802.61 on the daily chart &#124; Source:  BTCUSDT chart on Tradingview.com Featured image from Reuters, chart from Tradingview"
  }
]