[
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T10:37:05.000Z",
    "title": "Robert F. Kennedy Jr. criticizes SEC’s approach to crypto regulation, calls for change",
    "url": "https://www.cryptopolitan.com/robert-f-kennedy-jr-criticizes-secs-approach-to-crypto-regulation-calls-for-change/",
    "description": "In a recent interview with TheStreet, U.S. presidential candidate Robert F. Kennedy Jr. (RFK Jr.) expressed his support for the cryptocurrency industry and criticized the Securities and Exchange Commission (SEC) for its regulatory approach. Kennedy, a well-known environmental attorney, and activist, emphasized the need for crypto-friendly individuals on the SEC Commission and accused the regulator ... <a title=\"Robert F. Kennedy Jr. criticizes SEC&#8217;s approach to crypto regulation, calls for change\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robert-f-kennedy-jr-criticizes-secs-approach-to-crypto-regulation-calls-for-change/\" aria-label=\"More on Robert F. Kennedy Jr. criticizes SEC&#8217;s approach to crypto regulation, calls for change\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T10:32:43.000Z",
    "title": "Crypto’s fate tied to upcoming U.S. presidential election?",
    "url": "https://www.cryptopolitan.com/crypto-fate-tied-to-us-presidential-election/",
    "description": "A wavering climate has shadowed the cryptocurrency market in recent weeks, challenging investors to deduce whether digital assets offer a safe haven from financial risk or are themselves part of the risky asset class. Yesterday&#8217;s oscillation was no exception with Bitcoin (BTC) declining by 1.3% to $27,746 and Ethereum (ETH) down by 1.1% to $1,893 ... <a title=\"Crypto&#8217;s fate tied to upcoming U.S. presidential election?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-fate-tied-to-us-presidential-election/\" aria-label=\"More on Crypto&#8217;s fate tied to upcoming U.S. presidential election?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T10:22:07.000Z",
    "title": "North Korea plans spy satellite to monitor U.S. drills",
    "url": "https://www.cryptopolitan.com/north-korea-spy-satellite-monitor-us-drills/",
    "description": "The North Korean regime, in an unexpected declaration, disclosed plans to venture into satellite espionage for military purposes. This unveiling signals the nation&#8217;s maiden foray into launching a spy satellite – a development that has triggered a ripple effect on defense stocks in South Korea and Japan. The impending project comes in the wake of ... <a title=\"North Korea plans spy satellite to monitor U.S. drills\" class=\"read-more\" href=\"https://www.cryptopolitan.com/north-korea-spy-satellite-monitor-us-drills/\" aria-label=\"More on North Korea plans spy satellite to monitor U.S. drills\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T10:19:41.000Z",
    "title": "Bitcoin is in dangerous position as demand dries up ",
    "url": "https://crypto.news/bitcoin-is-in-dangerous-position-as-demand-dries-up/",
    "description": "Bitcoin (BTC) finds itself in a critical position, experiencing a decrease in demand despite a recent break above the $28,000 price level. This prevailing bearish scenario provides no substantial backing for the asset&#8217;s current price movement to counteract further declines.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T10:36:19.000Z",
    "title": "Traders Act Fast As Binance Australia Unveils Bitcoin Discount For Limited Period",
    "url": "https://www.newsbtc.com/news/bitcoin/binance-australia-unveils-bitcoin-discount-in-countdown/",
    "description": "In an intriguing development for crypto traders, Binance Australia has introduced an exclusive Bitcoin discount, offering a unique opportunity for savvy investors. The platform&#8217;s recent announcement comes in the midst of a countdown to a significant payment deadline, adding a sense of urgency to the offer. While Bitcoin (BTC) currently trades above $27,000 on several exchanges, it traded at a price of AUD34,863 on (USD22,670) Binance Australia lower than its current price on exchanges. The limited period that comes with the discount has made some traders act fast so as to take advantage of the reduced price. Bitcoin Trading At A Discount Recent market data has revealed an intriguing trend on Binance Australia, with Bitcoin and other digital tokens trading at a discount compared to rival exchanges within the country. Related Reading: No All-Time High For Bitcoin In 2023, Former BitMEX Head Arthur Hayes Predicts CryptoCompare data shows that Bitcoin traded at A$34,863 ($22,670) on Binance Australia, significantly lower than the average price on platforms like Independent Reserve and CoinJar. Notably, discounts of around 20% were also observed for popular tokens such as Ethereum (ETH) and Solana (SOL). The discount on Binance Australia is closely linked to impending changes in the platform&#8217;s payment withdrawal options. Starting from 5 p.m. on June 1, users will no longer be able to withdraw Australian dollars to their bank accounts using the popular PayID service. This follows the platform&#8217;s earlier loss of access to certain Aussie dollar deposit services, creating a series of challenges for cryptocurrency enthusiasts.  Industry experts have weighed in on the situation, shedding light on the motivations behind the discounted Bitcoin prices. Richard Galvin, the co-founder of fund manager Digital Asset Capital Management, explains that Australian clients are selling Bitcoin at a discount to ensure they can withdraw their Australian dollars before the payment deadline. This urgency has created a unique opportunity for investors looking to acquire Bitcoin at a reduced price. Furthermore, to ease the withdrawal process for users, Binance Australia has devised a solution. Following the payment deadline, Australian dollar balances can be converted into the Tether stablecoin, facilitating both withdrawals and trading activities. The platform is actively seeking alternative providers to restore AUD deposit and withdrawal services, underscoring its commitment to offering a seamless user experience. BTC Latest Price Action Meanwhile, Bitcoin hasn&#8217;t shown any significant move in the past week. Instead, the largest crypto asset by market capitalization has recorded sluggish movement up by only 1.7% in the past 7 days. Over the past 24 hours, BTC has seen a 0.1% loss. At the time of writing, Bitcoin currently trades at $27,849 after trading slightly above $28,000 on Sunday. Bitcoin’s trading volume has plunged a bit from $14 billion earlier last week to $12 billion in the past 24 hours indicating less trading activity. Related Reading: JPMorgan Predicts Bitcoin (BTC) To Revisit $45,000, Here’s Why However, the asset’s market capitalization has seen a more than $10 billion gain in the past 7 days. BTC&#8217;s market cap has surged from $528 billion last Tuesday to $539 billion as of today. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T10:32:37.000Z",
    "title": "Ripple Address Activity Spikes; Will There Be an XRP Price Surge?",
    "url": "https://coinedition.com/ripple-address-activity-spikes-will-there-be-an-xrp-price-surge/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/😮_XRPNetwork_has_now_had_its_2nd__3rd_largest_address_activity-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The blockchain intelligence firm Santiment shared in a tweet published earlier this morning that the Ripple (XRP) network experienced significant spikes in address activity recently. According to the post, the network saw its second and third biggest address activity spikes of all time in the past 2 days. This surge in address activity also resulted [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripple-address-activity-spikes-will-there-be-an-xrp-price-surge/\">Ripple Address Activity Spikes; Will There Be an XRP Price Surge?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]