[
  {
    "source": "Decrypt",
    "date": "2023-08-26T18:01:41.000Z",
    "title": "Bear Market 'Much Worse Than Expected’: Analysts Pitch New Bitcoin Economy Framework",
    "url": "https://decrypt.co/153864/bear-market-much-worse-than-expected-analysts-pitch-new-bitcoin-economy-framework",
    "description": "“It provides a toolkit to properly understand the economic realities of Bitcoin,” says co-author James Check of Glassnode."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-26T18:00:46.000Z",
    "title": "Base Chain TVL Surpasses Cardano As Interest Swells",
    "url": "https://www.newsbtc.com/news/cardano/base-cardano-tvl/",
    "description": "Ethereum Layer 2 network “Base” has surpassed Cardano in terms of Total Value Locked (TVL) in just two weeks after its official launch, despite Cardano experiencing a multi-year head start in growth and development.  Base TVL And Trading Volume Rises Above Cardano Presently, Cardano is facing criticism from users due to its TVL falling below that of the newly launched project &#8220;Base&#8221; built by Coinbase. One individual who has publicly criticized the project is Evan Van Ness, a Consensys member and Ethereum advocate. Van Ness took to his X (formerly Twitter) account which boasts over 103,000 followers to call Cardano a &#8220;Zombie chain&#8221; because it was below Base by TVL despite being years ahead of the latter. Related Reading: This Ethereum Metric Has Sparked Centralization Concerns Over ETH Ownership Base was launched on August 9 and it has experienced impressive growth and momentum since it was introduced to the public. According to Data from DeFillama, the layer 2 network Base recorded a higher trading volume ($26.23 million) than that of the layer 1 network Cardano ($20 million) in less than 24 hours after its official launch.  In terms of TVL, at the time Van Ness’s chart was shared on X, Base had managed to secure $188 million in TVL since it was introduced, surpassing Cardano which sat at the 14th position by TVL with $160 million. However, these figures have since been flipped especially since ADA is seeing a green day on Saturday. DefiLlama data currently shows a TVL of $188.46 million for Cardano versus $185.53 million for Base. Cardano TVL overtakes Base once more &#124; Source: DeFiLlama Nevertheless, data from L2beat points Base&#8217;s rise in TVL over the past week puts it ahead of StarkNet and others which made it the fifth largest layer-2 network.  Base TVL is, however, not the only impressive thing about the L2, as the network has outperformed Cardano by completing more transactions in its first week than Cardano&#8217;s transactions in a month.  Although Base&#8217;s TPS may be lower than that of other layer 2 networks like Optimism (OP), investors and market observers believe that the network will experience more adoption as its ecosystem grows. Rising Average Transactions Per Second Base has recorded over 11 million transactions in less than a month since its official launch. Base&#8217;s average transactions per second over the past few days has been reported to be 15.88, surpassing other layer 2 blockchain Abritrum (AB) and Optimism (OP). The network&#8217;s 15.88 also shows an increase of almost 160% in daily Transactions Per Second (TPS).  Related Reading: MasterCard Axes Partnership With Binance Amid Regulatory Pressures Base&#8217;s TPS rise was no coincidence as more investors engage in Base&#8217;s Friend.tech. Friend.tech is a social market that allows users to buy and sell shares in public figures. It has reportedly garnered more than 100,000 users since its release. Other protocols such as Synthenix have also shown interest in the Base network, as the protocol recently concluded a governance vote to deploy on Base. Another development is the on-chain analytics firm Arkham Intelligence announcing on X earlier in the week that it will be adding support for Base. ADA price recovers during the weekend &#124; Source: ADAUSD on Tradingview.com Featured image from Bitcoinist, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-26T18:00:28.000Z",
    "title": "Why Bitcoin Spark Can Outshine Ethereum and Solana in Your Crypto Portfolio",
    "url": "https://www.crypto-news-flash.com/why-bitcoin-spark-can-outshine-ethereum-and-solana-in-your-crypto-portfolio/",
    "description": "<img width=\"294\" height=\"171\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-88.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" />Bitcoin Spark announced its entry into the crypto space with a fresh perspective capturing investors’ and enthusiasts’ attention. This Bitcoin fork looks destined to give Ethereum and Solana, with their smart contract capabilities and high-speed transaction networks, a run for their money.  Bitcoin Spark (BTCS) Bitcoin Spark changes the crypto narrative with its compelling blockchain [...]"
  }
]