[
  {
    "source": "Crypto Daily",
    "date": "2023-07-22T12:30:00.000Z",
    "title": "Conic Finance Becomes Latest DeFi Protocol To Suffer Exploit",
    "url": "https://cryptodaily.co.uk/2023/07/conic-finance-becomes-latest-defi-protocol-to-suffer-exploit",
    "description": "<p>DeFi protocol Conic Finance revealed that it had suffered an exploit, with the attacker draining over 1700 ETH worth $3.6 million from one of its Omnipools.</p>\n<p>Conic Finance is a liquidity pool balancing platform for the decentralized finance protocol Curve.</p>\nDetails Of The Hack&nbsp;\n<p>According to security firm BlockSec, the attack&rsquo;s root cause was price manipulation caused by &ldquo;read-only reentrancy.&rdquo; Reentrancy is a common bug that allows attackers to exploit smart contracts by tricking them into making repeated calls to the targeted protocol and stealing its assets. A call is an authorization for a smart contract to interact with a user&rsquo;s wallet address. Web3 risk-alert source Beosin stated that a single transaction sent nearly the stolen amount to a new Ethereum address. Conic Finance reached out to users, tweeting they were investigating the exploit and would share updates soon.&nbsp;</p>\n<p>&ldquo;We are currently investigating an exploit involving the ETH Omnipool and will share updates as soon as they are available.&rdquo;</p>\n<p>Security firm PeckShield also analyzed the attack, revealing the root cause to be originating from the protocol&rsquo;s new CurveLPOracleV2 contract. The firm tweeted,&nbsp;</p>\n\n<p>&ldquo;Hi, @ConicFinance. Based on the initial analysis from the malicious tx, our initial analysis shows the root cause comes from the new CurveLPOracleV2 contract. FWIW, our audit identifies a similar read-only reentrancy issue. However, the same issue is introduced in the newly introduced CurveLPOracleV2 contract, which was not part of the audit scope.&rdquo;</p>\n\n<p>Curve has also been following up with Conic Finance, stating that the primary issue had been identified and only the ETH Omnipool was impacted.&nbsp;</p>\n\n<p>&ldquo;If you have funds on @ConicFinance please remove! There seem to be an attack, which though doesn't drain all in one go&rdquo;</p>\n\n<p>Conic later tweeted a detailed version of events, stating that they were alerted of an exploit impacting the $crvUSD Omnipool, adding they had taken all possible safety measures to limit the attack.</p>\n<p>&ldquo;Roughly four hours ago, we were alerted of an exploit affecting the $crvUSD Omnipool. In response to this and given today&rsquo;s ETH exploit, we immediately enforced maximum safety measures and temporarily shut down all Omnipools.&rdquo;</p>\nDeFi Hacks A Major Problem&nbsp;\n<p>The decentralized finance ecosystem has been plagued by a series of high-profile hacks impacting several major projects. A report by Web3 portfolio application De.Fi highlighted the scale of the problem. The reports stated that DeFi hacks and scams resulted in attackers stealing over $200 million in the second quarter of 2023 alone. However, losses to DeFi hacks were smaller in Q2 when compared to Q1 of 2023, with CertiK reporting that protocols lost over $320 million between January and March.&nbsp;</p>\n<p>Conic Finance had only recently gone live, allowing users to deposit tokens into their Omnipools. Omnipools allowed users to diversify their exposure across the Curve ecosystem and also increased rewards. After going live, Conic Finance was able to attract millions of dollars in capital, highlighting the huge demand for such a product. Conic&rsquo;s Omnipools work by allocating the liquidity of a single asset across multiple Curve pools. Curve liquidity provider (LP) tokens are staked on Convex, boosting CRV rewards.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T12:12:29.000Z",
    "title": "How Merck’s RPA and AI Bots Streamline Operations by As Much as 97%",
    "url": "https://www.cryptopolitan.com/how-mercks-rpa-and-ai-bots-streamline-operations-by-as-much-as-97/",
    "description": "With a prestigious legacy spanning over three centuries, global pharmaceutical giant Merck embarked on a remarkable journey four years ago. Daring to break away from traditional practices, the organization embraced cutting-edge technology in robotic process automation (RPA) and AI bots to streamline its regulatory filing processes. The result? Enhanced efficiency and drastic reductions in documentation ... <a title=\"How Merck&#8217;s RPA and AI Bots Streamline Operations by As Much as 97%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-mercks-rpa-and-ai-bots-streamline-operations-by-as-much-as-97/\" aria-label=\"More on How Merck&#8217;s RPA and AI Bots Streamline Operations by As Much as 97%\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-22T12:20:45.000Z",
    "title": "Maker (MKR) Surges 26% In A Week As Token Buyback Program Goes Live",
    "url": "https://www.newsbtc.com/maker-mkr/maker-mkr-surges-26-in-a-week-as-token-buyback-program-goes-live/",
    "description": "In the past week, Maker (MKR) token has captured significant attention in the crypto market, surging an impressive 26%. This remarkable price action coincides with the introduction of a groundbreaking token buyback program by the leading decentralized finance (DeFi) lending platform, MakerDAO. As the DeFi ecosystem continues to expand, Maker (MKR) stands out as one of the largest and oldest DeFi lending protocols, gaining popularity for its issuance of the widely used DAI stablecoin with a market value of $4.6 billion. MKR Token Buyback Program Triggers Surge The recent surge in Maker (MKR), the governance token of the $5.3 billion decentralized finance (DeFi) lender MakerDAO, can be attributed to the implementation of a token buyback program. The token buyback scheme, named the Smart Burn Engine, is designed to remove MKR tokens from the market. The mechanism involves allocating excess DAI stablecoins from Maker&#8217;s surplus buffer to purchase MKR tokens from a UniSwap pool. The governance proposal behind this initiative aims to strengthen the token&#8217;s value and governance while actively engaging MKR holders in voting on crucial proposals. Related Reading: Dogecoin Becomes 8th-Largest Cryptocurrency After Adding $1 Billion To Market Cap According to blockchain data, the lending platform is poised to remove approximately $7 million worth of MKR governance tokens from the market over the next month through this buyback initiative. With the token&#8217;s total market capitalization standing at around $1 billion, the buyback represents a 0.7% reduction in the token&#8217;s supply per month, potentially enhancing MKR&#8217;s scarcity and value proposition. This strategic move is likely to attract further interest and investment from the crypto community. The token buyback program has already shown promising results, with MakerDAO purchasing approximately $230,000 worth of MKR tokens within the last 24 hours. This early success indicates positive momentum and investor interest in the buyback initiative.  Maker: Significant Developments In 2023 In addition to the token buyback program, MakerDAO has been proactively diversifying its revenue streams by investing its DAI reserve assets into traditional financial products, such as bank loans and government bonds. This strategic decision has proven to be fruitful, as it enables the platform to generate sustainable revenue from yields, providing a solid basis for potential growth and long-term value. Unlike meme coins lacking tangible business prospects, Maker&#8217;s diversified revenue streams instill confidence in investors and the broader DeFi community, making it an attractive investment option. Related Reading: Bitfinex Hackers Surrender: Couple Agrees to Forfeit 120,000 Bitcoin in Plea Deal Beyond the token buyback and DAI reserve investments, MakerDAO is also undergoing a significant overhaul that includes upgrades for both the DAI and MKR tokens. Furthermore, the platform is transitioning into smaller autonomous organizations known as SubDAOs, which have the potential to issue their own tokens. These developments signal a dynamic future for MakerDAO and highlight the platform&#8217;s commitment to continuous innovation and progress. Over the past 24 hours, there has been a 9.98% decrease in the price. However, in the last hour alone, the price has shown a modest increase of 0.28%. As of now, the current price of MKR stands at $1,094.53. It&#8217;s important to note that Maker is currently 82.73% below its all-time high, which was recorded at $6,339.02. (This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured Image from istock, chart from TradingView."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-22T12:10:21.000Z",
    "title": "Cardano 2023: 5 Pioneering Blockchain Projects Reshaping Industries",
    "url": "https://www.crypto-news-flash.com/cardano-2023-5-pioneering-blockchain-projects-reshaping-industries/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-2023-5-pioneering-blockchain-projects-reshaping-industries",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Cardano blockchain is witnessing significant growth with innovative projects spanning AI, telecoms, cloud storage, prediction markets, and meme-centric coins. Five exciting projects on Cardano, including CardanoGPT, World Mobile, Iagon, Foreon Network, and Snek, are set to revolutionize various industries. Cardano 2023: 5 Pioneering Blockchain Projects Reshaping Industries Cardano, the third-generation Proof-of-Stake blockchain, is rapidly becoming [...]"
  }
]