[
  {
    "source": "CryptoGlobe",
    "date": "2024-02-27T23:01:00.000Z",
    "title": "Bitcoin ETFs Fuel Crypto Investment Boom as Solana Struggles",
    "url": "https://www.cryptoglobe.com/latest/2024/02/bitcoin-etfs-fuel-crypto-investment-boom-as-solana-struggles/",
    "description": "Cryptocurrency investment products have seen inflows of $597.8 million over the past week, bringing year-to-date inflows to over $5.7 billion as demand from spot Bitcoin exchange-traded funds (ETFs) remains high. Bitcoin-focused investment products – which include the spot Bitcoin ETFs, saw over $569.5 million of inflows over the past week according to CoinShares’ latest Digital […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-27T23:00:22.000Z",
    "title": "FLOKI Skyrockets 32% Higher Following DWF Labs’ $10 Million Acquisition Plan",
    "url": "https://www.newsbtc.com/news/floki-skyrockets-32-higher-following-dwf-labs-10-million-acquisition-plan/",
    "description": "In a significant development for the Floki Inu memecoin, digital asset market maker investment firm DWF Labs has revealed its plans to purchase $10 million worth of FLOKI tokens. The announcement has triggered a remarkable surge in the token&#8217;s price, propelling it to a new 9-month high at $0.00005097. DWF Labs Strengthens Partnership With Floki Inu According to the official statement, DWF Labs will acquire the tokens directly from the Floki treasury over two years, reflecting DWF Labs&#8217; commitment to support the protocol&#8217;s ecosystem.  As announced, the firm recognizes the potential for an &#8220;explosive&#8221; bull run in the cryptocurrency industry and aims to leverage FLOKI&#8217;s utility and marketing strength to capitalize on this opportunity. The partnership between Floki and DWF Labs was initially established in May 2023, when DWF Labs purchased $5 million worth of FLOKI tokens. Since then, DWF Labs has played a pivotal role in boosting FLOKI adoption.  Related Reading: Bitcoin Fear &#38; Greed Index Reaches Highest Level Since 2021, What To Expect Next Through the partnership, DFW Labs reportedly facilitated key exchange listings, introduced Floki to influential industry projects, and publicly championed the token&#8217;s progress and achievements. DFW Labs concluded in the announcement: This massive FLOKI token purchase will further deepen our relationship with DWF Labs while strategically positioning FLOKI for dominance in an increasingly competitive landscape during this bull run Price Soars, TVL Rises, And Chinese TV Exposure Exciting developments continue for FLOKI as it gains significant exposure on China&#8217;s national sports TV channels, CCTV5 and CCTV5+. This exposure results from a strategic market partnership announced in 2023, which took place during the ITTF World Team Table Tennis Championships Finals in Busan 2024. According to the memecoin development team, this opportunity to be featured on mainstream Chinese television has introduced Floki and its sister asset, TokenFi (TOKEN), to an extensive audience of over 340 million people and solidified their presence in the Chinese market. The Floki Inu team expressed their excitement about this milestone, emphasizing that being featured on mainstream Chinese television is remarkable, making them among the very few cryptocurrencies to receive such recognition. Related Reading: Bitcoin Spot ETF Inflows Eye New Record As BTC Price Touches $57,000 Another achievement for Floki Inu is the success of their FlokiFi Locker, a decentralized finance (DeFi) crypto locker protocol. The team announced that the Total Value Locked (TVL) in the FlokiFi Locker had reached an all-time high of $111 million, setting a new record and highlighting the widespread adoption of the token&#8217;s utility products. In addition, the team announced that the total value locked for staked FLOKI tokens has reached an all-time high of $105 million. This represents 25% of the token&#8217;s supply, with $105,313,899 worth of tokens locked and staked for up to 4 years. This position of dominance in staking distinguishes the dog-themed token from other major &#8220;memecoins&#8221; such as DogeCoin (DOGE), Shiba Inu (SHIB), BONK, and PEPE, as FLOKI has the largest share of its supply staked among them. The memcoin token is trading at $0.00004080, maintaining its gains with a surge of over 32% in the last 24 hours. As a result, the market capitalization has jumped to nearly $500 million, reaching $475 million, according to the latest update. Additionally, the trading volume for FLOKI has significantly increased, reaching $204 million in the past 24 hours. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-27T23:01:49.000Z",
    "title": "Binance Venture Capital Arm Announces Investment in Bitcoin Staking Protocol Babylon",
    "url": "https://dailyhodl.com/2024/02/27/binance-venture-capital-arm-announces-investment-in-bitcoin-staking-protocol-babylon/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Binance Labs is investing in Babylon, a Bitcoin (BTC) staking protocol. According to a new announcement from Binance, Binance Labs, Binance&#8217;s venture capital arm and incubator, is investing in Babylon, a new BTC staking protocol. &#8220;Binance Labs&#8230; has invested in Babylon, a Bitcoin staking protocol that pioneers the concept of native Bitcoin staking allowing users to stake [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/27/binance-venture-capital-arm-announces-investment-in-bitcoin-staking-protocol-babylon/\">Binance Venture Capital Arm Announces Investment in Bitcoin Staking Protocol Babylon</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]