[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T01:44:56.000Z",
    "title": "Goldman Sachs, Citadel, Citigroup, and UBS join BlackRock’s Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/wall-street-banks-blackrocks-bitcoin-etf/",
    "description": "BlackRock just beefed up its Bitcoin ETF (exchange-traded fund) lineup with heavyweights from Wall Street stepping into the ring. The latest roster features the likes of ABN AMRO Clearing, Citadel Securities, Citigroup Global Markets, Goldman Sachs, and UBS Securities. This move represents a strategic pivot in the way Bitcoin ETFs are perceived and operated within [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-06T02:00:51.000Z",
    "title": "Is Not Holding ADA A ‘Red Flag’? Cardano’s Founder Thinks So, Community Pokes At Solana",
    "url": "https://www.newsbtc.com/news/is-not-holding-ada-a-red-flag-cardanos-founder-thinks-so-community-pokes-at-solana/",
    "description": "Cardano (ADA)&#8217;s founder is a man of many words and many GIFs. Charles Hoskinson’s comments, whether you agree or disagree with them, tend to spark discussions in the crypto community. Hoskinson’s latest X reply spree covered issues from dating advice to his confidence in the ecosystem to Solana’s recent struggles. As a result, several conversations regarding those topics and Cardano’s founder’s perspectives on them spread across the X platform. Related Reading: Cardano Price Tumbles As Grayscale Sells All ADA From Large Cap Fund Charles Hoskinson’s Dating Advice Charles Hoskinson offered some crypto-related dating advice in a reply to Lily Brodi, the creator of the viral ‘Cardano Girls’ video. The content creator asked whether it was weird to ask someone on the first day if they held ADA. Cardano’s founder replied that not holding ADA was a “major red flag” at this point. Hoskinson jokingly insinuated that the person might “not be a cannibal,” but if they don’t hold Cardano’s native token, you should be alert anyway. At this point, not holding ada is a major red flag. I mean I&#39;m not saying they are cannibals, but&#8230; pic.twitter.com/s2CzXr2Hxr &#8212; Charles Hoskinson (@IOHK_Charles) April 4, 2024 Later, he suggested he might know one or two eligible “Cardano bachelors.” The community found Hoskinson’s comments funny, with some agreeing with his perspective on potential partners. Nonetheless, not all Hoskinson’s replies during his Wednesday spree were well received. Cardano’s founder seemingly took a jab at Solana after learning of the blockchain’s recent struggle to process transactions. The post informed us of the levels of congestion that the Solana network is experiencing. According to Dune data, the Solana blockchain currently has a non-vote transaction failure rate of over 75%. Three out of four transactions are experiencing issues before even making it to the block. The failure rate seems to occur “because many bots engaging in arbitrage generate spam transactions.” To the news, Hoskinson replied with a popular gif of actor Pedro Pascal enjoying himself. This guy is exactly why Cardano ngmi Cardano has a douchebag founder https://t.co/Xn0Dj1VDsG &#8212; LawrenceOfCrypto.sol (@LawrenceCrypt0) April 5, 2024 This reply prompted some X users to criticize Cardano’s Founder. Some even called him a “douchebag founder” and claimed that answers like that are the reason why the project “won’t make it.” However, the ADA community joined in the criticism of the Solana network. Some community members deemed the chain as “useless.” Another ADA holder stated: “The Solana team does not know the basic principles of how blockchain works.” The comments don’t come as a surprise as both communities’ ongoing “feud” tends to end in a jab and poking fun at each other’s struggles. “Cardano Always Wins” Or Does It? As part of Hoskinson&#8217;s recent “insight,” he commented on a recent poll ranking the best Layer-1 networks. In said poll, the Cardano ecosystem had the second-highest number of voters. Nonetheless, its founder didn’t seem pleased, claiming that “It was engineered to produce an outcome prior to a single vote being cast.” To Hoskinson, in a “fair vote,” it is clear that “Cardano always wins.” Despite his confidence in the project, the ADA price has recently shown a subpar performance. The token has exhibited red numbers in several timeframes, with an 11.5% drop in the last seven days and a 20.5% decrease in the past month. The token’s current performance has not gone unnoticed by analysts either. Renowned crypto analyst Ali Martinez raised some concerns about ADA’s whale activity. According to Martinez, “Cardano is experiencing a lull in whale activity.” The analyst considers that this could signal a potential for further price consolidation or an impending drop. The unclear trajectory of ADA’s price seems concerning to its holders, as some consider its current performance to be “extremely bearish right now.” At the time of writing, ADA is trading at $0.5748, a level not seen since Valentine’s Day. Related Reading: ADA Price Prediction – Here’s Why Cardano Could Dump To $0.50  Cardano (ADA) performance in the weekly chart. Source: ADAUSDT on Tradingview.com  Featured Image from Unsplash.com, Chart from TradingView.com"
  }
]