[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T05:05:45.000Z",
    "title": "Corporate Giants Forge Paths for Secure Generative AI Adoption",
    "url": "https://www.cryptopolitan.com/corporate-secure-generative-ai-adoption/",
    "description": "In a world where generative AI&#8217;s allure dances with security concerns, a Deloitte survey has exposed a clandestine wave of workplace adoption. One in ten UK adults stealthily incorporates ChatGPT-like services into their daily tasks, raising questions about managerial endorsement and the risks of unchecked usage.&#160; As the intricacies unfold, major corporations are treading cautiously, ... <a title=\"Corporate Giants Forge Paths for Secure Generative AI Adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/corporate-secure-generative-ai-adoption/\" aria-label=\"More on Corporate Giants Forge Paths for Secure Generative AI Adoption\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-23T05:08:19.000Z",
    "title": "LINK Price Pumps 40% In Three Days, Why Bulls Are Not Done Yet",
    "url": "https://www.newsbtc.com/analysis/link/link-price-pumps-40-pc-to-11/",
    "description": "Chainlink’s LINK price is up over 40% and trading above $10. The bulls seem to be in control and might aim a rally toward the $12 resistance. Chainlink price is gaining pace above the $10.00 resistance against the US dollar. The price is trading above the $10.00 level and the 100-day simple moving average. There is a key bullish trend line forming with support near $8.60 on the daily chart of the LINK/USD pair (data source from Kraken). The price could continue to move up toward the $11.25 and $12.00 resistance levels. Chainlink Price Starts Fresh Rally In the past few days, LINK price started a strong rally against the US Dollar. The price formed a base above the $7.00 level before the bulls stepped in. There was a major pump above the $7.50 and $8.00 resistance levels. In the last three days, the price gained over 40% and cleared many hurdles near $9.00. The recent pump in Bitcoin also helped LINK surpass the $10.00 resistance. A new multi-week high is formed near $10.99. The price is now consolidating gains well above the 23.6% Fib retracement level of the upward move from the $7.11 swing low to the $10.99 high. LINK is now trading above the $10.00 level and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $8.60 on the daily chart of the LINK/USD pair. The trend line is near the 61.8% Fib retracement level of the upward move from the $7.11 swing low to the $10.99 high. Source: LINKUSD on TradingView.com If there is a fresh increase, the price might face resistance near $11.20. The first major resistance is near the $12.00 zone. A clear break above $12.00 may possibly start a steady increase toward the $12.20 and $12.50 levels. The next major resistance is near the $13.20 level, above which the price could test $15.00. Are Dips Limited in LINK? If Chainlink fails to climb above the $11.20 resistance level, there could be a downside correction. Initial support on the downside is near the $10.00 level. The next major support is near $9.00, below which the price might test the trend line support at $8.60. Any more losses could lead LINK toward the $8.00 level in the near term. Technical Indicators 4 hours MACD – The MACD for LINK/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for LINK/USD is now above the 50 level. Major Support Levels – $10.00 and $9.00. Major Resistance Levels – $11.20 and $12.00."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-23T04:45:12.000Z",
    "title": "Ethereum Dragged Higher By Bitcoin But Can ETH Clear Hurdles?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-dragged-higher-by-bitcoin-1700/",
    "description": "Ethereum price started a decent increase after Bitcoin gained momentum against the US dollar. ETH is rising and might test the key $1,750 resistance. Ethereum started a decent increase above the $1,650 resistance. The price is trading above $1,660 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,645 on the hourly chart of ETH/USD (data feed via Kraken). The pair could climb further higher, but it might face strong resistance near $1,750. Ethereum Price Reclaims $1,650 Ethereum stayed above the $1,550 support zone. The recent pump in Bitcoin above the $28,500 resistance sparked bullish moves in ETH. There was a steady increase above the $1,600 and $1,620 resistance levels. The price even cleared the key $1,650 resistance zone. A high is formed near $1,700 and the price is now consolidating gains. It is trading well above the 23.6% Fib retracement level of the upward move from the $1,620 swing low to the $1,700 high. Ethereum is now trading above $1,660 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,645 on the hourly chart of ETH/USD. The trend line is near the 61.8% Fib retracement level of the upward move from the $1,620 swing low to the $1,700 high. On the upside, the price is facing resistance near the $1,700 level. The first major resistance is near the $1,720 zone. The next key resistance is $1,750, where the bears might emerge. To continue higher, the price must settle above the $1,750 resistance. Source: ETHUSD on TradingView.com In the stated case, Ether could start a strong increase toward the $1,880 resistance. Any more gains might open the doors for a move toward $2,000. Downside Correction in ETH? If Ethereum fails to clear the $1,700 resistance, it could start a downside correction. Initial support on the downside is near the $1,660 level. The next key support is $1,645 and the trend line zone. A downside break below the $1,645 support might send the price further lower. In the stated case, the price could drop toward the $1,620 level and the 100-hourly Simple Moving Average. Any more losses may perhaps send Ether toward the $1,550 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,645 Major Resistance Level – $1,700"
  }
]