[
  {
    "source": "CoinDesk",
    "date": "2023-07-06T00:29:30.000Z",
    "title": "First Mover Asia: Bitcoin Near $30.5K Remains Cool to BlackRock CEO Comments, Hawkish FOMC Minutes",
    "url": "https://www.coindesk.com/markets/2023/07/06/first-mover-asia-bitcoin-near-305k-remains-cool-to-blackrock-ceo-comments-hawkish-fomc-minutes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "PLUS: A candidate to become Thailand's next Prime Minister owns bitcoin, ether, BNB and ADA. Here's why the disclosure by Pita Limjaroenrat matters."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T00:27:46.000Z",
    "title": "Celsius founder Alex Mashinsky broke US rules, say CFTC investigators: Report",
    "url": "https://cointelegraph.com/news/former-celsius-ceo-mashinsky-broke-cftc-rules-investigators",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/887f0fc5-3a8f-4cd0-8082-5f5b8b87a727.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>If the majority of CFTC commissioners agree with that conclusion, it could file a case in federal court.</p>\n                    <p><p>Investigators from the Commodity Futures Trading Commission have reportedly concluded that bankrupt crypto lender Celsius and its former CEO Alex Mashinsky broke U.S. rules before the company collapsed.</p><p>According to a July 5 <a href=\"https://www.bloomberg.com/news/articles/2023-07-05/cftc-probe-concludes-crypto-lender-celsius-ex-ceo-mashinsky-broke-rules\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg, citing sources familiar with the matter, the attorneys from the CFTC's enforcement division found that Celsius misled investors, failed to register with the appropriate regulator, and that Mashinsky broke a number of regulations.</p><p>The CFTC could reportedly file a case against the collapsed crypto lender in U.S. federal court sometime this month, if the majority of the CFTC commissioners agree with the investigators’ findings.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T00:30:55.000Z",
    "title": "Bitcoin Options Open Interest At Near 2021 Peaks, Will BTC Break Above $31,300?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-options-open-interest-2021-btc-break-31300/",
    "description": "The total Bitcoin Options open interest, the number of open call and put orders, recently rose to $14.87 billion on June 30 before falling to $10.74 billion on July 4, on-chain data on July 5 shows. Related Reading: Valkyrie Follows In BlackRock’s Footsteps, Refiles For Spot Bitcoin ETF At $14.87 billion, the total number of Bitcoin Options open interest at top trading platforms, mostly Deribit, CME, and OKX, stood at near all-time highs registered in October 2021 when prices went on to rally, printing all-time highs of over $69,000. On October 21, the total Bitcoin open interest stood at $15.06 billion, a record high that has never been broken. BTC Options At Near 2021 Peaks Many traders seem optimistic about the future of Bitcoin, as open interest remains high and trending near the peak levels of October 2021. With a strong close to the first half of 2023, the expectation is for prices to continue rising. The recent surge in Bitcoin prices, reaching new highs in June 2023 at $31,300, could be seen as a sign of overall bullishness, similar to the period before prices reached over $69,000 in November 2021. This skew and apparent optimism can be shown by the distribution of &#8220;call&#8221; and &#8220;put&#8221; Bitcoin options across major crypto derivatives trading platforms of which Deribit dominates. For instance, as of July 5, over 65% of all Bitcoin options orders are &#8220;calls,&#8221; meaning more traders expect prices to rise from spot rates. At this level, roughly 206,000 BTC orders are placed as &#8220;calls.&#8221;  Meanwhile, a minority of traders expect price contracts from spot rates towards $28,300 or lower in the coming months. About 99,000 BTC options have been placed as &#8220;puts&#8221; to align with traders&#8217; expectations of worse prices in the coming months. Bitcoin Traders Bullish The same can be observed in trading patterns over the past 24 hours. Despite Bitcoin prices falling 2% but staying above the $30,000 psychological level, most options traders are bullish since there are more &#8220;calls&#8221; than &#8220;puts.&#8221;  Typically, Options give the contract holder the right or the obligation to buy or sell the underlying asset at an agreed price on or before the expiry date. Mostly, options contracted are used by traders to mitigate risks. More &#8220;calls&#8221; could mean more BTC traders are optimistic, expecting the coin to clear recent resistance levels. Based on recent trends, Options trading volumes have been decreasing on Deribit. After peaking at $3.29 billion on October 16, 2021, participation levels have been shrinking over the past 20 months.  Related Reading: Crypto Market Trade Volume Hits Lowest Point Since 2020 Amid Market Turbulence Trading was suppressed throughout 2022 during the bear market, which saw Bitcoin drop below $16,000 in November 2022. Since then, Options trading volumes rose, peaking at over $2.3 billion in March 2023. It has since dropped below the $1 billion level when writing on July 5.   Cover image from Canvas, chart from Tradingview"
  }
]