[
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T08:07:59.000Z",
    "title": " London Police blocks 43 crypto phishing web domains ",
    "url": "https://cointelegraph.com/news/crypto-phishing-web-domains-blocked-police-london-uk",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOWIyMjU3YTktMzNiNS00MzE0LWI2NGMtNTA1ZGU4NWEwYzIyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A commissioner update announced that authorities in London found a spoof address pretending to be from blockchain.com and found 42 more phishing web domains related to the account. </p>\n                    <p><p>The National Fraud Intelligence Bureau (NFIB), a police unit dedicated to analyzing and gathering fraud and finance-related cybercrime intelligence, blocked 43 web domains linked to fraudulent activities.  </p><p>According to an <a href=\"https://democracy.cityoflondon.gov.uk/documents/s197472/Pol_12-24_Commissioners_Update_PAB%20Feb%2024%20vFINAL.pdf\" target=\"_blank\" rel=\"noopener nofollow\">update</a> from the City of London Police’s temporary commissioner, Pete O’Doherty, the NFIB found a spoof email address purporting to be from the crypto site blockchain.com. The authorities found that 42 more web domains have been registered, including “actionfraud.info” and “department-fraud.com.” The authorities blocked the addresses as soon as they were discovered. </p><p>The NFIB urged people who fell victim to cybercrimes to report it on their official channels and hotline. police unit said that as of December 2023, they’ve managed to remove almost 300,000 malicious websites because of the reports. Some phishing attempts include claiming that the email recipient won a Tupperware set. </p><p><a href=\"https://cointelegraph.com/news/crypto-phishing-web-domains-blocked-police-london-uk\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T07:39:35.000Z",
    "title": " Bitcoin price passes $46K after S&amp;P 500 reaches historic highs ",
    "url": "https://cointelegraph.com/news/bitcoin-price-46k-sp-500-historic-highs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzVhMmZmM2YtOTg0OC00Y2YxLThiY2UtOTk0MDVjMDhjNzJlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin and stocks should continue to see a solid bid, analysis concludes, as BTC price strength takes bulls ever closer to the top of the range.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) took aim at January highs on Feb. 9 as bulls beat out overhead resistance.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> captured a fresh BTC price uptick to $46,365 on Bitstamp.</p><p>Up over 2% since the daily close, BTC/USD dealt with increasing sell-side liquidity as it returned to levels not seen since the launch of the United States spot Bitcoin exchange-traded funds (ETFs).</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-46k-sp-500-historic-highs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-09T07:40:27.000Z",
    "title": "Predicting the Dollar’s Downfall: Expert Foresees Cataclysmic Shift in Global Gold Pricing",
    "url": "https://www.cryptoglobe.com/latest/2024/02/predicting-the-dollars-downfall-expert-foresees-cataclysmic-shift-in-global-gold-pricing/",
    "description": "In a recent detailed discussion with Michelle Makori, Lead Anchor and Editor-in-Chief at Kitco News, Matthew Piepenburg, Partner at Matterhorn Asset Management, delved into the nuances of the de-dollarization trend and its implications for the pricing of dollar-denominated gold. Piepenburg, who is also a board member at SignalsMatter.com, brings a wealth of knowledge in real […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T08:08:04.000Z",
    "title": "Federal court decision impacts crypto industry in Australia",
    "url": "https://www.cryptopolitan.com/federal-court-decision-impacts-crypto/",
    "description": "In a recent federal court decision, Block Earner, a prominent player in the cryptocurrency space, faces penalties over its Earner product, signaling significant implications for the broader crypto industry in Australia.&#160; The ruling, delivered by federal judge Darren Jackson, distinguishes between crypto-yield products, asserting that while those offering managed yields necessitate a financial services license, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T08:06:00.000Z",
    "title": "Whales are diversifying beyond Bitcoin in 2024, we tracked their top 2 altcoin picks, and both are surprising",
    "url": "https://www.cryptopolitan.com/whales-are-diversifying-beyond-bitcoin-in-2024-we-tracked-their-top-2-altcoin-picks-and-both-are-surprising/",
    "description": "Whales, or huge holders of digital assets, are crucial players in the always-changing cryptocurrency investment scene, helping to shape market trends and propel price fluctuations. Even though Bitcoin has long been regarded as the cryptocurrency king, new research suggests that whales are expanding their holdings outside of the leading coin. We&#8217;ve tracked these well-known investors&#8217; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T08:01:28.000Z",
    "title": "Coinbase faces legal scrutiny over alleged mishandling of customer assets",
    "url": "https://www.cryptopolitan.com/coinbase-faces-legal-scrutiny-over-alleged/",
    "description": "Coinbase, a leading cryptocurrency exchange, is under intense scrutiny following allegations of mishandling customer assets. Fred Rispoli, an attorney at HODL Law firm, has criticized the exchange for purportedly converting customer assets, specifically Songbird’s SGB tokens, to its control.&#160; Rispoli likened this alleged action to the unauthorized conversion of customer property, sparking discussions about token [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T07:56:19.000Z",
    "title": "Solana’s recovery and social dominance surge",
    "url": "https://www.cryptopolitan.com/solanas-recovery-and-social-dominance-surge/",
    "description": "In the wake of recent fluctuations, Solana (SOL) has demonstrated resilience by bouncing back above the $100 mark, indicating a potential bottom formation for the cryptocurrency. Despite temporary setbacks from network outages, Solana&#8217;s recovery has been bolstered by a surge in Social Dominance, as reported by on-chain analytics firm Santiment. Solana&#8217;s price resilience Solana, a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T07:46:42.000Z",
    "title": "Former CEO charged with embezzling $47.1 million to buy cryptocurrency",
    "url": "https://www.cryptopolitan.com/embezzling-47-1-million-buy-cryptocurrency/",
    "description": "The former chief executive officer of Heartland Tri-State Bank, Shan Hanes, has been charged with embezzling a staggering $47.1 million from the institution to purchase cryptocurrency assets. This revelation has sent shockwaves through the tight-knit community of Elkhart, leaving investors grappling with significant financial losses. Allegations and shock in the community Prosecutors allege that Hanes [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T07:44:14.000Z",
    "title": "Bitcoin Price Prediction 2024-2033: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2024-2033 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $46,224, with a trading volume over the past 24 hours reaching $24 billion. Its market capitalization is $887 billion, and it currently commands 54% of the market share. Over the last 24 hours, the BTC price has experienced [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T08:08:20.000Z",
    "title": "Bankrupt lender Genesis Global strikes settlement over NY fraud claims",
    "url": "https://crypto.news/bankrupt-lender-genesis-global-strikes-settlement-over-ny-fraud-claims/",
    "description": "Genesis Global, a bankrupt cryptocurrency lender, has reached a settlement with New York Attorney General Letitia James over allegations of defrauding customers through its now-defunct Gemini Earn program. The latest settlement aims to return assets to former Earn customers and&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-09T08:00:57.000Z",
    "title": "Cardano (ADA): Green Shoots Emerge – Is A 30% Price Growth Next?",
    "url": "https://www.newsbtc.com/news/cardano-ada-green-shoots-emerge-is-a-30-price-growth-next/",
    "description": "Cardano (ADA), the eighth largest cryptocurrency by market capitalization, is experiencing a surge of excitement among investors. A 10% price increase within the past 24 hours has fuelled optimism, further amplified by crypto analyst Ali Martinez&#8217;s prediction of a potential 32% jump to $0.68. Martinez&#8217;s prediction is based on both technical analysis and recent positive price movements. Related Reading: Boom! Bitcoin Barrels Past $46,000, Eyes $50K As Bullish Sentiment Returns Cardano: No More Downtrend &#8211; For Now One key technical indicator identified by Martinez is the descending triangle pattern on the daily chart. This pattern often foreshadows the end of a downtrend, offering hope for Cardano&#8217;s future trajectory. However, for the bullish scenario to materialize, Cardano needs to maintain its price above $0.53, acting as a crucial support level. #Cardano shows signs of a descending triangle formation on its daily chart. A sustained daily close above $0.53 could lead to the start of a 32% rally, potentially pushing $ADA up to $0.68! pic.twitter.com/DoizuVPiRI — Ali (@ali_charts) February 8, 2024 Adding to the positive sentiment, Cardano&#8217;s recent performance has been stellar, outperforming its top 10 cryptocurrency peers. While Bitcoin (BTC) saw a 2.48% increase, Ethereum (ETH) gained 3.15%, and Binance Coin (BNB) climbed 4.04%, Cardano managed a noteworthy 10% surge. This impressive performance was accompanied by a staggering 121% increase in trading volume within a single day, reaching 599.29 million. Such a significant rise in volume suggests strong buyer interest and potentially indicates a shift in momentum. However, not everyone is fully convinced about Cardano&#8217;s upward trajectory. The Social Dominance metric, which measures the relative amount of discussion surrounding a cryptocurrency compared to the overall crypto market, has dropped to nearly 0.60%. Cardano currently trading at $0.5359 on the daily chart: TradingView.com ADA&#8217;s Potential Growth Faces Challenges This could imply that ADA might not have reached its local peak yet, suggesting room for further growth. Additionally, the Cumulative Value Delta (CVD), a measure of buying and selling pressure, remains negative, indicating the presence of aggressive sellers who could pose a challenge to the predicted price increase. Despite these potential headwinds, another key metric offers encouragement. Open Interest (OI), which reflects the total amount of outstanding contracts in futures markets, has seen a significant increase. This suggests that buyers are positioning themselves for further price appreciation, potentially indicating their confidence in Cardano&#8217;s future. Source: Coinalyze Related Reading: Bitcoin Nears $45,000 Level In Historic Price Surge Following Spot ETF Debut Furthermore, NewsBTC highlights Cardano&#8217;s ongoing development activity with numerous projects in the pipeline. The Alonzo hard fork, which enabled smart contracts on the Cardano blockchain, is considered a significant milestone that could attract developers and drive future adoption, potentially impacting the value of ADA tokens. While it&#8217;s still too early to definitively say whether Cardano will reach the predicted $0.68, the recent upswing, technical indicators, and strong buyer interest suggest a potential breakout. However, investors should exercise caution, as the cryptocurrency market remains volatile and susceptible to sudden shifts. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-09T08:05:01.000Z",
    "title": "Following Dips In MANTA and ORDI, The Crypto Community Looks To NuggetRush For Recovery",
    "url": "https://www.crypto-news-flash.com/following-dips-in-manta-and-ordi-the-crypto-community-looks-to-nuggetrush-for-recovery/?utm_source=rss&utm_medium=rss&utm_campaign=following-dips-in-manta-and-ordi-the-crypto-community-looks-to-nuggetrush-for-recovery",
    "description": "<img width=\"1040\" height=\"650\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-75-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-75-1.png 1040w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-75-1-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-75-1-768x480.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-75-1-150x94.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-75-1-450x281.png 450w\" sizes=\"(max-width: 1040px) 100vw, 1040px\" />A recent DDOS attack could be responsible for Manta’s decline. Ordi’s value has fallen sharply since the start of 2024. NuggetRush’s (NUGX) early holders are now enjoying an 80% token value increase. Manta fell in early February after a spectacular market increase following its January launch. Ordi holders also look towards Bitcoin to spur a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-09T07:51:00.000Z",
    "title": "Best Meme Coins to Buy Now: What You Need to Know about the Top Trending Meme Tokens",
    "url": "https://www.crypto-news-flash.com/best-meme-coins-to-buy-now-what-you-need-to-know-about-the-top-trending-meme-tokens/?utm_source=rss&utm_medium=rss&utm_campaign=best-meme-coins-to-buy-now-what-you-need-to-know-about-the-top-trending-meme-tokens",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-70.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-70.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-70-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-70-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-70-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-70-450x253.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />In the ever-evolving crypto world, meme coins have carved out their own niche, combining the elements of internet culture with blockchain technology. These tokens often gain traction for their humor, unique features, and active online communities. Here, we explore some of the top trending meme tokens, including ApeMax, Dogecoin, Shiba Inu, Coq Inu, Bonk, Floki [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-09T07:50:16.000Z",
    "title": "altFINS launches Trade & Earn program to reward traders with premium features",
    "url": "https://www.crypto-news-flash.com/altfins-launches-trade-earn-program-to-reward-traders-with-premium-features/?utm_source=rss&utm_medium=rss&utm_campaign=altfins-launches-trade-earn-program-to-reward-traders-with-premium-features",
    "description": "<img width=\"1200\" height=\"628\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-69-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-69-1.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-69-1-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-69-1-768x402.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-69-1-150x79.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-69-1-450x236.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />altFINS has announced the launch of the Trade &#38; Earn program, which rewards traders with access to Premium Tier features on the altFINS platform.   This is a truly unique value proposition not offered by any DEX, DEX Aggregator or wallet provider. Richard Fetyko, CEO of altFINS, stated: “We believe that traders should get more [...]"
  }
]