[
  {
    "source": "CoinDesk",
    "date": "2023-07-07T17:55:23.000Z",
    "title": "Storj, Filecoin and Solana Lead First Week of July Crypto Market Gains",
    "url": "https://www.coindesk.com/markets/2023/07/07/storj-filecoin-and-solana-lead-first-week-of-july-crypto-market-gains/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "STORJ, the native token of the crypto-backed, cloud storage platform, rose  15% on the week, far outdistancing bitcoin and ether, among other digital assets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-07T17:41:03.000Z",
    "title": "Three Arrows Capital Liquidator May Try to Claw Back About $1.2B From DCG, BlockFi",
    "url": "https://www.coindesk.com/business/2023/07/07/three-arrows-capital-liquidator-may-try-to-claw-back-about-12b-from-dcg-blockfi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A July 7 report from Teneo, the hedge fund’s liquidator, described the potential claims."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-07T17:49:09.000Z",
    "title": "Bitcoin BRC-20 Tokens Are Now Moving Over to Ethereum",
    "url": "https://decrypt.co/147662/bitcoin-brc-20-tokens-now-moving-over-ethereum",
    "description": "Leading Bitcoin BRC-20 tokens ORDI and OXBT are being bridged over to Ethereum as tradable NFTs on OpenSea and Blur."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-07T17:45:31.000Z",
    "title": "US Still 'Center of Gravity' for Crypto Industry, Says K33 Research",
    "url": "https://decrypt.co/147665/us-still-center-of-gravity-for-crypto-industry-says-k33-research",
    "description": "The U.S. accounts for 30% of the industry's headcount, even if regulatory enforcement will create “some pain in the short term.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T18:01:16.000Z",
    "title": "ETF approval may boost Bitcoin's liquidity, but it won't be a game changer — JPMorgan  ",
    "url": "https://cointelegraph.com/news/etf-approval-may-boost-bitcoin-liquidity-but-wont-be-game-changer-jp-morgan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/ef2829a4-a830-4b4c-99c1-af0528c7576e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to a JPMorgan report, spot Bitcoin ETFs have been available in Canada and Europe without drawing large investor interest.</p>\n                    <p><p>A possible approval of a spot Bitcoin exchange-traded fund (ETF) won't be a game changer for crypto markets, although it might benefit the leading cryptocurrency, according to a report by JPMorgan managing director Nikolaos Panigirtzoglou.</p><p>Based in London, Panigirtzoglou is part of JPMorgan's global market strategy team. He believes that a Bitcoin ETF in the United States would have a similar impact on markets to those seen in Canada in Europe, where spot Bitcoin ETFs have been around for some time.</p><p>According to the report <a href=\"https://www.bloomberg.com/news/articles/2023-07-07/jpmorgan-says-a-bitcoin-etf-wouldn-t-be-an-industry-game-changer\" target=\"_blank\" rel=\"noopener nofollow\">seen</a> by Bloomberg, Bitcoin ETFs have overall “attracted little investor interest” in other jurisdictions in the past two years, further “failing to benefit from investor outflows from gold ETFs.”</p><p>The strategist also sees benefits of a Bitcoin fund receiving green lights in America. According to Panigirtzoglou, an approval could bring more liquidity to Bitcoin markets, but could also lead to a migration of trading activity from BTC futures products. </p><p>Panigirtzoglou's view goes in a different direction from the high expectations that surround an approval of a Bitcoin ETF in the United States. During an interview on July 6, BlackRock's CEO, Larry Fink, <a href=\"https://cointelegraph.com/news/bitcoin-international-asset-black-rock-ceo-bullish-remarks\">suggested</a> that investors could turn to Bitcoin as a hedge against inflation and the devaluation of fiat currencies. </p><p>\"Let’s be clear: Bitcoin is an international asset,\" said Fink, adding that “It’s not based on any one currency, and so it can represent an asset that people can play as an alternative.” As reported by the Labor Department, the annual inflation rate for the United States was 4.0% for the 12 months ended May.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is an International Asset. - Larry Fink, BlackRock CEO <a href=\"https://t.co/WIVKITXYPj\">pic.twitter.com/WIVKITXYPj</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1676687611379826688?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>BlackRock's consistent success in filling ETFs has led to optimism that its try for a Bitcoin ETF might also succeed. <a href=\"https://www.bloomberg.com/news/articles/2023-07-06/blackrock-s-nearly-perfect-etf-track-record-spurs-hope-of-bitcoin-fund\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from Eric Balchunas and James Seyffart at Bloomberg Intelligence, only one of 550 funds filed by the company has been rejected to date. </p><p>BlackRock's application was followed by a wave of refilings with the Securities and Exchange Commission (SEC), with Investco, Fidelity, WisdomTree and Ark Invest among the proponents in line for regulatory approval. Several applications have been denied by the SEC in the past.</p><p><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Magazine: Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T17:40:01.000Z",
    "title": "Gemini sues Digital Currency Group and CEO Barry Silbert over Genesis Capital insolvency",
    "url": "https://cryptoslate.com/gemini-sues-dcg-barry-silbert-over-alleged-fraud-related-to-genesis/",
    "description": "<p>Cryptocurrency exchange Gemini, founded by the Winklevoss twins, has filed a civil lawsuit against Digital Currency Group (DCG) and its CEO Barry Silbert. The lawsuit is rooted in a dispute over the insolvency of Genesis Capital, a firm with which Gemini had a significant business partnership. Gemini co-founder Cameron Winklevoss announced the suit on social [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gemini-sues-dcg-barry-silbert-over-alleged-fraud-related-to-genesis/\">Gemini sues Digital Currency Group and CEO Barry Silbert over Genesis Capital insolvency</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T17:59:37.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T17:56:34.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s live Aave price is $73.23, with a 24-hour trading volume of $81,377,982. Aave is up 1.60% in the last 24 hours. The current CoinMarketCap ranking is #40, with a live market cap of $1,059,548,508. It has a circulating supply of 14,468,117 AAVE coins and ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T17:56:11.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T17:52:55.000Z",
    "title": "Crypto miners caught red-handed in electricity theft scandal in Malaysia",
    "url": "https://www.cryptopolitan.com/crypto-miners-caught-in-electricity-theft/",
    "description": "In Malaysia, the realm of crypto mining has taken an audacious turn as a group of determined miners embarks on a relentless pursuit of remarkably inexpensive energy, bordering on being free. However, caught in the crosshairs of this unconventional quest is Sarawak Energy, a prominent state-owned electric company, which has now set its sights on ... <a title=\"Crypto miners caught red-handed in electricity theft scandal in Malaysia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-miners-caught-in-electricity-theft/\" aria-label=\"More on Crypto miners caught red-handed in electricity theft scandal in Malaysia\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T17:45:31.000Z",
    "title": "Bitcoin’s privacy tag isn’t its strongest suit – Why?",
    "url": "https://www.cryptopolitan.com/bitcoins-privacy-tag-isnt-its-strongest-suit/",
    "description": "Unraveling the fascinating world of Bitcoin, privacy remains an important point of discourse. However, contrary to popular belief, privacy may not be Bitcoin&#8217;s most vital attribute. This assertion is no mere speculation but echoes the viewpoint of Johnny Lyu, the CEO of the cryptocurrency exchange, KuCoin. As we traverse this intricate labyrinth of cryptography, it&#8217;s ... <a title=\"Bitcoin&#8217;s privacy tag isn&#8217;t its strongest suit &#8211; Why?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoins-privacy-tag-isnt-its-strongest-suit/\" aria-label=\"More on Bitcoin&#8217;s privacy tag isn&#8217;t its strongest suit &#8211; Why?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T18:00:00.000Z",
    "title": "Compound soars 50%, 3 reasons this meme coin will follow suit",
    "url": "https://crypto.news/compound-soars-50-3-reasons-this-meme-coin-will-follow-suit/",
    "description": "In this article, we will explore DigiToads, a meme coin project, and the three factors why TOADS could extend gains in H2 2023, possibly following COMP "
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T17:40:14.000Z",
    "title": "Senators Lummis and Gillibrand set to present crypto bill in Congress, again",
    "url": "https://crypto.news/senators-lummis-and-gillibrand-set-to-present-crypto-bill-in-congress-again/",
    "description": "Senators Cynthia Lummis and Kirsten Gillibrand are reviving their proposed Responsible Financial Innovation Act to address ongoing discussions on cryptocurrency regulations. After much anticipation, Sens. Cynthia Lummis (R-Wyo.) and Kirsten Gillibrand (D-N.Y.) are set to revisit their cryptocurrency law, the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T18:00:46.000Z",
    "title": "Cardano Foundation Collaborates With Epoch Sports And Merchandise For Lacrosse Championship 2023",
    "url": "https://www.newsbtc.com/news/cardano/cardano-foundation-collaborates-with-epoch-sports-and-merchandise-for-lacrosse-championship-2023/",
    "description": "The Cardano Foundation has recently announced a technical partnership with Epoch Sports and Merchandise. Epoch Sports is a prominent US-based sports brand, and Merchandise, a comprehensive full-stack apparel ecosystem. This alliance aims to introduce a limited edition jersey that will be authenticated using blockchain technology. Related Reading: Bitcoin Short-Term Holders Continue Exchange Inflows, But Price Holds On During the 2023 World Lacrosse Men&#8217;s Championship, 6000 Limited Edition Commemorative Jerseys had already been distributed. The limited run of commemorative lacrosse jerseys showcases a near-field communication (NFC) Epoch branded patch. This patch includes a digital jersey version embedded as a non-fungible token (NFT). By leveraging this technology, the physical garment becomes intrinsically connected to a secure blockchain, providing proof of the jersey&#8217;s authenticity. Epoch Sports and Merchandise have outlined their plans to release the remaining NFC-enabled Commemorative Jerseys, accompanied by connected NFTs, on the official web store of the 2023 World Lacrosse Championship. The NFC patches incorporated into the jerseys serve a dual purpose. They also grant the consumers access to a range of exclusive rewards and special offers. Cardano&#8217;s Collaboration Aims To Enhance IP Protection And Tackle Counterfeiting The technical collaboration between the Cardano Foundation, Epoch Sports, and Merchandise aims to promote blockchain adoption within the licensed merchandise industry while bolstering the protection of licensed intellectual property (IP). By securely linking NFC chips to a blockchain record in the form of non-fungible tokens (NFTs), traditional licensed IP hologram tags on sports apparel will be replaced. According to the press release, this guarantees authenticity for purchasers and empowers license owners to combat counterfeiting effectively. For real-time visualization of all on-chain records on the Cardano blockchain, Pool.pm serves as a reference tool. Pool.pm provides an overview of the blockchain, allowing users to access the on-chain records. Frederik Gregaard, the CEO of the Cardano Foundation, said: Our work with Merchandise and Epoch Sports showcases the utility and accessibility of Cardano’s blockchain: any merchant can adopt blockchain solutions to give reassurance and confidence to customers that they are buying genuine articles. Diversifying blockchain adoption is a core part of the Cardano Foundation mission, and it’s fantastic to see more and more companies putting blockchain solutions into practice. Merchandise&#8217;s CEO, Alex Phelan, expressed enthusiasm about collaborating with the Cardano Foundation, highlighting it as a milestone in the licensed apparel industry. He emphasized that the partnership sets new intellectual property protection benchmarks and fosters fan engagement. Related Reading: Compound (COMP) Token Rallies Over 100% After CEO Quits – Details James Micelli, Principal of Epoch Sports, acknowledged the immense potential of blockchain deployment in empowering consumers. James Micelli, Principal of Epoch Sports, acknowledged the immense potential of blockchain deployment in empowering consumers. Featured image from Cardano Feed, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-07T18:05:09.000Z",
    "title": "US-Based Crypto Exchange Gemini Sues Genesis Parent Company DCG Over Gemini Earn Dispute",
    "url": "https://dailyhodl.com/2023/07/07/us-based-crypto-exchange-gemini-sues-genesis-parent-company-dcg-over-gemini-earn-dispute/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Cameron-Winklevoss-Says-Gemini-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto exchange Gemini is suing the parent company of bankrupt crypto broker Genesis over the Gemini Earn program, claiming that top executives of the lender mislead creditors. According to a new report from Reuters, the US-based exchange is suing Digital Currency Group (DCG). Additionally, in a lengthy thread, Gemini co-founder Cameron Winklevoss says that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/07/us-based-crypto-exchange-gemini-sues-genesis-parent-company-dcg-over-gemini-earn-dispute/\">US-Based Crypto Exchange Gemini Sues Genesis Parent Company DCG Over Gemini Earn Dispute</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]