[
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T03:31:32.000Z",
    "title": " BlackRock and Fidelity Bitcoin ETFs reach top 10 in January flows ",
    "url": "https://cointelegraph.com/news/blackrock-fidelity-bitcoin-etfs-top-10-for-january-flows-morningstar",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMmM2YjRmNmUtMjQ2MC00N2FhLTlkZDItNWNmMTk3YjEzNDBkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BlackRock’s iShares Bitcoin Trust and the Fidelity Wise Origin Bitcoin ETF landed eighth and tenth place among all ETFs in January by largest flows.</p>\n                    <p><p>BlackRock and Fidelity’s spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) have made it among ETFs with the largest January flows, totaling around $4.8 million.</p><p>BlackRock’s iShares Bitcoin Trust (IBIT)  had an estimated $2.6 billion in net flows, reaching eight place, while the Fidelity Wise Origin Bitcoin ETF (FBTC) landed tenth place with $2.2 billion in net flows, per a Feb. 3 <a href=\"https://www.morningstar.com/etfs/etf-flows-investors-curb-their-enthusiasm-january\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Morningstar research analyst Lan Anh Tran using data approximated from the issuers' websites. </p><p>The data also showed the Grayscale Bitcoin Trust (GBTC) had the second highest outflows among ETFs in January, with $5.7 billion estimated to have net exited the fund over the month.</p><p><a href=\"https://cointelegraph.com/news/blackrock-fidelity-bitcoin-etfs-top-10-for-january-flows-morningstar\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T03:23:09.000Z",
    "title": "EU’s AI Act Receives Unanimous Approval, Sets Global Precedent",
    "url": "https://www.cryptopolitan.com/eus-ai-act-receives-unanimous-approval/",
    "description": "In a landmark decision, EU Member States have voted unanimously to approve the AI Act, a significant move that sets the stage for comprehensive regulation of artificial intelligence technologies within the European Union. This decision, following two years of negotiations, underscores the EU&#8217;s commitment to ensuring the safe and responsible development and use of AI [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T03:24:36.000Z",
    "title": "Bitcoin Price Stuck In Range, Can BTC Bulls Save The Day?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-stuck-range-42250/",
    "description": "Bitcoin price struggled to continue higher above the $43,800 resistance. BTC is moving lower and might decline heavily if it breaks the $41,800 support. Bitcoin price is declining from the $43,800 resistance zone. The price is trading below $42,800 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $42,850 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to decline if there is a clear move below the $41,800 support. Bitcoin Price Takes Hit Bitcoin price made another attempt to gain pace above the $43,000 and $43,200 resistance levels. However, BTC struggled to extend its gains and recently started another decline below $42,800. There was a move below the $42,500 support. A low is formed near $42,232 and the price is now consolidating losses. There is also a key bearish trend line forming with resistance near $42,850 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $42,800 and the 100 hourly Simple moving average. Immediate resistance is near the $42,750 level. It is near the 50% Fib retracement level of the downward wave from the $43,250 swing high to the $42,232 low. The next key resistance could be $42,850 and the trend line. The trend line is close to the 61.8% Fib retracement level of the downward wave from the $43,250 swing high to the $42,232 low, above which the price could start a decent increase. Source: BTCUSD on TradingView.com The next stop for the bulls may perhaps be $43,250. A clear move above the $43,250 resistance could send the price toward the $43,800 resistance. The next resistance is now forming near the $44,200 level. A close above the $44,200 level could push the price further higher. The next major resistance sits at $45,000. More Losses In BTC? If Bitcoin fails to rise above the $42,850 resistance zone, it could start another decline. Immediate support on the downside is near the $42,250 level. The first major support is $41,800. If there is a close below $41,800, the price could gain bearish momentum. In the stated case, the price could dive toward the $40,500 support. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $42,250, followed by $41,800. Major Resistance Levels – $42,750, $42,850, and $43,250."
  }
]