[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T12:26:56.000Z",
    "title": "Unlocking Freeman’s Lost Treasure Investigation",
    "url": "https://www.cryptopolitan.com/unlocking-freemans-lost-treasure/",
    "description": "Pirates lurking in the Sainte-Anne starting area hold the key to unlocking one of Skull and Bones&#8217; most compelling mysteries: Freeman’s Lost Treasure. Players can glean invaluable information from these seafaring rogues by greasing their palms with a modest sum of Silver. Identified on the map with a distinct purple icon labeled as &#8220;Rumor,&#8221; these [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T12:16:53.000Z",
    "title": "Judge grants Gemini’s monetization plan for initial earned collateral",
    "url": "https://www.cryptopolitan.com/judge-grants-geminis-monetization-plan/",
    "description": "In a recent development, Gemini Trust Co. has obtained approval from Judge Sean Lane of the Southern District of New York to proceed with the monetization of Initial Collateral held for the benefit of Earn users.&#160; The approval signifies a significant step forward in resolving the aftermath of the halt of Gemini&#8217;s Earn program during [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T12:11:14.000Z",
    "title": "Light-Based Computing Chips Make AI Tasks Easy",
    "url": "https://www.cryptopolitan.com/light-based-chips-make-ai-tasks-easy/",
    "description": "Discover how a groundbreaking chip developed by Penn Engineers, utilizes light for AI computations.\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-18T12:33:00.000Z",
    "title": "Spot Bitcoin ETFs are here. What’s next? Regulating defi? | Opinion",
    "url": "https://crypto.news/spot-bitcoin-etfs-are-here-whats-next-regulating-defi-opinion/",
    "description": "There is the increased regulatory scrutiny that we can expect defi to face going forward, thanks to the sector’s close connection with the crypto industry."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-18T12:30:00.000Z",
    "title": "Solana and Avalanche lead gains, but MATIC and this new meme coin may surpass",
    "url": "https://crypto.news/solana-and-avalanche-lead-gains-but-matic-and-this-new-meme-coin-may-surpass/",
    "description": "Solana and Avalanche lead gains, but Polygon eyes growth. Watch Galaxy Fox, the new crypto pick for potential explosive returns. Solana (SOL) and Avalanche (AVAX) have proven themselves top performers, showing resilience and innovation in their ecosystems. Meanwhile, Polygon (MATIC)&#8230;"
  }
]