[
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T04:11:52.000Z",
    "title": "Mark Zuckerberg's jiu-jitsu or Elon Musk's street-fight 'walrus' — Who will win?",
    "url": "https://cointelegraph.com/news/mark-zuckerberg-vs-elon-musk-who-will-win",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6c2f9e83-b142-485b-8942-7ad5c02d7af4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While Musk has a bigger frame and height advantage at 6’1, Zuckerberg has now been training in Brazilian Jiu-Jitsu for nine months.</p>\n                    <p><p>Meta founder and CEO Mark Zuckerberg has emerged as a clear favorite among betters in a proposed “cage match” with Twitter owner and Tesla CEO Elon Musk. </p><p>In the 48 hours since the Mixed Martial Arts (MMA) challenge was issued by Musk, sports betting firms and odds providers have already delivered preliminary odds for the billionaire's bout.</p><p>If the fight actually eventuates, the Brazilian Jiu-Jitsu-trained Zuckerberg has been marked with a 77% chance of winning the fight, <a href=\"https://oddspedia.com/novelty/world-novelty/celebrity-fight-elon-musk-vs-mark-zuckerberg\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Oddspedia, a sports betting platform that collates odds from several bookmakers.</p><p>Betting a dollar on Zuckerberg would potentially pay out $1.20 if he wins the fight, a bet on Musk could pay up to $4.00 if he wins. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e398a2e9-2ef6-40d6-9bda-de0bdc22b90f.jpg\"  /><figcaption style=\"text-align: center;\"><em>Mark Zuckerberg is heavily favored to beat Elon Musk in a potential bout. Source: Oddspedia.</em></figcaption></figure><p>Zuckerberg, who stands at a slight height disadvantage at 5 feet, 7 inches (170 cm), has been a known BJJ practitioner since September 2022. In May, he managed to place first and second in two BJJ tournaments in a white belt lightweight division.</p><p>His progress even prompted positive <a href=\"https://www.essentiallysports.com/ufc-mma-news-as-dana-white-mcgregor-and-adesanya-praise-mark-zuckerberg-bjj-goat-gordon-ryan-rips-lazy-fs-for-making-excuses/\" target=\"_blank\" rel=\"noopener nofollow\">reactions</a> from some of the most influential figures in the Ultimate Fighting Championship, such as UFC boss Dana White and former UFC featherweight and lightweight champion Conor McGregor.</p><p>Online, several videos of Zuckerberg in training can be found.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Mark Zuckerberg training with BJJ world champion Mikey Musumeci <a href=\"https://t.co/plE3CUpoP7\">pic.twitter.com/plE3CUpoP7</a></p>&mdash; Bloody Elbow (@BloodyElbow) <a href=\"https://twitter.com/BloodyElbow/status/1670209896451588097?ref_src=twsrc%5Etfw\">June 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Musk, on the other hand, is understood to have a bigger frame and height advantage and <a href=\"https://www.hoodmwr.com/elon-musk-height/\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> stands at 6 feet, 1 inch (185 cm). Not much else can be gleaned about his physical aptitude for combat, however, Musk recently <a href=\"https://www.youtube.com/watch?v=fXS_gkWAIs0\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that he used to engage in “real hard-core street fights” in South Africa where he grew up.</p><p>He also recently <a href=\"https://twitter.com/elonmusk/status/1640783261713702914\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> that he eats a donut every morning and is “still alive,” if that makes a difference.</p><p>“I have this great move that I call “The Walrus”, where I just lie on top of my opponent &amp; do nothing,” Musk jokingly <a href=\"https://twitter.com/elonmusk/status/1671705216918474752\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a June 22 tweet.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yup, that’s me </p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1671706440887672832?ref_src=twsrc%5Etfw\">June 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://twitter.com/elonmusk/status/1671364992665264131\" target=\"_blank\" rel=\"noopener nofollow\">Talks</a> of a potential physical fight between Musk and Zuckerberg first came about on June 21, when Musk said he’d be willing to share the cage with the Meta founder.</p><p>Zuckerberg responded on Instagram shortly after with “Send me location” — a popular phrase first uttered by former UFC lightweight champion Khabib Nurmagomedov.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6b65d0f7-14ba-489d-a327-8c058f0aea52.png\"  /><figcaption style=\"text-align: center;\"><em>Zuckerberg’s response on Instagram to Musk’s Tweet. Source: The Verge</em></figcaption></figure><p>Despite the high anticipation, many don’t expect the fight to actually happen. If it doesn't go ahead, it's not the first time that Musk and Zuckerberg have clashed. </p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/memecoin-ai-twitter-bot-suspended-after-elon-musk-claims-scam\"><strong>Twitter suspends memecoin-linked AI bot after Elon Musk’s ‘scam crypto’ claim</strong></a></p><p>In 2017, the billionaires engaged in a heated debate over <a href=\"https://cointelegraph.com/press-releases/artificial-intelligence-and-the-crypto-sphere-the-evolution-of-financial-technology\">artificial intelligence</a> and its future implications. </p><p>Sharing a more optimistic view, Zuckerberg <a href=\"https://www.bizjournals.com/sanjose/news/2017/07/24/elon-musk-artificial-intelligence-risk-zuckerberg.html\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> called out those who believe AI has the potential to create “doomsday scenarios” — events that could result in human extinction or completely end life on Earth.</p><p>Musk hit back, <a href=\"https://twitter.com/elonmusk/status/889743782387761152\" target=\"_blank\" rel=\"noopener nofollow\">stating:</a></p><blockquote>“I’ve talked to Mark about this. His understanding of the subject is pretty limited.” </blockquote><p><strong><em>NFT Creator: <a href=\"https://cointelegraph.com/magazine/coldie-snoop-dogg-piece-vitalik-buterin-john-mcafee/\">‘Holy shit, I’ve seen that!’ — Coldie’s Snoop Dogg, Vitalik and McAfee NFTs</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-23T04:29:00.000Z",
    "title": "Bitcoin Could Rally More After 20% Surge, Says Popular Crypto Trader",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-could-rally-more-after-20-surge-says-popular-crypto-trader/",
    "description": "Influential cryptocurrency trader Pentoshi has recently shared a rather optimistic view on the prospects of the flagship cryptocurrency Bitcoin ($BTC), suggesting the cryptocurrency could still rise further to $32,500, a figure last seen in May of 2022, after moving up over 20% in the past week. The cryptocurrency analyst, who communicates his insights to an […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T04:11:18.000Z",
    "title": "SOL Price Prediction: Solana Bulls Aim $20 or Higher",
    "url": "https://www.newsbtc.com/analysis/sol-price-prediction-solana-bulls-20/",
    "description": "Solana is recovering above the $16 resistance against the US Dollar. SOL price might rise steadily toward the $20 resistance if Bitcoin climbs above $30,800. SOL price is showing positive signs above the $16 level against the US Dollar. The price is now trading above $15 and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support near $16.05 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could continue to move up unless there is a close below $14.40. Solana Price Recovers 10% In the past few days, Solana’s price started a fresh increase from the $13.00 support zone. Recently, Bitcoin and Ethereum saw a steady increase, sparking positive moves in Solana and Cardano. The bulls were able to push SOL above the $14.40 resistance zone. There was a close above the $16.00 resistance. However, the price faced resistance near $17.75, and the 50% Fib retracement level of the key decline from the $22.31 swing high to the $13.00 low. SOL is now trading above $15 and the 100 simple moving average (4 hours). There is also a major bullish trend line forming with support near $16.05 on the 4-hour chart of the SOL/USD pair. On the upside, immediate resistance is near the $17.75 level. A clear move above the $17.75 resistance might send the price toward the $20 resistance. It is close to the 76.4% Fib retracement level of the key decline from the $22.31 swing high to the $13.00 low. Source: SOLUSD on TradingView.com A close above the $20 level could resend the price toward the $21.20 resistance zone. Any more gains might send the price toward the $22.40 level. Fresh Decline in SOL? If SOL fails to clear the $17.75 resistance, it could start a fresh decline. Initial support on the downside is near the $16.00 level and the trend line. The first major support is near the $14.40 level, below which the bears might gain strength. In the stated case, the price may perhaps decline toward the $13.00 support. The next major support is near the $12.20 level. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $16.00, and $14.40. Major Resistance Levels – $17.75, $20.00, and $21.20."
  }
]