[
  {
    "source": "CoinDesk",
    "date": "2023-08-17T12:54:01.000Z",
    "title": "Tether Stops Support for Bitcoin Layer Omni Citing Lack of Demand",
    "url": "https://www.coindesk.com/business/2023/08/17/tether-stops-support-for-bitcoin-layer-omni-citing-lack-of-demand/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Stablecoin issuer Tether has announced that it will discontinue support for Omni, a Bitcoin layer that has been used for USDT transfers since 2014."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-17T12:59:54.000Z",
    "title": "Canadian Expansion Part of ‘2-Pronged International Strategy’, Says Coinbase Exec",
    "url": "https://decrypt.co/152792/canadian-expansion-part-2-pronged-international-strategy-says-coinbase-exec",
    "description": "Unlike the crackdown the exchange is facing in the U.S., a Coinbase exec said authorities in Canada offer “regulation by engagement.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T12:49:39.000Z",
    "title": "Donate to Ukraine! Children of Heroes crypto charity campaign goes live",
    "url": "https://cointelegraph.com/news/donate-ukraine-children-of-heroes-crypto-charity-campaign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8d469b3f-6f35-4d6e-abfa-26855ae6d41f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>During the three-month campaign, Cointelegraph will help raise funds to assist children who lost parents to the war in Ukraine. </p>\n                    <p><p>Cointelegraph has announced it is collaborating with the charity fund Children of Heroes to raise money to support children in Ukraine who have lost parents to the devastating Russian invasion. The <a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">cryptocurrency fundraiser</a> is now open to receiving donations from all around the globe.</p><p>Through the campaign, the crypto community will be able to support programs helping Ukrainian children by donating Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>), Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) and other popular digital assets. The campaign’s initiative is to provide long-term support to over 5,900 beneficiaries, who will remain under the care of the fund until they reach adulthood. Children of Heroes’ goal is to help over 10,000 Ukrainian children by the end of 2023, with up to 50 being onboarded daily.</p><p>Children of Heroes is a foundation registered as a public charity in the U.S. state of Delaware, meaning all donations are tax-deductible. To donate, simply click on the “Donate” button and follow the instructions below.</p><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">Donate to help children affected by the war</a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a761a186-0fd1-4a9d-b844-bebe4bbfb300.jpg\"  /></figure><p>Dan Pasko, Children of Heroes’ co-founder and a member of its board of directors, joined with several like-minded Ukrainian businesspeople and parents to form an organization to take care of children orphaned by the war. The organization employs 127 staff, who aim to provide access to comprehensive, long-term support in all areas of the children’s lives, fostering healing, growth and transformation. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/71fc025a-6749-46b6-9871-e2a891a5ead5.png\"  /></figure><p>The campaign focuses on funding initiatives to support the children under the care of the fund. The children receive personalized aid from their “Family Helpers,” who provide each and every family and child with one-on-one support and ensure they receive help suited to their unique needs. </p><p>Six core programs make up the fund: emergency aid, essential support, education and development, healthcare, socialization, and mentorship and career planning.</p><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">DONATE to children of heroes NOW!</a></p><p>The campaign leverages the platforms Fundraise Up and Stripe to process donations and secure data. Fundraise Up functions as the payment processing platform, sending payments directly to a Coinbase wallet, while all the data is sent directly to Stripe’s PCI-compliant servers through SSL. Stripe will not be used to process crypto payments.</p><p>Both Children of Heroes and Cointelegraph believe that with the power of the crypto community, the children who receive support will have a fighting chance to overcome the challenges brought by the horrors of the war. Those who want to participate in the campaign can <a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">click this link to donate crypto</a> and help provide a better future for Ukrainian children.</p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-17T13:05:00.000Z",
    "title": "PayPal’s PYUSD Stablecoin to be Integrated in Bybit’s Spot Trading",
    "url": "https://cryptobriefing.com/paypals-pyusd-integrated-in-bybits-spot-trading/?utm_source=feed&utm_medium=rss",
    "description": "The introduction of PYUSD into Bybits Spot trading platform signifies the exchange's responsive approach to market demand."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T13:00:08.000Z",
    "title": "Validation Cloud Platform Integrates Hedera Mainnet and Testnet, Bringing Mirror Node-as-a-Service and JSON RPC Relay Services to Hedera Developers",
    "url": "https://cryptodaily.co.uk/2023/08/validation-cloud-platform-integrates-hedera-mainnet-and-testnet-bringing-mirror-node-as-a-service-and-json-rpc-relay-services-to-hedera-developers",
    "description": "<p>Zug, Switzerland, August 17th, 2023, Chainwire</p><p>Validation Cloud, a Web3 infrastructure company that offers node, staking, and data-as-a-service, announced that as of today, users can connect to its Mirror Node-as-a-service and JSON RPC relay to seamlessly read from and write to the Hedera network.</p><p>Validation Cloud is the most performant RPC node provider globally, making Mirror node and JSON RPC node connectivity to Hedera faster and more reliable than ever. Validation Cloud has integrated the Hedera testnet and mainnet into its platform to allow users to connect to the Hedera network effortlessly. Users can connect to the Hedera network in tens of milliseconds from anywhere in the world with guaranteed reliability.&nbsp;</p>\"Validation Cloud is well known in the industry for delivering fast, scalable, and intelligent Web3 infrastructure for more seamless and efficient connectivity to blockchain networks,&rdquo; said Viv Diwaker, CIO at the HBAR Foundation. &ldquo;They have consistently ranked #1 on CompareNodes as the fastest global node infrastructure provider in the world. We are thrilled that they are bringing their industry recognized scalability, resilience, and compliance commitment to the new Mirror Node-as-a-service and JSON RPC relay that they are offering on Hedera.&rdquo;&ldquo;With Validation Cloud&rsquo;s platform, users will now be able to easily connect to the Hedera network through the Mirror Node-as-a-service and JSON RPC Relay. Our technology stack was purpose-built for the needs of commercial applications, with global low-latency, high throughput, and compliance in mind. We&rsquo;re excited to see the innovative applications Hedera users will build with this enhanced connectivity to the network,&rdquo; said Andrew McFarlane, Validation Cloud CTO.<p>To build innovative Web3-enabled applications, organizations first need fast and reliable connectivity to networks. Validation Cloud&rsquo;s platform offers the critical infrastructure necessary to build exciting applications in DeFi, GameFi, NFTs, and more. It is a key enabler for the Web3 ecosystem, facilitating the development and deployment of various applications that can be scaled up to be used by billions of users.&nbsp;</p><p>Users can connect to Hedera today at validationcloud.io. Validation Cloud offers up to 50 million Compute Units (CUs) per month on the Free Tier, allowing users to explore and build applications. For limitless scalability, users can upgrade to the Scale Plan for unlimited CUs, zero rate limits, and a global delivery network.&nbsp;&nbsp;</p><p>About Validation Cloud</p><p>Validation Cloud is a Web3 data streaming and infrastructure company that connects organizations into Web3 through a fast, scalable, and intelligent platform. Headquartered in Zug, Switzerland, Validation Cloud offers highly performant and customizable products in staking, node, and data-as-a-service. Learn more at validationcloud.io| LinkedIn | X | Medium&nbsp;</p><p>Media Contact: Kelly Clark, Director of Communications | press@validationcloud.io&nbsp;</p><p>About The HBAR Foundation</p><p>The HBAR Foundation supports the creation of Web3 communities built on the Hedera network, by empowering and funding the builders developing these communities. The Foundation&rsquo;s six funds - focused on the Crypto Economy, Metaverse, Sustainability, Fintech, Privacy, and Female Founders - each support communities within those areas, and the interconnectedness enables applications to participate as part of a larger ecosystem.</p><p>The collective power of these funds enables entrepreneurs, developers, and enterprises of all sizes to tackle some of the world&rsquo;s largest problems, and create and control their own economies, all built on the Hedera public network. Whether you&rsquo;re building something new or migrating an existing EVM-based application and community, the HBAR Foundation is here to support you. For additional information, please visit https://hbarfoundation.org.</p>ContactDirector of CommunicationsKelly ClarkValidation Cloudpress@validationcloud.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T13:00:00.000Z",
    "title": "Polygon Labs Partners With Korean Mobile Giant",
    "url": "https://cryptodaily.co.uk/2023/08/polygon-labs-partners-with-korean-mobile-giant",
    "description": "<p>Polygon Labs has partnered with Korean telecommunications company SK Telecom to develop a complete Web3 ecosystem.</p>\nEnhancing Web3 Ecosystem with Polygon Integration\n<p>International software development company Polygon Labs has announced a strategic collaboration with Korean mobile giant SK Telecom (SKT) to develop a robust Web3 ecosystem. The agreement signing ceremony took place at SKT's headquarters in Seoul, with Oh Se-hyun, Vice President and Head of Web3 CO of SKT, and Polygon Labs' CEO Marc Boiron in attendance.</p>\n<p>Under the partnership, SKT will integrate support for the Polygon blockchain into its NFT marketplace TopPort and upcoming Web3 wallet.&nbsp;</p>\nPolygon&rsquo;s Web3 Advancement\n<p>The partnership between Polygon Labs and SKT will enable users to avail of faster and more cost-efficient transactions while leveraging the security and decentralization of Ethereum.</p>\n<p>Polygon Labs CEO Marc Boiron emphasized the significance of this collaboration, saying,&nbsp;</p>\n\n<p>\"Polygon Labs has been developing optimal blockchain technology for Web3 popularization, and we see this collaboration with SKT as an important step in providing Web3 experiences to more consumers.\"</p>\n\n<p>The Polygon Labs team had previously revealed its plans to establish multiple layer-2 networks on the Polygon blockchain as an integral component of their Polygon 2.0 roadmap.&nbsp;</p>\nTopPort and Web3 Wallet Integration\n<p>SKT had launched its NFT marketplace, TopPort, in 2022. The new partnership will also come in handy for the marketplace, as it will expand its capabilities. Creators would be able to mint Polygon-based NFTs on TopPort, making it compatible and scalable with other NFT platforms on the Polygon ecosystem.&nbsp;</p>\n<p>SK Telecom is also scheduled to drop its Web3 wallet in the second half of 2023. The partnership with Polygon Labs will integrate the latter&rsquo;s excellent network support and NFT trading facilities into the wallet for a seamless adoption of Web3 technologies by SKT users.&nbsp;</p>\nFostering Web3 Startups and Ecosystem Growth\n<p>The collaboration extends beyond technical integration. Both companies will work together to identify promising Web3 startups and provide incubation support. Polygon Labs plans to explore potential investments in Web3 startups recommended by SKT through its subsidiary, Polygon Ventures.</p>\n<p>Furthermore, the partnership aims to facilitate the entry of competitive Web3 startups into the global market and introduce leading decentralized apps (dApps) from around the world into the Korean market.</p>\n<p>Oh Se-hyun, Vice President and Head of Web3 CO at SKT highlighted the potential of the collaboration, saying,&nbsp;</p>\n\n<p>\"By combining our experience in blockchain services and Polygon Lab's blockchain infrastructure and ecosystem, we will be able to create valuable business opportunities and boost the Web3 ecosystem.\"</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T13:06:13.000Z",
    "title": "Bitcoin supply last active over 10 years ago hits all-time high",
    "url": "https://crypto.news/bitcoin-supply-last-active-over-10-years-ago-hits-all-time-high/",
    "description": "Glassnode reports a record 2.9 million BTC, valued at $82.5 billion, untouched for ten years. It underscores long-term holders&#8217; faith amidst market fluctuations. Glassnode data shows that the amount of Bitcoin that has not been moved for at least ten&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T12:41:37.000Z",
    "title": "Tom Lee expects Bitcoin at $150k with spot ETF approvals",
    "url": "https://crypto.news/tom-lee-expects-bitcoin-at-150k-with-spot-etf-approvals/",
    "description": "Tom Lee of Fundstrat foresees a potential surge in Bitcoin&#8217;s value, particularly if the US approves spot Bitcoin ETFs, hinting at prices exceeding $150,000. In a recent CNBC interview, Tom Lee, co-founder of Fundstrat Global Advisors, predicted a potential surge&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T13:06:38.000Z",
    "title": "Ripple (XRP) Rival Stellar Shines with Open-Source Disbursement Platform Release – Can it Drive XLM Price to $0.20? Report",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-rival-stellar-shines-with-open-source-disbursement-platform-release-can-it-drive-xlm-price-to-0-20-report/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-rival-stellar-shines-with-open-source-disbursement-platform-release-can-it-drive-xlm-price-to-0-20-report",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The Stellar Lumens project has celebrated the launch of its open-source disbursement platform. The platform will make faster, cheaper, and transparent digital disbursements available to anyone in the world. The Stellar Lumens network has this week confirmed the launch of its open-source disbursement platform. The platform, which can be accessed from anywhere in the world, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T13:00:14.000Z",
    "title": "Most Profitable Crypto 2023: Pepe (PEPE), Bitcoin Cash (BCH), Everlodge (ELDG)",
    "url": "https://www.crypto-news-flash.com/most-profitable-crypto-2023-pepe-pepe-bitcoin-cash-bch-everlodge-eldg/?utm_source=rss&utm_medium=rss&utm_campaign=most-profitable-crypto-2023-pepe-pepe-bitcoin-cash-bch-everlodge-eldg",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-61.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-61.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-61-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With many cryptocurrencies down in July, investors are diversifying their portfolios. As part of this process, investors are choosing Everlodge, Pepe, and Bitcoin Cash. Although Pepe and Bitcoin Cash have decreased, experts believe they will surge over the next few weeks. Meanwhile, the excitement around Everlodge is building as investors eagerly await the project&#8217;s presale [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-17T12:56:45.000Z",
    "title": "Floki Inu Offers More Use Cases Through Multiple Integrations",
    "url": "https://coinedition.com/floki-inu-offers-more-use-cases-through-multiple-integrations/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/The_integration_of_FLOKI_extends_to_various_chains_most_notably-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Floki Inu developers are integrating the FLOKI meme coin to various chains, including the BNB chain. A representative of the team on Twitter recognized the BNB chain as its most notable integration. He stated that the BNB chain boasts over 400,000 holders. The social network representative observed Floki could offer more use cases to its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/floki-inu-offers-more-use-cases-through-multiple-integrations/\">Floki Inu Offers More Use Cases Through Multiple Integrations</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]