[
  {
    "source": "Decrypt",
    "date": "2023-07-13T21:27:53.000Z",
    "title": "Actors Approve Strike as AI Fears Bring Hollywood to a Standstill",
    "url": "https://decrypt.co/148519/actors-approve-strike-ai-fears-bring-hollywood-standstill",
    "description": "SAG-AFTRA will officially strike at midnight, joining striking writers with demands over AI, compensation, and more."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T21:19:50.000Z",
    "title": "CleanSpark’s Bitcoin mining capacity hits 8 EH/s as new facility goes live",
    "url": "https://cointelegraph.com/news/cleanspark-s-bitcoin-mining-capacity-hits-8-eh-s-as-new-facility-goes-live",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/00434d66-e902-4abc-b9b7-e0e708f507a9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bitcoin mining company kicked off the second phase of its mining campus in Georgia, gearing up for the next Bitcoin halving. </p>\n                    <p><p>Bitcoin miner ClearSpark has begun the second phase of operations at its mining campus in Washington, in the U.S. state of Georgia, reaching 8.0 exahashes per second (EH/s), halfway to its year-end target of 16.EH/s. </p><p>The second phase saw an investment of nearly $55 million in the site, including construction, infrastructure and machines. The facility, bought in August 2022 for $25.1 million, had 15,000 mining machines with a power capacity of 50 megawatts (MW). According to the company, the capital deployed expands its total power capacity to 86 MW. </p><p>\"Today, it's 50MW of new power added on to the 36MW we previously had constructed there. So, there's 86MW or 12 times the load provided by the city,\" said Matthew Schultz, CleanSpark's executive chairman, during an investors' conference on July 13. </p><p>According to Schultz, the city of Washington has seen its annual budget almost double year-over-year as a result of the company's collaboration with city officials and the community. \"The city becomes our utility and rather than compete with ratepayers for power, we agreed to buy power from the city at a cost plus level,\" he explained, adding that the town had last year an annual budget of about $16 million. \"Their annual city budget this year is over $30 million.\" </p><p>ClearSpark has pushed an aggressive expansion plan despite the current bear market. Last month, it<a href=\"https://cointelegraph.com/news/cleanspark-buys-two-bitcoin-mining-campuses-georgia\"> purchased Bitcoin mining facilities in Dalton</a>, also in Georgia. The campus will house 6,000 Antminer S19 XPs and S19J Pro+s, which are expected to add about 1 EH/s to its hash rate. \"Georgia has been a terrific opportunity for us because it's predominantly nuclear power and Georgia is a net exporter of power,\" said the chairman. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/db023c7a-ec77-4a84-bac5-389ec046a781.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>CleanSpark's hash rate evolution in 2022. Source: Hasrate Index. </em></figcaption></figure><p>The company has also invested over $150 million in building its computer power infrastructure in the past months. According to Schultz, the strategy was initially drafted in November 2021, when a number of Bitcoin mining companies \"made billion dollar orders of mining machines.\" </p><p>\"Zach [Bradford], Gary [Vecchiarelli] and myself sat back, and kind of realized that with that much new equipment being added to the Bitcoin blockchain, as well as analyzing some future energy models, it was likely that Bitcoin was going to pull back from that $60,000 range,\" the executive noticed during the investors call. </p><p>Rather than investing capital in high-value rigs, CleanSpark chose to sell Bitcoin between the $40,000 and $60,000 range, and reallocate the funds into more efficient infrastructure.</p><p>With the next Bitcoin halving just around the corner, the company updated its strategy once again. \"If you've looked at our updates, [...] we've started to increase the amount of Bitcoin that we hold back because we believe running into this halving event just reaps rewards and pays dividends,\" said Schultz. </p><p>Also hinting at the company's plans for 2024, CleanSpark's CEO Zach Bradford said it will be looking at mergers and acquisitions (M&amp;A) opportunities for the next cycle. \"I really think post-halving is going to have incredible M&amp;A opportunities [...] you're going to see whole facilities or maybe peers that just can't stay operating [...]. I'd love to come in, buy up a bunch of empty facilities and bring in state-of-the-art miners. That's what we're thinking about 2024 is, again, build capital, wait for the opportunity, deploy it when we can create quick returns.\"</p><p><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Magazine: Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-13T21:11:13.000Z",
    "title": "Crypto Exchange Kraken Re-enables Trading in XRP for U.S. Based Users",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-exchange-kraken-re-enables-trading-in-xrp-for-u-s-based-users/",
    "description": "On 13 July 2023, within 30 minutes of Coinbase announcing that it had decided to relist XRP, rival exchange Kraken made a similar announcement: A few minutes later, Marco Santori, Chief Legal Officer at Ripple, explained the reason for the decision to relist XRP. Santori said: “This morning, the Federal Court for the Southern District […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T21:30:19.000Z",
    "title": "FTC Slaps Crypto Lender Celsius With $4.7B Fine for Deceiving Consumers and Mismanaging Deposits",
    "url": "https://news.bitcoin.com/ftc-slaps-crypto-lender-celsius-with-4-7b-fine-for-deceiving-consumers-and-mismanaging-deposits/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"FTC Slaps Crypto Lender Celsius With $4.7B Fine for Deceiving Consumers and Mismanaging Deposits\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Thursday, following the U.S. Securities and Exchange Commission (SEC) suing the insolvent crypto lender Celsius, the Federal Trade Commission (FTC) divulged a settlement with the firm and imposed a $4.7 billion fine for “duping consumers.” Nevertheless, the penalty will be deferred to enable Celsius to return its remaining assets to consumers in bankruptcy proceedings. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T21:17:53.000Z",
    "title": "Is America’s Hollywood about to crash big-time?",
    "url": "https://www.cryptopolitan.com/is-america-hollywood-about-to-crash-big-time/",
    "description": "Hollywood, the veritable symbol of the American film and television industry, currently stands on shaky ground. The wheels of production grind to a halt as actors unite with screenwriters, signaling the first dual labor strike in over six decades. This widespread industrial action comes hot on the heels of an impasse in negotiations with major ... <a title=\"Is America&#8217;s Hollywood about to crash big-time?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-america-hollywood-about-to-crash-big-time/\" aria-label=\"More on Is America&#8217;s Hollywood about to crash big-time?\">Read more</a>"
  }
]