[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T02:59:00.000Z",
    "title": "Prime Minister’s Ethics Agenda at Forefront of AI Safety Summit, Say Tech Pros",
    "url": "https://www.cryptopolitan.com/pm-ethics-ai-safety-summit-say-tech-pros/",
    "description": "As the UK prepares to host the AI Safety Summit this autumn, tech professionals are calling upon Prime Minister Rishi Sunak to place a profound emphasis on ethics in the world of artificial intelligence. Findings from research conducted by BCS, The Chartered Institute for IT, reveal that the majority of experts are of the opinion ... <a title=\"Prime Minister&#8217;s Ethics Agenda at Forefront of AI Safety Summit, Say Tech Pros\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pm-ethics-ai-safety-summit-say-tech-pros/\" aria-label=\"More on Prime Minister&#8217;s Ethics Agenda at Forefront of AI Safety Summit, Say Tech Pros\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T02:41:47.000Z",
    "title": "House Committee puts SEC Chief’s crypto stance under fire",
    "url": "https://www.cryptopolitan.com/house-committee-sec-crypto-stance-under-fire/",
    "description": "Gary Gensler, the leading man at the United States Securities and Exchange Commission, might have had a memorable session at the House Financial Services Committee hearing. On September 27, Gensler faced the music for the SEC&#8217;s policies and actions, receiving more than his share of criticism during a four-hour grilling. While a plethora of topics ... <a title=\"House Committee puts SEC Chief&#8217;s crypto stance under fire\" class=\"read-more\" href=\"https://www.cryptopolitan.com/house-committee-sec-crypto-stance-under-fire/\" aria-label=\"More on House Committee puts SEC Chief&#8217;s crypto stance under fire\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-28T02:41:22.000Z",
    "title": "Why Asian Investors are backing Shiba Inu (SHIB) & Shiba Budz (BUDZ)",
    "url": "https://nulltx.com/why-asian-investors-are-backing-shiba-inu-shib-shiba-budz-budz/",
    "description": "In recent years, the Asian community has shown immense interest and support for cryptocurrencies. Among the various tokens and ecosystems available, two projects, Shiba Inu (SHIB) and Shiba Budz (BUDZ), have gained significant traction and backing from the Asian investor community. In this article, we will explore the reasons behind the popularity of these tokens [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T03:00:06.000Z",
    "title": "Uniswap Unveils Funding Plan For Ecosystem Revamp As UNI Price Hits 4-Month Low",
    "url": "https://www.newsbtc.com/analysis/uni/uniswap-unveils-funding-plan-for-ecosystem-revamp-as-uni-price-hits-4-month-low/",
    "description": "In a move aimed at advancing their vision of creating a self-sovereign Internet with a permissionless alternative to traditional finance (TradFi), the Uniswap Foundation (UF) has submitted a proposal to secure the second tranche of funding.  The desired funding, totaling $62.37 million, will be put to an on-chain vote scheduled for Wednesday, October 4th, with a 10% buffer included to mitigate price volatility. Uniswap Foundation Seeks Community Approval The separation of the funding request into two tranches was initially established to allow the UF to finalize its legal entity and obtain non-profit status from the Internal US Revenue Service (IRS), as the company is based in Brooklyn New York, ensuring clarity on tax implications before receiving the larger portion of funds. The UF obtained this status in the spring of this year, prompting the request for the second tranche. Related Reading: LINK Price Broke Critical Level, Macro Downtrend Behind? Analyst Forecasts The first tranche of funding, approved by Uniswap governance last year, aimed for $20 million but experienced a decrease in value due to a drop in the price of UNI, the native token of the Uniswap Protocol.  Consequently, the Uniswap Foundation received $17.3 million worth of UNI, creating a remainder of $56.7 million to be requested in the second tranche. A 10% buffer of $5.67 million has been included to account for potential price fluctuations, bringing the total request to $62.37 million. The Uniswap Foundation plans to receive the funds in UNI, with the amount determined using a 30-day UNI/USD TWAP (Time-Weighted Average Price). The pricing and its source will be explicitly noted in the on-chain proposal to ensure transparency in the process. Regarding future operations, Uniswap currently holds 452,534 UNI tokens for employee vesting, valued at around $1.9 million. Factoring in a capital loss of $259,000 and the current UNI price, the UF has approximately $9.24 million remaining for operational expenses, expected to sustain them until Q4 2024.  Lastly, according to the proposal discussion, the Uniswap Foundation anticipates revisiting governance in mid-2024 to extend its operational runway. UNI Consolidates Amid Bearish Market Sentiment Uniswap&#8217;s native token, UNI, has been consolidated between the price range of $4.198 and $4.311 over the past week.  This price stagnation comes from the overall market trend and a bearish macro outlook, with the token experiencing a 0.5% decline in the fourteen-day timeframe. Furthermore, UNI has dropped 9.6% over the past 30 days, reaching a four-month low. In the short term, UNI bulls must defend the current price floor to establish a strong support level. They aim to surpass the resistance walls at $4.418 and $4.487 to break the downtrend structure and potentially rally toward $6.259. It is worth noting that this price level is still below UNI&#8217;s annual high of $7.629. Related Reading: Crypto Analyst Predicts Huge Double-Digit Breakout For Bitcoin Price According to Token Terminal data, Uniswap&#8217;s circulating market cap currently stands at $3.67 billion, experiencing a recent decrease of 6.66%. The fully diluted market cap, which considers the total number of UNI tokens that could enter circulation, stands at $4.27 billion, displaying an 8.15% decrease. The total value locked (TVL) in Uniswap, representing the amount of cryptocurrency assets deposited and utilized within the platform, has recently declined by 5.31%. This decline reflects the broader Decentralized Finance (DeFi) sector&#8217;s challenges. Featured image from Shutterstock, chart from TradingView.com "
  }
]