[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-23T18:35:02.000Z",
    "title": "Concentric’s $1.8M exploiter is tied to OKX and LunaFi incidents, CertiK reports",
    "url": "https://cryptobriefing.com/concentric-exploiter-tied-okx-lunafi-incidents-certik/?utm_source=feed&utm_medium=rss",
    "description": "On-chain data shows that the exploiters wallets were funded by addresses connected to three notorious security incidents."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-23T18:30:41.000Z",
    "title": "Registration opens for GDC 2024: The game industry event like nothing else",
    "url": "https://cryptobriefing.com/registration-opens-gdc-2024-game-industry-event/?utm_source=feed&utm_medium=rss",
    "description": "Registration is open for the 2024 Game Developers Conference, returning to San Francisco for a week of learning, networking, and fun."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-23T18:30:02.000Z",
    "title": "Critical Bug in Ethereum’s Nethermind Client Highlights Risks of Low Client Diversity",
    "url": "https://news.bitcoin.com/critical-bug-in-ethereums-nethermind-client-highlights-risks-of-low-client-diversity/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Critical Flaw in Ethereum&#039;s Nethermind Client Spotlights the Dangers of Limited Client Diversity\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/nethermind_bug.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A severe bug in the Nethermind Ethereum execution client has recently been uncovered, affecting 8% of Ethereum&#8217;s validators and reminding everyone of the necessity for greater client diversity in the Ethereum network. Critical Flaw in Ethereum&#8217;s Nethermind Client Spotlights the Dangers of Limited Client Diversity A critical bug was identified in the Ethereum&#8217;s Nethermind execution [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-23T18:39:03.000Z",
    "title": "BINANCE COIN PRICE ANALYSIS & PREDICTION (January 23) – BNB Faints Buying After Steady Build-Up, Now Charging For A Big Drop",
    "url": "https://nulltx.com/binance-coin-price-analysis-prediction-january-23-bnb-faints-buying-after-steady-build-up-now-charging-for-a-big-drop/",
    "description": "BNB lost buzz yesterday after witnessing a consistent increase for more than a week. However, there&#8217;s still hope for the bulls in the mid-term but it appears the bears are now back considering the last down surge. The recent build-up for bullish continuation turned out invalid with a bearish engulfing [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-23T18:31:34.000Z",
    "title": "AVALANCHE PRICE ANALYSIS & PREDICTION (January 23) – Avax’s Correction May End At $16 If This Key Level Breaks Down",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-january-23-avaxs-correction-may-end-at-16-if-this-key-level-breaks-down/",
    "description": "The latest crackdown has sent most altcoins to a new monthly low with Avax shedding over 12% loss since yesterday. It is in a serious red zone with no attempt to recover at the moment. Avax has witnessed a back-to-back decline in the last 48 hours with no key level [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-23T18:24:39.000Z",
    "title": "RIPPLE PRICE ANALYSIS & PREDICTION (January 23) – XRP Resets Back To Three-Month Low Amid Meltdown, Can It Bounce Back? ",
    "url": "https://nulltx.com/ripple-price-analysis-prediction-january-23-xrp-resets-back-to-three-month-low-amid-meltdown-can-it-bounce-back/",
    "description": "Ripple&#8217;s XRP has extended bearishness today, registering a total loss of 18% in a month. It is trading near support with no signs of stopping yet. More sell-offs should be expected if the price continues to melt down.  After cracking below a crucial demand zone over the weekend, XRP further [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T18:24:06.000Z",
    "title": "Abra set to enable customer withdrawals after settling with Texas authorities",
    "url": "https://crypto.news/abra-set-to-enable-customer-withdrawals-after-settling-with-texas-authorities/",
    "description": "Cryptocurrency platform Abra has reached a settlement with Texas securities regulators, enabling users to withdraw their funds and ensuring compliance with existing securities laws."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T18:10:39.000Z",
    "title": "ORDI down 14% after Bitcoin plunged under $40k",
    "url": "https://crypto.news/ordi-down-14-after-bitcoin-plunged-under-40k/",
    "description": "Inspired by Casey Rodarmor’s Ordinals Protocol, the ORDI token dropped by over 14% on Jan. 23 to a new monthly low as Bitcoin backtracked to $39,000."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T18:15:02.000Z",
    "title": "Crypto Analyst Reveals Top Altcoins To Buy Amid Market Slump",
    "url": "https://www.newsbtc.com/news/crypto-analyst-top-altcoins-amid-market-slump/",
    "description": "In a new video update, renowned crypto analyst Michael van der Poppe dissected the current dynamics of the crypto market, emphasizing the potential of select altcoins. VVan der Poppe&#8217;s analysis provides a strategic viewpoint for potential investors, focusing on the intricate relationship between Bitcoin&#8217;s (BTC) price movements and the broader altcoin market. Van der Poppe started by acknowledging the mixed performances among altcoins, with some consolidating, others correcting, and a few showing remarkable strength. The crux of his analysis hinges on the intricate relationship between Bitcoin&#8217;s market behavior and the resultant impact on altcoins. He highlighted the current consolidation phase of Bitcoin, noting, &#8220;Bitcoin is currently looking at a case of consolidating which means that if Bitcoin is bottoming out&#8230; that can be the kickstart of altcoins to start firing up.&#8221; Related Reading: Pastor Accused Of Defrauding Congregation With $3 Million Crypto Ponzi Scheme Furthermore, the crypto analyst delved deep into market capitalization metrics, particularly emphasizing the Total 2 market cap (excluding Bitcoin) and Total 3 market cap (excluding Bitcoin and Ethereum), to underscore the latent potential in altcoins. He pointed out, &#8220;We are at the levels of March 2022&#8230; the total market cap lagging says that we are looking at a case of other cryptocurrencies to start trending outside of Bitcoin.&#8221; Top 3 Altcoins To Buy Now The first altcoins which van der Poppe picked is Ethereum. He linked ETH’s price movements with broader market events, including the Bitcoin halving and potential regulatory approvals and suggested, &#8220;Ether is always going to pick up in a pace that is due to a period of consolidation of Bitcoin.&#8221; He added with regards to the final SEC deadline for an spot Ethereum ETF approval in the US, &#8220;the actual date that we need to focus on is May, which probably is going to lead into such a momentum towards these highs.&#8221; With regard to a possible price target in this bull run, the analyst revealed: &#8220;I think that at this point ETH is still going to continue running towards the area of 8K and we&#8217;re going to find ourselves into a top at that specific level.&#8221; Related Reading: XRP Could Hit $0.39 Before Soaring 1000%: Crypto Analyst With respect to the 1-week ETH/BTC chart, van der Poppe remarked, “We&#8217;re seeing one crucial level that we need to break through 0.06. If we do, I think the range high at 0.0838 is going to be the target. As a matter of fact you can actually say $130 billion needs to be added towards Ethereum. It&#8217;s a rally of approximately 43%. Van der Poppe&#8217;s second pick is Chainlink. Highlighting LINK&#8217;s technical patterns and its correlation position against BTC in the weekly chart, Van der Poppe highlighted that LINK hit resistance at 0.000448, dropped back down towards 0.0002843 and is now consolidating. Once this is finished, he expects Chainlink “to rally towards the resistance and start breaking out of this level towards the highs at 0.0009 to 0.0010.&#8221; He added, &#8220;In terms of BTC value, it&#8217;s very likely that it&#8217;s going to do a 2x,&#8221; emphasizing the potential for significant growth. In USDT terms, this would mean that LINK goes to $17 to $18. “From $17 to $18, you need to do 2X, which is this range high, which is this level, which we can expect Chainlink to go to before we have a pretty substantial correction in the entire market,” he added. The analyst&#8217;s third altcoin is Arbitrum. Focusing on ARB’s recent price actions and potential for a significant rally, Van der Poppe identified key entry points, stating, &#8220;Anywhere in this ballpark between $1.67 and $1.50 is where you want to get yourself into an entry point.&#8221; He underlined the potential growth, saying, &#8220;If there&#8217;s going to be another impulse taking place, it is going to $3.50 or $5.&#8221; At press time, the total crypto market cap stood at $1.473 trillion after being rejected at the 0.382 Fibonacci retracement level. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-23T18:15:00.000Z",
    "title": "Red Alert for Mac Crypto Users: Security Firm Sounds Alarm",
    "url": "https://coinedition.com/red-alert-for-mac-crypto-users-security-firm-sounds-alarm/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Alibaba Cloud Launch Blockchain Lab\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Alibaba-Cloud-Launch-Blockchain-Lab-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent discovery, cybersecurity researchers at Kaspersky have identified a new strain of macOS malware specifically designed to target crypto stored in digital wallets on Apple devices.&#160; According to Kaspersky, this crypto trojan stands out for two distinct reasons. Firstly, it employs DNS records as a means to deliver its malicious Python script. Secondly, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/red-alert-for-mac-crypto-users-security-firm-sounds-alarm/\">Red Alert for Mac Crypto Users: Security Firm Sounds Alarm</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]