[
  {
    "source": "CryptoSlate",
    "date": "2024-02-29T00:19:12.000Z",
    "title": "Marathon posts record growth in 2023 earnings, unveils Bitcoin Layer-2 Anduro",
    "url": "https://cryptoslate.com/marathon-posts-record-growth-in-2023-earnings-unveils-bitcoin-layer-2-anduro/",
    "description": "<p>Bitcoin mining and technology firm Marathon Digital reported record growth in a number of categories in its 2023 annual earnings report. The firm also revealed the development of a Layer-2 network for Bitcoin called Anduro to build upon the flagship crypto&#8217;s ecosystem. Marathon chairman and CEO Fred Thiel said: &#8220;2023 was a record-breaking year for Marathon, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/marathon-posts-record-growth-in-2023-earnings-unveils-bitcoin-layer-2-anduro/\">Marathon posts record growth in 2023 earnings, unveils Bitcoin Layer-2 Anduro</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-29T00:30:15.000Z",
    "title": "Gemini Agrees to Over $1 Billion Restoration in Settlement With New York Regulators",
    "url": "https://news.bitcoin.com/gemini-agrees-to-over-1-billion-restoration-in-settlement-with-new-york-regulators/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Gemini Agrees to Over $1 Billion Restoration in Settlement With New York Regulators\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nydfs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In an agreement with the New York Department of Financial Services (NYDFS), the Winklevoss-led cryptocurrency exchange Gemini has committed to returning over $1 billion to its customers. The settlement, which also includes a $37 million fine, comes as a significant development for the exchange amidst several ongoing legal challenges with big-name crypto firms and heightened [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T00:30:21.000Z",
    "title": "TRON Hits 95 Million Addresses Milestone, Will This Help Price?",
    "url": "https://www.newsbtc.com/news/tron/tron-95-million-addresses-milestone-help-price/",
    "description": "On-chain data shows the total number of addresses on the TRON network has exceeded the 95 million mark, a major milestone for the blockchain. TRON Addresses Carrying A Balance Have Broken The 95 Million Mark According to data from the market intelligence platform IntoTheBlock, TRON has far left behind other layer 1 networks like Cardano and Avalanche regarding its address growth. Here, the analytics firm has used the total number of addresses on the blockchain carrying some non-zero balance to keep track of this network growth. Related Reading: Cardano (ADA) Among Only Coins Seeing Loss-Taking: What It Means When these addresses with a balance go up, it means that either fresh investors are joining the network or old holders are returning. Either way, such a trend can be a positive sign for any cryptocurrency, as it suggests that some net adoption of the blockchain is going on. On the other hand, a decline in the metric implies some investors have decided to clear out their wallets, a potential sign that they have decided to leave the network behind. Now, here is a chart that shows the trend in the total addresses with a balance for TRON over the past few years: The value of the metric seems to have been going up since a while now &#124; Source: IntoTheBlock on X As displayed in the above graph, the total number of TRON addresses with a balance has been rising for a while now and has recently hit a new record of more than 95 million. &#8220;Quite an impressive number, considering other layer 1 networks like Cardano and Avalanche have fewer than 10 million addresses,&#8221; notes IntoTheBlock. &#8220;Layer 1&#8221; blockchains handle transactions and security independently, without being dependent on other networks. Given the pace at which the TRON network has seen addresses open up, it would appear that users have been preferring the blockchain to some of the other layer 1 networks. Now, what this adoption might imply for the price of TRX can be complicated. The chart shows that adoption has been up for the asset for years, but this hasn&#8217;t exactly translated into its price. Related Reading: Polygon (MATIC) Whale Makes Large Deposit To Binance, Bearish Sign? One thing that&#8217;s usually certain about adoption is that it provides a solid foundation for the network and is a good sign that the asset will be around in the long term. TRX Price The cryptocurrency sector as a whole has been racing up recently, with Bitcoin leading the charge with its returns of 20% over the past week. TRON, however, has lagged behind the market, mustering only 3% profits in the same period. The chart below shows that the coin is currently trading around the $0.14 level. Looks like the price of the asset has been heading up in recent weeks &#124; Source: TRXUSD on TradingView Regarding the market cap, TRX is currently the eleventh-ranked cryptocurrency. However, if the coin continues to be weaker than its competitors, it might slip down the list, as Chainlink (LINK), the twelfth largest coin, is currently closing the gap with its stronger returns. The market cap of the asset appears to be $12.6 billion at the moment &#124; Source: CoinMarketCap Featured image from Shutterstock.com, IntoTheBlock.com, chart from TradingView.com"
  }
]