[
  {
    "source": "CoinDesk",
    "date": "2023-11-21T10:32:41.000Z",
    "title": "Fed Minutes Release May Be a Non-Event for Bitcoin",
    "url": "https://www.coindesk.com/markets/2023/11/21/fed-minutes-release-may-be-a-non-event-for-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The minutes of the Nov. 1 Fed meeting may be outdated, given the post-meeting softness in economic data and resulting expectations for renewed interest-rate cuts in 2024."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-21T10:11:56.000Z",
    "title": "Bitcoin Faces Headwinds as ETF Optimism Stalls; DOGE, SOL Give Back Gains",
    "url": "https://www.coindesk.com/markets/2023/11/21/bitcoin-faces-headwinds-as-etf-optimism-stalls-doge-sol-give-back-gains/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether (ETH) lost 0.5%, while dogecoin (DOGE) and solana (SOL) slumped as much as 5% as traders likely took profits."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T10:15:58.000Z",
    "title": "Crypto community responds to Kraken lawsuit, Deaton slams ‘dishonorable’ Gensler",
    "url": "http://cointelegraph.com/news/crypto-community-responds-kraken-lawsuit-deaton-slams-dishonorable-gensler",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/205e5054-53a7-485d-8635-0c650708496c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto community, including prominent industry lawyers and U.S. Senator Cynthia Lummis, is sounding off about the new lawsuit filed by the U.S. SEC against cryptocurrency exchange Kraken.  </p>\n                    <p><p>The crypto space has been making its feelings known about a <a href=\"https://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations\">lawsuit filed by the United States Securities and Exchange Commission (SEC)</a> against the crypto exchange Kraken. </p><p>The lawsuit, filed on Nov. 20, is based on the SEC’s allegations that Kraken has been operating as an unregistered exchange, broker, dealer and clearing agency and claims that it mixes customer assets with its own. </p><p>Since the news broke, the crypto community on social media, Kraken executives and prominent lawyers have been vocal in expressing their views on the SEC’s action. </p><p>Kraken founder <a href=\"https://cointelegraph.com/news/kraken-jesse-powell-slams-sec-warns-us-crypto-firms\">Jesse Powell called the action</a> an “assault on America” and called the SEC the U.S.’s “top decel.” Powell even warned other companies to depart the country.</p><p>On Nov. 21, the current CEO of Kraken, Dave Ripley, took to X (formerly Twitter) and said the company “strongly disagrees” with the SEC claims and plans to “vigorously” defend its position. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We strongly disagree with the SEC claims, stand firm in our view that we do not list securities, and plan to vigorously defend our position.<br><br>As we have seen before, the SEC argues that <a href=\"https://twitter.com/krakenfx?ref_src=twsrc%5Etfw\">@krakenfx</a>  should “come in and register” with the agency, when there is no clear path to…</p>&mdash; Dave Ripley (@DavidLRipley) <a href=\"https://twitter.com/DavidLRipley/status/1726754746265227386?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As an industry leader, we will stand up to these allegations and defend the crypto industry’s right to exist in the U.S.,” he said. Ripley said that the “lack of regulatory clarity in the U.S.” will only be resolved by Congressional action, adding:</p><blockquote>“[We] will continue to support these efforts to bring clarity and certainty to the chaotic environment that has been created in the U.S.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kraken-share-data-42-000-users-irs\"><strong><em>Kraken will share data of 42,000 users with IRS</em></strong></a><strong><em><u></u></em></strong></p><p>Prominent crypto lawyer John Deaton also commented on the development, calling SEC Chair Gary Gensler a “despicable and dishonorable regulator.”</p><p>Deaton also commented on Kraken’s decision in February to pay <a href=\"https://cointelegraph.com/news/kraken-reaches-30m-settlement-with-sec-over-staking\">$30 million to the SEC in a settlement</a> deal.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/GaryGensler?ref_src=twsrc%5Etfw\">@GaryGensler</a> is a despicable and dishonorable regulator. He knew that <a href=\"https://twitter.com/krakenfx?ref_src=twsrc%5Etfw\">@krakenfx</a> believed it was buying peace for the $30M. I know some people are critical of it’s choice to settle and pay the $30M. I wanted them to fight as well. But when you decide to fight, $30M takes you only… <a href=\"https://t.co/WeF4YTMfip\">https://t.co/WeF4YTMfip</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1726817148322894036?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Deaton said he believes Gensler does not care about any of the parties involved — employees or investors — and said, “he’s a disgrace, and I can’t wait to see him go down.”</p><p>When asked if Kraken stands a chance against the SEC in court for round two, crypto criminal defense lawyer Carlo D’Angelo <a href=\"https://twitter.com/DeFiDefenseLaw/status/1726795207742787673\" target=\"_blank\" rel=\"noopener nofollow\"></a><a href=\"https://twitter.com/DeFiDefenseLaw/status/1726795207742787673\" target=\"_blank\" rel=\"noopener nofollow\">said</a> he doesn’t see the odds being in the SEC’s favor. </p><blockquote>“Similar arguments have been tried and failed in other circuits. The judge in the Kraken case will likely look closely at those decisions. Judges like consistent precedents—less chance of getting reversed on appeal.”</blockquote><p>One X user <a href=\"https://twitter.com/caliryan5/status/1726789216464728279\" target=\"_blank\" rel=\"noopener nofollow\">responded</a> by saying, “Just because the sec says something, [doesn’t] make it true! Get them to explain in detail to the court how to come on and register and operate normally.”</p><p>The SEC has received a lot of backlash for its harsh crackdown on crypto, particularly as the industry is operating in a legal system that has not yet provided clear legislation for cryptocurrencies and exchanges working with digital assets. </p><p>However, the crypto space also has allies on the regulatory side. U.S. Senator Cynthia Lummis posted a response to the lawsuit, saying the SEC cannot continue to “rule by enforcement.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC cannot continue ruling by enforcement. My statement on the Kraken lawsuit below: <a href=\"https://t.co/J3qhzU624N\">pic.twitter.com/J3qhzU624N</a></p>&mdash; Senator Cynthia Lummis (@SenLummis) <a href=\"https://twitter.com/SenLummis/status/1726768494069354545?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>She said crypto companies’ have made “repeated” attempts to receive guidance from the SEC but have seen no progress. House Representative Tom Emmer is also backing the industry, and recently <a href=\"https://cointelegraph.com/news/rep-tom-emmer-amendment-house-budget-bill-defund-sec-crypto-enforcement\">proposed defunding the SEC’s crusade</a> against crypto.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive — 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-21T10:30:16.000Z",
    "title": "Centralized Provider Problem Causes Nationwide Digital Payment Meltdown in Spain: Users Turn to Crypto and Cash",
    "url": "https://news.bitcoin.com/centralized-provider-problem-causes-nationwide-digital-payment-meltdown-in-spain-users-turn-to-crypto-and-cash/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Centralized Provider Problem Causes Nationwide Digital Payment Meltdown in Spain: Users Turn to Crypto and Cash\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/072d1592-6018-451b-8145-c449be3dea64.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A problem with Redsys, a third-party platform used in all of Spain, caused a meltdown for almost all of the digital payment options in the country, leaving citizens without means of payment for hours. The incident left stores without the possibility of using credit and debit cards for receiving payments, and users had to turn [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T10:32:03.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T10:32:01.000Z",
    "title": "XRP lawyer John E. Deaton critiques SEC chair after Kraken’s $30M fine",
    "url": "https://www.cryptopolitan.com/john-e-deaton-critiques-sec-chair/",
    "description": "In a significant development within the cryptocurrency industry, Kraken, a major crypto exchange, has agreed to pay $30 million in a settlement with the U.S. Securities and Exchange Commission (SEC). This settlement arises from charges related to its staking-as-a-service offerings. John E. Deaton, founder of CryptoLaw U.S., has vocally criticized SEC Chair Gary Gensler in ... <a title=\"XRP lawyer John E. Deaton critiques SEC chair after Kraken&#8217;s $30M fine\" class=\"read-more\" href=\"https://www.cryptopolitan.com/john-e-deaton-critiques-sec-chair/\" aria-label=\"More on XRP lawyer John E. Deaton critiques SEC chair after Kraken&#8217;s $30M fine\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T10:20:14.000Z",
    "title": "Why is the XRP price down today? Whale activity troubles investors",
    "url": "https://www.cryptopolitan.com/why-is-the-xrp-price-down-today/",
    "description": "Today, the spotlight is on XRP, a digital asset that has captured the attention of traders and enthusiasts alike. As the market witnesses a downturn in XRP prices, the intrigue deepens, and investors find themselves grappling with questions about the root causes of this unexpected decline. As the XRP price takes a dip, the shadow ... <a title=\"Why is the XRP price down today? Whale activity troubles investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-xrp-price-down-today/\" aria-label=\"More on Why is the XRP price down today? Whale activity troubles investors\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T10:38:17.000Z",
    "title": "Apple hit with lawsuit for blocking crypto in P2P payments",
    "url": "https://crypto.news/apple-hit-with-lawsuit-for-blocking-crypto-in-p2p-payments/",
    "description": "Apple faces a class-action lawsuit alleging the tech giant conspired to limit peer-to-peer payment options on its devices and blocked the integration of crypto technology in iOS payment apps. The lawsuit, lodged on Nov. 17 in a California District Court,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T10:29:18.000Z",
    "title": "Staying safe in web3: your guide to dapps security",
    "url": "https://crypto.news/staying-safe-in-web3-your-guide-to-dapps-security/",
    "description": "As web3 grows, so do the risks associated with decentralized applications (dapps). Here, we share practical advice to mitigate these risks."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T10:20:51.000Z",
    "title": "Solana, Cardano mentioned widely in SEC’s lawsuit against Kraken",
    "url": "https://crypto.news/solana-cardano-mentioned-widely-in-secs-lawsuit-against-kraken/",
    "description": "Cardano and Solana have been mentioned widely in the SEC's lawsuit against Kraken"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T10:40:02.000Z",
    "title": "Solana Captures Institutional Investors’ Attention, Inflows Rise To $135 Million",
    "url": "https://www.newsbtc.com/news/solana/solana-institutional-investors-135/",
    "description": "Solana has held its stance among altcoins, registering inflows more than any other cryptocurrency besides Bitcoin last week.  Institutional investment products have witnessed consecutive eight weeks of inflows, with some cryptocurrencies receiving a greater amount of inflows than others. According to the new CoinShares report on digital asset funds, the majority of this money went into Bitcoin products as the crypto continues to attract investor interest in light of recent developments in the crypto industry.  Solana Gains Momentum Among Institutional Investors Solana has been on an incredible run this year, with its native SOL token up over 465% since the beginning of the year. At the same time, investment products tied to Solana have attracted major interest from institutional investors, with inflows now topping $135 million this year. According to CoinShares, digital asset investment funds registered a total inflow of $176 million last week. Out of this total inflow, $155 million went into Bitcoin, with the last eight weeks of inflows now representing 3.4% of the total assets under management. As a result, the total inflow has now reached $1.32 billion this year, although well behind 2021 and 2020, which saw $10.7 billion and $6.6 billion respectively. CoinShares&#8217; latest report reveals that weekly inflow into Ethereum products dropped by an astounding 93.27% from $49.1 million to $3.3 million. Solana on the other hand, increased by almost 10% from $12.4 million to $13.6 million.  Other altcoins also struggled to receive major inflows, with Litecoin and XRP only registering inflows of $0.4 million and $0.5 million respectively. Uniswap and Polygon saw minor outflows of $0.55 million and $0.86 million respectively.  Factors Influencing The Inflow Most cryptocurrencies went through a brief period of consolidation last week, but this didn&#8217;t roll over into investment products. The report from Coinshares attributes the inflows into Bitcoin in particular to a strong bullish sentiment related to the impending approval of a spot-based Bitcoin ETF in the US. This is particularly evident, as Short-Bitcoin outflows saw another outflow of $8.5 million last week. Amid these influences and a 101% price surge last month, Solana has seen growth in other aspects of its ecosystem that may have attracted institutional investors. For one, Solana has delivered one of the most impressive performances on TVL in the most recent months.  Data from DeFiLlama puts the total TVL on the network at $576.44 million, a 77.62% increase in the past month. The platform also revealed a spike in SOL trading volume on decentralized exchanges in the past week. Related Reading: Shiba Inu Burn Rate Crashes 98.79% With Less Than 1 Million tokens Burned According to the on-chain intelligence platform Messari, Solana is now the hub for Decentralized Physical Infrastructure Network (DePIN) projects. What is in the value of a SOL? Despite a tough market, @solana has outperformed major crypto assets, becoming the hub for DePIN projects and releasing major product announcements like Firedancer. pic.twitter.com/7ouHN089Wd — Messari (@MessariCrypto) November 20, 2023 Solana (SOL) is currently trading at $56.27 with investors still anticipating a strong break above $60.  SOL price at $56 &#124; Source: SOLUSD on Tradingview.com Featured image from CNBCTV18, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-21T10:35:46.000Z",
    "title": "Bitcoin Steals the Fee Spotlight: Surpasses Ethereum Amid Ordinals Surge",
    "url": "https://www.crypto-news-flash.com/bitcoin-steals-the-fee-spotlight-surpasses-ethereum-amid-ordinals-surge/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-steals-the-fee-spotlight-surpasses-ethereum-amid-ordinals-surge",
    "description": "Bitcoin&#8217;s average daily transaction fees have surpassed those of Ethereum, reaching $10.34 on November 20, while Ethereum fees stood at $8.43. The surge in Bitcoin transaction fees is attributed to renewed market interest in assets using the Ordinals Protocol. While the Bitcoin price has been consolidating at around $37,500 levels, the network activity has shot [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-21T10:35:17.000Z",
    "title": "Are Investors Shifting Their Focus to These Two Tokens Over Solana (SOL) in the Next Bull Market?",
    "url": "https://www.crypto-news-flash.com/are-investors-shifting-their-focus-to-these-two-tokens-over-solana-sol-in-the-next-bull-market/?utm_source=rss&utm_medium=rss&utm_campaign=are-investors-shifting-their-focus-to-these-two-tokens-over-solana-sol-in-the-next-bull-market",
    "description": "<img width=\"729\" height=\"414\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC-1.jpg 729w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC-1-300x170.jpg 300w\" sizes=\"(max-width: 729px) 100vw, 729px\" />Solana&#8217;s (SOL) remarkable resurgence in 2023 from its downturn following FTX&#8217;s collapse makes it one of the top altcoins to follow. However, several hurdles could impede its growth in the upcoming bullish market phase. Meanwhile, investors are showing a strong inclination towards VC Spectra (SPCT) and Celestia (TIA), two emerging digital assets. SPCT and TIA&#8217;s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-21T10:16:00.000Z",
    "title": "Crypto Analyst Ali Martinez Presents a Bullish Ripple (XRP) and Bitcoin (BTC) Outlook – Everlodge (ELDG) Price on an Upward Trajectory",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-ali-martinez-presents-a-bullish-ripple-xrp-and-bitcoin-btc-outlook-everlodge-eldg-price-on-an-upward-trajectory/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-ali-martinez-presents-a-bullish-ripple-xrp-and-bitcoin-btc-outlook-everlodge-eldg-price-on-an-upward-trajectory",
    "description": "<img width=\"512\" height=\"386\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-31-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-31-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-31-1-300x226.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A renowned crypto analyst, Ali Martinez, has provided compelling projections for Ripple (XRP) and Bitcoin (BTC), stirring anticipation among traders. Additionally, as the crypto market gears up for potential movements, Everlodge (ELDG) stands poised for a significant price trajectory. Ripple (XRP): A Potential Rebound  Recently, Ali Martinez made an X post, which has sparked optimism [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-21T10:12:44.000Z",
    "title": "Bitcoin and Binance Coin Rally as CZ and Binance Could Pay $4B to Settle with SEC",
    "url": "https://www.crypto-news-flash.com/bitcoin-and-binance-coin-rally-as-cz-and-binance-could-pay-4b-to-settle-with-sec/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-and-binance-coin-rally-as-cz-and-binance-could-pay-4b-to-settle-with-sec",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/unnamed-2023-05-21T124207.918.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/unnamed-2023-05-21T124207.918.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/unnamed-2023-05-21T124207.918-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The potential settlement of $4 billion by Binance might alleviate major concerns in the crypto market. This development has positively influenced the value of Bitcoin and Binance Coin, indicating a market reaction to regulatory news. In light of recent developments reported by Bloomberg, a significant cloud hanging over the cryptocurrency market may be dissipating. Binance, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T10:18:00.000Z",
    "title": "BTC Whales Making Waves: Is a Pump or Dump on the Horizon?",
    "url": "https://coinedition.com/btc-whales-making-waves-is-a-pump-or-dump-on-the-horizon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/6-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/6-3.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/6-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/6-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/6-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/6-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/6-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from the whale tracking platform Whale Alert indicated that multiple whales moved Bitcoin (BTC) to exchanges over the past few hours. Almost first thing this morning, a whale transferred 2,707 BTC tokens worth $101,620,813 from an unknown wallet to the Coinbase exchange. Just a few hours later, another whale transferred 2,712 BTC tokens from [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/btc-whales-making-waves-is-a-pump-or-dump-on-the-horizon/\">BTC Whales Making Waves: Is a Pump or Dump on the Horizon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T10:15:15.000Z",
    "title": "Macro Indicators Suggesting Bitcoin Rallies Just Getting Started, According to Ex-Goldman Sachs Executive",
    "url": "https://dailyhodl.com/2023/11/21/macro-indicators-suggesting-bitcoin-rallies-just-getting-started-according-to-ex-goldman-sachs-executive/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Macro-Indicators-Suggesting-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Real Vision CEO Raoul Pal thinks Bitcoin&#8217;s (BTC) rally is all about the global liquidity cycle. In a new analysis, the former Goldman Sachs executive lays out how he believes crypto is tied into the traditional macroeconomic framework. &#8220;Below you will find a chart of ISM (our preferred barometer for the business cycle) versus what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/macro-indicators-suggesting-bitcoin-rallies-just-getting-started-according-to-ex-goldman-sachs-executive/\">Macro Indicators Suggesting Bitcoin Rallies Just Getting Started, According to Ex-Goldman Sachs Executive</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]