[
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T08:36:04.000Z",
    "title": "Riot spends just $8.3k to mine 1 BTC as it looks to triple production by 2025",
    "url": "https://cryptoslate.com/riot-spends-just-8-3k-to-mine-1-btc-as-it-looks-to-triple-production-by-2025/",
    "description": "<p>Riot, a key player in the Bitcoin mining sector, reported overall revenue of $76.7 million in its financial results for the quarter ending June 30, 2023. This result underscores Bitcoin miner resilience in an unpredictable market, with a significant part of its achievement attributed to a 27% increase in Bitcoin production, as opposed to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/riot-spends-just-8-3k-to-mine-1-btc-as-it-looks-to-triple-production-by-2025/\">Riot spends just $8.3k to mine 1 BTC as it looks to triple production by 2025</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T08:36:46.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T08:28:10.000Z",
    "title": "Analyzing crypto dynamics: Bitcoin whales and InQubeta presale demand",
    "url": "https://crypto.news/analyzing-crypto-dynamics-bitcoin-whales-and-inqubeta-presale-demand/",
    "description": "Recent data has unveiled the intriguing dominance of Bitcoin whales and rising demand in the ongoing InQubeta presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T08:17:03.000Z",
    "title": "Justin Sun makes huge moves amid insolvency allegations",
    "url": "https://crypto.news/justin-sun-makes-huge-moves-amid-insolvency-allegations/",
    "description": "Justin Sun, the founder of Tron and advisor at Huobi, moved hundreds of millions of dollars over the past ten days, while negative news around execs circulated. The blockchain security firm PeckShield noted an Ethereum (ETH) wallet address, labeled as&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T08:35:26.000Z",
    "title": "Shiba Inu Investors Jubilate As Meme Coin Jumps 18% Ahead Of Shibarium Debut",
    "url": "https://www.newsbtc.com/all/shiba-inu-jumps-18-ahead-of-shibarium/",
    "description": "Amidst a more extensive revival in the cryptocurrency market, the value of Shiba Inu has witnessed a significant upward trend today, giving investors of the meme coin a reason to be happy. The surge in its value can be attributed not only to the prevailing favorable feeling in the cryptocurrency industry, but also to a fundamental reason that is bolstering its worth. According to data from the crypto market tracker Coingecko, as of the time of writing, the trading price of SHIB reached $0.00000974, reflecting a notable increase of nearly 3% within the past 24 hours. Furthermore, the data reveals that SHIB has demonstrated a commendable upward trend of 18.2% over the course of the previous seven days. On Wednesday, the cryptocurrency SHIB experienced a significant increase of approximately 5.75%, reaching a value of $0.00001005. This upward movement is part of an ongoing pattern of recovery that commenced two days prior. In aggregate, the price has undergone a reversal of nearly 15% from its most recent nadir of $0.0000947. SHIB price as of Thursday. Source: Coingecko As the situation progressed, it can be observed from an on-chain standpoint that a significant number of the wealthiest addresses associated with Shiba Inu had acquired a notable quantity of SHIB tokens during its recent price recovery over the course of the previous two days. Within the realm of cryptocurrency, specifically in relation to canine-themed currencies, Shiba Inu has garnered substantial interest due to its remarkable surge in popularity. Through a dedicated pursuit of diverse advancements, the network strives to emancipate itself from being narrowly categorized as a mere cryptocurrency associated with memes. One notable example that deserves attention is Shibarium, which distinguishes itself as an innovative layer-2 scaling solution. The diligent endeavors devoted to its creation are approaching the point of realization, with a prospective launch scheduled for the current month. SHIB market cap at $5.73 billion at the time of writing. Chart: TradingView.com The imminent technological milestone is eliciting increased enthusiasm among the community, not just because to the development in technology it represents, but also because of the wider ramifications it may entail. Related Reading: Can Litecoin Bulls Turn The Tide On Recent Declines? A Closer Look Simultaneously, this positive advancement corresponds with a dominant sense of expectation of a significant change in the direction of the asset&#8217;s value. The confluence of Shibarium&#8217;s launch and the anticipated fluctuation in price intersect to generate a juncture of considerable prospective metamorphosis for the ecosystem. The convergence of technological innovation and market dynamics is being closely observed by stakeholders, who are eager to assess the collective influence on the project&#8217;s progress and its market value. The anticipated debut of Shibarium gives SHIB a boost in price. Source: DailyCoin Meanwhile, according to the principal inventor of the pseudonymous memecoin, Shytoshi Kusama, Shiba Inu&#8217;s forthcoming blockchain-based digital identity initiative is expected to offer a wide range of applications that will contribute to the preservation of decentralization. Related Reading: Cardano False Breakdown: Could It Set The Stage For A 26% Climb? The official Twitter account of Shib, an ecosystem within the cryptocurrency space, has made an announcement stating that Kusama intends to incorporate Self-Sovereign Identity (SSI) into all Shiba Inu enterprises. SSI refers to a blockchain-driven identification solution that bears resemblance to digital passports. This solution empowers users with absolute authority over the storage and utilization of their personal identity information. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from VectorStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T08:38:25.000Z",
    "title": "BREAKING: SEC Appeals Court Decision in Ripple Lawsuit Over XRP Sale",
    "url": "https://www.crypto-news-flash.com/breaking-sec-appeals-court-decision-in-ripple-lawsuit-over-xrp-sale/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-sec-appeals-court-decision-in-ripple-lawsuit-over-xrp-sale",
    "description": "<img width=\"800\" height=\"390\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple vs sec\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-300x146.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-768x374.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" />The SEC is appealing a July court decision that ruled XRP is not a security when sold to retail investors. An August 9 letter to Judge Torres outlines the SEC&#8217;s request for an appellate court review, seeking to put the case on hold during the appeal. In a dynamic turn of events, the United States [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T08:36:24.000Z",
    "title": "Aptos Token Surges 12% After Microsoft Partnership to Combine AI and Blockchain",
    "url": "https://www.crypto-news-flash.com/aptos-token-surges-12-after-microsoft-partnership-to-combine-ai-and-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=aptos-token-surges-12-after-microsoft-partnership-to-combine-ai-and-blockchain",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Jump Trading has been acquiring Mask Network (MASK), Lido DAO (LDO), LeverFi (LEVER), and Perpetual Protocol (PERP) over the past week.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Aptos&#8217; cryptocurrency is up 11.6% since announcing a partnership with Microsoft, leveraging their AI tools to enhance Web3 adoption within the financial sector. The partnership will lead to innovations in asset tokenization, on-chain payments, central bank digital currencies, and improved security of the Aptos Network with Microsoft&#8217;s Azure. According to an electrifying statement released on [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T08:20:00.000Z",
    "title": "stETH Worth $10M Purchased by a Whale Over the Past 24 Hours",
    "url": "https://coinedition.com/steth-worth-10m-purchased-by-a-whale-over-the-past-24-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/The-smart-whale-withdrew-10M-DAI-from-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, the on-chain analytics firm, revealed in a tweet today that a whale address withdrew 10 million Dai (DAI) from Maker to purchase 5,403 Lido Staked Ethereum (stETH). According to the post, the whale had purchased the stETH at an average price of $1,851 in the past 24 hours. This is not the first stETH [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/steth-worth-10m-purchased-by-a-whale-over-the-past-24-hours/\">stETH Worth $10M Purchased by a Whale Over the Past 24 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]