[
  {
    "source": "Decrypt",
    "date": "2023-06-08T18:00:30.000Z",
    "title": "A New Type of 'Social Token': PairedWorld Aims to Incentivize Real-World Connection",
    "url": "https://decrypt.co/143872/new-type-social-token-pairedworld-incentivize-real-world-connection",
    "description": "Developed with health experts, PairedWorld is designed to add value to existing NFT communities and encourage physical world interactions."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T17:44:28.000Z",
    "title": "Bitcoin rebound falters amid SEC crackdown on exchanges, raising chance of a BTC price capitulation",
    "url": "https://cointelegraph.com/news/bitcoin-rebound-falters-amid-sec-crackdown-on-exchanges-raising-chance-of-a-btc-price-capitulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0362be0c-f562-4550-b75e-07d39a3ed868.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Regulatory concerns continue to impact the entire crypto market and this week’s BTC options expiry could play a decisive role in pushing Bitcoin price under $26,000. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price lost steam after a failed retest of the $27,400 resistance on June 6, signaling that investors became less confident after the recent regulatory actions by the U.S Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments/amp\">against Binance and Coinbase</a>. Both exchanges are being sued on multiple counts, including failure to register as licensed brokers and offering unregistered securities. </p><h2>The SEC might have a difficult case ahead</h2><p>According to Blockchain Association CEO Kristin Smith, the SEC is<a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments/amp\"> trying to circumvent formal rulemaking processes</a> and deny public engagement. Meanwhile, Insider Intelligence crypto analyst Will Paige said the SEC’s intent is to police the space through enforcement in the absence of a regulatory framework.</p><p>Those criticisms explain why investors may be clinging to their hopes in the<a href=\"https://cointelegraph.com/news/us-financial-services-committee-sets-date-to-discuss-future-of-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-financial-services-committee-sets-date-to-discuss-future-of-crypto/amp\"> U.S. Financial Services Committee hearing</a>, scheduled for June 13.</p><p>The potential overreach of the SEC has caused ripples multiple times,including the U.S. legislative. Senator Bill Hagerty, for instance, stated that the regulating agency is \"weaponizing their role\", and publicly called out the SEC chairman Gary Gensler.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a> is weaponizing their role to kill an industry. Allowing a company to list publicly and then stonewalling their attempts to register is indefensible. <a href=\"https://twitter.com/GaryGensler?ref_src=twsrc%5Etfw\">@GaryGensler</a>, expect to hear from Congress.<a href=\"https://t.co/GdprSW1Yns\">https://t.co/GdprSW1Yns</a></p>— Senator Bill Hagerty (@SenatorHagerty) <a href=\"https://twitter.com/SenatorHagerty/status/1666127979947208722?ref_src=twsrc%5Etfw\">June 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Further supporting the thesis that the cryptocurrency space can function without crypto-banks, as the centralized exchanges are commonly known, is the<a href=\"https://cointelegraph.com/news/sec-coinbase-binance-lawsuits-surge-defi-trading-volumes\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-coinbase-binance-lawsuits-surge-defi-trading-volumes/amp\"> sudden increase in decentralized finance (DeFi) volumes</a>.</p><p>The median trading volume across the top three decentralized exchanges jumped 444% between June 5 and June 7. As DEX volumes surged,<a href=\"https://cointelegraph.com/news/binance-net-outflows-on-ethereum-blockchain-after-sec-lawsui-nansen\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-net-outflows-on-ethereum-blockchain-after-sec-lawsui-nansen/amp\"> net outflows on Binance reached $778 million</a>, the difference between the value of assets entering and exiting the exchange.</p><p>Bitcoin has been trying to claim back the $27,000 support, but that might be harder than expected given the upcoming $670 million weekly option expiry on June 9.</p><h2>Bulls have been caught by surprise with the negative newsflow</h2><p>It is worth noting that the actual open interest for the June 9 expiry will be lower since bulls concentrated their wagers above $27,000. These traders got excessively optimistic after Bitcoin’s price gained 9% between May 25 and May 29, testing the $28,000 resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/712c0fb1-2477-42e6-82f5-01d33515eff5.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin options aggregate open interest for June 9. Source: CoinGlass</em></figcaption></figure><p>The 0.63 put-to-call ratio reflects the imbalance between the $410 million in call (buy) open interest and the $260 million in put (sell) options. However, if Bitcoin’s price remains near $26,500 at 8:00 am UTC on June 9, only $38 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC trades below that level on expiry.</p><p><em>Related:</em><a href=\"https://cointelegraph.com/news/us-district-court-issues-summons-for-binance-ceo-changpen-zhao-over-sec-action\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-district-court-issues-summons-for-binance-ceo-changpen-zhao-over-sec-action/amp\"><em> </em><em>US District Court issues summons for Binance CEO Changpeng Zhao over SEC action</em></a></p><h2>Bitcoin bears aim for sub-$26,000 to increase their payout</h2><p>Below are the four most likely scenarios based on the current price action. The number of options contracts available on June 9 for call (bull) and put (bear) instruments varies depending on the expiry price.</p><p>The imbalance favoring each side constitutes the theoretical profit:</p><ul><li><strong>Between $25,000 and $26,000: </strong>100 calls vs. 5,100 puts. Bears in total control, profiting $125 million.</li><li><strong>Between $26,000 and $27,000:</strong> 1,500 calls vs. 3,900 puts. The net result favors the put (sell) instruments by $65 million.</li><li><strong>Between $27,000 and $28,000:</strong> 4,200 calls vs. 1,300 puts. The net result favors the call (bull) instruments by $80 million.</li><li><strong>Between $28,000 and $29,000: </strong>8,700 calls vs. 700 puts. The net result favors call (bull) instruments by $225 million.</li></ul><p>This crude estimate considers the put options used in bearish bets and the call options exclusively in neutral-to-bullish trades. This oversimplification disregards more complex investment strategies.</p><p>Given that Bitcoin longs using futures contracts were liquidated to the tune of $100 million on June 5, bulls might have less margin required to try pumping the BTC price above the $27,000 mark. Consequently, bears seem closer to scoring a decent profit on Friday's options expiry.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T17:40:00.000Z",
    "title": "Circle hires former CFTC, US Treasury executive as chief legal officer",
    "url": "https://cointelegraph.com/news/circle-taps-former-cftc-us-treasury-executive-for-chief-legal-officer-role",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b8353166-539a-4607-850f-24915e9f341a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Heath Tarbert will serve as the company's chief legal officer and head of corporate affairs, bringing experience with all three branches of government.</p>\n                    <p><p>Stablecoin issuer Circle has loaded its arsenal to fight the ongoing regulatory crackdown on crypto. By July 1, the role of chief legal officer and head of corporate affairs will be filled by Heath Tarbert, a top attorney with a background in all three branches of the United States government.</p><p><a href=\"https://www.prnewswire.com/news-releases/circle-names-heath-tarbert-chief-legal-officer--head-of-corporate-affairs-301844608.html\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a June 8 announcement, Tarbert has served in leadership positions in all three branches of the federal government and across key regulatory agencies, including the Commodity Futures Trading Commission (CFTC), the International Organization of Securities Commissions (IOSCO), the U.S. Treasury, the Financial Stability Board, and the World Bank Group. He also served as special counsel to the U.S. Senate Committee on Banking, Housing and Urban Affairs. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ This morning, <a href=\"https://twitter.com/circle?ref_src=twsrc%5Etfw\">@circle</a> announced that Heath Tarbert is joining us as Chief Legal Officer and Head of Corporate Affairs.  Heath joins Circle from <a href=\"https://twitter.com/citsecurities?ref_src=twsrc%5Etfw\">@citsecurities</a> (Citadel Securities), was former <a href=\"https://twitter.com/CFTC?ref_src=twsrc%5Etfw\">@CFTC</a>  Chair, and worked in <a href=\"https://twitter.com/USTreasury?ref_src=twsrc%5Etfw\">@USTreasury</a>, the <a href=\"https://twitter.com/WhiteHouse?ref_src=twsrc%5Etfw\">@WhiteHouse</a>, the DOJ and <a href=\"https://twitter.com/USSupremeCourt?ref_src=twsrc%5Etfw\">@USSupremeCourt</a></p>&mdash; Jeremy Allaire (@jerallaire) <a href=\"https://twitter.com/jerallaire/status/1666774116567773185?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tarbert joins Circle Securities nearly two years after taking on the role of chief legal officer at Citadel Securities, overseeing global legal, compliance, surveillance, and regulatory affairs. He will succeed Flavia Naves, general counsel at Circle, who reportedly announced a planned separation from the company earlier this year.</p><p>\"The opportunity to welcome Heath's expertise and leadership to our executive team is an extraordinary step in Circle's growth as a global company,\" said Circle's CEO Jeremy Allaire.</p><p>Tarbert's arrival comes amid renewed regulatory uncertainty around crypto in the United States. Earlier this week, the Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">sued cryptocurrency exchanges Coinbase and Binance</a> on various charges. Since the FTX debacle last November, the crypto space has faced regulatory scrutiny, hurting businesses and driving capital abroad.</p><p>In a recent interview with Bloomberg, Allaire <a href=\"https://cointelegraph.com/news/circle-ceo-blames-us-crypto-crackdown-for-declining-usdc-market-cap\">blamed the crypto crackdown by U.S. regulators</a> for the decline in market capitalization of its stablecoin, USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>). Over the past 12 months, USDC's stablecoin market share <a href=\"https://cointelegraph.com/news/usdt-market-share-jumps-amid-economic-uncertainty-usdc-shrinks\">has dropped from 34.88% to 23.05%</a>. The current regulatory environment in the U.S. has favored Tether's USDT stablecoin, whose market share has grown to 65.89% from 47.04% a year ago.</p><p><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Magazine:</em></strong><strong> </strong><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T18:02:35.000Z",
    "title": "Glassnode says US Bitcoin supply fell by 10% since 2022",
    "url": "https://www.cryptopolitan.com/glassnode-says-us-bitcoin-supply-10-2022/",
    "description": "Bitcoin, the world’s largest cryptocurrency, has experienced a significant shift in its geographical distribution, with new research suggesting that the United States has witnessed a decline in Bitcoin ownership during the 2022 bear market. Glassnode, an on-chain analytics firm, recently analyzed Bitcoin’s supply, revealing a noteworthy migration away from the U.S. and towards Asia. Glassnode ... <a title=\"Glassnode says US Bitcoin supply fell by 10% since 2022\" class=\"read-more\" href=\"https://www.cryptopolitan.com/glassnode-says-us-bitcoin-supply-10-2022/\" aria-label=\"More on Glassnode says US Bitcoin supply fell by 10% since 2022\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T17:55:35.000Z",
    "title": "Partnership between Binance and Taiwan law enforcement aims to combat cyber threats",
    "url": "https://crypto.news/partnership-between-binance-and-taiwan-law-enforcement-aims-to-combat-cyber-threats/",
    "description": "As part of its Global Law Enforcement Training Program, Binance has partnered with Taiwan's Criminal Investigation Bureau (CIB) to provide specialized knowledge and support in addressing digital asset-related crime to over 200 law enforcement officers in Taiwan."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T17:46:38.000Z",
    "title": "Lens Protocol raises $15m to foster decentralized social networking",
    "url": "https://crypto.news/lens-protocol-raises-15m-to-foster-decentralized-social-networking/",
    "description": "Aave's Lens Protocol, aspiring to decentralize the social media landscape, has successfully secured $15 million in funding."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T18:00:57.000Z",
    "title": "Bitcoin Bearish Signal: Dormant 1,433 BTC Moves After 10+ Years",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bearish-1433-btc-dormant-10-years-moves/",
    "description": "On-chain data shows a large amount of Bitcoin older than 10 years has suddenly moved today, a sign that could be bearish for the price. Bitcoin Dormant From More Than 10 Years Ago Has Abruptly Moved As pointed out by an analyst in a CryptoQuant post, this movement of dormant coins may be a sign of selling. The relevant indicator here is the &#8220;Spent Output Age Bands&#8221; (SOAB), which tracks the movements that the different age bands are making on the blockchain right now. The &#8220;age bands&#8221; here refer to groups of coins divided based on the total amount of time that they have been sitting still on the network for. In the context of the current discussion, the 10+ years age band is of interest, which is a cohort that includes all coins that haven&#8217;t moved from a single address in more than 10 years. The SOAB metric, when applied for this particular age band, would naturally tell us about the number of coins that investors belonging to this group are transferring at the moment. Related Reading: Bitcoin Contrarians Win As Rebound Occurs Against Crowd Expectations: Santiment Now, here is a chart that shows the trend in the Bitcoin SOAB for the 10+ years age band over the past couple of days: The value of the metric seems to have been quite high in recent hours &#124; Source: CryptoQuant As shown in the above graph, the Bitcoin SOAB for this specific group has registered a large spike during the past day. In total, this surge in the metric has corresponded to around 1,433 BTC moving across wallets on the network. The general cohort for all investors that have been holding their coins since more than 155 days ago is called the &#8220;long-term holder (LTH) group.&#8221; Statistically, the longer an investor holds onto their coins, the less likely they become to sell at any point. Due to this reason, the LTHs are considered the resolute hands of the market. As the movement in question is coming from an investor who had been holding for more than 10+ years, the holder would have been one of the oldest ones among even these LTHs. Related Reading: Bitcoin Realized Loss Remains Low Despite Volatility, What Does This Mean? Such old supply, however, is usually considered to have been lost due to wallet seed phrases becoming inaccessible. This means that there is a big chance that the wallet activation today may have come because of a user rediscovering a previously lost wallet. While movements from the LTHs are usually a bad sign for the market, as they show that even the diamond hands may have lost their belief in Bitcoin, this latest transaction wouldn&#8217;t be reflective of the general sentiment, considering the special circumstances around it if it&#8217;s truly coming from a lost address that has now been recovered. Nonetheless, the transfer is still a probable sign that the coins are being moved around for selling-related purposes, so it&#8217;s possible that the asset may face some bearish impact from the move. BTC Price At the time of writing, Bitcoin is trading around $26,400, down 2% in the last week. Looks like BTC has been consolidating sideways &#124; Source: BTCUSD on TradingView Featured image from Hans-Jurgen Mager on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T18:07:22.000Z",
    "title": "Coinbase Defiant: SEC Expected to Lose as Exchange Keeps Staking Service and Vows to Protect Customers at Any Cost",
    "url": "https://www.crypto-news-flash.com/coinbase-defiant-sec-expected-to-lose-as-exchange-keeps-staking-service-and-vows-to-protect-customers-at-any-cost/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-defiant-sec-expected-to-lose-as-exchange-keeps-staking-service-and-vows-to-protect-customers-at-any-cost",
    "description": "<p>The move by the SEC to charge Binance and Coinbase is expected to push Congress to pass clear crypto regulations to avoid the enforcement actions by Gensler. The Coinbase staking services account for about 3 percent of the exchange revenue collected. The crypto regulatory crackdown in the United States puts Coinbase Global at risk of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/coinbase-defiant-sec-expected-to-lose-as-exchange-keeps-staking-service-and-vows-to-protect-customers-at-any-cost/\">Coinbase Defiant: SEC Expected to Lose as Exchange Keeps Staking Service and Vows to Protect Customers at Any Cost</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T17:58:49.000Z",
    "title": "Binance Launches Summer Internship Program Recording Over 8,000 Applications",
    "url": "https://www.crypto-news-flash.com/binance-launches-summer-internship-program-recording-over-8000-applications/?utm_source=rss&utm_medium=rss&utm_campaign=binance-launches-summer-internship-program-recording-over-8000-applications",
    "description": "<p>Binance launches a ten-week summer internship program. The program selected 23 interns from over 8,000 applicants.  Amidst the troubles with the SEC, Binance, the largest crypto exchange, continues to drive through Web 3.0 adoption with the latest initiative, a 10-week Advanced Management Program (AMP) welcoming 23 interns to train and mentor within the Binance workspace. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/binance-launches-summer-internship-program-recording-over-8000-applications/\">Binance Launches Summer Internship Program Recording Over 8,000 Applications</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T17:39:29.000Z",
    "title": "Polygon and zkEVM Launch to Revolutionize the World, with MATIC Leading ‘Hyper-Blockchainization’ – Will it Propel Price to $5? Report",
    "url": "https://www.crypto-news-flash.com/polygon-and-zkevm-launch-to-revolutionize-the-world-with-matic-leading-hyper-blockchainization-will-it-propel-price-to-5-report/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-and-zkevm-launch-to-revolutionize-the-world-with-matic-leading-hyper-blockchainization-will-it-propel-price-to-5-report",
    "description": "<p>Polygon and its zkEVM innovations have received a new publicity boost from Sandeep Nailwal. Despite the SEC&#8217;s designation of MATIC as a security, its future prospects remain high. The launch of Polygon (MATIC) and its zkEVM development has played a crucial role in the progress of Web3, bringing significant advancements and addressing key challenges in [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-and-zkevm-launch-to-revolutionize-the-world-with-matic-leading-hyper-blockchainization-will-it-propel-price-to-5-report/\">Polygon and zkEVM Launch to Revolutionize the World, with MATIC Leading &#8216;Hyper-Blockchainization&#8217; &#8211; Will it Propel Price to $5? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T18:05:23.000Z",
    "title": "Rich Dad Poor Dad Author Says Biggest Ever Real Estate Crash Coming, Calls BTC and Precious Metals the Answer",
    "url": "https://dailyhodl.com/2023/06/08/rich-dad-poor-dad-author-says-biggest-ever-real-estate-crash-coming-calls-btc-and-precious-metals-the-answer/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/rich-dad-alarm.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Rich Dad Poor Dad author Robert Kiyosaki is again predicting that the real estate sector will crash and cause a severe global financial crisis. The former best-selling author says that 2023 will see a worse economic downturn than the global financial crisis (GFC) of 2008, caused by an imploding commercial real estate market. Kiyosaki cites [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/rich-dad-poor-dad-author-says-biggest-ever-real-estate-crash-coming-calls-btc-and-precious-metals-the-answer/\">Rich Dad Poor Dad Author Says Biggest Ever Real Estate Crash Coming, Calls BTC and Precious Metals the Answer</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]