[
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T07:00:00.000Z",
    "title": "Pro-crypto Bills Passed by U.S. Congressional Committee",
    "url": "https://cryptodaily.co.uk/2023/07/pro-crypto-bills-passed-by-us-congressional-committee",
    "description": "<p class=\"md-end-block md-p\">The United States&rsquo; House Financial Services Committee passed two crucial bills that could pave the way for regulatory clarity.</p>\n<p class=\"md-end-block md-p\">In a 35-15 vote, the Financial Services Committee of the U.S. Congress approved, with bipartisan support, the Financial Innovation and Technology for the 21st Century Act which would &ldquo;establish clear principles to ensure financial security and certainty as digital asset developers continue to innovate.&rdquo;</p>\n<p class=\"md-end-block md-p\">Introduced sometime in July 2020, the bill crucially sets definitions on whether a digital asset is a security or a commodity and whether a cryptocurrency firm would have to register under the Commodities Futures Trading Commission (CFTC) or under the Securities and Exchange Commission (SEC). The bill also crucially sets a process for assets previously labeled as securities to be re-labeled as commodities.</p>\n<p class=\"md-end-block md-p\">Another bill that was passed by the committee was the Blockchain Regulatory Certainty Act, a bipartisan bill authored by Rep. Tom Emmer and Rep. Darren Soto. The bill aims to remove unnecessary regulation for blockchain developers and service providers. In a tweet thread celebrating the bill&rsquo;s passage, Emmer said that &ldquo;the BRCA provides the digital asset ecosystem regulatory certainty to keep innovating in the United States so the future digital economy reflects American values.&rdquo;</p>\n<p class=\"md-end-block md-p md-focus\">Together, the two bills could pave the way for regulatory clarity in terms of distinguishing between commodities and securities. They will also define strict jurisdictions for regulatory agencies. As one might recall, the Gary Gensler-led SEC has been particularly zealous and high-strung with regards to digital assets, claiming that all digital assets are securities and therefore fall under the agency&rsquo;s control. Its regulation-by-enforcement approach has been detrimental for investors and the growth of the cryptocurrency industry. </p>\n<p class=\"md-end-block md-p\">However, the passage of the two bills is but the first step in this apparently uphill battle. The cryptocurrency community should still keep a watchful eye on how the subsequent proceedings will unfold.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T06:59:03.000Z",
    "title": "Microsoft and Google Surpass Earnings Expectations Amid AI Frenzy",
    "url": "https://www.cryptopolitan.com/microsoft-and-google-earnings-ai/",
    "description": "Tech giants Microsoft and Google have delivered remarkable earnings on July 25, surpassing expectations and igniting investor excitement amid a surge in artificial intelligence&#8217;s influence in the technology sector. As the dust settles from the challenges posed by the pandemic, the release of ChatGPT, an AI-based language model, has invigorated these companies&#8217; financial performance and ... <a title=\"Microsoft and Google Surpass Earnings Expectations Amid AI Frenzy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-and-google-earnings-ai/\" aria-label=\"More on Microsoft and Google Surpass Earnings Expectations Amid AI Frenzy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T06:59:00.000Z",
    "title": "The Emergence of Chief AI Officers: Navigating AI Implementation and Ethical Challenges",
    "url": "https://www.cryptopolitan.com/the-emergence-of-chief-ai-officers/",
    "description": "As the influence of AI expands across all sectors of business, the question of whether companies should appoint a Chief AI Officer (CAIO) has become increasingly vital. Recognizing the potential of AI to transform their operations, many organizations are considering creating this new C-suite position. This article explores the role and skills defining a CAIO ... <a title=\"The Emergence of Chief AI Officers: Navigating AI Implementation and Ethical Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-emergence-of-chief-ai-officers/\" aria-label=\"More on The Emergence of Chief AI Officers: Navigating AI Implementation and Ethical Challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T06:56:56.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $90.95. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been an increase in the LTC price by 0.39% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T06:55:40.000Z",
    "title": "Democratic Presidential Candidate Invests Significantly in Bitcoin for His Children",
    "url": "https://www.cryptopolitan.com/presidential-candidate-bitcoin-investment/",
    "description": "In a bold move to demonstrate his unwavering support for the burgeoning world of cryptocurrency, Democratic presidential candidate Robert F. Kennedy Jr. made headlines by revealing a substantial Bitcoin investment earlier this year. Acknowledging the criticism he received for advocating the adoption of the digital asset without personal involvement, Kennedy has now taken action by ... <a title=\"Democratic Presidential Candidate Invests Significantly in Bitcoin for His Children\" class=\"read-more\" href=\"https://www.cryptopolitan.com/presidential-candidate-bitcoin-investment/\" aria-label=\"More on Democratic Presidential Candidate Invests Significantly in Bitcoin for His Children\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T07:04:40.000Z",
    "title": "One Catalyst Could Trigger Bitcoin To Explode by Over 350% Within the Next Nine Months, Says Fundstrat’s Tom Lee",
    "url": "https://dailyhodl.com/2023/07/27/one-catalyst-could-trigger-bitcoin-to-explode-by-over-350-within-the-next-nine-months-says-fundstrats-tom-lee/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Catalyst-Could-Cause-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fundstrat Global Advisors’ managing partner Tom Lee is predicting that Bitcoin (BTC) could hit six figures before the halvening scheduled for 2024. Lee says in a research note that the approval of a spot Bitcoin exchange-traded fund (ETF) could trigger BTC to rally to between $140,000 and $180,000 before next year in April. Such a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/one-catalyst-could-trigger-bitcoin-to-explode-by-over-350-within-the-next-nine-months-says-fundstrats-tom-lee/\">One Catalyst Could Trigger Bitcoin To Explode by Over 350% Within the Next Nine Months, Says Fundstrat’s Tom Lee</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]