[
  {
    "source": "NewsBTC",
    "date": "2023-11-09T05:00:39.000Z",
    "title": "Ripple CEO Declares Intent To Bring XRP Battle To Supreme Court",
    "url": "https://www.newsbtc.com/news/ripple/ripple-ceo-declares-intent-to-bring-xrp-battle-to-supreme-court/",
    "description": "In a recent speech at the DC Fintech Week conference, Ripple CEO Brad Garlinghouse addressed the company&#8217;s regulatory hurdles. He expressed his views on the cryptocurrency landscape in the United States.  Ripple CEO Warns Of US Risking Market Share Loss According to a Fortune Magazine report, Garlinghouse acknowledged during his speech that despite Ripple&#8217;s success in court against the SEC, some US banks must be more cautious about engaging meaningfully with cryptocurrencies.  Garlinghouse attributed this reluctance to the perception that the US government and the Office of the Comptroller of the Currency (OCC) are “hostile to the crypto industry.”  While Ripple&#8217;s court victory in July was seen as a positive development, Garlinghouse believes that the SEC&#8217;s overall approach, coupled with Chairman Gary Gensler&#8217;s characterization of crypto as the &#8220;Wild West,&#8221; is hindering the industry&#8217;s growth in the US. Related Reading: Bitcoin Parabolic Rally Above $600,000: Crypto Analyst Says It’s Closer Than You Think Garlinghouse emphasized that while the US has hostility towards crypto, other countries actively welcome crypto companies and investments by providing clear regulatory policies.  As a result, the US risks losing its market share and failing to capitalize on its early advantage in the crypto space. Garlinghouse expressed his belief that the US can still become a leader in the industry but highlighted the urgency for clear and constructive regulatory frameworks to be established. CEO Vows To Escalate Legal Battle With SEC To Supreme Court Given the challenges faced in the US, Garlinghouse announced that Ripple would continue to expand its operations in other countries. He revealed that 80% of Ripple&#8217;s hiring in the current year will be conducted outside of the US, reflecting the company&#8217;s need to operate in more favorable regulatory environments.  Garlinghouse emphasized the importance of creating a hospitable environment for innovation and growth, suggesting that the current hostility in the US hinders Ripple&#8217;s ability to operate effectively within the country. During the conference, Garlinghouse expressed his willingness to escalate Ripple&#8217;s legal battle with the SEC to the Supreme Court.  Garlinghouse stated that Ripple is prepared to pursue legal avenues until a resolution is reached. This firm stance underscores Ripple&#8217;s commitment to addressing regulatory uncertainties surrounding XRP. Related Reading: Can Chainlink Reach $20 With Rollup Finance Partnership? Brad Garlinghouse&#8217;s remarks at the DC Fintech Week conference shed light on the ongoing regulatory challenges faced by Ripple and the wider cryptocurrency industry in the United States.  Despite recent court victories, Ripple encounters obstacles due to perceived hostility and a lack of clear policy guidance. Garlinghouse&#8217;s readiness to escalate the legal battle to the Supreme Court demonstrates Ripple&#8217;s determination to seek a resolution and establish a constructive regulatory framework. As Ripple expands its operations globally, the hope remains that the US will adopt more welcoming and supportive regulations to foster innovation and maintain its competitive edge in the evolving cryptocurrency landscape. As of the current market update, XRP is trading at $0.6902, indicating sideways price movement over the past 24 hours. However, in the fourteen-day timeframe, the token has experienced a notable gain of 13%.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T04:48:37.000Z",
    "title": "ADA Price Prediction – Cardano Could See “Face Ripping” Rally",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-prediction-cardano-rally-0-40/",
    "description": "Cardano (ADA) is gaining pace above the $0.350 resistance. ADA is showing heavy bullish signs and might rally toward $0.400 or even $0.420. ADA price outperformed Bitcoin and rallied above the $0.350 resistance. The price is trading above $0.350 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $0.3505 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could accelerate higher toward the $0.400 level or even $0.420. Cardano Price Rally Seems Far From Over In the past few days, Cardano saw a decent increase from the $0.2850 support. It is up over 20% and broke many hurdles near the $0.350 resistance zone, outperforming Bitcoin and Ethereum. The upward move was such that the price spiked toward $0.3750. A high was formed near $0.3755 before there was a downside correction. The price declined below the $0.3550 support. It spiked below the 23.6% Fib retracement level of the upward move from the $0.2845 swing low to the $0.3755 high. However, the bulls were active above the $0.3400 zone. There is also a key bullish trend line forming with support near $0.3505 on the 4-hour chart of the ADA/USD pair. Source: ADAUSD on TradingView.com ADA is now trading above $0.350 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.3750 zone. The first resistance is near $0.380. The next key resistance might be $0.400. If there is a close above the $0.400 resistance, the price could extend its rally. In the stated case, the price could rise toward the $0.420 region. Are Dips Limited in ADA? If Cardano’s price fails to climb above the $0.3750 resistance level, it could start a downside correction. Immediate support on the downside is near the $0.3550 level. The next major support is near the $0.350 level and the trend line. A downside break below the $0.350 level could open the doors for a test of the 50% Fib retracement level of the upward move from the $0.2845 swing low to the $0.3755 high at $0.3300. The next major support is near the $0.3080 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now above the 50 level. Major Support Levels – $0.355, $0.350, and $0.330. Major Resistance Levels – $0.375, $0.400, and $0.420."
  }
]