[
  {
    "source": "CoinDesk",
    "date": "2023-07-13T11:46:50.000Z",
    "title": "Early Shiba Inu Holder With 10% of Supply Moves $30M in SHIB Tokens",
    "url": "https://www.coindesk.com/markets/2023/07/13/early-shiba-inu-holder-with-10-of-supply-moves-30m-in-shib-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Data shows most SHIB market depth is under $1 million on various crypto exchanges, and a sell order of that value could move token prices by 2% immediately."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T11:53:00.000Z",
    "title": "Blockchain Association Demands SEC-Prometheum Investigation",
    "url": "https://cryptodaily.co.uk/2023/07/blockchain-association-demand-sec-prometheum-investigation",
    "description": "<p>The Blockchain Association has alleged that Prometheum&rsquo;s Broker-Dealer license approval by the SEC is part of a &ldquo;sweetheart deal&rdquo; between the two.&nbsp;</p>\nBA Appeals To SEC Inspector\n<p>Prometheum Ember Capital, a Special Purpose Broker-Dealer (SPBD), has come under scrutiny due to potential impropriety surrounding its approval by the Securities and Exchange Commission (SEC).&nbsp;</p>\n<p>The Blockchain Association (BA), a leading nonprofit organization advocating for a pro-innovation policy environment for the digital asset economy, has called for an investigation by the SEC's Office of Inspector General, Deborah Jeffrey.&nbsp;</p>\n<p>The group has alleged that Prometheum has benefitted from a &ldquo;sweetheart deal&rdquo; with the regulatory body, in which the former received license approval in return for co-CEO Aaron Kaplan&rsquo;s testimony in the House Financial Services Committee in June.</p>\nHow Did Prometheum Obtain SEC Approval?\n<p>The SEC has maintained an overtly hostile approach towards the digital assets industry, motivated by its Chair Gary Gensler's stance that all digital assets, except for Bitcoin, should be classified as securities.</p>\n<p>Amidst this hostility, Prometheum managed to obtain a first-of-its-kind license to operate as an SPBD, raising ethical concerns from several US lawmakers considering the circumstances surrounding it. The fact that the company has no working product or asset listings goes against the SEC&rsquo;s recent actions against Coinbase and Binance, where it deemed that exchange, clearing, and broker-dealer functions should be separated into distinct entities.&nbsp;</p>\nBA Alleges &ldquo;Sweetheart Deal&rdquo;&nbsp;\n<p>In an effort to shed light on these matters, the Blockchain Association submitted a request under the Freedom of Information Act to the Commission on June 16, 2023, seeking relevant documents and communications. As the industry awaits answers, the Association urges the Office of Inspector General to initiate an investigation to uncover any impropriety or confirm the absence of any wrongdoing in these allegations. The investigation will serve to address the concerns raised and ensure transparency and fairness within the digital asset industry.</p>\n<p>The group has alleged that Prometheum received preferential treatment from the SEC because co-CEO Aaron Kaplan had testified before the Congress supporting the SEC&rsquo;s stance that new legislation for digital assets is unnecessary.</p>\n<p>The association writes,</p>\n\n<p>&ldquo;Prometheum&hellip;promotes the same false narrative propounded by Chair Gensler that there exists a clear pathway to registration for digital assets and legislation is unnecessary. Echoing this narrative, on June 13, 2023, co-CEO of Prometheum, Aaron Kaplan, testified before Congress, stating that new legislation is not in the best interest in the investing public or blockchain industry.&rdquo;</p>\n\n&ldquo;SEC Chair Impeding Legislation Efforts&rdquo;: BA\n<p>Representing over 100 member companies like Circle, Kraken, and Digital Currency Group in the blockchain industry, the Blockchain Association aims to promote regulatory clarity and educate policymakers, regulators, courts, and the public about the benefits of blockchain technology.</p>\n<p>The Association is particularly concerned that Chair Gensler is using Prometheum and the SPBD licensure process to impede congressional efforts toward legislation by perpetuating the false narrative that the law is already clear regarding digital asset securities.&nbsp;&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T11:58:22.000Z",
    "title": "EU regulator issues dire warning on crypto",
    "url": "https://www.cryptopolitan.com/eu-regulator-issues-dire-warning-on-crypto/",
    "description": "The European Securities and Markets Authority (ESMA) has issued a warning to the cryptocurrency industry following the release of its initial proposals for the Markets in Crypto-Assets (MiCA) regulation. The proposed regulations primarily focus on conflict-of-interest rules and the handling of customer complaints by crypto-asset service providers (CASPs). Verena Ross, the chairperson of ESMA, emphasized ... <a title=\"EU regulator issues dire warning on crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-regulator-issues-dire-warning-on-crypto/\" aria-label=\"More on EU regulator issues dire warning on crypto\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T11:55:50.000Z",
    "title": "TETHER Became a General Sponsor of DEGAMEFI WEB3 CONFERENCE 2023",
    "url": "https://www.crypto-news-flash.com/tether-became-a-general-sponsor-of-degamefi-web3-conference-2023/?utm_source=rss&utm_medium=rss&utm_campaign=tether-became-a-general-sponsor-of-degamefi-web3-conference-2023",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_1200__720_px_1689246605EqCuRRNq7r.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_1200__720_px_1689246605EqCuRRNq7r.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_1200__720_px_1689246605EqCuRRNq7r-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_1200__720_px_1689246605EqCuRRNq7r-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_1200__720_px_1689246605EqCuRRNq7r-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Tbilisi, Georgia, July 13th, 2023, Chainwire The strongest web3 community in the CIS region- DEGAMEFI is set to host the largest web3 annual conference in the Caucasus region. The DEGAMEFI WEB3 CONFERENCE 2023 is scheduled to take place in Tbilisi, Georgia from the 7th to the 8th of October. This conference attracts a diverse range [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-13T11:45:22.000Z",
    "title": "Bloomberg Analyst Mike McGlone Issues Bitcoin Alert, Warns One Thing Could Create Headwinds for BTC",
    "url": "https://dailyhodl.com/2023/07/13/bloomberg-analyst-mike-mcglone-issues-bitcoin-alert-warns-one-thing-could-create-headwinds-for-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/bloomberg-bitcoin-relationship-commodities.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence’s senior macro strategist Mike McGlone is warning that Bitcoin (BTC) may run into strong headwinds this year. McGlone tells his 58,800 Twitter followers that a US economic recession is likely coming soon and it could drag down risk assets like Bitcoin and other cryptos. “Notably Negative Liquidity vs. Bouncing Bitcoin – Recessions typically [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/13/bloomberg-analyst-mike-mcglone-issues-bitcoin-alert-warns-one-thing-could-create-headwinds-for-btc/\">Bloomberg Analyst Mike McGlone Issues Bitcoin Alert, Warns One Thing Could Create Headwinds for BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]