[
  {
    "source": "Decrypt",
    "date": "2023-11-16T19:55:25.000Z",
    "title": "Ubisoft Will Give Away Free Ethereum NFTs for 'Champions Tactics' Game",
    "url": "https://decrypt.co/206381/ubisoft-free-ethereum-nft-giveaway-champions-tactics-game",
    "description": "Assassin’s Creed maker Ubisoft says it will host a free Ethereum NFT mint for Champions Tactics, its upcoming game on Oasys."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T20:00:00.000Z",
    "title": "Meta introduces AI models for video generation, image editing",
    "url": "http://cointelegraph.com/news/meta-introduces-ai-models-artificial-intelligence-video-generation-image-editing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/bc6ff69d-7ecb-486a-a103-ad68975b6d80.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Social media company Meta is developing new AI-based tools for Facebook and Instagram users </p>\n                    <p><p>Social media giant Meta has introduced its latest artificial intelligence (AI) models for content editing and generation, <a href=\"https://ai.meta.com/blog/emu-text-to-video-generation-image-editing-research\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a blog post on Nov. 16. </p><p>The company is introducing two AI-powered generative models. The first, Emu Video, which leverages Meta's previous Emu model, is capable of generating video clips based on text and image inputs. While the second model, Emu Edit, is focused on image manipulation, promising more precision in image editing.</p><p>The models are still in the research stage, but Meta says their initial results show potential use cases for creators, artists and animators alike.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f4f1b07b-95b8-46e3-bd6c-050124c3107c.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Meta displays its new generative model Emu Edit. Source: Meta</em></figcaption></figure><p>According to Meta's blog post, the Emu Video was trained with a “factorized” approach, dividing the training process into two steps to allow the model to be responsive to different inputs:</p><blockquote>\"We’ve split the process into two steps: first, generating images conditioned on a text prompt, and then generating video conditioned on both the text and the generated image. This “factorized” or split approach to video generation lets us train video generation models efficiently.\"</blockquote><p>Based on a text prompt, the same model can \"animate\" images. According to Meta, instead of relying on a \"deep cascade of models\", Emu Video only uses two diffusion models to generate 512x512 four-second long videos at 16 frames per second. </p><p>Emu Edit, focused on image manipulation, will allow users to remove or add backgrounds to images, perform color and geometry transformations, as well as local and global editing of images.</p><p>\"We argue that the primary objective shouldn’t just be about producing a “believable” image. Instead, the model should focus on precisely altering only the pixels relevant to the edit request,\" Meta noted, claiming its model is able to precisely follow instructions:</p><blockquote>\"For instance, when adding the text “Aloha!” to a baseball cap, the cap itself should remain unchanged.\"</blockquote><p>Meta trained Emu Edit using computer vision tasks with a dataset of 10 million synthesized images, each with an input image and a description of the task, as well as the targeted output image. \"We believe it’s the largest dataset of its kind to date,\" the company said. </p><p>Meta's newly released Emu model was trained using 1.1 billion pieces of data, including photos and captions shared by users on Facebook and Instagram, CEO Mark Zuckerberg <a href=\"https://cointelegraph.com/news/meta-ai-ceo-mark-zuckerberg-unveil-chatbot-rayban-metaverse\">revealed during the Meta Connect event</a> in September.</p><p>Regulators are closely scrutinizing Meta's AI-based tools, resulting in a cautious deployment approach by the technology company. Recently, Meta <a href=\"https://cointelegraph.com/news/meta-bans-usage-generative-ai-tools-political-advertisers\">disclosed it won't allow political campaigns and advertisers</a> to use its AI tools to create ads on Facebook and Instagram. The platform's general advertising rules, however, do not include any rules addressing AI specifically.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T19:58:54.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Vivek Ramaswamy unveils “The Three Freedoms of Crypto,” further shoring up his “crypto candidate” status in the U.S. presidential race. Meanwhile, BlackRock filed a Form S-1 with the United States Securities and Exchange Commission (SEC) a week after registering its iShares Ethereum Trust with Delaware’s Division of Corporations. And Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) jumped 20% after ARK’s Cathie Wood sang its praises on CNBC.</p><h2>Vivek Ramaswamy unveils “The Three Freedoms of Crypto,” further shoring up his “crypto candidate” status in the U.S. presidential race</h2><p>Republican U.S. Presidential candidate Vivek Ramaswamy recently <a href=\"https://cointelegraph.com/news/vivek-ramaswamy-unveils-cryptocurrency-policy-platform-criticizing-mixer-sanctions\">unveiled his crypto policy framework</a>, dubbed “The Three Freedoms of Crypto,” at the North American Blockchain Summit (NABS) in Fort Worth, Texas.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Rolling out my “Three Freedoms of Crypto” policy framework at the North American Blockchain Summit this morning in Texas. Since the inception of crypto, the shadow government in the administrative state in Washington, D.C., and its cronies on Wall Street have tried to quash its… <a href=\"https://t.co/eo2oUTlVMf\">pic.twitter.com/eo2oUTlVMf</a></p>&mdash; Vivek Ramaswamy (@VivekGRamaswamy) <a href=\"https://twitter.com/VivekGRamaswamy/status/1725169156557828097?ref_src=twsrc%5Etfw\">November 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A key point in the politician’s message involves the use of so-called crypto mixers, a technique that allows cryptocurrency senders to obfuscate who is receiving funds. According to Ramaswamy, these mixers are a fundamental American right tied to the First Amendment of the U.S. Constitution. </p><p>As Ramaswamy put it: </p><blockquote>“I believe code is a form of speech.”</blockquote><h3>BlackRock files S-1 form for spot Ether ETF with SEC</h3><p>BlackRock, the world’s largest asset manager, officially filed <a href=\"https://cointelegraph.com/news/blackrock-files-s1-form-for-spot-ether-etf-with-sec\">for a spot Ether exchange-traded fund</a> (ETF) with the SEC on Nov. 15.</p><p>The Ether ETF, dubbed the iShares Ethereum Trust, aims to “reflect generally the performance of the price of Ether,” read the S-1 filed with the SEC. The iShares brand is associated with BlackRock's ETF products, with its Bitcoin ETF called the iShares Bitcoin Trust. The trust appoints Coinbase as the custodian for the underlying ETH.</p><p>The move by BlackRock comes nearly a week after it registered the iShares Ethereum Trust with Delaware’s Division of Corporations and almost six months after it filed its spot Bitcoin ETF application.</p><h3>SOL pops 20% day after Cathie Wood praises network </h3><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) reached new yearly highs and gained over 17% the day after ARK Invest CEO <a href=\"https://cointelegraph.com/news/solana-price-jumps-cathie-wood-ark-invest-ethereum-comparison\">Wood lauded the network</a> for its efficiency and cost-effectiveness over Ethereum.</p><p>In a Nov.15 CNBC interview, Wood hailed the Solana network as a major infrastructure player in the wider blockchain ecosystem and added it had been doing a “really good job” in the recent market conditions.</p><blockquote>“Ether  was faster and cheaper than Bitcoin in the day — that’s how we got Ether. Solana is even faster and cost-effective than Ether”</blockquote><p>Wood described Ethereum and Solana as crucial infrastructure layers —  capable of more real-world applications than Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>The broader crypto market is on the up, but Solana’s gains have significantly outpaced other major cryptocurrencies with monthly gains of 197%.</p><p>Wood also riffed on the current market hype for a spot Bitcoin ETF and said there might be a “sell on the news” event — with  investors’ anticipation of an approval outpacing the market demand for an ETF.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-16T19:39:38.000Z",
    "title": "Tether Reveals Bitcoin Mining Expansion With $500 Million Investment",
    "url": "https://cryptobriefing.com/tether-bitcoin-mining-expansion-500-million-investment/?utm_source=feed&utm_medium=rss",
    "description": "Tether plans $500M investment in Bitcoin mining, building facilities in Uruguay, Paraguay, El Salvador to reach 1% of network power."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T19:46:55.000Z",
    "title": "Aave parent company rebrands to Avara, adds crypto Family Wallet to offerings",
    "url": "https://crypto.news/aave-parent-company-rebrands-to-avara-adds-crypto-wallet-family-to-offerings/",
    "description": "Founder Stani Kulechov said the name change does not affect Aave as a lending protocol and that its latest acquisition focuses on propelling mass web3 adoption."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T19:59:32.000Z",
    "title": "Howling At The Moon: 23,000% Dogecoin Signal Reawakens",
    "url": "https://www.newsbtc.com/news/dogecoin/howling-at-the-moon-23000-dogecoin-signal-reawakens/",
    "description": "Dogecoin holders are howling for the popular meme cryptocurrency to reach &#8220;the moon&#8221; and they just might get it. That&#8217;s because a parabolic technical signal is back that last appeared prior to a stunning 23,000% rally. Keep reading to learn more about the signal and what this could mean for DOGE. Dogecoin Tags Parabolic SAR: Another 23,000% Surge Ahead? During the last crypto bull market, Dogecoin was on of the standout stars, outperforming Bitcoin, Ethereum, and most other altcoins. Driven by meme mania, stimulation checks, and Elon Musk tweets, DOGE made a lot of people a lot of money. Prior to the bull run in 2020, the Doge-inspired meme coin spent over three years in a downtrend. Right before the breakout that sent Dogecoin soaring DOGEUSD price action had tapped the 1M Parabolic SAR. Related Reading: Dogecoin Vs. Shiba Inu: Which Meme Coin Is More Profitable For Holders? Not even one year after the monthly Parabolic SAR was tagged on the USD trading pair, Dogecoin put in over a 23,000% rally before reaching a peak in 2021. The Parabolic SAR has been triggered &#124; DOGEUSD on TradingView.com Can The Parabolic SAR Revive Meme Coin Season Once Again? The Parabolic SAR is a technical indicator designed by J. Welles Wilder, Jr. responsible for creating other popular tools like the Relative Strength Index, Average Directional Index, and Average True Range. The acronym SAR stands for Stop and Reverse, and the tool&#8217;s intention is to tell an analyst when a trend has potentially stopped and reversed. In 2020, the signal in Dogecoin indeed was the final point before the downtrend stopped and reversed up to new highs. Now that the signal has been triggered again, what type of move might we be able to expect from the meme coin? Related Reading: Dogecoin Price Prediction for 2023, 2024, 2025, 2030 &#38; Beyond As stated, the last time it was tagged DOGEUSD rallied more than 23,000%. The Parabolic SAR was also hit on the 1M timeframe in April 2017 just before another 6,200% rally. An average of the two major rallies suggests a possible 14,600% surge. However, Elliott Wave Principle points to the first wave of any cycle being similar in magnitude as the final wave – hinting at another 6,200% ROI if an uptrend does materialize from here. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-16T19:45:16.000Z",
    "title": "$4,949,000,000 in Penalties Collected by the SEC in 2023 Amid Rise of Enforcement Actions",
    "url": "https://dailyhodl.com/2023/11/16/4949000000-in-penalties-collected-by-the-sec-in-2023-amid-rise-of-enforcement-actions/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/raked-in-by-sec.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US securities regulators are obtaining significant amounts in financial remedy orders from enforcement actions filed against actors accused of engaging in abusive trading practices. In a statement, the U.S. Securities and Exchange Commission (SEC) says that during the fiscal year 2023, it initiated a total of 784 enforcement actions, marking an increase of 3% from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/16/4949000000-in-penalties-collected-by-the-sec-in-2023-amid-rise-of-enforcement-actions/\">$4,949,000,000 in Penalties Collected by the SEC in 2023 Amid Rise of Enforcement Actions</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-16T19:41:14.000Z",
    "title": "BlackRock Files for a Spot Ethereum ETF With the SEC Months After Applying for a Similar Bitcoin Product",
    "url": "https://dailyhodl.com/2023/11/16/blackrock-files-for-a-spot-ethereum-etf-with-the-sec-months-after-applying-for-a-similar-bitcoin-product/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/traders-sleeping-blackrock.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest investment firm in the world is filing for a spot market Ethereum (ETH) exchange-traded fund (ETF) with the U.S. Securities and Exchange Commission (SEC) months after applying for a spot Bitcoin (BTC) ETF. In a new filing, BlackRock – which has over $8 trillion in assets under its management – is seeking the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/16/blackrock-files-for-a-spot-ethereum-etf-with-the-sec-months-after-applying-for-a-similar-bitcoin-product/\">BlackRock Files for a Spot Ethereum ETF With the SEC Months After Applying for a Similar Bitcoin Product</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]