[
  {
    "source": "CoinDesk",
    "date": "2023-06-19T07:54:57.000Z",
    "title": "Ethereum Layer 2 Network zkSync Era's Locked Value Surpasses $500M",
    "url": "https://www.coindesk.com/markets/2023/06/19/ethereum-layer-2-solution-zksync-era-surpasses-500m-in-tvl/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The total value locked has increased by 12% in one week, according to data source L2Beat."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-19T07:52:47.000Z",
    "title": "Hinman Documents Release in SEC-Ripple Case Is a Boost to Ether: JPMorgan",
    "url": "https://www.coindesk.com/policy/2023/06/19/hinman-documents-release-in-sec-ripple-case-is-a-boost-to-ether-jpmorgan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The documents are likely to intensify the move among major cryptocurrencies to become more decentralized and look more like ether, the report said."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-19T07:51:43.000Z",
    "title": "Solana (SOL) Price Analysis – 19 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/solana-sol-price-analysis-19-june-2023/",
    "description": "Introduction This report provides an analysis of the cryptocurrency Solana (SOL) based on the latest data as of 19 June 2023. The analysis includes a review of the current price, volume, bid/ask prices, day’s range, technical indicators, and moving averages. Solana has seen some interesting movements recently, and this report aims to provide insights into […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T07:40:00.000Z",
    "title": "Crypto Community Donates $1 Million To ZachXBT Following Lawsuit",
    "url": "https://cryptodaily.co.uk/2023/06/crypto-community-donates-1-million-to-zachxbt-following-lawsuit",
    "description": "<p>The crypto community has rallied behind respected blockchain sleuth ZachXBT just days after disclosing a lawsuit related to a previous investigation.&nbsp;</p>\n<p>Donations to ZachXBT have poured in from across the crypto community and have crossed over $1 million so far to help fund his legal defense.&nbsp;</p>\nDonations Pour In&nbsp;\n<p>Following the disclosure of the lawsuit, the blockchain sleuth posted a digital wallet address on his official Twitter handle, along with details of the lawsuit filed against him by Jeffrey Huang. Huang is a Taiwanese-American musician and tech entrepreneur. ZachXBT described the lawsuit as troubling and called it a &ldquo;David and Goliath&rdquo; story.&nbsp;</p>\n\n<p>&ldquo;It&rsquo;s unfortunate I have to make this thread, but I am being sued by MachiBigBrother for an article I published in June 2022. Today Machi filed a defamation lawsuit. The lawsuit is baseless and an attempt to chill free speech. I intend to fight back &amp; defend free speech.&rdquo;</p>\n\n<p>ZachXBT noted that his legal expenses could cost more than $1 million. However, in an example of how tight-knit the crypto community is, donations poured in, and within a day, ZachXBT&rsquo;s donation wallet accumulated digital assets worth beyond the stated goal. According to Nansen Portfolio, a majority of donations primarily consisted of stablecoins. ZachXBT added that any leftover funds would be returned back to the donors on a pro-rata basis.&nbsp;</p>\n\n<p>&ldquo;I am creating a donation address to assist with legal costs associated with the defense of this matter, which could easily exceed $1m USD. All leftover funds will be returned on a pro-rata basis to contributors.&rdquo;</p>\n\n<p>Currently, the wallet contains over $650,000 worth of USDC, $274,000 worth of Tether, and several other cryptocurrencies, such as Ethereum (ETH) and Polygon (MATIC).&nbsp;</p>\nProminent Names Step In To Help\n<p>Several users from a number of cryptocurrency exchanges also donated towards the effort, with ZachXBT&rsquo;s donation wallet receiving funds from wallets linked to all major exchanges such as Binance, Kraken, OKX, Coinbase, Bitfinex, Bybit, 1inch, and Uniswap. Donations under the $100 mark number in the thousands, while several donations are between $10,000 and $50,000, as several prominent members from the crypto ecosystem also chipped in.&nbsp;</p>\n<p>Binance CEO Changpeng Zhao also made a donation of $50,000, urging ZachXBT to keep up the fight and help keep crypto transparent. The donation from Zhao comes even as the Binance CEO is himself grappling with a lawsuit filed by the United States Securities and Exchange Commission. Meanwhile, Tron founder Justin Sun also donated $10,000 worth of the True USD stablecoin. Sun also highlighted ZachXBT&rsquo;s role in educating the crypto community, stating,&nbsp;</p>\n\n<p>&ldquo;I&rsquo;m pleased to pledge a donation of 10k #TUSD to @zachxbt. Despite not being a legal expert myself, I highly value Zach&rsquo;s substantial contributions to blockchain security and his crucial role in guiding our users to safeguard their funds.&rdquo;</p>\n\nThe Lawsuit Against ZachXBT&nbsp;\n<p>ZachXBT was sued by NFT trader MachiBigBrother, also called Jeffrey Huang. ZachXBT had published a report about Huang last year, alleging that he had embezzled millions of dollars worth of crypto. MachiBigBrother filed the lawsuit against the blockchain sleuth in the United States District Court for the Western District of Texas, alleging that ZachXBT&rsquo;s report caused serious monetary and reputational harm. The lawyer representing MachiBigBrother stated,&nbsp;</p>\n\n<p>&ldquo;Without any regard for the ruinous effect that public allegations of criminal conduct can produce for the accused individual, [ZachXBT] not only proceeded to publish his defamatory article on Medium.com, he also maliciously promoted the article to his more than 300,000 Twitter followers.&rdquo;</p>\n\n<p>ZachXBT faces one count of libel and one count of libel per se. The lawsuit also requests that the court order ZachXBT to pay actual and compensatory damages in addition to exemplary damages, the amount of which will be determined by the court.&nbsp;</p>\n<p>ZachXBT has emerged as one of the most prominent voices in the crypto space and has shone a light on several crypto projects and on-chain events. In the process, he has uncovered several potential scams and bad actors and studied exploits and hacks to find out their root causes. His detective work has also led to several real-world arrests and helped him amass a significant following, along with a place on the Consensus Magazine&rsquo;s Most Influential 2022 list.</p>\n<p>However, the lawsuit has threatened to compromise ZachXBT&rsquo;s identity after his name and place of residence were revealed. However, as the lawsuit progresses, the crypto and Web3 communities have come out in complete support through their donations.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T07:45:17.000Z",
    "title": "Floxypay Aims to Empower its Community Through Native Token Launch",
    "url": "https://news.bitcoin.com/floxypay-aims-to-empower-its-community-through-native-token-launch/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-1536x864.png 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-1520x855.png 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478-1280x720.png 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-2023-06-19t112927-478.png 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Floxypay, the leading one-stop solution for cryptocurrency enthusiasts, is excited to announce the launch of its native ERC20 token, FXY. As the backbone of the Floxypay ecosystem, FXY brings a new level of convenience, profitability, and security to users navigating the digital asset space. Floxypay is a comprehensive platform that caters to every [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T08:05:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T08:04:43.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda&#8217;s research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T07:47:59.000Z",
    "title": "Euler Hacker Sends Cryptic Messages Encouraging Ethical Hacking and Hints at Future Actions",
    "url": "https://www.cryptopolitan.com/euler-hacker-sends-cryptic-messages/",
    "description": "In a surprising turn of events, the notorious Euler hacker, who recently returned $200 million in stolen cryptocurrency, has resurfaced with cryptic messages encoded within transactions. The self-proclaimed Argentine and &#8220;Peronist&#8221; hacker, known for exploiting vulnerabilities in the Euler code, urged beginner hackers to pursue ethical bounties instead of engaging in illicit activities. The enigmatic ... <a title=\"Euler Hacker Sends Cryptic Messages Encouraging Ethical Hacking and Hints at Future Actions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/euler-hacker-sends-cryptic-messages/\" aria-label=\"More on Euler Hacker Sends Cryptic Messages Encouraging Ethical Hacking and Hints at Future Actions\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T07:53:51.000Z",
    "title": "Binance Coin (BNB) Defies Regulatory Pressure, Holds $220 Support",
    "url": "https://www.newsbtc.com/news/binance-coin-holds-220-support/",
    "description": "Binance Coin (BNB), the native token of the Binance ecosystem, has faced significant challenges in the wake of the recent lawsuits filed by the US Securities and Exchange Commission (SEC) against both crypto exchange Binance and Coinbase. These regulatory actions have had a profound impact on the cryptocurrency market, stifling any potential upward momentum. As a result, Bitcoin (BTC) retested its lowest point in two months, plummeting to $24,000 at the time of the filing. While BNB also endured the repercussions of the regulatory pressure, it managed to find some stability around the $220 support level.  How will Binance Coin navigate the tough US regulations and maintain its position within the cryptocurrency landscape? Challenges For BNB&#8217;s Upside Potential In the latest report on BNB price, a Fibonacci retracement tool has been employed based on the price action observed in the second quarter of 2023. This tool reveals two significant obstacles that could impede BNB&#8217;s upward trajectory. Related Reading: Polygon (MATIC) Sees Surge In Whale Buying Despite US Regulatory Pressure The first obstacle lies at the 23.6% Fibonacci level, marked at $250.8, while the second hurdle resides at the 38.2% Fibonacci level, indicated by $269.8. Should BNB encounter a price denial at these resistance levels, it is likely to experience a retracement, possibly revisiting the $220 support level. BNB market cap currently at $37.9 billion on the daily chart: TradingView.com Prone To Aggressive Sell-Off Upon Breaching Strong Support If BNB manages to surpass the mentioned bullish threshold, there is a possibility of it facing a significant downturn in the form of an aggressive sell-off. In this particular scenario, it would be prudent to keep an eye on the immediate lower support levels at $200 and $184. Related Reading: Floki Inu Dull, Motionless Following Binance Metaverse Integration – Here’s Why These levels hold significance as they could potentially serve as crucial points where the price of BNB may find temporary stability or experience further downward pressure. Source: Coingecko At CoinGecko, the current price of BNB stands at $243, reflecting a slight decline of 0.9% over the past 24 hours; however, it has experienced a notable seven-day rally of 8.6%. Meanwhile, since the SEC sued Binance, open interest (OI) rates for BNB have gradually increased. The OI has increased from $316 million on June 5 to the current level of $385 million. The rising number of open contracts for BNB on the futures market indicates an optimistic outlook. Source: Coinglass With Binance Coin currently facing significant hurdles at key levels, the outcome of this price analysis raises the question of whether BNB will manage to overcome these obstacles and regain its upward momentum. Traders and investors will be closely monitoring the price rejection scenario, the strength of support levels, and the buying pressure indicators to assess BNB&#8217;s future performance in the crypto market. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Currency.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T07:49:55.000Z",
    "title": "Analyst Predicts BTC Could Soar to $42K in the Coming Weeks",
    "url": "https://coinedition.com/analyst-predicts-btc-could-soar-to-42k-in-the-coming-weeks/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-12-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-12-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/BTC-12.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A crypto analyst and Bitcoin (BTC) enthusiast, Captain Faibik, took to Twitter earlier today to share his observations about the market leader’s price movements. In his post, the analyst pointed out a cup and handle formation on BTC’s weekly Perpetual Inverse Swap Contract chart, and shared his belief that the crypto could soon see a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-predicts-btc-could-soar-to-42k-in-the-coming-weeks/\">Analyst Predicts BTC Could Soar to $42K in the Coming Weeks</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]