[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T22:11:03.000Z",
    "title": "Bitcoin Wobbles, Then Regains Its Balance Above $29.2K; ETH, DOGE, MATIC Fall",
    "url": "https://www.coindesk.com/markets/2023/07/27/crypto-markets-today-btc-tk-eth-matic-doge-price-analysis/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The largest cryptocurrency ticked down for a couple of hours after a report that the Bank of Japan was mulling a change to its yield curve control policy before regaining ground."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-27T22:10:26.000Z",
    "title": "Grayscale Urges Equal Treatment for All Spot Bitcoin ETF's in Letter to SEC",
    "url": "https://www.coindesk.com/business/2023/07/27/grayscale-urges-equal-treatment-for-all-spot-bitcoin-etfs-in-letter-to-sec/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If the SEC decides to change course and approve one or more of of the current spot bitcoin ETF applications, “it must do so in a fair and orderly manner,” the statement said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-27T22:06:53.000Z",
    "title": "KIN Token Surges Over 20% After Vote to Burn 70% of Supply Passes",
    "url": "https://www.coindesk.com/markets/2023/07/27/kin-token-surges-over-20-after-vote-to-burn-70-of-supply-passes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The token climbed on news that about 7 trillion KIN tokens worth $156 million will be burned."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-27T22:24:47.000Z",
    "title": "The British Museum Will Enter the Metaverse via 'The Sandbox'",
    "url": "https://decrypt.co/150405/british-museum-enter-metaverse-via-sandbox",
    "description": "The cultural institution plans to establish an interactive space within the Ethereum-based world, as well as offer up NFT collectibles."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T22:00:11.000Z",
    "title": "Forty-year leap: US national debt nearing $1T in interest alone",
    "url": "https://cryptoslate.com/insights/forty-year-leap-us-national-debt-nearing-1t-in-interest-alone/",
    "description": "<p>Quick Take The United States is experiencing a steep surge in interest payments, now reaching approximately $970 billion. According to financial analyst Joe Consorti, this constitutes an escalation of $41 billion within the second quarter alone. The rapid growth rate implies that the U.S. interest payments will soon reach the daunting $1 trillion threshold, marking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/forty-year-leap-us-national-debt-nearing-1t-in-interest-alone/\">Forty-year leap: US national debt nearing $1T in interest alone</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-27T22:30:13.000Z",
    "title": "Top 5 South Korean Crypto Exchanges Reveal Compliance Strategies to Curb Illicit Activities",
    "url": "https://news.bitcoin.com/top-5-south-korean-crypto-exchanges-reveal-compliance-strategies-to-curb-illicit-activities/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Top 5 South Korean Crypto Exchanges Reveal Compliance Strategies to Curb Illicit Activities\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sk12.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a statement published by the South Korean Financial Services Commission (FSC), the entity&#8217;s Korea Financial Intelligence Unit held a meeting with virtual asset service providers (VASPs) in order to strengthen regulatory compliance. The top five South Korean cryptocurrency exchanges including Upbit, Bithumb, Coinone, Korbit, and Gopax have created compliance systems to monitor illegal [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T22:26:30.000Z",
    "title": "Borroe Finance empowers small businesses to scale, grow revenue",
    "url": "https://crypto.news/borroe-finance-empowers-small-businesses-to-scale-grow-revenue/",
    "description": "Borroe Finance is a crypto project behind ROE. It aims to transform how small businesses obtain funding and expand in web3"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T22:26:20.000Z",
    "title": "Amazon expands service for developers to easily build web3 apps",
    "url": "https://crypto.news/amazon-expands-service-for-developers-to-easily-build-web3-apps/",
    "description": "At the recent AWS Web3/Blockchain Summit in New York City, Amazon said it would expand its AMB services"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T22:10:13.000Z",
    "title": "US House Agriculture Committee passes pro-crypto bill",
    "url": "https://crypto.news/us-house-agriculture-committee-passes-pro-crypto-bill/",
    "description": "The U.S. House Committee on Agriculture has approved the Financial Innovation and Technology for the 21st Century Act"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T21:58:51.000Z",
    "title": "Pomerdoge’s growth potential surpasses Pepe and Shiba Inu",
    "url": "https://crypto.news/pomerdoges-growth-potential-surpasses-pepe-and-shiba-inu/",
    "description": "Shiba Inu and Pepe are popular meme coins, but Pomerdoge is gaining attention due to its high growth potential during POMD presale"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T22:00:25.000Z",
    "title": "U.S. House Approves Major Crypto Bill, Pushes For A Regulatory Framework",
    "url": "https://www.newsbtc.com/crypto/u-s-house-approves-major-crypto-bill-pushes-for-regulatory-framework/",
    "description": "A noteworthy development has occurred in regulating the United States’ crypto space as a House Committee has approved a bill to bring clarity into the industry.  On July 26, the U.S House Financial Services Committee approved the Financial Innovation and Technology Act for the 21st Century Act, popularly known as FIT21. #PASSED: In a historic first, the House Financial Services Committee just advanced the BIPARTISAN FIT for the 21st Century Act to protect consumers and provide clear rules of the road for the digital asset ecosystem. Up next: @HouseAgGOP considers the legislation tomorrow. pic.twitter.com/kOyLmolPuz — Financial Services GOP (@FinancialCmte) July 26, 2023 After a long deliberation, the House Committee greenlighted the FIT21 bill with a 35-15 voting result.  It is worth stating that the FIT21 has been garnering attention, with Coinbase CEO Brian Armstrong taking to Twitter to urge crypto users in the United States to actively push for this bill&#8217;s approval. Although Armstrong believed the bill would likely be modified as it passes the complete legislative process, its approval by the House Committee was vital to safeguard the crypto space, “American innovation and national security.” Related Reading: New Crypto Bill Demands SEC And CFTC To Draft Rules For Trading Platforms The FIT21 Act &#8211; A  Landmark Legislation For U.S. Crypto Space?  The Financial Innovation and Technology for the 21st Act was recently introduced to the House on July 20.  In the Act’s introductory statements, Representative French Hill, who serves as Chairman of the House Subcommittee on Digital Assets, Financial Technology, and Inclusion, referred to the bill as a “landmark legislation” critical to creating an efficient regulatory framework to safeguard crypto users&#8217; interests. The U.S. House Representative further stated that this bill would have prevented the FTX crisis and provided much-needed clarity in crypto. Hill said: This legislation would not only have prevented FTX from stealing billions of customer funds, but also establishes robust consumer protections and clear rules of the road for market participants.  In addition, the FIT21 Act will enhance cooperation between the two financial regulators trying to assume control of the U.S. crypto market. U.S. Representative Dusty Johnson, another sponsor of the bill, emphasized this motion saying: The crypto industry wants clarity and our collaborative bill gives both the CFTC and SEC a seat at the table. Our bill establishes clear principles to ensure financial security and certainty as digital asset developers continue to innovate. Related Reading: SEC Potential Appeal To Yield Little Effect On XRP, Crypto Lawyer Says Total Crypto Market Cap Valued At $1.143 Trillion On Daily Chart &#124; Source: TOTAL Chart On Tradingview.com  U.S. Congress Finally Stepping Up Crypto Regulations The call for a regulatory framework in the U.S. crypto space has been on for quite some time, especially with multiple clampdowns by the SEC on various crypto exchanges and businesses in 2023.  U.S. Patrick McHenry highlighted this situation, stating the United States is “falling behind&#8221; other nations regarding digital asset regulation.  However, the introduction of the FTI21 Act, along with other bills such as the Blockchain Regulatory Act, the Digital Asset Market Structure Proposal, and the “Lummis-Gillibrand” Bill, suggests that the United States government may be ramping up its regulatory efforts in the crypto landscape. Featured Image From Britannica, Chart From Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T22:01:56.000Z",
    "title": "Highly-Anticipated Shiba Inu (SHIB) Shibarium Project Releases Beta Bridge for Public Use",
    "url": "https://dailyhodl.com/2023/07/27/highly-anticipated-shiba-inu-shib-shibarium-project-releases-beta-bridge-for-public-use/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/shiba-shibarium-interest-shib.png?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The highly anticipated layer-2 scaling solution of popular meme asset Shiba Inu (SHIB) is releasing a beta bridge for public use. According to SHIB marketing specialist Lucie, Shibarium’s revolutionary cross-chain bridge is now online and available for public testing. However, Lucie warns users not to use their real crypto assets to test out the bridge. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/highly-anticipated-shiba-inu-shib-shibarium-project-releases-beta-bridge-for-public-use/\">Highly-Anticipated Shiba Inu (SHIB) Shibarium Project Releases Beta Bridge for Public Use</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]