[
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T05:22:40.000Z",
    "title": " Bitcoin mining stocks notch $200M trading volume as GBTC outtrades ‘99% of ETFs’ ",
    "url": "https://cointelegraph.com/news/bitcoin-mining-stocks-trading-volume-grayscale-gbtc-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZTY5YzBiZTEtMjUxYi00YTI1LWIyYjEtYjEzZTBjOTY0OGY5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Major mining firms had a marathon day of stock trading this week with volumes topping $200 million and eclipsing some of the world’s tech giants.  </p>\n                    <p><p>Crypto mining firms saw robust trading volumes on American bourses on Monday, with some mining shares even outpacing well-known U.S. tech giants. </p><p>The total trading volume among four mining firms — Marathon Digital, Riot Platforms, Cleanspark, and Terawulf — was a combined $208 million on Jan. 8, <a href=\"https://finance.yahoo.com/most-active?offset=0&amp;count=50\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from Yahoo Finance. </p><p>Marathon Digital (MARA) even secured the position as the top-traded stock in the United States on the day with a volume of $112 million, <a href=\"https://finance.yahoo.com/most-active?offset=0&amp;count=50\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Yahoo. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-mining-stocks-trading-volume-grayscale-gbtc-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T05:18:06.000Z",
    "title": "$JTC Network, a New Layer 1 Blockchain Focused on Legal Enforcement, To List On BitMart Exchange",
    "url": "https://cryptodaily.co.uk/2024/01/jtc-network-a-new-layer-1-blockchain-focused-on-legal-enforcement-to-list-on-bitmart-exchange",
    "description": "$JTC Network, a New Layer 1 Blockchain Focused on Legal Enforcement, To List On BitMart Exchange"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T05:28:22.000Z",
    "title": "XRP Price Prediction – This Resistance Is The Key To Next Rally",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-this-resistance-is-the-key-to-next-rally/",
    "description": "XRP price is moving higher from the $0.4540 support. The price could start a fresh rally if there is a clear move above the $0.600 resistance. XRP is attempting a fresh increase from the $0.4540 support level. The price is now trading below $0.5950 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $0.6080 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair start a fresh rally if it clears the $0.600 and $0.608 resistance levels. XRP Price Faces Hurdles This past week, XRP price saw a sharp decline below the $0.550 level. The price declined below the $0.500 support and even spiked below $0.480. A low was formed near $0.4541, and the price is now moving higher, like Bitcoin and Ethereum. There was a move above the $0.500 and $0.520 resistance levels. The bears cleared the 61.8% Fib retracement level of the main drop from the $0.640 swing high to the $0.454 swing low. However, the price is still below $0.5950 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.595 zone or the 76.4% Fib retracement level of the main drop from the $0.640 swing high to the $0.454 swing low. The first key resistance is near $0.600 and $0.608. There is also a key bearish trend line forming with resistance near $0.6080 on the 4-hour chart of the XRP/USD pair. Source: XRPUSD on TradingView.com A close above the $0.6080 resistance zone could spark a strong increase. The next key resistance is near $0.640. If the bulls remain in action above the $0.640 resistance level, there could be a rally toward the $0.670 resistance. Any more gains might send the price toward the $0.700 resistance. Another Drop? If XRP fails to clear the $0.608 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.550 zone. The next major support is at $0.520. If there is a downside break and a close below the $0.520 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.500 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.550, $0.520, and $0.500. Major Resistance Levels – $0.595, $0.600, and $0.608."
  }
]