[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T22:00:00.000Z",
    "title": "Nomura Backs $6M Round for On-Chain Fund Platform Solv Protocol",
    "url": "https://www.coindesk.com/business/2023/07/31/nomura-backs-6m-round-for-on-chain-fund-platform-solv-protocol/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Singapore-based startup offers an on-chain fund platform that allows institutions and venture capitalists to create, use and sell financial products."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T21:53:07.000Z",
    "title": "IRS: Crypto Staking Rewards Taxable Once Investor Gets Hands on Tokens",
    "url": "https://www.coindesk.com/policy/2023/07/31/irs-says-staking-rewards-are-subject-to-taxes-in-year-the-investor-gets-control/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A cryptocurrency investor rewarded assets for validation activity on a proof-of-stake network should count the rewards as income in the year the investor gets control of those tokens, according to a ruling issued Monday by the Internal Revenue Service (IRS)."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T21:44:50.000Z",
    "title": "Curve Founder’s $168M Stash Is Under Stress, Creating a Risk for DeFi as a Whole",
    "url": "https://www.coindesk.com/markets/2023/07/31/a-curve-founders-168m-stash-is-under-stress-creating-a-risk-for-defi-as-a-whole/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Curve CEO Michael Egorov pledged 34% of CRV’s total market cap to back loans across DeFi protocols. A forced liquidation would result in selling at a time when prices are already falling."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-31T21:48:41.000Z",
    "title": "Yuga Labs to Acquire Roar Studios for AI Expertise",
    "url": "https://decrypt.co/150757/yuga-labs-roar-studios-acquisition-ai",
    "description": "Eric Reid, Roar Studios founder and CEO, will head Yuga Labs’ upcoming Otherside game."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T22:00:06.000Z",
    "title": "Analyzing Bitcoin’s summer performance with a cautionary eye on September",
    "url": "https://cryptoslate.com/insights/analyzing-bitcoins-summer-performance-with-a-cautionary-eye-on-september/",
    "description": "<p>Quick Take As July comes to a close, Bitcoin&#8217;s performance offers a nuanced view, closing the month with a slight dip of about 3.5%. This is the second month this year where Bitcoin has declined, but despite this, the cryptocurrency has seen a remarkable yearly increase of 77%, Moving into the final month of summer, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/analyzing-bitcoins-summer-performance-with-a-cautionary-eye-on-september/\">Analyzing Bitcoin&#8217;s summer performance with a cautionary eye on September</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T21:50:31.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T21:47:00.000Z",
    "title": "China’s legacy chip surge concerns US and Europe",
    "url": "https://www.cryptopolitan.com/china-legacy-chip-surge-concerns-us-europe/",
    "description": "China&#8217;s strategic expansion into the production of legacy semiconductors is sending shockwaves across US and European governing bodies. In response to the broad controls imposed by the Biden administration on advanced chips, China is pumping billions into the production of older-generation chips that still serve as vital components in modern technology. These chips play a ... <a title=\"China&#8217;s legacy chip surge concerns US and Europe\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-legacy-chip-surge-concerns-us-europe/\" aria-label=\"More on China&#8217;s legacy chip surge concerns US and Europe\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T21:40:01.000Z",
    "title": "European Union’s Q2 growth and falling inflation",
    "url": "https://www.cryptopolitan.com/european-unions-q2-growth-falling-inflation/",
    "description": "Europe has once again caught the financial world&#8217;s attention. The eurozone&#8217;s second-quarter growth and July&#8217;s falling inflation are creating both opportunities and concerns, with complex dynamics playing out in various sectors. Let&#8217;s take a closer look at the numbers and what they mean for Europe&#8217;s economy. Mixed signs: Growth returns, but challenges remain After a ... <a title=\"European Union&#8217;s Q2 growth and falling inflation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-unions-q2-growth-falling-inflation/\" aria-label=\"More on European Union&#8217;s Q2 growth and falling inflation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T22:06:05.000Z",
    "title": "29 Other Meme Coins Besides BALD Rugged on Base",
    "url": "https://www.newsbtc.com/news/29-meme-coins-bald-rugged-base-investors-lose-millions/",
    "description": "Scope data on July 31 shows that 29 meme coins were launched over the weekend on Base to capitalize on the recent frenzy surrounding BaldBaseBald (BALD), a meme coin inspired by Coinbase CEO Brian Armstrong. However, all 29 meme coins have since been rugged, with the deployer exiting with over $1 million after seeding roughly $105,000 of ETH as liquidity. Base is an Ethereum layer-2 platform based on Optimism roll-up technology.  Rug Pulls On Base On July 29 and 30, there was excitement about the meme coin, BALD, as its prices exploded by as much as 4,000X, pushing the token&#8217;s market cap to over $100 million. This was great news for those who invested early as some exited as the wave rise, profiting. Some builders took advantage of the hype and created meme coins to deceive investors eager to join the BALD trend, eventually resulting in losses for some meme coin token holders. Related Reading: BALD Coin Rug Pull: How A $100 Million Memecoin Became Worthless Overnight While BALD has already been rug-pulled, Scope notes that the address behind the 29 meme coins also has a history of rug-pulling in other platforms, including the BNB Chain and Arbitrum, a popular Ethereum layer-2 platform. In platforms where meme coins are traded, liquidity, provided by the community, is essential due to the decentralized nature of trading.  Rug pullers typically supply liquidity to their meme coins, which attracts more users to buy the coin and increases liquidity as prices rise. However, the creator then deliberately withdraws liquidity at this point, converting their meme coins to a more liquid coin like Ethereum, causing their token prices to drop to zero. As of July 31, hours after the rug pull, the address primarily held USDC and a small portion of ETH in their portfolio, with no meme coins. This potentially highlights the rug puller&#8217;s risk-averseness and his concerns about the risks involved in this asset class. Related Reading: Bitcoin Crucial Moment: Will Resistance At $29,500 Trigger A Sell-Off Or Surge? Meme Coins Are Volatile Meme coins are popular in crypto, especially Ethereum, where they are minted as fungible ERC-20 tokens in their trillions. Dogecoin, endorsed by Elon Musk, is the most liquid and widely recognized. Despite rising popularity, there are concerns about their volatility and lack of utility, with some critics labeling them as &#8220;casinos&#8221; that undermine the true vision of crypto as an alternative financial system. For example, the collapse of BALD, which commanded billions in market cap on Base over the weekend, has drawn widespread condemnation. Besides BALD, other like PEPE and LADYS are struggling, dropping by over 70% from their all-time peaks registered in H1 2023. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T22:01:16.000Z",
    "title": "XRP, Cardano (ADA) and Solana (SOL) See Institutional Capital Flows As Altcoin Sentiment Brightens: CoinShares",
    "url": "https://dailyhodl.com/2023/07/31/xrp-cardano-ada-and-solana-sol-see-institutional-capital-flows-as-altcoin-sentiment-brightens-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Alert-for-Altcoin-Holders.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are becoming more optimistic on altcoins despite Bitcoin (BTC) and the overall markets suffering outflows for the second week in a row. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that halfway through 2023, digital assets have seen almost half a billion in inflows.  &#8220;Digital asset investment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/xrp-cardano-ada-and-solana-sol-see-institutional-capital-flows-as-altcoin-sentiment-brightens-coinshares/\">XRP, Cardano (ADA) and Solana (SOL) See Institutional Capital Flows As Altcoin Sentiment Brightens: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]