[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T19:53:41.000Z",
    "title": "Japan's Largest Airline Group ANA Launches NFT Marketplace",
    "url": "https://www.coindesk.com/web3/2023/06/01/japans-largest-airline-group-ana-launches-nft-marketplace/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "All Nippon Airways (ANA) is also working on a metaverse travel experience that will integrate passengers' flight histories into their digital avatars."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T20:00:00.000Z",
    "title": "Scientists propose quantum proof-of-work consensus for blockchain",
    "url": "https://cointelegraph.com/news/scientists-propose-quantum-proof-of-work-consensus-for-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6850402b-2efa-4e50-889c-173d8438f018.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Boson sampling was once considered a problem looking for a solution. Now, it might be the bridge that brings quantum computing to the blockchain.</p>\n                    <p><p>A team of researchers from universities in Australia and the United States, working in collaboration with quantum technology company BTQ, recently published research proposing a novel proof-of-work (PoW) scheme for blockchain consensus that relies on quantum computing techniques to validate consensus.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our new paper on using NISQ-era quantum sampling problems in proof-of-work blockchain consensus algorithms. In collaboration with <a href=\"https://twitter.com/BTQ_Tech?ref_src=twsrc%5Etfw\">@BTQ_Tech</a>.<a href=\"https://t.co/MKAB2czqSk\">https://t.co/MKAB2czqSk</a></p>— Peter Rohde (@drpeterrohde) <a href=\"https://twitter.com/drpeterrohde/status/1664119093887377408?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Dubbed “Proof-of-work consensus by quantum sampling,” the preprint research paper <a href=\"https://arxiv.org/pdf/2305.19865.pdf\" target=\"_blank\" rel=\"noopener nofollow\">details</a> a system that the authors claim “provides dramatic speedup and energy savings relative to computation by classical hardware.\"</p><p>According to the researchers, current algorithms for solving PoW consensus puzzles are slow and require a significant amount of computation resources to process:</p><blockquote>“Whereas classical PoW schemes such as Bitcoin’s are notoriously energy inefficient, our boson sampling-based PoW scheme offers a far more energy efficient alternative when implemented on quantum hardware.”</blockquote><p>According to the paper, the quantum advantage provided by this scheme would also increase the difficulty of mining, thus making it possible to “maintain consistent block mining time” as the number of miners increases, further incentivizing continuing participation of “quantum miners.”</p><p>The sampling process the researchers refer to, boson sampling, isn’t a new one, but its application to blockchain technology appears novel. Boson sampling has <a href=\"https://www.spiedigitallibrary.org/journals/advanced-photonics/volume-1/issue-3/034001/Photonic-implementation-of-boson-sampling-a-review/10.1117/1.AP.1.3.034001.full?SSO=1\" target=\"_blank\" rel=\"noopener nofollow\">shown</a> promise in numerous quantum computing applications. Still, as a non-universal quantum computing solution (it has to be used in a system built for a specific task), its potential has been limited to a select few domains, such as chemistry.</p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/explained/how-does-quantum-computing-impact-the-finance-industry\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/how-does-quantum-computing-impact-the-finance-industry/amp\"><em>How does quantum computing impact the finance industry?</em></a></strong></p><p>However, according to the researchers, it may be the perfect solution for future-proofing blockchain applications and, potentially, lowering the environmental impact of mining on the Bitcoin blockchain and similar chains.</p><p>Aside from quantum advantage, quantum hardware also has a leg up on old school computers due to the nature of how blockchain mining works. </p><p>One of the current advantages of classical supercomputers over their new quantum cousins is the ability to “precompute” when handling the same class of problem regularly. But, when it comes to blockchain, such precompute is essentially wasted. </p><p>Mining is, as the researchers put it, a problem that is “progress-free.” No matter how many times a blockchain puzzle is solved to provide proof-of-work, the computer and algorithms processing the challenges don’t ever get any better at solving the problem. </p><p>This means that quantum computers, despite being notoriously challenging to develop and expensive to build and maintain, would ultimately be capable of validating consensus more efficiently than state-of-the-art classical systems.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T19:53:19.000Z",
    "title": "Google, Microsoft invest in AI startups as battle for dominance heats up",
    "url": "https://cryptoslate.com/google-microsoft-invest-in-ai-startups-as-battle-for-dominance-heats-up/",
    "description": "<p>In an escalating battle for market share in the AI sector, Google and Microsoft have made new strategic startup investments as they vie for dominance. Google invests in Runway The Information reported June 1 that Google had invested in Runway, an AI startup acclaimed for its text-to-video tool, as part of a $100 million funding [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/google-microsoft-invest-in-ai-startups-as-battle-for-dominance-heats-up/\">Google, Microsoft invest in AI startups as battle for dominance heats up</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T20:08:40.000Z",
    "title": "I asked AI to predict when Ether will hit its all-time high again, and I am shocked",
    "url": "https://www.cryptopolitan.com/ai-predict-ether-hit-its-all-time-high-again/",
    "description": "I recently engaged in an enlightening dialogue with an AI model, GPT-4, renowned for its analytical prowess. This encounter led to a startling prediction concerning Ethereum, the second-largest cryptocurrency by market capitalization. Decoding GPT-4&#8217;s Ethereum prediction Artificial Intelligence continues to disrupt various sectors, with the finance and cryptocurrency landscape being no exception. Renowned for its ... <a title=\"I asked AI to predict when Ether will hit its all-time high again, and I am shocked\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-predict-ether-hit-its-all-time-high-again/\" aria-label=\"More on I asked AI to predict when Ether will hit its all-time high again, and I am shocked\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T20:08:20.000Z",
    "title": "OKX Proposes Industry-First BRC-30 Token Standard to Enable Bitcoin and BRC-20 Token Staking",
    "url": "https://www.cryptopolitan.com/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking/",
    "description": "SAN FRANCISCO, UNITED STATES, June 1st, 2023, Chainwire With BRC-30, OKX Wallet users will soon be able to stake BRC-20 tokens and Bitcoin to earn passive income on their digital assets OKX, a leading Web3 company, today introduced its proposal for a new, open-source BRC-30 protocol that enables staking of BRC-20 tokens and Bitcoin in ... <a title=\"OKX Proposes Industry-First BRC-30 Token Standard to Enable Bitcoin and BRC-20 Token Staking\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking/\" aria-label=\"More on OKX Proposes Industry-First BRC-30 Token Standard to Enable Bitcoin and BRC-20 Token Staking\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T19:58:08.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-01T20:00:24.000Z",
    "title": "DigiToads Gears Up for Another Price Surge. Can It Continue To Outgrow Uniswap And Stellar?",
    "url": "https://nulltx.com/digitoads-gears-up-for-another-price-surge-can-it-continue-to-outgrow-uniswap-and-stellar/",
    "description": "DigiToads has become a significant coin in the cryptocurrency market due to its exceptional play-to-earn gaming feature that is conveniently merged with an NFT feature.  The DigiToads presale, which is in its 7th stage, has caused a roar in the crypto scene due to its quick growth. As a result, DigiToads has now been dubbed [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T19:45:40.000Z",
    "title": "Data says crypto markets corrected in May, NFT market slow",
    "url": "https://crypto.news/data-says-crypto-markets-corrected-in-may-nft-market-slow/",
    "description": "The crypto market experienced a month of widespread corrections, adjustments, slow NFT marketplace activities, and more, in the month of May, according to on-chain data released by The Block. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T20:00:46.000Z",
    "title": "Gate.io Faces Insolvency Issues Amid Multichain’s CEO Arrest: $130 Million Net Outflow In 24 Hours",
    "url": "https://www.newsbtc.com/news/gate-io-faces-insolvency-issues-amid-multichains-ceo-arrest-130-million-net-outflow-in-24-hours/",
    "description": "Cryptocurrency exchange Gate.io has recently been facing rumors of insolvency following the arrest of Multichain CEO Zhaojun and concerns about the Multichain treasury being backed by 30%. These rumors have led to increased withdrawals from the exchange, with a net outflow of $131 million in the last 24 hours alone. To put this into perspective, the 7-day net outflow from Gate.io is $144.8 million, per data compiled by Nansen.  Related Reading: The $24,000 BTC Bullseye: Is Bitcoin Headed For A Summer Swoon? Gate.io Denies Liquidity Issues  The rumors about Gate.io&#8217;s insolvency stem from a tweet alleging a connection between the exchange and Multichain following the arrest of Multichain CEO Zhaojun. The tweet claimed that Gate.io was facing insolvency due to its involvement with Multichain and the potential impact of Zhaojun&#8217;s arrest on the Multichain treasury. Despite these rumors, Gate.io has disputed insolvency claims and reassured its users that all funds are safe. The cryptocurrency exchange has recently stated to address rumors about its operations and withdrawals. Gate.io has reassured users that its operations are sound, withdrawals are working properly, and there are no problems with rumored operations or withdrawals. Furthermore, Gate.io emphasizes its commitment to providing users with safe, fast, and reliable virtual asset services and encourages users to be cautious of any unsolicited calls or messages claiming to be from Gate.io. The exchange currently holds $2.4 billion in assets, including 18% in Gate.io’s native token GT, 15% in Ethereum (ETH), 15% in Bitcoin (BTC), and other cryptocurrencies. Despite these reassurances, the increase in withdrawals from Gate.io highlights the impact that rumors and speculation can have on the crypto market, particularly in times of uncertainty. However, Gate.io has stated that it has no direct connection to Multichain and that Zhaojun&#8217;s arrest does not affect its operations. The exchange has also emphasized that all funds are held in cold storage, providing an additional layer of security for user assets. Binance CEO CZ Issues Warning Binance CEO CZ has recently advised investors to Secure Asset Fund for User (SAFU) after citing a tweet from Multichain, which reported multiple issues with their protocol due to unforeseeable circumstances. The tweet stated that the team had done everything possible to maintain the protocol running but could not contact CEO Zhaojun and obtain the necessary server access for maintenance. The tweet also mentioned an issue with the scanning node network of Router5, which affected the normal cross-chain service of some chains. To protect users&#8217; interests, the corresponding cross-chain service for the affected chain was suspended on the User Interface (UI). This issue was also reported to have occurred on Router2 the week prior. Related Reading: Litecoin Attempts To Revitalize The Crypto Market With Bullish Breakout The timing of CZ&#8217;s advice to SAFU and the issues reported by Multichain has led to speculation that this may be an early warning to investors about the potential dangers associated with Gate.io. However, it is important to note that CZ did not explicitly mention Gate.io in his tweet, and there is no direct connection between Gate.io and Multichain. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-01T20:00:39.000Z",
    "title": "Historic Signal Suggests Bitcoin (BTC) Could Be About To Go ‘Bonkers’ in Coming Weeks: InvestAnswers",
    "url": "https://dailyhodl.com/2023/06/01/historic-signal-suggests-bitcoin-btc-could-be-about-to-go-bonkers-in-coming-weeks-investanswers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/historical-signals-suggest-bonkers.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst believes the price action of Bitcoin (BTC) could take off within months if two key indicators cross. In a new update, the anonymous host of InvestAnswers tells his 444,000 YouTube subscribers that when the 50-week moving average retakes the 200-week moving average Bitcoin will likely soar. In technical analysis, this is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/01/historic-signal-suggests-bitcoin-btc-could-be-about-to-go-bonkers-in-coming-weeks-investanswers/\">Historic Signal Suggests Bitcoin (BTC) Could Be About To Go ‘Bonkers’ in Coming Weeks: InvestAnswers</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-01T19:55:43.000Z",
    "title": "Top Crypto Trader Looks Ahead to June As Bitcoin (BTC) and Ethereum (ETH) Move Sideways",
    "url": "https://dailyhodl.com/2023/06/01/top-crypto-trader-looks-ahead-to-june-as-bitcoin-btc-and-ethereum-eth-move-sideways/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/btc-eth-see-saw.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is looking forward to what a new month might mean for the top two crypto assets by market cap. In a new Daily Price Action blog post, crypto trader Justin Bennett says that yesterday&#8217;s sell-off in the Bitcoin (BTC) markets might just be due to institutional traders balancing their books. &#8220;As large [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/01/top-crypto-trader-looks-ahead-to-june-as-bitcoin-btc-and-ethereum-eth-move-sideways/\">Top Crypto Trader Looks Ahead to June As Bitcoin (BTC) and Ethereum (ETH) Move Sideways</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]