[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T06:25:27.000Z",
    "title": "TrueUSD Depegs on Binance.US, Drops to 80 Cents Against Tether",
    "url": "https://www.coindesk.com/markets/2023/06/28/trueusd-depegs-on-binanceus-drops-to-080-against-tether/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "TUSD trades at a discount versus Tether as former FTX provider Armanino's rebranded outlet The Network Firm's association with TrueUSD raises alarm bells on Crypto Twitter."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T06:13:45.000Z",
    "title": "UK Law Suited to Accommodate crypto, Law Commission Review Finds",
    "url": "https://cryptodaily.co.uk/2023/06/uk-law-suited-to-accommodate-crypto-law-commission-review-finds",
    "description": "<p>Law Commission recommends reform and development of the law on digital assets to secure UK&rsquo;s position as a global crypto hub.</p>\nSummary Overview\n<p>The Law Commission recommends:</p>\n<ul>\n<li>First-ever Government-commissioned common law analysis showing how the law in England and Wales can accommodate digital assets, like NFTs and crypto-tokens.</li>\n<li>Law Commission report advocates for common law reform and development to provide greater clarity to users and attract technological innovation.</li>\n<li>Recommendation for legislation to confirm the existence of a distinct category of personal property which can acknowledge the unique features of digital assets.</li>\n</ul>\n<p>The Law Commission of England and Wales has today (Wednesday, 28 June) published recommendations for the reform and development of the law relating to digital assets.</p>\n<p>Digital assets &ndash; which include crypto-tokens (sometimes referred to as &lsquo;cryptocurrencies&rsquo;) and non-fungible tokens (NFTs) &ndash; are used for an increasing variety of purposes in modern society, such as for investment, for making payments, and for linking to or embodying debt and equity securities.</p>\n<p>Over the last 15 years, personal property law in England and Wales has proven sufficiently flexible to accommodate digital assets. However, as the digital asset market and related technology continue to change, there remains some residual legal uncertainty and complexity.</p>\n<p>The Government therefore asked the Law Commission to carry out a first-ever rigorous common law analysis, showing how the law in England and Wales can respond to this kind of emerging technology.&nbsp;</p>\n<p>The Commission&rsquo;s recommendations for reform and development of the law aim to provide a comprehensive legal foundation for digital assets which will allow these new technologies to flourish, enabling a diverse range of market participants to interact with and benefit from them.</p>\nUK Law is Well Suited to Accommodate Crypto\n<p>In its report, the Commission shows that the common law of England and Wales is well placed to provide a coherent and globally relevant regime for existing and new types of digital asset.</p>\n<p>Because digital assets are not tangible and differ significantly from physical assets, and from rights-based assets like debts and financial securities, they do not fit within traditional categories of personal property. Nonetheless, the Commission argues that the flexibility of common law can accommodate a distinct category of personal property to better recognise and protect their unique features. The Commission also recommends legislation to confirm the existence of this category and remove any uncertainty.</p>\n<p>To ensure that courts can respond sensitively to the complexity of emerging technology, the Commission calls on Government to create a panel of industry experts who can provide guidance on technical and legal issues relating to the control of digital assets.</p>\n<p>The Commission also makes recommendations to provide market participants with legal tools that do not yet exist in England and Wales, such as new ways to take security over crypto-tokens and tokenised securities.&nbsp;</p>\n<p>The Commission&rsquo;s recommendations for reform and common law development aim to create a clear and consistent framework for digital assets that will provide greater clarity and security to users and market participants. The recommendations also support the Government&rsquo;s goal of attracting technological development to cement the position of England and Wales as a global hub for crypto-tokens and crypto-assets.</p>\n<p>Professor Sarah Green, Law Commissioner for Commercial and Common Law, said:</p>\n\n<p>&ldquo;The use and importance of digital assets has grown significantly in the law few years. The flexibility of the common law means that the legal system in England and Wales is well placed to adapt to this rapid growth.&nbsp;</p>\n<p>Our recommendations for reform and development of the law therefore seek to solidify the legal foundation for digital assets. We also aim to ensure that the private law in England and Wales remains a dynamic, globally competitive and flexible tool that enables further technological innovation.&rdquo;</p>\n\n<p>Justice Minister Mike Freer commented:</p>\n\n<p>&ldquo;The UK is a world leader in legal innovation and these findings demonstrate the strength of English and Welsh law in responding to the fast-paced changes caused by emerging technologies in the law sector.&nbsp;</p>\n<p>We must ensure our law remains equipped to meet the complexities of these technologies well into the future, and we will carefully consider these findings as we look to further strengthen the future of our globally-renowned legal system.&rdquo;</p>\n\n<p>Andrew Griffith, Economic Secretary to the Treasury, added:</p>\n\n<p>&ldquo;Our reputation for straight dealing, use of the English language and flexible common law attracts business across the world.</p>\n<p>This, combined with our straightforward approach to regulating crypto-assets puts the UK at the vanguard of innovation to drive growth in digital assets and boost our economy.</p>\n<p>I firmly welcome the Law Commission&rsquo;s Final Report on Digital Assets and the work done to meet the complexities of these technologies well into the future &ndash; and will carefully consider their findings and recommendations.&rdquo;</p>\n\nThe Law Commission&rsquo;s recommendations for reform of the law on digital assets are as follows:\n<ol>\n<li>Legislation to confirm&nbsp;the existence of a distinct third category of personal property&nbsp;under the law which can better recognise, accommodate and protect the unique features of digital assets. The report does not set out clear boundaries for this third category, arguing instead that common law is the best vehicle to determine which objects can fit within it. This will allow for a nuanced approach to recognising that things such as crypto-tokens, export quotas or different types of carbon emissions allowance can be objects of personal property rights.&nbsp;</li>\n<li>Creation of a&nbsp;panel of industry-specific technical experts, legal practitioners, academics and judges&nbsp;to provide non-binding advice to courts on complex legal issues relating to digital assets.</li>\n<li>Creation of a&nbsp;bespoke legal framework&nbsp;that better facilitates the entering into, operation and enforcement of collateral arrangements relating to crypto-tokens and crypto-assets.</li>\n<li>Statutory law reform to clarify whether certain digital assets fall within the scope of the Financial Collateral Arrangements (No 2) Regulations 2003.</li>\n</ol>\nWhat Is A Digital Asset?\n<p>Digital asset is a broad term which covers a variety of non-tangible assets in digital form. These can include digital files, email accounts, domain names, and crypto-tokens, including cryptocurrencies and non-fungible tokens (NFTs).&nbsp;</p>\n<p>The technology used to create these assets and the characteristics of each asset can vary greatly.</p>\nWhat Is A Crypto-Token?&nbsp;\n<p>A crypto-token is a type of digital asset that uses cryptography &ndash; the process of coding information so that it can be transferred securely. Crypto-tokens are digital tokens that can be traded, used to record, embody or link to another asset or legal right, or used as a store of value.</p>\n<p>One type of crypto-token is a&nbsp;non-fungible token (NFT), which is a crypto-token that is unique or capable of being differentiated from other crypto-tokens. NFTs are often linked to data, such as data representing digital artwork, but they can also be used to link to a wide range of assets and rights.</p>\n<p>The term &ldquo;crypto-token&rdquo; is sometimes used interchangeably with &ldquo;cryptocurrency&rdquo;. While they have many overlapping features, cryptocurrency is a term that generally refers to crypto-tokens that are largely intended to be used for making payments as digital currencies, while crypto-tokens are used for this and a number of additional purposes, outlined above.</p>\n<p>The law treats crypto-tokens, NFTs and cryptocurrency as things that exist through the combination of the active operation of software by a network of participants and specific data used by that software and network.</p>\nNext Steps\n<p>It is now for the Government to decide whether it intends to take the commission&rsquo;s recommendations forward.</p>\n<p>An embargoed summary of the digital assets report is&nbsp;available here.</p>\n<p>The full report will be published&nbsp;on this page&nbsp;of the Law Commission website on Wednesday 28 June.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T06:31:36.000Z",
    "title": "DWF Labs Doubles Down on Conflux with $28 Million Invested",
    "url": "https://www.cryptopolitan.com/dwf-labs-doubles-down-on-conflux-with-28-million-invested/",
    "description": "Hong Kong, China, June 28th, 2023, Chainwire DWF Labs, the global digital asset market maker, and multi-stage Web3 investment firm, has further strengthened its commitment to support the growth of Conflux, the tree-graph consensus algorithm Layer-1 blockchain. Conflux has been gaining significant traction since February 2023 on the back of some key partnerships, including the ... <a title=\"DWF Labs Doubles Down on Conflux with $28 Million Invested\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dwf-labs-doubles-down-on-conflux-with-28-million-invested/\" aria-label=\"More on DWF Labs Doubles Down on Conflux with $28 Million Invested\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T06:18:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T06:36:24.000Z",
    "title": "DWF Labs Doubles Down on Conflux with $28 Million Invested",
    "url": "https://www.crypto-news-flash.com/dwf-labs-doubles-down-on-conflux-with-28-million-invested/?utm_source=rss&utm_medium=rss&utm_campaign=dwf-labs-doubles-down-on-conflux-with-28-million-invested",
    "description": "Hong Kong, China, June 28th, 2023, Chainwire DWF Labs, the global digital asset market maker, and multi-stage Web3 investment firm, has further strengthened its commitment to support the growth of Conflux, the tree-graph consensus algorithm Layer-1 blockchain. Conflux has been gaining significant traction since February 2023 on the back of some key partnerships, including the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T06:30:00.000Z",
    "title": "Shiba Inu Coin vs Hollywood X PEPE $HXPE: Which Meme Coin Takes The Crown?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-coin-vs-hollywood-x-pepe-hxpe-which-meme-coin-takes-the-crown/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-coin-vs-hollywood-x-pepe-hxpe-which-meme-coin-takes-the-crown",
    "description": "When it comes to the wild west of cryptocurrencies, meme coins have taken center stage, captivating the attention of investors and spectators alike. In this post, we dive deep into a comparative review of two popular meme coins: Shiba Inu Coin and the still-in-presale Hollywood X PEPE $HXPE. We&#8217;ll examine their uniqueness, investment potential, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T06:20:59.000Z",
    "title": "IOTA Set to Dominate $5T Tokenization Market with Stardust, Unleashing a Wave of Projects in the Future Market",
    "url": "https://www.crypto-news-flash.com/iota-set-to-dominate-5t-tokenization-market-with-stardust-unleashing-a-wave-of-projects-in-the-future-market/?utm_source=rss&utm_medium=rss&utm_campaign=iota-set-to-dominate-5t-tokenization-market-with-stardust-unleashing-a-wave-of-projects-in-the-future-market",
    "description": "IOTA protocol has launched its latest innovation Stardust. Stardust enables the creation of NFTs so it can compete with other chains. IOTA, a leading blockchain platform, is poised to dominate the $5 trillion tokenization market with its latest innovation, Stardust. This groundbreaking technology is set to unleash a wave of projects in the future market, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-28T06:36:59.000Z",
    "title": "Golteum (GLTM) Join Chainlink BUILD With Platform Launch Ahead",
    "url": "https://coinedition.com/golteum-gltm-join-chainlink-build-with-platform-launch-ahead/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Golteum.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Golteum (GLTM) Join Chainlink\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Golteum.png 730w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/06/Golteum-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Golteum, a forefront emerging decentralized finance (DeFi) platform that enables the trading of precious metals on the blockchain, has announced its entry into the Chainlink BUILD program. Joining the fellowship serves as a drive toward the widespread adoption of tokenized precious metals investment on the blockchain. Golteum also have some ongoing events preceding to its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/golteum-gltm-join-chainlink-build-with-platform-launch-ahead/\">Golteum (GLTM) Join Chainlink BUILD With Platform Launch Ahead</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]