[
  {
    "source": "Decrypt",
    "date": "2023-07-05T09:41:59.000Z",
    "title": "Binance Australia Says It’s ‘Cooperating’ With Authorities Amid Regulatory Scrutiny",
    "url": "https://decrypt.co/147348/binance-australia-says-cooperating-authorities-amid-regulatory-scrutiny",
    "description": "Binance is under increased scrutiny as Australia's financial regulator reportedly conducted office searches. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T10:07:55.000Z",
    "title": "Will ERC 6551 transform Ethereum metaverses with NFT-owned wallets?",
    "url": "https://cryptoslate.com/will-erc-6551-transform-ethereum-metaverses-with-nft-owned-wallets/",
    "description": "<p>The proposed ERC 6551 token standard for NFTs is generating interest among crypto enthusiasts, as it would enable digital assets to own other tokens, a development that could significantly transform the NFT and metaverse landscape. Speaking to Laura Shin on a recent episode of the Unchained Podcast,  Benny Giang and Jayden Windle, two of the authors [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/will-erc-6551-transform-ethereum-metaverses-with-nft-owned-wallets/\">Will ERC 6551 transform Ethereum metaverses with NFT-owned wallets?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T09:51:12.000Z",
    "title": "Small-scale Bitcoin holders aggressively stacking Sats",
    "url": "https://cryptoslate.com/insights/small-scale-bitcoin-holders-aggressively-stacking-sats/",
    "description": "<p>Quick Take CheckMate, a noted analyst from Glassnode, recently shed light on the fascinating behavior of Bitcoin &#8216;shrimps.&#8217; These small-scale holders, each with less than one Bitcoin in their portfolio, are aggressively accumulating satoshis. To put it in perspective, these &#8216;shrimps&#8217; are collectively stacking approximately 33.8k Bitcoin (BTC) monthly. To compare, the average monthly Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/small-scale-bitcoin-holders-aggressively-stacking-sats/\">Small-scale Bitcoin holders aggressively stacking Sats</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T10:02:34.000Z",
    "title": "Bitcoin prepares for impending breakout",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-prepares-for-impending-breakout",
    "description": "<p>Still above $30,000, bitcoin looks to be gathering strength to make that all-important break of the $31,000 level.</p>\n<p>The crypto market is in calmer waters currently as it looks to bitcoin to make that definitive move past $31,000. Given the sheer scale of the resistance above, bitcoin will need to gather the help of all the bulls in order to be successful.</p>\nMomentum still gathering\n<p>One of its main weapons to surpass the resistance will be momentum, and short term Stochastic RSIs are resetting to the bottom as bitcoin traverses sideways.</p>\n<p>The daily timeframe RSI would be a major help, and this is now passing the halfway point on its way down. Once at the bottom and the signal lines cross up this can be a major sign that bitcoin has the impetus to make the break.</p>\nBullish chart patterns\n<p>Having started this particular attack on resistance on June 15, the price reached a high on June 23 before traversing sideways, forming a bull flag as it went. The measured move for the flag is $36,000, the next real level of resistance after $31,000.</p>\n<p>Another, even more bullish chart pattern has reached completion. This is a potential cup and handle pattern that started to form in early June 2022. The cup was completed on April 14 this year, and now the handle has also been completed. The measured move for this would be a massive move to $46,000.</p>\nInstitutional buying just around the corner\n<p>If one takes into account the potential for enormous institutional buying should the Blackrock Spot Bitcoin ETF, and others be approved, then the second of these technical targets wouldn&rsquo;t be out of bitcoin&rsquo;s reach.</p>\n<p>In spite of impending regulation for cryptocurrencies and all sorts of log jams being thrust into the sector by traditional financial agencies that now see crypto as a real threat to fiat currencies, the mood in the crypto sector is certainly a lot better than it was back in the depths of crypto winter back in November last year.</p>\n<p>Regulation should have the effect of bringing in much larger capital into the space, and although this is also likely to bring in a lot of the unfairness against the average investor and bias towards the institutions just as it is in the traditional financial system, it is to be hoped that the market and changing technology will bring about a more level playing field.</p>\n<p>Even if a rejection for bitcoin happens now, instead of the widely expected breakthrough, this is only likely to be a temporary setback. Just a quick glance at how banks and fiat currencies are doing right now is enough to solidify that scenario.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T09:43:17.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T10:00:00.000Z",
    "title": "Tradecurve overtakes Filecoin as VET prices rise after VeChain inclusion in the Hong Kong Virtual Asset Consortium",
    "url": "https://crypto.news/tradecurve-overtakes-filecoin-as-vet-prices-rise-after-vechain-inclusion-in-the-hong-kong-virtual-asset-consortium/",
    "description": "Tradecurve presale is ongoing and has surpassed Filecoin. The ongoing presale is a contributing factor. Meanwhile, VeChain has been listed in the Hong Kong Virtual Asset Consortium"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T10:00:47.000Z",
    "title": "Aptos (APT) Gains By 10% Ahead Of July Token Release",
    "url": "https://www.newsbtc.com/aptos-apt/aptos-apt-gains-by-10-ahead-of-july-token-release/",
    "description": "APT, the native token of the Aptos Network, is currently making market waves as it prepares for its upcoming token release in July. According to data by CoinMarketCap, APT has gained by 10.14% in the last 24 hours, emerging as part of the top gainers in today’s market.  Aptos Anticipates New Token Release According to data from the token tracker site Token Unlocks,  4.54 million APT tokens, valued at $36.94 million, are scheduled to be released on July 12. This upcoming token release will account for 2.17% of the total circulating supply.  For investors familiar with the APT market, this is quite normal, as the Aptos Network is programmed to unlock new tokens on the 12th of each month. These tokens are released to the Aptos Foundation as well as its user community to support ecosystem projects, provide grants, and push other community growth initiatives.  Related Reading: Coinbase Stock Soars Nearly 12% As BlackRock Reveals Surveillance Partnership However, while APT is currently gaining, the effects of token release on the market are unpredictable, as seen in previous times. In January, APT witnessed a jump of over 50% following the scheduled unlock but fell by 13% in February after the same event occurred. Following the launch of the Aptos Mainnet in October 2022, the total supply of APT tokens stood at 1 billion. Of this amount, data from Token Unlocks shows that 166.35 million APT tokens have been unlocked so far, representing only 17% of the total supply. APT Price Analysis On Saturday, October 19, 2022, the Aptos (APT) token made an impressive debut in the crypto market, reaching a market price of $100.  However, this was followed by a sharp downturn as the price plunged to the $3.5 level. Over the next three months, APT gradually recovered and climbed to the $20.00 price zone, where it was resisted.  Since then, the token has experienced an overall bearish trend losing over 58% of its value to date. APT Trading At $8.15 On The 1-Hour Chart &#124; Source: APTUSD Chart On Tradingview.com Looking at the APT hourly chart, the token’s current price movement suggests it has encountered a resistance zone at the price level of $8.33. If APT is able to break through this barrier, it will continue its bullish momentum and possibly trade as high as $8.82, which appears to be the next resistance zone.  Related Reading: USDC Circulating Supply Down 38% Since Jan. 1 – Will It Affect Price? However, failure to push past the $8.33 price mark may induce a bearish trend with the possibility of the token falling to a market price of $7.14, which represents the next support level.  At the time of writing, APT is currently trading at $8.1556, with a 0.17% decrease in the last hour. The token’s daily trading volume is also up by $276 million, with a 137% gain. Aptos stands as the 33rd biggest cryptocurrency with a market cap of $2 billion.  Featured Image from iStock, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T10:00:23.000Z",
    "title": "Will Ethereum Classic Maintain Its Momentum Against Emerging Crypto Giants?",
    "url": "https://www.crypto-news-flash.com/will-ethereum-classic-maintain-its-momentum-against-emerging-crypto-giants/?utm_source=rss&utm_medium=rss&utm_campaign=will-ethereum-classic-maintain-its-momentum-against-emerging-crypto-giants",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T120513.888.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T120513.888.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T120513.888-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum Classic (ETC) has closed off the month of June with a 13% rise in price, leaving investors to wonder whether July will be a bullish month for them. However, this might not be the case, as a new rising star in the crypto world has stolen all the market attention, promising excellent returns and [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-05T09:55:34.000Z",
    "title": "4 Under The Radar Crypto Gems with Huge Potential",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-under-the-radar-crypto-gems-with-huge-potential/",
    "description": "<p>There is no doubt. This Bullrun is going to be Massive! And If you want to make big gains in this bull run, you must keep your eyes on these 3 crypto gems. Coin 1: Pendle Pendle, the project that was listed in Binance Innovation Zone &#38; Launchpool. Yesterday marked a jaw-dropping 1552% from the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-under-the-radar-crypto-gems-with-huge-potential/\">4 Under The Radar Crypto Gems with Huge Potential</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]