[
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T09:50:03.000Z",
    "title": "Comparing history of GLD to potential spot Bitcoin ETF",
    "url": "https://cryptoslate.com/insights/comparing-history-of-gld-to-potential-spot-bitcoin-etf/",
    "description": "<p>Quick Take According to the World Gold Council, SPDR Gold Shares (GLD) is the largest physically backed gold exchange-traded fund (ETF). This ETF launched back in 2004 when the price of gold was priced at roughly $410. This ETF allowed exposure for investors at a relatively easy level. Will Clemente, Co-Founder at Reflexivity Research, showed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/comparing-history-of-gld-to-potential-spot-bitcoin-etf/\">Comparing history of GLD to potential spot Bitcoin ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T09:40:17.000Z",
    "title": "Binance CEO issues cease and desist to unaffiliated Binance Nigeria Limited",
    "url": "https://cryptoslate.com/binance-ceo-issues-cease-and-desist-to-unaffiliated-binance-nigeria-limited/",
    "description": "<p>Binance CEO Changpeng &#8216;CZ&#8217; Zhao said his exchange had issued a cease and desist notice to an unaffiliated &#8216;scam&#8217; entity, &#8220;Binance Nigeria Limited,&#8221; according to a June 18 tweet. Binance Nigeria Limited declared illegal. On June 9, the Nigerian Securities and Exchange Commission declared Binance Nigeria Limited&#8217;s operation illegal within the country. The regulator stated that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-ceo-issues-cease-and-desist-to-unaffiliated-binance-nigeria-limited/\">Binance CEO issues cease and desist to unaffiliated Binance Nigeria Limited</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T10:00:30.000Z",
    "title": "CZ, Binance US Pleased With SEC Deal Despite ‘Unwarranted’ Emergency Relief",
    "url": "https://news.bitcoin.com/cz-binance-us-pleased-with-sec-deal-despite-unwarranted-emergency-relief/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"CZ, Binance US Pleased With SEC Deal Despite ‘Unwarranted’ Emergency Relief\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cz-binance-sec.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance founder Changpeng Zhao (CZ) expressed his satisfaction over the agreement with the U.S. securities regulator preventing the freezing of the exchange’s assets in the United States. The crypto company’s American subsidiary also stated it’s pleased that the SEC’s request for a temporary restraining order has not been granted by the court. Agreement With the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T09:45:25.000Z",
    "title": "PEPE Sustains Steady Ascent, Fueling Speculation Of Profits",
    "url": "https://www.newsbtc.com/news/pepe-sustains-steady-ascent/",
    "description": "PEPE is now on the verge of a remarkable resurgence. After facing a decline in popularity, the meme coin seems to be reclaiming its former glory.  With each passing day, this popular meme token seems to be clawing back all its losses, generating buzz among enthusiasts and observers alike. At the time of writing, PEPE’s price has seen a remarkable seven-day increase of nearly 10%. But what exactly lies behind this newfound momentum? How has PEPE managed to overcome its tumultuous past and forge a path towards redemption? Is A Rebound In The Offing For PEPE? Amidst recent market fluctuations, PEPE enthusiasts have found renewed hope as the price of the iconic meme character experiences a significant surge. Recent price report on PEPE indicate a strong bullish reversal from the support level of $0.00000084, with buyers seizing the opportunity to maximize their investments. Related Reading: Polygon (MATIC) Sees Surge In Whale Buying Despite US Regulatory Pressure The surge in PEPE&#8217;s value has been further fueled by Bitcoin&#8217;s rise to the $26.5k price zone during the same period, providing additional encouragement to PEPE bulls. As a result, investors are now speculating on the potential for further price gains in the short term. As of the latest update, CoinGecko reports that PEPE&#8217;s price has climbed to $0.0000009421, reflecting a weekly rally of nearly 10%.  Source: Coingecko Breaking Bearish Trends, Facing Resistance The recent surge in PEPE&#8217;s price has not only brought optimism to its enthusiasts but has also paved the way for a potential bullish reversal. This upward momentum has been accompanied by a breakthrough, as the meme coin managed to surpass the bearish trendline. This breakthrough highlights the presence of significant buying pressure and further strengthens the belief among PEPE bulls. &#160; PEPE price movement in the weekly timeframe. Source: CoinMarketCap. However, there are still hurdles to overcome on the path to recovery. Bulls will encounter resistance at the $0.00000115 level, which marks an important threshold. Related Reading: Binance Coin (BNB) Defies Regulatory Pressure, Holds $220 Support A successful session close above this resistance would signify a break from the lower lows associated with the bearish slide, potentially igniting even more bullish activity and increasing investor confidence. The market cap of cryptocurrencies at $1 trillion as of June 19. Chart: TradingView.com On the flip side, failure to reclaim the $0.00000115 level would reintroduce sellers into the market. This would create opportunities for shorting, especially if the price remains unable to break above the resistance level. It is a critical moment for PEPE, and the outcome will determine the next phase of its journey. It&#8217;s worth noting that the fortunes of PEPE are closely tied to the performance of Bitcoin bulls. As the leading cryptocurrency experiences further upside movement, investors are likely to flock to PEPE in search of short-term gains.  Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T10:00:21.000Z",
    "title": "SEC Documents Boost Ether as JPMorgan Foresees Regulatory Shift in Crypto Market",
    "url": "https://www.crypto-news-flash.com/sec-documents-boost-ether-as-jpmorgan-foresees-regulatory-shift-in-crypto-market/?utm_source=rss&utm_medium=rss&utm_campaign=sec-documents-boost-ether-as-jpmorgan-foresees-regulatory-shift-in-crypto-market",
    "description": "The release of the Hinman papers in the SEC&#8217;s case against Ripple is expected to benefit ether (ETH) and promote decentralization in the crypto market. The Hinman documents may influence regulatory efforts, potentially leading to a new category for decentralized cryptocurrencies like ether. The recent release of the Hinman papers in the ongoing case between [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T09:41:40.000Z",
    "title": "Tech Giants as Crypto Enforcers? Balaji Srinivasan Warns Apple, Microsoft, and Google Could Aid Government Seizure of Digital Assets",
    "url": "https://www.crypto-news-flash.com/tech-giants-as-crypto-enforcers-balaji-srinivasan-warns-apple-microsoft-and-google-could-aid-government-seizure-of-digital-assets/?utm_source=rss&utm_medium=rss&utm_campaign=tech-giants-as-crypto-enforcers-balaji-srinivasan-warns-apple-microsoft-and-google-could-aid-government-seizure-of-digital-assets",
    "description": "Former Coinbase CTO Balaji Srinivasan believes governments can seize digital assets with tech giants playing a key role.  Srinivasan had earlier predicted that Bitcoin would hit $1 million in 90 days after March 17, but &#8220;failed to see the light of the day.&#8221; Former Chief Technology Officer (CTO) of Coinbase Balaji Srinivasan has in a [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-19T09:45:16.000Z",
    "title": "Beginner’s Guide About Coti – Part 1",
    "url": "https://www.altcoinbuzz.io/reviews/beginners-guide-about-coti-part-1/",
    "description": "<p>Since the birth of Bitcoin, crypto has been around for 15 years. It was much simpler back then. In fact, OG cryptos were focused just on payments. Today, we&#8217;ve got much more advanced projects that are in the payment space. One such project that&#8217;s really looking to disrupt this space here is COTI. With that, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/beginners-guide-about-coti-part-1/\">Beginner’s Guide About Coti &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]