[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-04T14:56:24.000Z",
    "title": "CEO of $7.2 Trillion Asset Manager Vanguard: “We Won’t Be Pursuing a Bitcoin ETF”",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ceo-of-7-2-trillion-asset-manager-vanguard-we-wont-be-pursuing-a-bitcoin-etf/",
    "description": "Tim Buckley, Chairman and CEO at Vanguard, which is the world’s second-largest asset manager and ETF provider after BlackRock, joined CNBC’s ‘The Exchange’ to share his insights on the current state of the stock and bond markets and the behavior of investors amidst rising interest rates. Speaking from Vanguard’s headquarters in Pennsylvania, Buckley offered guidance […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-04T15:00:33.000Z",
    "title": "Why This Fidelity Investments Director Believes Bitcoin Is ‘Exponential Gold’",
    "url": "https://www.newsbtc.com/news/bitcoin/fidelity-bitcoin-exponential-gold/",
    "description": "The Director of Global Macro at Fidelity Investments, Jurrien Timmer, recently provided insights into the potential of the flagship cryptocurrency, Bitcoin, and went as far as labeling the crypto token as “exponential gold.” A Glance At Bitcoin’s Adoption Curve In a post released on his X (formerly Twitter) platform, Timmer mentioned that Bitcoin’s scarcity and adoption curve potentially allow it to be a “high-powered hedge against monetary shenanigans,” likely alluding to the fact that the token’s features make it a great option to hedge against inflation. That is why he sees the token as “exponential gold.” Related Reading: Legal Expert Explains Why Ripple Will Always Back XRP Source: X He further elaborated on Bitcoin’s adoption curve, stating that it has so far followed a “typical S-curve shape,” which places it in good company with other major innovations that went through such an adoption journey. One of them is mobile phones, as Timmer noted that Bitcoin’s adoption curve in 2020 resembled that of mobile phones in the ‘80s and ‘90s.  Source: X Bitcoin, however, seems to have moved to another stage in the adoption curve, as Timmer stated that the “real-rate narrative changed from dovish in 2020 to hawkish in 2022.” He further suggested that Bitcoin has moved past the stage of a rapid rise as its adoption curve has flattened out. With this, Timmer believes that it now shares similarities with the adoption curve of the internet in the 2000s as the crypto token “has not made much progress since 2021.” Bitcoin Volatility: Good Or Bad? In a subsequent post, Timmer put Bitcoin’s volatility in perspective as he compared it with other asset classes. First, he shared a risk-reward chart for the pandemic and post-pandemic era ranging from 2020 to this year. The SPX seemed to provide the best risk-reward with close to 24% return.  Source: X Timmer then went on to share another chart, which included Bitcoin this time around. The foremost cryptocurrency notably stood out from the rest, as he mentioned that Bitcoin was “in a different universe,” with a 58% return.  Source: X Related Reading: Will Cardano Replicate Solana’s Surge? Analyst Reveals Similarities For 80% Rise Bitcoin’s high volatility seems to have contributed to such returns in no small way, as Timmer mentioned that the crypto token’s huge drawdowns also come with large gains. To drive home his point, he shared another chart that showed drawdowns and rallies, which various asset classes have experienced from their 2-year high and low, respectively.  Source: X The chart showed that Bitcoin experienced a 54% drawdown from its two-year high but is also up by 84% from its low in the same period.  This is more impressive when one considers how other asset classes have fared in the same period as Timmer stated that Government bonds “can’t hold a candle” to Bitcoin’s risk-reward math.   BTC jumps back to $34,800 &#124; Source: BTCUSD on Tradingview.com Featured image from Capital.com, chart from Tradingview.com"
  }
]