[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T20:21:43.000Z",
    "title": "Cripto-amigável não significa cripto-fácil",
    "url": "https://www.coindesk.com/pt-br/consensus-magazine/2023/12/14/crypto-friendly-does-not-mean-crypto-easy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A regulamentação criptográfica dos EUA tem muito a aprender com o Japão, Singapura e Hong Kong. Mas embora essas jurisdições ofereçam clareza jurídica em relação aos ativos digitais, elas também têm algumas das regras mais rígidas do mundo, diz Emily Parker, da CoinDesk."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T20:21:43.000Z",
    "title": "Crypto-Friendly Does Not Mean Crypto-Easy",
    "url": "https://www.coindesk.com/consensus-magazine/2023/12/14/crypto-friendly-does-not-mean-crypto-easy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. crypto regulation has much to learn from Japan, Singapore and Hong Kong. But while these jurisdictions offer legal clarity around digital assets, they also have some of the toughest rules in the world, says CoinDesk’s Emily Parker."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T20:21:43.000Z",
    "title": "Cripto-friendly non significa cripto-facile",
    "url": "https://www.coindesk.com/it/consensus-magazine/2023/12/14/crypto-friendly-does-not-mean-crypto-easy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "La regolamentazione statunitense delle criptovalute ha molto da imparare da Giappone, Singapore e Hong Kong. Ma sebbene queste giurisdizioni offrano chiarezza giuridica sulle risorse digitali, hanno anche alcune delle regole più severe al mondo, afferma Emily Parker di CoinDesk."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T20:21:43.000Z",
    "title": "Crypto-friendly ne signifie pas crypto-facile",
    "url": "https://www.coindesk.com/fr/consensus-magazine/2023/12/14/crypto-friendly-does-not-mean-crypto-easy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "La réglementation américaine en matière de cryptographie a beaucoup à apprendre du Japon, de Singapour et de Hong Kong. Mais si ces juridictions offrent une clarté juridique concernant les actifs numériques, elles appliquent également certaines des règles les plus strictes au monde, déclare Emily Parker de CoinDesk."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T20:30:00.000Z",
    "title": " Security engineer pleads guilty to Nirvana Finance exploit and one other hack ",
    "url": "https://cointelegraph.com/news/security-engineer-pleads-guilty-nirvana-finance-exploit-one-other",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGExZTVhYmEtYjkyYi00ODdlLTlkN2YtNDA0NDI5N2IyZmY3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Shakeeb Ahmed was arrested for hacking an unspecified DEX, then admitted to Nirvava Finance hack too.</p>\n                    <p><p>A software engineer pleaded guilty to one count of computer fraud in connection with the hacking Nirvana Finance and an unnamed decentralized cryptocurrency exchange in the Southern District Court of New York on Dec. 14. The United States Attorney’s Office said the case was the first-ever conviction for hacking a smart contract.</p><p>Shakeeb Ahmed, <a href=\"https://www.justice.gov/usao-sdny/pr/former-security-engineer-international-technology-company-pleads-guilty-hacking-two\" target=\"_blank\" rel=\"noopener nofollow\">described</a> as a “senior security engineer for an international technology company,” was arrested in July in connection with the hack of the unnamed exchange on or about July 2 and 3, 2022. According to the U.S. Attorney’s Office statement: </p><p>Ahmed returned all but $1.5 million to the exchange, which “agreed not to refer the attack to law enforcement.” The exchange “allowed users to exchange different kinds of cryptocurrencies, and paid fees to users who deposited cryptocurrency to provide liquidity on the Crypto Exchange.”</p><p><a href=\"https://cointelegraph.com/news/security-engineer-pleads-guilty-nirvana-finance-exploit-one-other\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-14T20:30:50.000Z",
    "title": "Japan’s web3 ecosystem aims to attract 5,000 international firms",
    "url": "https://cryptoslate.com/japans-web3-ecosystem-aims-to-attract-5000-international-firms/",
    "description": "<p>The Asia Web3 Alliance Japan (AWAJ) has announced a bold initiative to integrate over 5,000 web3 companies from across the globe into Japan and Asia&#8217;s rapidly evolving web3 ecosystem. The initiative, unveiled during AWAJ&#8217;s first press conference on Dec. 14, marks a significant step towards fostering international collaboration and technological advancement in the web3 space. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/japans-web3-ecosystem-aims-to-attract-5000-international-firms/\">Japan&#8217;s web3 ecosystem aims to attract 5,000 international firms</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T20:32:55.000Z",
    "title": "Generative Artificial Intelligence set to transform global business landscape in 2024",
    "url": "https://www.cryptopolitan.com/generative-ai-on-global-business-landscape/",
    "description": "In what promises to be a pivotal year for technological innovation, 2024 is poised to usher in a transformative era for generative artificial intelligence (AI). This emerging technology is primed to catalyze a radical shift across the global economic landscape, offering unprecedented capabilities, accessibility, and scalability.&#160; As businesses increasingly recognize its vast potential, advanced generative [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T20:23:32.000Z",
    "title": "AI-driven cheat sheets and chatbots in product marketing",
    "url": "https://www.cryptopolitan.com/ai-driven-cheat-sheets-and-chatbots/",
    "description": "In the realm of product marketing, two indispensable tools have emerged as game-changers, offering efficiency and effectiveness like never before.&#160; Cheat Sheets and Chatbots have risen to prominence, and their evolution has been significantly accelerated by the application of artificial intelligence (AI). This article delves into the pivotal role of these tools and how AI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T20:23:25.000Z",
    "title": "Los Angeles cryptocurrency scam leads to federal Indictment of four individuals",
    "url": "https://www.cryptopolitan.com/los-angeles-scam-indictment-four-individuals/",
    "description": "Four individuals in Los Angeles have been indicted for their alleged involvement in a sophisticated money laundering scheme related to cryptocurrency investment scams. The U.S. Department of Justice (DOJ) revealed that this scheme involved the use of shell companies and bank accounts to launder over $80 million, which was deceitfully obtained from victims through fraudulent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T20:17:26.000Z",
    "title": "Putin faces AI’s tough questions on doubles and AI dangers",
    "url": "https://www.cryptopolitan.com/putin-faces-ais-tough-questions/",
    "description": "Russian President Vladimir Putin faced an unexpected question during his annual news conference as an AI-generated version of himself posed a query about artificial intelligence and the existence of body doubles. AI &#8216;double&#8217; questions Putin During his annual news conference, Russian President Vladimir Putin encountered an unexpected and intriguing moment when an AI-generated version of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T20:14:56.000Z",
    "title": "Janet Yellen still striving to mend US-China relationship",
    "url": "https://www.cryptopolitan.com/janet-yellen-striving-to-mend-us-china/",
    "description": "U.S. Treasury Secretary Janet Yellen is choreographing a careful yet forward-moving approach towards managing the US-China relationship in the coming year. Her strategy, outlined during a recent event hosted by the US-China Business Council, underscores the United States&#8217; commitment to maintaining robust ties with China, the world&#8217;s second-largest economy, despite the complexities and challenges that [&#8230;]"
  }
]