[
  {
    "source": "CoinDesk",
    "date": "2023-06-22T16:25:42.000Z",
    "title": "Pepecoin Becomes Biggest Meme Coin Gainer With 70% Weekly Jump",
    "url": "https://www.coindesk.com/markets/2023/06/22/pepecoin-becomes-biggest-meme-coin-gainer-with-70-weekly-jump/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The tokens racked up $800 million in trading volumes over the past 24 hours, data shows."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-22T16:24:39.000Z",
    "title": "Three Arrows Co-Founders Are Back With a New VC Fund. Is Anyone Buying?",
    "url": "https://decrypt.co/145792/three-arrows-co-founders-are-back-with-a-new-vc-fund-is-anyone-buying",
    "description": "The co-founders of the bankrupt crypto hedge fund Three Arrows Capital (3AC) are launching a new investment venture."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-22T16:15:27.000Z",
    "title": "Ethereum Micropayments Solution Volition Says It'll Make 'Crypto for Coffee Transactions Viable'",
    "url": "https://decrypt.co/145598/ethereum-micropayments-solution-volition-says-itll-make-crypto-for-coffee-transactions-viable",
    "description": "StarkWare’s novel scaling functionality, Volition, promises to make it possible to reduce Ethereum gas fees by up to 90%."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T16:30:05.000Z",
    "title": "Short-term Bitcoin holders signal positive market momentum as BTC breaks $30K",
    "url": "https://cryptoslate.com/short-term-holders-signal-positive-market-momentum-as-btc-breaks-30k/",
    "description": "<p>In the midst of Bitcoin's recent surge past $30,000, CryptoSlate's detailed analysis of short-term holders (STHs) and their realized profit/loss (RPL) ratio reveals crucial insights into market trends. As the STH RPL ratio experiences a positive shift, history shows this could signal a significant turning point in the market. But what does this mean for the upcoming market momentum? Find out the implications of this key metric in our exclusive Alpha article...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/short-term-holders-signal-positive-market-momentum-as-btc-breaks-30k/\">Short-term Bitcoin holders signal positive market momentum as BTC breaks $30K</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T16:25:32.000Z",
    "title": "Barking up the digital tree: German Intelligence service unleashes dog-themed NFTs to fetch cyber talent",
    "url": "https://www.cryptopolitan.com/german-intelligence-service-dog-themed-nfts/",
    "description": "The German Intelligence Service (BND) has adopted a novel tack in its ongoing effort to recruit new agents by issuing (1) Ethereum-based NFTs with a canine theme. The BND has capitalized on the current NFT fad by releasing a line of products based on cute dog characters with an aim to recruit tech-savvy workers and ... <a title=\"Barking up the digital tree: German Intelligence service unleashes dog-themed NFTs to fetch cyber talent\" class=\"read-more\" href=\"https://www.cryptopolitan.com/german-intelligence-service-dog-themed-nfts/\" aria-label=\"More on Barking up the digital tree: German Intelligence service unleashes dog-themed NFTs to fetch cyber talent\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T16:22:53.000Z",
    "title": "Should the Audiobook Industry Favor AI Narrators Over Human Voice Actors?",
    "url": "https://www.cryptopolitan.com/should-audiobook-industry-favor-ai-narrators/",
    "description": "Technological advancements are paving the way for artificial intelligence (AI) to replace human voice actors in the narration of audiobooks. As AI enters the publishing industry, professionals within the field are raising concerns about the future of their careers. While AI-generated voices have made their way into platforms like Google Play and Apple Books, experts ... <a title=\"Should the Audiobook Industry Favor AI Narrators Over Human Voice Actors?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/should-audiobook-industry-favor-ai-narrators/\" aria-label=\"More on Should the Audiobook Industry Favor AI Narrators Over Human Voice Actors?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T16:13:48.000Z",
    "title": "Feds chairman Jerome Powell acknowledges Bitcoin’s resilience as a long-term asset",
    "url": "https://www.cryptopolitan.com/powell-calls-bitcoin-a-long-term-asset/",
    "description": "Federal Reserve Chairman Jerome Powell, the highest official in the United States monetary system, has publicly acknowledged Bitcoin&#8217;s long-term viability, which comes as something of a surprise. The fact that one of the world&#8217;s most powerful financiers has taken notice of Bitcoin and other cryptocurrencies is yet another indication of their rising legitimacy in the ... <a title=\"Feds chairman Jerome Powell acknowledges Bitcoin&#8217;s resilience as a long-term asset\" class=\"read-more\" href=\"https://www.cryptopolitan.com/powell-calls-bitcoin-a-long-term-asset/\" aria-label=\"More on Feds chairman Jerome Powell acknowledges Bitcoin&#8217;s resilience as a long-term asset\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T16:30:45.000Z",
    "title": "SHIB Jumps By 14% In A Single Day, As Shiba Inu “Worldpaper” Gets Closer",
    "url": "https://www.newsbtc.com/shiba-inu/shib-jumps-by-14-in-a-single-day-as-shiba-inu-worldpaper-gets-closer/",
    "description": "The price of Shiba Inu (SHIB) continues on its bullish run, having gathered great momentum in the past week. Following its breakthrough at the $0.000007 threshold, the token price has been on a nearly 20% price upswing. What could be driving the price of SHIB? Is the token heading for the $0.00001 price level? Shiba Inu Price Action &#8211; Journey To $0.00001? Indeed, Shiba Inu’s sustained price rally can be attributed to different factors, including exciting project updates. But, the positive social sentiment surrounding the cryptocurrency seems to be the major driving force behind its price. Related Reading: Shiba Inu (SHIB) Positive Social Sentiment Sparks Bullish Speculation According to data from CoinGecko, SHIB trades at $0.00000839, with a 14% price increase in the last 24 hours. A broader look at the market shows that the token has performed even better in the past week, recording a 25% price jump. It is worth noting that the Shiba Inu token has just only begun its recovery, having been on a downtrend since the beginning of February. On February 5, the coin reached its 2023 peak &#8211; so far &#8211; at $0.00001473, which means it is still on a 43% price decline.  That said, SHIB looks set for the psychological $0.00001 price level, although it faces significant resistance at $0.0000084. If it manages to break through this threshold, a rally to $0.00001 is only then likely. SHIB facing resistance at $0.00000840 &#124; Source: SHIBUSD chart from TradingView According to CoinMarketCap data, Shiba Inu boasts a market capitalization of more than $4.9 billion, with a 13.3% increase in the last 24 hours. The token currently ranks as the 14th biggest cryptocurrency by market cap.  Shiba Inu Announces The Imminent Release Of The “Worldpaper” On Wednesday, June 21, Shytoshi Kusama published a blog post on the Shiba Inu website, providing updates on the meme-inspired ecosystem. Following its teaser video on his Twitter, the Shiba Inu lead developer took a deep dive into the new “Shibacals”, dissecting what the project means for the Shiba Inu ecosystem. Shytoshi also announced the impending release of the “Worldpaper”. This document is expected to contain the long-term plan for full and complete decentralization, new official partners (and a recap of current ones), and other information. He stated that the Worldpaper is unique and different from the “Woofpaper”, as the upcoming paper will be about “saving” the world through decentralization.  Related Reading: Shiba Inu: This New AI Meme Token Partnered With Shibarium, Surges 81% Although the time for Worldpaper’s release was not specified in the blog post, the pseudonymous developer did note that the paper will be unveiled alongside &#8211; or right before &#8211; Shibarium.  Shibarium is an upcoming layer-2 network built on the Ethereum blockchain for Shiba Inu. As of press time, Shibarium has no official launch date. Featured image from Dreamstime.com, chart from TradingView"
  }
]