[
  {
    "source": "Crypto Briefing",
    "date": "2024-02-20T09:52:10.000Z",
    "title": "SBF jail photos surface, former inmate says he is ‘more gangster’ than 6ix9ine ",
    "url": "https://cryptobriefing.com/sbf-jail-photos-inmate-says-more-gangster-6ix9ine/?utm_source=feed&utm_medium=rss",
    "description": "The photo was taken on December 17, 2023 at the Metropolitan Detention Center in Brooklyn, with SBF sporting a full beard."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T10:04:37.000Z",
    "title": "Cardano Price Prediction 2024-2033: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2024-2033 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How Much is ADA [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T10:00:00.000Z",
    "title": "Crypto Assets With Momentum – These 4 Cryptocurrencies Have High-Profit Targets",
    "url": "https://www.cryptopolitan.com/crypto-assets-with-momentum-these-4-cryptocurrencies-have-high-profit-targets/",
    "description": "TLDR The cryptocurrency world is abuzz reeling off the back of the SEC’s approval of spot ETFs for Bitcoin and the upcoming Bitcoin halving. This excitement has been reflected in the broader crypto outlook, with top altcoins like Dymension (DYM), Render (RNDR), and Sui network (SUI) delivering impressive gains. However, $RBLZ has netted the most [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T09:55:15.000Z",
    "title": "Policymakers’ Response To AI’s Growing Environmental Footprint",
    "url": "https://www.cryptopolitan.com/to-ais-growing-environmental-footprint/",
    "description": "The rapid proliferation of generative artificial intelligence (AI) technologies has brought both excitement and concern. While these AI systems promise transformative capabilities, their environmental footprint is becoming increasingly apparent. &#160;As policymakers grapple with the implications, regulations and standards are being proposed to address the growing environmental concerns surrounding AI usage. Growing environmental concerns Generative AI, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T09:53:19.000Z",
    "title": "Leonardo Spearheads European Space Cloud Initiative for Military Applications",
    "url": "https://www.cryptopolitan.com/leonardo-spearheads-european-space-cloud/",
    "description": "Leonardo, a global leader in aerospace, defense, and security, has embarked on a groundbreaking project titled &#8220;Military Space Cloud Architecture&#8221; (MILSCA), commissioned by the Italian Ministry of Defense.&#160; This initiative, part of the National Military Research Plan, aims to revolutionize space-based computing and storage capabilities for government and national Armed Forces. Innovative space cloud architecture [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T10:00:00.000Z",
    "title": "Internet Computer and Ethereum traders eye Kelexo for potential 25x",
    "url": "https://crypto.news/internet-computer-and-ethereum-traders-eye-kelexo-for-potential-25x/",
    "description": "Ethereum and Internet Computer traders are expressing interest in Kelexo amid growing speculation of a 25x potential. The advent of Bitcoin (BTC) has caused the Internet Computer (ICP) to climb, indicative of the increasing demand for assets related to Bitcoin. At&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T09:40:50.000Z",
    "title": "Worldcoin (WLD) Just Added 170% To Its Value – What’s Going On?",
    "url": "https://www.newsbtc.com/news/worldcoin-wld-just-added-170-to-its-value-whats-going-on/",
    "description": "Worldcoin (WLD), a blockchain-based project fueled by biometric verification, has ignited a firestorm of investor interest, skyrocketing 170% in the past week to reach a record high of $7.48. This meteoric rise stands out against a backdrop of sluggish performance in many other altcoins, prompting questions about the driving forces behind this surge and its potential for longevity. WLD notching an impressive 170% rally in the last week. Source: Coingecko Related Reading: NEAR Skyrockets Nearly 30% – Investors Intrigued By These Metrics Worldcoin: Bullish Metrics And AI Hype Fuel The Flames Several factors appear to be stoking the flames of Worldcoin&#8217;s current momentum. Trading volume has soared an impressive 44% to nearly $840 million, propelling the token into the top 10 by volume despite languishing at 91st place in market capitalization. This hyperactive trading suggests strong investor interest and hints at further growth potential. Adding to the excitement, Worldcoin boasts over 1 million daily active users on its World App, signifying significant adoption. Moreover, the project basks in the reflected glory of its association with OpenAI, the renowned artificial intelligence (AI) research lab co-founded by Worldcoin&#8217;s creator, Sam Altman. The recent release of OpenAI&#8217;s cutting-edge text-to-video generator, dubbed Sora, has generated a wave of positive sentiment towards Worldcoin, potentially spilling over to boost its token price. Worldcoin currently trading at $6.9826 on the daily chart: TradingView.com Privacy Concerns Cloud The Horizon However, Worldcoin&#8217;s path to success is not paved in gold. Regulatory scrutiny looms large, casting a shadow over its iris-scanning verification method and potential privacy violations. European countries, Argentina, Kenya, and Hong Kong have expressed concerns about this technology, raising the specter of regulatory roadblocks that could hinder future adoption and derail the project&#8217;s long-term goals. Alameda&#8217;s Shadow Adds A Layer Of Uncertainty Another layer of uncertainty comes from Alameda Research, a major cryptocurrency investment firm. Alameda currently holds a significant portion of WLD tokens, valued at a staggering $186 million, representing a whopping 33% of its portfolio. Alameda Research Crypto Portfolio. Source: Arkham Intelligence While this investment signifies potential confidence in Worldcoin, Alameda&#8217;s recent history of liquidating holdings in other cryptocurrencies casts doubt on their future plans with WLD. Their intentions remain shrouded in secrecy, adding a layer of speculation to the current price rally. Can Worldcoin Overcome The Hurdles? Only time will tell whether Worldcoin can overcome these challenges and navigate the treacherous waters of the crypto market. While the project boasts impressive user numbers and an exciting association with OpenAI, regulatory concerns and questions about Alameda&#8217;s motives pose significant risks. Related Reading: Bitcoin On Steroids: Key Technical Factors Fueling The Rally To $70,000 Investors should carefully consider these factors and conduct their own research before placing bets on Worldcoin&#8217;s future. The coming months will be crucial for the project, as it navigates regulatory scrutiny, addresses privacy concerns, and clarifies the intentions of its major investors. Whether Worldcoin will emerge as a true innovator or fade into obscurity remains to be seen. Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-20T10:00:16.000Z",
    "title": "BlackRock’s Bitcoin ETF Hits 100K BTC Milestone; AI Altcoin Presale Poised to Exceed $10 Million",
    "url": "https://www.crypto-news-flash.com/blackrocks-bitcoin-etf-hits-100k-btc-milestone-ai-altcoin-presale-poised-to-exceed-10-million/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-bitcoin-etf-hits-100k-btc-milestone-ai-altcoin-presale-poised-to-exceed-10-million",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-20T085908.189.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-20T085908.189.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-20T085908.189-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-20T085908.189-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-20T085908.189-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-20T085908.189-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The recent surge in interest toward spot Bitcoin Exchange-Traded Funds (ETFs) has been evident, with daily inflows skyrocketing to an impressive $631.3 million. Leading the charge in this burgeoning market, the iShares Bitcoin Trust (IBIT), managed by BlackRock, has achieved a significant milestone, amassing a staggering 100k BTC under its management. Simultaneously, anticipation builds around [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-20T10:02:40.000Z",
    "title": "Crust Network’s SubDA & HRMP Boost for Polkadot",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/crust-networks-subda-hrmp-boost-for-polkadot/",
    "description": "<p>The network seeks to open HRMP channels between Polkadot Assethub and Crust Network. This move is poised to enhance interoperability and functionality within the ecosystem significantly. This initiative is not just a step towards technological advancement but also a stride towards supporting the pinkonomic community through airdrops. Also, further solidifying Crust Network&#8217;s commitment to its [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/crust-networks-subda-hrmp-boost-for-polkadot/\">Crust Network&#8217;s SubDA &#038; HRMP Boost for Polkadot</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-20T10:07:41.000Z",
    "title": "Altcoin Holders Sitting on Massive Unrealized Gains: Santiment Data",
    "url": "https://coinedition.com/altcoin-holders-sitting-on-massive-unrealized-gains-santiment-data/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Here Are The Four Factors Behind Crypto Market’s Latest Surge\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Santiment-Releases-Mid-Month-December-Report-First-Half-Disappoints-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Santiment, a blockchain analytics firm, has pointed out in a recent X post that altcoin holders are sitting on massive unrealized gains after weeks of explosive price action to the upside for many cryptos.&#160;&#160; Apart from a few sluggish altcoins, the “vast majority” of crypto projects have provided significant gains to holders, stated Santiment in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/altcoin-holders-sitting-on-massive-unrealized-gains-santiment-data/\">Altcoin Holders Sitting on Massive Unrealized Gains: Santiment Data</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]