[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T08:23:27.000Z",
    "title": "Crypto Insurer Evertas’ Coverage Limit Increased to $420M: Reuters",
    "url": "https://www.coindesk.com/business/2023/06/05/crypto-insurer-evertas-coverage-limit-increased-to-420m-reuters/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "London-based Arch Insurance International, a syndicate member of Lloyd's of London, has authorized Evertas to increase its coverage limit for a single policy for crypto custodians and exchanges."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-05T08:17:50.000Z",
    "title": "UK Lawmakers Call for a Dedicated Government Role to Oversee Crypto Regulation",
    "url": "https://www.coindesk.com/policy/2023/06/05/uk-lawmakers-call-for-a-dedicated-government-role-to-oversee-crypto-regulation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Crypto and Digital Assets All Parliamentary Group released its long-awaited inquiry into crypto on Monday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T08:17:19.000Z",
    "title": "Do Kwon out on bail once again after court dismisses prosecution appeal",
    "url": "https://cointelegraph.com/news/do-kwon-granted-bail-again-montenegro",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/83191f1c-3f49-48c8-9222-fb7e0677ad18.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Terraform Labs co-founder is out on bail after a successful appeal in Montenegro but will be closely monitored until his next court appearance. </p>\n                    <p><p>According to an <a href=\"https://sudovi.me/ospg/sadrzaj/VLVL\" target=\"_blank\" rel=\"noopener nofollow\">official release</a> from the court, an appeal against an earlier bail agreement by the State Prosecutor’s office was cast aside, allowing <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a> and Terraform Labs’ chief financial officer Han Chang-Joon to await further legal proceedings under house arrest in the country.</p><p>The court readopted bail terms originally set out in a <a href=\"https://cointelegraph.com/news/terra-luna-founder-do-kwon-bail-accepted-by-montenegro\">hearing on May 12</a>, with the pair having to pay $436,000 (400,000 euro) each to be released from custody. Do Kwon and Chang-Joon are now under strict bail terms and are unable to leave the latter’s formal residence in Montenegro.</p><p>The pair are set to be closely monitored by local police. If either of the two Terraform Labs’ duo leave the residence or violate supervision measures, the bail will be forfeit. </p><p>Kwon and Chang-Joon provided personal and financial information to local authorities which included evidence of a sales contract and property registration for an apartment, parking space and basement owned by Chang-Joon.</p><p>Kwon reportedly supplied an invoice for a vehicle as well as bank accounts statements, with the bail terms set so that the defendants would be discouraged from attempting to flee the country.</p><p>Kwon and Chang-Joon were arrested in Montenegro in <a href=\"https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro\">March 2023</a>, after allegedly using false travel documents in an effort to leave the country. The two had their original passports confiscated in South Korea in October 2022.</p><p><strong><em>Related: Breaking: <a href=\"https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro\">Terraform Labs co-founder Do Kwon reportedly arrested in Montenegro</a></em></strong></p><p>The Podgorica High Court noted that verifying the authenticity of Belgium passports and identity cards held by the pair would require more time, while it highlighted its belief that the agreed upon bail amount “is a sufficient guarantee of securing the presence of the defendants.”</p><p>Terraform Labs co-founder Do Kwon has been granted bail in Montenegro after an appeals process by prosecutors was dismissed by the Podgorica district court on June 2.</p><p>Do Kwon remains a wanted figure in a number of jurisdictions. South Korean authorities <a href=\"https://cointelegraph.com/news/prosecutor-says-do-kwon-s-extradition-to-south-korea-would-best-serve-terraform-labs-victims-report\">want to extradite</a> the Terraform Labs co-founder for investigations into the i<a href=\"https://cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse\">infamous collapse of the Terra-LUNA algorithmic stablecoin</a> which wiped out an estimated $40 billion from the cryptocurrency market in June 2021. </p><p>Interpol also <a href=\"https://cointelegraph.com/news/breaking-interpol-red-notice-issued-for-do-kwon-south-korea-prosecutors\">issued a red notice</a> for Kwon in relation to the charges against Kwon in South Korea, while he also <a href=\"https://cointelegraph.com/news/do-kwon-faces-fraud-charges-from-us-prosecutors-hours-after-arrest\">faces a raft of fraud charges</a> in the United States. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\"><strong><em>Home loans using crypto as collateral: Do the risks outweigh the reward?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T08:15:00.000Z",
    "title": "AngelBlock To Kick Off New Era Of Crypto Fundraising With SOLA-X",
    "url": "https://cryptodaily.co.uk/2023/06/angelblock-to-kick-off-new-era-of-crypto-fundraising-with-sola-x",
    "description": "<p>Image source: AngelBlock</p>\n<p>Crypto investors have an enticing opportunity to gain early access to SOLA-X, the first project seeking to raise capital on AngelBlock, a new, non-custodial fundraising protocol.&nbsp;</p>\n<p>AngelBlock revealed SOLA-X as its first raise in a blog post last month, tempting investors with the promise of much greater oversight and control over the project&rsquo;s progress, thanks to its clever &ldquo;post-raise governance&rdquo; mechanisms that ensure it must achieve specific goals prior to unlocking capital.&nbsp;</p>\n<p>On its website, AngelBlock explains that too many investors have been burned in the past due to a lack of transparency and governance on traditional crypto launchpads. Once the funding has been raised, crypto projects are basically left to their own devices, with no checks on their progress or control over how they use the capital they have generated.&nbsp;</p>\n<p>AngelBlock aims to change this with its post-raise governance, which dictates that projects must establish a series of milestones that must be met, to the satisfaction of its investors, before the next chunk of capital can be accessed. Once the project completes a milestone and files a report, investors will have the opportunity to vote on it and can either approve it and unlock the next pot of funds, or reject it and ask the team to make improvements. This way, AngelBlock says the interest of the project&rsquo;s founders and investors become better aligned, increasing the prospects of success.&nbsp;</p>\n<p>To prevent any single investor, or groups of investors, from having a disproportionate influence on these votes, AngelBlock has created options that can define the maximal voting power of a single token holder. The idea with this is that it reinforces democratic decision-making throughout the process.&nbsp;</p>\n\n<p>&ldquo;While giving investors access to exclusive deals yielding high returns and saving time, we want to shape the future of crypto by making the lives of founders and entrepreneurs easier, while protecting investor capital and driving more transparency and benefits to community members of these particular startups,&rdquo; AngelBlock explains in a blog post.</p>\n\n<p>Regarding the first project to launch on AngelBlock, SOLA-X looks like an interesting one. It&rsquo;s a DeFi protocol that has developed an &ldquo;advanced liquidity management system&rdquo;, wherein users can provide a single crypto asset that will be distributed across multiple liquidity pools. Its key promises are to simplify the process of providing liquidity while minimizing the risk of impermanent loss, and to do so it has created an innovative system to manage liquidity in real-time. Through this, it will be able to generate additional yields for investors. The SOLA-X protocol will be fully decentralized, with token holders able to participate in its governance and also stake them for additional rewards. You can read more about SOLA-X on its official website, and on its AngelBlock profile page.&nbsp;</p>\n<p>AngelBlock has developed a unique staking tiers system that grants priority access and larger ticket sizes to investors based on the amount of $THOL tokens they stake. First priority is given to institutional investors, or those who stake at least 500K $THOL, who will have a 24-hour window in which they get first dibs on the token sale. Next will be angel investors, who stake between 100K and 499K $THOL, with their own 24-hour window, followed by value investors who stake between 20K and 99K $THOL. Once that third 24-hour window closes, standard users (who can stake between 0 and 20K $THOL) will have their own opportunity to snap up whatever tokens remain.&nbsp;</p>\n<p>AngelBlock&rsquo;s SOLA-X raise will take place at the end of this month.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T08:20:44.000Z",
    "title": "Stunning Force: TMS Network (TMSN) Fortifies Superiority Over Filecoin (FIL) and Solana (SOL)",
    "url": "https://www.cryptopolitan.com/stunning-force-tms-network-tmsn-fortifies-superiority-over-filecoin-fil-and-solana-sol/",
    "description": "There’s plenty of room on the crypto stage for new tokens of many kinds, so it’s not like tokens are all competing for the same ground. However, market saturation is making the market more competitive, as has been shown by the pressure TMS Network (TMSN) has been putting on Filecoin (FIL) and Solana (SOL). TMS ... <a title=\"Stunning Force: TMS Network (TMSN) Fortifies Superiority Over Filecoin (FIL) and Solana (SOL)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stunning-force-tms-network-tmsn-fortifies-superiority-over-filecoin-fil-and-solana-sol/\" aria-label=\"More on Stunning Force: TMS Network (TMSN) Fortifies Superiority Over Filecoin (FIL) and Solana (SOL)\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T08:35:50.000Z",
    "title": "The TMS Network (TMSN) Community Outshines Litecoin (LTC) And ARPA (ARPA) With 1963% Crusade",
    "url": "https://www.crypto-news-flash.com/the-tms-network-tmsn-community-outshines-litecoin-ltc-and-arpa-arpa-with-1963-crusade/?utm_source=rss&utm_medium=rss&utm_campaign=the-tms-network-tmsn-community-outshines-litecoin-ltc-and-arpa-arpa-with-1963-crusade",
    "description": "<p>TMS Network (TMSN) is growing fast, leaving other platforms in the dust. Its token has experienced a price surge of 1,963% in the current fourth presale phase, outdoing Litecoin (LTC) and ARPA (ARPA). This growth proves that people are noticing TMS Network (TMSN), and they like what they see.  This article will take a look [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/the-tms-network-tmsn-community-outshines-litecoin-ltc-and-arpa-arpa-with-1963-crusade/\">The TMS Network (TMSN) Community Outshines Litecoin (LTC) And ARPA (ARPA) With 1963% Crusade</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T08:23:04.000Z",
    "title": "Building a Winning Portfolio: Ripple (XRP) and the Rising InQubeta (QUBE)",
    "url": "https://www.crypto-news-flash.com/building-a-winning-portfolio-ripple-xrp-and-the-rising-inqubeta-qube/?utm_source=rss&utm_medium=rss&utm_campaign=building-a-winning-portfolio-ripple-xrp-and-the-rising-inqubeta-qube",
    "description": "<p>When it comes to creating a winning portfolio in the ever-evolving world of cryptocurrencies, investors seek opportunities with promising ecosystems and growth potentials. Ripple (XRP) and InQubeta (QUBE) have emerged as two tokens that deserve investors&#8217; attention. This article will delve into the unique ecosystems, potentials, and reasons why these tokens should be considered for [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/building-a-winning-portfolio-ripple-xrp-and-the-rising-inqubeta-qube/\">Building a Winning Portfolio: Ripple (XRP) and the Rising InQubeta (QUBE)</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T08:17:15.000Z",
    "title": "Investors Rush To DigiToads as Polkadot and Avalanche Begin To Show Bearish signs",
    "url": "https://www.crypto-news-flash.com/investors-rush-to-digitoads-as-polkadot-and-avalanche-begin-to-show-bearish-signs/?utm_source=rss&utm_medium=rss&utm_campaign=investors-rush-to-digitoads-as-polkadot-and-avalanche-begin-to-show-bearish-signs",
    "description": "<p>The thrill of the crypto market&#8217;s oscillations serves as the lifeline for the ever-expanding world of decentralized finance (DeFi). This dynamism not only fuels the economic vigor of this alternative financial system but also fosters a spirit of innovation and disruption. Every shift in the market, whether it&#8217;s a bull run, a sudden dip, or [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/investors-rush-to-digitoads-as-polkadot-and-avalanche-begin-to-show-bearish-signs/\">Investors Rush To DigiToads as Polkadot and Avalanche Begin To Show Bearish signs</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-05T08:15:05.000Z",
    "title": "Top 4 Hong Kong & Chinese Coins Under $1 – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-4-hong-kong-chinese-coins-under-1-part-2-2/",
    "description": "<p>Boom! China is at it again. Another ban on $BTC this time? Well, that&#8217;s not the case. In fact, it&#8217;s quite the exact opposite. As of 1st June 2023, Hong Kong has allowed its citizens to trade cryptos under its new regulatory framework. Now, for sure that&#8217;s bullish for cryptos. Even more so for coins [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-4-hong-kong-chinese-coins-under-1-part-2-2/\">Top 4 Hong Kong &amp; Chinese Coins Under $1 – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T08:30:19.000Z",
    "title": "Massive Hack Hits Atomic Wallet with $35 Million in Crypto Stolen",
    "url": "https://coinedition.com/massive-hack-hits-atomic-wallet-with-35-million-in-crypto-stolen/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/TRON_FOUNDER_@justinsuntron_PREDICTS_MULTIPLE_EXCHANGES_INCLUDING.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a devastating blow to the crypto community, Atomic Wallet, a popular multi-currency wallet, has fallen victim to one of the largest ever hacks in crypto, sending shockwaves through the industry and raising concerns about the security of DeFi platforms. According to ZachXBT, an on-chain detective closely monitoring the aftermath of the hack, the stolen [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/massive-hack-hits-atomic-wallet-with-35-million-in-crypto-stolen/\">Massive Hack Hits Atomic Wallet with $35 Million in Crypto Stolen</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T08:17:42.000Z",
    "title": "Ethereum (ETH) Attracts Whales as Sparklo (SPRK) Soars in Investor Demand",
    "url": "https://coinedition.com/ethereum-eth-attracts-whales-as-sparklo-sprk-soars-in-investor-demand/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-5.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The growing clout of Ethereum (ETH) is unmistakable as &#8216;whales,&#8217; or large-scale investors, continue to amass this cryptocurrency at a phenomenal rate. This surge in accumulation signals a bullish trend and highlights Ethereum&#8217;s potential for significant returns. Alongside this, another asset capturing investor attention is Sparklo (SPRK). Sparklo, a nascent platform in the crypto sphere, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereum-eth-attracts-whales-as-sparklo-sprk-soars-in-investor-demand/\">Ethereum (ETH) Attracts Whales as Sparklo (SPRK) Soars in Investor Demand</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T08:10:07.000Z",
    "title": "Uncertainties Loom over Fantom (FTM) Amid Sparklo’s (SPRK) Growing Investor Interest",
    "url": "https://coinedition.com/uncertainties-loom-over-fantom-ftm-amid-sparklos-sprk-growing-investor-interest/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-4.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>With significant ties to Multichain, its official cross-chain bridge, Fantom (FTM), finds itself on shaky ground. The high-speed, scalable blockchain platform has a considerable amount of its Total Value Locked (TVL) within the Multichain network, sparking concerns over potential ripple effects from recent events. Meanwhile, Sparklo (SPRK), another digital asset, is on an upward trajectory, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uncertainties-loom-over-fantom-ftm-amid-sparklos-sprk-growing-investor-interest/\">Uncertainties Loom over Fantom (FTM) Amid Sparklo&#8217;s (SPRK) Growing Investor Interest</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]