[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T03:12:49.000Z",
    "title": "Meta’s Horizon Worlds launches on mobile and web in early access",
    "url": "https://cointelegraph.com/news/meta-horizon-worlds-launch-mobile-web-early-access",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/0333381e-0cbd-4775-8f9b-d7c2fd08d46c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Mark Zuckerberg's Horizon Worlds is extending past virtual reality in a bid to bring more users to its 3D virtual world.</p>\n                    <p><p>Meta CEO Mark Zuckerberg has finally made the move to <a href=\"https://cointelegraph.com/magazine/forget-2022-how-metaverse-bounce-back-2023/\">expand his metaverse Horizon Worlds</a> from virtual reality headsets to people's smartphones and computers.</p><p>The 3D avatar-based social platform <a href=\"https://www.meta.com/en-gb/blog/quest/horizon-worlds-web-mobile-social-vr-free/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> in a Sept. 15 blog post that it has started rolling out its first Meta Horizon world to mobile and web in an early access state. </p><p>The only experience immediately available is Super Rumble, a free-for-all shooter that launched in late July, allowing two to six players to come together in fast-paced matches lasting five minutes. Meta said that more experiences and worlds will be coming to the platform over the coming months. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/30ee14aa-a69a-45bb-96e5-2503adedf514.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Super Rumble, a first-person shooter previously only available on VR devices. Source: Meta</em></figcaption></figure><p>With the initial rollout, only a small number of people will be able to access it on the web or the Meta Quest app on Android, with an iOS rollout slated for the coming weeks.</p><p>“Early access will roll out to more people gradually as we gather feedback and evolve the experience,” said Meta. </p><p>“The metaverse should be available to everyone — no matter what device they’re on,” the tech giant added. </p><blockquote>“And while Quest headsets are the most immersive way to access the metaverse, we believe there should be multiple entry points.”</blockquote><p>Meta said bringing Worlds to more devices <a href=\"https://cointelegraph.com/news/metaverse-dead-united-states-thriving-asia-sandbox-sebastien-borget\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/metaverse-dead-united-states-thriving-asia-sandbox-sebastien-borget/amp\">will open up the experience to more people</a>. Meta hasn’t released any public statistics on its monthly active users, but a report from The Wall Street Journal in October 2022 <a href=\"https://www.wsj.com/articles/meta-metaverse-horizon-worlds-zuckerberg-facebook-internal-documents-11665778961\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> it was less than 200,000. </p><p>Meta's social platform is still currently only available in Canada, France, Iceland, Ireland, Spain, the United Kingdom and the United States. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/meta-ruined-the-metaverse-but-now-its-evolving-yuga-labs-ceo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/meta-ruined-the-metaverse-but-now-its-evolving-yuga-labs-ceo/amp\">Meta ‘ruined’ the term metaverse, but now it’s evolving: Yuga Labs CEO</a></em></strong></p><p>Interestingly, blockchain-based metaverse platforms, including Decentraland and The Sandbox, seemingly started their journey the other way around. </p><p>Both launched as PC and web-based experiences first, with Decentraland launching its browser-based 3D virtual world in February 2020 and The Sandbox launching its Alpha on PC in November 2021. Both have yet to <a href=\"https://cointelegraph.com/news/why-isn-t-there-a-vr-client-yet-for-decentraland-or-the-sandbox\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-isn-t-there-a-vr-client-yet-for-decentraland-or-the-sandbox/amp\">release an official virtual reality port</a>. </p><h3>We've got legs!</h3><p>Meanwhile, Meta avatars in Horizon Worlds have finally received a long-awaited update — virtual legs. </p><p>Zuckerberg initially copped criticism after the launch of his metaverse, with observers noting that the massive investment from the firm couldn’t even give its avatars virtual legs. During Connect 2022, Meta promised the legs would come in an eventual update sometime in 2023. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/MkZKRadcIC0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>The legs functionality was reportedly already introduced to Quest Home space some weeks ago as a v57 test version update, but some users have reported the legs have now made their way onto the Horizon Worlds app. </p><p><em><strong>Magazine: </strong></em><a href=\"https://cointelegraph.com/magazine/gta-owner-blockchain-game-bitcoin-casino-sunflower-land-review-web3-gamer/\"><strong><em>Web3 Gamer: GTA owner joins Web3, Bitcoin casino, Sunflower Land review</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T03:37:19.000Z",
    "title": "Tencent’s Hunyuan AI Model Challenges ChatGPT in Spite of US Chip Ban",
    "url": "https://www.cryptopolitan.com/hunyuan-ai-model-of-us-chip-ban/",
    "description": "In a strategic move aimed at expanding its foothold in the rapidly evolving artificial intelligence (AI) landscape, Chinese tech giant Tencent has officially launched its latest AI creation, the Hunyuan AI model. This announcement came during the Global Digital Ecosystem Summit held in Shenzhen, where Tencent showcased the model&#8217;s remarkable capabilities. With a focus on ... <a title=\"Tencent&#8217;s Hunyuan AI Model Challenges ChatGPT in Spite of US Chip Ban\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hunyuan-ai-model-of-us-chip-ban/\" aria-label=\"More on Tencent&#8217;s Hunyuan AI Model Challenges ChatGPT in Spite of US Chip Ban\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T03:17:04.000Z",
    "title": "Bitcoin Bulls Keep Pushing And Its Good Signs of A Fresh Rally",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-bulls-keep-pushing-26850/",
    "description": "Bitcoin price is holding gains above the $26,200 zone. BTC seems to be forming a base for a fresh increase above $26,850 in the coming sessions. Bitcoin is eyeing a key upside break above the $26,850 level. The price is trading above $26,100 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $26,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair seems to be setting up for a fresh rally above the $26,850 resistance. Bitcoin Price Could Rally Above $27K Bitcoin price started a decent increase above the $26,000 resistance zone. BTC remained well-bid above the Fib retracement level of the upward move from the $24,925 swing low to the $27,212 high. There was a close above the $26,500 resistance zone. However, the bears seem to be protecting an upside break above the $26,850 resistance. The recent high was formed near $26,833 before there was another downside correction. There was a move toward the 50% Fib retracement level of the recent increase from the $26,154 swing low to the $26,833 high. Bitcoin is now trading above $26,100 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $26,300 on the hourly chart of the BTC/USD pair. Immediate resistance on the upside is near the $26,720 level. The first major resistance is near the $26,850 level. The next key resistance could be near the $27,200 level. Source: BTCUSD on TradingView.com A successful move above the $26,850 resistance and then a close above $27,200 could spark another bullish wave. The next major resistance is near $28,000, above which the bulls could gain strength. In the stated case, the price could test the $28,800 level. Another Rejection In BTC? If Bitcoin fails to start a fresh increase above the $26,850 resistance, it could continue to move down. Immediate support on the downside is near the $26,300 level and the trend line. The trend line is near the 76.4% Fib retracement level of the recent increase from the $26,154 swing low to the $26,833 high. The next major support is near the $26,000 level. A downside break and close below the $26,000 level might send the price toward the key support at $25,550. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $26,300, followed by $26,000. Major Resistance Levels – $26,720, $26,850, and $27,200."
  }
]