[
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T08:00:00.000Z",
    "title": "SEC Calls Solana, Cardano, Polygon Securities In Binance Lawsuit",
    "url": "https://cryptodaily.co.uk/2023/06/sec-calls-solana-cardano-polygon-securities-in-binance-lawsuit",
    "description": "<p>The United States Securities and Exchange Commission (SEC) has alleged that popular cryptocurrencies such as Cardano (ADA), Polygon (MATIC), and Solana (SOL) are unregistered securities.&nbsp;</p>\n<p>The regulator made the allegation in a lawsuit against Binance and its CEO, Changpeng Zhao.&nbsp;</p>\nProminent Cryptocurrencies Classified As Securities&nbsp;\n<p>The lawsuit names an extensive list of cryptocurrencies apart from Cardano (ADA), Polygon (MATIC), and Solana (SOL). The three rank among the largest and most prominent cryptocurrencies in the market. The other cryptocurrencies mentioned include Cosmos Hub (ATOM), Filecoin (FIL), Decentraland (MANA), Algorand (ALGO), The Sandbox (SAND), Coti ( COTI), and Axie Infinity (AXS). The lawsuit has also identified the BUSD and BNB stablecoins as securities, further compounding the seriousness of the situation. Furthermore, the SEC lawsuit also alleges that Binance has listed crypto assets that have previously been the subject of enforcement action by the SEC.&nbsp;</p>\n<p>These include several assets, such as TRX, UST, AMP, and REP. This, according to the Securities and Exchange Commission, indicates a reckless disregard for securities regulations by Binance and its executives. However, the lawsuit does not mention Litecoin (LTC) or Ethereum (ETH). Additionally, Securities and Exchange Commission Chair Gary Gensler has clarified that the SEC views Bitcoin as a commodity. However, he has suggested that a vast majority of other tokens in the market are securities.&nbsp;</p>\nToken Value Tanks&nbsp;\n<p>Several tokens saw a considerable drop in price following the news of the SEC lawsuit. Among the hardest hit was Solana, which saw a 6% drop, sliding to $20 in just an hour. Algorand, another asset mentioned as a security in the lawsuit, saw its value drop by 9.9% following the news. SEC Chair Gensler has previously spoken quite positively about the asset. Polygon saw a drop of 7%, while Polkadot dropped by 6.9%, according to data from CoinGecko.&nbsp;</p>\nThe Lawsuit Against Binance And Zhao&nbsp;\n<p>The Securities and Exchange Commission unveiled its lawsuit against Binance on Monday. The commission had sued the world&rsquo;s largest cryptocurrency exchange and its CEO, Changpeng Zhao, for alleged violation of several US securities laws. According to the SEC, Binance has been offering its users unregistered securities trading platforms and offering unregistered crypto asset securities sales.&nbsp;</p>\n\n<p>&ldquo;The Securities and Exchange Commission today charged Binance Holdings Ltd. (&ldquo;Binance&rdquo;), which operates the largest crypto asset trading platform in the world, Binance.com; U.S.-based affiliate, BAM Trading Services Inc. (&ldquo;BAM Trading&rdquo;), which, together with Binance, operates the crypto asset trading platform, Binance.US; and their founder, Changpeng Zhao, with a variety of securities law violations.&rdquo;</p>\n\n<p>One of the key charges against Binance involves the company&rsquo;s US operations. According to the Securities and Exchange Commission, Binance and BAM Trading, the Binance.US operator, operated as exchanges in the United States of America without registering with the SEC, in addition to being clearing agencies and broker-dealers. According to the SEC, certain cryptocurrencies were offered as securities on Binance&rsquo;s primary international exchange and Binance.US.&nbsp;</p>\n\n<p>&ldquo;Binance and BAM Trading have unlawfully engaged in unregistered offers and sales of crypto asset securities,&rdquo; the lawsuit states. &ldquo;In so doing, they have deprived investors of material information, including the risks and trends that affect the enterprise and an investment in these securities.&rdquo;</p>\n\n<p>The Securities and Exchange Commission also alleged that Binance secretly controlled its US operations, allowing high-value US customers to evade restrictions and divert billions of dollars worth of customer funds. Binance has refuted all allegations made by the SEC.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T07:59:16.000Z",
    "title": "Blue Chip NFTs drive lending market to over $430 million: Report",
    "url": "https://www.cryptopolitan.com/blue-chip-nfts-drive-lending-market-to-over-430-million-report/",
    "description": "The market for borrowing and lending non-fungible tokens (NFTs), known as NFTFi loans, has surpassed $430 million across 43,521 borrowers, according to a report by Paraspace, a non-fungible token money market protocol, and BitKeep, a multichain wallet. The majority of collateral in these loans consists of the most popular NFT collections, including Wrapped CryptoPunks, Bored ... <a title=\"Blue Chip NFTs drive lending market to over $430 million: Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blue-chip-nfts-drive-lending-market-to-over-430-million-report/\" aria-label=\"More on Blue Chip NFTs drive lending market to over $430 million: Report\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-06T07:48:22.000Z",
    "title": "Altcoins Under $1 – These Will BLOW UP in The Crypto Bull Run",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/altcoins-under-1-these-will-blow-up-in-the-crypto-bull-run/",
    "description": "<p>Hey guys! How’s it going? So today, we’ll focus on those of you searching for potential 50x or 100x coins currently under $1. We found that this type of video is your favorite. So we are back with a new list of projects under $1 with good potential.  If you hold these altcoins by the next [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/altcoins-under-1-these-will-blow-up-in-the-crypto-bull-run/\">Altcoins Under $1 &#8211; These Will BLOW UP in The Crypto Bull Run</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T08:01:00.000Z",
    "title": "Analyst Forecasts Potential BTC Upswing Amid Declining Volume",
    "url": "https://coinedition.com/analyst-forecasts-potential-btc-upswing-amid-declining-volume/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoins-BTC-Boring-Phase-The-Prelude-to-a-Breakout-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Crypto Banter, a crypto insight provider on Youtube, recently dissected Bitcoin&#8217;s current market trends. Despite Bitcoin&#8216;s near-term descent and low trading volume on Binance, there&#8217;s an undercurrent of anticipation in the crypto space. According to the analysis, this current trading phase might be a precursor to a significant price movement despite the recent rejection and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-forecasts-potential-btc-upswing-amid-declining-volume/\">Analyst Forecasts Potential BTC Upswing Amid Declining Volume</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T07:42:51.000Z",
    "title": "Coinbase Ventures Expands Portfolio With Four Crypto Projects, Raises Over $20M",
    "url": "https://coinedition.com/coinbase-ventures-expands-portfolio-with-four-crypto-projects-raises-over-20m/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/While_there_are_many_details_to_be_ironed_out_the_Digital_Asset.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Coinbase Ventures, the investment arm of American crypto giant Coinbase, added four new crypto projects to its investment portfolio last month. The venture capital firm participated in funding rounds that raised a total of $20.7 million in May 2023. These investments include zkLink, Dolomite, Hourglass, and PYOR. Altcoin Daily recently posted a video on Youtube [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-ventures-expands-portfolio-with-four-crypto-projects-raises-over-20m/\">Coinbase Ventures Expands Portfolio With Four Crypto Projects, Raises Over $20M</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]