[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T12:00:00.000Z",
    "title": "Animoca Brands Invests in TON Network, Becomes Largest Validator ",
    "url": "https://www.coindesk.com/business/2023/11/28/animoca-brands-invests-in-ton-network-becomes-largest-validator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The gaming and metaverse-focused firm declined to provide details of the investment."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-28T11:55:45.000Z",
    "title": "ARK Invest Sells $5.26M Coinbase Shares as Price Hits 19-Month High",
    "url": "https://www.coindesk.com/business/2023/11/28/ark-invest-sells-526m-coinbase-shares-as-price-hits-19-month-high/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Ark Fintech Innovation ETF sold 43,956 COIN shares and bought $1.2 million worth of Robinhood stock."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T11:54:51.000Z",
    "title": "Animoca becomes largest validator of Telegram's TON blockchain ",
    "url": "http://cointelegraph.com/news/animoca-becomes-validator-telegram-ton-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5c4ecb75-d5fd-4aeb-8155-38e5f3ce643e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Animoca Brands invests in Telegram’s TON blockchain protocol and becomes its largest validator as it eyes GameFi development on the platform. </p>\n                    <p><p>Web3 investment firm Animoca Brands is set to become the largest validator of Telegram’s TON (The Open Network) blockchain and plans to deliver blockchain-based games to the messaging app’s 800 million strong user base.</p><p>An announcement shared with Cointelegraph outlined how the partnership will involve the provision of funding, research, and an analytics platform for third-party TON ecosystem applications. </p><p>The value of Animoca’s investment was not disclosed at the time of publishing, but part of the investment is understood to have been made directly into Toncoin, which has been staked as part of the validator agreement.</p><p><a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\"><strong><em>Related: Animoca still bullish on blockchain games, awaits license for metaverse fund</em></strong></a></p><p>Animoca has carried out extensive market research on TON’s wider ecosystem focused on the platform’s ability to drive cryptocurrency and GameFi adoption. </p><p>The firm plans to strategically support TON Play, a gaming infrastructure project based on the TON blockchain. The infrastructure allows gaming applications to be built on TON and launched on Telegram, as well as port existing web-based games to the messaging app. </p><p>Ton Play will enable developers to deliver games to some 800 million Telegram users through its web application and the mobile app’s PlayDeck bot - which allows users to browse a catalog of mobile games. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d093ba6f-6e0b-43d8-b7ee-0d0973dec90b.png\"  /><figcaption style=\"text-align: center;\">Telegram's PlayDeck bot allows users to browse a catalog of mobile games. Animoca plans to deliver blockchain-based games through the channel.</figcaption></figure><p>Animoca will also explore the ability to port a selection of its gaming titles and applications from its portfolio of over 400 Web3 projects to Telegram. </p><p>Animoca Brands Research has also developed its own TON Analytics Dashboard, which gathers a variety of metrics from TON’s open internet ecosystem, which includes TON Blockchain, TON DNS, TON Storage and TON Sites.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/14dd0bb9-1d07-479d-88f6-cb8630efecba.png\"  /><figcaption style=\"text-align: center;\">Animoca Brands Research has created a live dashboard monitoring key networks of the TON ecosystem. </figcaption></figure><p>TON Foundation director of growth Justin Hyun said the analytics platform and in-depth research reports provided by Animoca will play an important role in infusing Web3 functionality into the everyday experiences of Telegram users. </p><p><a href=\"https://cointelegraph.com/news/web3-gaming-investors-more-discerning-animoca-robby-yung\"><strong><em>Related: Web3 gaming investors more ‘choosy’ in crypto winter — Animoca’s Robby Yung</em></strong></a></p><p>Animoca Brands co-founder Yat Siu said the investment in TON is aligned with the firm’s efforts to drive adoption and the transition of Web2 to Web3. </p><blockquote>“Taking part in the network’s validation underlines our faith in the successful realization of the vision behind the TON project as it looks to bring Web3 into the mainstream.”</blockquote><p>Siu added that Animoca has identified significant growth potential of gaming within the TON ecosystem and intends to drive the development of TON-based games over the next few years.</p><p>The partnership with TON is the second instance of Animoca becoming a validator of a proof-of-stake blockchain protocol in Nov. 2023. The firm joined fan token blockchain <a href=\"https://cointelegraph.com/news/animoca-becomes-chiliz-chain-validator\">Chiliz Chain as a validator</a> for its native proof-of-stake authority protocol on Nov. 14.</p><p>Chiliz Chain is the backbone of Socios.com, which operates a plethora of fan tokens for some of the biggest global football and sports teams. Europe’s <a href=\"https://cointelegraph.com/news/manchester-city-soccer-club-launches-fan-token-with-socios\">most loved football clubs</a> and several household sports brands have tapped into the solution to power Web3 fan tokens and other blockchain-based offerings.</p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T11:47:46.000Z",
    "title": "11th anniversary of Bitcoin’s first halving: from $12 to $37,000",
    "url": "http://cointelegraph.com/news/bitcoin-first-halving-11th-anniversary",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/364716ae-4577-4fd0-962a-da674472c524.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin experienced its first-ever halving 11 years ago today, and since then, its price has soared from $12 to its current price of $37,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), the largest cryptocurrency by market value, experienced its first-ever halving 11 years ago today. As the community celebrates the anniversary of the first Bitcoin halving, it’s timely to revisit some of Bitcoin's historical milestones ahead of the next halving expected in April 2024.</p><p>The first Bitcoin transaction <a href=\"https://cointelegraph.com/news/community-celebrates-bitcoin-genesis-day-by-sending-btc-to-the-genesis-block\">occurred nearly 15 years ago on Jan. 3, 2009</a>, a few months after the pseudonymous creator of Bitcoin, Satoshi Nakamoto, <a href=\"https://cointelegraph.com/news/bitcoin-btc-whitepaper-turns-15-satoshi-nakamoto\">published the Bitcoin white paper</a> in October 2008.</p><p>On Nov. 28, 2012, or three years and ten months after Bitcoin’s initial block was mined, the first-ever halving event took place. At the time, BTC traded at just around $12, <a href=\"https://www.statmuse.com/money/ask?q=price+of+bitcoin+on+november+28%2C+2012\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from StatMuse, or 308,200% below Bitcoin's current price, <a href=\"https://www.coingecko.com/en/coins/bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from CoinGecko.</p><p>Though Bitcoin halving — as well as the digital currency's 21 million supply cap — is not directly described in Nakamoto's white paper, the document still <a href=\"https://github.com/tpn/pdfs/blob/master/Bitcoin%20-%20A%20Peer-to-Peer%20Electronic%20Cash%20System.pdf\" target=\"_blank\" rel=\"noopener nofollow\">hints</a> at certain mechanisms to control the creation of new BTC. The white paper reads:</p><blockquote>“To compensate for increasing hardware speed and varying interest in running nodes over time, the proof-of-work difficulty is determined by a moving average targeting an average number of blocks per hour. If they're generated too fast, the difficulty increases.”</blockquote><p>Unlike some of the basic information in the BTC white paper, the halving aspect is mentioned in the Bitcoin source code. The halving is specifically available on the Bitcoin Core GitHub repository on the validation.cpp file, which <a href=\"https://github.com/bitcoin/bitcoin/blob/master/src/validation.cpp\" target=\"_blank\" rel=\"noopener nofollow\">indicates</a> that the miner’s block subsidy is “cut in half every 210,000 blocks, which will occur every four years.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/465d81ca-715f-4ecf-969a-5a3ece23ee10.png\"  /><figcaption style=\"text-align: center;\"><em>A Bitcoin halving-related snippet from the Bitcoin Core repository. Source: GitHub</em></figcaption></figure><p>The Bitcoin halving mechanism had been programmed into the BTC mining algorithm to counteract inflation by maintaining scarcity.</p><p>Before the first halving occurred, miners were <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">compensated with as much as 50 BTC</a> per block. After the first halving event in 2012, the subsidy was slashed to 25 BTC, followed by the second halving in 2016, which reduced the subsidy to 12.5 BTC. The most recent Bitcoin halving occurred in 2020, <a href=\"https://cointelegraph.com/news/it-happened-bitcoin-just-experienced-third-halving-in-its-history\">cutting the block subsidy from 12.5 BTC to 6.25 BTC.</a></p><p>As Bitcoin halvings significantly increase the cryptocurrency’s scarcity, the Bitcoin price cycle has been historically impacted by halvings. Just a year after its first-ever halving, Bitcoin had risen to nearly $1,000, while the second halving triggered a 350% surge during the year after the event, with BTC subsequently rallying to <a href=\"https://cointelegraph.com/news/bitcoin-hits-20000-per-coin-capping-year-of-enormous-growth\">all-time highs of nearly $20,000</a> in December 2017.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-community-begins-bitcoin-halving-countdown-as-milestone-date-nears\"><strong><em>Crypto community begins Bitcoin halving countdown as milestone date nears</em></strong></a></p><p>In the aftermath of the third Bitcoin halving, <a href=\"https://cointelegraph.com/news/fresh-bitcoin-price-highs-put-bulls-in-profit-for-friday-s-1-2b-btc-options-expiry\">BTC surged as high as $69,000</a> in November 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ad96d277-c325-4de5-b2d7-b9241b5b09c0.png\"  /></figure><p>The anniversary of the first Bitcoin halving comes as the cryptocurrency community awaits the fourth Bitcoin halving, which is now expected to <a href=\"https://buybitcoinworldwide.com/halving/\" target=\"_blank\" rel=\"noopener nofollow\">occur</a> on April 17, 2024. Many Bitcoin advocates are especially bullish on the Bitcoin price in 2024 amid growing expectations that United States securities regulators could finally approve a spot Bitcoin exchange-traded fund.</p><p>The 2024 halving won't be the last one, though. Bitcoin miner reward is expected to be halved 34 times until it reaches 0 BTC after all 21 million Bitcoin are mined. Based on the current schedule, the maximum supply of 21 million bitcoins <a href=\"https://cointelegraph.com/news/the-last-bitcoin-btc-mine\">will be reached around 2140</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/5050-bitcoin-for-5-dollars-2009-helsinki-claim-to-crypto-fame-crypto-city-guide/\"><strong><em>5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T12:00:59.000Z",
    "title": "ProShares ETFs exemplify ‘buy the rumor, sell the news’ in crypto markets",
    "url": "https://cryptoslate.com/insights/proshares-etfs-exemplify-buy-the-rumor-sell-the-news-in-crypto-markets/",
    "description": "<p>Quick Take The world of financial assets has a well-known pattern: a surge in asset prices prior to expected positive developments or &#8216;good news,&#8217; followed by a notable slump when the event occurs. This phenomenon, often referred to as &#8216;buy the rumor, sell the news,&#8217; suggests the interplay of strategic, perhaps institutional, buying and retail [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/proshares-etfs-exemplify-buy-the-rumor-sell-the-news-in-crypto-markets/\">ProShares ETFs exemplify &#8216;buy the rumor, sell the news&#8217; in crypto markets</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T12:09:07.000Z",
    "title": "Solana (SOL), Pyth Network (PYTH), and Bonk (BONK) ready to rock",
    "url": "https://cryptodaily.co.uk/2023/11/solana-sol-pyth-network-pyth-and-bonk-bonk-ready-to-rock",
    "description": "After these last few days of red candles altcoins could be ready to start coming back to life. The Solana ecosystem has some prime candidates to take the lead."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T12:00:30.000Z",
    "title": "Revving Up: Solana Bulls Ready To Charge As Analysts Predict Rally Beyond $80",
    "url": "https://www.newsbtc.com/news/revving-up-solana-bulls-ready-to-charge-as-analysts-predict-rally-beyond-80/",
    "description": "Positive events have come for Solana (SOL), the high-performance blockchain network, indicating bullish momentum. In the last month, the price of Solana has risen by 84%, and is currently trading at $56. With gains of 18 out of the previous 30 days and price volatility of 22.32%, Solana is still a force to reckon with. In that span of time, SOL&#8217;s price surged by a staggering 78%, from $32 to $57. The ecosystem is much more excited now that Binance has listed BONK, a meme coin based in Solana. Further evidence of Solana&#8217;s commitment to the arts is the creation of Artists in Residence, a bustling studio that showcases the variety of art forms involved in the project. Introducing Artists in Residence: A living studio, curated to showcase the diversity of art in the Solana ecosystem. Witness the artists create live at @ArtBasel Miami Beach &#38; celebrate a dimension of creative expression that is only possible on Solana.https://t.co/jMFWmVE31d pic.twitter.com/p9IjB8pGKd — Solana (@solana) November 20, 2023 Related Reading: XRP Market Drama: Ups, Downs And The $3 Horizon – Experts Weigh In On The Future Analyst&#8217;s Bullish Prognosis: Solana&#8217;s Surge As Ethereum Challenger Bluntz, a well-known pseudonymous cryptocurrency expert, has shared an intriguing forecast for Solana (SOL), predicting a strong rebound and an upward trend for the virtual asset. Bluntz recently stated in a YouTube presentation that Solana&#8217;s native cryptocurrency, SOL, which is a strong competitor to Ethereum (ETH), has a potential to hit the $80 level. Based on his research, Solana looks to be about to experience a significant uptick, indicating possible buying opportunities as it stands as a formidable Ethereum substitute in the cryptocurrency market. The Elliott Wave theory, a popular technical analysis approach in trading that Ralph Nelson Elliott created in the 1930s, is the main focus of Bluntz&#8217;s analysis. Elliott Wave theory states that price movements in financial markets typically follow a natural rhythm that consists of five waves that follow the trend and three waves that correct it. Bluntz said that Solana has effectively passed through its corrective phase—a pivotal point that suggests there may be a big upswing. His analysis indicates that this pattern marks the end of Solana&#8217;s declining price trend and the beginning of a new growing phase for the cryptocurrency. Related Reading: The Dogecoin Surge: Unveiling The Catalyst Behind Rising Transactions SOL market cap currently at $23.205 billion on the daily chart: TradingView.com Solana&#8217;s Anticipated Triple-Digit Surge In 2024 Meanwhile, X account @AltcoinSherpa, a crypto analyst, is optimistic about SOL. After analyzing the SOL price pattern, the analyst stated that a sub-$50 entry would be excellent and that they expected the SOL price to correct. The price of Solana has been rising since mid-October 2023, and reaching its 2023 peak of $68.20 on November 16 before a decline started. AltcoinSherpa projects that the price of SOL would soar to three figures in 2024. 1/ Exciting times for the Solana community as we delve into the post-Breakpoint era! 🌐 Solana Breakpoint 2023 in Amsterdam was a game-changer, fueling a massive 140% surge in $SOL and an overall ecosystem rebound. 📈 Let&#8217;s break down the highlights! pic.twitter.com/cF2Na7a97O — CoinEx Global (@coinexcom) November 24, 2023 In a related development, CoinEx Research, the research and development arm of the CoinEx cryptocurrency exchange site, talked about the top Solana ecosystem trends in Q4 2023. The recent Solana Breakpoint 2023, a yearly Solana community event in Amsterdam, was the clear cause of the huge surge in the SOL-focused ecosystem, according to CoinEx Research. Owing to all of these elements, market analysts have projected a bullish price for Solana. By December 2023, they predict its worth to have increased to $60 or more, indicating a strong growth and potential for innovation. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-28T11:42:00.000Z",
    "title": "Journalist Highlights Binance’s Recent Approach to Token Listings",
    "url": "https://coinedition.com/journalist-highlights-binances-recent-approach-to-token-listings/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance US Lied to the Court: Cochran Calls Out Auditor in SEC Battle\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The world’s leading cryptocurrency platform, Binance, appears to have adopted a different approach to listing tokens and making them available to users on its platform.  Noting these changes, reputed crypto media Wu Blockchain, in a recent tweet on X, highlighted a number of tokens listed on the crypto exchange for futures but not for spot [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/journalist-highlights-binances-recent-approach-to-token-listings/\">Journalist Highlights Binance&#8217;s Recent Approach to Token Listings</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]