[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T16:56:23.000Z",
    "title": "Crypto Investor HashKey Aims to Raise $100M for New Digital Assets Fund",
    "url": "https://www.coindesk.com/business/2023/08/04/crypto-investor-hashkey-aims-to-raise-100m-for-new-digital-assets-fund/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The liquid digital assets fund, regulated by the Hong Kong Securities and Futures Commission, will open for investments on Sept. 1."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T17:00:00.000Z",
    "title": "Germany is dragging Europe’s economy down — and that’s great for crypto",
    "url": "https://cointelegraph.com/news/germany-is-dragging-europe-economy-down-great-for-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2f92ef48-1b40-47ed-b387-b80de8c7e82d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph analyst and writer Marcel Pechman explains how a weakening German economy — Europe’s largest — is a positive for cryptocurrencies. </p>\n                    <p><p>In the latest episode of <em>Macro Markets</em>, Cointelegraph analyst Marcel Pechman discusses the recession in Germany, Europe’s largest economy. According to a recent headline in The Wall Street Journal, “Germany is dragging down Europe’s economy.“ The article explains how the country heavily depends on manufacturing, which has been hurt as foreign governments rush to protect domestic industries.</p><p>According to Pechman, Germany’s gross domestic product (GDP) ranks fourth globally, 42% bigger than France’s GDP. Moreover, manufacturing is responsible for nearly 20% of its economy. To make things worse, the manufacturing industry in Germany employs 10% of the workforce.</p><p>As the surplus (exports minus imports) reached its lowest level in 23 years, it is causing a GDP contraction for Germany, which affects the government’s capabilities to pay for its costs, including pensions and public workers. Pechman then shows how the German government threw gas on the fire with recurring interventions to save the manufacturing industry.</p><p>Pechman reminds us that the euro has a mere seven-year head start versus Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and that an eventual weakening of Germany represents a considerable risk for the European Central Bank and the euro. Consequently, regardless of how the United States dollar is doing, the euro represents a more imminent risk and is potentially positive for cryptocurrency adoption.</p><p>Shifting the focus to the Asian market, Japan’s central bank has raised the interest rate buyback cap to 1%. According to Pechman, the bank is trying to convince the markets that it is not raising interest rates, but that’s precisely what happened. The Japanese economy has been stagnant for the past 20 years, and its debt ratio has been above 200% of the GDP since 2010.</p><p>According to a Bloomberg article, “Japanese investors are major holders of US government bonds and own everything from Brazilian debt to European power stations.“ According to Pechman, the rest of the world is concerned that Japan will have to offload its holdings in bonds, stocks and other assets, likely causing a crash in those markets.</p><p>The conclusion is that global economies are strongly interconnected, evident after the U.S. helped Europe during the banking crisis of 2023 by offering special liquidity agreements. Pechman says that at some point, the trust in this system will break, regardless of the trigger. That’s why positioning in Bitcoin makes sense, even though it is impossible to predict the timing of those events.</p><p>Check out the full episode of <em>Macro Markets</em> exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>, and make sure to like and subscribe today!</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/y-pm9YgbdcY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T17:00:00.000Z",
    "title": "Coinbase Proceeds with Filing for SEC Lawsuit Dismissal",
    "url": "https://cryptodaily.co.uk/2023/08/coinbase-proceeds-with-filing-for-sec-lawsuit-dismissal",
    "description": "<p>Coinbase filed a motion to dismiss the SEC lawsuit in its entirety, seeking clarity in crypto regulation.</p>\nCoinbase Makes a Major Move in SEC Lawsuit\n<p>On Friday, July 4, Coinbase filed a new motion seeking to dismiss the lawsuit started by the U.S. Securities and Exchange Commission (SEC) entirely, after hinting at the major move in yesterday&rsquo;s Shareholder letter on the platform&rsquo;s Q2 earnings.</p>\n<p>In the filing, Coinbase claims that the regular is exceeding its authority by suing the cryptocurrency exchange because the platform does not offer &ldquo;investment contracts&rdquo;.</p>\n\n<p>\"The transactions over Coinbase&rsquo;s platform and Prime are not, and do not involve, contractual undertakings to deliver future value reflecting the income, profits, or assets of a business. They are commodity sales, with the obligations on both sides discharged entirely the moment the digital token is delivered in exchange for payment,\" the filing stated.</p>\n\n<p>The crypto exchange also referred to the recent ruling partially in favor of Ripple in a similar case against the SEC, saying that the core facts were \"substantially identical to those alleged here.\" However, there&rsquo;s no guarantee that the court will consider this argument, because another crypto company Terraform Labs also recently tried to cite the Ripple&rsquo;s case but was rejected by Judge Rakoff.</p>\nOngoing Legal Battle Against SEC\n<p>As it was recently revealed, before suing the exchange, the SEC first asked Coinbase to halt all crypto trading except that of Bitcoin, arguing that all other digital assets are viewed as securities. Coinbase decided to decline the SEC&rsquo;s request. The company&rsquo;s CEO Brian Armostrong explained why:</p>\n\n<p>&ldquo;We really didn&rsquo;t [did not] have a choice at that point; delisting every asset other than Bitcoin, which by the way, is not what the law says, would have essentially meant the end of the crypto industry in the US. It kind of made it an easy choice&hellip; let&rsquo;s [let us] go to court and find out what the court says.&rdquo; </p>\n\n<p>In June, the regulator filed suit against Coinbase alleging the platform failed to register as a broker, clearing agency, or national securities exchange and traded at least 13 cryptocurrencies that could be considered securities.&nbsp;</p>\nSeeking Regulatory Clarity\n<p>Coinbase has repeatedly asked for more clarity regarding crypto regulation from the SEC but still hasn&rsquo;t responded. The regulator requested four more months to provide a response to the platform&rsquo;s call.</p>\n<p>In its latest Shareholder letter, Coinbase highlighted:</p>\n\n<p>&ldquo;&hellip;despite our good faith efforts and transparency of our business to the SEC for years now, we were deeply disappointed that the SEC brought an unwarranted enforcement against us in June, and that ten states initiated proceedings about our staking services. We are confident in the work we have done to abide by all federal and state securities laws, and as we vigorously defend that work, we plan to use these proceedings as an opportunity to bring more clarity to our industry as a whole.&rdquo;</p>\n\n<p>Coinbase Chief Legal Officer Paul Grewal expressed optimism regarding the case:</p>\n\n<p>&ldquo;With respect to the litigation with the SEC, I want to be very clear. We do think we can win. We expect to win.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T17:03:22.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T16:59:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T16:53:03.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $4.14USD, with a 24-hour trading volume of $101,148,403. Filecoin is down 1.35% in the last 24 hours. The current CoinMarketCap ranking is #30, with a market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and the max. ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T16:52:17.000Z",
    "title": "Diverse perspectives in BRICS over expansion plans",
    "url": "https://www.cryptopolitan.com/perspectives-in-brics-over-expansion-plans/",
    "description": "As the international scene continues to evolve, the robust alliance known as BRICS (Brazil, Russia, India, China, and South Africa) finds itself at a crossroads. Set to convene this month in Johannesburg, the upcoming summit has been marked by an overarching question: Should BRICS expand? With China pushing for rapid growth and other member nations ... <a title=\"Diverse perspectives in BRICS over expansion plans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/perspectives-in-brics-over-expansion-plans/\" aria-label=\"More on Diverse perspectives in BRICS over expansion plans\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T17:00:21.000Z",
    "title": "Crypto Trading Volumes Fall To Lowest Level In 2023 Amid Bear Market Woes",
    "url": "https://www.newsbtc.com/crypto/crypto-trading-volumes-fall-to-lowest-level-in-2023/",
    "description": "According to a report by CCData, a digital assets data provider, crypto trading volumes on centralized exchanges in July fell to their lowest this year as the bear market lingers. Spot trading volumes dipped by 10.5% to $515 billion, while derivatives volume dipped by 12.7% to $1.85 trillion.  This slump has been attributed to the low volatility in the price action of the two leading crypto tokens &#8211; bitcoin and ether. Both tokens have continued to experience sideways price movement since the beginning of July, thus keeping the market players out as they await a breakout.  Binance Continues To Lead The Pack Despite Regulatory Concerns According to the latest exchange review report, Binance remains the largest crypto exchange by spot trading volume, recording $208 billion in trading volume for July. However, it wasn’t all good news for the exchange as its market share declined for the fifth consecutive month in July, dipping to 40.4% &#8211; its lowest since August 2022. Related Reading: Buying Pressure Incoming? MicroStrategy Files Notice With SEC To Sell $750 Million In Stocks The decline in Binance’s market share has been attributed largely to the firm’s ongoing legal battle with the United States Securities and Exchange Commission (SEC). In July, the SEC accused Binance and its CEO Changpeng Zhao, of offering different tokens, which the regulator has tagged as “unregistered securities,” to the public.  Binance’s regulatory battles might have forced traders to seek alternatives as they fear the worst might happen to the crypto exchange. &#8220;The recent concerns over possible regulatory action against Binance seem to have adversely affected the trading activity on the exchange, with users likely to prefer other alternatives,&#8221; said Joseph, a research analyst at CCData, in a note to CoinDesk. Total market cap struggles at $1.127 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Crypto Industry In South Korea Thriving South Korea’s Upbit, meanwhile, outperformed the general market trend as the crypto exchange as it rose to become the second-largest crypto exchange by trading volume, ranking only behind Binance.  In July, the crypto exchange saw its spot trading volume rise by 42.3% to $29.8 billion. This figure put Upbit ahead of rivals OKX and Coinbase (the first time this is happening), with both crypto exchanges’ volumes dropping 11.6% and 5.75%, respectively. Related Reading: Ethereum ETFs Heat Up As Filings With SEC Climbs To Six “Compared to last month, Upbit saw the largest increase in market share, with the exchange now accounting for 5.78% of the trading volumes on centralized exchanges,” the report elaborated.  Upbit wasn’t the only South Korean crypto exchange that enjoyed a remarkable uptrend last month. According to the report, other South Korean exchanges like Bithumb and CoinOne also saw an increase in their trading volume. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T17:00:12.000Z",
    "title": "Dogecoin (DOGE) Holders Moving Over $ROE",
    "url": "https://www.crypto-news-flash.com/dogecoin-doge-holders-moving-over-roe/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-doge-holders-moving-over-roe",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As Dogecoin (DOGE) embarks on yet another downtrend, investors are looking for new investment options that will grant them stable gains and more functionality. Many of them have found their answer in a new crypto gem, Borroe $ROE, that has quickly emerged as a superstar in the market, promising massive growth potential and a unique [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T16:55:48.000Z",
    "title": "Bitfinex Heist: Ilya Lichtenstein Admits He Was Behind Colossal 2016 Crypto Exchange Hack",
    "url": "https://dailyhodl.com/2023/08/04/bitfinex-heist-ilya-lichtenstein-admits-he-was-behind-colossal-2016-crypto-exchange-hack/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/admits-he-was-behind.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The notorious &#8220;Crypto Couple&#8221; Ilya Lichtenstein and Heather Morgan pled guilty on Thursday to money laundering conspiracies relating to the massive 2016 hack on the crypto exchange Bitfinex. Lichtenstein also copped to executing the hack himself, clearing up years of mystery regarding how the couple first came into possession of the stolen Bitcoin (BTC) from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/bitfinex-heist-ilya-lichtenstein-admits-he-was-behind-colossal-2016-crypto-exchange-hack/\">Bitfinex Heist: Ilya Lichtenstein Admits He Was Behind Colossal 2016 Crypto Exchange Hack</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T16:49:17.000Z",
    "title": "Maya Protocol and Dash Join Forces, Expanding Cross-Chain and Privacy Capabilities",
    "url": "https://dailyhodl.com/2023/08/04/maya-protocol-and-dash-join-forces-expanding-cross-chain-and-privacy-capabilities/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Maya-Protocol-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Maya-Protocol-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/08/Maya-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/08/Maya-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Maya-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/08/Maya-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>In a significant move for DeFi, today, Maya Protocol announced an integration with the Dash blockchain. The move marks the first time Dash users can trade and earn using a decentralized and permissionless exchange. Maya Protocol is a decentralized liquidity protocol that allows users to easily exchange cryptocurrency assets across a range of networks – [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/maya-protocol-and-dash-join-forces-expanding-cross-chain-and-privacy-capabilities/\">Maya Protocol and Dash Join Forces, Expanding Cross-Chain and Privacy Capabilities</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]