[
  {
    "source": "Cointelegraph",
    "date": "2023-11-12T19:47:52.000Z",
    "title": "VET, IMX, GRT and ALGO show bullish setups as Bitcoin trades above $37K",
    "url": "http://cointelegraph.com/news/vet-imx-grt-and-algo-show-bullish-setup-as-bitcoin-trades-above-37-k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c3c43adf-68e2-4c4a-a778-651002c08662.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Large and small-cap altcoins are flashing bullish signs as Bitcoin price holds above $37,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is on target to end the week with gains of about 6%, indicating continued demand from the bulls. MicroStrategy co-founder Michael Saylor said during a speech at the 2023 Australia Crypto Convention on Nov. 10 that Bitcoin’s demand on a monthly basis could <a href=\"https://cointelegraph.com/news/demand-for-bitcoin-grow-by-10-x-michael-saylor\">surge between two to 10 times</a> by the end of 2024. Additionally, the halving will reduce the supply by half. Saylor expects both these events will cause the price “to adjust up.” </p><p>With almost a general consensus that Bitcoin’s price will move higher in 2024, analysts are busy projecting how high the rally could reach. Using its Terminal Price on-chain indicator, Look Into Bitcoin creator Philip Swift said that <a href=\"https://cointelegraph.com/news/bitcoin-terminal-price-next-btc-all-time-high-at-least-110k\">Bitcoin could hit at least $110,000</a> in its next bull cycle.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e94ce110-8c53-4219-b509-f52241c01542.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>While Bitcoin continues to hog the limelight, several <a href=\"https://cointelegraph.com/news/is-it-altseason-altcoin-30-day-performance-and-total-market-cap-flash-bullish\">major altcoins have been charging higher</a>. The broad-based cryptocurrency rally increases hopes that an altcoin season may be around the corner.</p><p>If the bullish sentiment sustains, altcoins may witness a rotation, wherein the high flyers face some profit booking, and the laggards start moving higher. Let’s look at the charts of the top-5 cryptocurrencies that may outperform in the near term.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has been holding above the ascending channel pattern for the past three days, indicating that the bulls are defending the breakout level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f5759d11-07f7-4108-ac82-7eb6c4e61d99.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will try to thrust the price above $38,000 and start the northward march toward $40,000. While the upsloping moving averages indicate that the bulls are in control, the overbought levels on the RSI warn of a potential correction.</p><p>If the price skids back into the channel, it will suggest that the markets have rejected the higher levels. That could open the doors for a fall to the channel’s support line, which is close to the 20-day exponential moving average ($34,784). </p><p>The bears will have to sink the price below the channel to indicate the start of a solid correction. The BTC/USDT pair may then decline to the $32,400 to $31,000 support zone.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0e71cff3-f047-4f76-a7ac-2609f812df5a.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The bulls are buying the dips to the 20-EMA on the 4-hour chart but have failed to resume the uptrend. This suggests a lack of demand at higher levels. The bears will try to utilize this opportunity and drag the price below the 20-EMA. If they do that, the pair may fall to the 50-SMA.</p><p>On the contrary, if the price turns up from the current level, it will suggest that the bulls have flipped the breakout level from the channel into support. That will enhance the prospects of a rally above $38,000.</p><h2>VeChain price analysis</h2><p>VeChain (<a href=\"https://cointelegraph.com/vechain-price-index\">VET</a>) completed a double bottom pattern after bulls pushed the price above the overhead resistance of $0.021 on Nov. 6.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a375cd3b-2f98-47f3-bc93-76f88128ce88.png\"  /><figcaption style=\"text-align: center;\"><em>VET/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls have managed to ward off attempts by the bears to pull the price back below $0.021. This suggests buyers are trying to flip the $0.021 level into support. The bulls will next attempt to propel the price above $0.023 and resume the up-move. If they do that, the VET/USDT pair could rally to the pattern target of $0.028.</p><p>Contrarily, if the price fails to rise above the $0.023 resistance, the likelihood of a drop to the 20-day EMA ($0.020) increases. A break and close below this support will suggest that the bears are back in the game. The pair may then slump to the 50-day SMA ($0.018).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/12383f1f-75f9-4b10-9f9b-f09ef91a5776.png\"  /><figcaption style=\"text-align: center;\"><em>VET/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/jDQu9g33/?symbol=BINANCE%3AvetUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The pair has been consolidating above the breakout level of $0.021 for some time. The 20-EMA is flattening out, and the RSI is near the midpoint, indicating a balance between supply and demand.</p><p>This equilibrium will tilt in favor of the buyers if they kick the price above $0.023. That could start the next leg of the uptrend. Instead, if the price turns down and plummets below $0.021, it will indicate that the markets have rejected the higher levels. That could start a fall to $0.020.</p><h2>Immutable price analysis</h2><p>Immutable (IMX) has risen sharply in the past few days, indicating that the bulls are attempting a comeback.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c897b071-9c50-4c31-82bd-546bb46e5937.png\"  /><figcaption style=\"text-align: center;\"><em>IMX/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The recovery is expected to face a formidable resistance at $1.30. If the price does not give up much ground from this level, it will enhance the prospects of a break above the overhead resistance. The IMX/USDT pair could then start a rally to $1.59.</p><p>The overbought level on the RSI warns of a possible correction or consolidation in the near term. If the price turns down sharply from the current level or $1.30, it will indicate that the bulls are rushing to the exit. That may pull the price down to the 20-day EMA ($0.84).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/00e778b6-6ebc-4de9-b1a0-87770e489b0b.png\"  /><figcaption style=\"text-align: center;\"><em>IMX/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/jDQu9g33/?symbol=BINANCE%3AimxUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The pair is gradually moving toward the overhead resistance of $1.30. The upsloping moving averages indicate that bulls remain in command, but the negative divergence on the RSI suggests that the bullish momentum is weakening. </p><p>Sellers may mount a vigorous defense at $1.30, but if the price stays above the moving averages during the pullback, it will improve the prospects of a rally above the overhead hurdle. Alternatively, if the price turns down sharply and slides below the 50-SMA, it will indicate the start of a pullback to $0.80.</p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/ftx-files-billion-dollar-lawsuit-against-bybit-over-asset-withdrawals\"><em>FTX files billion-dollar lawsuit against ByBit over asset withdrawals</em></a></strong></p><h2>The Graph price analysis</h2><p>The Graph (<a href=\"https://cointelegraph.com/the-graph-grt-price-index\">GRT</a>) has corrected after a sharp up-move, but a positive sign is that the bulls have managed to keep the price above the 20-day EMA ($0.12).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/00baa880-71ce-41df-863d-a58e9b3a2f09.png\"  /><figcaption style=\"text-align: center;\"><em>GRT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The GRT/USDT pair has been attempting to resume the up-move, but the bears are posing a strong challenge at $0.14. The upsloping moving averages and the RSI in the positive territory indicate that the path of least resistance is to the upside.</p><p>If bulls overcome the obstacle at $0.16, the pair may resume its uptrend. The pair could thereafter travel to $0.21. Contrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will indicate that the up-move has ended.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f44e02b8-a389-40be-8642-02da286c4454.png\"  /><figcaption style=\"text-align: center;\"><em>GRT/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AgrtUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The pair has found support at the 50-SMA on the 4-hour chart, but the bears are trying to halt the recovery near $0.14. If buyers pierce this resistance, the pair could retest the barrier at $0.16. This level may again witness a tough battle between the bulls and the bears.</p><p>On the downside, the 50-SMA remains the key level to keep an eye on. If this level gives way, the pair could tumble to the strong support at $0.12. This level is likely to attract buying by the bulls.</p><h2>Algorand price analysis</h2><p>Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>) is forming a rounding bottom pattern, which will complete on a break and close above the overhead resistance at $0.14.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/63b25e7c-1113-4a70-89c7-099307bfeccd.png\"  /><figcaption style=\"text-align: center;\"><em>ALGO/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The upsloping moving averages and the RSI in the overbought zone indicate that the bulls are at an advantage. If buyers maintain the price above $0.14, it will signal the start of a new up-move. The pattern target of the reversal setup is $0.20. If this level is scaled, the up-move may reach $0.24.</p><p>Alternatively, if the price turns down sharply from $0.14, it will suggest that bears continue to defend the level with vigor. The ALGO/USDT pair could then slump to the 20-day EMA ($0.12).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/cd75dfba-d934-4cc9-a6d6-03058b179292.png\"  /><figcaption style=\"text-align: center;\"><em>ALGO/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AalgoUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are buying the dip to the moving averages, indicating that the sentiment is turning positive. The real test for the bulls is at $0.14. If they shove and sustain the price above this level, the pair is likely to pick up momentum.</p><p>On the downside, the moving averages remain the key level to watch out for. A break below the 20-EMA could pull the price to the 50-SMA. If this level cracks, the pair may start a correction to $0.10.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-12T19:45:49.000Z",
    "title": "Solana (SOL) Surges Forward, Yet Potential Remains Untapped",
    "url": "https://cryptodaily.co.uk/2023/11/solana-sol-surges-forward-yet-potential-remains-untapped",
    "description": "Explore the remarkable journey of Solana (SOL) in a buoyant crypto market with our in-depth analysis. Uncover the driving forces behind its recent surge and potential challenges ahead. Stay informed with our expert insights, guiding you through the possibilities of continued success or unexpected turns in the volatile cryptocurrency landscape."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-12T19:45:10.000Z",
    "title": "Binance CEO Says Executives From a Client Were Lured Into Massive $12,500,000 Crypto Robbery Setup",
    "url": "https://dailyhodl.com/2023/11/12/binance-ceo-says-executives-from-a-client-were-lured-into-massive-12500000-crypto-robbery-setup/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Scammer-Stole-Over-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of the world’s largest crypto exchange says that executives from one of its clients recently fell victim to a multi-million-dollar heist. In a post on social media platform X, Binance CEO Changpeng Zhao says the executives were lured into traveling to Montenegro for a purported business trip but were instead kidnapped and forced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/12/binance-ceo-says-executives-from-a-client-were-lured-into-massive-12500000-crypto-robbery-setup/\">Binance CEO Says Executives From a Client Were Lured Into Massive $12,500,000 Crypto Robbery Setup</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]