[
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T14:01:00.000Z",
    "title": " Changpeng Zhao’s next move could involve decentralized science ",
    "url": "https://cointelegraph.com/news/changpeng-zhao-decentralized-science-medicine",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNzY1Y2JiOTktODQxNS00ZDJhLWI3NTEtYWY1ZTk4YWEwZjI3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Decentralized science, or DeSci, aims to apply decentralized business models to medical research.  </p>\n                    <p><p>Changpeng “CZ” Zhao’s tenure as the CEO of Binance may be over, but the exchange giant’s loss could be a boon for the decentralized science (DeSci) sector.</p><p>In a comment on X (formerly Twitter) on Tuesday, Nov. 28, the former Binance CEO <a href=\"https://twitter.com/cz_binance/status/1729277854431527163?s=20\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> an interest in the rapidly developing sector.</p><p><a href=\"https://cointelegraph.com/news/changpeng-zhao-decentralized-science-medicine\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T13:44:33.000Z",
    "title": " Web3 can benefit from adopting Web2 optimization: NBX Berlin  ",
    "url": "https://cointelegraph.com/news/web3-can-benefit-from-adopting-web2-optimization-nbx-berlin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMGNkNmQ2ZjUtNTQyYy00Nzg3LWIwNzMtYzQyYzYyZmYwZDU1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>User experience remains a barrier to entry for the world of Web3 and industry builders believe the solution lies in onboarding Web2 functionality. </p>\n                    <p><p>Web3 products and services could benefit from the streamlined user experiences that have been mastered by Web2, according to several industry builders who attended Next Block Expo in Berlin.</p><p>Speaking to Cointelegraph at the event, Web3Auth senior cryptography engineer Matthias Geihs said Web3 services continue to be hamstrung by clunky login features and the associated responsibility and technicality of wallet and private key management.</p><p>During his presentation, Geihs cited data that suggests 20% of Bitcoin lost by users is a result of poor wallet management. At the same time, many Web3 services suffer significant drop-off rates of potential users at the sign-up stage on their websites and platforms.</p><p><a href=\"https://cointelegraph.com/news/web3-can-benefit-from-adopting-web2-optimization-nbx-berlin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-07T13:51:13.000Z",
    "title": "Bitcoin Core v26 goes live as 1% of nodes upgrade on launch day",
    "url": "https://cryptoslate.com/bitcoin-core-v26-goes-live-as-1-of-nodes-upgrade-on-launch-day/",
    "description": "<p>Bitcoin Core version 26.0 was released yesterday, Dec. 6, and 1% of Bitcoin nodes have been upgraded within the first 24 hours. This latest update to the primary software used to interact with the Bitcoin network introduces key enhancements aimed at improving security and network performance. Bitcoin Core, often likened to the operating system for [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-core-v26-goes-live-as-1-of-nodes-upgrade-on-launch-day/\">Bitcoin Core v26 goes live as 1% of nodes upgrade on launch day</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-07T13:47:46.000Z",
    "title": "Seed Phrases No More, SafeAuth Brings Social Logins to Wallets",
    "url": "https://cryptobriefing.com/seed-phrases-no-more-safeauth-brings-social-logins-to-wallets/?utm_source=feed&utm_medium=rss",
    "description": "SafeAuth reshapes the crypto wallet experience by introducing social login options in collaboration with Web3Auth and Safe."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-07T13:47:38.000Z",
    "title": "io.net and Filecoin Team Up to Expand Storage Provider Incentives",
    "url": "https://cryptodaily.co.uk/2023/12/ionet-and-filecoin-team-up-to-expand-storage-provider-incentives",
    "description": "Filecoin Storage Providers (SPs) can look forward to greater demand for their hardware and greater revenue streams. The good news comes courtesy of decentralized cloud service io.net, which has partnered with Filecoin to unlock greater GPU compute for its clients."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T14:07:18.000Z",
    "title": "Exclusive: How Can AI Help Companies Enhance Data Security Measures?",
    "url": "https://www.cryptopolitan.com/ai-help-companies-enhance-data-security/",
    "description": "AI&#8217;s capabilities to learn, adapt, and foresee are transforming businesses&#8217; approach to safeguarding their most crucial asset – their data. AI is not just an additional tool; it&#8217;s becoming a core component of organizational strategies to defend their data. This exclusive report aims to shed light on the diverse roles of AI in data protection, ... <a title=\"Exclusive: How Can AI Help Companies Enhance Data Security Measures?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-help-companies-enhance-data-security/\" aria-label=\"More on Exclusive: How Can AI Help Companies Enhance Data Security Measures?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T14:02:39.000Z",
    "title": "Thailand overtakes giants, emerges a crypto titan – HashKey Report ",
    "url": "https://www.cryptopolitan.com/thailand-emerges-a-global-crypto-hub-hashkey/",
    "description": "HashKey Capital, a renowned Asian crypto fund, published its annual report in Singapore on December 7, 2023, showcasing Thailand&#8217;s outstanding growth in the global crypto industry.&#160; The report highlights Thailand&#8217;s prominent role in Asia&#8217;s crypto scene, which has been fueled by widespread adoption, a significant increase in digital asset trading volume, favorable regulations, and a ... <a title=\"Thailand overtakes giants, emerges a crypto titan &#8211; HashKey Report \" class=\"read-more\" href=\"https://www.cryptopolitan.com/thailand-emerges-a-global-crypto-hub-hashkey/\" aria-label=\"More on Thailand overtakes giants, emerges a crypto titan &#8211; HashKey Report \">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T13:44:54.000Z",
    "title": "Can BONK or PEPE flip Shiba Inu to second behind Dogecoin?",
    "url": "https://crypto.news/can-bonk-or-pepe-flip-shiba-inu-to-second-behind-dogecoin/",
    "description": "As smaller meme coins like BONK and PEPE rally, speculation is growing about whether one could potentially overtake Shiba Inu"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T14:00:19.000Z",
    "title": "Can Bitcoin Spot ETFs Attract Enough Capital? Experts On What Will Lead To ATH",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etfs-ath/",
    "description": "Trading firm QCP Capital has shared its thoughts on what could drive the flagship cryptocurrency, Bitcoin, to its all-time high (ATH) of $69,000. From their analysis, Spot Bitcoin ETFs have a huge role to play in all of this.  Bitcoin Hitting $69,000 Dependent On Spot BTC ETFs QCP Capital stated that revisiting its ATH of $69,000 will depend on the “genuine flows the actual ETF will bring in the first few weeks of trading.” If the inflows are below par, the trading firm noted that it could set things up for the classic ‘sell-the-news’ moment.  Related Reading: Crypto Analyst Predicts Dogecoin Price Pump Of Epic Proportions To $0.7, Here’s When This assumption seems to stem from their belief that the news could already be priced in. They highlighted how Bitcoin has so far enjoyed incredible gains on the back of optimism that the SEC is going to approve these Spot Bitcoin ETFs. Bitcoin has already risen to as high as $45,000 this month and is said to be up 15% MTD in the first week.  With this in mind, QCP Capital is conscious of the fact that investors are most likely already positioned for an approval order by the SEC. If that is the case, Bitcoin and the broader crypto market will need something else to sustain this bullish momentum. That is why the trading firm has singled out liquidity flowing into these Spot Bitcoin ETFs as being key. Renowned Economist Peter Schiff had previously warned of a possible sell-the-news event when he mentioned that Bitcoin is unlikely to rally again once a Spot BTC ETF is approved. That is because he believes that the current Bitcoin rally is a result of many already ‘buying the rumor.’ As such, once approval comes, the next thing could be these ‘investors selling the news.’ BTC price recovers from flash crash &#124; Source: BTCUSD on Tradingview.com Capital Expected To Flow Into These Spot BTC ETFs There is reason to believe that enough liquidity will flow into these Spot Bitcoin ETFs and the Bitcoin ecosystem to sustain the current market rally. Crypto research firm Galaxy Digital once published a report that stated that these funds could see $14 billion of inflows in the first year of launch.  Related Reading: Crypto Expert Delivers Top 8 Altcoins To Buy On Binance Specifically, Galaxy Digital estimates that these funds will see an adjusted inflow of over $10 billion in their first month. These inflows should be enough to sustain Bitcoin’s rally as the research firm projects that Bitcoin’s price could see a 74.1% increase in the first year of these funds launching.  Meanwhile, Blockchain analytics firm Glassnode is of the opinion that an approval order by the SEC will bring in a substantial influx of investors. They predict that about $70.5 billion could flow into Bitcoin due to increased demand from institutional investors. Featured image from Easy Crypto, chart from Tradingview.com"
  }
]