[
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T11:26:31.000Z",
    "title": "Xbox to enhance game dialogues with generative AI through new partnership",
    "url": "http://cointelegraph.com/news/xbox-integrate-ai-dialogues-games-partnership",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/0734e355-8623-4360-bc64-53641803ec99.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company will provide an AI toolset for game developers to improve scripts, dialogue trees and quests inside games. </p>\n                    <p><p>Gaming console Xbox is tapping into artificial intelligence (AI) with a new partnership intending to boost game creators by integrating generative AI into their game creation toolkits. </p><p>In a blog post, Xbox general manager of gaming AI Haiyan Zhang <a href=\"https://developer.microsoft.com/en-us/games/articles/2023/11/xbox-and-inworld-ai-partnership-announcement/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that the company is building AI game dialogue and narrative tools through a multi-year partnership with Inworld AI, a company focused on allowing the integration of AI into non-playable characters (NPCs) in-game. Zhang wrote: </p><blockquote>“We see a world of opportunities to accelerate game developer creativity, reduce complexity, and enhance player experiences.”</blockquote><p>According to Zhang, the AI toolset will include an AI design copilot that will assist designers in exploring ideas. It will allow developers to turn prompts into scripts, dialogue trees and quests. Apart from this, they will also include an AI character runtime engine which can be integrated into game clients. This will allow for the creation of new narratives and stories that enhance players' experiences. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we announced a partnership with <a href=\"https://twitter.com/Xbox?ref_src=twsrc%5Etfw\">@Xbox</a>.<br><br>With the advent of generative AI, there’s an opportunity to leverage cutting-edge innovations to foster limitless creativity and unparalleled immersion.<a href=\"https://twitter.com/hashtag/AI?src=hash&amp;ref_src=twsrc%5Etfw\">#AI</a> <a href=\"https://twitter.com/hashtag/gamedev?src=hash&amp;ref_src=twsrc%5Etfw\">#gamedev</a> <a href=\"https://twitter.com/hashtag/indiedev?src=hash&amp;ref_src=twsrc%5Etfw\">#indiedev</a><a href=\"https://t.co/fHp56zghEJ\">https://t.co/fHp56zghEJ</a></p>&mdash; Inworld AI (@inworld_ai) <a href=\"https://twitter.com/inworld_ai/status/1721551277585551648?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>With AI integrated into games, background characters interacting with users will have an unlimited number of responses to various options. This is made possible by connecting AI-generated dialogue lines instead of the more common fixed scripts commonly seen in traditional games. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/artificial-general-intelligence-singularitynet-coo-future-blockchain-summit\"><strong><em>How decentralization can mitigate ‘dystopic’ artificial intelligence risks — SingularityNET exec</em></strong></a></p><p>Earlier this year, developers started experimenting with integrating AI with various games. On Apr. 28, a video demonstrating AI-generated dialogue through a video game called The Elder Scrolls V: Skyrim was published. With the integration, the player could ask the NPCs any question they wanted, and the AI would generate responses that were delivered to the player. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/d6sVWEu9HWU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>On May 29, Nvidia also <a href=\"https://www.youtube.com/watch?v=5R8xZb6J3r0\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a demonstration of AI dialogue integration into NPCs inside games. Within the demonstration, the player used his microphone to speak with the NPC naturally in a normal conversation. The player asked the AI how he was doing, and he answered like a human, speaking about his worries about crime and how his ramen shop got caught in the crossfire. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/introducing-trivergence-transformation-blockchain-ai-iot/\"><strong><em>Introducing the Trivergence: Transformation driven by blockchain, AI and the IoT</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T11:15:43.000Z",
    "title": "Australian central bank’s surprise interest rate hike could signal global shift",
    "url": "https://cryptoslate.com/insights/australian-central-bank-surprise-interest-rate-hike-could-signal-global-shift/",
    "description": "<p>Quick Take The Reserve Bank of Australia&#8217;s (RBA) recent decision to increase their interest rate from 4.1% to 4.35% &#8211; the first rise since May 2023 &#8211; presents an intriguing trend in contrast to the anticipated actions of the Federal Reserve and other Western central banks. Australia&#8217;s Consumer Price Index (CPI) inflation currently persists at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/australian-central-bank-surprise-interest-rate-hike-could-signal-global-shift/\">Australian central bank&#8217;s surprise interest rate hike could signal global shift</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T11:22:02.000Z",
    "title": "Kenya Moves Toward Developing Crypto Regulation in Pioneering Effort",
    "url": "https://www.cryptopolitan.com/kenya-toward-developing-crypto-regulation/",
    "description": "In a groundbreaking development, Kenya is poised to become the first country in the world where industry representatives are actively involved in shaping the regulatory framework for cryptocurrencies.&#160; The move comes as the Blockchain Association of Kenya (BAK) was directed by the National Assembly’s Departmental Committee on Finance and National Planning to draft what could ... <a title=\"Kenya Moves Toward Developing Crypto Regulation in Pioneering Effort\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kenya-toward-developing-crypto-regulation/\" aria-label=\"More on Kenya Moves Toward Developing Crypto Regulation in Pioneering Effort\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T11:13:49.000Z",
    "title": "Shiba Inu’s Shib Magazine Faces Temporary Login Issue",
    "url": "https://www.cryptopolitan.com/shiba-inus-shib-magazine-faces-login-issue/",
    "description": "In an official statement released on the X social media platform, Lucie, the marketing expert of the Shiba Inu team, has addressed the SHIB army, bringing attention to a temporary issue plaguing the recently launched Shib Magazine website. Lucie emphasized that the login feature on the Shib Magazine site is currently unavailable to users. However, ... <a title=\"Shiba Inu&#8217;s Shib Magazine Faces Temporary Login Issue\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inus-shib-magazine-faces-login-issue/\" aria-label=\"More on Shiba Inu&#8217;s Shib Magazine Faces Temporary Login Issue\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T11:11:00.000Z",
    "title": "S Korea SK Telecom expands into Web3 with T wallet",
    "url": "https://www.cryptopolitan.com/sk-telecom-expands-into-web3-with-t-wallet/",
    "description": "South Korean telecommunications giant SK Telecom (SKT) has announced its plans to launch a Web3 wallet service named T wallet in collaboration with blockchain companies Aptos Labs and Atomrigs Lab. This strategic partnership aims to expand SK Telecom&#8217;s presence in the world of decentralized applications and customer-preferred mainnets. SK Telecom&#8217;s journey into the world of ... <a title=\"S Korea SK Telecom expands into Web3 with T wallet\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sk-telecom-expands-into-web3-with-t-wallet/\" aria-label=\"More on S Korea SK Telecom expands into Web3 with T wallet\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T11:24:32.000Z",
    "title": "Gemini loses second executive amid U.S. legal turmoil",
    "url": "https://crypto.news/gemini-loses-second-executive-amid-u-s-legal-turmoil/",
    "description": "Winklevoss&#8217; Gemini is losing its second executive this year as the firm struggles to expand in the Asia-Pacific region amid legal battles in the U.S. Gemini&#8217;s Chief Technology Officer Pravjit Tiwana is leaving the firm after he joined in early&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T11:30:22.000Z",
    "title": "Ethereum Bullish Revival: Will This Breakthrough Lead To A New Market Phase?",
    "url": "https://www.newsbtc.com/news/ethereum-bullish-revival/",
    "description": "Ethereum (ETH), the second-largest cryptocurrency by market capitalization, has exhibited a promising technical development, igniting optimism within the crypto community. The formation of a bullish flag pattern within the daily timeframe has captured the attention of analysts and traders, hinting at potential positive movements in the near future. A bullish flag pattern is a common technical analysis formation in financial markets, frequently visible on price charts. It involves an upward price surge (the flagpole) succeeded by a consolidation or sideways movement (the flag) within a downward or sideways channel. Typically identified within the daily timeframe, it signals recent upward movement followed by a consolidation phase. Traders and analysts keenly observe this pattern as it often implies a potential continuation of an upward trend. This aligns perfectly with the current recovery sentiment in the cryptocurrency market, as Ether managed to breach the upper trendline of the pattern earlier this week, pointing towards the possibility of a substantial upward surge. Related Reading: Chainlink Enters Bull Territory, Signals Long-Term Uptrend — Crypto Expert Ethereum: Breakthrough Resistance The recent surge in Ethereum&#8217;s price has broken past a critical resistance level marked by the convergence of its 50-day and 100-day Exponential Moving Averages (EMAs). These EMAs hold paramount importance for traders and analysts, often serving as key indicators of market trends and momentum. The successful breach of this resistance level further reinforces the bullish sentiment surrounding Ethereum, indicating a potential shift towards a more robust upward trajectory. The bullish flag pattern that has taken shape on Ethereum&#8217;s price chart has been a long time in the making, spanning over a period of seven months. During this time, the price of ETH has fluctuated within the converging trendlines of the pattern, reflecting the market&#8217;s indecision and the tug-of-war between buyers and sellers. It is noteworthy that the upper boundary of the pattern has acted as a significant support level twice, underlining its influence in shaping market sentiment and price dynamics. Related Reading: XRP Hits Critical Price Juncture As Whales Scoop Up 1.26 Billion Coins Ethereum currently trading at $1,883 on the daily chart: TradingView.com Market Insights And Caution As of the latest market data provided by CoinGecko, the current price of Ethereum stands at $1,890, reflecting a modest 24-hour gain of 0.5% and a notable upward trajectory of 5.3% over the past seven days. These figures reaffirm the growing interest in Ethereum, highlighting the market&#8217;s confidence in the coin&#8217;s potential for further gains. Source: Coingecko Industry experts and seasoned traders offer valuable insights into this recent development, emphasizing the importance of closely monitoring the price action and overall market sentiment surrounding Ethereum. With the bullish flag pattern hinting at a potential bullish continuation, market participants are advised to stay vigilant and consider the implications of this technical setup in their trading strategies. Despite the positive momentum, caution remains essential, as the cryptocurrency market is known for its inherent volatility and unpredictability. Investors and traders are advised to conduct thorough research, employ risk management strategies, and stay informed about market developments to make well-informed decisions in this dynamic and rapidly evolving landscape.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T11:25:26.000Z",
    "title": "Cardano and Polkadot SDK Unite for Partner Chain: Pioneering Web3 Innovation",
    "url": "https://www.crypto-news-flash.com/cardano-and-polkadot-sdk-unite-for-partner-chain-pioneering-web3-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-and-polkadot-sdk-unite-for-partner-chain-pioneering-web3-innovation",
    "description": "<img width=\"640\" height=\"426\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot launches OpenGov, an open governance platform.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />This collaboration between Polkadot and Cardano aims to demonstrate Substrate&#8217;s adaptability in the Web3 domain and its ease of use for various blockchain ecosystems. Charles Hoskinson&#8217;s introduction of a new architectural approach for Cardano has paved the way for partner chains that can leverage Cardano&#8217;s fundamental features while maintaining independence. On Monday, November 6, Polkadot [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-07T11:24:42.000Z",
    "title": "San FranTokyo Teams up With Animoca Brands and Cool Cats",
    "url": "https://coinedition.com/san-frantokyo-teams-up-with-animoca-brands-and-cool-cats/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/WEB-3.0-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent announcement on X (formerly Twitter), San FranTokyo, a decentralized city, unveiled a strategic partnership with leading global Web3 company Animoca Brands Japan and an investment in Cool Cats, a Web3 company and a global character brand.&#160; Cool Cats, known for its iconic characters such as Blue, Chugs, Ardi, and Jo, is poised [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/san-frantokyo-teams-up-with-animoca-brands-and-cool-cats/\">San FranTokyo Teams up With Animoca Brands and Cool Cats</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]