[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T11:11:58.000Z",
    "title": "Wholesale CBDC Would Improve Cross-Border Payments, French Central Bank Tests Show  ",
    "url": "https://www.coindesk.com/policy/2023/07/21/wholesale-cbdc-would-improve-cross-border-payments-french-central-bank-tests-show/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The French Central Bank has determined that its wholesale central bank digital currency (wCBDC) would improve cross-border payments, it announced on Friday."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T11:33:01.000Z",
    "title": "China Targets Travelers With Digital Yuan as Tourist Season Looms",
    "url": "https://decrypt.co/149495/china-targets-travelers-with-digital-yuan-as-tourist-season-looms",
    "description": "As China enters the summer vacation months, the government is actively promoting the digital yuan to travelers."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-21T11:22:25.000Z",
    "title": "Sam Bankman-Fried Accused of Leaking Ellison’s Docs to NYT: US DOJ",
    "url": "https://cryptobriefing.com/sam-bankman-fried-accused-leaking-ellisons-docs/?utm_source=feed&utm_medium=rss",
    "description": "Sam Bankman-Fried (SBF), the founder and ex-CEO of the fallen cryptocurrency exchange FTX, is now faced with an accusation by the U.S. Department of Justice (DoJ). He is alleged to..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T11:14:15.000Z",
    "title": "Central bank digital currencies - an evil beyond evil",
    "url": "https://cryptodaily.co.uk/2023/07/central-bank-digital-currencies-an-evil-beyond-evil",
    "description": "<p>Will governments across the world inflict their CBDCs on their unsuspecting populations?</p>\nPoor knowledge of CBDCs\n<p>It was reported by Crypto Daily a year ago that 83% of respondents to a Crypto.com survey on digital currencies that was carried out by Economic Impact thought that &ldquo;greater international cooperation&rdquo; was needed in order to &ldquo;legitimise&rdquo; CBDCs.&nbsp;</p>\n<p>One of the questions asked in the survey was about the&rdquo;barriers to CBDC adoption&rdquo;. Here, only 27% of respondents said that a barrier was that they are &ldquo;not well understood&rdquo;.</p>\n<p>However, probably the most concerning data that came out of the survey was the following:</p>\n\n<p>&ldquo;More than nine in ten (93%) now say they agree that issuance of central bank digital currencies (CBDCs) is necessary to establish a functioning market for new financial instruments such as digital bonds or other forms of digital assets,&rdquo;&nbsp;</p>\n\n<p>If one adds that executives were very &ldquo;pro CBDCs&rdquo; and that &ldquo;nearly 87% of all respondents strongly agreed that consumer demand for CBDCs has increased in their country&rdquo;, then a clearer picture emerges (if the survey is to be believed) that at least among the respondents at the time, the idea of a central bank digital currency was actually welcomed.</p>\nWhere is the government educational material on CBDCs?\n<p>Therefore, the question has to be asked: Where are all the mainstream media articles or televised debates on the advantages or disadvantages of implementing CBDCs nationwide, or even as is being talked about by some international financial agencies - worldwide?</p>\n<p>The most important change to the monetary system since Bretton Woods is already being implemented in several countries across the world, and is being developed in many others, and there is hardly a ripple of discussion in mainstream channels.</p>\nCBDCs - a technology to cancel wealth\n<p>Rick Rule, CEO of Rule Investment Media, and ex-president and CEO of Sprott U.S. Holdings, had the following to say on CBDCs in a YouTube interview with Mike Maloney:</p>\n<p>&ldquo;The idea that your cash, your savings, exist as a licence from your government, is terrifying to me.&rdquo;</p>\n<p>He added:</p>\n<p>If you combine the idea of a technological cancellable currency, however it&rsquo;s held, with artificial intelligence and the Chinese technology around so-called social scoring or social credit, you come to a circumstance where your savings which are the result of the utility that you created in society can be cancelled.&rdquo;</p>\n<p>Rick Rule went on to cite the recent example of how Trudeau&rsquo;s government had seized the bank accounts of Canadians who were supporting the truckers with donations. The seizures were illegal and without recourse to the courts. Rule&rsquo;s fear is that CBDCs would make this kind of action incredibly easy to implement.</p>\n<p>Given the lack of any educational content from governments to citizens on the roll-out of CBDCs it would behove the citizens to make their own investigations into the matter. Time is of the essence.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-21T11:30:55.000Z",
    "title": "Kids Won’t Be Able to Spend Mom’s Digital Ruble as They Wish, Russian Official Says",
    "url": "https://news.bitcoin.com/kids-wont-be-able-to-spend-moms-digital-ruble-as-they-wish-russian-official-says/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kids Won’t Be Able to Spend Mom’s Digital Ruble as They Wish, Russian Official Says\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_267541667.jpg 1281w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The new form of Russia’s fiat, the digital ruble, will make spending more efficient for both government and family budgets, according to a high-ranking lawmaker. Anatoly Aksakov, who was involved in the recent adoption of the new digital ruble legislation, highlighted some of the advantages of programmable central bank money as he sees them. Central [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T11:17:47.000Z",
    "title": "US state agency warns of soaring crypto scams on social media platforms",
    "url": "https://www.cryptopolitan.com/us-state-agency-warns-soaring-crypto-scams-on-social-media-platforms/",
    "description": "The Vermont Department of Financial Regulation (DFR) issued an investor alert on July 20, 2023, highlighting the increasing risks associated with cryptocurrency investments on social media platforms and urging the public to exercise extreme caution. The alert was prompted by a recent NPR story featuring 74-year-old Naum Lantsman, who lost his life savings to a ... <a title=\"US state agency warns of soaring crypto scams on social media platforms\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-state-agency-warns-soaring-crypto-scams-on-social-media-platforms/\" aria-label=\"More on US state agency warns of soaring crypto scams on social media platforms\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T11:14:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T11:29:17.000Z",
    "title": "Concerns about ApeCoin intensify as investors explore DigiToads and Monero",
    "url": "https://crypto.news/concerns-about-apecoin-intensify-as-investors-explore-digitoads-and-monero/",
    "description": "Investors looking to secure their portfolios have been turning to assets like DigiToads and Monero as concerns about ApeCoin intensify"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T11:10:31.000Z",
    "title": "FTX sues Bankman-Fried and execs to recover $1b",
    "url": "https://crypto.news/ftx-sues-bankman-fried-and-execs-to-recover-1b/",
    "description": "FTX filed a fresh lawsuit against former CEO Sam Bankman-Fried (SBF) and his close associates. It is looking to recover over $1 billion in misappropriated funds. The lawsuit lists: The lawsuit claims that they failed in their fiduciary duties while&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T11:30:24.000Z",
    "title": "Why Are Top Crypto Whales Switching from Ethereum to this Hot New GameFi Token?",
    "url": "https://www.crypto-news-flash.com/why-are-top-crypto-whales-switching-from-ethereum-to-this-hot-new-gamefi-token/?utm_source=rss&utm_medium=rss&utm_campaign=why-are-top-crypto-whales-switching-from-ethereum-to-this-hot-new-gamefi-token",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T125540.942.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T125540.942.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T125540.942-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Investors are profit hunters, so you can be sure to find them where there’s the highest ROI. Times are changing, and new cryptos are springing up, with promises of astronomical returns for investors while flagship coins like Ethereum and Bitcoin are in a downtrend or stagnant.  Q3 is moving slowly, and investors are losing their [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T11:16:48.000Z",
    "title": "Crypto Whales Are Buying into Pepe and Tradecurve, Should You Follow?",
    "url": "https://www.crypto-news-flash.com/crypto-whales-are-buying-into-pepe-and-tradecurve-should-you-follow/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-whales-are-buying-into-pepe-and-tradecurve-should-you-follow",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T104038.733.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T104038.733.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T104038.733-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Whales have begun accumulating different cryptocurrencies following a massive crypto market price surge. Out of them, PEPE and Tradecurve (TCRV) have stood out as the most-bought cryptocurrencies. 536 ETH, worth $1.04 million, was spent to buy 613 billion PEPE between June 14 and July 11. Join us as we uncover why these projects grabbed appeal. [...]"
  }
]