[
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T20:56:25.000Z",
    "title": " IRS rules require reporting data from $10k crypto transactions in 2024 ",
    "url": "https://cointelegraph.com/news/irs-rules-10k-crypto-transactions-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvODhlMGRiNzktZmY1MS00ZGU2LTlhMTctNzJmNDk4OTdkY2ZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to Coin Center executive director Jerry Brito, it’s “unclear how one can comply” with the crypto tax reporting guidelines in 2024.</p>\n                    <p><p>Aspects of the infrastructure bill signed into law by United States President Joe Biden are now in effect — including provisions requiring many digital asset transactions worth more than $10,000 to be reported to the Internal Revenue Service (IRS).</p><p>The bipartisan infrastructure bill, passed by Congress and signed into law by President Biden in 2021, expanded the requirements for brokers to have many crypto exchanges and custodians report crypto transactions greater than $10,000 to the IRS. Following the bill’s passage, many lawmakers <a href=\"https://cointelegraph.com/news/us-lawmakers-introduce-bill-to-fix-crypto-reporting-requirement-from-infrastructure-law\">suggested additional legislation</a> to “fix” the reporting requirement, claiming that the information required from brokers would be difficult or impossible to collect.</p><p>The bill mandates crypto brokers to report personal information on transactions to the IRS, including the sender’s name, address and social security number, within 15 days. The requirements, aimed at reducing the size of the tax gap in the United States, were initially <a href=\"https://cointelegraph.com/news/us-govt-delays-enforcement-of-crypto-broker-reporting-requirements-report\">scheduled to take effect</a> in January 2023, having companies send reports to the IRS in 2024.</p><p><a href=\"https://cointelegraph.com/news/irs-rules-10k-crypto-transactions-2024\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T21:00:01.000Z",
    "title": "Bitcoin’s year-end analysis reveals robust growth and resilient investor behavior: CryptoSlate Alpha Snapshot",
    "url": "https://cryptoslate.com/bitcoins-year-end-analysis-reveals-robust-growth-and-resilient-investor-behavior-cryptoslate-alpha-snapshot/",
    "description": "<p>Welcome to this month&#8217;s CryptoSlate Alpha Snapshot, an exclusive overview of the most insightful research, market reports, and analyses released over the past month for our dedicated subscribers. This comprehensive compilation, accessible only to those who have staked the minimum requirement of 20,000 ACS tokens to our Access Protocol pool on Solana, is your gateway [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-year-end-analysis-reveals-robust-growth-and-resilient-investor-behavior-cryptoslate-alpha-snapshot/\">Bitcoin&#8217;s year-end analysis reveals robust growth and resilient investor behavior: CryptoSlate Alpha Snapshot</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T20:40:59.000Z",
    "title": "Crypto voters emerge as potential swing force in 2024 U.S. elections: Report",
    "url": "https://www.cryptopolitan.com/crypto-voters-swing-force-u-s-elections/",
    "description": "The political landscape in the United States is witnessing an emerging trend: cryptocurrency users could become a significant voting bloc in the 2024 elections. A recent Crypto Council for Innovation (CCI) survey indicates that crypto voters may play a pivotal role, especially in closely contested races. This development comes amid tight polling margins in various [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-02T20:51:40.000Z",
    "title": "Dramatic Surges In Whale Transactions Shake Up Shiba Inu (SHIB) Token",
    "url": "https://nulltx.com/dramatic-surges-in-whale-transactions-shake-up-shiba-inu-shib-token/",
    "description": "The Shiba Inu (SHIB) token blockchain is currently witnessing a staggering surge in whale transactions. Particularly those amounting to $100,000 or more, which skyrocketed by an astonishing 1,314% in the last 24 hours. Large transactions involving $SHIB, valued at $100,000, have skyrocketed the price surge by 1,314% within the last [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T20:41:40.000Z",
    "title": "Jim Cramer: Bitcoin cannot be killed, is here to stay",
    "url": "https://crypto.news/jim-cramer-bitcoin-cannot-be-killed-is-here-to-stay/",
    "description": "Economic analyst Jim Cramer asserts that Bitcoin's recent resilience and technological prowess signal its permanence as it surges past $45,000 amid anticipation of a spot Bitcoin ETF approval."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T21:00:35.000Z",
    "title": "Top 5 Events That Shook Up The Crypto Industry In 2023",
    "url": "https://www.newsbtc.com/crypto/top-5-events-crypto-2023/",
    "description": "In the year 2023, the crypto industry witnessed a series of events that left a long-lasting impact on the crypto landscape. From the start of the Spot Bitcoin ETF mania to the increase in regulatory enforcement on major crypto organizations, 2023 was nothing short of a rollercoaster ride for crypto enthusiasts and institutional investors alike. So here are the top 5 events that shook the crypto industry to its core in 2023. Blackrock Spot Bitcoin ETF Rocks Crypto The world’s largest asset management company, BlackRock was the first major traditional investment firm to apply for a Spot Bitcoin Exchange Traded Fund (ETF). BlackRock submitted its application for a Spot Bitcoin ETF to the United States Securities and Exchange Commission (SEC) on June 15, 2023.  Related Reading: Crypto Expert Shares Ultimate Crypto Portfolio Guide To Make It In 2024 Following the asset management firm’s application, various companies like Grayscale, Ark Invest, WisdomTree, VanEck, and others followed suit. Despite consistent approval delays by the US SEC, BlackRock utilized the time to revise its Spot Bitcoin ETF filing, incorporating cash redemptions to improve the fund’s approval odds.  Sam Bankman-Fried Fraud Conviction Founder and former CEO of failed crypto exchange, FTX, Sam Bankman-Fried was found guilty of all seven counts of fraud, conspiracy, and money laundering on November 2, 2023.  The 31-year-old billionaire was convicted unanimously by the jury for misappropriating billions of dollars of customer funds and defrauding lenders to subsidiary company, Alameda Research. Bankman-Fried could potentially face a maximum of 115 years in prison. His sentencing date is scheduled for March 28, 2024.  CZ Resignation From Binance Causes A Stir In Crypto Community One of the most shocking events of 2023, saw the founder of Binance, Changpeng Zhao officially stepping down from his role as the CEO of Binance on November 21, 2023.  The former Binance CEO pleaded guilty to breaking US anti-money laundering laws and resigned as part of a $4.3 billion settlement by the United States Department of Justice (DOJ). CZ has also been restricted from leaving the United States until his court case is over as the court believes his vast resources make him a potential flight risk. And returning to Dubai which does not share an extradition treaty with the US could make things problematic. Total market cap draws down to $1.6 trillion  &#124; Source: Crypto Total Market Cap on Tradingview.com XRP Ruling In SEC Case Coming as a major victory in a three-year-long legal battle between Ripple and the SEC, US District Judge Analisa Torres ruled in favor of Ripple on July 13, 2023. The ruling declared that programmatic sales of XRP did not qualify as a security.  This decision offered much-needed regulatory clarity for XRP, enabling the cryptocurrency to resume trading on major crypto exchanges that had delisted it during the SEC’s 2020 lawsuit. Grayscale And Coinbase Rage Against The SEC On August 29, 2023, world-leading crypto asset management company Grayscale won its lawsuit against the US SEC. The D.C. Circuit Court of Appeals gave a final ruling to the regulatory agency to terminate its rejection of the asset management’s Spot Bitcoin ETF application.  Related Reading: Crypto Analyst Says History Shows What Might Be Next For Bitcoin, But Is It Good Or Bad? On a similar note, Coinbase, one of the largest US crypto exchanges, filed a lawsuit against the SEC in April 2023 aiming to compel the regulator to provide regulatory clarity for the crypto industry.  Subsequently, the SEC sued Coinbase on June 6, 2023, alleging that the crypto exchange had violated securities laws by operating as an unregistered broker. As a result, Coinbase formally requested the court to dismiss the SEC’s case against it. However, the case is still ongoing. Featured image from University of California, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-02T21:00:23.000Z",
    "title": "CryptoQuant Unveils Huge Downside Target for Bitcoin (BTC) Following ‘Sell-the-News’ Event This Month",
    "url": "https://dailyhodl.com/2024/01/02/cryptoquant-unveils-huge-downside-target-for-bitcoin-btc-following-sell-the-news-event-this-month/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Novogratz-Doubles-Down-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>On-chain analytics platform CryptoQuant believes that a deep corrective move is brewing for Bitcoin as the market eagerly anticipates the possible approval of spot-based BTC exchange-traded funds (ETFs). In a research report, CryptoQuant says that the approval of Bitcoin ETFs sometime this month could be a sell-the-news event as BTC investors are now sitting on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/02/cryptoquant-unveils-huge-downside-target-for-bitcoin-btc-following-sell-the-news-event-this-month/\">CryptoQuant Unveils Huge Downside Target for Bitcoin (BTC) Following ‘Sell-the-News’ Event This Month</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-02T20:55:39.000Z",
    "title": "CNBC’s Jim Cramer Flips Bullish on Bitcoin, Says BTC Here To Stay After ‘Remarkable Comeback’",
    "url": "https://dailyhodl.com/2024/01/02/cnbcs-jim-cramer-flips-bullish-on-bitcoin-says-btc-here-to-stay-after-remarkable-comeback/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/cramer-warns-dozen.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>CNBC personality Jim Cramer is suddenly flipping bullish on Bitcoin (BTC) after dismissing the digital asset last year. In a new episode of CNBC’s Squawk on the Street, Cramer says that Bitcoin has a bright future in the finance world, having survived sharp criticism and other challenges. “This thing is, you can&#8217;t kill [Bitcoin]. And [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/02/cnbcs-jim-cramer-flips-bullish-on-bitcoin-says-btc-here-to-stay-after-remarkable-comeback/\">CNBC’s Jim Cramer Flips Bullish on Bitcoin, Says BTC Here To Stay After ‘Remarkable Comeback’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]