[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T12:21:14.000Z",
    "title": "First Mover Americas: Bitcoin Begins June Dropping Back Below $27K ",
    "url": "https://www.coindesk.com/markets/2023/06/01/first-mover-americas-bitcoin-begins-june-dropping-back-below-27k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 1, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-01T12:19:02.000Z",
    "title": "Tron's Justin Sun Thinks Hong Kong Will Be a Big Fiat Onramp for Crypto",
    "url": "https://decrypt.co/videos/interviews/agBnfg7Z/trons-justin-sun-thinks-hong-kong-will-be-a-big-fiat-onramp-for-crypto",
    "description": "Justin Sun, Tron founder and advisor to crypto exchange Huobi, talks to Decrypt's Liam Kelly and Stacy Elliott about the impact of Hong Kong allowing residents to trade crypto, complications of restricting access based on location, and how AI will change the industry."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T12:20:00.000Z",
    "title": "Memecoins the next catalyst for crypto adoption — DappRadar analyst",
    "url": "https://cointelegraph.com/news/memecoins-for-adoption-dappradar-analyst-podcast-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/783670e8-7937-424c-98f2-815621d99a46.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sara Gherghelas, a blockchain research analyst at DappRadar, explains how the lower barrier of entry associated with memecoins may have sparked the adoption of the crypto asset class.</p>\n                    <p><p>In episode 22 of <em>Hashing It Out</em> with Cointelegraph’s Elisha Owusu Akyaw, Sara Gherghelas, blockchain research analyst at DappRadar — a cryptocurrency data tracking platform — discusses the recent hype around memecoins, while looking at on-chain data. Gherghelas also provides insights on how other sectors, such as nonfungible tokens (NFTs), are faring as memecoins take off.</p><p>Gherghelas believes we are in a memecoin era. From her perspective, when you mention Web3 or cryptocurrencies in 2023, many people will associate the terms with memecoins. Gherghelas says there have been multiple memecoin cycles in the cryptocurrency space, but this time is different because the trend has been sustained for a more extended period. </p><p>The blockchain analyst associates the trend with the popularity of memecoins on social media and the creation of tight-knit communities that people want to be a part of. What’s more, the price action of memecoins in this cycle has attracted a large crowd of traders looking to make returns, according to Gherghelas. She also adds that memecoins are more accessible and inclusive due to their low barrier of entry. </p><blockquote>“You can be a millionaire in Shiba, but you can never afford one million Bitcoin or one million Ethereum.“</blockquote><p>Memecoins could be more than just a social media trend or an attempt to make quick returns. Gherghelas highlighted projects like Shiba Inu, which is building a decentralized exchange and layer-2 network, and Floki Inu, which is building a metaverse. The blockchain research analyst believes that memecoins are not a zero-sum game for the cryptocurrency industry because most people who come in through memecoins may stay and discover other aspects of crypto. </p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096415\"></template><p>While memecoins flourished, other cryptocurrency industry sectors struggled, according to data tracked by DappRadar. Gherghelas highlights the decrease in wallet activities on blockchain gaming platforms and mentions that NFTs maintained a decent amount of activity. </p><p><em><strong>Related: </strong></em><strong><em><a href=\"https://cointelegraph.com/news/financial-surveillance-privacy-and-cbdcs-why-are-governments-going-cashless\">Financial surveillance, privacy and CBDCs: Why are governments going cashless?</a></em></strong></p><p>Check out the latest episode of <em>Hashing It Out,</em> featuring Sara Gherghelas from DappRadar, on <a href=\"https://podcasts.apple.com/us/podcast/hashing-it-out/id1658998696\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/3ibvcrJ87PAso4DBIiE5qn\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>, <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8yMDk2NDE1LnJzcw==\" target=\"_blank\" rel=\"noopener nofollow\">Google Podcasts</a> or <a href=\"https://tunein.com/podcasts/Business--Economics-Podcasts/Hashing-It-Out-p3083469/\" target=\"_blank\" rel=\"noopener nofollow\">TuneIn</a>. For more informative podcasts, visit the <a href=\"https://cointelegraph.com/podcasts\">Cointelegraph Podcasts page</a>.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T12:20:48.000Z",
    "title": "Asia’s Bitcoin supply continues to increase during bear market",
    "url": "https://cryptoslate.com/insights/asias-bitcoin-supply-continues-to-increase-during-bear-market/",
    "description": "<p>Quick Take Asia&#8217;s Bitcoin supply is at its highest level since 2016. This metric estimates the year-over-year change in the share of the Bitcoin supply held or traded in Asia. The year-over-year supply in Asia has just breached 9%; this is the highest level since the bear market back in 2016, which got to 10%. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/asias-bitcoin-supply-continues-to-increase-during-bear-market/\">Asia&#8217;s Bitcoin supply continues to increase during bear market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T12:13:31.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T12:34:31.000Z",
    "title": "Monero privacy bug decreased anonymity for 3 years",
    "url": "https://crypto.news/monero-privacy-bug-decreased-anonymity-for-3-years/",
    "description": "A recently disclosed bug in the privacy-centric cryptocurrency monero (XMR) has compromised user anonymity for the past three years. The bug, which affected the decoy selection process in monero transactions, has been patched in the latest version of the monero&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T12:26:00.000Z",
    "title": "Carbon integrates Alliance assets from Terra",
    "url": "https://crypto.news/carbon-integrates-alliance-assets-from-terra/",
    "description": "In a recent announcement on Twitter, Carbon, a cross-chain staking protocol, revealed the introduction of their first Alliance assets from Terra. This listing sets the stage for expanded opportunities to generate higher yields on LUNA. The recent integration will allow&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T12:22:09.000Z",
    "title": "Ethereum Fees Plunge 69% From Yearly High, What This Means For ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-fees-plunge-70-following-a-yearly-high-in-may/",
    "description": "In a significant development for the Ethereum network, average transaction fees have witnessed a sharp decline. This plunge comes shortly after the Ethereum network recorded a significant spike in fees in May driving it to a yearly high. According to the latest data from the popular market intelligence platform Santiment, Ethereum fees have now settled somewhere below $5 from the yearly high of above $10 per ETH transaction in early May. It is worth noting that this latest update marks a positive shift for Ethereum users and the broader ecosystem. The Return To Normalcy: Ethereum Fees Reclaim Stability On the last day of May, Santiment data revealed Ethereum fees have dropped by roughly 69% from their yearly high of $14 per ETH transaction in early May. The data shows ETH fees have now settled at $4.28 per transaction in the past hours.  Related Reading: Did The US SEC Just Endorse Ethereum After This Settlement? Notably, the surge in Ethereum fees during the meme coin frenzy, fueled by the popularity of the frog-themed meme coin Pepe (PEPE) token, had initially led to inflated transaction costs for Ethereum users. However, recent data highlights a welcome reversal of this trend, with fees plummeting back to more reasonable levels. The 69% decrease in transaction fees over a mere 25-day period signals a positive outlook for Ethereum&#8217;s network adoption and user engagement. According to the Santiment team, the decline in fees is a promising sign that Ethereum is becoming more affordable for users, consequently encouraging greater utility and activity within the network. Lower transaction costs not only attract new users but also incentivize existing participants to make full use of Ethereum&#8217;s capabilities. As fees normalize, it paves the way for enhanced accessibility, making Ethereum a more considerable platform for various applications, including decentralized finance (DeFi), non-fungible tokens (NFTs), and more. Self-Custody Trend And ETH Supply Another noteworthy trend accompanying the fee reduction is the declining percentage of Ethereum supply held on crypto exchanges. Recent data also from Santiment reveals that the Ethereum supply on exchanges has reached an all-time low of 10.31%. This decrease is a result of the growing preference for self-custody solutions among Ethereum holders due to security concerns related to centralized exchanges. Additionally, regulatory uncertainties surrounding the classification of ETH as a security or commodity have contributed to this shift. For context, Self-custody refers to the practice of holding one&#8217;s assets in secure wallets and personal accounts rather than relying on third-party exchanges. The increased self-custody of ETH indicates a rising level of confidence among holders and a desire to retain control over their digital assets. This development aligns with the ethos of decentralization and further strengthens Ethereum&#8217;s position as a trusted and secure platform for value transfer and smart contracts. Related Reading: Ethereum’s Block Size Surges To 1-Month High – What This Means For ETH The combination of lower transaction fees and the rise of self-custody underscores Ethereum&#8217;s growing maturity and resilience as a blockchain network. These developments not only foster confidence among existing users but also attract new participants to join the Ethereum ecosystem. Meanwhile, ETH hasn&#8217;t shown any noteworthy spike in the past weeks aside from a 4.3% increase over the past 7 days. The second crypto asset by market capitalization has surged nearly 5% in the past week. And over the past 24 hours, ETH has seen a 0.4% loss in value. At the time of writing, Ethereum currently trades at $1,860 as its trading volume has also plummeted from nearly $8 billion last Thursday to $6.4 billion in the past 24 hours. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T12:22:52.000Z",
    "title": "Breaking News: Terra Classic Community Astounded by Edward Kim’s Groundbreaking AI Chain Revealed",
    "url": "https://www.crypto-news-flash.com/breaking-news-terra-classic-community-astounded-by-edward-kims-groundbreaking-ai-chain-revealed/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-news-terra-classic-community-astounded-by-edward-kims-groundbreaking-ai-chain-revealed",
    "description": "<p>The Block Entropy app users will be able to generate AI images on the Terra Classic chain by inputting a few descriptive words. Terra Classic blockchain has attracted significant DeFi developments with a total value locked (TVL) of approximately $2,595,574. The Terra Classic (LUNC) core developers have made tremendous progress in the past year to [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-news-terra-classic-community-astounded-by-edward-kims-groundbreaking-ai-chain-revealed/\">Breaking News: Terra Classic Community Astounded by Edward Kim&#8217;s Groundbreaking AI Chain Revealed</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T12:21:51.000Z",
    "title": "Massive Gaming Partners with Neowiz & IntellaX to Launch Free Revolutionizing Online Hold’em Game, House of Poker, in June 2023",
    "url": "https://www.crypto-news-flash.com/massive-gaming-partners-with-neowiz-intellax-to-launch-free-revolutionizing-online-holdem-game-house-of-poker-in-june-2023/?utm_source=rss&utm_medium=rss&utm_campaign=massive-gaming-partners-with-neowiz-intellax-to-launch-free-revolutionizing-online-holdem-game-house-of-poker-in-june-2023",
    "description": "<p>Seattle, United States, May 30th, 2023, Chainwire Massive Gaming, in collaboration with Neowiz and IntellaX, is thrilled to announce the upcoming launch of House of Poker, a free and revolutionary online hold&#8217;em game. With an official release date set for June 2023, House of Poker is set to redefine the gaming experience for poker enthusiasts [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/massive-gaming-partners-with-neowiz-intellax-to-launch-free-revolutionizing-online-holdem-game-house-of-poker-in-june-2023/\">Massive Gaming Partners with Neowiz &amp; IntellaX to Launch Free Revolutionizing Online Hold&#8217;em Game, House of Poker, in June 2023</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T12:20:00.000Z",
    "title": "Coinbase Points Out Misguided Rules by the SEC on RIA’s Requirement",
    "url": "https://coinedition.com/coinbase-points-out-misguided-rules-by-the-sec-on-rias-requirement/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/We_appreciate_the_chance_to_weigh_in_and_we_look_forward_to_engaging.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Coinbase has recently filed a qualified custodian (QC) proposal comment letter to the US Securities and Exchange Commission. The comment is in response to the commission&#8217;s February 15 proposal, which is focused on updating the investment adviser custody rule. Coinbase chief legal officer Paul Grewal also recently put out a tweet to stress the same [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-points-out-misguided-rules-by-the-sec-on-rias-requirement/\">Coinbase Points Out Misguided Rules by the SEC on RIA’s Requirement</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]