[
  {
    "source": "Decrypt",
    "date": "2023-11-28T03:13:10.000Z",
    "title": "Humans Are ‘Deeply Good’: Ethereum Creator Vitalik Buterin",
    "url": "https://decrypt.co/207692/humans-are-deeply-good-ethereum-creator-vitalik-buterin",
    "description": "AI development needs to prioritize human intention for positive outcomes, not just profit maximization, says Buterin."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T03:10:58.000Z",
    "title": "Bitcoin Price Grinds Lower As Risk of Drop To $35K Escalates",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-grinds-lower-35k/",
    "description": "Bitcoin price is moving lower below the $37,000 level. BTC could continue to move down toward the $36,000 level or even $35,000 zone in the coming sessions. Bitcoin is showing bearish signs and moving lower from the $37,750 resistance. The price is trading below $37,400 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $37,380 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move down if it breaks the $36,750 support. Bitcoin Price Extends Decline Bitcoin price started a downside correction after it spiked toward the $38,500 zone. BTC followed a bearish path and settled below the $37,200 level (as discussed in yesterday&#8217;s post). There was a drop below the $37,000 level. A low was formed near $36,720 and the price is now consolidating losses. It climbed a bit above the 23.6% Fib retracement level of the recent drop from the $38,432 swing high to the $36,720 low. Bitcoin is now trading below $37,400 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $37,400 level. There is also a key bearish trend line forming with resistance near $37,380 on the hourly chart of the BTC/USD pair. The first major resistance is forming near $37,570 or the 100 hourly Simple moving average. It is close to the 50% Fib retracement level of the recent drop from the $38,432 swing high to the $36,720 low. The main resistance is now near the $38,000 level. A close above the $38,000 resistance might start a strong increase. Source: BTCUSD on TradingView.com The next key resistance could be near $38,500, above which BTC could rise toward the $39,200 level. In the stated case, it could even move toward the $40,000 resistance. More Losses In BTC? If Bitcoin fails to rise above the $37,570 resistance zone, it could continue to move down. Immediate support on the downside is near the $36,720 level. The next major support is $36,500. If there is a move below $36,500, there is a risk of more downsides. In the stated case, the price could drop toward the $35,650 support in the near term. The next key support or target could be $35,000. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $36,720, followed by $36,000. Major Resistance Levels – $37,400, $37,570, and $38,000."
  }
]