[
  {
    "source": "CryptoGlobe",
    "date": "2023-08-02T02:21:00.000Z",
    "title": "Shiba Inu Supply on Exchanges Dropped by 3.3 Trillion $SHIB in July, Data Shows",
    "url": "https://www.cryptoglobe.com/latest/2023/08/shiba-inu-supply-on-exchanges-dropped-by-3-3-trillion-shib-in-july-data-shows/",
    "description": "A staggering 3.3 trillion tokens of the meme-inspired cryptocurrency Shiba Inu ($SHIB), worth over $28 million, have been pulled out of centralized cryptocurrency exchanges throughout the month of July in a large-scale withdrawal analysts are seeing as a drop in available supply. According to popular crypto analyst Ali Martinez, on-chain data shows that last month […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T02:30:31.000Z",
    "title": "BlackRock CEO Larry Fink Is The Best Thing To Happen To Bitcoin, Mike Novogratz Says",
    "url": "https://www.newsbtc.com/bitcoin-news/blackrock-larry-fink-best-thing-to-happen-to-bitcoin/",
    "description": "BlackRock officially announced its entrance into Bitcoin earlier this year by filing for a Spot Bitcoin ETF with the United States Securities and Exchange Commission (SEC). Although the regulator is yet to accept the filing, CEO Larry Fink has also made some supportive comments, comparing BTC to digital gold.  In light of these events, Galaxy Digital CEO Mike Novogratz has come forward to share his opinions on BlackRock CEO Larry Fink and how he affects the digital asset. BlackRock CEO&#8217;s Pivoting Sentiment Toward Bitcoin Galaxy Digital CEO Mike Novogratz has stated that BlackRock’s CEO Larry Fink&#8217;s change of heart is the best thing to happen to Bitcoin.  &#8220;I think the most important thing that happened this year in Bitcoin is Larry Fink,&#8221; Novogratz mentioned during an interview on Bloomberg TV with David Rubenstein. Related Reading: USDT Issuer Tether Reports A 30% Decline In Profit Novogratz believes Fink’s acceptance of Bitcoin highlights a shifting sentiment towards Bitcoin and other digital currencies worldwide.  According to him, &#8220;180 million people around the world, without a gun to their head, take their hard-earned savings and store it in this community of people that run this technology, you know, called bitcoin.&#8221; He further opined that Fink’s change of heart, alongside the increasing adoption of cryptocurrencies, could help Bitcoin surpass its all-time high of $69,000 recorded in 2021.  Blackrock’s CEO Larry Fink was long known to be a skeptic of cryptocurrencies as he once went as far as tagging BTC an “index of money laundering.”  “Bitcoin just shows you how much demand for money laundering there is in the world,” Fink stated in 2017. BTC price continues to fall as it trades at $28,789 &#124; Source: BTCUSD on Tradingview.com However, there has been a change of heart from the CEO as earlier in June, BlackRock filed an application to the SEC to establish a Bitcoin spot ETF, a move that saw some other institutions file a similar application.  In fact, in a show of support for cryptocurrencies, Fink stated that crypto, especially bitcoin could “revolutionize finance.” During an interview with Fox Business, he stated: “We do believe that if we can create more tokenization of assets and securities – that’s what bitcoin is – it could revolutionize finance.”  Regulatory Environment Far From Certain Novogratz also noted Ripple’s recent victory over the SEC, with a judge ruling that the XRP token isn’t a security when sold on secondary exchanges. The Galaxy Digital CEO believes the court’s decision highlights the fact that regulators are still not familiar with the crypto space, and regulations from these regulators &#8220;are nowhere close to clear.&#8221; Related Reading: US Presidential Candidate Defends Bitcoin, Calls Out Environmental Critics The United States Securities and Exchange Commission has, so far, continued to label many cryptocurrencies as “securities” and filed separate lawsuits against different crypto exchanges and firms for allowing the trade of “unregistered securities.”  However, if the recent ruling is anything to go by, it is obvious that the regulators are mistaken, and there is a need for the US Congress to enact crypto-related laws for stakeholders (including regulators) to gain more clarity on how to navigate the industry regulatory-wise.  Featured image from CryptoSlate, chart from Tradingview.com"
  }
]