[
  {
    "source": "Decrypt",
    "date": "2024-01-10T00:06:54.000Z",
    "title": "Gensler's ‘Compromised’ Bitcoin ETF Tweet Inscribed as an Ordinals NFT",
    "url": "https://decrypt.co/212226/fake-sec-gensler-tweet-inscribed-bitcoin-ordinals",
    "description": "A fake tweet sent Bitcoin’s price tumbling. Degens immortalized the SEC chair’s response as digital art."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-10T00:00:20.000Z",
    "title": "WisdomTree and Valkyrie add fee waivers to spot Bitcoin ETF applications",
    "url": "https://cryptoslate.com/wisdomtree-and-valkyrie-add-fee-waivers-to-spot-bitcoin-etf-applications/",
    "description": "<p>Two more asset managers have temporarily waived fees for their spot Bitcoin ETFs, Bloomberg ETF analyst James Seyffart said on Jan. 9. Seyffart indicated that WisdomTree will waive its fees for 6 months or the first $1 billion of assets, reducing fees from 0.30% to zero during the waiver period. He also indicated that Valkyrie [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/wisdomtree-and-valkyrie-add-fee-waivers-to-spot-bitcoin-etf-applications/\">WisdomTree and Valkyrie add fee waivers to spot Bitcoin ETF applications</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-09T23:43:00.000Z",
    "title": "Ethereum Whales Buy up $1 Billion Worth of ETH as Price Lags Behind Bitcoin",
    "url": "https://www.cryptoglobe.com/latest/2024/01/ethereum-whales-buy-up-1-billion-worth-of-eth-as-price-lags-behind-bitcoin/",
    "description": "Ethereum ($ETH) whales have accumulated nearly $1 billion worth of the second-largest cryptocurrency by market capitalization in just the last month as the cryptocurrency’s price fails to perform as well as BTC itself. According to data shared by popular cryptocurrency analyst Ali Martinez, Ethereum whales acquired over 410,000 ETH tokens over the past month as […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-10T00:00:49.000Z",
    "title": "Bitcoin Blasts Off As Institutionals Continue Buying On Coinbase",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-blasts-off-institutionals-buying-coinbase/",
    "description": "Bitcoin has observed a sharp rally beyond the $47,000 level as data shows buying pressure on Coinbase has displayed no signs of letting off. Bitcoin Has Surged More Than 4% In Last 24 Hours As ETF Deadline Nears After the asset&#8217;s indecisiveness over the last few days, the cryptocurrency has appeared to have picked its direction in the last 24 hours, as its price has increased sharply. Related Reading: Bitcoin Correlation To Nasdaq Continues To Be Negative: What It Means At the peak of this surge, the coin had crossed beyond the $47,300 mark, but since then, the coin has registered some pullback as it&#8217;s now down to $46,500. The below chart shows how Bitcoin has performed during the last few days. Looks like the asset's price has blasted off in the past day &#124; Source: BTCUSD on TradingView With this surge, the coin is up over 4% in the last 24 hours. The only cryptocurrencies in the top 20 market cap list that have attained better returns during this period are Solana (SOL) and Bitcoin Cash (BCH). This latest rally to levels not visited since March 2022 has come for the cryptocurrency as the US SEC deadline for a decision on BTC spot ETFs is approaching fast. With the expectation in the market widely being that the ETFs would get approved, it&#8217;s not surprising that buyers may be jumping in, expecting the asset to rally further after the ETFs start trading. Data of an indicator could also point towards large entities being involved in accumulation in this leadup to the day of decision. BTC Coinbase Premium Gap Has Been Positive For More Than A Week Now As CryptoQuant Netherlands community manager Maartunn pointed out in a post on X, the Bitcoin Coinbase Premium Gap has been positive for several consecutive days. The &#8220;Coinbase Premium Gap&#8221; refers to a metric that keeps track of the difference between the Bitcoin prices listed on cryptocurrency exchanges Coinbase (USD pair) and Binance (USDT pair). This indicator&#8217;s value tells us about the difference in the buying (or selling) behaviors on the two largest platforms in the sector. Below is a chart showing the recent trend in this metric&#8217;s 14-day simple moving average (SMA). The value of the metric seems to have been green since a while now &#124; Source: @JA_Maartun on X As displayed in the above graph, the Bitcoin Coinbase Premium Gap has been positive for almost 2024, with only one dip in the metric coming on the first day of the year. Related Reading: These Altcoins Are Showing Most Bullish &#38; Bearish Divergences: Santiment This suggests that the buying pressure on Coinbase has been greater than on Binance for over a week now. US-based institutional investors widely use the former, while the latter hosts more global traffic. Thus, this indicates that large institutional traders have possibly been going shopping recently. Another indicator that suggests accumulation from the whales is the &#8220;large holders netflow&#8221; metric from IntoTheBlock, which has displayed positive spikes recently. The data for the BTC large holders netflow since the start of the year &#124; Source: IntoTheBlock on X &#8220;Large holders bought the dip! Bitcoin holders holding &#62;1% of the supply accumulated more than 14k BTC over the past week as prices dipped below $43k,&#8221; explains IntoTheBlock. Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com, IntoTheBlock.com"
  }
]