[
  {
    "source": "CryptoSlate",
    "date": "2023-08-22T22:00:45.000Z",
    "title": "Bitcoin’s long-term holder supply hits record high as short-term interest dips",
    "url": "https://cryptoslate.com/insights/bitcoins-long-term-holder-supply-hits-record-high-as-short-term-interest-dips/",
    "description": "<p>Quick Take Recent data analysis reveals an all-time high in Bitcoin’s long-term holder supply, defined as Bitcoin held for more than 155 days, reaching 14.654 million. Conversely, the short-term holder supply, considering Bitcoin holdings of less than 155 days, has plummeted to an all-time low of 2.561 million if we exclude the year 2011. This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-long-term-holder-supply-hits-record-high-as-short-term-interest-dips/\">Bitcoin&#8217;s long-term holder supply hits record high as short-term interest dips</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T22:01:25.000Z",
    "title": "Putin: USD is losing its global role “objectively and irreversibly”",
    "url": "https://www.cryptopolitan.com/putin-usd-is-losing-its-global-role/",
    "description": "The USD&#8217;s long-standing dominance in the world market seems to be slipping, according to a significant assertion from Russian President Vladimir Putin during the recent BRICS Summit. Putin’s words, though delivered virtually, resonated with the weighty significance of shifting global power balances. The winds of economic change While the U.S. dollar has for decades been ... <a title=\"Putin: USD is losing its global role &#8220;objectively and irreversibly&#8221;\" class=\"read-more\" href=\"https://www.cryptopolitan.com/putin-usd-is-losing-its-global-role/\" aria-label=\"More on Putin: USD is losing its global role &#8220;objectively and irreversibly&#8221;\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T22:00:58.000Z",
    "title": "99.5% Of AVAX Holders In Loss, As Avalanche Bears Thirst For More Blood",
    "url": "https://www.newsbtc.com/avalanche/99-5-of-avax-holders-in-loss-as-avalanche-bears-thirst-blood/",
    "description": "The Avalanche token (AVAX), like most other altcoins, felt the bearish impact of the general market downturn, which resulted in a billion-dollar liquidation in the crypto market. Historical price data, however, shows that AVAX has been experiencing selling pressure long before this recent market crash. As expected, the struggling price of the Avalanche token has also been reflected in the portfolio of the cryptocurrency&#8217;s investors, who seem to be drowning in losses at the moment. AVAX Holders In Profit Reach All-Time Low: IntoTheBlock On Tuesday, August 22, market intelligence platform IntoTheBlock revealed &#8211; via a post on X (formerly Twitter) &#8211; that the number of AVAX holders in profit is at an all-time low.  According to IntoTheBlock data, approximately 99.5% of AVAX holders are at a loss. This metric implies that nearly all investors in this cryptocurrency bought at a higher price and are currently holding at a loss due to the sustained bearish trend. Related Reading: XRP About-Face Sparks Another Descent – What Lies Ahead? From a historical perspective, AVAX holders have witnessed similar levels of loss in the past, albeit not to this extent. The on-chain tracker reported that the number of AVAX holders in profit was almost as low in June and December 2022. It is worth noting that these losses are unrealized, and they only become real when the Avalanche tokens &#8211; being held &#8211; are traded off. Although a high number of crypto holders in loss is not exactly a positive signal, it can be an indication that investors are yet to lose faith in a token and may even be banking on a recovery. Avalanche Price Dips 17% In A Single Week As mentioned earlier, the AVAX price has been struggling long before the recent market downturn, down by 52% from its yearly high of 21.37%. Unfortunately, the Avalanche market has been in a steep decline since notching a swing high in April. In the past week, which coincided with the $1-billion market liquidation, AVAX has lost more than 17% of its value. Furthermore, a broader look at the market data shows that the token is on a nearly 25% decline in the last 30 days. Related Reading: XRP Price Shows Confluence Of Bearish Factors and Could Decline Again The future doesn&#8217;t look particularly bright for AVAX, especially with its upcoming token unlock event. A total of 9.54 million tokens is set to be unlocked on August 26, with a large portion of the unlocked tokens expected to hit the open market, potentially exacerbating the struggles of the Avalanche price. According to CoinGecko data, AVAX is currently valued at $10.20, registering a 3.5% price decline in the past 24 hours. With a market cap of roughly $3.52 billion, the Avalanche token ranks as the 22nd-largest cryptocurrency in the market. Avalanche price suffers further decline on daily timeframe &#124; Source: AVAXUSDT chart on TradingView Featured image from Investopedia, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-22T22:01:45.000Z",
    "title": "Appeal of Crypto Is ‘Illusory’ and Amplifying Financial Risks of Emerging Markets: Bank for International Settlements",
    "url": "https://dailyhodl.com/2023/08/22/appeal-of-crypto-is-illusory-and-amplifying-financial-risks-of-emerging-markets-bank-for-international-settlements/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/organization-behind-fourth-invest.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cryptocurrencies increase the financial risks of emerging economies, according to a new report published by the global central bank umbrella organization known as the Bank for International Settlements (BIS). The report says that cryptocurrencies cannot solve developing countries&#8217; financial challenges, despite some arguing that digital assets can address such problems as high-fee payment transactions and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/22/appeal-of-crypto-is-illusory-and-amplifying-financial-risks-of-emerging-markets-bank-for-international-settlements/\">Appeal of Crypto Is ‘Illusory’ and Amplifying Financial Risks of Emerging Markets: Bank for International Settlements</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]