[
  {
    "source": "CoinDesk",
    "date": "2023-06-02T18:15:07.000Z",
    "title": "Marathon Digital Mined 77% More Bitcoin in May With the Help of Its Software",
    "url": "https://www.coindesk.com/tech/2023/06/02/marathon-digital-mined-77-more-bitcoin-in-may-with-the-help-of-its-software/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The miner's bitcoin production per unit of computing power was low in April."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-02T18:11:24.000Z",
    "title": "Blockchain Association Files Amicus Brief in Coin Center Lawsuit Against U.S. Treasury Over Tornado Cash Sanctions",
    "url": "https://www.coindesk.com/policy/2023/06/02/blockchain-association-files-amicus-brief-in-coin-center-lawsuit-against-us-treasury-over-tornado-cash-sanctions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In a statement, the trade group’s CEO Kristin Smith, said that regulatory actions should only target bad actors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T18:25:00.000Z",
    "title": "CBDC 'may not be a compelling priority,' says Kenya's central bank",
    "url": "https://cointelegraph.com/news/cbdc-may-not-be-a-compelling-priority-says-kenya-s-central-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4beebff7-fad0-4d34-906c-bc909462180f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The central bank released its statement in response to comments on a CBDC discussion paper published in February 2022.</p>\n                    <p><p>The Central Bank of Kenya received comments on a discussion paper on the potential issuance of a digital shilling, and hasn’t a definitive conclusion. </p><p>In a June 2 announcement on Twitter, Kenya’s central bank <a href=\"https://twitter.com/CBKKenya/status/1664579975255654402\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it received more than 100 comments from members of the public, commercial banks, tech firms, and other participants across nine countries regarding the issuance of a central bank digital currency, or CBDC. The responses varied from highlighting potential benefits and risks, but the central bank said it would “continue to monitor developments” and take a “measured approach\" to consider assessing the rollout of a digital shilling in the future.</p><p>“Implementation of a CBDC in Kenya may not be a compelling priority in the short to medium term,” said the central bank. “Significantly, Kenya's pain points in payment could potentially continue to be addressed by other innovative solutions around the existing ecosystem.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Press Release - Issuance of Discussion Paper on Central Bank Digital Currency: Comments from the Public <a href=\"https://t.co/dMlrUj2eD6\">pic.twitter.com/dMlrUj2eD6</a></p>&mdash; Central Bank of Kenya (@CBKKenya) <a href=\"https://twitter.com/CBKKenya/status/1664579975255654402?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The statement <a href=\"https://cointelegraph.com/news/central-bank-of-kenya-seeks-public-input-on-potential-cbdc\">followed the discussion paper</a> Kenya’s central bank released in February 2022. The bank added that it had been collaborating with other central banks behind proof of concepts for CBDCs, but noted “the allure of CBDCs is fading\" on the global stage.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kenya-considers-tax-on-crypto-nft-transfers-and-online-influencers\"><strong><em>Kenya considers tax on crypto, NFT transfers and online influencers</em></strong></a></p><p>As one of the largest economies in Africa by GDP, Kenya has <a href=\"https://cointelegraph.com/news/ghana-set-to-catch-up-to-nigeria-and-kenya-in-terms-of-crypto-adoption-chainalysis\">grown its adoption</a> of crypto and blockchain significantly in the last few years. Peer-to-peer platform Paxful is widely used among crypto enthusiasts in the African nation, and there are Bitcoin mining projects <a href=\"https://cointelegraph.com/news/bitcoin-mining-project-in-kenya-helps-power-rural-community\">helping to provide power</a> to rural communities.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\"><strong><em>Bitcoin in Senegal: Why is this African country using BTC?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T18:36:48.000Z",
    "title": "Cleanspark fiscal year revenue crosses $100M amid expansion plans",
    "url": "https://cryptoslate.com/cleanspark-fiscal-year-revenue-crosses-100m-amid-expansion-plans/",
    "description": "<p>Bitcoin (BTC) miner CleanSpark&#8217;s fiscal year-to-date revenue crossed $100 million in May as its BTC production exceeded expectations, according to a June 2 statement. CEO Zach Bradford noted that these milestones were achieved even though most of its expansion plans were expected later this year. BTC production is up 16% CleanSpark reported that it mined [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cleanspark-fiscal-year-revenue-crosses-100m-amid-expansion-plans/\">Cleanspark fiscal year revenue crosses $100M amid expansion plans</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T18:22:36.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T18:25:40.000Z",
    "title": "Swiss digital asset infrastructure platform Taurus integrates with Polygon",
    "url": "https://crypto.news/taurus-partners-with-polygon-to-advance-tokenization-and-defi/",
    "description": "Swiss digital asset service provider, Taurus, has formed a strategic alliance with Ethereum blockchain scaling network, Polygon."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T18:13:17.000Z",
    "title": "Nigerian central bank maintains stance on crypto withdrawal restrictions",
    "url": "https://crypto.news/nigerian-central-bank-maintains-stance-on-crypto-withdrawal-restrictions/",
    "description": "Nigeria's cryptocurrency landscape has experienced ongoing turmoil, with citizens embracing digital assets while the government remains steadfast in its opposition."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T18:30:46.000Z",
    "title": "Bloomberg’s Senior Macro Strategist Predicts More Pain Ahead For Bitcoin",
    "url": "https://www.newsbtc.com/bitcoin-news/bloombergs-senior-macro-strategist-predicts-more-pain-ahead-for-bitcoin/",
    "description": "In his latest report titled &#8220;Crypto Outlook, June 2023,&#8221; Bloomberg&#8217;s Senior Macro Strategist, Mike McGlone, predicts more pain ahead for Bitcoin (BTC) and the broader cryptocurrency market. McGlone argues that despite a rebound in prices in 2023, the risks for the Bloomberg Galaxy Crypto Index remain tilted downward. Related Reading: No More Crab: Bitcoin Poised For Explosive Move Above $30,000 Is Bitcoin Doomed? According to McGlone, cryptocurrencies face several headwinds, including the potential for a US recession, a potential stock bear market, vigilant central banks, and high interest-rate competition. These factors, combined with the speculative excesses that led to the 2021 peak, suggest that the outlook for the crypto market is bearish. Furthermore, McGlone points out that Bitcoin weakening in May, along with copper and equities in China, is unusual compared to the stalwart Nasdaq 100 Stock Index. While the potential for the Nasdaq to lift all boats exists, it may contrast with still-rising Fed rate-hike expectations.  Additionally, McGlone suggests that Bitcoin, which is often referred to as digital gold due to its perceived status as a store of value, may not be able to outperform the traditional safe-haven asset in a US economic contraction. This is because Bitcoin is still relatively young compared to gold, which has been used as a store of value for thousands of years. As a result, investors may be more likely to flock to gold during times of economic uncertainty, rather than newer assets like Bitcoin. Moreover, plunging commodities, producer prices, and bank deposits may serve as deflationary omens of the lags to Federal Reserve tightening. These factors suggest that the risks for the Bloomberg Galaxy Crypto Index are tilted downward, and investors should be cautious. As reported by NewsBTC on May 22nd, Mike McGlone highlighted the historical patterns of boom and bust in Bitcoin, which are closely tied to liquidity. According to McGlone, Bitcoin&#8217;s current price level of around $27,000 may be at risk of reversion, considering that it was only $7,000 at the end of 2019 before the massive liquidity pump in 2020. McGlone&#8217;s analysis also indicates that Bitcoin&#8217;s downward trajectory, as demonstrated by its 52-week moving average, contrasts with the upward trend it experienced at the onset of the pandemic. This suggests that the cryptocurrency is susceptible to booms when liquidity is abundant but vulnerable to busts when liquidity is removed. McGlone&#8217;s latest analysis aligns with his previous thesis that the outlook for Bitcoin and the broader cryptocurrency market is bearish, given the potential for a US recession, a potential stock bear market, vigilant central banks, and high interest-rate competition.  Is BTC About To Take Off? On the other hand, Crypto Con, a well-known crypto analyst, has recently expressed his continued bullishness on Bitcoin, citing the Pi Cycle Top indicator as evidence of the cryptocurrency&#8217;s potential for a continued uptrend. According to Crypto Con, the Yellow 111days Moving Average (MA) has started to uptick, indicating that Bitcoin is experiencing a positive trend. Additionally, Bitcoin has been retesting the 111DMA line as support, rather than continuing on a parabolic trajectory, which is typically a sign of a market top. &#160; Crypto Con acknowledges that sometimes the bounce can take some time, but he maintains that this is nothing but bullish for Bitcoin. This is because the Pi Cycle Top indicator is a reliable tool that has historically predicted major market tops and bottoms in the cryptocurrency market. Related Reading: Ripple CTO Schwartz Reveals Insights Into AMM Trading Strategy The Pi Cycle Top indicator measures the relationship between the 111DMA and the 350DMA, and when the two lines cross, it can suggest a potential market top or bottom. The fact that the Yellow 111DMA is showing an uptick suggests that Bitcoin may be headed for a market bottom, which is a bullish sign for investors. At the time of writing, the largest cryptocurrency by market capitalization, Bitcoin, is trading at $27,000. Over the past 24 hours, BTC’s price has remained relatively stable, exhibiting sideways price action with a minor increase of 0.1%. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T18:34:42.000Z",
    "title": "Breaking Collaboration: VeChain and CIRCUNOW Join Forces to Create a Carbon Disclosure Platform for Sustainable Circularity, Paving the Path for Green Actions",
    "url": "https://www.crypto-news-flash.com/breaking-collaboration-vechain-and-circunow-join-forces-to-create-a-carbon-disclosure-platform-for-sustainable-circularity/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-collaboration-vechain-and-circunow-join-forces-to-create-a-carbon-disclosure-platform-for-sustainable-circularity",
    "description": "<p>Shanghai Tanlian is looking at developing a new functional Carbon reduction platform. The platform will be floated in collaboration with CIRCUNOW and ESTS. Shanghai Tanlian Technology Co., Ltd., the company behind VeCarbon, the VeChainThor public blockchain has inked a collaboration with CIRCUNOW and together they have reached an agreement to develop a carbon reduction disclosure [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-collaboration-vechain-and-circunow-join-forces-to-create-a-carbon-disclosure-platform-for-sustainable-circularity/\">Breaking Collaboration: VeChain and CIRCUNOW Join Forces to Create a Carbon Disclosure Platform for Sustainable Circularity, Paving the Path for Green Actions</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]