[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-02T06:30:25.000Z",
    "title": "China-Africa Economic and Trade Expo Aims to Defy Western ‘Debt Trap’ Accusations, Generating $19 Billion in Trade Deals",
    "url": "https://news.bitcoin.com/china-africa-economic-and-trade-expo-aims-to-defy-western-debt-trap-accusations-generating-19-billion-in-trade-deals/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"China-Africa Economic and Trade Expo Aims to Defy Western &#039;Debt Trap&#039; Accusations, Generating $19 Billion in Trade Deals\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chinaf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a report from the third annual China-Africa Economic and Trade Expo, Africa and China are continuing to strengthen their long-term trade ties. China wants to be one of Africa&#8217;s largest trading partners, and reports revealed on Friday that this year&#8217;s expo is expected to generate $19 billion in deals. Annual Trade Event Between [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-02T06:31:56.000Z",
    "title": "Crypto Exchange Bittrex Challenges SEC Lawsuit, Seeks Regulatory Clarity",
    "url": "https://www.cryptopolitan.com/exchange-bittrex-challenges-sec-lawsuit/",
    "description": "Crypto exchange Bittrex has taken a significant step in its legal battle against the U.S. Securities and Exchange Commission (SEC) by filing a motion to dismiss the lawsuit brought against it. In the court filing, Bittrex challenges the SEC&#8217;s authority to regulate crypto assets as securities without specific authorization from Congress. The exchange aims to ... <a title=\"Crypto Exchange Bittrex Challenges SEC Lawsuit, Seeks Regulatory Clarity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exchange-bittrex-challenges-sec-lawsuit/\" aria-label=\"More on Crypto Exchange Bittrex Challenges SEC Lawsuit, Seeks Regulatory Clarity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-02T06:13:00.000Z",
    "title": "Ethereum Co-Founder Thinks The Over $40 Billion Staked ETH Can Be Stolen",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-co-founder-staked-eth-prices-below-2000/",
    "description": "It appears that the co-founder of Ethereum, Vitalik Buterin, doesn’t trust the security of infrastructure allowing ETH staking. Consequently, in a recent interview, Buterin stated that he would only stake a limited amount of coins to ensure the network is distributed and remain robust against malicious agents who might try to take over the platform, reversing transactions. Vitalik Buterin Has Doubts On Ethereum Staking Buterin has raised concerns about the potential risks of ETH staking through third-party infrastructure, specifically regarding the exposure of private keys and the danger it poses to his entire stake. He believes that implementing a multi-signature system could provide better protection. However, the current process is more difficult to set up, leading to his increased caution. Related Reading: Bitcoin Cash (BCH) Up 55% Following BlackRock’s ETF Application, EDX Markets Launch In a multi-sig system, users have their private key to sign transactions. A specific number of signatures must be provided to approve a transaction, which varies based on the Ethereum wallet&#8217;s configuration. This setup boosts security and reduces the risk of unauthorized access to funds. During the Bankless Podcast, the co-founder explains: Probably the biggest reason why I personally am not just staking all of my ETH, that I’m instead staking a fairly small portion, is because if you stake your ETH, it has to be all out, like the keys that access it have to be public on some system that’s online, and for safety, it has to be a multi-sig, and multi-sigs for staking are still fairly difficult to set up, and it gets complicated in a bunch of ways. ETH Prices Stable Below $2,000 His remarks have generated a lot of discussion. Most critics are concerned about the entire security framework of Ethereum. After shifting from a proof-of-work to a proof-of-stake system, Ethereum relies on a network of validators who have to stake at least 32 ETH for a chance to approve a block of transactions and earn block rewards and transaction fees. These validators are also needed to secure the network; without them, the blockchain will be susceptible to attacks. Related Reading: Binance CEO Goes Bullish On Bitcoin – What’s The Inside Scoop? According to on-chain data, there are over 643,000 validators spread across the globe who have staked over 20.5 million ETH. On average, each validator has staked 32.17 ETH. Notably, the validator count has steadily risen over the years, and the number of ETH staked has sharply increased despite the recent upgrade permitting stakers to unlock their coins. Charles Hoskinson, the founder of Cardano and one of the original co-founders of Ethereum, said he was “lost for words,” clarifying that all their ADA is staked as expected in a “properly designed proof-of-stake system.” At the time of writing, ETH prices remain firm and weren’t affected by Buterin’s comments. However, the coin is yet to breach $2,000 and trends below April 2023 highs in early July 2023. Featured image from Canva, chart from TradingView"
  }
]