[
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T02:29:21.000Z",
    "title": "Sui Foundation denies it sold locked staking rewards on Binance",
    "url": "https://cointelegraph.com/news/sui-foundation-denies-dumping-staked-tokens-binance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/00b3791f-a462-462c-b9f3-fcdfad43c9ce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sui was accused of dumping locked and non-circulating staked SUI tokens on Binance.</p>\n                    <p><p>Sui Foundation — the team behind the Sui network and its native SUI token — has denied allegations that the firm unlocked SUI staking rewards and “dumped” them on <a href=\"https://cointelegraph.com/news/binance-relists-privacy-coins-in-europe\">cryptocurrency exchange <a href=\"https://cointelegraph.com/news/binance-relists-privacy-coins-in-europe\">Binance</a> .</a></p><p>The Foundation knocked back the <a href=\"https://twitter.com/SuiFoundation/status/1673722229421670401\" target=\"_blank\" rel=\"noopener nofollow\">claim</a> in a five-part Twitter thread on June 27, stating that none of the locked or non-circulating tokens, including SUI staking rewards had been sold:</p><blockquote>\"Sui Foundation has not sold staking rewards or any other tokens from locked and non-circulating staked SUI on Binance or otherwise.\" </blockquote><p>\"All insider token allocations remain subject to and compliant with their lock ups and other restrictions on transfer,” the foundation added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The purpose of this communication is to share information regarding the tokenomics of the Sui Network including the SUI token supply and certain distributions of SUI tokens. Here’s what you need to know:</p>&mdash; Sui Foundation (@SuiFoundation) <a href=\"https://twitter.com/SuiFoundation/status/1673722226909274114?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Sui is a decentralized proof-of-stake blockchain. Users can stake their Sui tokens to participate in its proof-of-stake mechanism in exchange for more SUI. No minimum staking period is required.</p><p>Sui’s recent denial was in response to claims by pseudonymous crypto commentator <a href=\"https://twitter.com/DefiSquared\" target=\"_blank\" rel=\"noopener nofollow\">@DeFiSquared</a> in a June 27 Twitter <a href=\"https://twitter.com/DefiSquared/status/1673572324145078273\" target=\"_blank\" rel=\"noopener nofollow\">thread</a>, where they accused the Sui Foundation of “dumping rewards from *locked* and *non-circulating* staked SUI” on Binance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Exclusive new research on SUI:<br><br>Intentionally misrepresented emissions and proof the team themselves are dumping rewards from *locked* and *non-circulating* staked SUI onto Binance. (1/12) <a href=\"https://t.co/jYRyeTFY56\">pic.twitter.com/jYRyeTFY56</a></p>&mdash; DeFi^2 (@DefiSquared) <a href=\"https://twitter.com/DefiSquared/status/1673572324145078273?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While Sui said the specific transactions were subject to a “contractual lockup,” DeFi Squared said the SUI tokens could be unlocked “without restriction.”</p><p>The DeFi-focused pundit claimed that Sui Foundation’s wallet address, “0x341f” transferred 3.125 million of the total 27 million SUI <a href=\"https://cointelegraph.com/learn/defi-staking-proof-of-stake-pos-coins\">in staking rewards</a> to three separate addresses, which were then transferred to Binance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The specific transaction referenced was a payment subject to a contractual lockup.<a href=\"https://t.co/ViYxQoJMos\">https://t.co/ViYxQoJMos</a></p>&mdash; Sui Foundation (@SuiFoundation) <a href=\"https://twitter.com/SuiFoundation/status/1673722230596055047?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>DeFi Squared claimed this process occurred many times before “most of it” ended up on Binance:</p><p>“While the amounts are split many times, most of it ends up at Binance eventually. This could either be to obfuscate the selling, or perhaps because it is being split between different team members. But regardless, most of it is reaching Binance in the end.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/over-204m-was-lost-in-q2-defi-hacks-and-scams-de-fi-rekt-report\"><strong><em>Over $204M was lost in Q2 DeFi hacks and scams: Report </em></strong></a></p><p>The commentator <a href=\"https://twitter.com/DefiSquared/status/1673572326141558786\" target=\"_blank\" rel=\"noopener nofollow\">said</a> their “curiosity was piqued” in May by SUI’s “seemingly endless sell pressure,” whilst failing to publish an emissions chart separate from Binance’s launchpad, which supposedly wasn’t legitimate. Notably, they claimed the foundation is inflating the supply of the SUI token roughly <a href=\"https://cointelegraph.com/news/inflation-is-killing-us-cryptocurrency-cannot-beat-it\">20% month-on-month</a> for non-foundation token holders:</p><blockquote>“This is higher than the inflation rate of the hyperinflating Venezuelan Bolivar in 2022.”</blockquote><p>Sui's blockchain is designed to offer users high transaction throughput at low fees, <a href=\"https://mystenlabs.com/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Mysten Labs, the creators of the Sui Foundation.</p><p>The SUI token currently has a market cap of $427.7 million from a circulating supply of about 604 million tokens, <a href=\"https://coinmarketcap.com/currencies/sui/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinMarketCap. SUI is trading for $0.70 at the time of publication, down 2.4% in the past 24 hours.</p><p>The Sui Foundation <a href=\"https://twitter.com/SuiFoundation/status/1673722232479322113\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it will publish a “detailed projection” of the token release schedule soon.</p><p>The next unlock of 61 million tokens ($43 million) is scheduled for June 3, <a href=\"https://token.unlocks.app/sui\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to tokenomics dashboard Token Unlocks. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/district-9-directors-shooter-decentraland-red-light-district-battle-web3-gamer/\"><strong><em>Web3 Gamer</em></strong></a><strong><em>:</em></strong><a href=\"https://cointelegraph.com/magazine/district-9-directors-shooter-decentraland-red-light-district-battle-web3-gamer/\"><strong><em> District 9 director’s shooter, Decentraland red-light district battle</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T02:21:30.000Z",
    "title": "FTX sues Dan Friedberg alleging he used ‘hush money’ to silence whistleblowers",
    "url": "https://cointelegraph.com/news/ftx-sues-dan-friedberg-for-paying-off-whistleblowers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7c0afc62-3a65-4a7e-90ef-dc8f78669213.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The lawsuit claims Daniel Friedberg made a series of payments to whistleblowers to stop them from exposing the \"true fraudulent nature\" of the exchange.</p>\n                    <p><p>FTX has filed a lawsuit against a former regulatory and compliance executive at the exchange, alleging he made a series of payments in attempts to prevent staff from blowing the whistle about issues at the exchange. </p><p>On June 27, FTX <a href=\"https://restructuring.ra.kroll.com/FTX/ExternalCall-DownloadPDF?id1=MTU0MDA0Mw==&amp;id2=0&amp;cid=0\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a lawsuit against Daniel Friedberg who held multiple roles including chief regulatory officer at FTX, chief compliance officer of FTX US and general counsel at Alameda Research.</p><p>In the complaint, FTX claims Friedberg was a \"fixer\" for the exchange's co-founder Sam Bankman-Fried who made \"hush money\" payments to two potential whistleblowers to stop them from leaking information about \"regulatory issues\" and the alleged close ties between FTX and Alameda Research.</p><p>In the 40-page filing, FTX unleashed 11 civil charges that, among other claims, alleged Friedberg breached his legal duties and approved a series of fraudulent transfers and \"loans\" to other former FTX execs.</p><p>During his 22-month stint at the exchange, Friedberg was also purportedly given a $300,000 salary, a signing bonus of $1.4 million, and 8% equity in FTX US — all of which FTX is seeking to claw back, according to the complaint.</p><p>Some parts of the complaint, especially those pertaining to the amounts the whistleblowers were paid, are redacted. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T02:32:40.000Z",
    "title": "Bitcoin Price Consolidates Below $31K As The Bulls Take Back Seat",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-below-31k/",
    "description": "Bitcoin price is still struggling to clear the $31,000 resistance. BTC is trading in a range and might revisit the $30,000 support zone. Bitcoin is consolidating above the $30,000 support zone. The price is trading just below $30,500 and the 100 hourly Simple moving average. There was a break above a major bearish trend line with resistance near $30,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct lower toward the $30,000 support or even $29,550. Bitcoin Price Faces Resistance Bitcoin price remained supported near the $30,000 zone. BTC traded as low as $29,914 and recently started a fresh increase. There was a move above the $30,200 and $30,250 levels. The price cleared the 50% Fib retracement level of the downward move from the $31,436 swing high to the $29,914 low. Besides, there was a break above a major bearish trend line with resistance near $30,300 on the hourly chart of the BTC/USD pair. However, the bears seem to be active near the $31,000 resistance zone. Bitcoin struggled to clear the 76.4% Fib retracement level of the downward move from the $31,436 swing high to the $29,914 low. The price is now trading just below $30,500 and the 100 hourly Simple moving average. Immediate resistance is near the $30,680 level. The first major resistance is near the $30,950 level, above which the price might revisit the $31,400 resistance zone. Source: BTCUSD on TradingView.com The next major resistance is near the $32,000 level. An upside break above the $32,000 resistance might send BTC toward $32,500. Any more gains could open the doors for a move toward the $33,200 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $30,950 resistance, it could continue to move down. Immediate support on the downside is near the $30,250 level or the broken trend line zone. The next major support is near the $30,000 level, below which there could be a drop toward the $29,550 support. Any more losses might send the price toward the $28,750 support region in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $30,000, followed by $29,550. Major Resistance Levels – $30,680, $30,950, and $31,400."
  }
]