[
  {
    "source": "CoinDesk",
    "date": "2024-04-09T04:55:09.000Z",
    "title": "Ether Rallies to $3.6K as Bitcoin Holds Steady at $71K",
    "url": "https://www.coindesk.com/markets/2024/04/09/ether-rallies-to-36k-as-bitcoin-holds-steady-at-71k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Liquid staking tokens like Lido, Rocket Pool, and ether.fi follow ether's gains."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-09T04:54:50.000Z",
    "title": " Nifty News: LA’s Bored Ape lovers go hungry, Bitcoiners sell $500 Game Boy dupe and more  ",
    "url": "https://cointelegraph.com/news/bored-ape-burger-shop-shuts-bitcoin-nft-gaming-console-nifty-news",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvMzg3NGE5YzEtMjYzNC00MzliLTlmNzMtY2U5OGNjMWEwM2NjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>California’s Bored Ape burger place in Long Beach is shutting down though it hasn’t ruled out a U.S. reopening and a Bitcoin-based gaming console is reportedly set to sell for a cool $500. </p>\n                    <p><p>A Los Angeles burger restaurant which used a Bored Ape Yacht Club (BAYC) nonfungible token (NFT) as its brand is serving up its last patties and fries after two years in business and is being sold to a decentralized autonomous organization (DAO).</p><p>“Today we say goodbye to the original Bored &amp; Hungry location in Long Beach, CA,” co-founder Andy Nguyen said in an April 8 X <a href=\"https://twitter.com/AndyTheNguyen/status/1777348448318267618\" target=\"_blank\" rel=\"noopener nofollow\">post</a>.</p><p>Nguyen added the “branding and franchising company” Hungry DAO acquired the Bored &amp; Hungry brand, which also has three locations in the Philippines, one in Seoul, South Korea and slated Hong Kong, Singapore and Dubai pop-ups during events later in the year.</p><p><a href=\"https://cointelegraph.com/news/bored-ape-burger-shop-shuts-bitcoin-nft-gaming-console-nifty-news\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-09T05:04:02.000Z",
    "title": "Ethereum Price Faces Big Move – Can Bulls Send ETH To $4K?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-move-to-4k/",
    "description": "Ethereum price is gaining pace above the $3,600 resistance zone. ETH could extend its upward move if it clears the $3,725 resistance zone. Ethereum is aiming for more gains above the $3,725 and $3,740 levels. The price is trading above $3,650 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $3,480 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its rally if there is a close above the $3,725 resistance zone. Ethereum Price Jumps Over 8% Ethereum price formed a base and started a decent increase above the $3,500 resistance, like Bitcoin. ETH surpassed the $3,600 and $3,650 levels to move into a positive zone. A new weekly high was formed at $3,726 and the price is now consolidating gains. The price is well above the 23.6% Fib retracement level of the upward move from the $3,224 swing low to the $3,726 low. It is up over 8% and there are chances of more upsides. Ethereum is trading above $3,650 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support at $3,480 on the hourly chart of ETH/USD. It is close to the 50% Fib retracement level of the upward move from the $3,224 swing low to the $3,726 low. Immediate resistance is near the $3,725 level. The first major resistance is near the $3,750 level. The next key resistance sits at $3,800, above which the price might test the $3,880 level, above which Ether could gain bullish momentum. Source: ETHUSD on TradingView.com In the stated case, the price could rise toward the $3,880 zone. If there is a move above the $3,920 resistance, Ethereum could even rise toward the $4,000 resistance. Are Dips Limited In ETH? If Ethereum fails to clear the $3,725 resistance, it could start a downside correction. Initial support on the downside is near the $3,620 level. The first major support is near the $3,500 zone or the trend line. The next key support could be the $3,420 zone. A clear move below the $3,420 support might send the price toward $3,350. Any more losses might send the price toward the $3,220 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,500 Major Resistance Level – $3,725"
  }
]