[
  {
    "source": "Decrypt",
    "date": "2023-06-06T21:49:56.000Z",
    "title": "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "url": "https://decrypt.co/143621/sec-seeks-emergency-order-to-freeze-binance-us-assets",
    "description": "If granted, the motion requests the repatriation of assets and the preservation of records."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T21:41:38.000Z",
    "title": "Meeting Giant Zoom Launches AI Meeting Summaries and Chat",
    "url": "https://decrypt.co/143620/meeting-giant-zoom-launches-ai-meeting-summaries-and-chat",
    "description": "Despite a crowded marketplace, Zoom has huge market share and is emphasizing real-time results."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T22:05:15.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 Something good is happening at the Alchemy Pay network: Alchemy Pay, a San Fransico-based firm, was founded five years ago and provides blockchain development tools to numerous initiatives. The firm has powered many popular&#160;DeFi&#160;projects, such as Maker and Bancor, and has been used to support the development of Dapper Labs, ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T21:43:19.000Z",
    "title": "SWIFT and Chainlink collaborate for banking blockchain integration",
    "url": "https://crypto.news/swift-and-chainlink-collaborate-for-banking-blockchain-integration/",
    "description": "SWIFT, the global financial messaging service, is partnering with major banks and Chainlink, a web3 infrastructure provider, to test the integration of public and private blockchains for global banking. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T22:00:04.000Z",
    "title": "Atomic Wallet Hack: Stolen Crypto Moved Through Mixing Service Linked To North Korean Hackers",
    "url": "https://www.newsbtc.com/crypto/atomic-wallet-hack-stolen-crypto-moved-through-mixing-service-linked-to-north-korean-hackers/",
    "description": "According to blockchain analysis firm Elliptic, stolen assets from the latest Atomic Wallet hack have been moved through a mixing service. While mixers and blenders aim to provide privacy for legitimate crypto users, they are also commonly abused by hackers and scammers to hide stolen funds.  Elliptic Reveals Laundering Connected To Atomic Wallet Hack Last week, hackers breached the non-custodial decentralized wallet, Atomic Wallet, and made off with over $35 million in various crypto assets from unsuspecting users.  Related Reading: Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours The hackers didn&#8217;t stop there, though. In an attempt to hide their tracks, they moved the stolen funds through a crypto-mixing service to obscure the source of the money. In a tweet recently made by Elliptic, the company&#8217;s investigations team revealed that it had tracked funds stolen in the attack to Sinbad.io, a mixer that has been linked to the nefarious Lazarus Group of North Korea.  According to the investigation, the stolen assets were swapped to Bitcoin and moved through the mixer. Unfortunately, the exact amount that was delivered to the mixer is still unknown, and Elliptic did not specify in the tweet.  Total market cap recovers above $1.08 trillion &#124; Source: Crypto Total Market Cap on TradingView.com The Aftermath Of The Hack Last week, Atomic Wallet became the latest crypto company to fall victim to a hack and have its security breached. During the weekend, users began flooding Twitter with complaints that digital assets such as Tether&#8217;s USDT, Ripple (XRP), Cardano (ADA), and Dogecoin (DOGE) had mysteriously vanished from their wallets. Some customers have even reported that they have completely lost all of their cryptocurrency holdings. Atomic Wallet also confirmed reports of the compromised wallets on its platform. While the details of how the hack happened weren&#8217;t released, it is highly likely to be a direct phishing attack.  The company added that less than 1% of its monthly users were impacted by the hack. However, some users have claimed otherwise as the non-custodial decentralized wallet boasts of 5 million users.  Related Reading: Bitcoin Slips Below $26,000, Triggers Over $300 Million In Liquidations The investigations into the Atomic Wallet hack are ongoing as authorities work to track down the stolen funds. Unfortunately, cryptocurrencies stolen in hacks are difficult to trace once they&#8217;ve been moved around.  There is always a possibility that some or even all of the funds may never be retrieved due to the anonymous nature of cryptocurrency.  The hack serves as an important reminder that security remains the most important element of investing in crypto, as user funds are a prime target for cybercriminals looking to make a quick buck. Featured image from Discover Magazine, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T22:01:50.000Z",
    "title": "Congressmen From California and Massachusetts Ask IRS To Get Control of Crypto Tax Evaders",
    "url": "https://dailyhodl.com/2023/06/06/congressmen-from-california-and-massachusetts-ask-irs-to-get-control-of-crypto-tax-evaders/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/08/crypto-tax-evasion.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Two US congressmen are calling on the Internal Revenue Service (IRS) to speed up efforts to ensure cryptocurrency users are complying with tax rules. In a new letter, Rep. Brad Sherman of California and Rep. Stephen Lynch of Massachusetts blame the crypto industry for a major source of tax evasion. The letter, sent to Treasury [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/congressmen-from-california-and-massachusetts-ask-irs-to-get-control-of-crypto-tax-evaders/\">Congressmen From California and Massachusetts Ask IRS To Get Control of Crypto Tax Evaders</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]