[
  {
    "source": "Decrypt",
    "date": "2023-05-26T21:44:42.000Z",
    "title": "Not Just Nvidia: These Are the Other Big Winners in the AI Chip Biz",
    "url": "https://decrypt.co/142568/nvidia-big-winners-ai-chip-biz-tech-stocks",
    "description": "COVID-19 was hell for tech stock and chip manufacturers. But AI has now flipped the script. Here are the companies benefiting the most so far."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T21:55:00.000Z",
    "title": "Cronos Labs launches second cohort of $100M Web3 accelerator",
    "url": "https://cointelegraph.com/news/cronos-labs-launches-second-cohort-of-100m-web3-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/586a2717-af04-481b-b781-f733affbcc0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On May 15, the chosen projects commenced the 12-week program after being granted seed funding of $30,000. </p>\n                    <p><p>Blockchain startup accelerator Cronos Labs has announced the launch of its second cohort for the Cronos Accelerator Program. The program, backed by a substantial $100 million investment, aims to support early-stage crypto projects by providing mentorship and funding opportunities. </p><p>According to an announcement sent to Cointelegraph, <a href=\"https://cointelegraph.com/news/cronos-labs-to-accept-second-cohort-for-100m-backed-web3-accelerator-program\">Cronos Labs</a> handpicked eight projects to participate in their accelerator program. Each of the selected projects, namely Omnus, DeMe, Furrend, Solace, Sakaba, Eisen Finance, Earn Network, and CorgiAi, received upfront seed funding of $30,000 to commence their 12-week program.</p><p>The chosen projects cover a diverse range of areas, including Web3 game development, decentralized social networking, pet-focused video sharing, smart-contract wallet integration, loyalty platforms for Web3 gaming, exchange aggregation for institutional trading, liquid marketplaces for yield-earning opportunities, and an ecosystem for the peer-to-peer economy of generative AI.</p><p>One of the key themes of this second cohort is the intersection of artificial intelligence (AI) and blockchain technology. Cronos Labs has partnered with Amazon Web Services (AWS) to offer AI-related workshops and mentorship sessions to the participating projects. Additionally, the chosen projects will have access to AWS' resources, including machine learning and AI services. CertiK, Hacken, and Covalent are among the noteworthy additions as partners for this cohort.</p><p>At the conclusion of the 12-week program, the participating projects will be given the platform to present their concepts to investment partners at a Demo Day scheduled for late July 2023. This event will give participants the opportunity to secure additional seed funding and garner backing from investors including NGC, Fundamental Labs, Spartan Group, and Delphi Digital.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/solana-integrates-ai-into-blockchain-raises-grants-fund-to-10m\"><strong><em>Solana integrates AI into blockchain, raises grants fund to $10M</em></strong></a></p><p>Cronos, the blockchain platform by Crypto.com, introduced its<a href=\"https://cointelegraph.com/news/crypto-com-s-cronos-launches-100m-accelerator-for-defi-and-web3\"> $100 million accelerator program </a>in June to support early-stage DeFi and Web3 projects. The program was supported by notable companies including Mechanism Capital, Spartan Labs, IOSG Ventures, OK Blockchain Capital, AP Capital, Altcoin Buzz, and Dorahacks.</p><p>Despite a long crypto winter, there has been a rise in blockchain accelerator programs focusing on Web3 development. On May 22, <a href=\"https://cointelegraph.com/news/ton-foundation-launches-25m-accelerator-program\">The Open Network (TON), a layer-1 blockchain</a> developed by Telegram, unveiled the \"TON Accelerator Program,\" a fund worth $25 million to support projects within its ecosystem. The program will provide investments ranging from $50,000 to $250,000 per project, along with valuable partnerships and mentorship from TON's team.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">Here’s how Ethereum’s ZK-rollups can become interoperable</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T21:50:00.000Z",
    "title": "The Sandbox CEO’s Twitter was hacked, used to promote alleged ‘airdrop’ scam",
    "url": "https://cointelegraph.com/news/the-sandbox-ceo-s-twitter-was-hacked-used-to-promote-alleged-airdrop-scam",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/85311982-9ef3-42c1-aa62-15f761ab6294.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The executive appears to have now recovered his account.</p>\n                    <p><p>Arthur Madrid, co-founder and CEO of metaverse project The Sandbox, was the victim of a Twitter account hack on May 26, according to a post from Madrid that was apparently made after he recovered the account. The attacker allegedly used Madrid’s account to promote a fake “airdrop” phishing scam.</p><p>In Madrid’s post, he warned Sandbox users that they should “never click on any link that promote Airdrop or URL and look SCAMMY - and not 100% using our proper and unique URL/domain name : http://sandbox.game.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">My Twitter was hacked today. and now is back. Please never click on any link that promote Airdrop or URL and look SCAMMY - and not 100% using our proper and unique URL/domain name :  <a href=\"https://t.co/X3rXN9z8z7\">https://t.co/X3rXN9z8z7</a></p>&mdash; Arthur Madrid (@arthurmadrid) <a href=\"https://twitter.com/arthurmadrid/status/1662161066166562818?ref_src=twsrc%5Etfw\">May 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Four hours before Madrid’s post, The Sandbox’s official Twitter account also warned that a scammer had taken control of the account and was promoting “a scam / phishing link for a fake airdrop of SAND tokens.”</p><p>The post included a screenshot of the alleged scam post, which advertised a SAND token airdrop and encouraged users to “check eligibility and claim on the site,” referring users to a website with a different URL than the official one.</p><p>The Sandbox team stated that they were “working on getting the site down and fix it ASAP.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">⚠️ Our CEO &amp; Co-Founder Arthur Madrid&#39;s Twitter account has been hacked ⚠️<br><br>The hacker is posting a scam / phishing link for a fake airdrop of SAND tokens.<br><br>⛔️Do NOT click on the link and instead report the post so it is blocked. <br><br>We&#39;re working on getting the site down and fix… <a href=\"https://t.co/sOqzAV5OUT\">pic.twitter.com/sOqzAV5OUT</a></p>&mdash; The Sandbox (@TheSandboxGame) <a href=\"https://twitter.com/TheSandboxGame/status/1662106263294185472?ref_src=twsrc%5Etfw\">May 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As of 8:26 pm UTC, the alleged scam site appears to have been taken down, as it now produces a 404 error.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/six-tools-used-by-hackers-to-steal-cryptocurrency-how-to-protect-wallets\"><strong>Six Tools Used by Hackers to Steal Cryptocurrency: How to Protect Wallets</strong></a></em></p><p>Phishing attacks have become a frequent problem in the crypto community. On May 19, a scam-as-a-service called “Inferno Drainer” was reportedly <a href=\"https://cointelegraph.com/news/inferno-drainer-scam-as-a-service-has-stolen-5-9m-since-march-report\">discovered to be operating on Telegram</a>, recruiting website builders to create hundreds of these phishing scam sites. By the time it was discovered, it had reportedly stolen nearly $6 million from users.</p><p>On April 15, cybersecurity firm Kaspersky reported that these types of attacks <a href=\"https://cointelegraph.com/news/crypto-phishing-attacks-up-by-40-in-one-year-kaspersky\">increased by 40%</a> in 2022 compared to the previous year.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T22:04:01.000Z",
    "title": "Ethereum gets private on-chain voting tool through a16z’s ‘Cicada’",
    "url": "https://cryptoslate.com/ethereum-gets-private-on-chain-voting-tool-through-a16zs-cicada/",
    "description": "<p>Andreessen Horowitz (a16z) announced a new private, on-chain voting tool for Ethereum developers called &#8220;Cicada.&#8221; In a blog post, a16z developer Michael Zhu acknowledged existing on-chain voting features but noted that many of those systems are fully public and transparent. Running tally privacy By offering private voting, Cicada addresses issues found in public voting, such [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ethereum-gets-private-on-chain-voting-tool-through-a16zs-cicada/\">Ethereum gets private on-chain voting tool through a16z’s &#8216;Cicada&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-26T22:00:57.000Z",
    "title": "Moody’s on De-Dollarization: Rating Agency Labels US Debt Default a ‘Near-Term Danger to the Dollar’s Position’",
    "url": "https://news.bitcoin.com/moodys-on-de-dollarization-rating-agency-labels-us-debt-default-a-near-term-danger-to-the-dollars-position/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Moody&#039;s on De-Dollarization: Rating Agency Labels US Debt Default a &#039;Near-Term Danger to the Dollar&#039;s Position&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/moods.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As calls for the creation of a global alternative to the greenback grow, credit rating agency Moody&#8217;s said on May 25 that rival currencies such as the euro and the Chinese yuan do not yet threaten the U.S. dollar&#8217;s position as the world&#8217;s reserve currency. The agency said a confidence-sapping policy mistake such as the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T21:52:38.000Z",
    "title": "Bitcoin options contracts worth $2.26B near expiry: Potential upsurge expected",
    "url": "https://www.cryptopolitan.com/bitcoin-options-worth-2-26b-near-expiry/",
    "description": "$2.26 billion worth of contracts for bitcoin options are set to expire. Derivatives traders eagerly await the conclusion of the 86,000 bitcoin options contracts that are set to expire on May 26 as the positive attitude in the market intensifies and the bears retreat.&#160; Derivatives traders remain bullish as Bitcoin options worth $2.26B approach expiry ... <a title=\"Bitcoin options contracts worth $2.26B near expiry: Potential upsurge expected\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-options-worth-2-26b-near-expiry/\" aria-label=\"More on Bitcoin options contracts worth $2.26B near expiry: Potential upsurge expected\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T22:00:08.000Z",
    "title": "Upcoming Interest Rate Hikes Could Be The Next Big Challenge For Bitcoin, Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/upcoming-interest-rate-hikes-could-be-the-next-big-challenge-for-bitcoin-heres-why/",
    "description": "Bitcoin&#8217;s (BTC) current sideways price action has left investors wondering what the future holds for the world&#8217;s largest cryptocurrency. The upcoming interest rate hikes by the Federal Reserve (Fed) may pose the next big challenge for Bitcoin, according to the crypto market analysis firm Blofin Academy. Related Reading: Arbitrum (ARB) Fallout: 70% Price Drop, But These Charts Reveal Its True Value Is Bitcoin Ready For The Heat Of Interest Rate Hikes? The US economy has shown considerable resilience in recent months, prompting the Fed to consider raising interest rates to prevent inflation. However, this could be bad news for the crypto market, as higher interest rates tend to make traditional investments more attractive, potentially leading to a decrease in demand for Bitcoin and other cryptocurrencies. The correlation between interest rates and Bitcoin&#8217;s price action has been observed in the past. When interest rates rise, investors tend to move their money into traditional investment vehicles such as stocks and bonds, leading to a decrease in demand for cryptocurrencies. However, it&#8217;s worth noting that Bitcoin has often been viewed as a hedge against inflation, which means that it could still hold some appeal for investors during times of economic uncertainty.  The next scheduled Fed meeting is set to take place on June 14, 2023, where the central bank will likely discuss the possibility of raising interest rates in response to the current state of the US economy.  Macro Determinants Leave Crypto Traders Waiting Noelle Acheson, owner of the &#8220;Crypto Is Macro Now&#8221; newsletter, has cautioned against investors piling into the crypto market at this time. While the upside potential for Bitcoin remains significant, Acheson suggests that there is currently no compelling reason for investors to take on additional risk. According to Acheson, there are few macro determinants at the moment, such as debt limit negotiations and Fed rate policy, which are leaving investors waiting for more clarity before making any major investment decisions. As a result, there is a sense of caution in the market as traders wait to see how these macro factors will play out. Despite the lack of clarity, Acheson notes that there is not much reason for existing crypto holders to sell their holdings. This suggests that the current wait-and-see period is not necessarily a sign of bearish sentiment in the market, but rather a period of caution as investors await more information. Acheson also notes that there may be some downside movement in the near term, but the belief in a potential rally is not strong enough to warrant the possibility of missing out on any potential gains. As a result, there has been some buying and selling in the market, but not enough to significantly increase volatility despite low volumes and liquidity. At the time of writing, Bitcoin is trading at $26,700, reflecting a 1.2% increase over the last 24 hours. However, the 50-day Moving Average (MA) has placed the largest cryptocurrency in a narrow range between $26,200 and $26,800. This means that Bitcoin may struggle to surpass its current trading range in the near term, as the 50-day MA is currently situated at the upper end of this range on the 1-hour chart, making it a challenging level to breach. While Bitcoin has experienced some upside movements in recent weeks, the current trading range suggests that further gains may be limited until there is a significant shift in market sentiment or the emergence of a bullish catalyst. Related Reading: Why This Signal Means Uniswap’s Bear Run Is Almost Over Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T22:01:21.000Z",
    "title": "Cardano Creator Charles Hoskinson Says CBDC Fears Are Justified, Warns They Could Be Seized by the Government",
    "url": "https://dailyhodl.com/2023/05/26/cardano-creator-charles-hoskinson-says-cbdc-fears-are-justified-warns-they-could-be-seized-by-the-government/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/cbdcs-could-make-traditional.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founder of smart contract platform Cardano (ADA) says that fears surrounding central bank digital currencies (CBDCs) are justified as governments could one day seize them. In a new video update, Charles Hoskinson warns that CBDCs are setting up the stage for the government to control people’s speech and thoughts by connecting them to their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/cardano-creator-charles-hoskinson-says-cbdc-fears-are-justified-warns-they-could-be-seized-by-the-government/\">Cardano Creator Charles Hoskinson Says CBDC Fears Are Justified, Warns They Could Be Seized by the Government</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]