[
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T01:47:45.000Z",
    "title": "Circle and SBI Holdings partner to boost USDC circulation in Japan",
    "url": "http://cointelegraph.com/news/circle-sbi-holdings-partner-mou-boost-usdc-circulation-japan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2fed57c4-6ec9-4d9e-a8e7-b8d83f364740.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The agreement was made in a memorandum of understanding, but SBI Holdings must first register as an electronic payment instruments service provider in the country.</p>\n                    <p><p>Circle, the stablecoin issuer behind USD Coin <a href=\"https://cointelegraph.com/usdc-price-index\">(USDC)</a>, is teaming up with Tokyo-based financial services firm SBI Holdings to boost the adoption of USDC and Web3 services in Japan.</p><p>Circle <a href=\"https://www.circle.com/en/pressroom/sbi-holdings-partners-with-circle-to-pioneer-digital-currency-innovation-in-japan-with-usdc-banking-and-web3-services\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it concluded a memorandum of understanding (MOU) with SBI Holdings on Nov. 27, which will underpin the strategic expansion of USDC into Japan.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Circle and SBI Holdings are joining forces to boost <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> circulation and transform the financial landscape in Japan with <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> and Web3 Services! This partnership signifies a major leap in digital asset innovation and a strategic expansion for <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> in Asia. <br><br>Read more about…</p>&mdash; Circle (@circle) <a href=\"https://twitter.com/circle/status/1728938466485133442?ref_src=twsrc%5Etfw\">November 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It comes as the Japanese government revised the Payment Services Act in June to establish regulations for stablecoins, which Circle believes will “stimulate the issuance and circulation of stablecoins in Japan and advance Japan’s transition towards a Web3 economy.”</p><p>To initiate the circulation of USDC into Japan, SBI Holdings is seeking registration as an electronic payment instruments service, which is subject to approval by Japanese authorities.</p><p><strong> </strong>SBI Holdings CEO and President Yoshitaka Kitao hopes it will be a step toward mass stablecoin adoption in the country.</p><blockquote>\"Japan is steadily preparing the groundwork for the full-scale introduction of stablecoins [and] we are very pleased to have signed a basic agreement for a comprehensive business alliance with Circle.\"</blockquote><p>Circle's CEO Jeremy Allaire said the partnership \"represents a shared vision for the future of digital currency\" in Japan and Asia and is a \"milestone\" for Circle as part of its expansion plan into the region. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/usdc-issuer-circle-grab-app-partner-web3-services\"><strong><em>Grab, Uber’s Southeast Asian rival, debuts Web3 services with Circle</em></strong></a></p><p>\"We are excited to collaborate with SBI towards setting new standards in the financial sector in Japan,\" said Allaire.</p><p>SBI Shinsei Bank, a SBI subsidiary, will provide banking services to Circle to enable USDC access and liquidity for Japan-based businesses and users, according to Circle.</p><p>While Circle is based in the United States, <a href=\"https://cointelegraph.com/news/circle-ceo-usdc-adoption-emerging-developing-markets\">70% of USDC adoption</a> is taking place overseas, Allaire noted in August, with the Asia leading the way.</p><p>\"Demand for safe, transparent digital dollars\" is also strong in Latin America and Africa, the Circle boss added.</p><p>USDC is currently the second largest stablecoin behind Tether <a href=\"https://cointelegraph.com/tether-price-index\">(USDT),</a> with a market cap of $24.6 billion, <a href=\"https://www.coingecko.com/en/coins/usdc\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/htx-hacked-again-100k-koreans-test-cbdcs-binance-asia-express/\"><strong><em>HTX hacked again for $30M, 100K Koreans test CBDC, Binance 2.0: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T02:02:53.000Z",
    "title": "Red Alarm flags hundreds of risky dapps on BNB Chain",
    "url": "https://crypto.news/red-alarm-flags-hundreds-of-risky-dapps-on-bnb-chain/",
    "description": "DappBay, a web3 dApp store for users on the BNB Chain, has flagged over 100 risky decentralized applications (dapps) in its recent update. "
  }
]