[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T16:45:00.000Z",
    "title": "Navigating the Next Wave of Crypto Institutionalization: A Due Diligence Primer",
    "url": "https://www.coindesk.com/markets/2023/11/15/navigating-the-next-wave-of-crypto-institutionalization-a-due-diligence-primer/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As FTX showed, operators in digital asset markets need to improve corporate governance standards. Here are the key components as the industry readies for another possible bull run."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-15T16:45:00.000Z",
    "title": "What an SEC Proposal Means for RIAs in Crypto",
    "url": "https://www.coindesk.com/policy/2023/11/15/what-an-sec-proposal-means-for-rias-in-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC’s Custody Rule requiring advisors to safeguard digital assets has big implications for advisors working in the crypto industry, says Nathan McCauley, CEO and Co-Founder of Anchorage Digital."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-15T17:01:02.000Z",
    "title": "Phantom Galaxies Game Guide",
    "url": "https://decrypt.co/205816/phantom-galaxies-game-guide",
    "description": "Head to the galactic frontier as the pilot of a transforming Starfighter in Blowfish Studios’ space-based battler. Here’s how to get started."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T16:57:57.000Z",
    "title": "Layer 2 networks hit $13 billion TVL but challenges still remain",
    "url": "http://cointelegraph.com/news/layer-2-networks-hit-13-billion-tvl-but-challenges-still-remain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/8dc1b2f0-756a-4fd4-9a91-3cc5c7755da9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Data from L2Beat shows that layer 2s are seeing greater adoption than ever before as users continue to desire lower gas fees.</p>\n                    <p><p>Ethereum Layer 2 networks <a href=\"https://l2beat.com/scaling/summary\" target=\"_blank\" rel=\"noopener nofollow\">reached</a> a new milestone on November 10, reaching $13 billion of total value locked (TVL) within their contracts, according to data from blockchain analytics platform L2Beat. According to industry experts, this trend of greater interest in layer 2s is likely to continue, although some challenges remain, especially in the realms of user experience and security.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/8e391d7d-de50-4550-926c-b6df608cc88e.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum layer 2 TVL. Source: L2Beat.</em></figcaption></figure><p>According to L2Beat, there are 32 different networks that qualify as <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">Ethereum layer 2s</a>, including Arbitrum One, Optimism, Base, Polygon zkEVM, Metis, and others. Prior to June 15, all of these networks combined had less than $10 billion of cryptocurrency locked within their contracts, and their combined TVL had been declining since April’s high of $11.8 billion.</p><p>But beginning on June 15, layer 2 TVL growth turned positive. And by October 31, these networks had reached a new high of nearly $12 billion combined TVL. From there, investment in layer 2 apps continued to climb, passing the $13 billion TVL mark on November 10 and continuing to nearly $13.5 billion at the time of publication.</p><p>This rise in TVL is even more dramatic when compared with the rate that existed during the bull market of 2021, when overall crypto investment was much larger than it is today. On November 12, 2021 when the market cap of all cryptocurrencies reached an all-time high of $2.82 trillion, layer 2s had less than $6 billion locked within their contracts. Today, the total market cap of cryptocurrencies is a more modest $1.4 trillion, <a href=\"https://coinmarketcap.com/charts/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Coinmarketcap, yet the TVL of layer 2s is greater than ever.</p><p>In a conversation with Cointelegraph, Metis CEO Elena Sinelnikova proposed a theory for why layer 2s are growing in spite of the continuing bear market. According to her, Ethereum’s high gas fees during the bull market left an indelible impact on users, leading to a desire for alternatives when demand started to come back, as she stated: </p><blockquote>“At the time of [the] bull market, Ethereum at peak times was very non-scaleable, which meant that transactions were slow and very expensive because of the bull market. It would be hundreds of dollars just in transaction fees for one transaction, so therefore it was not sustainable.”</blockquote><p>According to Sinelkova, another reason that layer 2 networks have thrived in the bear market is because of the successful marketing efforts of their development teams, which has led to high user activity and therefore, high yields. “They are deploying capital to attract new users and to attract new business into DeFI [decentralized finance],” she stated. “DeFi people from all ecosystems, they always go where there are big yields [...] and this is just naturally happening and is [...] the nature of business.”</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/aave-v3-launches-on-ethereum-layer-2-network-metis\"><strong>Aave v3 launches on Ethereum layer-2 network Metis</strong></a></em></p><p>However, Sinelkova warned that layer 2s still face challenges in the realm of user-experience. Optimistic rollup networks require users to wait 7 days for a withdrawal to be processed, which can lead to frustration. On the other hand, newer zero-knowledge (ZK) proof networks can process withdrawals instantly, but they are still in an early stage of development and tend to crash more often than older networks. The Metis CEO claimed that her team is working on a “hybrid” layer 2 network that will combine the best of both worlds, giving users the option to withdraw using either an instant ZK prover or a 7-day optimistic process.</p><p>Kelsey McGuire, chief growth officer for layer 1 network Shardeum, told Cointelegraph that layer 2s face another serious challenge that is often overlooked: centralization. “While Layer-2 solutions have gained popularity for their scalability enhancements over the last year, they often introduce a trade-off in decentralization” she stated. She continued:</p><blockquote>“At the execution layer, where transactions are processed, centralized sequencer nodes are employed, raising concerns about potential censorship or government interference. This centralized aspect in Layer-2 implementations challenges the core principles of decentralization and trustlessness that have underpinned the blockchain space.\"</blockquote><p>McGuire expects competition from layer 2s to spur improvements to layer 1s, ultimately leading to higher throughput for the foundational layers themselves, as she stated “there may be fewer and fewer new L1s, and we’ll start to see a refocus on true scalability (as in high TPS paired with low gas fees) at the foundational layer as opposed to relying solely on L2s to provide scalability.\"</p><p>In addition to their TVL increasing, the number of layer 2s also continues to rise. On November 14, crypto exchange OKX <a href=\"https://cointelegraph.com/news/okx-launches-ethereum-layer-2-testnet-using-zk-based-polygon-cdk\">announced that it is building a layer 2</a>, and there have been rumors that Kraken <a href=\"https://cointelegraph.com/news/kraken-layer-2-rumors-job-posting-reports\">is building one as well</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T16:40:32.000Z",
    "title": "Crypto’s 17-month dry spell ends with surging capital influx",
    "url": "https://www.cryptopolitan.com/cryptos-17m-dry-spell-ends-on-capital-influx/",
    "description": "Crypto has been increasingly getting attention in the market as investors strive to increase their investment portfolios. The past 3 months have seen an active influx of capital inflow that has changed the supply of top stablecoins, which have recorded a positive flip, indicating a potential bull run for the digital market.&#160; Digital currencies have ... <a title=\"Crypto&#8217;s 17-month dry spell ends with surging capital influx\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptos-17m-dry-spell-ends-on-capital-influx/\" aria-label=\"More on Crypto&#8217;s 17-month dry spell ends with surging capital influx\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T16:53:31.000Z",
    "title": "JPMorgan partners with wealth managers and blockchain operators for proof-of-concept initiative",
    "url": "https://crypto.news/jpmorgan-partners-with-wealth-managers-and-blockchain-operators-for-proof-of-concept-initiative/",
    "description": "JPMorgan’s bank’s digital asset division, Onyx, spearheads a collaborative effort focused on blockchain interoperability use cases for portfolio management."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T16:46:47.000Z",
    "title": "K33 Research finds institutional Bitcoin investment surge amid pending ETF decisions",
    "url": "https://crypto.news/k33-research-finds-institutional-bitcoin-investment-surge-amid-pending-etf-decisions/",
    "description": "A recent K33 Research report indicates a significant uptick in institutional investment in Bitcoin through exchange-traded products, coinciding with key deadlines for the SEC's decision on bitcoin spot ETFs, presenting a complex landscape of market optimism and caution."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T17:00:11.000Z",
    "title": "‘Vitalik Slept On My Couch & Copied My Inventions’ Ethereum Insider Says",
    "url": "https://www.newsbtc.com/news/ethereum/vitalik-ethereum-insider/",
    "description": "An Ethereum insider has made startling allegations against Ethereum Founder, Vitalik Buterin, stating that the Russian inventor had copied his creations.  Nerayoff Accuses Buterin Of Invention Replication Former Ethereum Advisor, Steven Nerayoff has taken to X (formerly Twitter) to accuse Ethereum Founder, Vitalik Buterin of copying his inventions. Nerayoff criticized the intelligence of the current Ethereum leadership, making contentious remarks about Buterin and co-founder of Ethereum, Joseph Lubin. Related Reading: Solana Institutional Inflows Surge In One Week, Can The Price Reach $100? “Vitalik slept on my couch &#38; copied my inventions. He and SBF are images. They’re not smart because something seems off, something is off. The recording shows his and Joe’s stupidity and ignorance. Hear who understood Ethereum, me or them,” Nerayoff stated.  The former ETH Advisor continued on his tirade of allegations, casting doubts on Buterin’s contributions to the network. He stated that Buterin had never invented anything substantial and that the ETH founder was the sole reason behind the network never scaling.  The accusations also suggested that the only significant achievement in the Ethereum ecosystem was the issuance of utility tokens on ICOs, which Nerayoff claimed he had invented.  Nerayoff also made startling revelations, accusing Buterin and Lubin of deliberately damaging the cryptocurrency by focusing on issuing fraudulent ICOs to unsuspecting investors and potentially harming them.  “Did Vitalik invent anything? No, he did not. Ethereum never scaled bc of him. The only killer app was issuing Utility Tokens on ICOs, both of which I invented. Vitalik &#38; Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people,” Nerayoff stated.  Ethereum Founder’s Scalability Competence Questioned In an X post on Tuesday, Stephen Nerayoff presented thought-provoking questions to the crypto community about Vitalik Buterin’s Ethereum scalability capabilities.  Related Reading: New XRP Ledger Upgrade Goes Live, What’s New? Nerayoff released a video on X by a community member, Mr. Huber which featured Vitalik Buterin describing plans for the ETH Network. He told the crypto community to remember the video when he eventually released evidential recordings of his conversation with Buterin about his ideas for ETH 2.0.  “Remember this video when I drop the recording and what I tell Vitalik about 2.0 and to fix misaligned incentive structures. Is Vitalik the savior they bill him as to make Ethereum scale or is he the reason it never scaled? Decide for yourselves,” Nerayoff stated.  The question raised by the former ETH Advisor has sparked debates and differing opinions about the Ethereum Founders. Although no proper evidence has been presented regarding the accusations laid against Buterin, the crypto community continues to watch and analyze the situation as it unfolds.  ETH bulls reclaim $2,000 &#124; Source: ETHUSD on Tradingview.com Featured image from CryptoSlate, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T17:05:54.000Z",
    "title": "Bitcoin and Altcoins in a Downturn: Understanding the Significant Correction Despite Positive Inflation Data",
    "url": "https://www.crypto-news-flash.com/bitcoin-and-altcoins-in-a-downturn-understanding-the-significant-correction-despite-positive-inflation-data/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-and-altcoins-in-a-downturn-understanding-the-significant-correction-despite-positive-inflation-data",
    "description": "<img width=\"1280\" height=\"997\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/cryptocurrency-3409723_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/cryptocurrency-3409723_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/cryptocurrency-3409723_1280-300x234.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/cryptocurrency-3409723_1280-1024x798.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/cryptocurrency-3409723_1280-768x598.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />After a successful rally that saw Bitcoin (BTC) and a number of top altcoins set a new year high, prices have seemingly stalled. The Bureau of Labor Statistics released the latest inflation figures leading to a price dip as crypto investors get increasingly bearish in local supports. In recent days, the crypto market has taken [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T16:57:00.000Z",
    "title": "SHIB Breaks Key Trendline and Could Rally 2X by Mid-December",
    "url": "https://coinedition.com/shib-breaks-key-trendline-and-could-rally-2x-by-mid-december/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SHIB Breaks Key Trendline and Could Rally 2X by Mid-December\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/SHIB-Over-PEPE-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Captain Faibik, a famous Bitcoin and crypto analyst on X, has observed a crucial signal on SHIB, the native coin of the Shiba Inu ecosystem. In a recent post, Faibik used the SHIB/USDT 3-day chart to show that SHIB has broken above a significant trendline in a bullish trajectory. At the time of Faibik’s post, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/shib-breaks-key-trendline-and-could-rally-2x-by-mid-december/\">SHIB Breaks Key Trendline and Could Rally 2X by Mid-December</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-11-15T16:59:31.000Z",
    "title": "Judge Finalizes Dismissal of Meritless Lawsuit Against Tether and Bitfinex, Plaintiff Drops Appeal",
    "url": "https://blog.bitfinex.com/announcements/judge-finalizes-dismissal-of-meritless-lawsuit-against-tether-and-bitfinex-plaintiff-drops-appeal/",
    "description": "<p>Following the order of Chief Judge Laura Taylor Swain of the U.S. District Court for the Southern District of New York denying Shawn Dolifka’s motion for leave to amend his meritless class action complaint filed against Tether and Bitfinex companies, Dolifka elected not to appeal...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/announcements/judge-finalizes-dismissal-of-meritless-lawsuit-against-tether-and-bitfinex-plaintiff-drops-appeal/\">Judge Finalizes Dismissal of Meritless Lawsuit Against Tether and Bitfinex, Plaintiff Drops Appeal</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]