[
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T04:14:35.000Z",
    "title": " South Korea proposes ban on credit card payments for cryptocurrencies ",
    "url": "https://cointelegraph.com/news/south-korea-proposes-ban-on-credit-card-payments-for-cryptocurrencies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZmM2NjllZGMtNzZiNC00NDVkLWE2NzgtYjg3N2JmYjhjYjk1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>South Korea’s financial regulator is concerned about illegal outflows and money laundering risks from citizens using credit cards to buy crypto from overseas exchanges.</p>\n                    <p><p>South Korea’s top financial regulator has proposed changing the country’s credit finance laws to prohibit local citizens from purchasing cryptocurrency with credit cards.</p><p>In a Jan. 3 legislative notice, the country’s Financial Services Commission <a href=\"https://www.fsc.go.kr/po040301/view?noticeId=3954&amp;curPage=&amp;srchKey=&amp;srchText=&amp;srchBeginDt=&amp;srchEndDt=\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> concerns about illegal outflows and money laundering that could come with South Korean citizens buying cryptocurrency from foreign exchanges.</p><p>“Concerns have been raised about illegal outflow of domestic funds overseas due to card payments on overseas virtual asset exchanges, money laundering, speculation, and encouragement of speculative activities,” the FSC stated.</p><p><a href=\"https://cointelegraph.com/news/south-korea-proposes-ban-on-credit-card-payments-for-cryptocurrencies\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T04:22:30.000Z",
    "title": "Ethereum Price Recovers Ground But Upsides Might Be Limited Above $2,300",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-recovers-2300/",
    "description": "Ethereum price tumbled and spiked below $2,000 on Kraken. ETH is now recovering above the $2,200 level, but the bears might be active near $2,300. Ethereum started a major decline and dived below the $2,200 support. The price is trading below $2,300 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $2,300 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to rise if there is a clear move above $2,290 and $2,300. Ethereum Price Nosedives Ethereum price struggled to settle above the $2,400 resistance zone. ETH also started a major decline like Bitcoin and broke the $2,200 support zone. There was a sharp decline and the price even spiked below the $2,000 support zone. A new yearly low was formed near $1,860 and the price is now recovering losses. There was a decent increase above the $2,000 and $2,080 resistance levels. The price climbed above the 50% Fib retracement level of the downward move from the $2,430 swing high to the $1,860 low. However, Ethereum is still below $2,300 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,290 level. The first major resistance is now near $2,300. There is also a connecting bearish trend line forming with resistance near $2,300 on the hourly chart of ETH/USD. The trend line is close to the 76.4% Fib retracement level of the downward move from the $2,430 swing high to the $1,860 low. Source: ETHUSD on TradingView.com A close above the $2,300 resistance could send the price toward $2,400. The next key resistance is near $2,440. If there is a clear move above $2,400, there could be a drift toward $2,500. The next resistance sits at $2,500, above which Ethereum might rally and test the $2,620 zone. Fresh Decline in ETH? If Ethereum fails to clear the $2,300 resistance, it could start a fresh decline. Initial support on the downside is near the $2,200 level. The first key support could be the $2,080 zone. A downside break and a close below $2,080 might start another steady decline. In the stated case, Ether could test the $2,000 support. Any more losses might send the price toward the $1,860 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is regaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,180 Major Resistance Level – $2,300"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-04T04:38:06.000Z",
    "title": "Why a $100,000 Bitcoin Might Disappoint Lyn Alden in the Next Bull Market",
    "url": "https://www.crypto-news-flash.com/why-a-100000-bitcoin-might-disappoint-lyn-alden-in-the-next-bull-market/?utm_source=rss&utm_medium=rss&utm_campaign=why-a-100000-bitcoin-might-disappoint-lyn-alden-in-the-next-bull-market",
    "description": "<img width=\"1200\" height=\"1697\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-gray-logo-on-city-over-the-ocean.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lyn Alden prediction\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Crypto expert Lyn Alden predicts Bitcoin could reach over $100,000, aiming for $200,000 in the next two years. Liquidity and Bitcoin&#8217;s cycles are closely linked, but liquidity doesn&#8217;t precisely indicate Bitcoin&#8217;s price levels. Cryptocurrency experts and analysts have recently voiced their opinions on the future price trajectory of Bitcoin (BTC), offering diverse perspectives on what [...]"
  }
]