[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-11T14:00:48.000Z",
    "title": "Economist Jim Rickards Predicts Unveiling of New BRICS Currency — Says ‘the World Is Unprepared for This Geopolitical Shock Wave’",
    "url": "https://news.bitcoin.com/economist-jim-rickards-predicts-unveiling-of-new-brics-currency-says-the-world-is-unprepared-for-this-geopolitical-shock-wave/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Economist Jim Rickards Predicts Unveiling of New BRICS Currency — Says &#039;the World Is Unprepared for This Geopolitical Shock Wave&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jim-rickards-brics-currency.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Jim Rickards, an economist and the author of “Currency Wars,” has predicted the unveiling of a new BRICS currency, stating that it “could weaken the role of the dollar in global payments and ultimately displace the U.S. dollar as the leading payment currency and reserve currency.” Emphasizing that &#8220;The process by which this will happen [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-11T13:56:39.000Z",
    "title": "Debate persists: Should FTX disclose consumer names?",
    "url": "https://www.cryptopolitan.com/should-ftx-disclose-consumer-names/",
    "description": "Kevin Cofsky, a partner at Perella Weinberg Partners, testified in the ongoing discussion around the revelation of user names at the now-defunct crypto exchange FTX, arguing that doing so would impede efforts to retrieve assets and reduce value. Despite media organizations&#8217; calls for public disclosure, top creditors have preferred anonymity. Sam Bankman-Fried, the CEO of ... <a title=\"Debate persists: Should FTX disclose consumer names?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/should-ftx-disclose-consumer-names/\" aria-label=\"More on Debate persists: Should FTX disclose consumer names?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-11T14:00:00.000Z",
    "title": "InQubeta is among 3 AI crypto projects investors can explore in 2023",
    "url": "https://crypto.news/inqubeta-is-among-3-ai-crypto-projects-investors-can-explore-in-2023/",
    "description": "InQubeta, the graph (GRT) and numeraire (NMR) are AI-based projects that merit examination in 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-11T13:48:20.000Z",
    "title": "MATIC Faces Long-Term Struggle For Growth As SEC Claims It’s A Security",
    "url": "https://www.newsbtc.com/news/matic-faces-long-term-struggle/",
    "description": "MATIC is currently facing increased uncertainty as it has been officially classified as a security by the US Securities and Exchange Commission, as revealed in the recent filing against Binance. Consequently, the Polygon blockchain token experienced a significant drop of 31% within a week, setting a new record. However, there is some positive news as it has managed to recover, witnessing a promising rebound of over 11% in the last 24 hours. Related Reading: Bleak Dogecoin (DOGE) Social Sentiment Raises Questions About Price Reversal Source: Coingecko L2 coins will be the next bullrun coins. Already knew, already confirmed.$SOL $ADA $MATIC and others L1&#8217;s got the security stamp. Regulation will kick hard = tight choice of L1/L2 coins. Where will all this money flow to? pic.twitter.com/jw5xpLRA4j — Zoomer Oracle (@ZoomerOracle) June 5, 2023 MATIC is one of the 13 tokens within the Binance lawsuit to be designated as a security. Polygon Labs, the developer of MATIC, issued a statement on Twitter defending Polygon saying that the network is “developed outside the US, deployed outside the US, and focused to this day on the global community that supports the network.” This recent lawsuit against Binance was followed up by the SEC’s lawsuit against Coinbase, citing that the company is operating an unregistered exchange in connection with the company’s staking service. Fear, Uncertainty And Doubt In The Market  With the recent classification of several cryptocurrencies as securities, the market has slid considerably within the past week. Bitcoin, the top cryptocurrency, gained dominance in light of the recent regulatory fillings against Binance and Coinbase. The other tokens in the list are SOL, ADA, FIL, ATOM, SAND, MANA, ALGO, and COTI. According to the lawsuit, the tokens are listed as investment contracts. This made the SEC label them as securities in accordance with the Howey Test, which is a test to know whether a certain asset is a security or not. MATIC market cap at $5.8 billion. Chart: TradingView.com This move by the SEC was in line with its recent actions against the crypto industry. Just this February, the regulatory body cracked down on Kraken’s staking service along with forcing the company to pay $30 million in penalties for the violations. If the mentioned tokens and companies fail to comply with the SEC, it may lead to another Ripple-like event which will affect the market. MATIC Bulls Should Watch This Level At the time of writing, MATIC is being supported at the $0.6 price level which will act as the launch pad for future bullishness. However, external market forces still hold sway in the token’s momentum and price actions in the near future. The recent lawsuits already slashed millions upon millions of possible gains for investors. Source: Coinglass Related Reading: Bearish BNB Signs Hint Downtrend May Persist Beyond Expectations Meanwhile, CoinGlass data shows MATIC long positions being liquidated as the market crashed after the lawsuits were made public. Despite this, buying pressure after the crash continued with MATIC bulls holding $0.6 support. If they can hold on to this support level, we might be able to see a return towards the $0.83 support in the medium to long term. Featured image from The Daily Hodl"
  }
]