[
  {
    "source": "CoinDesk",
    "date": "2023-08-25T13:51:17.000Z",
    "title": "Celsius Token Holders Lose Bid to Hike CEL Valuation",
    "url": "https://www.coindesk.com/policy/2023/08/25/celsius-token-holders-lose-bid-to-hike-cel-valuation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Creditors of the bankrupt crypto lender argue it should be valued at $0.80, its nominal price when the company collapsed, despite allegations of market manipulation"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T13:43:04.000Z",
    "title": "PEPE whale seizes dip opportunity, buys $529k worth of tokens",
    "url": "https://cointelegraph.com/news/pepe-whale-seizes-dip-opportunity-buys-529k-worth-of-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/79de5021-de5a-4c87-980b-748aa39854ff.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This transaction followed this same whale’s previous transactions on 5 June 2023 where he spent 280 Ethereum (worth $507,000) to acquire 500 billion PEPE.</p>\n                    <p><p>After the value of the frog-themed memecoin Pepe (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>) <a href=\"https://cointelegraph.com/news/pepe-token-plunges-strange-token-transfers-fears-rug-pull\">dropped by approximately 15% </a>due to recent modifications in a multisig wallet and concerns about potential developer manipulation, a significant PEPE holder spent 320 Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) valued at $529,000 to acquire 640 billion PEPE tokens.</p><p>According to an X (formerly known as Twitter) post <a href=\"https://twitter.com/lookonchain/status/1694978987603399103\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> by the on-chain analytics platform, Lookonchain. The post also revealed that the whale purchased the PEPE at an average buying price of $0.000001163.</p><p>Continuing its previous actions, the same whale made another move on Aug. 25, following its earlier transactions. On June 5, 2023, the whale used 280 Ethereum (equivalent to $507,000) to obtain 500 billion PEPE tokens. Furthermore, on May 6 of this year, the whale invested 253 Ethereum (worth $481,000) to acquire 164 billion PEPE tokens.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A whale spent 320 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($529K) to buy 640B <a href=\"https://twitter.com/search?q=%24PEPE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PEPE</a> again 3 hrs ago.<br><br>The whale also spent 280 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($507K) to buy 500B <a href=\"https://twitter.com/search?q=%24PEPE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PEPE</a> on June 5 and spent 253 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($481K) to buy 164B <a href=\"https://twitter.com/search?q=%24PEPE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PEPE</a> on May 6.<br><br>The average buying price is $0.000001163.<a href=\"https://t.co/9zRGywTADp\">https://t.co/9zRGywTADp</a><a href=\"https://t.co/EiUQUrHWqc\">https://t.co/EiUQUrHWqc</a> <a href=\"https://t.co/BjReDraBgv\">pic.twitter.com/BjReDraBgv</a></p>&mdash; Lookonchain (@lookonchain) <a href=\"https://twitter.com/lookonchain/status/1694978987603399103?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Possibly seizing the opportunity presented by PEPE's reduced price after a significant sell-off, this specific whale appears to have <a href=\"https://etherscan.io/token/0x6982508145454ce325ddbe47a25d4ec3d2311933?a=0x2daabb7d7d8114ee334d5a141a97ef181e565e69\" target=\"_blank\" rel=\"noopener nofollow\">acted</a> fast. The meme coin experienced a surge in selling activity, potentially prompting the whale's action. The turmoil centered around adjustments made to a multisig wallet managed by the developers.</p><p>Modifications were applied to this wallet, originally containing $10 million in PEPE value, resulting in a reduction of mandatory transaction signatures. This change, which lowered the necessity from five out of eight signatures to just two, prompted immediate suspicions.</p><p>Changes made to a project's critical financial structure naturally give rise to worries about a potential \"rug pull,\" where developers vanish with investors' funds. Following these developments, the value of the once popular meme coin has plunged by more than 20% within the past 24 hours alone.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/is-the-25-drop-in-pepe-shib-and-ape-a-sign-of-a-deepening-crypto-bear-market\"><strong><em>Is the 25% drop in PEPE, SHIB and APE a sign of a deepening crypto bear market?</em></strong></a></p><p>As of the time of publication, the <a href=\"https://cointelegraph.com/pepe-price-index\">trading price of PEPE</a> has declined to $0.0000008738, just slightly above its lowest point in the 24-hour span at $0.0000008046. During the same period, the trading volume for PEPE experienced a significant surge of 276.51% compared to the previous day, reaching a remarkable total of $283.05 million.</p><p>Over the last 24 hours, the decrease in PEPE's price further contributed to<a href=\"https://cointelegraph.com/news/pepecoin-pepe-price-action-points-to-a-potential-70-drop\"> its lackluster performance</a> in the previous 30 days. As a result, the meme coin witnessed a decline of over 30% during the month.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T14:00:01.000Z",
    "title": "Trump NFTs sales volume skyrocket by 3,700% following mug shot release",
    "url": "https://cryptoslate.com/trump-nfts-sales-volume-skyrocket-by-3700-following-mug-shot-release/",
    "description": "<p>Former U.S. President Donald Trump&#8217;s NFT collections trading volume spiked by more than 3700% following his surrender to authorities in Georgia on Aug. 24. According to Coingecko data, the former President&#8217;s collection Series 1 and 2 trading volume jumped by roughly 300% and 3,750% in the last 24 hours to 18.89 ETH ($31,429) and 9.88 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/trump-nfts-sales-volume-skyrocket-by-3700-following-mug-shot-release/\">Trump NFTs sales volume skyrocket by 3,700% following mug shot release</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T13:45:24.000Z",
    "title": "\n                        Ark Invest, 21Shares Throw Their Hat In ETH Futures ETF Ring\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/ark-invest-21shares-throw-their-hat-in-eth-futures-etf-ring",
    "description": "\n                        <p dir=\"ltr\">According to a recent filing with the U.S. Securities and Exchange Commission (SEC), Ark Invest and 21Shares are teaming up to apply for an Ethereum Futures Exchange Traded Fund (ETF).</p>\nCrypto Players Team Up For ETF\n<p dir=\"ltr\">In a significant move, prominent players in the race for a bitcoin ETF have turned their attention to the realm of ether futures contracts. Ark Invest and 21Shares, considered strong contenders in the ETF space, have unveiled their involvement in the proposed ARK 21Shares Active Ethereum Futures ETF (ARKZ) and the ARK 21Shares Active Bitcoin Ethereum Strategy ETF (ARKY), as per a recent filing.</p>\n<p dir=\"ltr\">Both ARKZ and ARKY are set to have Ark Invest and 21Shares listed as sub-advisers. Empowered Funds, an affiliate of Alpha Architect, a white-label ETF platform, will orchestrate the funds themselves.&nbsp;</p>\n<p dir=\"ltr\">Notably, ARKZ is designed to allocate a minimum of 25% of its assets to cash-settled ether futures contracts, mirroring the offerings on the Chicago Mercantile Exchange (CME). This allocation may also encompass US Treasury securities, money market instruments, and repurchase agreements.</p>\nWill the SEC Approve?\n<p dir=\"ltr\">Recently, multiple issuers have submitted filings for similar funds, aligning with the trend. In a surprisingly positive turn of events, insiders close to the SEC&nbsp; have indicated that the regulatory body will not be obstructing Ether futures ETFs. This is a marked departure from the SEC's historically cautious stance.&nbsp;</p>\n<p dir=\"ltr\">Although the specific funds that will receive approval remain uncertain, this news has spurred leading entities like Ark Invest and 21Shares to capitalize on the emerging trend.&nbsp;</p>\n<p dir=\"ltr\">The SEC has recently disclosed its intention to \"institute proceedings\" to assess the approval or denial of the ARK 21Shares Bitcoin ETF.</p>\nPast Endeavors and Current Plans\n<p dir=\"ltr\">The two firms are no strangers to collaboration. Their initial partnership was forged to introduce a spot bitcoin ETF in 2021. Despite facing initial setbacks with the SEC blocking their first two attempts, the companies have persisted. Their most recent attempt was re-filed in April, coinciding with BlackRock's announcement of its own Bitcoin ETF plans. This development triggered a resurgence of interest among other fund issuers.</p>\n<p dir=\"ltr\">While ARKZ is focused on ether futures, ARKY takes a more diversified approach. It plans to invest in both bitcoin futures and ether futures contracts in addition to its own planned ETFs holding such contracts. This strategic move highlights the growing interest in leading cryptocurrencies and their associated derivatives.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T14:00:51.000Z",
    "title": "Crypto Collapse: Prime Trust’s Fall From Grace and the Disappearing Wallet Mystery",
    "url": "https://news.bitcoin.com/crypto-collapse-prime-trusts-fall-from-grace-and-the-disappearing-wallet-mystery/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Collapse: Prime Trust&#039;s Fall From Grace and the Disappearing Wallet Mystery\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ptrust.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After Prime Trust filed for bankruptcy protection, the company’s interim CEO Jor Law cited excessive spending, losses on the stablecoin terrausd, and problems accessing customer funds held in cold storage wallets as contributing factors. From Cold Storage to Cold Reality: The Dramatic Decline of Prime Trust In a declaration filed along with the bankruptcy petition [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T13:55:51.000Z",
    "title": "MasterCard Axes Partnership With Binance Amid Regulatory Pressures",
    "url": "https://www.newsbtc.com/binance/mastercard-axes-binance/",
    "description": "The crypto space is in pandemonium after MasterCard, a global payment service giant, announced the imminent termination of its services and alliance with the Binance crypto exchange.   Mastercard To Sever All Ties To Binance Binance, the world’s largest cryptocurrency exchange by trading volume, is facing new challenges that could impact its reputation and growth rate. According to reports, Mastercard will discontinue its services on Binance, ending a years-old relationship and crypto cards programs starting Friday, September 22.  Related Reading: Is Binance Really Selling Bitcoin To Prop The Price Of BNB? The reason for the abrupt termination has not been clarified by Mastercard. Some have attributed the news to the recent regulatory challenges and lawsuits Binance has been up against since this year.  Binance has refrained from making any comments regarding the reason for the suspension or who initiated the decision first. However, the crypto exchange has reassured users around the globe, stating that their Binance accounts are not affected by the news and they can continue their crypto transactions per usual.  “Binance accounts around the world are not affected. Where available, users can also shop with crypto and send crypto using Binance Pay, a contactless, borderless, and secure cryptocurrency payment technology designed by Binance,” Binance stated. Mastercard and Binance have been working together as partners for about four years. Around August 2022, they both joined hands to initiate debit card programs for four major countries, allowing users in Brazil, Argentina, Colombia, and Bahrain to have access to cryptocurrency assets via their Mastercards linked to a cryptocurrency wallet.  Binance first partnered with Mastercard to launch crypto card payments in Brazil and Latin America at the beginning of 2023. The crypto exchange then made a similar announcement and launched prepaid crypto cards in Argentina in August 2022.  BNB price struggles amid regulatory pressures &#124; Source: BNBUSD on Tradingview.com Financial Service Companies Break Away Following SEC Lawsuit Binance has been in a legal battle with the United States Securities and Exchange Commission (SEC) since June when the SEC sued the crypto exchange for allegedly offering unregistered securities. The regulator further attempted to freeze all Binance assets stating that the crypto exchange was operating a “web of deception” and filing 13 charges against Binance.  Since then, Binance has been facing regulatory hurdles and industry challenges with many companies ending year-long partnerships and the price of BNB declining as a result.  The cryptocurrency exchange has also ended several projects in the course of a month and carried out massive layoffs following the SEC’s Lawsuits.  Related Reading: Cathie Wood’s ARK Invest Joins Ethereum Futures ETF Race After Spot Bitcoin ETF Delay Recently, Binance shut down all cryptocurrency service operations on its official fiat-to-cryptocurrency payments provider, Binance Connect. The cryptocurrency exchange also discontinued its partnership with Checkout.com, a global payment service, after Checkout’s CEO terminated its contract this month.   Visa, another payment service giant, also cut ties with Binance in July and stopped supplying co-branded cards with Binance in Europe.  At the moment, it is unsure what the outcome of the SEC and Binance case would be. However, the results will undoubtedly impact the crypto industry and financial sector. Featured image from CoinCu, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T14:00:55.000Z",
    "title": "Pepe coin (PEPE) Continuous Price Rise Still a Long Distance Away from Pikamoon (PIKA) 100x Disruptive Profit Potential",
    "url": "https://www.crypto-news-flash.com/pepe-coin-pepe-continuous-price-rise-still-a-long-distance-away-from-pikamoon-pika-100x-disruptive-profit-potential/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It seems like the crypto market is once again experiencing the meme coin season, as evidenced by the recent impressive price surges and returns seen in coins like Pepe coin. Despite this ongoing trend, seasoned analysts have taken a closer look beyond the surface and identified a competing meme coin poised to offer an astounding [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T13:59:09.000Z",
    "title": "XRP Price Poised for Rebound: South Korean Traders and SEC Lawsuit Propel Interest",
    "url": "https://www.crypto-news-flash.com/xrp-price-poised-for-rebound-south-korean-traders-and-sec-lawsuit-propel-interest/",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Of lately, crypto investors from South Korea have been showing growing interest in XRP, especially from Gen Z. XRP&#8217;s price is encountering resistance at $0.5752; a successful breach of this barrier could propel the altcoin towards its August peak of $0.6840. After crashing down to a low of $0.47 last week, Ripple&#8217;s native cryptocurrency XRP [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T13:56:35.000Z",
    "title": "Massive Shiba Inu Accumulation: New Wallet Holds 1.15 Trillion SHIB Exclusively",
    "url": "https://www.crypto-news-flash.com/massive-shiba-inu-accumulation-new-wallet-holds-1-15-trillion-shib-exclusively/",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Data from Etherscan.io shows that a new wallet has purchased $9.37 million worth of Shiba Inu tokens, making it the 52nd largest SHIB holder in the world. This comes after it was reported that a whale had purchased $5 million worth of SHIB from crypto exchange Gemini.  A new Shiba Inu whale has grabbed headlines [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T14:05:07.000Z",
    "title": "Gate Token (GT) Price Prediction 2023-2030: Will GT Price Reach $10 Soon?",
    "url": "https://coinedition.com/gate-token-gt-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Gate-Token-(GT)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Gate-Token-GT-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>GateChain was formed with the aim of solving “interesting and complex” problems that emerged alongside blockchains. Moreover, GateChain promised to maintain the decentralized aspects or advantages during its mission. Looking at its ecosystem, GateChain consists of the GateChain mainnet, GateChain DEX, GT, wallets, and more. GateToken is the native currency of GateChain’s ecosystem and plays [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/gate-token-gt-price-prediction/\">Gate Token (GT) Price Prediction 2023-2030: Will GT Price Reach $10 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T13:55:00.000Z",
    "title": "Binance Sinks Into More Troubled Waters With Bitcoin Reserve Declines",
    "url": "https://coinedition.com/binance-sinks-into-more-troubled-waters-with-bitcoin-reserve-declines/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/U_S_subpoenas_hedge_funds_in_probe_of_crypto_exchange_Binance-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance, the largest crypto exchange in the world, has seen its bitcoin reserve drop to almost 16% raising investors&#8217; and customers’ fears as to a possible bank run. According to Julio Moreno, head of research at CryptoQuant, a drop below 16% would be the lowest ever recorded from the crypto exchange. The analyst referred to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-sinks-into-more-troubled-waters-with-bitcoin-reserve-declines/\">Binance Sinks Into More Troubled Waters With Bitcoin Reserve Declines</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T13:40:08.000Z",
    "title": "Komodo (KMD) Price Prediction 2023-2030: Will KMD Price Hit $ 0.7 Soon?",
    "url": "https://coinedition.com/komodo-kmd-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Komodo-(KMD)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Komodo-KMD-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Komodo (KMD)? Komodo is an open-source technology provider that provides the infrastructure and tools for the new decentralized financial system. With Komodo, anyone has the capability of launching a branded decentralized exchange, cross-protocol financial applications, and independent blockchains.&#160;&#160; The project’s flagship end-user application is Komodo Wallet (formerly AtomicDEX). It is a non-custodial multi-coin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/komodo-kmd-price-prediction/\">Komodo (KMD) Price Prediction 2023-2030: Will KMD Price Hit $ 0.7 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]