[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-11T15:01:11.000Z",
    "title": "Crypto Analyst Benjamin Cowen Warns of Potential Upcoming Price Crashes for Ethereum and Cardano",
    "url": "https://www.cryptoglobe.com/latest/2023/09/crypto-analyst-benjamin-cowen-warns-of-potential-upcoming-price-crashes-for-ethereum-and-cardano/",
    "description": "In a recent YouTube video, Benjamin Cowen, a well-known crypto analyst, shared his thoughts on the future price movements of Ethereum. Cowen suggested that the cryptocurrency might not only experience a lower low but could potentially see its price fall below $800. He mentioned that while the decline might not be drastic, Ethereum could even […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-11T14:42:52.000Z",
    "title": "Gateway.fm Launches Presto to Abstract Complexity of Blockchain Infrastructure",
    "url": "https://cryptodaily.co.uk/2023/09/gatewayfm-launches-presto-to-abstract-complexity-of-blockchain-infrastructure",
    "description": "Gateway.fm, the first truly decentralized blockchain infrastructure node provider, has announced the launch of Presto, its Zero-knowledge-based Web3 platform-as-a-service, geared towards greatly simplifying the implementation of Zero-knowledge roll-ups"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-11T14:55:29.000Z",
    "title": "ZachXBT accuses four crypto influencers of market manipulation",
    "url": "https://crypto.news/zachxbt-accuses-four-crypto-influencers-of-market-manipulation/",
    "description": "Blockchain analyst ZachXBT accused crypto influencers TraderSZ, Trader_XO, TraderNJ1, and PetaByte of scamming. Expert claims that they fraudulently obtained tokens, inflated their price, and sold them. His investigation consists of two parts. In the first one he covers the actions of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-11T14:51:39.000Z",
    "title": "Teenage crypto hacker to return $5.2m and forfeited sports car",
    "url": "https://crypto.news/teenage-crypto-hacker-to-return-5-2m-and-forfeited-sports-car/",
    "description": "US judge sentenced a teenage crypto hacker to return stolen BTC worth nearly $5.2 million and a sports car he bought with the illicit funds. The hacker, identified as Wagaafe Hared, is a teenager from Arizona who was part of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-11T14:40:38.000Z",
    "title": "France introduces new certificate for crypto influencers",
    "url": "https://crypto.news/france-introduces-new-certificate-for-crypto-influencers/",
    "description": "The Autorité des Marchés Financiers says the initiative should help professionalize commercial influence. France&#8217;s financial regulator, the Autorité des Marchés Financiers (AMF), has revealed a new online general training course to grant legitimate influencers a certificate. In a press release,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T15:00:39.000Z",
    "title": "Lost In Transaction: Bitcoin User Overpaid By $500,000 For A $200 Deal",
    "url": "https://www.newsbtc.com/bitcoin-news/lost-in-transaction-bitcoin-user-overpaid-by-500000-for-a-200-deal/",
    "description": "In times of high congestion, Bitcoin users sending transactions on the network pay high fees to be included in the next block. These fees can reach hundreds of dollars depending on the transaction size, but a user might have broken the record. Related Reading: Pro-XRP Lawyer John Deaton Reveals The Countries Topping The 75,000 Holder List 20 Bitcoin To Move $200, What Happened? Data from the analytics platform mempool.space, a user paid over $500,000 or 20 Bitcoin to transfer around $200. The chart below shows that the transaction fee has almost reached 200 million satoshis (sats). Jameson Lopp, co-founder and CTO at CASA speculated about the transaction and why a single entity would pay such a high fee to send a small amount of money. Lopp stated: The transaction that paid nearly 20 BTC ($500,000) fee a few hours ago looks like an exchange or payment processor with buggy software. They&#8217;ve received 60,000+ txns and sent 60,000+ txns from the same address (bad practice) and likely calculated their change output incorrectly. In addition, CASA’S CTO stated that the transaction came from a “hot wallet,” a Bitcoin address connected to the internet, with the characteristics of those used by crypto exchanges and other enterprises. Lopp added: It looks like it only receives deposits from one address to top up its balance every now and then. Spending pattern is one long peel chain! As of this writing, the crypto exchange or company that owns this Bitcoin wallet seems unaware of its bug. The entity still holds over $10 million or 421 BTC on the hot wallet. Moreover, the entity that paid $500,000 to move $200 seems active. The hot wallet records over 61,000 transactions, many occurring in the past hour alone, since its inception in late June 2023. As Lopp noted, the address operates solely as a withdrawal hot wallet. The executive concluded that the transactions recorded by the wallet seem automated and probably the result of software created by a new entity in the crypto space. Lopp said: “Looks like they haven&#8217;t noticed; they still have a ton of funds in the wallet and it&#8217;s still sending transactions.” Related Reading: Bitcoin Price Confirms Double Top, How Low Can BTC Drop? As of this writing, Bitcoin (BTC) trades at $25,700 with sideways movement across the board. Cover image from Unsplash, chart from Tradingview"
  }
]