[
  {
    "source": "CryptoSlate",
    "date": "2023-11-03T23:00:43.000Z",
    "title": "Valkyrie CIO anticipates spot Bitcoin ETF approval as early as the end of November",
    "url": "https://cryptoslate.com/valkyrie-cio-anticipates-spot-bitcoin-etf-approval-as-early-as-end-of-november/",
    "description": "<p>Valkyrie Chief Investment Officer (CIO) Steven McClurg told ETF.com on Nov. 2 that regulators could approve a spot Bitcoin ETF by the end of the month. McClurg said that he expects the U.S. Securities and Exchange Commission (SEC) to send a second request for comments to various spot Bitcoin ETF applicants in the coming weeks. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/valkyrie-cio-anticipates-spot-bitcoin-etf-approval-as-early-as-end-of-november/\">Valkyrie CIO anticipates spot Bitcoin ETF approval as early as the end of November</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-03T23:00:56.000Z",
    "title": "ETH Sent To Exchanges Climbs Above 500,000, Is Ethereum At $2,000 Still Possible?",
    "url": "https://www.newsbtc.com/news/ethereum/eth-500000-ethereum-2000/",
    "description": "A massive amount of ETH has made its way to centralized exchanges, increasing the Ethereum balances of these exchanges. Given the implications of exchange inflows, it could be a barrier to the cryptocurrency when it comes to claiming the $2,000 resistance. Investors Send 13,000 ETH To Exchanges Data from IntoTheBlock shows a massive amount of ETH headed toward exchanges as the price rose. The total inflow volume as of October 31 when the price first cleared the $1,800 resistance was at 480,570. However, by the start of November, this number had blown up massively. Related Reading: Bitcoin Ends October On A High Note, What To Expect For BTC Price In November November 1 saw the total ETH flowing into exchanges reaching 774,890, and by this time, the bulls had established their dominance above the $1,800 level. With outflows coming out at just around 630,000 ETH, the netflows come out to approximately 130,000 ETH flowing into exchanges on November 1. This showed a willingness among investors to start taking profit from their holdings. Source: IntoTheBlock As the data tracker shows, the majority of Ethereum investors had moved back into profit after crossing $1,800. Even following the retracement, the total percentage of ETH investors in profit is sitting at 55.40% and it is no surprise that some of these investors would want to secure profit. By November 2, though, there has been a relaxation from investors when it comes to inflows. Data shows that on Thursday, the ETH inflow figures fell to 637,070, although this is still much higher than the previous week’s figures. The exchange net flow is now down to 31,040 ETH as of Thursday. ETH price recovers above $1,800 &#124; Source: ETHUSD on Tradingview.com Ethereum Large Holders Swing Into Action Ethereum has also seen a spike in the number of large transactions being carried out on the network as well as the transaction volume of these large holders. The total number of large transactions sat at 1,900 on October 29. But by November 2, the figure ballooned to 4,320, an over 100% increase in just four days. Related Reading: Cardano Bearish Signal: Dormant ADA Whales Are On The Move The transaction volumes of these whales also saw a rise in an almost similar manner compared to the number of large transactions. Large transaction volumes were at 741,440 ETH on October 29. But on November 2, the volume reached 2.21 million ETH. In dollar figures, large transaction volumes went from $1.33 billion to $4.04 billion. Looking at the bullish and bearish transactions (i.e those who are buying versus those who are selling), there isn’t a large difference bulls still continue to lead in the asset. The 7-day total for bulls came out to a total of 98 bulls compared to 87 bears. But the gap is closing further on a daily basis where IntoTheBlock shows 14 bulls and 12 bears. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Binance, chart from TradingView.com"
  }
]