[
  {
    "source": "CoinDesk",
    "date": "2023-10-05T15:45:00.000Z",
    "title": "Crypto for Advisors: Waiting for the Next Crypto Bull Market?  It’s Already Here. ",
    "url": "https://www.coindesk.com/markets/2023/10/05/crypto-for-advisors-waiting-for-the-next-crypto-bull-market-its-already-here/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Is crypto winter slowly thawing and spring upon us? Thanks to Jennnifer Murphy from Runa Digital Assets sharing their perspective on the crypto market and indicators that the bull may be upon us."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T16:00:00.000Z",
    "title": "Macro factors to spark next crypto bull market in Q2 2024, Real Vision's Raoul Pal says",
    "url": "https://cointelegraph.com/news/macro-factors-spark-next-crypto-bull-market-q2-2024-real-vision-raoul-pal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5e4f8a6a-c986-4bb3-9d97-c3e05238df01.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Macro factors will play a dominant role in sparking the next crypto bull market, which should start in Q2 2024, according to Raoul Pal. </p>\n                    <p><p>The next crypto bull market is likely to kick in in Q2 next year when the Bitcoin halving is set to take place, says macro investor and Real Vision CEO Raoul Pal.</p><p>He is convinced that, despite the hype surrounding the halving, macro factors will play the leading role in sparking the next uptrend. </p><p>According to Pal, the Bitcoin halving cycle coincides with the macro cycle, which means every halving so far has taken place in a similar macroeconomic environment: monetary expansion and low interest rates. </p><p>“Macro is actually the dominant factor and the halving is a false narrative, but it doesn't matter because it still works,” Pal said in an interview with Cointelegraph. </p><p>Among the main catalysts favoring crypto next year are central banks cutting interest rates and potential fiscal stimulus that could precede the U.S. presidential election. </p><p>Regarding price targets, Pal wants to avoid making predictions given that “you get beat over the head by people\" for not getting them right. </p><p>Still, looking at past performance, Bitcoin c double or triple its latest all times highs, Pal says.</p><p>To know more about how to prepare for the next crypto bull market, check out our <a href=\"https://youtu.be/MXO1LRqejaM\" target=\"_blank\" rel=\"noopener nofollow\">full interview</a>, and don’t forget to subscribe to our <a href=\"https://www.youtube.com/@cointelegraph\" target=\"_blank\" rel=\"noopener nofollow\">YouTube channel</a> ! </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/MXO1LRqejaM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T15:57:08.000Z",
    "title": "College roommate talked to Sam Bankman-Fried about FTX's $8B hole on a paddle tennis court: Trial",
    "url": "https://cointelegraph.com/news/college-roommate-sam-bankman-fried-ftx-8b-hole",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9fb63bcb-1327-45cc-b814-97401c1092ee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Adam Yedidia, a former developer at FTX, testified regarding his knowledge of the crypto exchange's use of funds, claiming \"Alameda had used customer deposits to pay its loans\".</p>\n                    <p><p>On the third day of the criminal trial for Sam “SBF” Bankman-Fried, the former CEO’s roommate at MIT and FTX developer Adam Yedidia testified about the $8-billion deficit the crypto exchange reported prior to its bankruptcy.</p><p>According to reports from Inner City Press in United States District Court for the Southern District of New York, Yedidia <a href=\"https://twitter.com/innercitypress/status/1709928336959664193\" target=\"_blank\" rel=\"noopener nofollow\">took</a> the stand on Oct. 5 to speak on the connections between the crypto exchange and Alameda Research — one of the key pieces of information at the center of SBF’s alleged fraud. Yedida reportedly informed Bankman-Fried about a bug in FTX’s code which ensured that “Alameda’s liabilities did not decrease”, resulting in a roughly $8 billion error. </p><p>Addressing questions by Assistant U.S. Attorney Danielle Sassoon, Yedidia reportedly said his resignation from FTX followed the revelation that \"Alameda had used customer deposits to pay its loans\". He also claimed Bankman-Fried asked him to speak on the matter of FTX’s code via the messaging app Signal:</p><blockquote>“He told me to use Signal. He told the entire company. It also had auto-delete [...] He said it [auto-delete] was all down-side to keep messages around. If regulators found things they didn't like, it could be bad for the company.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Subscribe to our ‘1 Minute Letter’ NOW for daily deep-dives straight to your inbox! ⚖️ Be the first to know every twist and turn in the Sam Bankman-Fried case! Subscribe now: <a href=\"https://t.co/jQOIYUv6IW\">https://t.co/jQOIYUv6IW</a>  <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://t.co/gp7zJu5sgy\">pic.twitter.com/gp7zJu5sgy</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709911708049772942?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>SBF’s former roommate later reportedly confronted him near a “paddle tennis court” in The Bahamas regarding the $8-billion hole, at which the then CEO offered reassurances over the situation. Sassoon’s line of questioning also included Yedidia’s knowledge of Bankman-Fried’s personal relationship with former Alameda Research CEO Caroline Ellison: </p><blockquote>“He [SBF] said they had had sex and asked me if I thought they should date [...] I said no.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-jets-forfeiture\"><strong><em>Sam Bankman-Fried’s jets are subject to forfeiture, says prosecution</em></strong></a></p><p>Ellison is expected to testify against Bankman-Fried as part of her plea agreement with prosecutors. The judge overseeing the criminal trial, Lewis Kaplan, <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">revoked SBF’s bail</a> in August arguments from the prosecution that he had engaged in witness intimidation against Ellison and others by revealing some of her personal journals to New York Times reporters. </p><p>Bankman-Fried’s first criminal trial kicked off on Oct. 3 with jury selection and is expected to run through November. Gary Wang, one of the co-founders of FTX, will likely testify after Yedidia. Prosecutors said they <a href=\"https://cointelegraph.com/news/ftx-execs-witnesses-sam-bankman-fried-criminal-trial\">may also call</a> on former FTX engineering director Nishad Singh and former FTX chief operating officer Constance Wang.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-05T16:00:34.000Z",
    "title": "Spotlight on Ripple’s Elite: Unveiling the Top 10 XRP Wallets ",
    "url": "https://news.bitcoin.com/spotlight-on-ripples-elite-unveiling-the-top-10-xrp-wallets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/xrp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In September, our newsroom unveiled a series spotlighting the premier ten wallets from platforms such as Bitcoin, Ethereum, and the stablecoin project Tether. Here&#x2019;s an in-depth glance at the elite ten XRP wallets highlighted in XRP&#x2019;s rich list of prominent addresses. The Top 10 XRP Wallets On October 5, 2023, the digital currency XRP held [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T16:02:47.000Z",
    "title": "Everlodge (ELDG) Defies Bear Market Norms with a Skyrocketing Surge, Monero (XMR) and Aave (AAVE) Under Pressure",
    "url": "https://www.cryptopolitan.com/everlodge-eldg-defies-bear-market-norms-with-a-skyrocketing-surge-monero-xmr-and-aave-aave-under-pressure/",
    "description": "This article delves into the current market dynamics of well-established tokens like Monero (XMR), Aave (AAVE), and the emerging Everlodge (ELDG). On the one hand, Monero is in a consolidation phase while Aave succumbs to bearish pressure. On the other hand, Everlodge, the novel project at the convergence of blockchain and real estate, skyrocketed. Summary ... <a title=\"Everlodge (ELDG) Defies Bear Market Norms with a Skyrocketing Surge, Monero (XMR) and Aave (AAVE) Under Pressure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/everlodge-eldg-defies-bear-market-norms-with-a-skyrocketing-surge-monero-xmr-and-aave-aave-under-pressure/\" aria-label=\"More on Everlodge (ELDG) Defies Bear Market Norms with a Skyrocketing Surge, Monero (XMR) and Aave (AAVE) Under Pressure\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T16:02:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T15:45:34.000Z",
    "title": "AI Code Generation: Striking the Balance Between Quality and Practicality",
    "url": "https://www.cryptopolitan.com/ai-code-generation-striking-the-balance-between-quality-and-practicality/",
    "description": "In a thought-provoking discussion at NDC Oslo, Luise Freese and Iona Varga delved into the practical dilemmas surrounding the use of artificial intelligence (AI) models, particularly in the context of code generation. While AI has made significant strides in mimicking human intelligence, Freese and Varga emphasized the importance of striking a balance between practicality and ... <a title=\"AI Code Generation: Striking the Balance Between Quality and Practicality\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-code-generation-striking-the-balance-between-quality-and-practicality/\" aria-label=\"More on AI Code Generation: Striking the Balance Between Quality and Practicality\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-05T15:49:20.000Z",
    "title": "Dogecoin’s dog statue to be installed in Japan at beginning of November",
    "url": "https://crypto.news/dogecoins-dog-statue-to-be-installed-in-japan-at-beginning-of-november/",
    "description": "A monumental statue of Kabosu, the Shiba Inu dog behind the Doge meme, is set to be installed in Sakura City, Japan in early November thanks to a crowdfunding effort by Dogecoin supporters."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T16:00:14.000Z",
    "title": "XRP, Polygon See Month-High Volumes As Investors Show FOMO",
    "url": "https://www.newsbtc.com/xrp-news/xrp-polygon-high-volumes-investors-fomo/",
    "description": "On-chain data shows the trading volumes of XRP and Polygon have hit monthly highs as investors are displaying FOMO towards the assets. XRP, Polygon See Volume Spike Similar To Bitcoin&#8217;s Surge A Few Days Back According to data from the on-chain analytics firm Santiment, XRP &#38; MATIC have seen high volumes recently. The &#8220;trading volume&#8221; here refers to the total amount of any cryptocurrency that&#8217;s being transacted on the different exchanges in the sector every day. When the value of this metric is high, it means that the asset in question is being moved around a lot on the exchanges. Such a trend implies that traders are actively participating in the market right now. On the other hand, low values suggest the interest in the cryptocurrency may be low at the moment as not much trading activity related to it is happening on the platforms. Related Reading: Here’s The Level Bitcoin Must Conquer If Rally Has To Return Now, here is a chart that shows the trend in this indicator for XRP, Polygon, and Bitcoin over the past month or so: Looks like the value of the metric has been quite high in recent days &#124; Source: Santiment on X As displayed in the above graph, the Bitcoin trading volume had become pretty high a few days back when the asset&#8217;s price had surged toward the $28,500 mark. This spike in the volume had come with a delay, however, as its peak had occurred after the cryptocurrency had already started on its pullback. This could be a sign that once investors saw the rally, they felt like they had to FOMO in, so they quickly made some trades, but many of these investors had arrived late to the scene, hence why the spike had come later. The volume would have also been fueled by the panic sellers who bought at the top but sold as soon as they saw that the rally was already starting to cool down. During the past couple of days, XRP and Polygon have also seen some recovery surges (although the rises haven&#8217;t been anything too impressive) and the trading volume has also shown similar spikes for these cryptocurrencies as well. At the peak of this latest surge, the volume of these cryptocurrencies had managed to hit its highest level in about a month. &#8220;FOMO is high right now,&#8221; notes Santiment. Related Reading: These Are The Altcoins To Keep An Eye On: Santiment It would appear that just like with BTC, investors had started jumping on these cryptocurrencies once they saw the rally. Those falling for FOMO, however, would have once again faced disappointment, as both XRP and MATIC have already retraced their latest recovery attempts. If the trading volume continues to stay high even after the pullback, though, then it would be a positive sign for the prices of these altcoins, as it would mean that there is still significant demand for them at these lower price levels. XRP Price In its latest recovery rally, XRP had managed to rise near the $0.55 mark, but with the pullback since then, the cryptocurrency has dropped toward the $0.52 level. XRP has declined since its rise two days ago &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-05T16:00:48.000Z",
    "title": "Which Meme Coin To Buy Now? Analyzing the Best Meme Coins of 2023 including Shiba Inu, Dogecoin, Pepe Coin, ApeMax, Floki, Shibarium, and Wall Street Memes",
    "url": "https://www.crypto-news-flash.com/which-meme-coin-to-buy-now-analyzing-the-best-meme-coins-of-2023-including-shiba-inu-dogecoin-pepe-coin-apemax-floki-shibarium-and-wall-street-memes/?utm_source=rss&utm_medium=rss&utm_campaign=which-meme-coin-to-buy-now-analyzing-the-best-meme-coins-of-2023-including-shiba-inu-dogecoin-pepe-coin-apemax-floki-shibarium-and-wall-street-memes",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-17.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-17.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-17-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In 2023, the crypto sphere is pulsating with activity, primarily driven by the resurgence of meme coins. Originating with the inception of Dogecoin in 2013, meme coins, characterized by internet meme branding and humor, have evolved significantly. This article dives deep into the intriguing world of meme coins, spotlighting prominent new and old players, including [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-05T16:03:00.000Z",
    "title": "SHIB Burn Rate Soars 75% in 24 Hours: Will Price Ignite or Fizzle Out?",
    "url": "https://coinedition.com/shib-burn-rate-soars-75-in-24-hours-will-price-ignite-or-fizzle-out/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Price Surge For SHIB\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Price-Surge-For-SHIB-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent report, Shiba Inu (SHIB) has seen its burn rate soar by over 75% within 24 hours. Significantly, this means 49 million SHIB tokens are now permanently out of circulation, as confirmed by data from Shibburn. Price Stagnation Amidst Surging Burn Rate However, despite this remarkable burn rate growth, SHIB&#8217;s price remains relatively [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shib-burn-rate-soars-75-in-24-hours-will-price-ignite-or-fizzle-out/\">SHIB Burn Rate Soars 75% in 24 Hours: Will Price Ignite or Fizzle Out?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]